{"word[0]":"human","definition[0]":"belonging to or relating to people, especially as opposed to machines or animals","example[0]":"There are many different cell types in the human body.","example[1]":"the power of the human mind","example[2]":"The desire for joy lies deep within the human spirit.","example[3]":"Infra-red light is invisible to the human eye.","example[4]":"theories of human behaviour","example[5]":"different areas of human experience","example[6]":"respect for the absolute value of human life","example[7]":"The accident was the result of human error.","example[8]":"The meat was declared unfit for human consumption.","definition[1]":"human weaknesses, emotions etc are those that are typical of people","example[9]":"He was also a person with very obvious human failings.","definition[2]":"having the same feelings and emotions as ordinary people","example[10]":"He’s really not so bad. When you get to know him he seems quite human.","collocation[0]":"the human body","example[11]":"The diagram shows all the organs in the human body.","collocation[1]":"the human mind/brain","example[12]":"Distances in space are too great for the human mind to comprehend.","collocation[2]":"the human spirit","example[13]":"Our capacity for forgiveness is a triumph of the human spirit.","collocation[3]":"the human eye","example[14]":"These creatures are too small for the human eye to see.","collocation[4]":"human life","example[15]":"I firmly believe in the sanctity of all human life.","collocation[5]":"human health","example[16]":"Toxic waste is a risk to human health and the environment.","collocation[6]":"human behaviour","example[17]":"We study the aspects of human behaviour that result from our social upbringing.","collocation[7]":"human activity","example[18]":"Our research measured the impact of human activity on this particular eco-system.","collocation[8]":"human relationships","example[19]":"Trust is an essential ingredient in all human relationships.","collocation[9]":"human society","example[20]":"In every human society there is a struggle for power.","collocation[10]":"the human population","example[21]":"The UN estimates that the human population will reach 9.1 billion by 2050.","collocation[11]":"human error","example[22]":"Investigators concluded that the crash was caused by human error.","collocation[12]":"human needs","example[23]":"The islanders meet the universal basic human needs of food and shelter in unexpected ways.","collocation[13]":"human remains","example[24]":"The police found human remains in the basement.","collocation[14]":"for human consumption/habitation","example[25]":"This meat is not fit for human consumption.","definition[3]":"a person","display[0]":"human/human being","example[26]":"The monkeys show no fear of humans.","example[27]":"It was thought that the disease could not be passed to human beings.","display[1]":"the human race","definition[4]":"all the people in the world, considered as one group","example[28]":"War and aggression threaten the future of the whole human race.","display[2]":"humanity","definition[5]":"people in general – used especially when you are talking about people’s rights, or their suffering etc","example[29]":"The general was accused of committing crimes against humanity.","example[30]":"30% of humanity live in conditions of terrible poverty.","display[3]":"mankind/humankind","definition[6]":"people in general – used especially when talking about their history and development. Some people prefer not to use mankind because it sounds like it does not include women","example[31]":"Travelling into space was a great advance for mankind.","example[32]":"The greatest threat to humankind is poverty.","display[4]":"man","definition[7]":"people in general – used especially when you are talking about people compared to nature. Some people prefer not to use man because it sounds like it does not include women","example[33]":"The grandeur of the mountains is a constant reminder of man’s insignificance."}