{"word[0]":"mature","signpost[0]":"sensible","definition[0]":"someone, especially a child or young person, who is mature behaves in a sensible and reasonable way, as you would expect an adult to behave","opposite[0]":"immature","example[0]":"Laura is very mature for her age.","example[1]":"We’re mature enough to disagree on this issue but still respect each other.","signpost[1]":"fully grown","definition[1]":"fully grown and developed","example[2]":"Mature apple trees are typically 20 feet tall.","example[3]":"The new leader wants his country to be seen as a mature democracy.","example[4]":"The human brain isn’t fully mature until about age 25.","example[5]":"Most girls are sexually mature by about 14 years of age.","note[0]":"physically/emotionally/sexually mature","signpost[2]":"wine/cheese etc","definition[2]":"mature cheese, wine etc has a good strong taste which has developed during a long period of time","example[6]":"mature cheddar","signpost[3]":"older","definition[3]":"a polite or humorous way of describing someone who is no longer young","synonym[0]":"middle-aged","example[7]":"wedding fashions for mature brides","example[8]":"a respectable gentleman of mature years","signpost[4]":"novel/painting etc","definition[4]":"a mature piece of work by a writer or an artist is done late in their life and shows a high level of understanding or skill","example[9]":"His mature work reveals a deep sense of enjoyment of nature.","signpost[5]":"financial","definition[5]":"a mature bond or policy is ready to be paid","definition[6]":"to become fully grown or developed","example[10]":"As the fish matures, its colours and patternings change.","example[11]":"She has matured into a fine writer.","note[1]":"mature into","definition[7]":"to become sensible and start to behave sensibly and reasonably, like an adult","example[12]":"He has matured a lot since he left home.","example[13]":"He wants to prove just how much he has matured both as a player and as a man.","definition[8]":"if a financial arrangement such as a bond or an insurance policy matures, it becomes ready to be paid","definition[9]":"if cheese, wine etc matures, or if it is matured, it develops a good strong taste over a period of time","example[14]":"Few beers brewed in Britain are matured in the bottle.","example[15]":"The olives are pulped, then left to mature.","definition[10]":"if a financial arrangement such as a bond or an INSURANCE POLICY matures, it becomes ready to be paid","example[16]":"The debentures will mature in five years’ time.","definition[11]":"to become fully developed","example[17]":"The country’s economy has matured and become more open to competition.","definition[12]":"if an industry or market matures, it stops growing as fast as before, and the number of competitors decreases","example[18]":"When the market begins to mature, it is increasingly difficult for new entrants to gain a significant position.","definition[13]":"a mature industry or market is one where growth is relatively low and there are fewer competitors than before","example[19]":"Many emerging markets have outpaced  (=developed more quickly than) more mature markets such as the U.S. and Japan."}