{"word[0]":"carry","signpost[0]":"lift and take","definition[0]":"to hold something in your hand or arms, or support it as you take it somewhere","example[0]":"Gina was carrying a small bunch of flowers.","example[1]":"Angela carried the child in her arms.","example[2]":"Let me carry that for you.","example[3]":"Jack carried his grandson up the stairs.","example[4]":"The waiter carried our drinks to the table.","note[0]":"carry something to something/somebody","signpost[1]":"vehicle/ship/plane","definition[1]":"to take people or things from one place to another in a vehicle, ship, or plane","example[5]":"The ship was carrying drugs.","example[6]":"There are more airplanes carrying more people than ever before.","signpost[2]":"pipe/wire etc","definition[2]":"if a pipe, wire etc carries something such as liquid or electricity, the liquid, electricity etc flows or travels along it","example[7]":"A drain carries surplus water to the river.","example[8]":"The aim is for one wire to carry both television and telephone calls.","signpost[3]":"move something","definition[3]":"to cause something to move along or support something as it moves along","example[9]":"This stretch of water carries a lot of shipping.","example[10]":"The bridge carries the main road over the railway.","example[11]":"Pollution was carried inland by the wind.","signpost[4]":"have with you","definition[4]":"to have something with you in your pocket, on your belt, in your bag etc everywhere you go","example[12]":"I don’t carry a handbag. I just carry money in my pocket.","example[13]":"All the soldiers carried rifles.","example[14]":"He says he’s got to carry a knife to protect himself.","signpost[5]":"have a quality","definition[5]":"to have something as a particular quality","example[15]":"Degree qualifications carry international recognition.","example[16]":"Few medical procedures carry no risk of any kind.","example[17]":"Older managers carry more authority in a crisis.","example[18]":"The plan is not likely to carry much weight with  (=have much influence over) the authorities.","example[19]":"If the child believes in what she is saying, she will carry conviction (=make others believe what she says is true).","signpost[6]":"news/programmes","definition[6]":"if a newspaper, a television or radio broadcast, or a website carries a piece of news, an advertisement etc, it prints it or broadcasts it","example[20]":"The morning paper carried a story about demonstrations in New York and Washington D.C.","example[21]":"The national TV network carries religious programmes.","definition[7]":"if something carries information, the information is written on it","example[22]":"All tobacco products must carry a health warning.","example[23]":"goods carrying the label ‘Made in the USA’","signpost[7]":"be responsible","definition[8]":"to be responsible for doing something","example[24]":"Each team member is expected to carry a fair share of the workload.","example[25]":"Which minister carries responsibility for the police?","example[26]":"Parents carry the burden of ensuring that children go to school.","signpost[8]":"shop","definition[9]":"if a shop carries goods, it has a supply of them for sale","example[27]":"The sports shop carries a full range of equipment.","definition[10]":"if a wall etc carries something, it supports the weight of that thing","example[28]":"These two columns carry the whole roof.","signpost[9]":"take somebody/something","definition[11]":"to take something or someone to a new place, point, or position","example[29]":"The president wanted to carry the war to the northern states.","note[1]":"carry somebody/something to something","example[30]":"Blair carried his party to victory in 1997.","example[31]":"Clinton carried his campaign into Republican areas.","note[2]":"carry somebody/something into something","signpost[10]":"disease","definition[12]":"if a person, animal, or insect carries a disease, they can pass it to other people or animals even if they are not ill themselves","example[32]":"The disease is carried by a black fly which lives in the rivers.","example[33]":"Birds and monkeys can carry disease.","definition[13]":"if a crime carries a particular punishment, that is the usual punishment for the crime","example[34]":"Drink-driving should carry an automatic prison sentence.","example[35]":"Murder still carries the death penalty.","definition[14]":"if a sound carries, it goes a long way","example[36]":"In the winter air, sounds carry clearly.","example[37]":"The songs of the whales carry through the water over long distances.","definition[15]":"if a ball carries a particular distance when it is thrown, hit, or kicked, it travels that distance","signpost[11]":"tune","definition[16]":"to sing a tune using the correct notes","example[38]":"I sang solos when I was six because I could carry a tune.","example[39]":"The highest voice carries the melody.","definition[17]":"to persuade a group of people to support you","example[40]":"He had to carry a large majority of his colleagues to get the leadership.","example[41]":"Her appeal to common sense was what finally carried the day (=persuaded people to support her).","signpost[12]":"election","definition[18]":"if someone carries a state or local area in a US election, they win in that state or area","example[42]":"Cuban Americans play an important role in whether he carries Florida in the fall campaign.","signpost[13]":"your body","definition[19]":"to stand and move in a particular way, or to hold part of your body in a particular way","example[43]":"He had a way of carrying his head on one side.","example[44]":"She carried herself straight and with confidence.","note[3]":"carry yourself","signpost[14]":"not enough effort","definition[20]":"if a group carries someone who is not doing enough work, they have to manage without the work that person should be doing","example[45]":"The team can’t afford to carry any weak players.","signpost[15]":"child","definition[21]":"if a woman is carrying a child, she is pregnant","definition[22]":"to weigh a particular amount more than you should or than you did","example[46]":"Joe carries only nine pounds more than when he was 20.","signpost[16]":"adding numbers","definition[23]":"to put a number into the next row to the left when you are adding numbers together","collocation[0]":"carry out work","example[47]":"You’ll have to get a builder to carry out the work.","collocation[1]":"carry out your duties/responsibilities","example[48]":"She carried out her duties very efficiently.","collocation[2]":"carry out a task/job","example[49]":"He was unable to carry out simple tasks.","collocation[3]":"carry out research","example[50]":"I was in Italy carrying out research for my book.","collocation[4]":"carry out a survey","example[51]":"The committee has carried out a survey of parking problems in residential areas.","collocation[5]":"carry out a check","example[52]":"Manufacturers carry out safety checks on all new cars.","collocation[6]":"carry out a test","example[53]":"Forensic experts are now carrying out DNA tests.","collocation[7]":"carry out an experiment","example[54]":"Many schools need better facilities for carrying out scientific experiments.","collocation[8]":"carry out a review","example[55]":"The government is carrying out a review of state pension provision.","collocation[9]":"carry out a study","example[56]":"He has carried out various studies into violent behaviour.","collocation[10]":"carry out an investigation","example[57]":"The police will carry out an investigation into what actually happened.","collocation[11]":"carry out an inquiry","example[58]":"A formal inquiry into the cause of death will be carried out.","collocation[12]":"carry out an assessment","example[59]":"The company is carrying out an assessment of staff training needs.","collocation[13]":"carry out a search","example[60]":"Here are some more ways of carrying out information searches online.","collocation[14]":"carry out an attack","example[61]":"It became clear that terrorists had carried out the attack.","definition[24]":"to have something or someone in your hands or arms when you go somewhere","example[62]":"She was carrying a heavy suitcase.","example[63]":"Mary fainted, and had to be carried inside.","display[0]":"tote","definition[25]":"to carry something such as a bag or a gun","example[64]":"He came out of the office toting a black leather briefcase.","example[65]":"Guards toting machine guns stood inside the airport.","display[1]":"lug","definition[26]":"to carry something heavy, with difficulty","example[66]":"They lugged the mail in heavy canvas bags into the building.","display[2]":"cart","definition[27]":"to carry something large and heavy somewhere, especially when this is annoying or hard work","example[67]":"We carted all the furniture upstairs.","display[3]":"schlep","definition[28]":"to carry something heavy","example[68]":"Marty schlepped the suitcases upstairs.","display[4]":"bear","definition[29]":"to carry something – used when talking about what someone has with them when they go somewhere. Bear is commonly used as a participle bearing","example[69]":"They arrived bearing gifts.","example[70]":"Anna returned, bearing a large red packet.","definition[30]":"the distance a ball or bullet travels after it has been thrown, hit, or fired","past_tense[0]":"carried","definition[31]":"to move goods or passengers from one place to another","example[71]":"Airlines carried 262 million passengers on international flights last year.","definition[32]":"if a person or a company carries a debt, they have that amount of debt","example[72]":"The company still carries a lot of debt.","definition[33]":"to have a particular thing","example[73]":"Short-term loans carry higher interest rates.","example[74]":"The shares carry an annual dividend of $3.64 a share.","example[75]":"The issue carries triple-A ratings from both Moody’s and S&P.","definition[34]":"if a shop carries goods, it has them available for sale","example[76]":"All of their stores carry the same merchandise."}