{"word[0]":"cut  somebody/something off","signpost[0]":"separate","definition[0]":"to separate something by cutting it away from the main part","example[0]":"One of his fingers was cut off in the accident.","example[1]":"Cut the fat off the meat.","note[0]":"cut something off something","signpost[1]":"stop supply","definition[1]":"to stop the supply of something such as electricity, gas, water etc","example[2]":"The gas had been cut off.","example[3]":"The US has threatened to cut off economic and military aid.","definition[2]":"to suddenly not be able to hear someone that you were speaking to on the telephone","example[4]":"I don’t know what happened – we just got cut off.","definition[3]":"if a place is cut off, people cannot leave it or reach it","example[5]":"In winter, the town is often cut off by snow.","definition[4]":"to be a long way from other places and be difficult to get to","example[6]":"Accessible only by air, the town is cut off from the rest of the country.","definition[5]":"if someone is cut off, they are lonely and not able to meet many other people","example[7]":"Many older people feel cut off and isolated.","signpost[2]":"stop being friendly","definition[6]":"to stop having a friendly relationship with someone","example[8]":"Julia had been completely cut off by all her family and friends.","example[9]":"After his wife died, he cut himself off completely from the rest of the world.","note[1]":"cut yourself off (from somebody)","signpost[3]":"interrupt","definition[7]":"to interrupt someone and stop them from finishing what they were saying","example[10]":"Emma cut him off in mid-sentence.","signpost[4]":"prevent something","definition[8]":"to prevent someone from having something that they need or want","example[11]":"The project aims to ensure that poorer people are not cut off from the benefits of computer technology.","signpost[5]":"money/property","definition[9]":"to refuse to let someone receive your money or property, especially when you die","example[12]":"My parents threatened to cut me off without a penny if I married him.","signpost[6]":"driving","definition[10]":"to suddenly drive in front of a moving car in a dangerous way","example[13]":"A man in a station wagon cut me off on the freeway.","definition[11]":"to do something because you are angry, even though it will harm you","definition[12]":"a limit or level at which you stop doing something","example[14]":"The cut-off date for registration is July 2.","note[2]":"cut-off date/point/score etc","definition[13]":"when you completely stop doing something or supplying something","example[15]":"A full-scale cut-off of US aid would be a disaster.","note[3]":"cut-off of"}