{"word[0]":"enterprise","definition[0]":"a company, organization, or business","note[0]":"state/public enterprise especially British English (=one owned by the government)","example[0]":"commercial enterprises such as banks and food manufacturers","definition[1]":"the activity of starting and running businesses","example[1]":"the management of state enterprise  (=done by the government)","definition[2]":"a large and complicated project, especially one that is done with a group of other people","synonym[0]":"initiative","example[2]":"The programme is a joint enterprise with the London Business School.","definition[3]":"the ability to think of new activities or ideas and make them work","example[3]":"We’re looking for young people with enterprise and creativity.","form[0]":"ADJECTIVES/NOUN + enterprise","collocation[0]":"a large/large-scale enterprise","example[4]":"The company has grown into a large-scale enterprise that employs hundreds of people.","collocation[1]":"a small/small-scale enterprise","example[5]":"The tax will affect owners of small-scale enterprises consisting of up to ten people.","collocation[2]":"a successful enterprise","example[6]":"She is the owner of an extremely successful enterprise.","collocation[3]":"a commercial/business enterprise","example[7]":"If you are setting up your own business enterprise, your bank can help.","collocation[4]":"an economic enterprise","example[8]":"It's an economic enterprise, not a charity.","collocation[5]":"a state/state-owned enterprise","example[9]":"New Zealand Rail is a state-owned enterprise.","form[1]":"enterprise + NOUN","collocation[6]":"an enterprise zone","example[10]":"Many firms relocate to enterprise zones because of tax incentives.","collocation[7]":"an enterprise economy","example[11]":"An enterprise economy can generate wealth and reduce unemployment.","definition[4]":"a company or business","example[12]":"Good financial accounts are vital to any enterprise.","example[13]":"The company started as a family enterprise.","definition[5]":"a business activity","example[14]":"The two companies plan to establish an enterprise to provide computer services to the telecommunications industry.","definition[6]":"business activity considered as a whole, especially in relation to other parts of the economy, society etc","example[15]":"economic programmes between government and enterprise","definition[7]":"the ability to think of new activities and ideas and to take risks in business, especially by starting and running new businesses","example[16]":"Managers seemed to lack enterprise and initiative.","example[17]":"an enterprise culture (=an environment in which enterprise is encouraged)"}