{"word[0]":"offence","definition[0]":"an illegal action or a crime","example[0]":"His solicitor said he committed the offence because he was heavily in debt.","example[1]":"sexual offences against children","note[0]":"offence against","definition[1]":"when you offend or upset someone by something you do or say","example[2]":"The problem was how to say ‘no’ to her without causing offence.","note[1]":"cause/give offence","example[3]":"Don’t be upset by what he said; he meant no offence (=did not intend to offend anyone).","definition[2]":"the act of attacking","example[4]":"the weapon of offence used during the attack","collocation[0]":"commit an offence","example[5]":"He had committed the offence of dangerous driving.","collocation[1]":"charge somebody with an offence","example[6]":"In that year, 367 people were charged with terrorist offences.","collocation[2]":"convict somebody of an offence","example[7]":"The number of women convicted of serious offences is fairly small.","collocation[3]":"admit an offence","example[8]":"He had admitted sex offences against children.","collocation[4]":"it is an offence to do something","example[9]":"It is an offence to carry a weapon in a public place.","collocation[5]":"an offence punishable by/with something","example[10]":"Possession of the drug is an offence punishable by up to one year’s imprisonment.","collocation[6]":"make something an offence/make it an offence to do something","example[11]":"The Act made it an offence to sell cigarettes to children under 16.","form[0]":"ADJECTIVES/NOUN + offence","collocation[7]":"a criminal offence","example[12]":"It is a criminal offence to sell alcohol to someone under the age of 18.","collocation[8]":"a serious offence","example[13]":"serious offences such as murder or armed robbery","collocation[9]":"a minor offence","example[14]":"The police cautioned him for a minor offence.","collocation[10]":"a first offence","example[15]":"Because it was a first offence, she was not sent to prison.","collocation[11]":"a lesser offence","example[16]":"For rioting you can receive ten years in prison, while for the lesser offence of violent disorder you can receive five years in prison.","collocation[12]":"a federal offense","example[17]":"The turtles are rare, and it is a federal offense to take them to another state.","collocation[13]":"a driving/parking/traffic offence","example[18]":"Speeding is the most common traffic offence.","collocation[14]":"a sex/drug/terrorist etc offence","example[19]":"Thirty-three people were charged with drug offences.","collocation[15]":"a punishable offence","example[20]":"Lying in court is a punishable offense.","collocation[16]":"a capital offence","example[21]":"Drug smuggling was made a capital offense in 1987.","collocation[17]":"an arrestable/indictable offence","example[22]":"Indictable offences are tried by a jury in a Crown Court.","example[23]":"The company was not aware that it was committing an offence.","example[24]":"It is an offence to sell alcoholic liquor without a licence.","example[25]":"You may be guilty of a criminal offence.","definition[3]":"behaviour which makes someone angry or upset","example[26]":"As a manager, you must know how to handle a difficult customer without giving offence."}