{"word[0]":"court","signpost[0]":"for deciding about a legal case","definition[0]":"the place where a trial is held, or the people there, especially the judge and the jury who examine the evidence and decide whether someone is guilty or not guilty","example[0]":"It could not be proved in a court of law.","example[1]":"The court case lasted six weeks.","example[2]":"Four people will appear in court today, charged with fraud.","example[3]":"The court ruled that no compensation was due.","example[4]":"She threatened to take the magazine to court (=take legal action against them) if they didn’t publish an immediate apology.","signpost[1]":"for playing a sport","definition[1]":"an area made for playing games such as tennis","example[5]":"Can you book a squash court for tomorrow?","note[0]":"squash/tennis/basketball etc court","example[6]":"The players are due on court in an hour.","note[1]":"on court","signpost[2]":"king/queen","definition[2]":"the place where a king or queen lives and works","example[7]":"the royal courts of Europe","definition[3]":"the king, queen, their family, and their friends, advisers etc","example[8]":"Several members of the court were under suspicion.","example[9]":"There was a taste in court circles for romantic verse.","example[10]":"Court officials denied the rumours.","signpost[3]":"area next to a building","definition[4]":"a courtyard","collocation[0]":"a court of law","example[11]":"You may be asked to give evidence before a court of law.","form[0]":"court + NOUN","collocation[1]":"a court case","example[12]":"a recent court case involving the death of a baby","collocation[2]":"a court order","example[13]":"A court order specified that the money must be paid back over six months.","collocation[3]":"a court ruling","example[14]":"The company appealed against the court ruling.","collocation[4]":"court action","example[15]":"He was threatened with court action.","collocation[5]":"court proceedings","example[16]":"The court proceedings were over in a day.","collocation[6]":"go to court","example[17]":"The costs of going to court are very high.","collocation[7]":"take somebody to court","example[18]":"She took the company to court for sex discrimination.","collocation[8]":"bring somebody/something to court","example[19]":"Three teenage girls were brought before the court for robbing an elderly woman.","collocation[9]":"appear in court","example[20]":"A man has appeared in court charged with cruelty to animals.","collocation[10]":"a case comes to court/comes before the court","example[21]":"The case came to court 21 months later.","collocation[11]":"a court hears a case","example[22]":"The county court will hear the case next month.","collocation[12]":"settle something out of court","example[23]":"The matter was finally settled out of court.","collocation[13]":"a court rules/orders/holds something","example[24]":"The court ruled that the penalty was not excessive.","collocation[14]":"a court clears/acquits somebody","example[25]":"A US court cleared him of bribery allegations.","collocation[15]":"a court convicts somebody","example[26]":"A New York court convicted her as a tax cheat.","collocation[16]":"a court upholds something","example[27]":"It seems likely that the court will uphold his conviction.","collocation[17]":"a court quashes/overturns something","example[28]":"A Brazilian court has quashed a 19-year jail sentence.","collocation[18]":"a court adjourns a case/trial etc","example[29]":"The court adjourned the trial until June 21st.","collocation[19]":"a court dismisses/throws out something","example[30]":"The court dismissed his appeal against conviction.","form[1]":"ADJECTIVES/NOUN + court","collocation[20]":"a criminal court","example[31]":"Two French magistrates ruled that he should stand trial in a criminal court.","collocation[21]":"a civil court","example[32]":"Eviction proceedings take place in a civil court.","collocation[22]":"a Crown Court","example[33]":"The defendant went to the Crown Court for sentencing.","collocation[23]":"a High Court","example[34]":"Their convictions were upheld in the High Court.","collocation[24]":"an appeals court/court of appeal","example[35]":"The appeals court rejected the defence’s argument.","collocation[25]":"the Supreme Court","example[36]":"Thomas was the only African-American justice on the Supreme Court.","collocation[26]":"a federal court","collocation[27]":"a county court","collocation[28]":"a magistrates’ court","collocation[29]":"a kangaroo court","example[37]":"The army reportedly held kangaroo courts and executed alleged rebels.","heading[0]":"In a court","display[0]":"defendant","definition[5]":"the person who is on trial for a crime","display[1]":"the defence","definition[6]":"the lawyers who are working for the defendant","display[2]":"the prosecution","definition[7]":"the lawyers who are trying to prove that the defendant is guilty","definition[8]":"the official in charge of a court who decides how criminals should be punished","display[3]":"jury","definition[9]":"a group of people, usually 12 people, who listen to the facts and decide whether the defendant is guilty or not guilty","display[4]":"witness","definition[10]":"someone who describes in a court of law what he or she knows about a crime","display[5]":"testimony","definition[11]":"a formal statement made in a court of law about a particular situation or action","display[6]":"verdict","definition[12]":"the decision of the jury as to whether the defendant is guilty or not guilty","definition[13]":"to try hard to please someone, especially because you want something from them","example[38]":"His campaign team have assiduously courted the media.","definition[14]":"if a man courts a woman, he spends time being nice to her because he hopes to marry her","definition[15]":"the people in a court, especially the judge, other officials, and the JURY (=ordinary people who decide certain cases). The phrase is often used when talking about what a judge or jury think or decide about a case","example[39]":"The court said the defendants had been denied a fair trial.","definition[16]":"a place where all the information concerning a crime or disagreement is given so that it can be judged","example[40]":"The new laws haven’t yet been tested in court.","example[41]":"Sexual harassment is a criminal offense in Germany, but few women complain or go to court (=start the legal process to have a case dealt with in court).","example[42]":"Federal authorities are free to take taxpayers to court to collect unpaid taxes.","example[43]":"The two sides agreed to settle the case out of court (=without asking the court to make a decision).","definition[17]":"to behave nicely towards someone because you want them to do something for you or you want to get something from them","example[44]":"A distinguished chemist, Ed Alexander has been courted by large corporations, but he stays in the classroom doing what he loves - teaching.","example[45]":"The EU is being courted by a number of countries putting themselves forward as the best suppliers of energy.","definition[18]":"if one company courts another, it has discussions with the other company about the possibility of a friendly takeover or MERGER (=combining the companies)","example[46]":"While only Daimler-Benz has courted the luxury car company in public, Volkswagen is also said to be interested in buying it."}