{"word[0]":"quality","plural[0]":"qualities","definition[0]":"how good or bad something is","example[0]":"Much of the land was of poor quality.","example[1]":"Use only high quality ingredients.","example[2]":"The quality of the water is reasonably good.","note[0]":"quality of","definition[1]":"something that people may have as part of their character, for example courage or intelligence","example[3]":"He shows strong leadership qualities.","example[4]":"the personal qualities necessary to be a successful salesman","example[5]":"the qualities of honesty and independence","definition[2]":"something that is typical of one thing and makes it different from other things, for example size, colour etc","example[6]":"the drug’s addictive quality","example[7]":"the physical and chemical qualities of the rock","definition[3]":"a high standard","example[8]":"his pride in the quality of his craftsmanship","example[9]":"wines of quality","form[0]":"ADJECTIVES/NOUN + quality","collocation[0]":"good/high","example[10]":"I was impressed that the quality of their work was so high.","collocation[1]":"poor/low","example[11]":"The magazine is printed on low quality paper.","collocation[2]":"excellent/outstanding","example[12]":"The T-shirts are only $10 and the quality is excellent.","collocation[3]":"superior","example[13]":"These speakers offer superior quality sound.","collocation[4]":"top quality","example[14]":"Our chef uses only top quality ingredients.","collocation[5]":"water/air quality","example[15]":"Scientists took samples to test the water quality.","collocation[6]":"sound quality","example[16]":"I apologise for the poor sound quality of this recording.","collocation[7]":"picture quality","example[17]":"Does this type of TV set have a better picture quality?","collocation[8]":"improve/enhance the quality","example[18]":"The measures will improve the quality of the water in the river.","collocation[9]":"affect the quality","example[19]":"Lack of sleep started to affect the quality of his work.","collocation[10]":"test/check/monitor the quality","example[20]":"The equipment is used to monitor the city’s air quality.","collocation[11]":"maintain the quality","example[21]":"Staffing problems made it difficult to maintain the quality of the service.","collocation[12]":"the quality goes up/down","example[22]":"I think the quality has gone down over the years.","collocation[13]":"the quality suffers","example[23]":"The picture quality suffers if the signal isn’t digital.","form[1]":"quality + NOUN","collocation[14]":"quality standards","example[24]":"Greater investment is needed to meet the European Union’s strict quality standards.","type[0]":"no comparative","definition[4]":"very good – used especially by people who are trying to sell something","example[25]":"quality childcare at prices people can afford","example[26]":"quality double glazing","definition[5]":"something such as courage, intelligence, or loyalty that people may have as part of their character","example[27]":"You need special personal qualities to work as a nurse.","definition[6]":"something such as size, colour, feel, or weight that makes one thing look different from other things","example[28]":"The analysis looks at the physical and chemical qualities of the sample.","definition[7]":"used to talk about how good or bad something is","example[29]":"the high quality of the service","example[30]":"She was shocked by thelow quality of the healthcare available.","definition[8]":"used to talk about how likely an investment is to be profitable","example[31]":"The bond issues carried triple-A ratings and appealed to individuals looking for high-quality securities.","example[32]":"Remember it’s quality we’re looking for, so don’t rush the job.","example[33]":"The company has a worldwide reputation for the quality of its products.","definition[9]":"when people stop buying low-quality products, investments etc and start buying high-quality products etc","example[34]":"The company saw a flight to quality among whisky drinkers and worked to improve the image of its whisky brands.","definition[10]":"a word meaning very good, used especially in advertising products","example[35]":"We provide quality rented accommodation for professional people.","definition[11]":"newspapers etc aimed at educated readers"}