{"definition[0]":"ideas and activities relating to gaining and using power in a country, city etc","example[0]":"a good understanding of politics in China","example[1]":"modern American politics","example[2]":"Politics have always interested Anita.","example[3]":"The president should stand above party politics (=working only for your political party).","example[4]":"Brooke’s been involved in city politics since college.","note[0]":"national/local etc politics","explanation[0]":"In this meaning, politics is usually followed by a singular verb","example[5]":"Politics plays no part in this decision","example[6]":"Politics play no part in this decision","definition[1]":"the profession of being a politician","example[7]":"Flynn retired from politics in 1986.","example[8]":"Her father’s trying to enter politics.","example[9]":"Smith went into politics in his early twenties.","definition[2]":"the activities of people who are concerned with gaining personal advantage within a group, organization etc","example[10]":"I’m tired of dealing with all of the office politics.","example[11]":"Her art examines sexual politics (=how power is shared between men and women).","example[12]":"the politics of race and class at American universities","note[1]":"the politics of something","definition[3]":"someone’s political beliefs and opinions","example[13]":"I assume her politics must be fairly conservative.","definition[4]":"the study of political power and systems of government","synonym[0]":"political science","example[14]":"Tom is studying for a degree in politics.","form[0]":"ADJECTIVES/NOUN + politics","collocation[0]":"national politics","example[15]":"Mark had always been keen to have a career in national politics.","collocation[1]":"local politics","example[16]":"Ann is very active in local politics.","collocation[2]":"international politics","example[17]":"The two superpowers that dominated international politics.","collocation[3]":"world/global politics","example[18]":"There was much going on in world politics at the time.","collocation[4]":"domestic politics","example[19]":"The war had a major impact on the country’s domestic politics.","collocation[5]":"party politics","example[20]":"He believes that party politics has no place in local government.","collocation[6]":"power politics","example[21]":"The party argued that power politics would always lead to war.","collocation[7]":"be involved in politics","example[22]":"After university, he became involved in local politics.","collocation[8]":"take part in politics","example[23]":"Young people should be encouraged to take part in politics.","collocation[9]":"be active in politics","example[24]":"I was very active in politics before I retired.","collocation[10]":"interfere/meddle in politics","example[25]":"He warned the army against interfering in politics.","display[0]":"right-wing","definition[5]":"a right-wing person or group wants low taxes, a strong army and police force, and the individual to be free from government interference as much as possible","example[26]":"right-wing political parties","example[27]":"Some of his supporters are very right-wing.","example[28]":"right-wing policies on gun control","display[1]":"left-wing","definition[6]":"a left-wing person or group wants the government to make society more equal by increasing taxes for rich people, and taking control of important industries and services","example[29]":"a left-wing newspaper","example[30]":"His views are very left-wing.","display[2]":"green","definition[7]":"supporting policies and principles which will protect the environment","example[31]":"green politicians","example[32]":"the Green Party","example[33]":"The government is under pressure to improve its green credentials (=to seem more like it wants to protect the environment).","display[3]":"radical","definition[8]":"supporting political ideas that will involve great change","example[34]":"radical politicians","example[35]":"a radical economic reform programme","display[4]":"liberal","definition[9]":"supporting political ideas that will allow people to have greater freedom","example[36]":"They want the government to have a more liberal policy on drugs.","display[5]":"moderate","definition[10]":"having political opinions which are not extreme","example[37]":"People generally become more moderate as they get older.","example[38]":"The bill is supported by moderate Republicans.","display[6]":"extreme","definition[11]":"having political opinions which are considered to be very unreasonable by many people","example[39]":"His views on immigration are very extreme.","example[40]":"an extreme right-wing organization","example[41]":"a businessman who is also involved in politics","example[42]":"He left his job because he could no longer take the petty office politics."}