{"word[0]":"raid","definition[0]":"a short attack on a place by soldiers, planes, or ships, intended to cause damage but not take control","example[0]":"a bombing raid","example[1]":"an air raid warning siren","example[2]":"The army launched several cross-border raids last night.","note[0]":"launch/carry out/stage a raid","example[3]":"The colonel led a successful raid against a rebel base.","note[1]":"raid on/against","definition[1]":"a surprise visit made to a place by the police to search for something illegal","example[4]":"a police raid","example[5]":"an FBI raid","example[6]":"a dawn raid  (=one made very early in the morning)","example[7]":"Four people were arrested during a raid on a house in London.","note[2]":"raid on","definition[2]":"an attack by criminals on a building where they believe they can steal money or drugs","example[8]":"a bank raid","example[9]":"an armed raid on a shop in Glasgow","definition[3]":"an attempt by a company to buy enough shares in another company to take control of it","collocation[0]":"make a raid","example[10]":"Pirates often made daring raids on the port.","collocation[1]":"carry out a raid","example[11]":"They were encouraged by the French king to carry out raids upon English ships.","collocation[2]":"launch a raid","example[12]":"Rebel forces launched cross-border raids.","collocation[3]":"take part in a raid","example[13]":"They took part in various raids, including the bombing of Cologne in 1942.","form[0]":"ADJECTIVES/NOUN + raid","collocation[4]":"an air raid","example[14]":"His parents were killed in an air raid.","example[15]":"Bombing raids had destroyed most of the country's oil refineries.","collocation[5]":"a commando raid","example[16]":"There had been two unsuccessful British commando raids.","collocation[6]":"a guerrilla raid","example[17]":"From their base in the rainforest they staged guerilla raids on Nicaragua.","collocation[7]":"a night raid","example[18]":"The night raids were almost non-stop.","collocation[8]":"a cross-border raid","example[19]":"Cross-border raids into Kenya last year caused a serious diplomatic conflict.","definition[4]":"if police raid a place, they make a surprise visit to search for something illegal","example[20]":"Police found weapons when they raided his home.","definition[5]":"to make a sudden military attack on a place","note[3]":"raiding party (=a group taking part in an attack)","example[21]":"air bases on the mainland from which the island could be raided","definition[6]":"to go into a place and steal things","example[22]":"The gang raided three homes in the area.","definition[7]":"to go to a place that has supplies of food or drink and take some because you are hungry","example[23]":"Peter went into the kitchen to raid the fridge.","definition[8]":"an occasion when someone suddenly buys a lot of shares in a company, usually as part of an attempt to take control of it","example[24]":"In a successful raid on Emhart Corp., the Fisher-Getty partnership earned a $50 million investment profit."}