{"word[0]":"vital","definition[0]":"extremely important and necessary for something to succeed or exist","synonym[0]":"crucial","example[0]":"The work she does is absolutely vital.","example[1]":"It is vital to be honest with your children.","example[2]":"The tourist industry is of vital importance to the national economy.","example[3]":"Richardson played a vital role in the team’s success.","example[4]":"The samples could give scientists vital information about long-term changes in the Earth’s atmosphere.","example[5]":"These measures are vital to national security.","note[0]":"vital to","example[6]":"Regular exercise is vital for your health.","note[1]":"vital for","example[7]":"It is vital that you keep accurate records.","note[2]":"it is vital (that)","example[8]":"It is vital to keep accurate records.","note[3]":"it is vital to do something","definition[1]":"full of energy in a way that is exciting and attractive","example[9]":"Rodgers and Hart’s music sounds as fresh and vital as the day it was written.","definition[2]":"necessary in order to keep you alive","example[10]":"the body’s vital processes","example[11]":"vital organs (=heart, lungs etc)","collocation[0]":"absolutely vital","example[12]":"Vitamins are absolutely vital for good health.","collocation[1]":"a vital role/part","example[13]":"Nurses play a vital role in hospitals and surgeries.","collocation[2]":"a vital part/element","example[14]":"Learning to play with other children is a vital part of growing up.","collocation[3]":"a vital ingredient/component","example[15]":"Involving teachers in making decisions is a vital ingredient in raising morale.","collocation[4]":"vital information","example[16]":"The radio was a source of vital information on sea and weather conditions.","collocation[5]":"vital evidence","example[17]":"The vital evidence contained in the file had disappeared.","collocation[6]":"a vital source of something","example[18]":"The forest was a vital source of timber.","collocation[7]":"something is of vital importance","example[19]":"Reading is of vital importance in language learning."}