{"word[0]":"survey","definition[0]":"a set of questions that you ask a large number of people in order to find out about their opinions or behaviour","example[0]":"We conducted a survey of parents in the village.","note[0]":"carry out/conduct a survey","example[1]":"The survey showed that Britain’s trees are in good health.","note[1]":"survey shows/reveals (that)","example[2]":"a survey of US businesses","note[2]":"survey of","definition[1]":"an examination of an area of land in order to make a map of it","definition[2]":"an examination of a house or other building done especially for someone who wants to buy it","definition[3]":"a general description or report about a particular subject or situation","example[3]":"a survey of modern English literature","collocation[0]":"carry out/do a survey","example[4]":"The survey was carried out by Warwick University.","collocation[1]":"conduct a survey","example[5]":"a survey conducted by the British Medical Association.","collocation[2]":"a survey shows/reveals something","example[6]":"Our survey showed that many women are afraid to go out alone at night.","collocation[3]":"a survey finds something","example[7]":"A survey found that 37 percent of students were born outside the country.","collocation[4]":"a survey suggests something","example[8]":"Recent surveys suggest that these are the foreign languages most in demand by employers.","form[0]":"ADJECTIVES/NOUN + survey","collocation[5]":"a recent/new survey","example[9]":"According to a recent survey, students buy an average of 11.33 books a year for their courses.","collocation[6]":"an annual survey","example[10]":"Every council will be required to conduct an annual survey of residents.","collocation[7]":"a national survey","example[11]":"A national survey revealed that one in four 15-year-olds smokes regularly.","collocation[8]":"an extensive survey","example[12]":"We conducted an extensive survey asking patients to suggest ways in which the service could be improved.","collocation[9]":"a detailed survey","example[13]":"The author carried out a detailed survey of 32 organizations in Japan and Korea.","collocation[10]":"an opinion survey","example[14]":"Opinion surveys showed consistently that unemployment remained a matter of concern.","collocation[11]":"a customer survey","example[15]":"They have begun to listen carefully to their customers, through customer surveys, focus groups, etc.","collocation[12]":"the results of a survey","example[16]":"The results of the survey have not yet been analysed.","definition[4]":"to ask a large number of people questions in order to find out their attitudes or opinions","example[17]":"Of the 100 companies surveyed, 10% had a turnover of £50m to £99m.","explanation[0]":"Survey is often passive in this meaning","definition[5]":"to look at or consider someone or something carefully, especially in order to form an opinion about them","example[18]":"She turned to survey her daughter’s pale face.","example[19]":"They got out of the car to survey the damage.","definition[6]":"to examine the condition of a house or other building and make a report on it, especially for people who want to buy it","definition[7]":"to examine and measure an area of land and record the details on a map","example[20]":"There were many voyages to survey the ocean depths in the nineteenth century.","definition[8]":"a set of questions given to a group of people to find out about their opinions or behaviour","example[21]":"People are becoming more pessimistic about the economy, according to the latestconsumer survey.","definition[9]":"an examination of the condition of a building or area of land, done by a specialist for someone who is considering buying it","definition[10]":"to ask a group of people a set of questions to find out about their opinions or behaviour","example[22]":"The agency surveys executives in about 300 companies around the country.","example[23]":"Only 15% ofrespondents surveyed would admit to leaving the workplace early.","definition[11]":"to examine and report on the size, condition etc of a building or area of land for someone who is considering buying it"}