{"word[0]":"consent","definition[0]":"permission to do something","example[0]":"He took the car without the owner’s consent.","example[1]":"Her parents gave their consent to the marriage.","example[2]":"A patient can refuse consent for a particular treatment at any time.","example[3]":"Most owners are happy to have their names used for publicity if this is done with their prior consent.","example[4]":"Informed consent was obtained from all participants before the study began.","definition[1]":"agreement about something","example[5]":"The chairman was elected by common consent (=with most people agreeing).","example[6]":"divorce by mutual consent (=by agreement between both the people involved)","collocation[0]":"give (somebody) your consent","example[7]":"The child’s parents have to give their consent to the operation.","collocation[1]":"have somebody’s consent","example[8]":"He claimed to have the consent of the car’s owner.","collocation[2]":"get somebody’s consent","example[9]":"Your solicitor will need to obtain your signed consent.","collocation[3]":"something requires somebody’s consent","example[10]":"Your consent is required before we can apply for a medical report.","collocation[4]":"grant consent","example[11]":"The local council was prepared to grant consent to the project.","collocation[5]":"refuse (your) consent","example[12]":"When the firm applied for consent to build on the site, it was refused.","collocation[6]":"withhold (your) consent","example[13]":"A patient has the right to withhold consent to treatment.","collocation[7]":"written consent","example[14]":"If you are under 18, you need your parents’ written consent  to get married.","collocation[8]":"verbal consent","example[15]":"He gave his verbal consent to have the interview taped.","collocation[9]":"parental consent","example[16]":"Students may not be absent from school without parental consent.","collocation[10]":"somebody’s prior consent","example[17]":"Do not take photographs of people without obtaining their prior consent.","collocation[11]":"informed consent","example[18]":"The men took part in this study after giving informed consent.","collocation[12]":"express consent","example[19]":"Your medical records will only be released with your express consent.","collocation[13]":"tacit consent","example[20]":"If you continue to live in a particular state when it is possible to leave, this implies tacit consent to that state’s political system.","collocation[14]":"planning consent","example[21]":"You will need to apply for planning consent.","collocation[15]":"the age of consent","example[22]":"She was fifteen, under the age of consent, when she became pregnant.","definition[2]":"to give your permission for something or agree to do something","opposite[0]":"refuse","example[23]":"Her father reluctantly consented to the marriage.","note[0]":"consent to","example[24]":"He rarely consents to do interviews.","note[1]":"consent to do something","definition[3]":"permission to do something, especially by someone who has authority or responsibility","example[25]":"The city authorities have given their consent to leases on two buildings.","example[26]":"His contract is to be terminated by mutual consent (=by agreement between both sides).","definition[4]":"willing agreement to a contract and its conditions, without any force or dishonesty having been used. If someone has given consent, a court can force them to obey the contract","example[27]":"Except under special circumstances the parents or guardians of the child must give their consent to the adoption."}