{"word[0]":"shot","definition[0]":"an act of firing a gun","example[0]":"He pulled out his rifle and fired three shots.","example[1]":"She was killed by a single shot to the head.","definition[1]":"the sound of a gun being fired","example[2]":"Where were you when you heard the shot?","definition[2]":"someone who is good, bad etc at shooting","example[3]":"Sergeant Cooper is an excellent shot.","signpost[0]":"bullets","definition[3]":"small metal balls that are shot, many at a time, from a shotgun","definition[4]":"large metal balls that are shot from a cannon","signpost[1]":"attempt to score","definition[5]":"an attempt in sport to throw, kick, or hit the ball towards the place where you can get a point","example[4]":"Shaw took a shot at the goal from the halfway line, but missed.","example[5]":"Good shot!","definition[6]":"a photograph","example[6]":"We hired a photographer to take some publicity shots.","example[7]":"action shots of football players  (=ones taken of people while they are moving)","example[8]":"a close-up shot of a demonstrator being beaten by a policeman","note[0]":"shot of","example[9]":"I managed to get some good shots of the carnival.","signpost[2]":"film/tv","definition[7]":"the view of something in a film or television programme that is produced by having the camera in a particular position","example[10]":"In the opening shot, we see Travolta’s feet walking down the sidewalk.","signpost[3]":"attempt","definition[8]":"an attempt to do something or achieve something, especially something difficult","example[11]":"I decided to have a shot at decorating the house myself.","example[12]":"I didn’t think I had much chance of winning the race, but I thought I’d give it a shot (=try to do it).","example[13]":"The network finally gave Keaton a shot at presenting his own show.","example[14]":"This is her first shot at directing a play.","note[1]":"shot at (doing) something","example[15]":"If Lewis won his next fight, he would be guaranteed a shot at the title (=chance to win the title).","signpost[4]":"critical remark","definition[9]":"a remark that is intended to criticize or hurt someone","example[16]":"I’m not going to sit here listening to you two take shots at each other all night.","example[17]":"She couldn’t resist a parting shot (=one that you make just before you leave) – ‘And you were a lousy lover!’","example[18]":"That was a cheap shot (=one that is unfair and unreasonable)!","definition[10]":"a small amount of a strong alcoholic drink","example[19]":"a shot of tequila","example[20]":"a shot glass (=a small glass for strong alcoholic drinks)","definition[11]":"an injection of a drug  (=when it is put into the body with a needle)","example[21]":"Have you had your typhoid and cholera shots?","signpost[5]":"heavy ball","definition[12]":"a heavy metal ball that competitors try to throw as far as possible in the sport of shot put","collocation[0]":"fire a shot","example[22]":"The passenger in the car fired three shots.","collocation[1]":"take a shot at somebody","example[23]":"Someone took a shot at her, but missed.","collocation[2]":"a shot hits somebody/something","example[24]":"The shot hit the burglar in the chest and killed him instantly.","collocation[3]":"a shot misses somebody/something","example[25]":"The first shot missed my head by inches.","collocation[4]":"a shot rings out","example[26]":"Suddenly, two shots rang out.","form[0]":"ADJECTIVES/NOUN + shot","collocation[5]":"a pistol/rifle shot","example[27]":"A pistol shot rang out in the darkness.","collocation[6]":"a single shot","example[28]":"He died from a single shot to his heart.","collocation[7]":"the fatal shot","example[29]":"It wasn’t clear who had fired the fatal shot.","collocation[8]":"a warning shot","example[30]":"Police fired warning shots into the air.","collocation[9]":"a good shot","example[31]":"It was difficult to get a good shot in the dense forest.","collocation[10]":"a volley of shots","example[32]":"He fired off a volley of shots from his rifle.","definition[13]":"in bad condition because of being used too much or treated badly","example[33]":"My back tires are shot.","example[34]":"My nerves were shot to pieces after my driving test.","definition[14]":"the past tense and past participle of shoot"}