{"word[0]":"card","definition[0]":"a small piece of plastic or paper containing information about a person or showing, for example, that they belong to a particular organization, club etc","example[0]":"Employees must show their identity cards at the gate.","example[1]":"I haven’t got my membership card yet.","definition[1]":"a small piece of plastic, especially one that you get from a bank or shop, which you use to pay for goods or to get money","example[2]":"Lost or stolen cards must be reported immediately.","example[3]":"a £10 phone card","example[4]":"Every time you use your store card, you get air miles.","signpost[0]":"greetings","definition[2]":"a piece of folded thick stiff paper with a picture on the front, that you send to people on special occasions","example[5]":"a Mother’s Day card","note[0]":"birthday/Christmas/greetings etc card","signpost[1]":"holiday","definition[3]":"a card with a photograph or picture on one side, that you send to someone when you are on holiday","synonym[0]":"postcard","example[6]":"I sent you a card from Madrid.","signpost[2]":"stiff paper","definition[4]":"thick stiff paper","example[7]":"Cut a piece of white card 12 × 10 cm.","signpost[3]":"for writing information","definition[5]":"a small piece of thick stiff paper that information can be written or printed on","example[8]":"a set of recipe cards","example[9]":"a score card","definition[6]":"a small piece of thick stiff paper with numbers and signs or pictures on one side. There are 52 cards in a set.","note[1]":"pack/deck of cards (=a complete set of cards)","definition[7]":"a game in which these cards are used","example[10]":"I’m no good at cards.","example[11]":"We were having a game of cards.","example[12]":"Let’s play cards.","example[13]":"a book of card games","definition[8]":"a small piece of thick stiff paper with numbers or pictures on them, used to play a particular game","example[14]":"a set of cards for playing Snap","definition[9]":"a small piece of thick stiff paper that shows your name, job, and the company you work for","synonym[1]":"business card","example[15]":"My name’s Adam Carver. Here’s my card.","definition[10]":"a piece of equipment inside a computer that the chips are attached to, that allows the computer to do specific things","example[16]":"a graphics card","definition[11]":"an amusing or unusual person","example[17]":"Fred’s a real card, isn’t he!","definition[12]":"a small piece of stiff red or yellow paper, shown to a player who has done something wrong in a game such as football","signpost[4]":"list at sports event","definition[13]":"a list of races or matches at a sports event, especially a horse race","example[18]":"a full card of 120 riders for the Veterans race","signpost[5]":"tarot","definition[14]":"a small piece of thick stiff paper with a special picture on one side, that is put down in a pattern in order to tell someone what will happen in their future","definition[15]":"a tool that is similar to a comb and is used for combing, cleaning, and preparing wool or cotton for spinning (spin)","heading[0]":"– Meaning 1: a small piece of plastic or paper containing information about a person or showing, for example, that they belong to a particular organization, club etc","form[0]":"types of card","collocation[0]":"an identity/ID card","example[19]":"All US citizens must carry an identity card.","collocation[1]":"a membership card","example[20]":"Do you have a library membership card?","collocation[2]":"a student card","example[21]":"Entrance is free if you have a student card.","collocation[3]":"a medical card","example[22]":"You will need to bring your medical card.","collocation[4]":"an appointment card","example[23]":"The dentist gave me a new appointment card.","collocation[5]":"a swipe card","example[24]":"Swipe cards are used to enhance security.","collocation[6]":"a smart card","example[25]":"Keeping medical records on small plastic smart cards seems to be a success.","collocation[7]":"a sim card","example[26]":"You may need a new sim card when you travel abroad.","collocation[8]":"a donor card","example[27]":"We want to encourage more people to carry a donor card.","collocation[9]":"carry a card","example[28]":"Motorists could soon be forced to carry an ID card.","collocation[10]":"flash a card","example[29]":"He flashed his ID card at the guard and walked straight in.","heading[1]":"– Meaning 2: a small piece of plastic, especially one that you get from a bank or shop, which you use to pay for goods or to get money","collocation[11]":"a credit card","example[30]":"He had paid by credit card.","collocation[12]":"a debit card","example[31]":"The store only accepts debit cards.","collocation[13]":"a cash card","example[32]":"You should report stolen cash cards immediately.","collocation[14]":"a bank/cheque card","example[33]":"Always keep your cheque book and cheque card separately.","collocation[15]":"a charge/store card","example[34]":"Store cards often have high rates of interest.","collocation[16]":"a phone card","example[35]":"You can use this phone card in several countries.","form[1]":"card + NOUN","collocation[17]":"a card number","example[36]":"What's your card number?","collocation[18]":"the card holder","example[37]":"1 in 10 store card holders owes more than £500.","collocation[19]":"card fraud","example[38]":"Many consumers are afraid of credit card fraud.","collocation[20]":"card details","example[39]":"Hackers stole hundreds of people's card details.","collocation[21]":"pay by card","example[40]":"Is it all right if I pay by card?","collocation[22]":"put something on your card","example[41]":"I’ll put the restaurant bill on my card.","collocation[23]":"use your card","example[42]":"I don’t use a card if I can pay by cash.","collocation[24]":"accept/take a card","example[43]":"Big hotels will accept most cards.","definition[16]":"to ask someone to show a card proving that they are old enough to do something, especially to buy alcohol","definition[17]":"to show a red or yellow card to someone playing a sport such as football, to show that they have done something wrong","definition[18]":"to comb, clean, and prepare wool or cotton, before making cloth","definition[19]":"a small piece of plastic or paper that shows that someone belongs to an organization, club etc","example[44]":"Employees must show their ID cards at the gate.","example[45]":"All members are issued with a membership card.","definition[20]":"a small piece of stiff paper or plastic that stores information about someone or something","example[46]":"A helpful device is to print your presentation ideas on separate index cards.","definition[21]":"a small piece of plastic that you use to pay for goods or to get money from a machine at a bank","example[47]":"I’ll leave my card and you can contact me when it suits you.","definition[22]":"a part inside a computer to which chips are fixed, that allows the computer to do specific things","example[48]":"a sound card"}