{"word[0]":"extract","definition[0]":"to remove an object from somewhere, especially with difficulty","synonym[0]":"pull out","example[0]":"You’ll have to have that tooth extracted.","example[1]":"He extracted an envelope from his inside pocket.","note[0]":"extract something from something","definition[1]":"to carefully remove a substance from something which contains it, using a machine, chemical process etc","example[2]":"Oils are extracted from the plants.","definition[2]":"to get something which you want from someone, such as information, money, help etc, especially when they do not want to give it to you","example[3]":"They used torture to extract information about their families.","example[4]":"She had extracted a promise from him.","note[1]":"extract something from somebody","definition[3]":"to take information or a short piece of writing from a book","example[5]":"We need to extract the relevant financial data.","definition[4]":"to get an advantage or good thing from a situation","example[6]":"They aim to extract the maximum political benefit from the Games.","definition[5]":"a short piece of writing, music etc taken from a particular book, piece of music etc","synonym[1]":"excerpt","example[7]":"I’ve only seen short extracts from the film.","note[2]":"extract from","definition[6]":"a substance obtained from something by using a special process","example[8]":"Add one teaspoon of vanilla extract.","note[3]":"vanilla/malt/plant etc extract","definition[7]":"to remove RAW MATERIALs, such as gold or oil, from a place, for example the sea or the ground, so that they can be sold or used in an industrial or manufacturing process","example[9]":"The landowner has appealed for planning permission to extract the peat.","example[10]":"The three most heavily taxed commodities are alcohol, tobacco, and the oil being extracted from the North Sea.","definition[8]":"to separate a substance or chemical from RAW MATERIALs","example[11]":"The roots are crushed in the local sugar factory to extract the sugary juice.","example[12]":"Cocoa butter and cocoa powder are extracted from the beans.","definition[9]":"to get information or facts from a piece of writing or set of figures","example[13]":"The software extracts data directly from the accounting system.","example[14]":"He would not leave until he’d extracted every detail.","definition[10]":"to get information or an agreement from someone, although it is difficult to do so","example[15]":"The full employment of the 1950s gave trade unions the power to extract better terms and conditions from employers.","definition[11]":"a small part of a piece of writing, music, or a film","example[16]":"an extract from a memorandum to a US delegate","definition[12]":"a substance or chemical which has been removed from RAW MATERIALs","example[17]":"vanilla extract"}