{"word[0]":"guarantee","definition[0]":"to promise to do something or to promise that something will happen","example[0]":"The law guarantees equal rights for men and women.","example[1]":"I guarantee you’ll love this film.","note[0]":"guarantee (that)","example[2]":"If you send the application form in straight away, I can guarantee you an interview.","note[1]":"guarantee somebody something","example[3]":"I cannot guarantee to work for more than a year.","note[2]":"guarantee to do something","definition[1]":"to make a formal written promise to repair or replace a product if it breaks within a specific period of time","example[4]":"All our products are fully guaranteed.","example[5]":"The stereo is guaranteed against failure for a year.","note[3]":"guarantee something against something","definition[2]":"to promise that you will pay back money that someone else has borrowed, if they do not pay it back themselves","example[6]":"The bank will only lend me money if my parents guarantee the loan.","definition[3]":"to make it certain that something will happen","example[7]":"In movies, talent by no means guarantees success.","example[8]":"The built-in thermostat guarantees that the water remains at the same temperature all the time.","note[4]":"guarantee that","example[9]":"This latest incident is guaranteed to make the situation worse.","note[5]":"be guaranteed to do something","example[10]":"Even if you complete your training, you aren’t guaranteed a job.","note[6]":"be guaranteed something","definition[4]":"a formal written promise to repair or replace a product if it breaks within a specific period of time","synonym[0]":"warranty","example[11]":"They offer a two-year guarantee on all their electrical goods.","example[12]":"a money-back guarantee","example[13]":"Our computers come with a one-year guarantee.","note[7]":"come with/carry a guarantee","example[14]":"Is your TV under guarantee  (=protected by a guarantee)?","note[8]":"under guarantee","definition[5]":"a formal promise that something will be done","example[15]":"I’m afraid there’s no guarantee of success.","note[9]":"guarantee of","example[16]":"I cannot give a guarantee that there will be no redundancies.","definition[6]":"a promise that you will pay back money that someone else has used or borrowed, if they do not pay it themselves","definition[7]":"something valuable that you give to someone to keep until you have done something you promised to do","example[17]":"The bank is holding the airline’s assets as guarantees.","collocation[0]":"have a guarantee","example[18]":"All our boots have a one-year guarantee for being waterproof.","example[19]":"The building work comes with a 30-year guarantee.","form[0]":"ADJECTIVES/NOUN + guarantee","collocation[1]":"a one-year/two-year etc guarantee","example[20]":"Our clocks carry a five-year guarantee.","example[21]":"The company offers a 30-day, money-back guarantee on all its products.","collocation[2]":"a lifetime guarantee","example[22]":"The binoculars are covered against manufacturing faults by a lifetime guarantee.","collocation[3]":"a full guarantee","example[23]":"A full guarantee comes with every purchase.","definition[8]":"to make a formal written promise to repair or replace a product if it has a fault within a specific period of time after you buy it","example[24]":"The car’s galvanized bodyshell is guaranteed a full ten years against corrosion.","definition[9]":"to make a legal promise to repay a loan if the original borrower DEFAULTs (=fails to repay it or make interest payments on it)","example[25]":"The loan will be guaranteed by Bangkok Bank.","definition[10]":"a formal written promise to repair or replace a product if it has a fault within a specific period of time after you buy it","example[26]":"For new home-owners, some builders have now given a 20-year guarantee against structural defects.","note[10]":"guarantee against","example[27]":"As the video camera was still under guarantee  (=protected by a guarantee), he took it back to the shop to be repaired.","note[11]":"be under guarantee","definition[11]":"an agreement to be responsible for someone else’s promise, especially a promise to repay a loan if the original borrower DEFAULTs (=fails to repay it or make interest payments on it)","definition[12]":"money or assets held by an organization until someone has paid their debts, or debts that they might have in the future","example[28]":"creditor banks holding part of the airline’s assets as guarantees of earlier debts"}