{"word[0]":"principal","definition[0]":"most important","synonym[0]":"main","example[0]":"His principal reason for making the journey was to visit his family.","example[1]":"Teaching is her principal source of income.","example[2]":"the principal character in the book","definition[1]":"someone who is in charge of a school","example[3]":"a small school with just three teachers and the principal","signpost[0]":"university/college","definition[2]":"someone who is in charge of a university or college","definition[3]":"the main person in a business or organization, who can make important business decisions and is legally responsible for them","example[4]":"The principal of the business has an office in New York.","signpost[1]":"performer","definition[4]":"the main performer in a play or in a group of musicians, dancers etc","example[5]":"She later became a principal with the Royal Ballet.","definition[5]":"the original amount of money that is lent to someone, not including any of the interest","definition[6]":"the original amount of a loan, not including any of the interest that is paid","example[6]":"The loan amounts outstanding totaled about $32.2 million in principal and $2.2 million in interest.","example[7]":"No principal is due for repayment until next year.","definition[7]":"an important person, manager etc in some types of organization, who may be legally responsible for its actions","example[8]":"Mr O'Brien is a principal of the Law and Economics Consulting Group.","definition[8]":"the actual buyer and the seller in a business deal, rather than the people who represent them, or BROKERs who buy and sell for them","example[9]":"None of the principals would comment on the purchase price.","synonym[1]":"MAIN","example[10]":"Portland is one of the principal unloading points for Japanese automobiles.","example[11]":"Gulf’s strategy of concentrating on its principal business of oil and gas production","example[12]":"As principal shareholders in the company, no one has a greater interest in its management.","example[13]":"Baxter Healthcare is the principal subsidiary of Baxter International Inc.  (=the largest company owned by them).","example[14]":"Teaching is her primary source of income.","example[15]":"the country’s principal trading partner","definition[9]":"relating to the original amount of a loan, rather than any interest","example[16]":"The total principal amount of debentures being sold was increased to $75 million.","example[17]":"A new government may be unwilling to repay interest on the principal sum loaned."}