{"word[0]":"space","signpost[0]":"empty area","definition[0]":"the amount of an area, room, container etc that is empty or available to be used","example[0]":"How much space is there on each disk?","example[1]":"The hedge takes up too much space.","example[2]":"Now that we’ve got three kids, it’d be nice to have a bit more space.","note[0]":"more/less/enough space","example[3]":"In small homes, a single colour scheme can create a sense of space.","note[1]":"sense/feeling of space","example[4]":"There’s space for a table and two chairs.","note[2]":"space for","example[5]":"He had plenty of space to study.","note[3]":"space to do something","signpost[1]":"area for particular purpose","definition[1]":"an area, especially one used for a particular purpose","example[6]":"a supermarket with 700 free parking spaces","example[7]":"the factory’s floor space (=the size of the available floor area)","example[8]":"We really do need more storage space.","note[4]":"storage/cupboard/shelf space","signpost[2]":"between things","definition[2]":"an empty place between two things, or between two parts of something","synonym[0]":"gap","example[9]":"There was an empty space where the flowers had been.","example[10]":"the space between the house and the garage","note[5]":"space between","signpost[3]":"outside the Earth","definition[3]":"the area beyond the Earth where the stars and planets are","example[11]":"creatures from outer space (=far away in space)","example[12]":"the history of space travel","note[6]":"space travel/research/programme/exploration","example[13]":"Who was the first American in space?","note[7]":"in/into space","explanation[0]":"‘the space’ in this meaning You say","example[14]":"One day people will live in space","bad_example[0]":"One day people will live in the space","signpost[4]":"where things exist","definition[4]":"all of the area in which everything exists, and in which everything has a position or direction","example[15]":"the exact point in space where two lines meet","example[16]":"how people of other cultures think about time and space","definition[5]":"within a particular period of time","example[17]":"Mandy had four children in the space of four years.","definition[6]":"a short period of time","example[18]":"They achieved a lot in a short space of time.","signpost[5]":"empty land","definition[7]":"land, or an area of land that has not been built on","example[19]":"a pleasant town centre with plenty of open space","example[20]":"the wide open spaces of the prairies","example[21]":"the loss of green space in cities","signpost[6]":"freedom","definition[8]":"the freedom to do what you want or do things on your own, especially in a relationship with someone else","example[22]":"We give each other space in our marriage.","example[23]":"She needed time and space to sort out her life.","signpost[7]":"in writing","definition[9]":"an empty area between written or printed words, lines etc","example[24]":"Leave a space after each number.","definition[10]":"the width of a typed  letter of the alphabet","example[25]":"The word ‘the’ takes up three spaces.","definition[11]":"a place provided for you to write your name or other information on a document, piece of paper etc","example[26]":"Please write any comments in the space provided.","signpost[8]":"in a report/book","definition[12]":"the amount of space in a newspaper, magazine, or book that is used for a particular subject","example[27]":"The story got very little space in the national newspapers.","heading[0]":"– Meaning 3: an empty place between two things, or between two parts of something","example[28]":"There was only a small space between the car and the wall.","example[29]":"Nathan stood in the doorway, filling the narrow space.","collocation[0]":"a confined/enclosed space","example[30]":"It was difficult being together in such a confined space.","collocation[1]":"an empty space","example[31]":"Another day we returned to find an empty space where the TV should have been.","collocation[2]":"a blank space","example[32]":"Write your refund request in the blank space on Line 9.","collocation[3]":"clear/make a space","example[33]":"Jack cleared a space for his newspaper on the table.","collocation[4]":"leave a space","example[34]":"Leave a space for the title at the top.","collocation[5]":"fit in/into a space","example[35]":"Decide what kind of table and chairs will fit best into the space.","heading[1]":"– Meaning 4: the area beyond the Earth where the stars and planets are","collocation[6]":"outer space","example[36]":"Meteorites are rocks from outer space.","collocation[7]":"deep space","example[37]":"The probe will continue its journey into deep space.","form[0]":"space + NOUN","collocation[8]":"space travel","example[38]":"What will space travel be like in the future?","collocation[9]":"space exploration","example[39]":"They are developing robots that can be used for space exploration.","collocation[10]":"space research","example[40]":"The institute is a world leader in space research.","collocation[11]":"a space programme","example[41]":"This technology was originally developed by the American space program.","collocation[12]":"the far/furthest/vast reaches of space","example[42]":"Light takes time to travel across the vast reaches of space.","definition[13]":"to arrange objects or events so that they have equal spaces or periods of time between them","example[43]":"They used three microphones spaced several yards apart.","example[44]":"Try to space out your classes and study in between.","example[45]":"For security, use three evenly spaced bolts per post.","note[8]":"be evenly spaced","definition[14]":"to stop paying attention and just look in front of you without thinking, especially because you are bored or have taken drugs","example[46]":"I completely spaced out during the lecture.","definition[15]":"the area or amount of room in a newspaper, magazine etc that is used for a particular subject","definition[16]":"land or an area of land that has not been built upon","example[47]":"It has an attractive town centre with lots of open spaces."}