{"definition[0]":"a building where people are kept as a punishment for a crime, or while they are waiting to go to court for their trial","synonym[0]":"jail","example[0]":"He visits his dad in prison every week.","example[1]":"Ricky has been out of prison for three years now.","example[2]":"They’ll probably put him in prison for a long time.","example[3]":"Helen was sent to prison for attacking a man with a knife.","example[4]":"The two men were arrested only a week after they were released from prison.","example[5]":"Three terrorists escaped from Brixton Prison.","example[6]":"an increase in the number of women going to prison","example[7]":"Mr Gunn received a ten-year prison sentence.","definition[1]":"the system that deals with keeping people in a prison","example[8]":"the prison service","example[9]":"Does prison deter criminals from offending again?","definition[2]":"an unpleasant place or situation which it is difficult to escape from","example[10]":"The farm felt like a prison to her.","collocation[0]":"go to prison","example[11]":"She went to prison for theft.","collocation[1]":"put somebody in prison","example[12]":"Mentally ill people should not be put in prison.","collocation[2]":"send somebody to prison","example[13]":"I was afraid I might get sent to prison.","collocation[3]":"be released from prison","example[14]":"He was released from prison six weeks ago.","collocation[4]":"let somebody out of prison","example[15]":"When’s he going to be let out of prison?","collocation[5]":"come/get out of prison","example[16]":"The boy just come out of prison after doing two years for assault.","collocation[6]":"escape from (a) prison","example[17]":"Blake escaped from a Missouri prison last year.","collocation[7]":"an open prison","example[18]":"He was transferred to an open prison.","collocation[8]":"a maximum security prison","example[19]":"He was sent to a maximum security prison where prisoners are kept in their cells almost 23 hours a day.","form[0]":"prison + NOUN","collocation[9]":"a prison sentence/term","example[20]":"He is serving a four-year prison sentence.","collocation[10]":"a prison officer/official/warder/guard","example[21]":"Last month, a prisoner attacked two prison officers with a knife.","collocation[11]":"a prison cell","example[22]":"Overcrowding means that many prisoners have to share a prison cell.","collocation[12]":"the prison population","example[23]":"The government wants to reduce the size of the prison population.","explanation[0]":"You use prison without ‘the’ when talking in general about someone being kept somewhere as a punishment","example[24]":"He is in prison for murder","example[25]":"The judge sent him to prison","explanation[1]":"You use the prison when talking about a particular place","example[26]":"There are about 600 prisoners in the prison","example[27]":"Visitors to the prison are carefully checked","definition[3]":"a large building where people are kept as a punishment for a crime or while they are waiting to go to court for their trial","example[28]":"He was sentenced to five years in prison.","example[29]":"Wandsworth Prison","definition[4]":"a prison, or a similar smaller building where prisoners are kept for a short time","example[30]":"This old building is the jail that Butch Cassidy escaped from in 1887.","example[31]":"He was taken to a cell in the Los Angeles County Jail.","example[32]":"58% of prisoners are in jail for non-violent crimes.","example[33]":"The strikers were harassed, beaten and put in jail for trespassing.","example[34]":"Grover got caught for not paying his taxes and was sent to jail.","display[0]":"gaol","definition[5]":"another way of spelling jail","example[35]":"He spent the night in gaol.","display[1]":"penitentiary","definition[6]":"a large prison for people who are guilty of serious crimes","example[36]":"the Ohio State Penitentiary","example[37]":"The murderer served 10 years at the  penitentiary in Stillwater.","example[38]":"the abandoned federal penitentiary on Alcatraz Island","display[2]":"correctional facility","definition[7]":"an official word for a prison","example[39]":"1,000 prisoners rioted at the North County Correctional Facility.","display[3]":"detention centre","definition[8]":"a place where young people who have done something illegal are kept, because they are too young to go to prison. Also used about a place where people who have entered a country illegally are kept","example[40]":"Kevin, who had been abandoned by his mother, had been in and out of detention centres all his life.","example[41]":"a juvenile detention center","example[42]":"Harmondsworth detention centre, near Heathrow airport","display[4]":"open prison","definition[9]":"a prison in which prisoners have more freedom than in an ordinary prison, usually because their crimes were less serious","example[43]":"In some open prisons, prisoners are allowed to go home at weekends.","display[5]":"cell","definition[10]":"a small room in a prison or police station, where someone is kept as a punishment","example[44]":"Conditions were poor, and there were several prisoners to one cell."}