{"definition[0]":"very bad – used, for example, about things you see, taste, or smell, or about the weather","example[0]":"The weather has been really horrible all week.","example[1]":"a horrible smell","example[2]":"The food looked horrible, but it tasted OK.","definition[1]":"very unpleasant and often frightening, worrying, or upsetting","example[3]":"a horrible dream","example[4]":"I have a horrible feeling that we’re going to miss the plane.","definition[2]":"rude and unfriendly","example[5]":"She’s a horrible person.","example[6]":"What a horrible thing to say!","example[7]":"Why are you so horrible to me?","note[0]":"be horrible to somebody","heading[0]":"taste/smell","definition[3]":"very bad and unpleasant","example[8]":"What’s that horrible smell?","example[9]":"This fish tastes horrible.","display[0]":"disgusting/revolting","definition[4]":"horrible, especially in a way that makes you feel slightly sick","example[10]":"I had to take two spoons of some disgusting medicine.","example[11]":"The stench in the room was revolting.","display[1]":"nasty","definition[5]":"very unpleasant – often used about a taste that stays in your mouth","example[12]":"Cheap wine sometimes leaves a nasty taste in your mouth.","example[13]":"the nasty smell of bad eggs","display[2]":"nauseating","definition[6]":"horrible and making you feel that you are going to vomit – used especially about a smell","example[14]":"the nauseating smell of stale beer and cigarette smoke","display[3]":"foul","definition[7]":"horrible – used especially when there is decay or waste","example[15]":"There was a foul smell coming from the water.","example[16]":"Whatever it was in that cup, it tasted foul.","heading[1]":"experience, situation, event","display[4]":"horrible/terrible/awful/dreadful","example[17]":"For one horrible moment, I thought I was going to fall.","example[18]":"The refugees were living in dreadful conditions.","example[19]":"It must have been a terrible worry for them.","example[20]":"Thousands of people lost their jobs – it was awful.","definition[8]":"very unpleasant and shocking – used especially about events where people are hurt","example[21]":"There’s been a nasty accident on the motorway.","example[22]":"a nasty cut","example[23]":"The news came as a nasty shock."}