{"word[0]":"default","definition[0]":"failure to pay money that you owe at the right time","example[0]":"the risk of default by borrowers","example[1]":"The company is in default on its loan agreement.","note[0]":"in default","example[2]":"The bank can seize the asset in the event of a default in payment.","note[1]":"default in","definition[1]":"failure to do something that you are supposed to do according to the law or because it is your duty","definition[2]":"the way in which things are arranged on a computer screen unless you decide to change them","example[3]":"You can change the default settings to suit your needs.","definition[3]":"the usual and expected way in which something is done, unless you decide to do something different","example[4]":"This way of working seems to be the default these days.","definition[4]":"to fail to pay money that you owe at the right time","example[5]":"He defaulted on his child support payments.","note[2]":"default on","definition[5]":"to not do something that you are supposed to do, especially that you are legally supposed to do","definition[6]":"if something happens or is decided by default, it happens or is decided in that way because you did not do anything to change it","example[6]":"They won the last election by default.","definition[7]":"when someone fails to pay money that they owe at the right time","example[7]":"An asset can be repossessed by a lessor in the event of a default on the lease payments.","example[8]":"The banks have decided that the company is in default on its loan agreements.","definition[8]":"when someone fails to do something that it is their duty to do","example[9]":"The contract includes provisions for loss and expense suffered by the contractors due to default by the employer.","definition[9]":"when someone fails to come to court or make a written statement when they are supposed to","example[10]":"The defendant will have to explain his default and satisfy the court that he has a defence which ought to be heard.","definition[10]":"the way in which things will be arranged on a computer screen or done by a computer unless you change them","example[11]":"If the defaults are acceptable the user can just press Return.","example[12]":"This icon appears by default.","example[13]":"The default margin settings are 1.25 each for a page 8.5 wide.","example[14]":"The Act covered what mortgage lenders could do to recover their money if borrowers defaulted.","definition[11]":"to not do something that it is your duty to do","example[15]":"If a party defaults in its obligations to the project, then the party’s right to continue participating in the project shall be terminated.","definition[12]":"if a computer program defaults to a particular thing, it does that thing unless you instruct it to do something else","example[16]":"Microsoft Word will default to starting each new line with a capital letter unless you customize the settings.","note[3]":"default to"}