{"word[0]":"surgery","plural[0]":"surgeries","definition[0]":"medical treatment in which a surgeon cuts open your body to repair or remove something inside","example[0]":"She required surgery on her right knee.","note[0]":"surgery on","example[1]":" He underwent surgery for lung cancer.","note[1]":"surgery for","example[2]":"She was in surgery for two hours Thursday.","note[2]":"in surgery","definition[1]":"the place where operations are done in a hospital","example[3]":"Dr. Hanson is in surgery.","definition[2]":"a place where a doctor or dentist gives treatment","definition[3]":"a regular period each day when people can see a doctor or dentist","example[4]":"Surgery is from 9 am to 1 pm on weekdays.","definition[4]":"a special period of time when people can see a Member of Parliament to discuss problems","collocation[0]":"have surgery","example[5]":"Leslie had surgery on her toe last year.","collocation[1]":"undergo surgery","example[6]":"He underwent surgery to remove a bullet from his chest.","example[7]":"There are risks if you choose to undergo surgery.","collocation[2]":"do/carry out surgery","example[8]":"A San Antonio doctor has volunteered to perform the surgery at no cost.","collocation[3]":"need surgery","example[9]":"He is likely to need surgery in the near future.","form[0]":"ADJECTIVES/NOUN + surgery","example[10]":"The surgery was successful and he’s recovering well.","collocation[4]":"major/minor surgery","example[11]":"He will require major surgery to remove the lump.","example[12]":"The president will undergo minor surgery today to remove a small growth from his finger.","collocation[5]":"heart/knee/brain etc surgery","example[13]":"She is now fit again after knee surgery.","collocation[6]":"emergency surgery","example[14]":"The teenager underwent emergency surgery after a bullet pierced her lung.","collocation[7]":"cosmetic/plastic surgery","example[15]":"More and more people are choosing to have plastic surgery.","collocation[8]":"laser surgery","example[16]":"The doctor suggested laser surgery to improve her sight.","collocation[9]":"keyhole surgery","example[17]":"The operation will be done using keyhole surgery.","collocation[10]":"elective surgery","example[18]":"There are often long waiting times for elective surgery."}