{"word[0]":"predict","definition[0]":"to say that something will happen, before it happens","example[0]":"Sales were five percent lower than predicted.","example[1]":"As Liz had predicted, the rumours were soon forgotten.","example[2]":"Newspapers predicted that Davis would be re-elected.","note[0]":"predict (that)","example[3]":"It is difficult to predict what the long-term effects of the accident will be.","note[1]":"predict whether/what/how etc","example[4]":"Unemployment is predicted to increase to 700,000 by the end of the year.","note[2]":"be predicted to do something","heading[0]":"GRAMMAR: Patterns with predict","explanation[0]":"You predict that something will happen","example[5]":"Experts predict that the economic situation will improve","explanation[1]":"You predicted that something would happen","example[6]":"Experts predicted that the economic situation would improve","explanation[2]":"You predict that something might or could happen","example[7]":"No one could have predicted that she might do something like that","explanation[3]":"You say that something is predicted to happen","example[8]":"The population is predicted to increase","explanation[4]":"You say it is predicted that something will happen","example[9]":" It is predicted that the population will increase","explanation[5]":"You say that someone is predicting something Predict is often used in the progressive","example[10]":"They are predicting another hot summer","example[11]":"In the future, it may be possible to predict earthquakes.","example[12]":"Scientists are trying to predict what the Amazon will look like in 20 years' time.","display[0]":"forecast","definition[1]":"to say what is likely to happen in the future, especially in relation to the weather or the economic or political situation","example[13]":"They’re forecasting a hard winter.","example[14]":"Economists forecast that there would be a recession.","display[1]":"project","definition[2]":"to say what the amount, size, cost etc of something is likely to be in the future, using the information you have now","example[15]":"The world’s population is projected to rise by 45%.","display[2]":"can say","definition[3]":"be able to know what will happen in the future","example[16]":"No one can say what the next fifty years will bring.","example[17]":"I can’t say exactly how much it will cost.","display[3]":"foretell","definition[4]":"to say correctly what will happen in the future, using special religious or magical powers","example[18]":"The woman claimed that she had the gift of foretelling the future.","example[19]":"It all happened as the prophet had foretold.","display[4]":"prophesy","definition[5]":"to say that something will happen because you feel that it will, or by using special religious or magical powers","example[20]":"He’s one of those people who are always prophesying disaster.","example[21]":"The coming of a great Messiah is prophesied in the Bible.","example[22]":"He prophesied that the world would end in 2012.","example[23]":"Marx prophesied that capitalism would destroy itself.","display[5]":"foresee","definition[6]":"to know that something is going to happen before it happens","example[24]":"They should have foreseen these problems.","example[25]":"No one foresaw the outcome of the war.","display[6]":"have a premonition","definition[7]":"to have a strange feeling that something is about to happen, especially something bad, usually just before it happens","example[26]":"Suddenly I had a strange premonition of danger ahead.","definition[8]":"to say what you think will happen","example[27]":"Wall Street had been predicting a quarterly profit of 5 cents per share.","example[28]":"Economists are predicting that growth will slow.","note[3]":"predict that"}