{"word[0]":"necessary","definition[0]":"something that is necessary is what you need to have or need to do","example[0]":"The booklet provides all the necessary information about the college.","example[1]":"No further changes were considered necessary.","example[2]":"The police are advising motorists to travel only if their journey is absolutely necessary.","note[0]":"absolutely/really necessary","example[3]":"Falling profits made it necessary to restructure the business.","note[1]":"make it necessary (for somebody) to do something","example[4]":"It’s not necessary to wear a tie.","note[2]":"it is necessary (for somebody) to do something","example[5]":"The doctor says it may be necessary for me to have an operation.","example[6]":"A good diet is necessary for maintaining a healthy body.","note[3]":"necessary for (doing) something","example[7]":"I’ll stay up all night, if necessary, to get it finished.","note[4]":"if/when/where necessary","explanation[0]":"In everyday English, instead of saying it is necessary for somebody to do something, people usually say that someone has to do something:","definition[1]":"used to describe something that you need to have or do","example[8]":"Make sure you bring the necessary documents with you.","example[9]":"It may be necessary for you to have a small operation.","display[0]":"essential","definition[2]":"very important and necessary, especially in order to be healthy, successful etc","example[10]":"Vitamins are essential for healthy growth.","example[11]":"The tourist industry is an essential part of the Spanish economy.","display[1]":"vital","definition[3]":"extremely important and necessary, especially in order to avoid serious problems","example[12]":"A vital piece of equipment on the spacecraft had stopped operating.","example[13]":"It is vital that the aid is sent immediately.","display[2]":"compulsory","definition[4]":"if something is compulsory, you must do it because of a rule or law","example[14]":"Maths and Science are compulsory subjects.","example[15]":"All new staff undergo a compulsory training course.","display[3]":"obligatory","definition[5]":"if something is obligatory, you must do it because of a rule or law. Obligatory is more formal than compulsory","example[16]":"The use of seatbelts is obligatory.","example[17]":"Safety regulations have made it obligatory for all competitors to wear fist protectors.","display[4]":"mandatory","definition[6]":"if something is mandatory, you must do it because it is the law. Mandatory is more formal than compulsory and sounds stronger","example[18]":"School attendance is mandatory.","example[19]":"a prisoner serving a mandatory life sentence","display[5]":"requisite","definition[7]":"the requisite things are the ones that you need to have in order to do something","example[20]":"The other candidates lacked the requisite skills.","example[21]":"the requisite evidence needed for a successful prosecution"}