{"word[0]":"entertainment","definition[0]":"things such as films, television, performances etc that are intended to amuse or interest people","note[0]":"the entertainment industry/business/world","example[0]":"The town provides a wide choice of entertainment.","example[1]":"There will be live entertainment (=performed then, not recorded) throughout the day.","example[2]":"The dolphins give good entertainment value (=a lot of amusement and interest).","definition[1]":"when you entertain someone at home, or for business","example[3]":"the entertainment of friends","form[0]":"ADJECTIVES/NOUN + entertainment","collocation[0]":"live entertainment","example[4]":"There are three bars, all with live entertainment.","collocation[1]":"family entertainment","example[5]":"The holiday village has plenty of family entertainment on offer.","collocation[2]":"mass/popular entertainment","example[6]":"Reality TV has been a very successful form of mass entertainment.","collocation[3]":"light entertainment","example[7]":"He believes that children can appreciate more than just light entertainment.","collocation[4]":"a day’s/afternoon’s/evening’s entertainment","example[8]":"The evening’s entertainment concluded with a firework display.","collocation[5]":"provide entertainment","example[9]":"Dancers and musicians were on hand to provide entertainment.","collocation[6]":"lay on/put on entertainment","example[10]":"The organizers laid on some entertainment for the children.","collocation[7]":"a form of entertainment","example[11]":"video games and other modern forms of entertainment","collocation[8]":"a place of entertainment","example[12]":"Clubs and other places of entertainment must close by 3am.","form[1]":"entertainment + NOUN","collocation[9]":"the entertainment business/industry","example[13]":"The union represents people who work in the entertainment industry.","collocation[10]":"entertainment value","example[14]":"The films provide great entertainment value for kids.","definition[2]":"when a company or businessperson spends money on taking customers to restaurants, bars, theatres etc, as a way of making business deals easier to complete","example[15]":"The group has already spent over a million pounds on marketing and corporate entertainment.","definition[3]":"the business of films, television, theatre productions etc","example[16]":"people employed in retailing and entertainment","example[17]":"It sold 25% of its music business to a Japanese media and entertainment group.","example[18]":"the worldwide impact of the American entertainment industry"}