{"signpost[0]":"return to place","definition[0]":"in, into, or to the place or position where someone or something was before","example[0]":"I’ll be back in a minute.","example[1]":"Put that book back where you found it!","example[2]":"He was back home by half past eleven.","example[3]":"It’s possible to travel there and back in a day.","example[4]":"Rory plugged the cable back into the socket.","note[0]":"back in/to/into etc","example[5]":"I feel like going back to bed.","example[6]":"We ought to try and get back before it gets dark.","note[1]":"go/get/head etc back","explanation[0]":"You go back to a place","explanation[1]":"You go back home","example[7]":"It’s time to go back home","bad_example[0]":"go back to home","signpost[1]":"as before","definition[1]":"in or into the condition or situation you were in before","example[8]":"Gary woke at 4 am and couldn’t get back to sleep.","example[9]":"It took me a long time to get my confidence back.","example[10]":"If you decide to marry him, there will be no going back (=you will not be able to get back to your previous situation).","example[11]":"There’s no way I’m going back to being poor.","note[2]":"go/get back to (doing) something","example[12]":"It’ll take a while for things to get back to normal.","signpost[2]":"previous place","definition[2]":"in or to a place where you lived or worked before","example[13]":"It reminded me of evenings back home.","note[3]":"back home","example[14]":"She was the one who had fired him from his first job back in South Africa.","note[4]":"back in/at","signpost[3]":"backwards","definition[3]":"in the opposite direction from the way you are facing","opposite[0]":"forwards","example[15]":"He glanced back at the house.","example[16]":"Kirov stepped back a pace.","example[17]":"She tilted her head back to look at him.","signpost[4]":"reply/reaction","definition[4]":"if you do something back, you do it as a reply or reaction to what someone has said or done","example[18]":"Can I call you back later?","example[19]":"I’ll pay you back on Friday.","example[20]":"‘No, thanks!’ he shouted back.","example[21]":"If he hits you, you just hit him back.","signpost[5]":"return something to somebody","definition[5]":"if you give something, get something etc back, you return it to the person who first had it, or you have it returned to you","example[22]":"Can we have our ball back, please?","example[23]":"I want all my books back as soon as you’ve finished with them.","example[24]":"Give me back that letter! It’s none of your business!","signpost[6]":"in the past","definition[6]":"in or towards a time in the past","example[25]":"a pile of newspapers dating back to the 1970s","example[26]":"A lot of emotional problems can be traced back to childhood.","example[27]":"Looking back on it, I should have known he was unhappy.","example[28]":"At times, I think back to my life in Moscow.","example[29]":"His wife died a couple of years back.","note[5]":"three years/two months etc back","example[30]":"He called me a while back.","example[31]":"The house was built back in 1235.","note[6]":"back in","signpost[7]":"again","definition[7]":"once again","example[32]":"Go back over your work to check for any mistakes.","example[33]":"Liverpool were back level again two minutes later with a superb goal.","signpost[8]":"away","definition[8]":"away from a surface, person, or thing","example[34]":"She pulled the bandage back very carefully.","example[35]":"Her hair was brushed back from her face.","example[36]":"The woman nodded and stood back, allowing Patrick to enter.","signpost[9]":"towards beginning","definition[9]":"towards the beginning of a book, film, or computer document etc","example[37]":"Turn back to the summaries at the end of section 1.5.","example[38]":"Clicking on the icon will take you back to the previous web page.","example[39]":"Wind the tape back to the beginning.","signpost[10]":"part of your body","definition[10]":"the part of the body between the neck and legs, on the opposite side to the stomach and chest","example[40]":"The cat arched its back and hissed.","example[41]":"My feet were sore and my back was aching.","example[42]":"Keep your head up and your back straight.","example[43]":"To avoid back problems, always bend your knees when you lift heavy objects.","example[44]":"He lay on his back and gazed at the ceiling.","example[45]":"Johnny was lying flat on his back in the middle of the floor.","example[46]":"Anna stood with her back to the window.","example[47]":"The girl appeared again, now with a little baby on her back.","note[7]":"on somebody’s back","definition[11]":"the bones between your neck and the top of your legs","example[48]":"He broke his back in a motorbike accident.","signpost[11]":"not at front","definition[12]":"the part of something that is furthest from the front","example[49]":"a T-shirt with a picture of a snake on the back","example[50]":"Kids should always wear seat belts, even in back.","note[8]":"in back (of something)","example[51]":"Tom’s working on the car out back.","note[9]":"out back","example[52]":"Have you looked round the back?","note[10]":"round/out the back","example[53]":"He kissed her on the back of her head.","note[11]":"back of","example[54]":"Her window faced the backs of the houses.","example[55]":"Two men were sitting in the back of the car.","note[12]":"in the back (of something)","example[56]":"a small shop with an office at the back","note[13]":"at the back (of something)","signpost[12]":"less important side","definition[13]":"the less important side or surface of something such as a piece of paper or card","example[57]":"Paul scribbled his address on the back of an envelope.","example[58]":"The credits are listed on the back of the album.","signpost[13]":"part of seat","definition[14]":"the part of a seat that you lean against when you are sitting","example[59]":"He rested his arm on the back of the sofa.","signpost[14]":"book/newspaper","definition[15]":"the last pages of a book or newspaper","example[60]":"The sports pages are usually at the back.","note[14]":"at the back (of)","example[61]":"The answers are in the back of the book.","note[15]":"in the back (of)","definition[16]":"a defending player in a sports team","synonym[0]":"defender","definition[17]":"to support someone or something, especially by giving them money or using your influence","example[62]":"The scheme has been backed by several major companies in the region.","example[63]":"Some suspected that the rebellion was backed and financed by the US.","example[64]":"government-backed loans","definition[18]":"to support an idea by providing facts, proof etc","example[65]":"His claims are not backed by any scientific evidence.","signpost[15]":"move backwards","definition[19]":"to move backwards, or make someone or something move backwards","example[66]":"She backed into a doorway to let the crowds pass by.","note[16]":"back into/out of/away from etc","example[67]":"He began to back her towards the open door.","note[17]":"back somebody into/towards/out of etc something","example[68]":"I backed the car into the garage.","note[18]":"back something into/towards/out of etc something","signpost[16]":"put something on the back","definition[20]":"to put a material or substance onto the back of something, in order to protect it or make it stronger","example[69]":"The photograph is backed with cardboard.","example[70]":"a plastic-backed shower curtain","explanation[2]":"Back is usually passive in this meaning","signpost[17]":"be behind something","definition[21]":"to be at the back of something or behind it","example[71]":"The Jandia Peninsula is a stretch of white sands backed by a mountain range.","definition[22]":"to play or sing the music that supports the main singer or musician","example[72]":"They performed all their hits, backed by a 40-piece orchestra.","signpost[18]":"risk money","definition[23]":"to risk money on whether a particular horse, dog, team etc wins something","definition[24]":"at or in the back of something","example[73]":"You’ll be sleeping in the back bedroom.","example[74]":"Turn to the back page.","example[75]":"I keep my keys in my back pocket.","example[76]":"There was the sound of giggling from the back row.","example[77]":"The rabbit had one of its back legs caught in a trap.","definition[25]":"behind something, especially a building","example[78]":"the back garden","example[79]":"We left by the back gate.","definition[26]":"from the back","example[80]":"The back view of the hotel was even less appealing than the front.","definition[27]":"a back vowel sound is made by lifting your tongue at the back of your mouth","definition[28]":"to support someone or something, especially by giving money or using your influence","example[81]":"The board backed Mr Standley, who plans to cut costs.","example[82]":"Shareholders have backed a plan to build a second plant.","definition[29]":"if SECURITIES are backed by particular assets, they are supported by income from them","example[83]":"This new generation of securities is backed by aircraft leases, royalty streams from films, student loans and auto loans."}