{"definition[0]":"a specially prepared hard surface for cars, buses, bicycles etc to travel on","example[0]":"I was driving along the road when a kid suddenly stepped out in front of me.","note[0]":"along the road","example[1]":"You’ll see the library a bit further up the road.","note[1]":"up the road","example[2]":"I ran down the road to see what was happening.","note[2]":"down the road","example[3]":"My sister lives just down the road.","example[4]":"Protestors sat down in the road to stop the lorries.","note[3]":"in the road","example[5]":"Someone was standing in the middle of the road.","note[4]":"in the middle of the road","example[6]":"I ran across the road to meet him.","note[5]":"across the road","example[7]":"The college is easily accessible by road.","note[6]":"by road","example[8]":"There are far more cars on the road now than there used to be.","note[7]":"on the road","example[9]":"There were lots of cars parked on the road.","form[0]":"ADJECTIVES/NOUN + road","example[10]":"The children have to cross a busy road to get to school.","example[11]":"At that time of night, the roads were quiet.","example[12]":"Before you overtake, make sure the road is clear.","collocation[0]":"a main road","example[13]":"The main road was blocked for twenty-five minutes.","collocation[1]":"a minor road","example[14]":"France has a huge network of minor roads.","collocation[2]":"a side road/a back road","example[15]":"He drove into a quiet side road and stopped the car.","collocation[3]":"a country road","example[16]":"He was driving along a quiet country road when a tyre suddenly burst.","collocation[4]":"a mountain road","example[17]":"A lot of concentration is needed on the narrow mountain roads.","collocation[5]":"the coast road","example[18]":"He continued along the coast road.","collocation[6]":"the open road","example[19]":"This car is at its best on the open road.","collocation[7]":"a road is open","example[20]":"We try to keep the mountain road open for most of the year.","collocation[8]":"a road is closed","example[21]":"The mountain road was closed by snow.","collocation[9]":"a road is blocked","example[22]":"The main road was blocked for an hour while police cleared the accident.","collocation[10]":"cross a road","example[23]":"She was standing on the pavement waiting to cross the road.","collocation[11]":"run out into a road","example[24]":"He had to swerve when a child ran out into the road.","collocation[12]":"a road leads/goes/runs somewhere","example[25]":"We turned into the road leading to the village.","collocation[13]":"a road winds","example[26]":"A long road wound through the park.","collocation[14]":"a road forks","example[27]":"At Salen, the road forks right and left.","collocation[15]":"a road narrows/widens","example[28]":"After a couple of miles, the road narrows.","form[1]":"road + NOUN","collocation[16]":"a road accident","example[29]":"Her husband was killed in a road accident.","collocation[17]":"road safety","example[30]":"We share parents’ concern for road safety.","collocation[18]":"road sense","example[31]":"Young children don’t have any road sense.","collocation[19]":"a road junction","example[32]":"It was a busy road junction.","collocation[20]":"a road network","example[33]":"the road network in northern France","collocation[21]":"the side of the road","example[34]":"We stopped and had something to eat by the side of the road.","example[35]":"She was standing on the other side of the road talking to my mum.","collocation[22]":"the road ahead","example[36]":"The road ahead was completely flooded.","collocation[23]":"a fork in the road","example[37]":"We had to ask for directions each time we got to a fork in the road.","heading[0]":"types of road","definition[1]":"a hard surface for cars, buses etc to drive on","example[38]":"They’re planning to build a new road.","example[39]":"My address is 42, Station Road.","display[0]":"street","definition[2]":"a road in a town, with houses or shops on each side","example[40]":"She lives on our street.","example[41]":"We walked along the streets of the old town.","example[42]":"Oxford Street is one of Europe’s busiest shopping areas.","example[43]":"He was stopped by the police, driving the wrong way down a one-way street.","example[44]":"Turn left on Main Street  (=the street in the middle of a town, where most of the shops are – used in American English).","example[45]":"These days the same shops are on every high street  (=the street in the middle of a town, where most of the shops are – used in British English).","display[1]":"avenue","definition[3]":"a road in a town, often with trees on each side","example[46]":"the busy avenue in front of the cathedral","example[47]":"He lived on Park Avenue.","display[2]":"boulevard","definition[4]":"a wide road in a city or town – used especially in street names in the US, France etc. In the UK, streets are usually called avenue rather than boulevard","example[48]":"the world-famous Sunset Boulevard in Los Angeles.","display[3]":"lane","definition[5]":"a narrow road in the country","example[49]":"a winding country lane","display[4]":"cul-de-sac","definition[6]":"a short street which is closed at one end","example[50]":"The house is situated in a quiet cul-de-sac in North Oxford.","display[5]":"track","definition[7]":"a narrow road in the country, usually without a hard surface","example[51]":"The farm was down a bumpy track.","display[6]":"ring road","definition[8]":"a road that goes around a town","example[52]":"The airport is on the ring road.","display[7]":"bypass","definition[9]":"a road that goes past a town, allowing traffic to avoid the centre","example[53]":"The bypass would take heavy traffic out of the old city centre.","display[8]":"dual carriageway","definition[10]":"a road with a barrier or strip of land in the middle that has lines of traffic travelling in each direction","example[54]":"I waited until we were on the dual carriageway before I overtook him.","display[9]":"freeway/expressway","definition[11]":"a very wide road in a city or between cities, on which cars can travel very fast without stopping","example[55]":"Take the Hollywood Freeway (101) south, exit at Vine Street and drive east on Franklin Avenue.","example[56]":"Over on the side of the expressway, he saw an enormous sedan, up against a stone wall.","display[10]":"motorway","definition[12]":"a very wide road for travelling fast over long distances","example[57]":"The speed limit on the motorway is 70 miles an hour.","example[58]":"the Pacific Coast Highway","display[11]":"interstate","definition[13]":"a road for fast traffic that goes between states","example[59]":"The accident happened on Interstate 84, about 10 miles east of Hartford.","display[12]":"toll road","definition[14]":"a road that you pay to use","example[60]":"The government is planning to introduce toll roads, in an effort to cut traffic congestion.","display[13]":"turnpike","definition[15]":"a large road for fast traffic that you pay to use","example[61]":"He dropped her off at an entrance to the New Jersey Turnpike.","heading[1]":"USAGE: Up/down the road","explanation[0]":"You often use the phrases up the road and down the road when saying that someone or something is not far away, on the same road","example[62]":"She lives just up the road from us ","example[63]":"The post office is down the road on the right","definition[16]":"used in addresses after the names of roads and streets","example[64]":"65 Maple Road","example[65]":"He lives on Dudley Road."}