{"word[0]":"retirement","definition[0]":"when you stop working, usually because of your age","example[0]":"She took early retirement  (=retired at an earlier age than usual) last year.","example[1]":"Dad’s approaching retirement age.","example[2]":"He became a keen golfer after his retirement from politics.","note[0]":"retirement from","example[3]":"He announced his retirement as chief executive of the company.","note[1]":"retirement as","definition[1]":"the period after you have stopped work","example[4]":"I hope you enjoy a long and happy retirement.","example[5]":"a retirement pension","example[6]":"Will you be able to support yourself in retirement?","note[2]":"in retirement","collocation[0]":"approach retirement","example[7]":"People approaching retirement need to consider the issue of money.","collocation[1]":"take early retirement","example[8]":"He took early retirement in 1990 after 25 years at IBM.","collocation[2]":"announce your retirement","example[9]":"Shortly after his defeat he announced his retirement from politics.","collocation[3]":"early retirement","example[10]":"Staff are being asked to consider early retirement.","collocation[4]":"premature retirement","example[11]":"Injury forced him into premature retirement.","form[0]":"retirement + NOUN","collocation[5]":"retirement age","example[12]":"Sixty-five was the normal retirement age for men.","collocation[6]":"retirement benefits","example[13]":"Part-time workers at the company do, however, get health and retirement benefits.","collocation[7]":"retirement date","example[14]":"My actual retirement date is July 10.","definition[2]":"the act of leaving a job because you have reached the end of your working life, or the period of your life after you do this","example[15]":"290 employees are eligible totake early retirement (=leave before the usual age).","example[16]":"Mr. Baker turns 65 next month, the usualretirement age for the company’s employees.","example[17]":"You must make adequate provision for your retirement.","definition[3]":"money paid to someone after they have stopped work at the end of their working life","example[18]":"IBM decided to give full retirement benefits to employees with 30 years of service, regardless of their age.","definition[4]":"the act of paying off a loan completely, usually before the normal time","example[19]":"The remaining £21 million will cover theretirement of debt.","note[3]":"retirement of"}