{"word[0]":"redundancy","plural[0]":"redundancies","definition[0]":"a situation in which someone has to leave their job, because they are no longer needed","synonym[0]":"layoff","example[0]":"The closure of the export department resulted in over 100 redundancies.","example[1]":"Two thousand workers now face redundancy.","example[2]":"An employee is not eligible for a redundancy payment unless he has been with the company for two years.","example[3]":"We were offered a £3,000 cash bonus to take voluntary redundancy.","note[0]":"voluntary/compulsory redundancy","definition[1]":"when something is not used because something similar or the same already exists","collocation[0]":"make redundancies","example[4]":"The company is to make 1,400 redundancies.","collocation[1]":"face redundancy","example[5]":"Up to 300 leather factory workers are facing redundancy.","collocation[2]":"take/accept redundancy","example[6]":"Twenty staff members took voluntary redundancy.","collocation[3]":"volunteer for redundancy","example[7]":"Nearly 40% of the workforce volunteered for redundancy.","collocation[4]":"compulsory redundancies","example[8]":"He promised there would be no compulsory redundancies.","collocation[5]":"voluntary redundancies","example[9]":"Wherever possible the cuts will be achieved by voluntary redundancies.","collocation[6]":"mass/large-scale redundancies","example[10]":"The company is preparing large-scale redundancies at its British factories.","form[0]":"redundancy + NOUN","collocation[7]":"redundancy money/pay","example[11]":"He spent his redundancy money on a plot of land.","collocation[8]":"a redundancy payment","example[12]":"He was not entitled to a redundancy payment.","collocation[9]":"redundancy terms","example[13]":"Some staff had chosen to go because the voluntary redundancy terms were attractive.","collocation[10]":"a redundancy package","example[14]":"The trade union negotiated a generous redundancy package for its members.","collocation[11]":"a redundancy notice","example[15]":"1,100 of the bank's 1,260 staff in the UK were given redundancy notices.","collocation[12]":"a round of redundancies","example[16]":"The industry has announced a new round of redundancies.","collocation[13]":"a wave of redundancies","example[17]":"The latest wave of redundancies resulted in 4,000 job cuts.","definition[2]":"when someone loses their job in a company because the job is no longer needed","example[18]":"Over 2000 car workers now face redundancy.","example[19]":"Several members of staff have taken voluntary redundancy (=they have agreed to be made redundant, usually in return for a cash payment).","example[20]":"Because of low export sales, the company was forced to make 700 redundancies.","example[21]":"a generous redundancy package (=all the payments and other benefits that someone receives from their company when they are made redundant)"}