{"word[0]":"dangerous","definition[0]":"able or likely to harm or kill you","example[0]":"laws about dangerous dogs","example[1]":"Some of these prisoners are extremely dangerous.","example[2]":"The powdered milk was not as good as breast milk, and was downright dangerous (=actually dangerous) when it was mixed with unclean water.","example[3]":"It was a highly dangerous situation.","note[0]":"highly/very dangerous","example[4]":"The crumbling sidewalks are dangerous for old people.","note[1]":"dangerous for","example[5]":"The virus is probably not dangerous to humans.","note[2]":"dangerous to","example[6]":"It’s dangerous for a woman to walk alone at night.","note[3]":"it is dangerous for somebody to do something","definition[1]":"involving a lot of risk, or likely to cause problems","synonym[0]":"risky","example[7]":"The business is in a dangerous financial position.","example[8]":"a politically dangerous strategy","definition[2]":"likely to cause death or serious harm, or cause something bad to happen","example[9]":"Snow and ice are making driving conditions very dangerous.","example[10]":"dangerous drugs","example[11]":"a dangerous criminal","definition[3]":"if something is risky, something bad could easily happen or you could easily make a mistake","example[12]":"Doctors said it was too risky to operate.","example[13]":"a risky situation","display[0]":"hazardous","definition[4]":"dangerous – used especially about substances, jobs, and journeys","example[14]":"hazardous waste","example[15]":"hazardous chemicals","example[16]":"hazardous occupations","example[17]":"The expedition was extremely hazardous.","display[1]":"unsafe","definition[5]":"dangerous because someone is very likely to be hurt – used especially about places or conditions","example[18]":"The roads are unsafe for cyclists.","example[19]":"unsafe working conditions","display[2]":"treacherous","definition[6]":"places or conditions that are treacherous are very dangerous for anyone who is walking, driving, climbing etc in them","example[20]":"The snow turned to ice, making conditions treacherous for walkers.","example[21]":"the island’s treacherous coastline","example[22]":"With no lighting, the roads can be treacherous.","display[3]":"perilous","definition[7]":"a perilous journey, situation etc is very dangerous","example[23]":"a perilous journey across the sea","display[4]":"high-risk","definition[8]":"a high-risk job, situation, or behaviour is likely to be dangerous","example[24]":"Drug users need to know that sharing needles is high-risk behaviour."}