{"word[0]":"wreckage","definition[0]":"the parts of something such as a plane, ship, or building that are left after it has been destroyed in an accident","example[0]":"Firemen managed to pull some survivors from the wreckage.","example[1]":"Accident investigators will examine the wreckage of the plane.","note[0]":"wreckage of","definition[1]":"the parts of someone’s relationships, hopes, or plans that remain after they have been spoiled","example[2]":"She still hoped to salvage something from the wreckage of her marriage.","collocation[0]":"be pulled from the wreckage","example[3]":"The driver was pulled from the wreckage of his car.","collocation[1]":"be cut (free) from the wreckage","example[4]":"She had to be cut free from the wreckage by firemen.","collocation[2]":"be trapped in the wreckage","example[5]":"He was trapped in the wreckage for almost seven hours.","collocation[3]":"wreckage is strewn/scattered/spread","example[6]":"The wreckage was strewn over a large area.","collocation[4]":"sift through wreckage","example[7]":"Crash investigators have been sifting through the wreckage of the plane.","collocation[5]":"examine wreckage","example[8]":"Forensic experts were yesterday examining the wreckage.","collocation[6]":"survey the wreckage","example[9]":"After the explosion, they got cautiously to their feet, surveying the wreckage.","collocation[7]":"recover something from the wreckage","example[10]":"The bodies of two children were recovered from the wreckage.","form[0]":"ADJECTIVES/NOUN + wreckage","collocation[8]":"burning/blazing/smoking wreckage","example[11]":"He managed to crawl away from the burning wreckage.","collocation[9]":"mangled/tangled/twisted wreckage","example[12]":"Recovery teams continue to clear the tangled wreckage.","collocation[10]":"scattered wreckage","example[13]":"The equipment was used to clear the scattered wreckage of the two trains.","collocation[11]":"aircraft/plane wreckage","example[14]":"The major task is now to remove the aircraft wreckage from the accident site.","collocation[12]":"a piece of wreckage","example[15]":"The fishermen were left clinging to pieces of wreckage.","definition[2]":"the situation when a business activity, company, system etc fails to succeed","example[16]":"Communism’s economic wreckage was visible even in this small place.","example[17]":"the wreckage caused by overbuilding  (=building too much) in the Southwest"}