{"word[0]":"get out","definition[0]":"to leave a room or building","example[0]":"You ought to get out into the fresh air.","example[1]":"Mary screamed at me to get out.","example[2]":"Get out of the kitchen!","definition[1]":"to escape from a place","example[3]":"Some of the animals had got out.","example[4]":"He was determined to get out of prison.","signpost[0]":"help somebody escape","definition[2]":"to help someone leave a place or escape from a place","example[5]":"It’s important to get these people out as soon as possible.","example[6]":"We knew it was going to be difficult to get him out of the country.","note[0]":"get somebody out of","signpost[1]":"take something from a place","definition[3]":"to take something from the place where it is kept","example[7]":"She got out her violin and started to play.","definition[4]":"if information gets out, a lot of people then know it although it is meant to be secret","example[8]":"We have to make absolutely certain that none of this gets out.","example[9]":"It’s bound to get out that he’s retiring soon.","signpost[2]":"produce something","definition[5]":"to produce a book or other product that can be sold to people","example[10]":"We’re hoping to get the new catalogue out next week.","signpost[3]":"say something","definition[6]":"to succeed in saying something, especially when this is very difficult","example[11]":"I wanted to tell him I loved him, but couldn’t get the words out.","definition[7]":"to stop investing in or making a particular product or performing a particular activity, usually because it is no longer making a profit","example[12]":"Investors can get out early if trouble arises.","example[13]":"Most banks are now getting out of development finance.","definition[8]":"to avoid meeting the terms of a contract, agreement etc","example[14]":"The company hopes the move will let it get out of costly gas supply contracts.","definition[9]":"to succeed in producing something and making it available","example[15]":"We must get those letters out on time.","example[16]":"IBM wanted to get out a system that the novice could use."}