{"word[0]":"main","definition[0]":"larger or more important than all other things, ideas etc of the same kind","example[0]":"The main reason for living in Spain is the weather.","example[1]":"What do you consider to be the main problem?","example[2]":"Our main concern is that the children are safe.","example[3]":"a summary of the main points of the agreement","example[4]":"the main aim of the meeting","example[5]":"I’ll meet you outside the main entrance.","example[6]":"the main bedroom","definition[1]":"larger or more important than all the others","example[7]":"the main entrance of the building","example[8]":"the main reason for his decision","display[0]":"chief/principal","definition[2]":"most important. Chief and principal are more formal than main, and are often used in written English","example[9]":"Coffee is the country’s principal export.","example[10]":"What is the company’s chief objective?","display[1]":"major","definition[3]":"very important or serious","example[11]":"Smoking is a major cause of heart disease.","example[12]":"Street crime is becoming a major problem.","display[2]":"key","definition[4]":"most important, or the one that everything or everyone else depends on","example[13]":"Education is likely to be a key issue in the election campaign.","example[14]":"Hooper was a key member of the team.","example[15]":"Diet is key.","display[3]":"number one","definition[5]":"most important or best – this phrase sounds a little informal and it is used especially in spoken English","example[16]":"Reliability is the number one priority.","example[17]":"the number one cause of death","example[18]":"He is still in the number one position.","display[4]":"primary","definition[6]":"most important – used especially about the most important aim, role, cause, or concern. Primary  is more formal than main","example[19]":"The primary aim of the project was to help students develop their communication skills.","example[20]":"Security is our primary concern.","example[21]":"The primary function of the university was considered to be the teaching of ‘the great cultural disciplines’.","display[5]":"prime","definition[7]":"very important or most important – used especially about the most important reason, cause, or aim, or about the most likely target or suspect. Prime  is more formal than main","example[22]":"Their prime objective is to increase profits for their shareholders.","example[23]":"Tourists are prime targets for theft and robbery.","display[6]":"core","definition[8]":"most important – used especially about the things that people should pay most attention to","example[24]":"the core skills of reading and writing","example[25]":"He wants the company to focus on its core business – advertising.","example[26]":"The party’s core values are individual freedom and reducing the amount of government bureaucracy.","display[7]":"central","definition[9]":"most important and having more influence than anything else","example[27]":"The U.S. played a central role in the peace negotiations.","example[28]":"a central theme of the book","example[29]":"The central question is, why are people still so attached to their cars?","display[8]":"predominant","definition[10]":"most common, typical, or important","example[30]":"Yellow was the predominant colour everywhere.","example[31]":"High arched windows are a predominant feature in English churches.","example[32]":"New York still has a predominant role in the contemporary art world.","definition[11]":"a large pipe or wire carrying the public supply of water, electricity, or gas","example[33]":"The report found that many of Yorkshire’s water mains needed replacing.","example[34]":"a burst gas main","definition[12]":"the place on a wall where you can connect something to a supply of electricity","example[35]":"You can run the torch off batteries or plug it into the mains.","example[36]":"Make sure that the television is turned off at the mains.","note[0]":"at the mains","definition[13]":"gas, water, or electricity supplied to a building through a pipe or wire","example[37]":"The heater will run off mains gas or bottled gas."}