{"word[0]":"threat","definition[0]":"a statement in which you tell someone that you will cause them harm or trouble if they do not do what you want","example[0]":"Your threats don’t scare me.","example[1]":"threats made against his wife and children","example[2]":"Nichols never carried out his threat to resign.","example[3]":"The government will not give in to terrorist threats.","example[4]":"She dismissed the statement as an empty threat.","example[5]":"They warned him with veiled threats not to mention anything he had witnessed.","example[6]":"The police are investigating death threats made against the two men.","example[7]":"Officials at the school say they received a bomb threat at approximately 11:30 a.m. today.","example[8]":"the threat of military invasion","note[0]":"threat of","example[9]":"He says his family received phone threats from the group.","note[1]":"threat from","definition[1]":"the possibility that something very bad will happen","example[10]":"The program is under threat of closure due to lack of funding.","note[2]":"be under threat of closure/attack etc","example[11]":"the threat of famine","example[12]":"According to the Secretary of State, the Russians face no threat from an expanded NATO.","example[13]":"The area remains under threat from commercial developers.","note[3]":"under threat","definition[2]":"someone or something that is regarded as a possible danger","example[14]":"Pollution poses a threat to fish.","note[4]":"present/pose a threat (to somebody/something)","example[15]":"The fighting is a major threat to stability in the region.","note[5]":"threat to","heading[0]":"– Meaning 1: a statement in which you tell someone that you will cause them harm or trouble if they do not do what you want","collocation[0]":"make/issue a threat","example[16]":"Neighbours say that they heard Gardiner make threats against his wife.","collocation[1]":"carry out a threat","example[17]":"She ought to have carried out her threat to go to the police.","collocation[2]":"give in to a threat","example[18]":"The government is not going to give in to terrorist threats.","form[0]":"ADJECTIVES/NOUN + threat","collocation[3]":"a death threat","example[19]":"Scientists involved in the research have received death threats.","collocation[4]":"a bomb threat","example[20]":"The station was closed because of a bomb threat.","collocation[5]":"an empty/idle threat","example[21]":"She was not a woman to make idle threats.","collocation[6]":"a veiled threat","example[22]":"The emails contained thinly veiled threats of harm.","heading[1]":"– Meanings 2 & 3","collocation[7]":"a serious/major threat","example[23]":"Bad air quality poses a serious threat to public health.","collocation[8]":"the greatest/biggest threat","example[24]":"The greatest threat to our planet is global warming.","collocation[9]":"a real threat","example[25]":"These measures pose a real threat to the future of agriculture.","collocation[10]":"a potential threat","example[26]":"The group remains a potential threat to the regime.","collocation[11]":"an immediate threat","example[27]":"The volcano erupted on Thursday but there is no immediate threat to nearby towns.","collocation[12]":"a direct threat","example[28]":"The workers destroyed the textile machinery which they saw as a direct threat to their jobs.","collocation[13]":"a military threat","example[29]":"Each country regarded the other as a major military threat.","collocation[14]":"a terrorist threat","example[30]":"U.S. officials underestimated the terrorist threat before the June 25 bombing.","collocation[15]":"pose/present a threat","example[31]":"The rebels do not pose a serious threat to the armed forces.","collocation[16]":"represent a threat","example[32]":"He is not afraid, because you represent no threat to him.","collocation[17]":"counter/combat a threat","example[33]":"We must work together to counter the threat of state terrorism.","collocation[18]":"face a threat","example[34]":"The factory is facing the threat of closure.","collocation[19]":"meet a threat","example[35]":"We must transform our armed forces to meet emerging threats."}