{"word[0]":"organic","signpost[0]":"farming","definition[0]":"relating to farming or gardening methods of growing food without using artificial chemicals, or produced or grown by these methods","example[0]":"Organic farming is better for the environment.","example[1]":"organic gardening","example[2]":"The shop sells organic food.","note[0]":"organic food/vegetables/milk etc","example[3]":"organic wine","signpost[1]":"development","definition[1]":"change or development which is organic happens in a natural way, without anyone planning it or forcing it to happen","example[4]":"The company’s path to success was by means of organic growth.","signpost[2]":"living things","definition[2]":"living, or produced by or from living things","opposite[0]":"inorganic","example[5]":"Adding organic matter such as manure can improve the soil.","example[6]":"Bacteria act on organic waste.","signpost[3]":"part of something","definition[3]":"an organic system or relationship is one in which the parts or people fit well and in a comfortable way with each other","example[7]":"an organic relationship between the individual and his community","example[8]":"They believe in the organic unity of the universe.","signpost[4]":"body organs","definition[4]":"relating to the organs of the body","example[9]":"organic diseases","collocation[0]":"organic food/vegetables etc","example[10]":"Our restaurant uses only fresh organic vegetables.","example[11]":"Many people think that organic food is better for health.","collocation[1]":"organic farming","example[12]":"the environmental benefits of organic farming","collocation[2]":"organic farmers/farms","example[13]":"Organic farmers build up soil fertility by crop rotation.","example[14]":"Synthetic fertilisers are banned on organic farms.","collocation[3]":"organic produce","example[15]":"The store stocks a wide range of organic produce.","collocation[4]":"go organic","example[16]":"Not all families can afford to go organic.","collocation[5]":"become organic","example[17]":"More farms are becoming organic, but it is not always an easy choice.","collocation[6]":"totally/fully organic","example[18]":"All the ingredients are totally organic.","definition[5]":"relating to methods of growing food without using artificial chemicals","example[19]":"They claim that organic farming is better for the environment.","example[20]":"the expanding market for organic produce","definition[6]":"the organic growth of a company involves developing its existing business rather than buying other companies","example[21]":"We’ll look to grow through a mixture of organic growth and acquisition."}