{"word[0]":"effect","signpost[0]":"change/result","definition[0]":"a change that is caused by an event, action etc","example[0]":"This ingredient also has the effect of making your skin look younger.","example[1]":"A system failure has a knock-on effect throughout the whole hotel.","example[2]":"the cumulative effect of human activities on the global environment","example[3]":"A much lower dose of the painkiller can still produce the desired effect.","example[4]":"In mental illness, there is a complex relationship between cause and effect.","example[5]":"My parents’ divorce had a big effect on me.","note[0]":"effect on","example[6]":"the harmful effects of modern farming practices","note[1]":"effect of","example[7]":"the long-term effects of the drug","example[8]":"I could feel the effects of the thin mountain air.","signpost[1]":"law/rule","definition[1]":"if a law, rule, or system takes effect or comes into effect, it officially starts","definition[2]":"if a law, rule, or system is in effect, it is being used now","signpost[2]":"idea/feeling","definition[3]":"an idea or feeling that an artist, speaker, book etc tries to make you think of or to feel","synonym[0]":"impression","example[9]":"Turner’s paintings give an effect of light.","definition[4]":"an unusual or impressive sound or image that is artificially produced for a film, play, or radio programme","collocation[0]":"have an effect on something/somebody","example[10]":"Eating junk food will eventually have an effect on your health.","collocation[1]":"have the effect of doing something","example[11]":"The news had the effect of making everyone feel better.","collocation[2]":"produce an effect","example[12]":"If we combine these sounds, they produce an effect that is almost jazzy.","collocation[3]":"feel an effect","example[13]":"Small companies will feel the effect of the recession first.","collocation[4]":"lessen/reduce an effect","example[14]":"The government must take action to reduce the effects of pollution.","collocation[5]":"cushion the effect of something","example[15]":"Lower mortgage rates will cushion the effect of rising house prices.","collocation[6]":"an effect lasts","example[16]":"The effect of the drug lasts about six hours.","collocation[7]":"an effect wears off","example[17]":"The effect of the anaesthetic was beginning to wear off.","collocation[8]":"big/major","example[18]":"The teachers’ strike had a big effect on many schools.","collocation[9]":"significant/substantial/marked","example[19]":"Global warming could have a significant effect on agriculture in many parts of the world.","collocation[10]":"profound/powerful","example[20]":"My father’s death had a profound effect on me.","collocation[11]":"dramatic","example[21]":"Taking the new drug had a dramatic effect on his health.","example[22]":"The drugs have a relatively small effect on a lot of patients.","collocation[12]":"negligible/minimal","example[23]":"The advertising campaign had a negligible effect on demand.","collocation[13]":"immediate","example[24]":"The announcement had an immediate effect on stock prices.","example[25]":"Inflation can sometimes have some good effects on the economy.","collocation[14]":"positive/beneficial","example[26]":"The incident had a very positive effect on his career.","example[27]":"Working too hard was beginning to have a bad effect on my health.","collocation[15]":"negative/detrimental","example[28]":"the negative effects of low rainfall","collocation[16]":"harmful/damaging","example[29]":"the harmful effects of drinking too much alcohol","example[30]":"Some of the effects can be quite damaging.","collocation[17]":"visible/noticeable","example[31]":"He drank five beers, but they did not seem to have any visible effect on him.","collocation[18]":"the adverse effects","example[32]":"No one told them about the adverse effects of smoking marijuana.","collocation[19]":"the long-term/short-term effect","example[33]":"Many boxers suffer with the long-term effects of punches to the head.","collocation[20]":"a knock-on effect","example[34]":"The strike could have a knock-on effect at other airports.","collocation[21]":"a cumulative effect","example[35]":"The cumulative effect of these policies will be to push up inflation.","collocation[22]":"the desired effect","example[36]":"His team talk had the desired effect because the team went on to win the game.","collocation[23]":"the full effect","example[37]":"We won’t know the full effect of the tax changes until the end of the financial year.","collocation[24]":"a calming/soothing effect","example[38]":"His words seemed to have a calming effect on the crowd.","example[39]":"The people in this area are still suffering from the effects of the famine.","example[40]":"The treatment had little or no effect.","display[0]":"impact","definition[5]":"an effect that happens as a result of something important, especially a big and permanent effect","example[41]":"Changes in technology have had a massive impact on the way we work.","example[42]":"the environmental impact of industrial activity","display[1]":"influence","definition[6]":"the effect that something has on people’s opinions or behaviour, or on how something develops","example[43]":"American television has had a big influence on popular culture in the west.","example[44]":"His ideas had a lot of influence at the time.","display[2]":"side effect","definition[7]":"an unwanted and unplanned effect that something has – used especially about drugs and medical treatment","example[45]":"Common side effects of the drug may include headaches and muscle pains.","display[3]":"after-effects","definition[8]":"bad effects that continue for a long time after the thing that caused them","example[46]":"A traumatic experience can have severe psychological after-effects.","example[47]":"the after-effects of the war","display[4]":"repercussions","definition[9]":"the effects that happen later as a result of an event or decision, especially a range of effects that continue for a long time","example[48]":"The scandal could have serious repercussions for her career.","example[49]":"The judge’s decision is likely to have important repercussions for future cases of this kind.","definition[10]":"used when something has an effect on something, which then has an effect on something else","example[50]":"Higher oil prices have a knock-on effect on other fuels.","display[5]":"footprint","definition[11]":"the effect that human activities have on the environment, caused by using up its natural resources, pollution, waste etc","example[51]":"Businesses all over the world must attempt to reduce their environmental footprint.","example[52]":"The house has a low carbon footprint (=it uses very little energy from carbon and therefore is good for the environment).","definition[12]":"to make something happen","synonym[1]":"bring about","example[53]":"Many parents lack confidence in their ability to effect change in their children’s behaviour.","definition[13]":"the way in which an action, event, or person changes someone or something","example[54]":"Inflation is having a disastrous effect on the economy.","definition[14]":"to make a plan or idea happen","example[55]":"It won’t be easy to put the changes into effect.","definition[15]":"if a new arrangement, law, system etc comes into effect or takes effect, it officially starts","example[56]":"The new tax rates come into effect in April.","definition[16]":"starting to happen immediately, or from a particular date","example[57]":"Mr Hoskins is appointed manager, with immediate effect.","definition[17]":"the things that someone owns","example[58]":"Insurance also covers personal effects required during travel on company business.","example[59]":"You must obtain your client’s approval of the estate agent’s fees before you effect payment of them."}