{"word[0]":"etc.","definition[0]":"used in writing after a list to show that there are many other similar things or people that you could have added","example[0]":"a shop which sells cards, calendars, wrapping paper etc","example[1]":"The letter says pay at once, they’ve reminded us before etc. etc.","note[0]":"etc. etc.","explanation[0]":"When writing essays, articles, or business letters, people usually avoid using etc. or etcetera, and write the sentence another way using such as:","definition[1]":"used when you want to say that there are many other examples of things of the same kind. The full form is et cetera, but this is rarely used. Don’t use etc. in essays or formal writing","example[2]":"They asked me about my past experience, qualifications etc.","example[3]":"Precise details of times, dates etc. should be recorded.","display[0]":"such as","definition[2]":"used before one or more nouns to say that there are many other examples of the same kind. It is better to use such as rather than etc. in essays and formal writing","example[4]":"It is best to avoid drinks such as tea, coffee or alcohol.","example[5]":"a distressing event such as the break-up of a marriage","display[1]":"to name (but) a few","definition[3]":"used after examples of something when saying that there are many more you could have mentioned","example[6]":"Our daily activities include tennis, swimming, darts, snooker to name but a few.","display[2]":"and so on","definition[4]":"used in spoken English when you want to say that there are other examples of things of the same kind. Don’t use and so on in essays or formal writing – it sounds too vague","example[7]":"You can do things to look after yourself in the way of diet, exercise, not smoking and so on.","display[3]":"and many others","definition[5]":"and many other people or things","example[8]":"The book includes poems by Christina Rossetti, William Blake and many others.","example[9]":"The college offers courses in maths, physics, computer science and many others.","definition[6]":"et cetera; used after a list to show that there are other similar things or people that could have been added","example[10]":"Loans have been taken out to cover the cost of repairs, new equipment etc."}