{"word[0]":"group","definition[0]":"several people or things that are all together in the same place","example[0]":"A group of us are going to London.","example[1]":"a group of children","note[0]":"group of","example[2]":"a small group of islands","example[3]":"Get into groups of four.","example[4]":"He was surrounded by a group of admirers.","example[5]":"Dolphins travel in small groups.","note[1]":"in groups","definition[1]":"several people or things that are connected with each other","example[6]":"a left-wing terrorist group","example[7]":"Minority groups are encouraged to apply.","note[2]":"age/ethnic/income etc group","example[8]":"She is one of a group of women who have suffered severe side-effects from the drug.","definition[2]":"several companies that all have the same owner","example[9]":"a giant textiles group","example[10]":"He owns a group of hotels in southern England.","definition[3]":"a number of musicians or singers who perform together, playing popular music","synonym[0]":"band","collocation[0]":"a member of a group/a group member","example[11]":"Frank was invited to be a member of the group.","collocation[1]":"a group of three, four, five etc","example[12]":"There was a group of three at the bar, two men and a woman.","form[0]":"ADJECTIVES/NOUN + group","collocation[2]":"an age group","example[13]":"Older people are being affected by the economic downturn more than other age groups.","collocation[3]":"an ethnic group","example[14]":"The university welcomes enquiries and applications from all ethnic groups.","collocation[4]":"a minority group","example[15]":"Conditions for many minority groups have worsened.","collocation[5]":"a racial group","example[16]":"Schools should not stereotype pupils from certain racial groups as troublemakers.","collocation[6]":"a social group","example[17]":"Lower social groups had a higher average family size.","collocation[7]":"an income group","example[18]":"The budget will affect people differently, according to their income group.","collocation[8]":"somebody’s peer group","example[19]":"Many girls at school derive enormous strength from their peer groups.","collocation[9]":"a pressure group","example[20]":"Friends of the Earth is Britain’s leading environmental pressure group.","collocation[10]":"a protest group","example[21]":"They formed a protest group and a petition of 50,000 signatures was presented at the town hall.","collocation[11]":"a splinter group","example[22]":"A Social Democratic Party ( SDP), formed as a splinter group of the Socialist Party of Serbia.","collocation[12]":"a close-knit/closely-knit/tightly-knit group","example[23]":"The young mothers in the village are a fairly close-knit group.","collocation[13]":"a support group","example[24]":"She set up a support group for people suffering from the same illness.","collocation[14]":"a control group","example[25]":"A control group had to be examined as well as the group that we are studying.","form[1]":"group + NOUN","collocation[15]":"a group decision","example[26]":"Being involved in a group decision can help motivate workers.","collocation[16]":"a group discussion","example[27]":"The course includes both individual work and group discussions.","collocation[17]":"a group leader","example[28]":"There were three groups of eight people, each with a group leader.","collocation[18]":"belong to a group","example[29]":"Ben belonged to an environmental group.","collocation[19]":"get into groups","example[30]":"The teacher asked the students to get into groups.","collocation[20]":"organize something into groups","example[31]":"Small children work best when they are organized into very small groups.","collocation[21]":"join a group","example[32]":"He joined a self-help group for divorced men.","collocation[22]":"leave a group","example[33]":"Rebecca left the group following a disagreement.","heading[0]":"– Meaning 4: a number of musicians or singers who perform together, playing popular music","form[2]":"NOUN + group","collocation[23]":"a pop/rock/jazz group","example[34]":"They’re one of the most exciting pop groups around at the moment.","collocation[24]":"a member of a group","example[35]":"Jeremy was a member of a heavy metal group.","collocation[25]":"be in a group","example[36]":"She's in a jazz group, playing the saxophone.","collocation[26]":"start a group","example[37]":"Ben and some friends started a rock group at school.","collocation[27]":"found a group","example[38]":"Mick Jagger and Keith Richards founded the group in the early Sixties.","collocation[28]":"a group splits up","example[39]":"The group split up because of ‘musical differences’.","collocation[29]":"a group re-forms","example[40]":"The group has re-formed and is planning a series of comeback concerts.","explanation[0]":"Group is usually followed by a singular verb","example[41]":"This group has a higher risk of heart disease","example[42]":"His group plays jazz","example[43]":"This group have a higher risk of heart disease","example[44]":"His group play jazz","heading[1]":"of people","definition[4]":"several people together in the same place","example[45]":"A group of boys stood by the school gate.","example[46]":"Arrange yourselves in groups of three.","definition[5]":"a large group of people who have come to a place to do something","example[47]":"There were crowds of shoppers in the streets.","example[48]":"The crowd all cheered.","display[0]":"mob","definition[6]":"a large, noisy, and perhaps violent crowd","example[49]":"An angry mob of demonstrators approached.","display[1]":"mass","definition[7]":"a large group of people all close together in one place, so that they seem like a single thing","example[50]":"The square in front of the station was a solid mass of people.","display[2]":"bunch","definition[8]":"a group of people who are all similar in some way","example[51]":"They’re a nice bunch of kids.","display[3]":"gang","definition[9]":"a group of young people, especially a group that often causes trouble and fights","example[52]":"He was attacked by a gang of youths.","display[4]":"rabble","definition[10]":"a noisy group of people who are behaving badly","example[53]":"He was met by a rabble of noisy angry youths.","display[5]":"horde","definition[11]":"a very large group of people who all go somewhere","example[54]":"In summer hordes of tourists flock to the island.","example[55]":"There were hordes of people coming out of the subway.","display[6]":"crew","definition[12]":"a group of people who all work together, especially on a ship or plane","example[56]":"the ship’s crew","example[57]":"The flight crew will serve drinks shortly.","display[7]":"party","definition[13]":"a group of people who are travelling or working together","example[58]":"A party of tourists stood at the entrance to the temple.","heading[2]":"of animals","display[8]":"herd","definition[14]":"a group of cows, deer, or elephants","example[59]":"A herd of cows was blocking the road.","display[9]":"team","definition[15]":"a group of animals that work together","example[60]":"The carriage was pulled by a team of horses.","display[10]":"flock","definition[16]":"a group of sheep or birds","example[61]":"a flock of seagulls","example[62]":"The farmer has over 100 sheep in his flock.","display[11]":"pack","definition[17]":"a group of dogs or wolves","example[63]":"Some dogs are bred to work in packs.","display[12]":"litter","definition[18]":"a group of kittens or puppies born at one time to a particular mother","example[64]":"He was one of a litter of seven puppies.","display[13]":"school/shoal","definition[19]":"a group of fish or dolphins","example[65]":"Piranha fish live in shoals in the wild.","heading[3]":"of things","definition[20]":"a group of things held or tied together, especially flowers or keys","example[66]":"He handed me a bunch of daffodils.","display[14]":"bundle","definition[21]":"several papers, clothes, or sticks held or tied together in an untidy pile","example[67]":"Bundles of papers and files filled the shelves.","display[15]":"cluster","definition[22]":"a group of things of the same kind that are close together in a place","example[68]":"a cluster of stars","example[69]":"Our road ended at a cluster of cottages.","definition[23]":"to come together and form a group, or to arrange things or people together in a group","example[70]":"The photo shows four men grouped round a jeep.","note[3]":"group (something) together/round/into etc","example[71]":"Different flowers can be grouped together to make a colourful display.","example[72]":"small producers who group together to sell their produce","definition[24]":"to divide people or things into groups according to a system","example[73]":"We were grouped into six age bands.","example[74]":"We’ve grouped the questions under three headings.","definition[25]":"a large business organization that consists of several companies that all have the same owner","example[75]":"Burmah Castrol, the lubricants group","example[76]":"the sale of the Rover Group to BMW","example[77]":"a dramatic surge in group profits","example[78]":"the group chairman","definition[26]":"several people or things considered together"}