{"word[0]":"rally","plural[0]":"rallies","definition[0]":"a large public meeting, especially one that is held outdoors to support a political idea, protest etc","example[0]":"About 1,000 people attended the rally in Hyde Park.","example[1]":"We decided to hold a rally to put pressure on the government.","example[2]":"a mass rally (=large rally) in support of the pay claim","example[3]":"He was shot dead while addressing an election rally.","note[0]":"political/election/peace etc rally","definition[1]":"a car race on public roads","example[4]":"a rally driver","definition[2]":"an occasion when something, especially the value of shares, becomes stronger again after a period of weakness or defeat","example[5]":"a late rally in the Tokyo stock market","definition[3]":"a continuous series of hits of the ball between players in a game such as tennis","collocation[0]":"hold/stage a rally","example[6]":"The students had been refused permission to hold their rally in Victory Square.","collocation[1]":"organize a rally","example[7]":"A rally organized by democratic movements was broken up by soldiers.","collocation[2]":"attend a rally","example[8]":"About 200 people braved the weather to attend the rally.","collocation[3]":"address a rally","example[9]":"The next evening he addressed a large anti-government rally.","form[0]":"ADJECTIVES/NOUN + rally","collocation[4]":"a large/huge/massive rally","example[10]":"Several large rallies were held in December.","collocation[5]":"a mass rally","example[11]":"a mass rally of striking dockers","collocation[6]":"a political rally","example[12]":"Her parents were often away attending political rallies.","collocation[7]":"an election rally","example[13]":"The senator was due to address an election rally that evening.","collocation[8]":"a campaign rally","example[14]":"She will attend four campaign rallies in the state before returning to Washington.","collocation[9]":"a protest rally","example[15]":"Minor clashes between police and demonstrators occurred during a protest rally.","collocation[10]":"a peace rally","example[16]":"CND are organising a massive Peace Rally on the second Sunday in July.","collocation[11]":"an anti-government/anti-war etc rally","example[17]":"The peace groups made plans to hold an anti-war rally.","collocation[12]":"a pro-democracy/pro-independence etc rally","example[18]":"Thousands joined a pro-democracy rally in the city.","definition[4]":"to come together, or to bring people together, to support an idea, a political party etc","example[19]":"an attempt to rally support for the party","example[20]":"Fellow Republicans rallied to the president’s defense.","note[1]":"rally to","example[21]":"Surely the local business community could have rallied to raise the cash.","note[2]":"rally to do something","definition[5]":"to become stronger again after a period of weakness or defeat","example[22]":"After a shaky start, he rallied and won the title in style.","example[23]":"The Tokyo stock market rallied later in the day.","past_tense[0]":"rallied","definition[6]":"if prices of shares, currencies etc rally, they rise again after falling","example[24]":"Stock prices rallied this afternoon after earlier falls.","example[25]":"Volvo B shares rallied 5 Swedish kronor to 398 kronor."}