{"word[0]":"stay","signpost[0]":"in a place","definition[0]":"to remain in a place rather than leave","example[0]":"They stayed all afternoon chatting.","example[1]":"I decided to stay home.","note[0]":"stay (at) home","example[2]":"Isabel stayed for a year in Paris to study.","note[1]":"stay for a year/ten minutes/a week etc","example[3]":"Stay right there! I’ll be back in a minute.","note[2]":"stay here/there","example[4]":"Why don’t you stay for supper?","note[3]":"stay to dinner/stay for lunch etc","example[5]":"Stay in bed and drink plenty of liquids.","note[4]":"stay in","example[6]":"She stayed late to finish the report.","example[7]":"Some of the students stayed after class  (=remained after others had gone) to talk.","note[5]":"stay behind/after","example[8]":"I should stay and help.","note[6]":"stay and do something","explanation[0]":"In written English, people often prefer to use remain rather than stay, because it sounds more formal:","example[9]":"Many people opted to remain in their homes.","example[10]":"She remained as his deputy for ten years.","type[0]":"intransitive always + adverb/preposition, linking verb","signpost[1]":"in a condition","definition[1]":"to continue to be in a particular position, place, or state, without changing","synonym[0]":"remain","example[11]":"Rollings will stay as chairman this year.","example[12]":"Eat right to stay healthy.","note[7]":"stay adj","example[13]":"It was hard to stay awake.","example[14]":"Nine women gained weight, and four stayed the same.","example[15]":"Stay away from my daughter!","note[8]":"stay away/in/on etc","example[16]":"You stay on this road for a mile before turning off.","example[17]":"Most of her boyfriends don’t stay around  (=stay with her) very long.","note[9]":"stay around","explanation[1]":"Stay is a linking verb in this meaning This type of verb links the subject of the sentence with an adjective or noun","example[18]":"They’re just trying to stay alive","example[19]":"I hope we can stay friends","signpost[2]":"live somewhere","definition[2]":"to live in a place for a short time as a visitor or guest","example[20]":"How long are they going to stay?","example[21]":"Did you stay the night at Carolyn’s?","note[10]":"stay the night/stay overnight/stay over","example[22]":"My mother is staying with us this week.","note[11]":"stay at/with","example[23]":"They’re staying in the same hotel.","definition[3]":"to not leave a place, or to be in a place for a particular period of time","example[24]":"Stay where you are and don’t move.","example[25]":"John only stayed at the party for a couple of hours.","definition[4]":"to stay somewhere. In written English, people often prefer to use remain  rather than stay, because it sounds more formal","example[26]":"Some 2,000 protesters remained outside the building and refused to leave.","example[27]":"The judge recommended that he remain in jail for the rest of his life.","display[0]":"linger","definition[5]":"to stay in a place a little longer than you need to, because you are enjoying yourself, or because you hope to see someone or something","example[28]":"He lingered outside the lecture hall, hoping for a chance to talk to her.","example[29]":"There are plenty of small cafés where you can linger over a cappuccino.","display[1]":"loiter","definition[6]":"to stay in a place not doing anything – used when you think someone is waiting for the chance to do something bad or illegal","example[30]":"The two men had been seen loitering in the area on the day that the car was stolen.","display[2]":"hang around","definition[7]":"to stay somewhere not doing anything","example[31]":"There are gangs of boys hanging around on street corners.","example[32]":"I don’t mind hanging around for a few minutes.","example[33]":"The boss doesn’t like being kept hanging around.","display[3]":"stick around","definition[8]":"to stay in the same place or situation for a period of time, especially while you are waiting for something to happen or someone to arrive","example[34]":"I decided to stick around and see how it all turned out.","example[35]":"Make up your mind. I’m not going to stick around forever.","definition[9]":"used to tell a dog not to move","definition[10]":"a limited time of living in a place","example[36]":"a short stay in the hospital","note[12]":"long/short/overnight etc stay","example[37]":"I met her towards the end of my stay in Los Angeles.","note[13]":"stay in/at","definition[11]":"the stopping or delay of an action because a judge has ordered it","note[14]":"stay of execution (=a delay in punishing someone by killing them)","definition[12]":"a strong wire or rope used for supporting a ship’s mast","definition[13]":"a short piece of plastic or wire used to keep a shirt collar stiff","form[0]":"ADJECTIVES/NOUN + stay","collocation[0]":"a long stay","example[38]":"During his long stay in the south, he painted only one portrait.","collocation[1]":"a short/brief stay","example[39]":"No visa is required for short stays.","collocation[2]":"an overnight stay","example[40]":"Business trips may involve an overnight stay.","collocation[3]":"a pleasant/enjoyable stay","example[41]":"Our driver said goodbye and wished us a pleasant stay.","collocation[4]":"a hospital stay","example[42]":"Sally is back at work after a short stay in hospital.","collocation[5]":"have a nice/pleasant etc stay","example[43]":"We hope you have a pleasant stay.","collocation[6]":"extend/prolong your stay","example[44]":"He could not be persuaded to extend his stay."}