{"word[0]":"in","definition[0]":"used with the name of a container, place, or area to say where someone or something is","example[0]":"There’s some sugar in the cupboard.","example[1]":"My mother was in the kitchen.","example[2]":"He took us for a drive in his new car.","example[3]":"I found her sitting up in bed.","example[4]":"Manson spent fifteen years in prison.","example[5]":"a hole in the ground","example[6]":"Mr Fisher is in Boston this week.","example[7]":"My parents live in New Zealand now.","definition[1]":"into a container, place etc","example[8]":"I never went in pubs.","example[9]":"He almost drowned when he fell in the river.","example[10]":"You can put your pyjamas in the bottom drawer.","example[11]":"Get in the car.","example[12]":"She looked in her handbag, but her keys were not there.","definition[2]":"used to say how something is done or happens","example[13]":"a room furnished in the modern style","example[14]":"Her parents always talk to her in German.","example[15]":"She shouted my name in a harsh voice.","example[16]":"a short note scribbled in pencil","example[17]":"The title was printed in capital letters.","example[18]":"We waited in silence.","definition[3]":"used with the names of months, years, seasons etc to say when something happens","example[19]":"Shaw first visited Russia in 1927.","example[20]":"Bright yellow flowers appear in late summer.","example[21]":"He retired in October.","definition[4]":"during a period of time","example[22]":"It was amazing how much we managed to do in a day.","example[23]":"the hardest decision I ever made in my life","example[24]":"I got a card from my sister this morning ","example[25]":"I hope to go to Europe next summer","bad_example[0]":"in this morning","bad_example[1]":"in next summer","example[26]":"The group meets three times a month","bad_example[2]":"three times in a month","explanation[0]":"in one week, month etc when emphasizing how often something happens","example[27]":"He was stopped for speeding three times in one month","definition[5]":"at the end of a period of time","example[28]":"I’ll be with you in a minute.","example[29]":"The results will be announced in two weeks’ time.","definition[6]":"used with negatives or with ‘first’ to say how much time has passed since the last time something happened","example[30]":"I haven’t enjoyed myself so much in years.","example[31]":"It was the team’s first win in eighteen months.","definition[7]":"used to name the book, document, film etc where something or someone appears","example[32]":"You shouldn’t believe everything you read in the newspapers.","example[33]":"Which actress starred in the film ‘Cleopatra’?","example[34]":"There are a few mistakes in your essay.","example[35]":"In his speech, Professor Leary praised the work of the volunteers.","definition[8]":"making up the whole of something or included as part of something","example[36]":"There are twelve programmes in the series.","example[37]":"How many minutes are there in an hour?","example[38]":"Think of a word with eight letters in it meaning ‘cold’.","example[39]":"Owen will be playing in the England team tomorrow.","definition[9]":"doing or affecting a particular kind of job","example[40]":"a career in industry","example[41]":"He’s been in politics for fifteen years.","example[42]":"reforms in education","definition[10]":"wearing something","example[43]":"He looked very handsome in his uniform.","example[44]":"She was dressed in a blue linen suit.","definition[11]":"used to talk about the state or situation of something or someone","example[45]":"I hear that their marriage is in trouble.","example[46]":"The engine appears to be in good condition.","example[47]":"His life was in danger.","example[48]":"The castle now lies in ruins.","definition[12]":"used to say what activity a group of people do","example[49]":"About 4,000 students took part in the protest.","example[50]":"his role in the negotiations","definition[13]":"used to talk about the shape, arrangement, or course of something or someone","example[51]":"I want you all to stand in a circle.","example[52]":"She slept curled up in a ball.","example[53]":"Can you walk in a straight line?","definition[14]":"used between a smaller number and a larger number to say how common or how likely something is","example[54]":"One in ten homes now has cable TV.","example[55]":"Smokers have a one in three chance of dying from their habit.","definition[15]":"used before a plural number or amount to say how many people or things are involved, or how many there are in each group","example[56]":"Eggs are still sold in half dozens.","example[57]":"The children work in pairs.","example[58]":"People flocked in their thousands to greet their new princess.","note[0]":"in their hundreds/thousands etc","definition[16]":"used between a smaller number or amount and a larger one to say what a rate is","example[59]":"Income tax stands at 23 pence in the pound.","example[60]":"a hill with a gradient of one in six","definition[17]":"used to say what colour something is or what it is made of","example[61]":"Do you have the same pattern in blue?","example[62]":"a sculpture in white marble","definition[18]":"used to say what specific thing your statement is related to","example[63]":"Milk is very rich in calcium.","example[64]":"Clark had become more extreme in his opinions.","example[65]":"an increase in fuel prices","example[66]":"The street is about a mile in length.","definition[19]":"used to refer to the weather or the physical conditions somewhere","example[67]":"I’ve been standing in the rain for over an hour.","example[68]":"Would you prefer to sit in the shade?","definition[20]":"used to say what feeling you have when you do something","example[69]":"She looked at me in horror.","example[70]":"It was all done purely in fun.","definition[21]":"used before the name of someone or something when you are saying how they are regarded","example[71]":"You have a very good friend in Pat.","example[72]":"In Dwight D. Eisenhower the Republicans had found the ideal candidate.","definition[22]":"used to say what person or thing has the quality you are mentioning","example[73]":"There was a hint of spring in the air.","example[74]":"I don’t think Freddy had it in him to be a killer.","example[75]":"She’s everything I’d want in a wife  (=she has every quality I would want a wife to have).","definition[23]":"used to name the substance, food, drink etc that contains something","example[76]":"Vitamin D is found in butter.","definition[24]":"used to say how many parts something is divided into","example[77]":"a radio serial in four parts","example[78]":"I tore the letter in two and threw the pieces in the fire.","note[1]":"in two/halves/pieces etc","definition[25]":"while doing something or while something is happening, and as a result of this","example[79]":"In all the confusion, it is quite possible that some people got tickets without paying.","example[80]":"In my excitement, I forgot all about the message.","example[81]":"In trying to protect the queen, Howard had put his own life in danger.","note[2]":"in doing something","definition[26]":"into or inside a container, place, vehicle etc","opposite[0]":"out","example[82]":"Eric held the boat steady while the children got in.","example[83]":"He went to the ticket machine and put a coin in.","example[84]":"She dived in and swam out to the yacht.","definition[27]":"inside or into a building, especially your home or the place where you work","example[85]":"Come in and sit down.","example[86]":"I’m afraid Mr Stewart won’t be in until tomorrow morning.","example[87]":"We’re staying in this evening.","definition[28]":"if a train, boat, or plane is in, it has arrived at a station, airport etc","example[88]":"Our train’s not in yet.","example[89]":"When’s her flight due in?","definition[29]":"given or sent to a person or organization to be dealt with by them","example[90]":"All entries must be in by next week.","example[91]":"Letters have been pouring in from all over the country.","example[92]":"Have you handed your essay in yet?","definition[30]":"if you write, paint, or draw something in, you add it in the correct place","example[93]":"Fill in your name and address on the form provided.","example[94]":"The information is typed in by trained keyboarders.","definition[31]":"if a player or team is in during a game of cricket, they are batting (bat)","definition[32]":"if a ball is in during a game, it is inside the area where the game is being played","example[95]":"Agassi’s second serve was just in.","definition[33]":"if a politician or a political party is in, they have been elected","example[96]":"Labour recorded its highest vote ever, but the Tories got in again.","definition[34]":"towards the centre","synonym[0]":"inward(s)","example[97]":"The map had started to curl in at the edges.","definition[35]":"when the tide is in, the sea by the shore is at its highest level","example[98]":"The tide was in, and the sea lapped against the harbour wall.","definition[36]":"fashionable","example[99]":"Red is definitely the in colour this year.","example[100]":"Long skirts are in at the moment.","example[101]":"I joined the club because it seemed the in thing to do.","definition[37]":"a way of getting the opportunity to do something or influence someone","example[102]":"The job is pretty boring, but it’s an in to a career in publishing.","definition[38]":"the written abbreviation of inch or  inches","definition[39]":"the opposite or lack of something","synonym[1]":"not","example[103]":"insensitive  (=not sensitive)","example[104]":"incautious  (=not cautious)","example[105]":"inattention  (=lack of attention)","definition[40]":"the written abbreviation of Indiana","definition[41]":"written abbreviation for INCH or INCHES"}