{"past_tense[0]":"saw","past_participle[0]":"seen","signpost[0]":"notice/examine","definition[0]":"to notice or examine someone or something, using your eyes","example[0]":"The moment we saw the house, we knew we wanted to buy it.","example[1]":"He crouched down so he couldn’t be seen.","example[2]":"Can I see your ticket, please?","example[3]":"I saw the offer advertised in the newspaper.","example[4]":"You can see the Houses of Parliament from here.","note[0]":"can/can’t see","example[5]":"Can you see where the marks are on the wall?","note[1]":"see where/what/who etc","example[6]":"He saw that she was crying.","note[2]":"see (that)","example[7]":"I saw him leave a few minutes ago.","note[3]":"see somebody/something do something","example[8]":"The suspect was seen entering the building.","note[4]":"see somebody/something doing something","example[9]":"As you can see, the house needs some work doing on it.","example[10]":"Have you seen Chris  (=do you know where he is)?","example[11]":"The accommodation was so awful it had to be seen to be believed (=you would not believe it if you did not see it yourself).","signpost[1]":"notice something is true","definition[1]":"to notice that something is happening or that something is true","example[12]":"More money must be invested if we are to see an improvement in services.","example[13]":"After a month’s practice, you should see a difference in your playing.","example[14]":"Seeing his distress, Louise put her arm around him.","example[15]":"I would like to see changes in the way the course is run.","example[16]":"‘You’re not denying it, I see, ’ he said coldly.","example[17]":"I can see you’re not very happy with the situation.","signpost[2]":"ability to see","definition[2]":"to be able to use your eyes to look at things and know what they are","example[18]":"From the tower, you can see for miles.","example[19]":"I can’t see a thing without my glasses.","example[20]":"His eyes are so bad that he can’t see to read anymore.","note[5]":"not see to do something","signpost[3]":"find out information","definition[3]":"to find out information or a fact","example[21]":"These chocolates are gorgeous. Try some and see for yourself (=find out if it is true).","example[22]":"By looking at this leaflet, you can see at a glance (=find out very easily) how much a loan will cost.","example[23]":"As we have seen in chapter four, women’s pay is generally less than men’s.","example[24]":"From this graph, it can be seen that some people are more susceptible to the disease.","note[6]":"it can be seen that/we can see that","example[25]":"I’ll call him and see how the job interview went.","note[7]":"see what/how/when etc","example[26]":"She went outside to see what was happening.","example[27]":"I’ve just come to see if you want to go out for a drink.","note[8]":"see if/whether","signpost[4]":"in the future","definition[4]":"to find out about something in the future","example[28]":"‘Can we go to the zoo, Dad?’ ‘We’ll see’ (=used when you do not want to make a decision immediately).","example[29]":"‘How long can you stay?’ ‘I’ll have to see. It depends  (=used when you cannot make a decision immediately).’","example[30]":"We’ll just have to wait and see.","example[31]":"Things will work out, you’ll see (=you will find out that I am right).","example[32]":"I don’t know. We’ll just have to see how it goes on Sunday.","note[9]":"see how it goes/see how things go","example[33]":"It will be interesting to see if he makes it into the team.","example[34]":"I might come – I’ll see how I feel tomorrow.","note[10]":"see how/what/when etc","example[35]":"Let’s try it and see what happens.","signpost[5]":"where information is","definition[5]":"used to tell you where you can find information","example[36]":"See p. 58.","example[37]":"See press for details.","example[38]":"The results are shown in Table 7a (see below).","note[11]":"see above/below","explanation[0]":"See is always used in the imperative in this meaning","definition[6]":"to understand or realize something","example[39]":"I see what you mean (=I understand what you are saying).","example[40]":"‘He lives here but works in London during the week.’ ‘Oh, I see (=I understand).’","example[41]":"You see, the thing is, I’m really busy right now  (=used when you are explaining something).","example[42]":"You mix the flour and eggs like this, see (=used to check that someone is listening and understands)?","example[43]":"I can’t see the point of (=I do not understand the reason for) spending so much money on a car.","example[44]":"Do you see the point I’m making  (=do you understand what I’m trying to say)?","example[45]":"The other officers laughed, but Nichols couldn’t see the joke.","example[46]":"I just can’t get her to see reason!","note[12]":"see reason/sense","example[47]":"I can’t see why he’s so upset.","note[13]":"see why/what/how etc","signpost[6]":"watch","definition[7]":"to watch a television programme, play, film etc","example[48]":"Did you see that programme on monkeys last night?","example[49]":"We’re going to see ‘Romeo and Juliet’ tonight.","signpost[7]":"consider somebody/something","definition[8]":"to think about or consider someone or something in a particular way, or as having particular qualities","example[50]":"Having a child makes you see things differently.","example[51]":"Violence is seen in different ways by different people.","example[52]":"As I see it, you don’t have any choice.","note[14]":"as somebody sees it/the way somebody sees it","example[53]":"The way I see it, we have two options.","example[54]":"I see the job as a challenge.","note[15]":"see somebody/something as something","example[55]":"He saw himself as a failure.","note[16]":"see yourself as something","example[56]":"The peace talks are seen as a sign of hope.","note[17]":"be seen as (being) something","example[57]":"This type of work is often seen as boring.","example[58]":"Teachers need to be seen to be in control.","note[18]":"be seen to be (doing) something","example[59]":"The government must be seen to be doing something about the rise in violent crime.","signpost[8]":"visit","definition[9]":"to visit or meet someone","example[60]":"I’ll be seeing her tomorrow night.","example[61]":"I haven’t seen her since we left school.","example[62]":"She’s too sick to see anyone right now.","signpost[9]":"meet by chance","definition[10]":"to meet someone by chance","example[63]":"I saw Jane while I was out.","signpost[10]":"have a meeting","definition[11]":"to have an arranged meeting with someone","example[64]":"Mr Thomas is seeing a client at 2:30.","example[65]":"She was seen by a doctor but didn’t need hospital treatment.","example[66]":"I have to see my teacher about my grades.","note[19]":"see somebody about something","signpost[11]":"spend time with somebody","definition[12]":"to spend time with someone","example[67]":"They’ve been seeing a lot of each other.","example[68]":"They’ve seen more of each other since Dan moved to London.","note[20]":"see more/less of somebody","signpost[12]":"imagine","definition[13]":"to imagine that something may happen in the future","example[69]":"He could see a great future for her in music.","example[70]":"I can’t see him winning, can you?","note[21]":"can’t see somebody/something doing something","example[71]":"She’s got a new book coming out, but I can’t see it doing very well.","example[72]":"I just can’t see her as a ballet dancer.","note[22]":"see somebody as something","signpost[13]":"make sure","definition[14]":"to make sure or check that something is done","example[73]":"Don’t worry – I’ll see to it.","example[74]":"The hotel’s owners see to it that their guests are given every luxury.","example[75]":"It’s up to you to see that the job’s done properly.","example[76]":"Please see that the lights are switched off before you leave.","signpost[14]":"experience something","definition[15]":"to experience something","example[77]":"She was so sick that doctors didn’t think she’d live to see her first birthday.","example[78]":"I never thought I’d live to see the day when women became priests.","example[79]":"She’s seen it all before (=has experienced so much that nothing surprises her) in her long career.","signpost[15]":"time/place","definition[16]":"if a time or place has seen a particular event or situation, it happened or existed in that time or place","example[80]":"This year has seen a big increase in road accidents.","example[81]":"The city has seen plenty of violence over the years.","signpost[16]":"go with somebody","definition[17]":"to go somewhere with someone to make sure they are safe","example[82]":"My mother used to see me across the road.","example[83]":"I’ll get Nick to see you home.","example[84]":"Let me see you to the door (=go with you to the door, to say goodbye).","signpost[17]":"game of cards","definition[18]":"to risk the same amount of money as your opponent in a card game","explanation[1]":"In meanings 1,2, 3,9, 14, and 18, see is not used in the progressive You say","example[85]":"I see Tina over there","example[86]":"I suddenly saw the difference","bad_example[0]":"I am seeing Tina over there","bad_example[1]":"I was suddenly seeing the difference","explanation[2]":"See is often used with can","example[87]":"I can see Tina over there","example[88]":"I could suddenly see the difference","definition[19]":"to notice something with your eyes, usually without planning to. Also used when saying that you watched a particular programme, film, game etc","example[89]":"Have you seen my keys anywhere?","example[90]":"Did you see the basketball game last night?","display[0]":"look at somebody/something","definition[20]":"to keep your eyes pointed toward someone or something, especially someone or something that is not moving","example[91]":"I looked at the map.","example[92]":"She was looking at him in a strange way.","definition[21]":"to see something interesting or unusual","example[93]":"I noticed a police car outside their house.","display[1]":"spot","definition[22]":"to suddenly see something, especially something you are looking for","example[94]":"Nick spotted the advertisement in the paper.","display[2]":"catch sight of/catch a glimpse of","definition[23]":"to suddenly see someone or something for a short time, usually not clearly","example[95]":"I caught sight of him in the hotel lobby, and followed him out the door.","example[96]":"He glimpsed her face as she went into the courtroom.","display[3]":"make out somebody/something","definition[24]":"to see something, but only with difficulty","example[97]":"Ahead, I could just make out the figure of a woman.","display[4]":"witness","definition[25]":"to see something happen, especially a crime or an accident","example[98]":"The police are asking anyone who witnessed the attack to come forward.","display[5]":"observe","definition[26]":"to see and pay attention to something","example[99]":"Officers observed him driving at 100 mph.","display[6]":"sight","definition[27]":"to suddenly see something or someone from a long distance, especially when you have been looking for a long time","example[100]":"The missing boys were sighted by a rescue helicopter.","example[101]":"The crew finally sighted land.","heading[0]":"Unable to see","display[7]":"blind","definition[28]":"unable to see anything","example[102]":"She has been blind from birth.","display[8]":"partially-sighted","definition[29]":"not able to see things very well, although not completely blind","example[103]":"Good lighting can be very important for partially sighted people.","display[9]":"visually handicapped/impaired","definition[30]":"completely blind or not able to see very much – used especially in official reports, forms etc","example[104]":"a special school for visually impaired children","definition[31]":"an area governed by a bishop"}