{"word[0]":"fat","comparative[0]":"fatter","superlative[0]":"fattest","signpost[0]":"flesh","definition[0]":"weighing too much because you have too much flesh on your body","example[0]":"Are you suggesting I’m too fat?","example[1]":"a short fat man in his early fifties","example[2]":"You’ll get fat if you eat all that chocolate.","example[3]":"He looks much fatter than in his photo.","definition[1]":"thick or wide","example[4]":"Dobbs was smoking a fat cigar.","example[5]":"a big fat book","definition[2]":"containing or worth a large amount of money","example[6]":"a fat cheque","example[7]":"Of course the supermarkets’ aim is to make fat profits.","signpost[1]":"approval","definition[3]":"another spelling of phat – used to show approval, especially of someone or something that is fashionable, interesting, or attractive","example[8]":"Check out these fat beats.","note[0]":"fat/phat beats","definition[4]":"having too much flesh on your body. It is rude to tell someone that they are fat. It is also better not to use any of these words when talking directly to someone about their body","example[9]":"She thinks she’s fat.","example[10]":"He looks the same, just a little fatter.","display[0]":"overweight","definition[5]":"weighing more than you should","example[11]":"Many medical conditions are caused by being overweight.","example[12]":"She was several kilos overweight.","display[1]":"big/large","definition[6]":"used when saying that someone has a big body. Large is more common than big in written English","example[13]":"My father was a big man.","example[14]":"two large ladies","display[2]":"obese","definition[7]":"extremely fat in a way that is dangerous to your health","example[15]":"He went to a summer camp for obese teenagers.","display[3]":"chubby","definition[8]":"slightly fat in a nice-looking way – used especially about babies and children","example[16]":"A chubby little baby was playing on the rug.","display[4]":"plump","definition[9]":"a woman or child who is plump is slightly fat, especially in a pleasant way","example[17]":"Her mother was a plump cheerful woman.","display[5]":"flabby","definition[10]":"having soft loose skin that looks unattractive","example[18]":"a flabby stomach","example[19]":"Her body was getting old and flabby.","display[6]":"portly","definition[11]":"fat and round – used especially about fairly old men","example[20]":"The bishop was a portly middle-aged gentleman.","definition[12]":"a substance that is stored under the skin of people and animals, that helps to keep them warm","example[21]":"Rolls of fat bulged over his collar.","example[22]":"I didn’t like the meat – there was too much fat on it.","definition[13]":"an oily substance contained in certain foods","example[23]":"Cream has a high fat content.","example[24]":"You should think about reducing your fat intake (=the amount of fat you eat).","example[25]":"This cheese is relatively low in fat.","note[1]":"high/low in fat","example[26]":"a low-fat diet","note[2]":"high-fat/low-fat","definition[14]":"an oily substance taken from animals or plants and used in cooking","example[27]":"Place the chicken in the hot fat."}