{"word[0]":"express","definition[0]":"to tell or show what you are feeling or thinking by using words, looks, or actions","example[0]":"Parents have expressed their concerns about their children’s safety.","example[1]":"She expressed an interest in seeing York.","example[2]":"Many people have expressed their opposition to the proposals.","example[3]":"Words can’t express (=it is impossible to describe) how angry we felt.","example[4]":"Bill’s not afraid to express his opinions.","note[0]":"express your views/opinions","example[5]":"She doesn’t express her emotions as much as he does.","note[1]":"express sympathy/fear/anger etc","example[6]":"Finally, I’d like to express my sincere thanks to all those who have helped today.","note[2]":"express thanks/gratitude (for something) (to somebody)","example[7]":"The USA expressed reservations before agreeing to sign the agreement.","note[3]":"express doubts/reservations","example[8]":"Express your reasons for applying in simple terms.","note[4]":"express something in/by/through something","example[9]":"Young children often have difficulty expressing themselves.","note[5]":"express yourself","example[10]":"He first learnt to express himself through movement at his dance classes.","signpost[0]":"particular emotion","definition[1]":"to show or describe a particular feeling","example[11]":"Many of Munch’s paintings express a deep feeling of despair.","definition[2]":"to change an amount or quantity into a different form, especially in mathematics","example[12]":"Express three-quarters as a decimal.","note[6]":"express something as/in something","example[13]":"The value of the coffee becomes significantly higher when expressed in foreign currency.","signpost[1]":"feeding babies","definition[3]":"if a woman expresses milk, she presses milk out of her breast in order to feed it to her baby later","collocation[0]":"express your views/opinions/ideas","example[14]":"Everyone who attends the meeting will be given the opportunity to express their opinions.","collocation[1]":"express your feelings","example[15]":"He felt unable to express his feelings in a letter.","collocation[2]":"express an interest in something","example[16]":"Many property developers have expressed an interest in buying the land.","collocation[3]":"express concern","example[17]":"Financial analysts have expressed concern about the possibility of a recession.","collocation[4]":"express your thanks/gratitude/appreciation","example[18]":"On behalf of the team, I’d like to express our appreciation for all your efforts.","example[19]":"Environmentalists began to express doubts about the benefits of biofuels.","collocation[5]":"express surprise/shock","example[20]":"‘I don’t believe he could hurt anyone, ’ she said, expressing her surprise.","collocation[6]":"express anger","example[21]":"Teachers have expressed anger at the government’s education reforms.","collocation[7]":"express your grief","example[22]":"She searched for further words to express her grief, but could find none.","collocation[8]":"express your sympathy","example[23]":"I wrote to his widow expressing our sympathy and sending her our condolences.","collocation[9]":"express confidence","example[24]":"Throughout the trial, his legal team expressed confidence in the outcome.","collocation[10]":"express your hopes/desires","example[25]":"Nadia expressed her hopes about remaining in San Diego County with her two children.","collocation[11]":"express your support","example[26]":"The Israeli leader expressed his support for the U.S. plan.","collocation[12]":"express opposition to something","example[27]":"Local people have expressed their opposition to plans for a new airport.","collocation[13]":"express a willingness to do something","example[28]":"The unions expressed a willingness to have talks with the employers.","collocation[14]":"express something openly","example[29]":"They expressed their anger openly in the meeting.","collocation[15]":"express something clearly","example[30]":"He expresses his views very clearly.","example[31]":"He is very confident and finds it easy to express himself.","collocation[16]":"a chance/opportunity to express something","example[32]":"The debate will give MPs an opportunity to express their views in detail.","collocation[17]":"words cannot express something","example[33]":"Words can’t express how much I miss her.","definition[4]":"deliberate and for a specific situation","example[34]":"The school was founded with the express purpose of teaching deaf children.","definition[5]":"clear and definite","example[35]":"Matthew left express instructions to keep all doors locked.","example[36]":"He is not to leave without my express permission.","note[7]":"express agreement/consent/authority etc","definition[6]":"designed to help you move through a place more quickly","example[37]":"express lanes on the freeway","example[38]":"an express line at a supermarket  (=where people with only a few things to buy go to pay)","definition[7]":"a train or bus that does not stop in many places and therefore travels quickly","note[8]":"London–Gatwick Express/Orient Express (=a fast train or bus which does a particular journey regularly)","definition[8]":"a post service that delivers letters and packages very quickly","example[39]":"Send these books by express.","definition[9]":"a British daily tabloid newspaper which usually supports the ideas of the Conservative Party","definition[10]":"to say what you think or feel about something","example[40]":"The sales manager expressed caution about the deal.","example[41]":"The USA expressed reservations before eventually signing the agreement.","example[42]":"Worries have been expressed within the industry about a rise in interest rates.","definition[11]":"to state clearly and openly something that has been agreed","example[43]":"Such warranties are implied, unless a contract expresses a contrary intention.","definition[12]":"to write a quantity or amount in numbers, letters, or other figures","example[44]":"The country’s level of expenditure is expressed as a percentage of the measure of economic activity.","note[9]":"express something as/in","definition[13]":"stated or written clearly and openly, and showing a clear purpose or intention","example[45]":"the distinction between express authority and mere consent","example[46]":"Copyright prevents use of this material without theexpress permission of the author.","example[47]":"There is an express agreement by the plaintiff to pay £10 towards the ground-rent.","definition[14]":"an express service is one that is quicker than the normal service","example[48]":"overnight express trains","example[49]":"It takes anything from 2 to 5 days, depending on whether or not you use an express transfer."}