{"word[0]":"earn","signpost[0]":"money for work","definition[0]":"to receive a particular amount of money for the work that you do","example[0]":"He earns nearly £20,000 a year.","example[1]":"You don’t earn much money being a nurse.","example[2]":"He did all sorts of jobs to earn a living.","example[3]":"I was the only person in the house who was earning.","example[4]":"She was earning good money at the bank.","example[5]":"Chris will pay – he’s earning a fortune.","signpost[1]":"profit","definition[1]":"to make a profit from business or from putting money in a bank etc","example[6]":"The movie earned £7 million on its first day.","example[7]":"You could earn a higher rate of interest elsewhere.","signpost[2]":"something deserved","definition[2]":"to do something or have qualities that make you deserve something","example[8]":"I think you’ve earned a rest.","example[9]":"He soon earned the respect of the players.","example[10]":"He hopes to earn a place in the team.","example[11]":"The company has earned a reputation for reliability.","definition[3]":"if your actions or qualities earn you something, they make you deserve to have it","example[12]":"That performance earned her an Oscar as Best Actress.","note[0]":"earn somebody something","collocation[0]":"earn money","example[13]":"I’d like to earn more money than I do now.","collocation[1]":"earn a wage/salary","example[14]":"You are more likely to earn a decent wage if you have a degree.","collocation[2]":"earn a living","example[15]":"She started to earn a living by selling her jewellery on a market stall.","collocation[3]":"earn £30,000 a year/$200 a week/£5 an hour etc","example[16]":"Newly qualified teachers earn a minimum of £24,000 a year.","collocation[4]":"earn good money","example[17]":"You can earn good money working in London.","collocation[5]":"earn a fortune","example[18]":"Footballers at the top clubs earn a fortune these days.","definition[4]":"to be paid a particular amount of money for your work.  Earn is more formal than get  or  make","example[19]":"A newly-qualified teacher can expect to earn about £20,000 a year.","definition[5]":"to earn a particular amount of money every hour, week etc","example[20]":"How much do you get an hour?","example[21]":"She gets more than I do.","definition[6]":"to earn money, especially a lot of money, or money that is not from regular employment","example[22]":"You can make a lot of money in banking.","example[23]":"Jo makes a bit of extra money by selling his paintings.","display[0]":"be on something","definition[7]":"to earn a particular amount of money each year. This is the most common way of talking about someone’s salary in British English","example[24]":"How much are you on?","example[25]":"Some chief executives are on huge salaries.","display[1]":"be/get paid","definition[8]":"to receive money for work that you do for an employer, not by working for yourself","example[26]":"Workers are paid around $500 a month.","example[27]":"I get paid monthly.","display[2]":"well-paid/badly-paid","definition[9]":"paid a lot of money/not much money for the work that you do","example[28]":"well-paid lawyers working in the city","example[29]":"It was boring badly-paid work.","display[3]":"take home","definition[10]":"to earn a particular amount of money after tax etc has been taken away from your pay","example[30]":"After tax and other deductions, I only take home £200 a week.","definition[11]":"to be paid money for the work you do","example[31]":"The managing director’s personal assistant earned £35,000 last year.","example[32]":"She earns a very respectable wage.","example[33]":"Some young people want to start earning as soon as possible.","definition[12]":"if an investment earns money, it makes a profit","example[34]":"If a bond is not redeemed at maturity, it continues to earn interest.","definition[13]":"to earn the money that you need to live","example[35]":"It’s impossible to earn a decent living in this country."}