{"signpost[0]":"cover with water","definition[0]":"to cover a place with water, or to become covered with water","example[0]":"Towns and cities all over the country have been flooded.","example[1]":"The houses down by the river flood quite regularly.","definition[1]":"if a river floods, it is too full, and spreads water over the land around it","example[2]":"There are now fears that the river could flood.","signpost[1]":"go/arrive in large numbers","definition[2]":"to arrive or go somewhere in large numbers","example[3]":"Refugees are still flooding across the border.","example[4]":"Donations have been flooding in since we launched the appeal.","definition[3]":"if light floods a place or floods into it, it makes it very light and bright","example[5]":"Light flooded into the kitchen.","note[0]":"flood into","example[6]":"The morning sun flooded the room with a gentle light.","note[1]":"flood something with something","definition[4]":"if a feeling or memory floods over you or floods back, you feel or remember it very strongly","example[7]":"I felt happiness and relief flooding over me.","note[2]":"flood over/back","example[8]":"Memories of my time in Paris flooded back.","signpost[2]":"engine","definition[5]":"if an engine floods or if you flood it, it has too much petrol in it, so that it will not start","definition[6]":"a very large amount of water that covers an area that is usually dry","example[9]":"The village was cut off by floods.","example[10]":"the worst floods for over fifty years","definition[7]":"a very large number of things or people that arrive at the same time","example[11]":"The UN appealed for help with the flood of refugees crossing the border.","note[3]":"flood of","definition[8]":"a story told in the Old Testament of the Bible about a great flood that covered the whole world. According to the story, God caused the Flood because he was angry with the people on Earth and wanted to punish them. He made it rain for 40 days and 40 nights, and most of the people and animals on Earth were killed. Only one man, Noah, and his family were saved. God told Noah to build an ark (=a large boat) and to take two of every kind of animal on the ark with him. When the rain stopped and the water level began to go down, Noah sent out a dove to look for land, and the bird returned carrying an olive branch to show that the land was reappearing.","definition[9]":"to send a large number of things such as letters or requests to an organization","example[12]":"Dealers flooded Congress with angry letters.","note[4]":"flood something with","example[13]":"Swiss banks have been flooded with deposits and loan requests from blue-chip American firms.","definition[10]":"to arrive in large numbers","note[5]":"flood in/into/across etc","example[14]":"As his corruption became evident, the usually tolerant Brazilians flooded onto the streets and drove Mr Collor out.","definition[11]":"to make a product available in large quantities, perhaps with the result that its price falls","example[15]":"Auto-makers have been flooding the market with late-model used cars.","definition[12]":"a large number of things or people that arrive at the same time","example[16]":"The last-minuteflood of applications means most small investors will probably be allocated fewer than 400 shares.","example[17]":"The flood of credit into the housing market fuelled house-price inflation."}