{"word[0]":"drop","signpost[0]":"let something fall","definition[0]":"to stop holding or carrying something so that it falls","example[0]":"He dropped his briefcase on a chair.","example[1]":"She screamed and dropped the torch.","definition[1]":"to make something such as a bomb fall from a plane","example[2]":"U.S. planes began dropping bombs on the city.","example[3]":"Supplies are being dropped for the refugees.","definition[2]":"to fall suddenly onto the ground or into something","example[4]":"The apples are beginning to drop from the trees.","note[0]":"drop from/off","example[5]":"Your button has dropped off.","signpost[1]":"move your body down","definition[3]":"to lower yourself or part of your body suddenly","example[6]":"She dropped her head back against the cushion.","example[7]":"He dropped down onto the floor and hid under the table.","note[1]":"drop down/onto/into","signpost[2]":"become less","definition[4]":"to fall to a lower level or amount, especially a much lower level or amount","example[8]":"The number of deaths on the roads has dropped sharply.","note[2]":"drop suddenly/sharply/dramatically","example[9]":"Temperatures drop quite dramatically at night, so bring some warm clothing.","example[10]":"Their share of the market dropped to 50 percent this year.","note[3]":"drop to","definition[5]":"to reduce the level or amount of something","example[11]":"You might be able to get them to drop the price.","example[12]":"As soon as she saw the police car she dropped her speed.","signpost[3]":"not include","definition[6]":"to decide not to include someone or something","example[13]":"His name was dropped from the list.","example[14]":"Taylor was bitterly disappointed to be dropped from the England side.","note[4]":"drop somebody from a team/side","signpost[4]":"stop doing something","definition[7]":"to stop doing something, discussing something, or continuing with something","example[15]":"The proposal was dropped after opposition from civil liberties groups.","example[16]":"You can’t expect me to drop everything (=completely stop doing whatever I am doing) whenever you’re in town.","example[17]":"Oh, drop the ‘Senator’ (=stop calling me ‘Senator’) – just call me Gordon.","example[18]":"Some time later, the matter was quietly dropped.","example[19]":"New evidence was presented to the court and the case was dropped.","note[5]":"drop charges/drop a case","example[20]":"Students are allowed to drop history in Year 9.","note[6]":"drop a subject at school/university","signpost[5]":"stop talking about something","definition[8]":"to stop talking about something","example[21]":"To her relief, Julius dropped the subject.","note[7]":"drop the subject","example[22]":"Just drop it, will you? I don’t want to talk about it anymore.","note[8]":"drop it","example[23]":"‘What about the money?’ ‘We’ve agreed to let it drop (=we have agreed not to talk about it anymore).’","signpost[6]":"take somebody somewhere","definition[9]":"to take someone by car to a place and leave them there, especially on your way to another place","example[24]":"Just drop me here – I can walk the rest of the way.","example[25]":"She dropped Johnny at the school gates at about 8:30.","note[9]":"drop somebody at something","signpost[7]":"take something somewhere","definition[10]":"to take something to a place and leave it there","example[26]":"I’ve got your books – I’ll drop them round to your place later.","note[10]":"drop something round/in","signpost[8]":"visit","definition[11]":"to visit someone you know, usually without arranging a particular time","example[27]":"I just dropped by to see how you were getting on.","note[11]":"drop by/round","example[28]":"The kids drop round and see her from time to time.","example[29]":"Jan dropped into the office this morning to tell me her news.","note[12]":"drop into","example[30]":"Why don’t you drop in for a drink one evening?","note[13]":"drop in (on somebody)","signpost[9]":"slope downwards","definition[12]":"if a path, land etc drops, it goes down suddenly, forming a steep slope","example[31]":"The cliff dropped down over a hundred feet to the sea below.","note[14]":"drop down","example[32]":"On the left the ground drops away, giving a view over the rooftops.","note[15]":"drop away","signpost[10]":"end a relationship","definition[13]":"to suddenly stop having a relationship with someone, especially a romantic relationship","example[33]":"She dropped him as soon as she found out he had been seeing another woman.","heading[0]":"– Meaning 7: to stop doing something, discussing something, or continuing with something","form[0]":"drop + NOUN","collocation[0]":"drop the charges/a case","example[34]":"Both men have been released and the charges have been dropped.","collocation[1]":"drop everything","example[35]":"When my mother was sick, I just dropped everything and flew to be with her in Seattle.","collocation[2]":"drop the idea","example[36]":"The project was going to be too expensive so the idea was dropped.","collocation[3]":"drop a plan","example[37]":"The company has dropped its plan to build a hotel on the site.","collocation[4]":"drop a scheme/program etc","example[38]":"Some banks have dropped their student loan scheme.","collocation[5]":"drop a subject","example[39]":"Students may choose to drop a subject in their second year.","collocation[6]":"drop the pretence","example[40]":"He has finally dropped the pretence that he’s innocent.","definition[14]":"a very small amount of liquid that falls in a round shape","example[41]":"As the first drops of rain began to fall, Michael started to run.","note[16]":"drop of","example[42]":"A single drop of blood splashed onto the floor.","example[43]":"A drop of sweat ran down her forehead and into her eye.","signpost[11]":"small amount","definition[15]":"a small amount of liquid that you drink, especially alcohol","example[44]":"George hasn’t touched a drop (=drunk any alcohol) for years.","example[45]":"She likes to add a drop of brandy to her tea.","definition[16]":"a small amount of something","example[46]":"I haven’t got a drop of sympathy for him.","signpost[12]":"reduction","definition[17]":"a reduction in the amount, level, or number of something, especially a large or sudden one","example[47]":"The results showed a sharp drop in profits.","note[17]":"a sharp/dramatic/marked drop in something","example[48]":"Manufacturers report a big drop in new orders.","note[18]":"drop in","example[49]":"a drop in temperature","signpost[13]":"distance to ground","definition[18]":"a distance from a higher point down to the ground or to a lower point","example[50]":"There was a steep drop on one side of the track.","example[51]":"a 20-metre drop","example[52]":"There was an almost sheer (=vertical) drop to the valley below.","signpost[14]":"delivery","definition[19]":"an act of delivering something somewhere, for example by dropping it from a plane","example[53]":"Air drops  (=from a plane) of food aid were made to the region yesterday.","example[54]":"My first drop of the day is usually somewhere in north London.","definition[20]":"to fall to a lower level or amount","example[55]":"Stock prices dropped sharply today.","example[56]":"The dollar dropped against the Japanese yen today.","example[57]":"Demand has dropped by 7%.","example[58]":"Second quarter earnings this year dropped to $157 million from $182 million.","note[19]":"drop to/from","definition[21]":"to stop doing or planning something","example[59]":"Plans to expand the business have been quietly dropped.","example[60]":"She was persuaded to drop the harassment lawsuit.","definition[22]":"to lose money in business, a game etc","example[61]":"He dropped £1000 on the stockmarket.","definition[23]":"to place words, a picture etc into a particular computer document with the mouse","example[62]":"Either drag and drop the page into a message or choose Send Page from under the File menu.","definition[24]":"if there is a drop in the amount, level, or number of something, it goes down or becomes less","example[63]":"Yesterday saw a sharp drop in stock prices.","example[64]":"The first quarter total shows a drop from the same quarter last year.","example[65]":"Business is expecting a drop in interest rates later this year.","example[66]":"The club has suffered a dramatic drop in profits."}