{"word[0]":"cheque","definition[0]":"a printed piece of paper that you write an amount of money on, sign, and use instead of money to pay for things","note[0]":"cash a cheque (=get cash in exchange for a cheque)","example[0]":"You could write her a cheque.","example[1]":"They sent me a cheque for £100.","note[1]":"cheque for","example[2]":"Can I pay by cheque?","note[2]":"by cheque","collocation[0]":"pay by cheque","example[3]":"You can pay by cheque or credit card.","collocation[1]":"write (out) a cheque","example[4]":"I had to write a cheque for £360 yesterday.","collocation[2]":"give somebody a cheque","example[5]":"Can I give you a cheque, or would you prefer cash?","collocation[3]":"make a cheque out/payable to somebody","example[6]":"Who shall I make the cheque out to?","collocation[4]":"enclose a cheque","example[7]":"I wrote to the company enclosing a cheque for £49.99.","collocation[5]":"sign a cheque","example[8]":"You've forgotten to sign the cheque.","collocation[6]":"pay in a cheque","example[9]":"I went to the bank to pay in a couple of cheques.","collocation[7]":"cancel/stop a cheque","example[10]":"Don't forget to phone the bank and cancel that cheque.","collocation[8]":"cash a cheque","example[11]":"The company had cashed the cheque but not sent the goods.","collocation[9]":"accept a cheque","example[12]":"We only accept cheques if you have a bank card.","collocation[10]":"draw a cheque","example[13]":"Customers can draw cheques for any amount they like on their accounts.","collocation[11]":"a cheque bounces","example[14]":"The cheque bounced because my account was overdrawn.","form[0]":"ADJECTIVES/NOUN + cheque","collocation[12]":"a large cheque","example[15]":"Sara was delighted to receive a large cheque in the post.","collocation[13]":"a blank cheque","example[16]":"I wasn't sure how much the tickets would be so I gave her a blank cheque.","collocation[14]":"a post-dated cheque","example[17]":"She wanted a post-dated cheque for the next three months' rent.","collocation[15]":"a pay cheque","example[18]":"My pay cheque arrived at the end of each week.","collocation[16]":"a traveller's cheque","example[19]":"Are you taking some traveller's cheques on holiday?","form[1]":"cheque + NOUN","collocation[17]":"a cheque book","example[20]":"When you open a bank account you will be given your own cheque book.","collocation[18]":"a cheque card","example[21]":"Cheques must be accompanied by a valid cheque card.","collocation[19]":"a cheque stub","example[22]":"Check your cheque stubs to see when you wrote the cheque.","definition[1]":"a printed form that you use to pay for something instead of using money. You write on it the amount in words and numbers, the date, the person being paid, and sign your name","example[23]":"a cheque for £200","example[24]":"He cashed the cheque (=exchanged it for cash) at a High Street bank.","example[25]":"He had second thoughts, and phoned his bank to stop the cheque (=tell the bank not to pay it).","example[26]":"As long as you don’t exceed the agreed limit, the bank won’t bounce your cheques (=refuse to pay them because there is not enough money in your account).","definition[2]":"to write a cheque that you do not have money in the bank to pay"}