{"word[0]":"profit","definition[0]":"money that you gain by selling things or doing business, after your costs have been paid","opposite[0]":"loss","example[0]":"The shop’s daily profit is usually around $500.","example[1]":"She sold the business and bought a farm with the profits.","example[2]":"They sold their house at a healthy profit.","definition[1]":"an advantage that you gain from doing something","example[3]":"There’s no profit in letting meetings drag on.","collocation[0]":"a big/huge profit","example[4]":"Drug companies make huge profits.","collocation[1]":"a quick profit","example[5]":"They were only interested in a quick profit.","collocation[2]":"a good profit","example[6]":"There is a good profit to be made in selling cars.","collocation[3]":"a substantial profit","example[7]":"The agent then sells the land for a substantial profit to someone else.","collocation[4]":"a healthy/handsome/tidy profit","example[8]":"By the second year, the restaurant began to make a healthy profit.","collocation[5]":"a small/modest profit","example[9]":"The business managed to produce a small profit last year.","collocation[6]":"net profit","example[10]":"The company made a net profit of $10.5 million.","collocation[7]":"gross profit","example[11]":"The hotel group made a gross profit of £51.9 million in 2008.","collocation[8]":"trading/operating profit","example[12]":"Both turnover and operating profits were lower.","collocation[9]":"make a profit","example[13]":"We are in business to make a profit.","collocation[10]":"turn/earn a profit","example[14]":"Without the liquor sales, the store could not turn a profit.","collocation[11]":"show a profit","example[15]":"The business will not show a profit this year.","collocation[12]":"report/post a profit","example[16]":"The company reported net profits of $3.6 million for fiscal year 2006.","collocation[13]":"generate profit(s)","example[17]":"We have the capacity to generate more profit.","collocation[14]":"boost profits","example[18]":"They aim to boost profits by slashing costs.","collocation[15]":"maximize profits","example[19]":"Every firm tries to maximize its profits.","collocation[16]":"profits are up/down","example[20]":"Pre-tax profits were up 21.5%.","collocation[17]":"profits rise/increase/grow","example[21]":"Half of the firms surveyed expected profits to rise.","collocation[18]":"profits soar/leap","collocation[19]":"profits fall","example[22]":"The group saw profits fall from £24m to £17.8m.","collocation[20]":"profits slump/plunge","example[23]":"The group’s pre-tax profits slumped to £25.5m.","example[24]":"Our profits are down this year.","example[25]":"The big oil companies have made enormous profits following the rise in oil prices.","display[0]":"earnings","definition[2]":"the profit that a company makes","example[26]":"The company said it expected fourth-quarter earnings to be lower than last year’s results.","example[27]":"Pre-tax earnings have grown from $6.3 million to $9.4 million.","definition[3]":"the profit that you get from an investment","example[28]":"You should get a good return on your investment.","example[29]":"We didn’t get much of a return on our money.","example[30]":"They’re promising high returns on investments of over $100,000.","display[1]":"turnover","definition[4]":"the amount of business done during a particular period","example[31]":"The illicit drugs industry has an annual turnover of some £200bn.","display[2]":"takings","definition[5]":"the money that a business, shop etc gets from selling its goods in a day, week, month etc","example[32]":"He counted the night’s takings.","example[33]":"This week’s takings are up on last week’s.","display[3]":"interest","definition[6]":"money paid to you by a bank or other financial institution when you keep money in an account there","example[34]":"They are offering a high rate of interest on deposits of over £3,000.","example[35]":"The money is still earning interest in your account.","display[4]":"dividend","definition[7]":"a part of a company’s profit that is divided among the people who have shares in the company","example[36]":"Shareholders will receive a dividend of 10p for each share.","example[37]":"The company said it will pay shareholders a final dividend of 700 cents a share.","definition[8]":"to be useful or helpful to someone","example[38]":"It might profit you to learn about the company before your interview.","note[0]":"profit somebody to do something","example[39]":"There are lessons in these stories that all children can profit by.","note[1]":"profit by/from","definition[9]":"to get money from doing something","example[40]":"Some industries, such as shipbuilding, clearly profited from the war.","definition[10]":"money that you gain from selling something, or from doing business in a particular period of time, after taking away costs","example[41]":"A business has to make a profit.","example[42]":"Since it was set up two years ago, the company hasn’t earned a profit but could break even this year.","example[43]":"Coca-Cola reported strong profits in the latest quarter.","example[44]":"They will have to produce and sell more than 300,000 cars a year to turn (=make) a profit on the model.","example[45]":"We’ve got to see the economy recover, and we’ve got to see corporate profits (=those of companies in general) increase.","example[46]":"They controlled the market for the stock and drove it up to artificially high prices, netting themselves and others excess profits (=profits that people think are too high).","example[47]":"The company said that sales and profits increased in four of its major divisions.","definition[11]":"profits for the first three-month period, second six-month period etc of the financial year","example[48]":"The insurer recorded fourth-quarter profit of 86 cents a share, compared with year-earlier net income of 82 cents.","definition[12]":"to gain money from an event, selling something etc","example[49]":"Tiger profited by anticipating the fall in the Tokyo stock market.","note[2]":"profit by/from something","example[50]":"Coca-Cola profited from a weaker dollar and higher sales overseas."}