{"word[0]":"cut out","signpost[0]":"remove something","definition[0]":"to remove something by cutting round it","example[0]":"The cancerous cells had to be cut out.","example[1]":"Billy showed me the article he’d cut out of the magazine.","note[0]":"cut something ↔ out of","signpost[1]":"cut a shape","definition[1]":"to cut a shape from a piece of paper, cloth etc","example[2]":"The children were cutting out squares from the scraps of material.","signpost[2]":"stop something happening","definition[2]":"to stop something from happening or existing","example[3]":"The idea behind these forms is to cut out fraud.","example[4]":"A catalytic converter will cut out 90% of carbon monoxide emissions.","signpost[3]":"stop doing/eating something","definition[3]":"to stop doing or eating something, especially because it might be bad for your health","example[5]":"The current advice to pregnant women is to cut out alcohol.","signpost[4]":"from writing","definition[4]":"to remove something from a piece of writing, especially because it might offend people","example[6]":"Cut out the bit about racial prejudice.","definition[5]":"used to tell someone to stop doing something because it is annoying you","example[7]":"Hey, you guys, cut it out – Mom’s trying to get some sleep.","signpost[5]":"not involve somebody","definition[6]":"to stop someone from doing something or being involved in something","example[8]":"The new rules will cut out 25% of people who were previously eligible to vote.","type[0]":"usually in questions and negatives","definition[7]":"to have the qualities that you need for a particular job or activity","example[9]":"In the end, I decided I wasn’t cut out for the army.","example[10]":"Are you sure you’re really cut out to be a teacher?","signpost[6]":"engine","definition[8]":"if an engine or machine cuts out, it suddenly stops working","example[11]":"The engine cut out halfway across the lake.","signpost[7]":"light/view","definition[9]":"to prevent light, sound etc from reaching somewhere","example[12]":"You’ll need sunglasses that will cut out harmful UV rays from the sun.","definition[10]":"to prevent someone from getting something, especially your money after your death","example[13]":"Em’s father decided to cut her out of his will."}