{"word[0]":"shop","signpost[0]":"place where you buy things","definition[0]":"a building or part of a building where you can buy things, food, or services","example[0]":"a barber’s shop","example[1]":"a fish-and-chip shop","example[2]":"the local shops","example[3]":"Shirley saw her reflection in the shop window.","example[4]":"I’m just going down to the shops.","example[5]":"Her brother runs a record shop in Chester.","note[0]":"toy/pet/shoe/gift etc shop","example[6]":"I spent a happy afternoon wandering around the shops.","note[1]":"wander/browse around the shops","example[7]":"New potatoes are in the shops now.","note[2]":"in the shops","signpost[1]":"place that makes/repairs things","definition[1]":"a place where something is made or repaired","example[8]":"The generators are put together in the machine shop.","example[9]":"a bicycle repair shop","signpost[2]":"school subject","definition[2]":"a subject taught in schools that shows students how to use tools and machinery to make or repair things","example[10]":"One auto shop class is run just for girls.","note[3]":"wood/metal/print etc shop","example[11]":"Doug made this table in shop.","note[4]":"in shop","signpost[3]":"go shopping","definition[3]":"an occasion when you go shopping, especially for food and other things you need regularly","example[12]":"She always does the weekly shop on a Friday.","definition[4]":"a building or place where things are sold","example[13]":"She's gone to the shops to get some milk.","example[14]":"a clothes shop","example[15]":"Our local store has sold out of sugar for making jam.","display[0]":"boutique","definition[5]":"a small shop that sells fashionable clothes or other objects","example[16]":"a little boutique which specializes in bath products.","display[1]":"superstore","definition[6]":"a very large shop, especially one that is built outside the centre of a city","example[17]":"Out-of-town superstores have taken business away from shops in the city centre.","display[2]":"department store","definition[7]":"a very large shop that is divided into several big parts, each of which sells one type of thing, such as clothes, furniture, or kitchen equipment","example[18]":"He went around all the big department stores in Oxford Street.","display[3]":"supermarket","definition[8]":"a very large shop that sells food, drinks, and things that people need regularly in their homes","example[19]":"Supermarkets have cut down the number of plastic bags they distribute by 50%.","display[4]":"salon","definition[9]":"a shop where you can get your hair washed, cut curled etc","display[5]":"garden centre","definition[10]":"a place that sells a wide range of plants, seeds, and things for your garden","example[20]":"Your local garden centre can advise you on which plants to grow.","display[6]":"outlet","definition[11]":"a shop that sells things for less than the usual price, especially things from a particular company or things of a particular type","example[21]":"The book is available from most retail outlets.","display[7]":"market","definition[12]":"an area, usually outdoors, where people buy and sell many different types of things","example[22]":"I usually buy our vegetables at the market – they're much cheaper there.","display[8]":"mall","definition[13]":"a large area where there are a lot of shops, especially a large building","example[23]":"A new restaurant has opened at the mall.","example[24]":"We used to hang around together at the mall.","display[9]":"strip mall","definition[14]":"a row of shops built together, with a large area for parking cars in front of it","example[25]":"Strip malls can seem rather impersonal.","definition[15]":"to go to one or more shops to buy things","example[26]":"I usually shop for vegetables in the market.","note[5]":"shop for","example[27]":"She always shops at Tesco’s.","note[6]":"shop at","definition[16]":"to tell the police about someone who has done something illegal","example[28]":"He was shopped by his ex-wife.","definition[17]":"a building or part of a building where goods are sold to the public","example[29]":"The shops close at 5.30.","definition[18]":"a place where things are made or repaired","example[30]":"a repair shop","definition[19]":"to start a business","example[31]":"Firms can get grants to set up shop in the area.","definition[20]":"to talk about things that are connected to your work, especially in a way that other people find boring","example[32]":"a group of salespeople talking shop","example[33]":"She went down town to shop for groceries.","example[34]":"Almost two-thirds of Americans shop at a convenience store at least once a week.","definition[21]":"to go to one or more shops to buy things, usually clothes, for enjoyment","example[35]":"Young kids don’t have the money, but they go shopping with Mom."}