{"word[0]":"exposure","signpost[0]":"to danger","definition[0]":"when someone is in a situation where they are not protected from something dangerous or unpleasant","example[0]":"Prolonged exposure to the sun can cause skin cancer.","note[0]":"exposure to","definition[1]":"the action of showing the truth about someone or something, especially when it is bad","example[1]":"the exposure of his underground political activity","note[1]":"exposure of","example[2]":"her fear of exposure as a spy","note[2]":"exposure as","signpost[1]":"public attention","definition[2]":"the attention that someone or something gets from newspapers, television etc","synonym[0]":"publicity","example[3]":"The failure of their marriage has got a lot of exposure recently.","definition[3]":"the chance to experience new ideas, ways of life etc","example[4]":"her brief exposure to pop stardom","example[5]":"The visit to Germany gave them exposure to the language.","signpost[2]":"be very cold","definition[4]":"the harmful effects on your body of being outside in very cold weather without protection","example[6]":"We nearly died of exposure on the mountainside.","signpost[3]":"photography","definition[5]":"a length of film in a camera that is used to take a photograph","example[7]":"I have three exposures left on this roll.","definition[6]":"the amount of time that light is allowed to enter the camera when taking a photograph","definition[7]":"the act of showing something that is usually hidden","definition[8]":"the amount of financial risk that a company or person has","definition[9]":"the direction in which a building, hill etc faces","example[8]":"My bedroom has a southern exposure.","definition[10]":"advertising and PUBLICITY which is used to sell a product or service","example[9]":"Our unrivalled advertising exposure gets fast results.","example[10]":"The convention is important because of the money and media exposure it could bring to the city.","definition[11]":"when a newspaper article or a television programme tells people the truth for the first time about something bad, or someone who has done something illegal, dishonest, or wrong","example[11]":"Other exposures such as the irregular payments to Graham Roberts have come largely from the Press or club officials.","definition[12]":"the amount of money that a bank lends to a customer, and which the bank therefore risks losing","example[12]":"Rising government debt will be a worry, though most of us will be concentrating on dealing with our own borrowing exposures.","example[13]":"Concern overexposure to the troubled group hit the banking sector, with Barclays the main casualty.","definition[13]":"the amount of money an investor risks losing if their investments do badly, for example on the stockmarket","example[14]":"Some companies overlook the fact that foreign exchange exposures rise when the contract is signed.","example[15]":"The fund is aiming to raise $200 million from banks looking to reduce their exposure to Eastern Europe."}