{"word[0]":"decoration","definition[0]":"something pretty that you put in a place or on top of something to make it look attractive","example[0]":"Christmas decorations","example[1]":"cake decorations","definition[1]":"the style in which something is decorated","example[2]":"He is an expert on Islamic decoration.","example[3]":"a box with paper flowers glued to it for decoration","note[0]":"for decoration","definition[2]":"when you paint or put special paper on the inside walls, ceiling etc of a house or building","definition[3]":"something such as a medal that is given to someone as an official sign of honour","definition[4]":"something pretty that you put in a place or onto something to make it look attractive, especially for special occasions","example[4]":"Half a dozen girls volunteered to put up decorations for the dance.","example[5]":"We're making our own Christmas decorations this year.","example[6]":"You could use the ribbon as a decoration.","display[0]":"ornament","definition[5]":"a small pretty object that is used in a room or house to make it look more attractive","example[7]":"The shelves were crammed with ornaments and souvenirs.","example[8]":"a glass ornament","display[1]":"knick-knacks","definition[6]":"small inexpensive objects used to decorate a room","example[9]":"The shop sold cheap knick-knacks for tourists.","example[10]":"She had dusted all the ornaments and knick-knacks.","display[2]":"garnish","definition[7]":"a small amount of food that is used to make a dish look nice or add taste to it","example[11]":"Serve the fish with a garnish of lemon.","display[3]":"trim","definition[8]":"decoration on a car, object, or piece of clothing that goes along the length of it","example[12]":"a white skirt with black trim along the hem","display[4]":"frills","definition[9]":"a decoration on the edge of a piece of cloth that is made of many small folds in the cloth","example[13]":"a white blouse with frills at the cuffs","display[5]":"embellishment","definition[10]":"something that is added in order to make another thing seem more attractive","example[14]":"the colourful embellishments on a medieval manuscript","example[15]":"His style is simple and without embellishment."}