{"word[0]":"it","definition[0]":"used to refer to a thing, animal, situation, idea etc that has already been mentioned or is already known about","example[0]":"‘Where’s your office?’ ‘It’s on the third floor.’","example[1]":"I love the spring – it’s a wonderful time of the year.","example[2]":"There were people crying, buildings on fire. It was terrible!","example[3]":"Don’t blame me. It wasn’t my idea.","example[4]":"This little beast is a lemur and it lives in Madagascar.","definition[1]":"used to refer to the situation that someone is in now, or what is happening now","example[5]":"I can’t stand it any longer. I’m resigning.","example[6]":"How’s it going, Bob? I haven’t seen you for ages.","example[7]":"And the worst of it is the car isn’t even paid for yet.","example[8]":"Stop it, you two. You’re just being silly.","definition[2]":"used as the subject or object of a verb when the real subject or object is later in the sentence","example[9]":"It worries me the way he keeps changing his mind.","example[10]":"What’s it like being a sailor?","example[11]":"Apparently it’s cheaper to fly than to go by train.","example[12]":"It’s a pity you couldn’t come.","example[13]":"It seems that we are not welcome here.","example[14]":"I found it hard to concentrate.","definition[3]":"used as the subject of a sentence when you are talking about the weather, the time, a distance etc","example[15]":"Is it still raining?","example[16]":"It was 4 o'clock and the mail still hadn’t come.","example[17]":"It’s my birthday today.","example[18]":"It’s over 200 miles from London to Manchester.","example[19]":"It gets dark very early in the winter.","example[20]":"It’s three years since I last saw her.","definition[4]":"used with the verb ‘be’ to emphasize that you are talking about one particular thing, person, group etc and not any other","example[21]":"It’s Lawrence you should be talking to.","example[22]":"It was malaria that killed him.","example[23]":"It was in New Zealand that Elizabeth first met Mr Cronje.","definition[5]":"used to refer to a baby when you do not know what sex the baby is","example[24]":"What will you call it if it’s a boy?","definition[6]":"used to say who a person is","example[25]":"‘Who’s that over there?’ ‘It’s Robert Morley.’","definition[7]":"used to say who is speaking, especially on the telephone","example[26]":"Hello, it’s Frank here.","example[27]":"It’s all right, it’s only me.","definition[8]":"used to refer to sex","example[28]":"Have you done it with him yet?","definition[9]":"a particular ability or quality that is needed in order to do something","example[29]":"In a job like advertising, you’ve either got it or you haven’t!","definition[10]":"the study or use of electronic processes and equipment for storing information and making it available","definition[11]":"abbreviation for INFORMATION TECHNOLOGY","example[30]":"IT has had a dramatic affect on the telecoms infrastructure.","example[31]":"the firm’s IT department"}