{"word[0]":"cancel","definition[0]":"to decide that something that was officially planned will not happen","example[0]":"Our flight was cancelled.","example[1]":"I’m afraid I’ll have to cancel our meeting tomorrow.","example[2]":"You’ll just have to ring John and cancel.","explanation[0]":"In everyday English, people often say call something off rather than cancel something:","definition[1]":"to end an agreement or arrangement that you have with someone","example[3]":"I phoned the hotel to cancel my reservation.","example[4]":"The bank agreed to cancel all the company’s debts.","definition[2]":"to say officially that a document can no longer be used or no longer has any legal effect","example[5]":"I phoned the bank to cancel the cheque.","example[6]":"The teacher was ill so classes were cancelled for the day.","example[7]":"I was feeling better so I cancelled my doctor’s appointment.","example[8]":"They were forced to cancel the concert when the conductor became ill.","display[0]":"call off","definition[3]":"to cancel a meeting, game, or event that you have organized. Call off is less formal than cancel and is very commonly used in everyday English","example[9]":"Linda decided to call the wedding off.","example[10]":"The game was called off due to heavy rain.","display[1]":"be off","definition[4]":"if an event or activity is off, it has been cancelled because of a sudden problem or change in someone’s plans","example[11]":"I’m afraid the party’s off. Nick won’t let us use his apartment.","example[12]":"Myers called me yesterday to tell me that the deal was off.","display[2]":"postpone","definition[5]":"to decide to do something at a later time, instead of the time that was officially planned","example[13]":"The show has been postponed until next Saturday.","display[3]":"shelve","definition[6]":"to decide not to continue with a plan, project etc although it may be considered again at some time in the future","example[14]":"Plans for a new stadium have been shelved for now.","example[15]":"The project had to be put on ice due to lack of funding.","example[16]":"Blears called for the discussions to be put on ice until after the elections.","display[4]":"annul","definition[7]":"to officially decide that a marriage, result, or agreement has no legal authority and is therefore cancelled","example[17]":"The election results were annulled by the courts.","example[18]":"A marriage can be annulled if there has been lack of consent.","definition[8]":"to arrange that a planned activity or event will not now happen","example[19]":"Airport security has been increased but there is no intention of cancelling flights.","example[20]":"Because of the takeover moves the meeting was cancelled.","example[21]":"Some airlines have been forced to cancel orders.","definition[9]":"to end an agreement or arrangement that exists in law","example[22]":"You can suspend or even cancel your contract for the period you are away.","definition[10]":"to draw lines across a document so that it no longer has any legal effect"}