{"word[0]":"hardship","definition[0]":"something that makes your life difficult or unpleasant, especially a lack of money, or the condition of having a difficult life","example[0]":"an economic policy that caused great hardship for many people","example[1]":"Many students are suffering severe financial hardship.","example[2]":"the hardships of war","note[0]":"hardship of","collocation[0]":"cause/create hardship","example[3]":"The severe winter caused great hardship in remote villages.","collocation[1]":"experience/suffer hardship","example[4]":"Many pensioners experienced hardship paying the tax.","collocation[2]":"face hardship","example[5]":"One in four families in Britain is facing financial hardship.","collocation[3]":"inflict hardship on somebody","example[6]":"Civil war has inflicted hardship and suffering on thousands of people.","collocation[4]":"alleviate hardship","example[7]":"The program aims to alleviate hardship among the poorest sections of society.","collocation[5]":"great/immense/deep hardship","example[8]":"In the early years, the settlers faced great hardship.","collocation[6]":"severe/serious/extreme hardship","example[9]":"The 1930s brought severe hardship to the Midwest, especially for Oklahoma.","collocation[7]":"economic/financial hardship","example[10]":"The closure of the steelworks caused economic hardship for the town.","collocation[8]":"considerable/substantial hardship","example[11]":"It is a region of considerable hardship and poverty.","collocation[9]":"real/genuine hardship","example[12]":"Prolonged illness can cause real hardship for many families.","collocation[10]":"unnecessary hardship","example[13]":"The ban is causing unnecessary hardship for fishermen.","collocation[11]":"undue hardship","example[14]":"His deportation would pose undue hardship on family members left in the United States.","collocation[12]":"physical hardship","example[15]":"The people of the war-torn region face severe physical hardship.","collocation[13]":"personal hardship","example[16]":"The personal hardship experienced by my client includes the loss of his home, his job and his family.","collocation[14]":"material hardship","example[17]":"Emergency government aid helped to relieve the flood victims' material hardship.","collocation[15]":"in times of hardship","example[18]":"In times of hardship, your family may be the only people you can go to for help."}