{"word[0]":"true","signpost[0]":"not false","definition[0]":"based on facts and not imagined or invented","example[0]":"No, honestly, it’s a true story.","example[1]":"Students decide if statements are true or false.","example[2]":"It’s generally true to say that fewer people are needed nowadays.","example[3]":"The results appear to hold true (=still be correct) for other countries.","example[4]":"It’s not true that I’m going to marry him.","note[0]":"it is true (that)","example[5]":"The same is true of all political parties.","note[1]":"true of","example[6]":"This is especially true for old people.","note[2]":"true for","definition[1]":"the true nature of something is its real nature, which may be hidden or not known","example[7]":"We need to understand the true extent of the problem.","example[8]":"She managed to conceal her true feelings.","example[9]":"After a couple of days she showed her true self (=real character).","example[10]":"The house was sold for only a fraction of its true value.","note[3]":"true value/cost etc (of something)","example[11]":"She wasn’t aware of the true nature of their relationship.","note[4]":"true nature/meaning/identity etc (of something)","signpost[1]":"admitting something","definition[2]":"used when you are admitting that something is correct, but saying that something else, often opposite, is also correct","example[12]":"‘He’s very hard-working.’ ‘True, but I still don’t think he’s the right man for the job.’","example[13]":"It is true that there have been improvements in some areas.","signpost[2]":"proper","definition[3]":"having all the qualities which a type of thing or person should have","example[14]":"The heroine finally finds true love.","example[15]":"She’s been a true friend to me.","example[16]":"It’s an amateur sport in the true sense of the word (=with the exact meaning of this word).","signpost[3]":"loyal","definition[4]":"faithful and loyal to someone, whatever happens","example[17]":"Throughout the whole ordeal, she remained true to her husband.","note[5]":"true to","signpost[4]":"straight/level","definition[5]":"fitted, placed, or formed in a way that is perfectly flat, straight, correct etc","example[18]":"If the door’s not true, it won’t close properly.","collocation[0]":"the true nature of something","example[19]":"The prisoners are encouraged to confront the true nature of their crimes.","collocation[1]":"the true value of something","example[20]":"At the time, I did not recognise the true value of my discovery.","collocation[2]":"the true cost of something","example[21]":"The fixed prescription charge conceals from the general public the true cost of medicines.","collocation[3]":"the true extent of something","example[22]":"Our main difficulty is finding out the true extent of the problem.","collocation[4]":"the true meaning of something","example[23]":"The story teaches a lesson about the true meaning of friendship.","collocation[5]":"somebody’s true identity","example[24]":"He knew someone would soon discover his true identity.","collocation[6]":"somebody’s true feelings","example[25]":"Stephen’s controlled voice disguised his true feelings.","collocation[7]":"somebody’s true self","example[26]":"He had revealed his true self.","definition[6]":"based on real facts, and not imagined or invented","example[27]":"The film was based on a true story.","example[28]":"Do you think the rumours are true?","definition[7]":"based on facts and not containing any mistakes – used about descriptions, information, and numbers","example[29]":"The measurements are accurate.","example[30]":"His assessment of the current economic situation is accurate.","display[0]":"undeniable/indisputable","definition[8]":"definitely true, so that no one can argue or disagree about it","example[31]":"It is indisputable that the situation has got worse.","example[32]":"The decline in inflation was undeniable, even if the reasons for the decline were unclear.","display[1]":"factual","definition[9]":"based on facts, or involving facts","example[33]":"The court makes its decision based on factual evidence.","example[34]":"There is very little factual information about the incident.","example[35]":"a factual account of what happened","example[36]":"The questions ask for a purely factual answer, not for opinion.","display[2]":"verifiable","definition[10]":"able to be proven to be true or correct","example[37]":"The data was verifiable.","display[3]":"it is a fact","definition[11]":"used when saying that something is definitely true","example[38]":"It is a fact that women live longer than men.","display[4]":"be the truth","definition[12]":"to be true – used when saying that someone is not lying","example[39]":"What I told you was the truth.","display[5]":"be the case","definition[13]":"if a situation is the case, that is the way the situation truly is","example[40]":"It is certainly the case that crime rates are lower in Europe than in the US.","definition[14]":"in an exact straight line","example[41]":"The arrow flew straight and true to its target.","definition[15]":"if a type of animal breeds true, the young animals are exactly like their parents","definition[16]":"used to describe the actual amount of something, when extra hidden amounts are added to or taken from it","example[42]":"The APR is the annual percentage rate of the total charge for credit or the true cost of borrowing."}