{"word[0]":"render","definition[0]":"to cause someone or something to be in a particular condition","example[0]":"He was rendered almost speechless by the news.","note[0]":"render somebody/something impossible/harmless/unconscious etc","example[1]":"The blow to his head was strong enough to render him unconscious.","definition[1]":"to give something to someone or do something, because it is your duty or because someone expects you to","example[2]":"an obligation to render assistance to those in need","example[3]":"a bill of $3200 for services rendered (=for something you have done)","example[4]":"It is unlikely that the court will render an opinion before November 5.","note[1]":"render a decision/opinion/judgment etc","definition[2]":"to express or present something in a particular way","example[5]":"She made a sound that in print is rendered as ‘harrumph’.","note[2]":"render something as something","example[6]":"Infrared film renders blue skies a deep black.","note[3]":"render something sth","example[7]":"a sculpture rendered in bronze","note[4]":"render something in something","definition[3]":"to spread plaster or cement on the surface of a wall","example[8]":"a brick wall that has been rendered and whitewashed","definition[4]":"to melt the fat of an animal as you cook it","example[9]":"Steam the goose to render some of the fat.","definition[5]":"to cause something to change in a particular way","example[10]":"He was denied building permission for his property, effectively rendering it worthless.","example[11]":"In some cases, companies were rendered insolvent when they took on big debts in the buy-outs.","definition[6]":"to officially present a company’s accounts showing its profits and losses to people who own shares in it or have another interest in seeing the accounts","example[12]":"The petition claims the company failed to render proper accounts.","definition[7]":"to officially make a decision etc about something","example[13]":"The union hopes the board will render a verdict on the dispute this summer.","definition[8]":"work that has been done, and that is due for payment","example[14]":"Employees who left were barred from collecting payment for services rendered before they withdrew."}