{"word[0]":"debate","definition[0]":"discussion of a particular subject that often continues for a long time and in which people express different opinions","example[0]":"the gun-control debate in the US","example[1]":"The new drug has become the subject of heated debate within the medical profession.","example[2]":"A fierce debate raged over which artist’s work should be chosen for the prize.","example[3]":"Nuclear power has always been a topic that has sparked off considerable debate.","example[4]":"There has been widespread public debate over the introduction of genetically modified food.","note[0]":"debate over/about","example[5]":"There was much lively debate about whether women should spend more time in the home.","example[6]":"the ongoing debate between environmentalists and the road-building lobby over the future of our countryside","note[1]":"debate between","definition[1]":"a formal discussion of a particular problem, subject etc in which people express different opinions, and sometimes vote on them","example[7]":"a televised debate","example[8]":"It would have been better to hold the debate during the day.","note[2]":"have/hold/conduct a debate","example[9]":"a debate on legalized gambling","note[3]":"debate on/over/about","example[10]":"What topics are under debate in Congress this week?","note[4]":"be under debate","collocation[0]":"considerable debate","example[11]":"There has been considerable debate about the way forward for education.","collocation[1]":"lively debate","example[12]":"The conference produced some lively debate.","collocation[2]":"intense debate","example[13]":"The future of the nuclear industry has been a matter of intense debate.","collocation[3]":"a heated/fierce debate","example[14]":"There has been a fierce debate over the way the war was fought.","collocation[4]":"a wider debate","example[15]":"We believe that there should be a wider debate on such an important issue.","collocation[5]":"a public debate","example[16]":"He called for a public debate on race and discrimination.","collocation[6]":"national debate","example[17]":"It is time to start a national debate on the future of the health service.","collocation[7]":"political debate","example[18]":"There was much political debate on pensions reform.","collocation[8]":"long-running debate","example[19]":"the long-running debate about the future of our inner cities","collocation[9]":"ongoing debate","example[20]":"This is unlikely to be the final word in this ongoing debate.","collocation[10]":"have a debate","example[21]":"I think we should have a public debate on this issue.","collocation[11]":"provoke/spark/trigger debate","example[22]":"The episode provoked fierce debate about freedom of speech.","collocation[12]":"stifle debate","example[23]":"How can the party stifle debate on such an important issue?","collocation[13]":"debate rages","example[24]":"A national debate is now raging over the level of youth crime.","collocation[14]":"be the subject of debate","example[25]":"Teaching methods have long been the subject of debate.","collocation[15]":"be a matter of debate","example[26]":"The effectiveness of the government’s policy has been a matter of fierce debate.","collocation[16]":"be a matter for debate","example[27]":"The future of the police force is a matter for public debate.","definition[2]":"to discuss a subject formally when you are trying to make a decision or find a solution","example[28]":"The issue will be debated on Tuesday.","example[29]":"His conclusions are hotly debated (=argued about strongly).","example[30]":"Meanwhile, philosophers debate whether it’s right to clone an individual.","note[5]":"debate whether/what/how etc","example[31]":"an invitation to debate with William on the future of democracy","note[6]":"debate (something) with somebody","definition[3]":"to consider something carefully before making a decision","example[32]":"I debated with myself whether I should tell anyone.","note[7]":"debate with yourself","example[33]":"I’m still debating what to do.","note[8]":"debate who/what/how etc","example[34]":"For a moment Mary debated telling Rick the truth.","note[9]":"debate doing something"}