{"word[0]":"delay","definition[0]":"when someone or something has to wait, or the length of the waiting time","example[0]":"Sorry for the delay, Mr Weaver.","example[1]":"Long delays are expected on the motorways.","note[0]":"long/considerable/slight etc delay","example[2]":"Why was there a delay in warning the public?","note[1]":"delay in","example[3]":"a delay of about an hour","note[2]":"delay of","definition[1]":"when something does not happen or start when it should do","example[4]":"There can be no excuse for any further delay.","example[5]":"They must restore normal services without delay.","note[3]":"without delay","form[0]":"ADJECTIVES/NOUN + delay","collocation[0]":"a slight/short delay","example[6]":"There was a slight delay in the departure of the plane.","collocation[1]":"a long/lengthy delay","example[7]":"Patients often face long delays in getting the treatment they need.","collocation[2]":"a considerable/serious delay","example[8]":"After a considerable delay, the report was finally published.","collocation[3]":"a 20-minute/6-month/4-week etc delay","example[9]":"A train had broken down, causing a two-hour delay.","collocation[4]":"traffic delays","example[10]":"The roadworks are likely to cause serious traffic delays.","collocation[5]":"flight delays","example[11]":"Unfortunately flight delays do sometimes occur.","collocation[6]":"cause/lead to a delay","example[12]":"The bad weather caused a three-hour delay in sending out rescue helicopters.","collocation[7]":"experience delays","example[13]":"People are experiencing considerable delays in receiving their mail.","collocation[8]":"face delays","example[14]":"Commuters face long delays as a result of the rail strikes.","collocation[9]":"reduce delays","example[15]":"The new rules should reduce delays in bringing prisoners to trial.","collocation[10]":"a series of delays","example[16]":"After a series of delays and setbacks, the project was finally approved.","definition[2]":"to wait until a later time to do something","example[17]":"Don’t delay – send off for the information now.","example[18]":"He delayed his decision on whether to call an election.","example[19]":"The opening of this section of the road is delayed until September.","note[4]":"delay something until something","example[20]":"Our meeting was delayed for ten minutes.","note[5]":"delay something for something","example[21]":"Big companies often delay paying their bills.","note[6]":"delay doing something","definition[3]":"to make someone or something late","example[22]":"The flight was badly delayed because of fog.","note[7]":"seriously/badly/slightly etc delayed","example[23]":"He decided to delay his decision until he had seen the full report.","display[0]":"postpone","definition[4]":"to change an event to a later time or date","example[24]":"The meeting was postponed.","display[1]":"put off","definition[5]":"to delay doing something. Put off is less formal than delay or postpone, and is the usual phrase to use in everyday English","example[25]":"I used to put off making difficult decisions.","example[26]":"The game has been put off till next week.","display[2]":"hold off","definition[6]":"to delay doing something, especially while you are waiting for more information or for something else to happen","example[27]":"House buyers seem to be holding off until interest rates drop.","display[3]":"defer","definition[7]":"to delay doing something until a later date, usually because something else needs to happen first","example[28]":"The decision had been deferred until after a meeting of the directors.","example[29]":"She decided to defer her university application for a year so that she could go travelling.","display[4]":"procrastinate","definition[8]":"to delay doing something that you ought to do","example[30]":"Don’t procrastinate – make a start on your assignments as soon as you get them."}