{"word[0]":"forbid","past_tense[0]":"forbade","past_participle[0]":"forbidden","definition[0]":"to tell someone that they are not allowed to do something, or that something is not allowed","example[0]":"The law strictly forbids racial or sexual discrimination.","note[0]":"strictly/expressly/explicitly etc forbid","example[1]":"He was forbidden to leave the house, as a punishment.","note[1]":"forbid somebody to do something","example[2]":"Women are forbidden from going out without a veil.","note[2]":"forbid somebody from doing something","explanation[0]":"In everyday English, people usually say that someone is not allowed to do something rather than is forbidden to do something: ","example[3]":"He was not allowed to leave the house.","definition[1]":"to make it impossible for someone to do something","synonym[0]":"prevent","example[4]":"Lack of space forbids listing the names of all those who contributed.","definition[2]":"to tell someone in a very strong way that they must not do something or that something is not allowed","example[5]":"His doctor had strictly forbidden him to drink alcohol.","example[6]":"It is forbidden to say such things.","display[0]":"not allow","definition[3]":"to say that someone must not do or have something, and stop them doing or having it","example[7]":"The company does not allow smoking inside the building.","example[8]":"Mobile phones are not allowed in school.","display[1]":"not let","definition[4]":"to not allow someone to do something. Not let  is more informal than not allow","example[9]":"My parents won’t let me stay out later than 11 o'clock.","display[2]":"not permit","definition[5]":"if something is not permitted, a rule or law says that you must not do it. Not permit  is more formal than not allow","example[10]":"Candidates are not permitted to use dictionaries in this examination.","example[11]":"Parking is not permitted here after 8 am.","display[3]":"ban","definition[6]":"to say officially that people must not do or have something","example[12]":"Parliament decided to ban fox-hunting.","example[13]":"The book was banned in many countries.","display[4]":"prohibit","definition[7]":"to say officially that an action is illegal and make a law or rule about this","example[14]":"Acts of vandalism are prohibited.","display[5]":"bar","definition[8]":"to not allow someone to enter a place or do something, especially by preventing it officially","example[15]":"Foreign journalists were barred from entering the country.","display[6]":"proscribe","definition[9]":"to say officially that people are not allowed to do something","example[16]":"The law proscribes discrimination in the workplace."}