{"word[0]":"capture","definition[0]":"to catch a person and keep them as a prisoner","example[0]":"Government troops have succeeded in capturing the rebel leader.","example[1]":"40 captured French soldiers","signpost[0]":"place/thing","definition[1]":"to get control of a place or object that previously belonged to an enemy, during a war","example[2]":"The town was captured after a siege lasting ten days.","example[3]":"The Dutch fleet captured two English ships.","definition[2]":"to catch an animal after chasing or following it","example[4]":"The tiger was finally captured two miles outside the village.","signpost[1]":"film/record/art","definition[3]":"to succeed in recording, showing, or describing a situation or feeling, using words or pictures","example[5]":"These photographs capture the essence of working-class life at the turn of the century.","example[6]":"The robbery was captured on police video cameras.","signpost[2]":"business/politics","definition[4]":"to get something that previously belonged to one of your competitors","example[7]":"We aim to capture eight percent of the UK wine market.","example[8]":"Republicans captured three Senate seats from the Democrats.","definition[5]":"to put something in a form that a computer can use","example[9]":"The data is captured by an optical scanner.","signpost[3]":"chess","definition[6]":"to remove one of your opponent’s pieces from the board in chess","definition[7]":"when you catch someone in order to make them a prisoner","example[10]":"The two soldiers somehow managed to avoid capture.","definition[8]":"when soldiers get control of a place that previously belonged to an enemy","example[11]":"the capture of Jerusalem in 1099","note[0]":"capture of","definition[9]":"when you get control of something that previously belonged to one of your competitors","definition[10]":"when you put information into a form a computer can use","example[12]":"Japanese firms have captured over 60% of the electronics market.","definition[11]":"to put something such as information or a picture into a form that a computer can use","example[13]":"The data is captured using an optical scanner."}