{"word[0]":"Internet","collocation[0]":"use the Internet","example[0]":"More and more companies are using the Internet to conduct their business.","collocation[1]":"go on the Internet","example[1]":"I went on the Internet to find some information for my assignment.","collocation[2]":"access the Internet/connect to the Internet","example[2]":"You can access the Internet from your mobile phone.","collocation[3]":"surf the Internet","example[3]":"She spends hours surfing the Internet every evening.","collocation[4]":"download something from the Internet","example[4]":"I downloaded the file from the Internet.","collocation[5]":"buy something on the Internet","example[5]":"He bought the chairs on the Internet.","form[0]":"Internet + NOUN","collocation[6]":"an Internet connection","example[6]":"a high-speed Internet connection","collocation[7]":"Internet access","example[7]":"Not everyone has Internet access at home.","collocation[8]":"an Internet address","example[8]":"The company charges $100 to register a new internet address.","collocation[9]":"an Internet service provider","example[9]":"Your Internet service provider should be able to solve the problem.","collocation[10]":"Internet shopping/banking","example[10]":"The new regulations will increase customer confidence in Internet shopping.","example[11]":"Internet banking saves customers a lot of time.","collocation[11]":"an Internet user","example[12]":"The number of Internet users is doubling every six months.","collocation[12]":"Internet use","example[13]":"The software allows parents to control children’s Internet use.","collocation[13]":"Internet traffic","example[14]":"An estimated 40% of the nation’s Internet traffic begins or ends in California.","collocation[14]":"Internet dating","example[15]":"Internet dating websites are becoming increasingly popular.","collocation[15]":"an Internet café","example[16]":"The message had been sent from an Internet café in Leeds.","heading[0]":"GRAMMAR: Patterns with Internet","explanation[0]":"You do something on the Internet","example[17]":"We do most of our shopping on the Internet","example[18]":"They met on the Internet","bad_example[0]":"We do most of our shopping by Internet","bad_example[1]":"They met by Internet","explanation[1]":"You usually say the Internet","example[19]":"I often use the Internet to find out information","bad_example[2]":"I often use Internet to find out information","heading[1]":"things you do when using the Internet","display[0]":"surf the net","definition[0]":"to look quickly through information on the Internet, looking for anything that interests you","example[20]":"He spends his evenings surfing the net.","definition[1]":"to look for a specific piece of information on the Internet, for example by entering text into a box","example[21]":"Try searching for his name on Google.","display[1]":"shop/book online","definition[2]":"to buy things or reserve tickets using the Internet","example[22]":"More and more people are preferring to shop online.","example[23]":"It’s easier to book online.","display[2]":"visit a website","definition[3]":"to look at a particular Internet site","example[24]":"You can check to see how many people visit your website.","display[3]":"download","definition[4]":"to get files, programs, music, films etc from the Internet and put them on your own computer","example[25]":"I downloaded the software for free from the Internet.","display[4]":"chat","definition[5]":"to communicate with several people in a chat room on the Internet","example[26]":"Using the Internet, you can chat to people from around the world.","definition[6]":"the network of computer systems that allows computer users around the world to exchange information","example[27]":"These regulations have been published on the Internet.","example[28]":"Do you have access to the Internet?"}