{"word[0]":"spot","definition[0]":"a particular place or area, especially a pleasant place where you spend time","example[0]":"a nice quiet spot on the beach","example[1]":"I chose a spot well away from the road.","example[2]":"the exact spot where the king was executed","note[0]":"the exact/same/very spot","example[3]":"a small cottage in an idyllic spot","note[1]":"in a spot","example[4]":"Why do they want to build a house on this particular spot?","note[2]":"on a spot","example[5]":"an ideal spot for a picnic","note[3]":"spot for","definition[1]":"a usually round area on a surface that is a different colour or is rougher, smoother etc than the rest","synonym[0]":"patch","example[6]":"a white cat with brown spots","example[7]":"Two spots of colour appeared in Jill’s cheeks.","note[4]":"spot of","definition[2]":"a small mark on something, especially one that is made by a liquid","example[8]":"There was a big damp spot on the wall.","example[9]":"a few spots of blood","signpost[0]":"on skin","definition[3]":"a small round red area on someone’s skin that shows that they are ill","example[10]":"He had a high fever and was covered in spots.","definition[4]":"a small raised red mark on someone’s skin, especially on their face","example[11]":"Becka was very self-conscious about her spots.","signpost[1]":"tv/radio","definition[5]":"a short period of time when someone can speak or perform on radio or television","example[12]":"He was given a 30-second spot just after the news.","example[13]":"a guest spot on ‘The Tonight Show’","definition[6]":"a position in a list of things or in a competition","example[14]":"The budget has a regular spot on the agenda.","example[15]":"Manchester United are still in the top spot after today’s win.","definition[7]":"to notice someone or something, especially when they are difficult to see or recognize","example[16]":"I spotted a police car behind us.","example[17]":"It can be hard for even a trained doctor to spot the symptoms of lung cancer.","example[18]":"Drug addicts are fairly easy to spot.","note[5]":"difficult/easy to spot","example[19]":"Meg spotted someone coming out of the building.","note[6]":"spot somebody doing something","example[20]":"One of the station staff spotted that I was in difficulty, and came to help.","note[7]":"spot that","definition[8]":"to give the other player in a game an advantage","example[21]":"He spotted me six points and he still won.","note[8]":"spot somebody something","definition[9]":"for buying or paying immediately, not at some future time","example[22]":"They won’t take credit; they want spot cash.","example[23]":"He quoted us a spot price for the goods.","definition[10]":"involving delivery now, rather than in the future","example[24]":"The settlement period for spot transactions is two business days.","example[25]":"a spot cash payment  (=for goods that are delivered immediately)"}