{"word[0]":"imagine","definition[0]":"to form a picture or idea in your mind about what something could be like","example[0]":"Imagine life without hot water.","example[1]":"After such a dry summer, it’s difficult to imagine what rain looks like.","note[0]":"it’s difficult/easy/possible/impossible etc to imagine something","example[2]":"Imagine that you have just won a million pounds.","note[1]":"imagine (that)","example[3]":"Can you imagine what it’s like when it’s really hot out here in Delhi?","note[2]":"imagine what/how/why etc","example[4]":"She could imagine dark-robed figures moving silently along the stone corridors.","note[3]":"imagine somebody doing something","example[5]":"Imagine doing a horrible job like that!","note[4]":"(just) imagine doing something","example[6]":"Just imagine going all that way for nothing!","example[7]":"He didn’t quite dare to imagine himself as a real artist.","note[5]":"imagine somebody/something as something","example[8]":"Somehow, I can’t imagine him without a beard.","note[6]":"imagine somebody in/with/without etc something","explanation[0]":"Imagine is followed by an -ing form, not an infinitive You say","example[9]":"I can’t imagine living without music","bad_example[0]":"I can’t imagine to live without music","definition[1]":"to have a false or wrong idea about something","example[10]":"Perhaps she’d never really been there at all – perhaps she’d just imagined it.","example[11]":"imagined dangers","example[12]":"She had imagined that the doctor would be male.","example[13]":"I was surprised when I saw the farm. I had imagined it would be much bigger.","example[14]":"There’s nobody here. You’re just imagining things.","note[7]":"imagine something/somebody to be something","definition[2]":"to think that something is true or may happen, but without being sure or having proof","example[15]":"‘A very complicated subject, I imagine, ’ said Edwin.","example[16]":"You are obviously tired and I imagine that nothing would make you admit it.","heading[0]":"– Meaning 1 : to form a picture or idea in your mind about what something could be like","collocation[0]":"be easy to imagine","example[17]":"It’s easy to imagine how the change in the law caused a lot of confusion.","collocation[1]":"be hard/difficult to imagine","example[18]":"It’s hard to imagine the suffering she must have gone through.","collocation[2]":"can easily imagine","example[19]":"I can easily imagine how frightening the accident must have been.","collocation[3]":"can well imagine","example[20]":"I can well imagine how delighted you were with the news.","collocation[4]":"can hardly/scarcely imagine","example[21]":"He could scarcely imagine what living in such poor conditions must have been like.","collocation[5]":"can’t/couldn’t imagine","example[22]":"He couldn’t imagine life without his wife.","collocation[6]":"what somebody had imagined","example[23]":"The office was not what he had imagined.","collocation[7]":"be bigger/smaller/worse etc than you had imagined","example[24]":"The job interview proved to be much worse than I had imagined it would be.","collocation[8]":"let us imagine …","example[25]":"Let us imagine that you are an employer who wants to recruit some new staff.","collocation[9]":"somebody is imagining things","example[26]":"She’s imagining things if she thinks she has a chance of winning the prize.","collocation[10]":"naively imagine","example[27]":"She had naively imagined that marriage would solve all her problems.","collocation[11]":"fondly imagine","example[28]":"He had fondly imagined that she was in love with him.","definition[3]":"to form a picture or idea in your mind about what something might be like","example[29]":"When I think of Honolulu, I imagine long white beaches and palm trees.","example[30]":"I can’t really imagine being a millionaire.","display[0]":"visualize","definition[4]":"to form a picture of someone or something in your mind, especially something that is definitely going to happen or exist in the future","example[31]":"Anna visualized meeting Greg again at the airport.","example[32]":"The finished house may be hard to visualize.","definition[5]":"to form a clear picture of something or someone in your mind","example[33]":"I can still picture my father, even though he died a long time ago.","example[34]":"The town was just how she had pictured it from his description.","display[1]":"envisage","definition[6]":"to imagine something as possible or likely to happen in the future","example[35]":"How do you envisage your career developing over the next ten years?","example[36]":"They had envisioned the creation of a single armed force, small but efficient.","display[2]":"conceive of something","definition[7]":"to imagine a situation, especially one that is difficult to imagine","example[37]":"For many people, music is so important that they cannot conceive of life without it.","display[3]":"fantasize","definition[8]":"to imagine something exciting that you would like to happen, but that is very unlikely to happen","example[38]":"I used to fantasize about becoming a film star.","display[4]":"daydream","definition[9]":"to imagine pleasant things, so that you forget where you are and what you should be doing","example[39]":"Mark began to daydream, and didn’t even hear the teacher’s question.","display[5]":"hallucinate","definition[10]":"to imagine that you are seeing things that are not really there, especially because you are ill or have taken drugs","example[40]":"The drug can cause some people to hallucinate.","example[41]":"When I saw the walls moving, I thought I must be hallucinating."}