{"word[0]":"application","signpost[0]":"written request","definition[0]":"a formal, usually written, request for something such as a job, place at university, or permission to do something","example[0]":"We receive hundreds of job applications  each year.","example[1]":"I filled in the application form and sent it off.","example[2]":"You have to submit your application  before the end of the month.","example[3]":"I’ve put in an application for a transfer.","example[4]":"He received a letter saying that his application had been rejected.","example[5]":"It can take a long time for your visa application to be processed.","example[6]":"The Council is currently reviewing the way it deals with planning applications.","example[7]":"Thank you for your letter of application, which we received yesterday.","example[8]":"an application for a grant","note[0]":"application for","example[9]":"The university welcomes applications from overseas students.","note[1]":"application from","signpost[1]":"practical use","definition[1]":"the practical purpose for which a machine, idea etc can be used, or a situation when this is used","example[10]":"The research has many practical applications.","example[11]":"the applications of genetic engineering in agriculture","note[2]":"application of/to/in","definition[2]":"a piece of computer software which does a particular job","example[12]":"We received training on a number of spreadsheet and database applications.","signpost[2]":"paint/liquid","definition[3]":"when you put something such as paint, liquid, medicine etc onto a surface","example[13]":"The application of fertilizer increased the size of the plants.","note[3]":"application of","signpost[3]":"effort","definition[4]":"attention or effort over a long period of time","example[14]":"Making your new business successful requires luck, patience, and application.","form[0]":"ADJECTIVES/NOUN + application","collocation[0]":"a job application","example[15]":"He's made twenty-three job applications and had five interviews.","collocation[1]":"a planning application","example[16]":"We have lodged a planning application for a housing development on the site.","collocation[2]":"a formal application","example[17]":"Turkey has made a formal application to join the European Union.","form[1]":"application + NOUN","collocation[3]":"an application form","example[18]":"Simply fill in the application form and return it to your bank.","collocation[4]":"a letter of application","example[19]":"The purpose of your letter of application is to get an interview.","collocation[5]":"make an application","example[20]":"Candidates are advised to make an early application to the university.","collocation[6]":"fill out/fill in an application","example[21]":"I would like to fill out an application for the position.","example[22]":"You can fill in the application form online.","collocation[7]":"put in/submit an application","example[23]":"The company has submitted a planning application.","collocation[8]":"consider an application","example[24]":"All applications will be considered on their own merits.","collocation[9]":"grant/approve an application","example[25]":"What are the reasons for not granting this application?","collocation[10]":"refuse/reject/turn down an application","example[26]":"Their planning application was rejected because of a lack of parking facilities.","collocation[11]":"process an application","example[27]":"Your application for British citizenship will be processed by the Immigration Service.","collocation[12]":"accept an application","example[28]":"The college refused to accept my application.","collocation[13]":"withdraw your application","example[29]":"The company withdrew its application to build the bridge.","definition[5]":"a formal, usually written, request for something or for permission to do something","example[30]":"It has submitted an application to establish a distribution company.","note[4]":"an application to do something","example[31]":"The company filed an application with the Food and Drug Administration to begin trials on the drug.","example[32]":"Fill in your application form and return it to us before 30 April.","definition[6]":"a practical use for something","example[33]":"Sheet steel is used in a wide variety of applications, ranging from pails to car hoods.","definition[7]":"a piece of software for a particular use or job","example[34]":"The top-selling application was Microsoft Office."}