{"word[0]":"balance","signpost[0]":"steady","definition[0]":"a state in which all your weight is evenly spread so that you do not fall","example[0]":"I lost my balance and fell on my face.","signpost[1]":"equal amounts","definition[1]":"a state in which opposite forces or influences exist in equal or the correct amounts, in a way that is good","opposite[0]":"imbalance","example[1]":"Try to keep a balance between work and play.","note[0]":"balance between","example[2]":"Pesticides seriously upset the balance of nature.","note[1]":"balance of","signpost[2]":"bank","definition[2]":"the amount of money that you have in your bank account","example[3]":"My bank balance isn’t good.","signpost[3]":"money owed","definition[3]":"the balance of a debt is the amount of money that you still owe after you have paid some of it","example[4]":"The balance is due at the end of the month.","signpost[4]":"for weighing","definition[4]":"an instrument for weighing things, with two dishes that hang from a bar","synonym[0]":"scales","signpost[5]":"mental/emotional health","definition[5]":"when someone’s mind is healthy and their emotional state is normal","example[5]":"The death of her friend had disturbed the balance of her mind.","heading[0]":"– Meaning 1: a state in which all your weight is evenly spread so that you do not fall","collocation[0]":"keep your balance","example[6]":"The sea was so rough that it was hard to keep your balance.","collocation[1]":"lose your balance","example[7]":"She nearly lost her balance as the bus suddenly moved forward.","collocation[2]":"regain/recover your balance","example[8]":"He held onto Carrie until he regained his balance.","collocation[3]":"knock/throw somebody off balance","example[9]":"The blow was hard enough to knock him off balance.","collocation[4]":"a sense of balance","example[10]":"A good sense of balance is always useful when you are sailing.","heading[1]":"– Meaning 2: a state in which opposite forces or influences exist in equal or the correct amounts, in a way that is good","collocation[5]":"strike/achieve/find a balance","example[11]":"It is necessary to strike a balance between the needs of employers and employees.","example[12]":"Find the right balance between enough exercise and enough rest.","collocation[6]":"keep/maintain a balance","example[13]":"Try to keep a balance between your spending and your earnings.","example[14]":"A firm must strive to maintain a balance between business and financial risk.","collocation[7]":"upset the balance","example[15]":"The move could upset the delicate balance of power in the Middle East.","collocation[8]":"change/alter/shift the balance","example[16]":"Will this alter the balance of power in the EU?","example[17]":"His appointment shifted the government’s balance decisively to the right.","collocation[9]":"redress the balance","example[18]":"What can be done to redress the balance in favour of women?","collocation[10]":"a good/healthy balance","example[19]":"You should eat a good balance of carbohydrates and protein.","example[20]":"Are you eating a healthy balance of foods?","collocation[11]":"a fine balance","example[21]":"Teachers need to strike a fine balance of flexibility and control.","collocation[12]":"a delicate balance","example[22]":"Too much carbon dioxide in the atmosphere upsets the delicate balance of gases.","collocation[13]":"the right/proper/correct balance","example[23]":"With sport, you have to find the right balance between competition and fun.","collocation[14]":"the natural balance","example[24]":"Chemicals will upset the natural balance of the pond.","collocation[15]":"the ecological balance","example[25]":"Human activity is ruining the ecological balance of our planet.","collocation[16]":"the political/military balance","example[26]":"By this time, the political balance in the Cabinet had altered.","collocation[17]":"the balance of power","example[27]":"the European balance of power","collocation[18]":"the balance of nature","example[28]":"Nothing can justify permanent damage to the balance of nature.","definition[6]":"to be in or get into a steady position, without falling to one side or the other, or to put something into this position","example[29]":"She was balancing a plate of food on her knees.","note[2]":"balance something on something","example[30]":"He turned around, balancing awkwardly on one foot.","note[3]":"balance on","definition[7]":"to be equal in importance, amount, value, or effect to something that has the opposite effect","example[31]":"Job losses in manufacturing were balanced by job increases in the service sector.","example[32]":"just enough sugar to balance the acidity of the fruit","definition[8]":"to consider the importance of one thing in relation to something else when you are making a decision","example[33]":"The courts must balance our liberty against the security of the nation.","note[4]":"balance something against something","definition[9]":"the difference between the total amounts of money coming into and going out of an account in a particular period of time","definition[10]":"an amount still owed after some money has been paid","example[34]":"The firm has paid $128,000, but whether it will ever pay the balance remains uncertain.","example[35]":"Most people have an outstanding balance on their credit cards for a couple of months, then pay it off.","definition[11]":"the rest or remaining part of an amount","example[36]":"20,000 barrels a day are shipped to San Francisco, and the balance is delivered by pipeline directly to Los Angeles.","definition[12]":"to calculate the amount needed to make the debit side and the credit side of an account equal, perhaps by looking for mistakes","definition[13]":"if the debit and credit sides of an account balance, they show the same amounts","definition[14]":"to do what is necessary to spend no more than the amount of money received, usually by a government","example[37]":"Costa Rica has worked on programs with the International Monetary Fund to balance its accounts.","example[38]":"Real differences exist between the administration and Congress over how to balance the budget and where to cut taxes."}