{"word[0]":"much","definition[0]":"by a great amount","example[0]":"I’m feeling very much better, thank you.","example[1]":"Henry’s room is much bigger than mine.","note[0]":"much better/greater/easier etc","example[2]":"These shoes are much more comfortable.","example[3]":"He was driving much too fast.","note[1]":"much too big/old etc","example[4]":"It’s much the best way to do it.","note[2]":"much the best/most interesting etc","heading[0]":"USAGE: Much","explanation[0]":"The adverb much is mainly used before comparative adjectives or adjectives with 'too'","example[5]":"He’s much older than she is","example[6]":"The soup was much too salty","explanation[1]":"It is not usually used before other adjectives, but much can be used before different, especially in negatives and questions","example[7]":"It's not much different from when I was young","definition[1]":"used to ask or talk about the degree of a difference","example[8]":"She kept weighing herself to see how much heavier she was getting.","note[3]":"how much older/smaller etc","definition[2]":"used to ask or talk about how big an additional amount of something is","example[9]":"How much longer do we have to wait?","note[4]":"how much more/longer/further","example[10]":"How much further is it?","definition[3]":"used to emphasize the difference you are mentioning","example[11]":"I was surprised to see how much better she was looking.","note[5]":"how much better/nicer/easier etc","example[12]":"How much better life would be if we returned to the values of the past!","definition[4]":"used to talk about a strong feeling or something that is done often","example[13]":"He talks too much.","example[14]":"We’re looking forward to your visit so much.","example[15]":"Thank you very much!","example[16]":"You know how much I care about you.","note[6]":"how/however much","example[17]":"I think you have to accept the pain, however much it hurts.","example[18]":"The money will buy much needed books for the school.","note[7]":"much loved/admired/discussed etc","definition[5]":"a large amount of something","example[19]":"I don’t have much money with me.","example[20]":"Was there much traffic?","example[21]":"He didn’t say much about his trip.","example[22]":"Do you get much chance to travel in your job?","example[23]":"After much consideration we have finally arrived at a decision.","example[24]":"It was such a small thing to have caused so much trouble.","example[25]":"There was too much work for one person.","note[8]":"(far/rather/a little) too much","example[26]":"It would cost far too much to have the thing repaired.","example[27]":"Much of the city was destroyed in the attack.","note[9]":"much of","definition[6]":"used in negative expressions to say that something is not important, interesting, good etc","example[28]":"I don’t think much of that idea  (=I do not think it is good).","example[29]":"The car may not be much to look at (=it does not look good) but it’s very reliable.","example[30]":"It’s the best book he’s written, but that’s not saying much (=none of his books is very good).","example[31]":"‘What are you doing?’ ‘Oh, not much, really.’","note[10]":"not/nothing much","example[32]":"There’s nothing much we can do to help.","explanation[2]":"Much  is mainly used in questions and negative sentences, or after too or so","example[33]":"Was there much snow?","example[34]":"There’s not much time left","example[35]":"You’ve used too much soap","explanation[3]":"Much sounds very formal in positive statements It is usually better to say a lot of","example[36]":"There was a lot of food left","bad_example[0]":"There was much food left","explanation[4]":"You use much before uncountable nouns","example[37]":"I don’t have much money","explanation[5]":"You use many before plural nouns","example[38]":"There are too many advertisements on TV","bad_example[1]":"There are too much advertisements on TV"}