{"word[0]":"attraction","definition[0]":"a feeling of liking someone, especially in a sexual way","example[0]":"The attraction between them was almost immediate.","definition[1]":"something interesting or enjoyable to see or do","note[0]":"tourist attraction (=a place that many tourists visit)","example[1]":"The beautiful beaches are the island’s main attraction (=most popular place, activity etc).","definition[2]":"a feature or quality that makes something seem interesting or enjoyable","example[2]":"Being your own boss is one of the attractions of owning your own business.","note[1]":"attraction of","definition[3]":"a force which makes things move together or stay together","example[3]":"the gravitational attraction between the Earth and the Moon","heading[0]":"– Meaning 2: something interesting or enjoyable to see or do","form[0]":"ADJECTIVES/NOUN + attraction","collocation[0]":"the main attraction","example[4]":"The lovely countryside is obviously the main attraction for visitors.","collocation[1]":"the star attraction","example[5]":"The former president was the star attraction of the conference.","collocation[2]":"a popular attraction","example[6]":"The zoo is by far the most popular attraction.","collocation[3]":"a big/major attraction","example[7]":"The ducks and geese are a big attraction to children.","collocation[4]":"a special attraction","example[8]":"A special attraction is the tropical greenhouse.","collocation[5]":"a tourist attraction","example[9]":"The British Museum is one of London’s most popular tourist attractions.","collocation[6]":"a visitor attraction","example[10]":"The park will be a new visitor attraction for the town.","collocation[7]":"be/become/prove an attraction","example[11]":"The organisers hope the event will become an annual attraction.","definition[4]":"a feature or quality that makes people like, want, or feel interested in something","example[12]":"The excitement is part of the attraction of the job.","example[13]":"For many mothers, the attraction of childcare in the workplace is the chance to be near their children.","example[14]":"The idea of living in another country does have a certain attraction.","display[0]":"appeal","definition[5]":"a quality that makes people like something or someone","example[15]":"Much of Corfu’s appeal lies in its lively night life.","example[16]":"I don’t understand the appeal of this kind of music.","display[1]":"the lure of something","definition[6]":"a very attractive quality that makes you want something very much – often used about something that has a bad effect or influence","example[17]":"It’s hard to resist the lure of credit cards and easy money.","example[18]":"The lure of urban life is especially powerful for the young.","display[2]":"charm","definition[7]":"a pleasant quality that someone or something has that makes people like them, feel attracted to them, or be influenced by them","example[19]":"He was physically attractive and possessed considerable personal charm.","example[20]":"The book captures Savannah’s old Southern charm perfectly.","display[3]":"glamour","definition[8]":"the attractive and exciting quality that is connected with wealth and success","example[21]":"the glamour of Monte Carlo","example[22]":"Hollywood glamour","example[23]":"The world of modelling is famous for its glitz and glamour.","display[4]":"draw","definition[9]":"something that makes people want to do something or go somewhere","example[24]":"The money is a big draw for many players.","example[25]":"The island’s main draw is its wonderful beaches."}