{"word[0]":"spend","past_tense[0]":"spent","definition[0]":"to use your money to pay for goods or services","example[0]":"I can’t afford to spend any more money this week.","example[1]":"The repairs cost a lot, but it’s money well spent (=a sensible way of spending money).","example[2]":"I only want to spend about $20.","note[0]":"spend £5/$10 etc","example[3]":"More money should be spent on education.","note[1]":"spend something on something","example[4]":"Mum never spends any money on herself.","note[2]":"spend something on somebody","explanation[0]":"You spend money on something","example[5]":"I don’t spend much on clothes","bad_example[0]":"I don’t spend much for clothes","definition[1]":"to use time doing a particular thing or pass time in a particular place","example[6]":"I want to spend more time with my family.","note[3]":"spend time etc with somebody","example[7]":"We’ll have to spend the night in a hotel.","note[4]":"spend time etc in/at something","example[8]":"His childhood was spent in Brazil.","example[9]":"Stacey spends all her free time painting.","note[5]":"spend time etc doing something","definition[2]":"to stay for the night and have sex with someone","definition[3]":"if someone spends the night at someone’s house, they sleep at that person’s house for a night","example[10]":"She spent the night at a friend’s house.","signpost[0]":"force/effort","definition[4]":"to use effort or energy to do something","example[11]":"I love to cook, but I don’t feel like spending the energy every evening.","definition[5]":"to use money to buy things","example[12]":"I bought two skirts and a T-shirt and I only spent $50.","example[13]":"How much do you spend a week on food?","display[0]":"go through something","definition[6]":"to spend all of an amount of money over a period of time – used especially when saying that someone spends a lot of money","example[14]":"I got through all my money in less than a month, and had to get my parents to send me more.","display[1]":"go to great expense","definition[7]":"to spend a lot of money in order to do something, because you think it is important or special","example[15]":"The party was wonderful – they had obviously gone to great expense.","example[16]":"There’s no need to go to great expense.","display[2]":"squander","definition[8]":"to waste money on unnecessary things, instead of saving it or using it carefully","example[17]":"His son had squandered the family fortune on gambling and women.","display[3]":"splash out","definition[9]":"to spend a lot of money on something you really want or will enjoy","example[18]":"Let’s splash out on a bottle of champagne.","example[19]":"People often splash out for Christmas and then regret it later.","display[4]":"blow","definition[10]":"to spend a lot of money on something, especially on something that you do not really need","example[20]":"Her husband blew all their savings on a new sports car.","display[5]":"economize","definition[11]":"to spend less money","example[21]":"We’re trying to economize by eating at home instead of going out for meals.","definition[12]":"the amount of money spent by a company, organization, or person on something – used especially in business","example[22]":"I was just totting up our advertising spend in the last four or five weeks.","definition[13]":"to use your money to buy or pay for things","example[23]":"How much do we have to spend?","example[24]":"It is worth spending money on advertising.","definition[14]":"to use or pass time","example[25]":"Effective managers spend time getting to know their workers.","example[26]":"I have spent the past seven years working in industry.","definition[15]":"the amount of money spent by a company on a particular activity in a particular period of time","example[27]":"They increased the marketing spend needed to launch the new brands."}