{"word[0]":"a lot","definition[0]":"a large amount or number","example[0]":"We’ve spent a lot on the children’s education.","example[1]":"‘How many CDs have you got?’ ‘Lots.’","example[2]":"He spends an awful lot of time on the computer.","note[0]":"an awful lot","example[3]":"I still have a lot to learn.","note[1]":"a lot to do/learn/say etc","example[4]":"It’s a great city, with lots to see and do.","example[5]":"They paid a lot of money for that house.","note[2]":"a lot of","example[6]":"I eat a lot of vegetables.","example[7]":"There were lots of people at the party.","explanation[0]":"A lot of is fairly informal and is mainly used in spoken English or informal written English","explanation[1]":"You can use a lot of with a plural noun and a plural verb","example[8]":"A lot of people were hurt","explanation[2]":"You can use a lot of with an uncountable noun and a singular verb","example[9]":"A lot of money was spent on it","explanation[3]":"Lots of is more informal than a lot of, but is used in exactly the same way","example[10]":"Lots of people were hurt","example[11]":"Lots of money was spent on it","explanation[4]":"In written English, you usually use many or a large amount of","explanation[5]":"You use many with a plural noun and a plural verb","example[12]":"Many people were hurt","explanation[6]":"You use a large amount of with an uncountable noun and a singular verb","example[13]":"A large amount of money was spent on it","explanation[7]":"When talking about years, days, weeks etc, you usually use many instead of a lot of","example[14]":"The book took many years to write","bad_example[0]":"The book took a lot of years to write","definition[1]":"if someone or something is a lot better, faster, easier etc, they are much better, faster etc","synonym[0]":"much","example[15]":"My headache is lots better, thanks.","example[16]":"She has a lot more contact with clients these days.","example[17]":"You’ll get there a lot quicker if you take the motorway.","example[18]":"The house is a lot tidier now Chris has left home.","definition[2]":"used to say that something happens to a great degree or often","example[19]":"Things have changed a lot since I was a child.","example[20]":"Paul travels a lot on business.","example[21]":"I’ve been worrying a lot about my health.","example[22]":"She likes you a lot."}