{"word[0]":"priority","plural[0]":"priorities","definition[0]":"the thing that you think is most important and that needs attention before anything else","example[0]":"The club’s priority is to win the League.","example[1]":"After several burglaries in the area, security is now a high priority (=very important and needing attention soon).","example[2]":"With so little money available, repairs must remain a low priority (=not important and not needing attention soon).","example[3]":"The customer is high on our list of priorities.","example[4]":"List your tasks in order of priority (=most important first).","example[5]":"The children are our first priority.","note[0]":"first/top/main priority","definition[1]":"the right to be given attention first and before other people or things","example[6]":"I want to start work on the garden but the house must take priority.","example[7]":"Buses should have priority over other road users.","note[1]":"priority over","example[8]":"A young person who has finished the course will be given priority over one who has not.","heading[0]":"– Meaning 1: the thing that you think is most important and that needs attention before anything else","collocation[0]":"a high priority","example[9]":"Right now, the environment is a high priority.","collocation[1]":"an urgent priority","example[10]":"He sees these negotiations as an urgent priority.","collocation[2]":"a low priority","example[11]":"At that time, architecture was a low priority.","collocation[3]":"the top/main/number one priority","example[12]":"Controlling spending is his top priority.","collocation[4]":"the first priority","example[13]":"The first priority for most unemployed people is obtaining a job.","collocation[5]":"the overriding priority","example[14]":"The reduction of inflation must be the Government’s overriding priority.","collocation[6]":"somebody’s immediate priority","example[15]":"Their immediate priority was to find somewhere to sleep that night.","collocation[7]":"a list/set of priorities","example[16]":"Marriage isn’t very high on my list of priorities.","collocation[8]":"in order of priority","example[17]":"They asked voters to list issues in order of priority.","collocation[9]":"set priorities","example[18]":"With any new project, it's important to set priorities.","collocation[10]":"sort out your priorities","example[19]":"If you’ve got a lot of things to do, sort out your priorities.","collocation[11]":"make something a priority","example[20]":"Lisa had a job, but she'd always made her family the priority.","collocation[12]":"somebody’s priorities change","example[21]":"As you get older, your priorities may change.","heading[1]":"– Meaning 2: the right to be given attention first and before other people or things","collocation[13]":"have priority","example[22]":"Couples may have to decide whose career has priority.","collocation[14]":"get priority","example[23]":"The breakdown services say that women on their own get priority.","collocation[15]":"take priority","example[24]":"Winning the war took priority over everything else.","collocation[16]":"give priority to somebody/something","example[25]":"The hospital always gives priority to emergency cases.","definition[2]":"before other people or things","example[26]":"Members receive priority bookings and reduced ticket prices to all concerts.","definition[3]":"the thing that is more important than anything else, and that needs attention first","example[27]":"Cost-cutting measures continue to be thefirst priority at the company.","example[28]":"The measures dominated Finland’s economic priorities.","definition[4]":"to be considered more important or needing more attention than anything else and therefore dealt with first","example[29]":"Workers accepting redundancy will have priority for jobs elsewhere at G.M.","example[30]":"American Express cardholders will be given priority booking at Forte hotels.","example[31]":"Criminal cases take priority over civil suits."}