{"word[0]":"dust","definition[0]":"dry powder consisting of extremely small bits of dirt that is in buildings on furniture, floors etc if they are not kept clean","example[0]":"All the furniture was covered in dust.","example[1]":"a thick layer of dust","example[2]":"There’s not a speck of dust in the kitchen.","example[3]":"Dust particles floated in the sunlight.","example[4]":"A sudden breeze sent motes of dust  (=small bits of dust) dancing in the air.","example[5]":"Her old trophies were collecting dust on the shelves.","note[0]":"gather/collect dust","definition[1]":"dry powder consisting of extremely small bits of earth or sand","example[6]":"The wind was blowing dust and leaves up from the ground.","example[7]":"A car sped past in a cloud of dust.","definition[2]":"powder consisting of extremely small bits of a particular substance","note[1]":"coal/brick/chalk etc dust","collocation[0]":"be covered in dust","example[8]":"Everything was filthy and covered in dust.","example[9]":"Piles of old books lay on the floor gathering dust.","collocation[1]":"a layer of dust","example[10]":"I brushed away the thin layer of dust which covered the picture.","collocation[2]":"a speck of dust","example[11]":"By the time I'd finished cleaning, there wasn't a speck of dust anywhere.","collocation[3]":"a particle of dust/a dust particle","example[12]":"The air is full of dust particles.","collocation[4]":"motes of dust/dust motes","example[13]":"Glittering motes of dust hung in the sunlight.","definition[3]":"to clean the dust from a surface by moving something such as a soft cloth across it","example[14]":"Rachel dusted the books and the bookshelves.","example[15]":"I was dusting in the bedroom when the phone rang.","definition[4]":"to remove something such as dust or dirt from your clothes by brushing them with your hands","example[16]":"He got to his feet and dusted his knees.","example[17]":"Corbett dusted himself down and walked off.","note[2]":"dust yourself (down/off)","definition[5]":"to put a fine powder over something","example[18]":"Dust the biscuits with icing sugar.","note[3]":"dust something with something"}