{"word[0]":"finish","signpost[0]":"stop doing something","definition[0]":"to complete the last part of something that you are doing","example[0]":"You can’t go anywhere until you’ve finished your homework.","example[1]":"Have you finished that book yet?","example[2]":"I finished typing the report just minutes before it was due.","note[0]":"finish doing something","example[3]":"‘How’s the decorating going?’ ‘We’ve nearly finished.’","definition[1]":"when an event, activity, or period of time finishes, it ends, especially at a particular time","example[4]":"The football season finishes in May.","example[5]":"What time does school finish?","signpost[1]":"eat/drink","definition[2]":"to eat or drink all the rest of something, so there is none left","example[6]":"I’ll just finish my coffee.","signpost[2]":"end something by doing something","definition[3]":"to complete an event, performance, piece of work etc by doing one final thing","example[7]":"The party finished with a sing-song.","note[1]":"finish with","example[8]":"I would like to finish by thanking you all for your help.","note[2]":"finish (something) by doing something","signpost[3]":"race","definition[4]":"to be in a particular position at the end of a race, competition etc","example[9]":"He finished second in the 100 metres, behind Ben Johnson.","note[3]":"finish first/second/third etc","signpost[4]":"take away somebody’s strength","definition[5]":"to take away all of someone’s strength, energy etc","synonym[0]":"do somebody in","example[10]":"Another run like that would just about finish me.","signpost[5]":"use all of something","definition[6]":"to completely use up the supply of something, especially food","example[11]":"The ice cream’s finished – can you get some more?","signpost[6]":"surface","definition[7]":"to give the surface of something, especially wood, a smooth appearance by painting, polishing, or covering it","example[12]":"The furniture had been attractively finished in a walnut veneer.","heading[0]":"GRAMMAR: Patterns with finish","explanation[0]":"Finish is followed by an -ing form, not an infinitive You say","example[13]":"He finished cleaning the kitchen","bad_example[0]":"He finished to clean the kitchen","explanation[1]":"Finish belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[2]":"In this sentence, ‘his speech’ is the object of finish","example[14]":"He finished his speech with a joke","explanation[3]":"In this sentence, ‘his speech’ is the subject of finish","example[15]":"His speech finished with a joke","example[16]":"Have you finished your homework?","example[17]":"The builders say they should have finished by Friday.","definition[8]":"to finish making or doing something that has taken a long time to finish","example[18]":"The new bridge will be completed in two years’ time.","example[19]":"She has just completed her PhD.","display[0]":"finalize","definition[9]":"to do the last things that are necessary in order to settle a plan or agreement in a satisfactory way","example[20]":"A spokesman said that they were hoping to finalize an agreement in the near future.","display[1]":"conclude","definition[10]":"to officially finish something","example[21]":"The police have now concluded their investigations.","example[22]":"Ralph Ellis, Managing Director, concluded the conference with a review of the trading year.","display[2]":"wrap something up","definition[11]":"to finish something successfully – used especially about agreements or sports competitions","example[23]":"Negotiators are meeting on Friday to wrap up the deal.","example[24]":"Liverpool had several chances to wrap up the game.","display[3]":"round something off","definition[12]":"to do something as a way of ending a day, an evening, an event etc in an enjoyable or suitable way","example[25]":"They rounded off the day with a barbecue at the beach.","example[26]":"A concert in the park is being organized to round off the programme of events.","display[4]":"get it over with/get it over and done with","definition[13]":"to do something that you have to do now, so that it is finished and you can stop worrying about it","example[27]":"Let’s go and do the shopping now and get it over with.","example[28]":"Just tell him how you feel and get it over and done with.","display[5]":"be done/be through","definition[14]":"if you are done, you have finished – used especially when other people are waiting for you","example[29]":"We’re nearly done.","example[30]":"We should be through in half an hour.","display[6]":"be through with something/be done with something","definition[15]":"to have finished using something – used especially when other people are waiting to use it","example[31]":"I’m done with the file.","example[32]":"I’ll let you know when I’m through with it.","display[7]":"tie up the loose ends","definition[16]":"to finish dealing with the final details of something, so that is all finished","example[33]":"‘Is the talk ready?’ ‘I just need to tie up a few loose ends.’","definition[17]":"the end or last part of something","note[4]":"a close finish (=an end of a race where two competitors are very close to each other)","example[34]":"I was watching the race but I didn’t get to see the finish.","example[35]":"The day was a disaster from start to finish (=from the beginning until the end).","example[36]":"I won’t walk out – I like to see things through to the finish.","definition[18]":"the appearance of the surface of an object after it has been painted, polished etc","example[37]":"That table has a beautiful finish.","definition[19]":"if shares etc finish at a certain level or price on a financial market, they are at that level or price when trading ends for the day","example[38]":"Shares finished marginally weaker, with the All Ordinaries index down 3.1 points at 1,772.5.","example[39]":"The FTSE 100 index finished 16.4 points lower at 2,342.1."}