{"word[0]":"motive","definition[0]":"the reason that makes someone do something, especially when this reason is kept hidden","example[0]":"What do you suppose the killer’s motive was?","example[1]":"The violence was clearly prompted by political motives.","example[2]":"It’s not the kind of thing he’d do unless he had an ulterior motive (=a reason he kept hidden).","example[3]":"The police believe the motive for this murder was jealousy.","note[0]":"motive for (doing) something","example[4]":"The motives behind the decision remain obscure.","note[1]":"motive behind","definition[1]":"a motif","collocation[0]":"a strong motive","example[5]":"Barbara had a strong motive for disliking Ben.","collocation[1]":"the main motive","example[6]":"The main motive for the killings seemed to be revenge.","collocation[2]":"the prime/primary motive","example[7]":"Concern was her prime motive in visiting Mrs Green.","collocation[3]":"a possible motive","example[8]":"The police are still thinking about possible motives for the murders.","collocation[4]":"a clear motive","example[9]":"She had no clear motive to lie.","collocation[5]":"a hidden motive","example[10]":"She wondered if there was a hidden motive for his departure.","collocation[6]":"an ulterior motive","example[11]":"Did you think I had an ulterior motive for coming here?","collocation[7]":"somebody’s real/true motive","example[12]":"What were his true motives for offering her the job?","collocation[8]":"an underlying motive","example[13]":"The treaty’s underlying motive was to make Japan a strong ally of the US.","collocation[9]":"a political motive","example[14]":"The murders might have a political motive.","collocation[10]":"an economic motive","example[15]":"Many people believed that there were economic motives to the decision to go to war.","collocation[11]":"mixed motives","example[16]":"He had mixed motives for joining the army: a desire to prove himself, but also the desire to get away from his family.","collocation[12]":"have a motive","example[17]":"Who might have had a motive for killing him?","collocation[13]":"question/suspect somebody’s motive","example[18]":"They began to question the motives of the people who held positions of power.","collocation[14]":"find/establish a motive","example[19]":"So far the police have been unable to establish a motive for the murder.","definition[2]":"the motive power or force for a machine, vehicle etc makes it move","example[20]":"Water provided the motive power for the mill."}