{"word[0]":"retreat","definition[0]":"to move away from the enemy after being defeated in battle","opposite[0]":"advance","example[0]":"The rebels retreated to the mountains.","example[1]":"They were attacked and forced to retreat.","signpost[0]":"move back","definition[1]":"to move away from someone or something","example[2]":"He saw her and retreated, too shy to speak to her.","example[3]":"Perry lit the fuse and retreated to a safe distance.","note[0]":"retreat to/from/into etc","example[4]":"It was not a conscious choice to retreat from public life.","definition[2]":"if an area of water, snow, or land retreats, it gradually gets smaller","example[5]":"The flood waters are slowly retreating.","signpost[1]":"change your mind","definition[3]":"to decide not to do something you were planning to do, because it was unpopular or too difficult","example[6]":"The Canadian government has retreated from a plan to kill 300 wolves.","note[1]":"retreat from","signpost[2]":"quiet place","definition[4]":"to go away to a place that is quiet or safe","example[7]":"After the noise of the city he was glad to retreat to his hotel room.","note[2]":"retreat from/into/to","signpost[3]":"finance","definition[5]":"if shares etc retreat, their value falls to a lower level","signpost[4]":"of an army","definition[6]":"a movement away from the enemy after a defeat in battle","example[8]":"Napoleon’s retreat from Moscow","example[9]":"The rebel forces are in full retreat  (=retreating very fast).","example[10]":"The bugler sounded the retreat  (=gave a loud signal for retreat).","signpost[5]":"movement back","definition[7]":"a movement away from someone or something","example[11]":"Ten thousand years ago the ice began its retreat from Scotland.","signpost[6]":"change of intention","definition[8]":"when you change your mind about something because your idea was unpopular or too difficult","example[12]":"a retreat from hard-line policies","definition[9]":"a place you can go to that is quiet or safe","example[13]":"a country retreat","signpost[7]":"thought and prayer","definition[10]":"a period of time that you spend praying or studying religion in a quiet place","example[14]":"I spent three weeks on retreat in Scotland.","note[3]":"on (a) retreat","definition[11]":"a situation in which the value of shares etc falls to a lower level","example[15]":"In Frankfurt, share prices retreated as the market consolidated recent gains.","example[16]":"The Dow Jones Industrial Average retreated 10.07 points to 11,199.46.","definition[12]":"to decide not to continue with a plan, idea, agreement etc because it is too difficult or no longer worth doing","example[17]":"Japanese buyers have retreated after paying huge prices for U.S. properties in the past.","example[18]":"Last week it became the latest corporate raider to retreat from a takeover contest.","example[19]":"The stock market retreat came just as crop prices were starting to recover.","definition[13]":"if a company, industry, market etc is in retreat, its performance is less good than before","example[20]":"With the Tokyostockmarket in retreat, the central bank is likely to be even more cautious about agreeing corporate loans.","definition[14]":"when someone decides not to carry out a plan, idea, agreement etc because it is too difficult or no longer worth doing","example[21]":"The decision to return the company to profitabilitymarks a retreat from its fast-growth strategy."}