{"word[0]":"away","definition[0]":"used to say that someone leaves a place or person, or stays some distance from a place or person","example[0]":"Go away!","example[1]":"Dinah was crying as she drove slowly away.","example[2]":"Stay away from the fire.","note[0]":"away from","definition[1]":"towards a different direction","example[3]":"She turned away and stared out of the window.","example[4]":"Charley blushed and looked away, embarrassed.","definition[2]":"if someone is away from school, work, or home, they are not there","synonym[0]":"absent","example[5]":"Simon is away with flu.","example[6]":"Kate is away on holiday.","example[7]":"You must bring a note from your parents if you’ve been away from school.","definition[3]":"used to say how far it is to a place or thing","example[8]":"There’s another hotel not far away.","example[9]":"Geneva is about 20 miles away.","note[1]":"five miles/ten feet etc away","example[10]":"The beach is only five minutes away  (=it only takes five minutes to get there).","note[2]":"five minutes/two hours etc away","example[11]":"She was sitting ten feet away from the microphone.","definition[4]":"if an event is two days, three weeks etc away, it will happen after that period of time has passed","example[12]":"Christmas is only a month away.","definition[5]":"used to say how close someone is to achieving something or experiencing something","example[13]":"At one stage, they were just two points away from victory.","definition[6]":"into or in a safe or enclosed place","example[14]":"Put your money away, I’m paying.","example[15]":"Thousands of archaeological treasures are being kept hidden away.","definition[7]":"used to show that something disappears or is removed","example[16]":"The music died away.","example[17]":"Ruben gave all his money away to charity.","example[18]":"Support for the Democrats has dropped away.","example[19]":"Cut away all the dead wood.","definition[8]":"used to emphasize that an action continues","example[20]":"Sue was singing away to herself in the bath.","example[21]":"They’ve been hammering away all day.","definition[9]":"used to say that someone spends the whole of a period of time doing something","example[22]":"You can dance the night away in one of Benidorm’s many discos.","definition[10]":"if a team is playing away, it is playing a game at its opponent’s field or sports hall","opposite[0]":"at home","example[23]":"Liverpool are playing away at Everton on Saturday.","definition[11]":"an away game or match is played at your opponent’s field or sports hall","opposite[1]":"home"}