{"word[0]":"because","definition[0]":"used when you are giving the reason for something","example[0]":"We didn’t enjoy the day because the weather was so awful.","example[1]":"‘Why can’t I go?’ ‘Because you’re not old enough.’","example[2]":"Hubert never experienced any fear, and this was partly because he was not particularly intelligent.","example[3]":"Many exam candidates lose marks simply because they do not read the questions properly.","example[4]":"I decided to go with them, mainly because I had nothing better to do.","display[0]":"because ","explanation[0]":"You use because  at the beginning of a clause, when giving the reason for something","example[5]":"I was late because the traffic was bad","explanation[1]":"In formal written English, don’t use because  at the beginning of a sentence","display[1]":"because of","explanation[2]":"You use because of before a noun, when giving the reason for something","example[6]":"I was late because of the traffic","bad_example[0]":"because the traffic","definition[1]":"used when giving the reason for something","example[7]":"I went home because I was tired.","example[8]":"The streets were flooded because of all the rain.","display[2]":"due to/owing to","definition[2]":"used to give the reason why something has happened. Due to and owing to are more formal than because","example[9]":"The delay was due to a problem with the ship’s engines.","example[10]":"The parade had to be cancelled owing to bad weather.","display[3]":"through","definition[3]":"because of something. Through  is used especially when saying why someone succeeded or failed to do something","example[11]":"They won the game, more through luck than skill.","example[12]":"You failed that test through carelessness.","display[4]":"thanks to","definition[4]":"used when explaining that something good has happened because of someone’s efforts, or because something exists","example[13]":"Thanks to modern medicine, the disease can now be cured.","display[5]":"since/as","definition[5]":"used when giving the reason why someone decides to do something or decides that something is true","example[14]":"We decided to go to the beach since it was a nice day.","example[15]":"I thought Kevin was out as his car wasn’t there.","definition[6]":"because of a particular feeling or quality","example[16]":"He started reading the book out of curiosity.","example[17]":"I only asked out of politeness."}