{"word[0]":"distinction","signpost[0]":"difference","definition[0]":"a clear difference or separation between two similar things","example[0]":"There is often no clear distinction between an allergy and food intolerance.","note[0]":"clear/sharp distinction","example[1]":"The Act makes no distinction between children and adults  (=it treats them as if they were the same).","note[1]":"make/draw a distinction","example[2]":"the distinction between formal and informal language","note[2]":"distinction between","explanation[0]":"In written English, people often use draw a distinction rather than make a distinction, because it sounds more formal:","example[3]":"The law draws a distinction between temporary and permanent employees.","signpost[1]":"excellence","definition[1]":"the quality of being excellent and important","example[4]":"Eliot’s distinction as a poet","signpost[2]":"being special","definition[2]":"the quality of being special in some way","example[5]":"At that time, it had the distinction of being the largest bridge in the UK.","note[3]":"have/earn/achieve etc the distinction of doing something","example[6]":"The US enjoys the dubious distinction of being the lawsuit capital of the world.","definition[3]":"a special mark given to a student whose work is excellent","example[7]":"He obtained a law doctorate with distinction.","note[4]":"with distinction","collocation[0]":"make a distinction","example[8]":"It isn’t easy to make a distinction between these two words.","collocation[1]":"blur the distinction between something and something","example[9]":"Both sides in the war had been blurring the distinction between military and civilian targets.","collocation[2]":"see a distinction","example[10]":"He saw no distinction between religious beliefs and superstition.","collocation[3]":"a clear distinction","example[11]":"The legal system makes a clear distinction between adults and children.","collocation[4]":"a fine/subtle distinction","example[12]":"Language enables us to make fine distinctions between similar ideas.","collocation[5]":"a sharp distinction","example[13]":"The president drew a sharp distinction between his party and the Republican Party.","collocation[6]":"an important/crucial distinction","example[14]":"There is an important distinction between these two types of cancer.","collocation[7]":"a fundamental distinction","example[15]":"There is a fundamental distinction between authors and readers.","collocation[8]":"a useful distinction","example[16]":"He makes a useful distinction between the two theories."}