{"word[0]":"drift","signpost[0]":"move slowly","definition[0]":"to move slowly on water or in the air","example[0]":"The rubber raft drifted out to sea.","note[0]":"drift out/towards etc","example[1]":"Smoke drifted up from the jungle ahead of us.","signpost[1]":"without plan","definition[1]":"to move, change, or do something without any plan or purpose","example[2]":"Idly she let her eyes drift over his desk.","note[1]":"let your gaze/eyes/thoughts/mind etc drift","example[3]":"Jenni spent the year drifting around Europe.","note[2]":"drift around/along etc","example[4]":"I just drifted into teaching, really.","note[3]":"drift into","example[5]":"The others drifted away. Melanie stayed.","note[4]":"drift away","example[6]":"The conversation drifted from one topic to another.","note[5]":"drift from something to something","definition[2]":"to gradually change from being in one condition, situation etc into another without realizing it","example[7]":"He drifted in and out of consciousness.","example[8]":"She was just drifting into sleep when the alarm went off.","signpost[2]":"money/prices","definition[3]":"if values, prices, shares etc drift, they gradually change","example[9]":"The dollar drifted lower against the yen today.","signpost[3]":"snow/sand","definition[4]":"if snow, sand etc drifts, the wind blows it into large piles","definition[5]":"a large pile of snow or sand that has been blown by the wind","example[10]":"a snow drift","example[11]":"The road is blocked with massive drifts of snow.","note[6]":"drift of","definition[6]":"a slow change or development from one situation, opinion etc to another","example[12]":"a drift towards longer working hours","note[7]":"drift towards/to","signpost[4]":"movement of people","definition[7]":"a slow movement of large numbers of people that has not been planned","example[13]":"the drift from the countryside to the cities","note[8]":"drift from/to/into","signpost[5]":"ships/planes","definition[8]":"the movement of a ship or plane from its original direction because of the movement of the wind or water","signpost[6]":"slow movement","definition[9]":"very slow movement, especially over water or through the air","definition[10]":"to go slowly up or down in value, without any particular direction","example[14]":"London shares drifted in the absence of a statement from the Treasury.","example[15]":"The dollar drifted lower against other major currencies in thin trading.","example[16]":"The pound drifted down again yesterday.","example[17]":"The Nasdaq Composite Index drifted higher throughout the session to close with a gain of 1.27%.","definition[11]":"a slow change or development from one situtation, opinion etc to another","example[18]":"The drift towards recession started when the slump in the service sector became as bad as the slump in manufacturing.","note[9]":"drift to/towards"}