{"past_tense[0]":"broke","signpost[0]":"separate into pieces","definition[0]":"if you break something, you make it separate into two or more pieces, for example by hitting it, dropping it, or bending it","example[0]":"I had to break a window to get into the house.","example[1]":"Don’t lean on the fence like that – you’ll break it!","example[2]":"Break the chocolate into small pieces and melt it over a gentle heat.","example[3]":"He broke the biscuit in half and handed one piece to me.","note[0]":"break something in half/two","definition[1]":"if something breaks, it separates into two or more pieces","example[4]":"He kept pulling at the rope until it broke.","example[5]":"The frames are made of plastic and they tend to break quite easily.","signpost[1]":"bones","definition[2]":"to damage a bone in your body by making it crack or split","example[6]":"She fell downstairs and broke her hip.","signpost[2]":"machines","definition[3]":"to damage a machine so that it does not work properly","example[7]":"Don’t mess about with my camera – you’ll break it.","example[8]":"Someone’s broken the TV.","definition[4]":"if a machine breaks, it stops working properly","example[9]":"The washing machine’s broken again.","signpost[3]":"rules/laws","definition[5]":"to disobey a rule or law","example[10]":"They’re breaking the law by employing such young children.","example[11]":"If you break the rules, you will be punished.","example[12]":"The cameras catch motorists who break the speed limit.","signpost[4]":"promise/agreement","definition[6]":"to not do something that you have promised to do or signed an agreement to do","example[13]":"I never break my promises.","example[14]":"You betrayed me. You broke your word.","example[15]":"He was worried that he might be breaking his contract.","note[1]":"break an agreement/contract","signpost[5]":"stop/rest","definition[7]":"to stop for a short time in order to have a rest or eat something","example[16]":"Shall we break for lunch now?","note[2]":"break for","signpost[6]":"end something","definition[8]":"to stop something from continuing","example[17]":"We need to break the cycle of poverty and crime in the inner cities.","example[18]":"We took turns driving, in order to try and break the monotony.","example[19]":"New talks will begin on Monday in an effort to break the deadlock.","signpost[7]":"defeat somebody","definition[9]":"to make someone feel that they have been completely defeated and they cannot continue working or living","example[20]":"Losing his business nearly broke him.","example[21]":"I won’t give in. I won’t be broken by him.","signpost[8]":"destroy an organization","definition[10]":"to damage an organization so badly that it no longer has any power","example[22]":"The government succeeded in breaking the unions.","signpost[9]":"day/dawn","definition[11]":"when the day or the dawn breaks, the sky gets light","example[23]":"Dawn was breaking by the time we arrived home.","signpost[10]":"storm","definition[12]":"if a storm breaks, it begins","example[24]":"We were keen to get back to the hotel before the storm broke.","definition[13]":"if the weather breaks, it suddenly changes and becomes cold or wet","example[25]":"The following day the weather broke and we had ten days of solid rain.","signpost[11]":"waves","definition[14]":"when waves break, they fall onto the land at the edge of the water","example[26]":"We sat and watched the waves breaking on the shore.","signpost[12]":"somebody’s voice","definition[15]":"when a boy’s voice breaks, it becomes lower and starts to sound like a man’s voice","example[27]":"He was fifteen, and his voice was just beginning to break.","definition[16]":"if your voice breaks, it does not sound smooth because you are feeling strong emotions","example[28]":"Her voice broke as she told us what had happened.","definition[17]":"if news about an important event breaks, it becomes known","example[29]":"News of his resignation broke yesterday.","example[30]":"The minister has refused to give any interviews since the scandal broke.","definition[18]":"if you break unpleasant news to someone, you tell it to them","example[31]":"I didn’t know how I was going to break the news to my mother.","example[32]":"The doctor finally broke it to me that there was no cure.","heading[0]":"– Meaning 5: to not do something that you have promised to do or signed an agreement to do","form[0]":"break + NOUN","collocation[0]":"break your promise","example[33]":"I’ll never forgive him for breaking his promise to me.","collocation[1]":"break your word","example[34]":"I’ve promised to do it and I never break my word.","collocation[2]":"break your vow","example[35]":"He accused her of breaking her marriage vows.","collocation[3]":"break (off) your engagement","example[36]":"In the end she decided to break their engagement.","collocation[4]":"break a contract","example[37]":"He took the company to court for breaking the contract.","collocation[5]":"break an agreement","example[38]":"This action broke the international agreement of 1925.","explanation[0]":"Break belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[1]":"In this sentence, ‘a glass’ is the object of break","example[39]":"I broke a glass","explanation[2]":"In this sentence, ‘a glass’ is the subject of break","example[40]":"A glass broke","heading[1]":"to break something","definition[19]":"to damage something and make it separate into pieces, for example by dropping it or hitting it","example[41]":"Careful you don’t break the chair.","example[42]":"He broke his leg.","display[0]":"smash","definition[20]":"to break something with a lot of force","example[43]":"A policeman smashed his camera.","display[1]":"snap","definition[21]":"to break something into two pieces, making a loud noise – used especially about long thin objects","example[44]":"He snapped the sticks in two.","definition[22]":"to separate something into two pieces along a straight line","example[45]":"Using a sharp knife, split the melon in half.","display[2]":"fracture","definition[23]":"to damage a bone, especially so that a line appears on the surface","example[46]":"I fell over and fractured my wrist.","display[3]":"tear","definition[24]":"to damage paper or cloth by pulling it so that it separates into pieces","example[47]":"She tore up the letter and put it in the bin.","example[48]":"I tore my jacket.","heading[2]":"to become broken","definition[25]":"to become damaged and separate into pieces","example[49]":"Plastic breaks quite easily.","definition[26]":"to break after being hit with a lot of force","example[50]":"The bowl smashed as it hit the floor.","display[4]":"shatter","definition[27]":"to break into a lot of small pieces","example[51]":"The glass shattered all over the pavement.","display[5]":"crack","definition[28]":"if something cracks, a line appears on the surface, which means that it could later break into separate pieces","example[52]":"The ice was starting to crack.","display[6]":"burst","definition[29]":"if a tyre, balloon, pipe etc bursts, it gets a hole and air or liquid suddenly comes out of it","example[53]":"She blew up the balloon until it burst.","definition[30]":"to break in a straight line","example[54]":"The damp had caused the wood to split.","display[7]":"crumble","definition[31]":"to break into a powder or a lot of small pieces","example[55]":"The cork just crumbled in my hand.","signpost[13]":"stop working","definition[32]":"a period of time when you stop working in order to rest, eat etc","example[56]":"We’ll have a short break for lunch, then start again at two o'clock.","example[57]":"Let’s take a ten-minute break.","example[58]":"We’d worked for ten hours without a break.","example[59]":"I’ll go shopping during my lunch break.","signpost[14]":"stop doing something","definition[33]":"a period of time when you stop doing something before you start again","example[60]":"She decided to take a career break when she had children.","example[61]":"I wanted a break from university life.","note[3]":"break from","example[62]":"a welcome break in my normal routine","note[4]":"break in","signpost[15]":"holiday","definition[34]":"a short holiday","example[63]":"I was beginning to feel that I needed a break.","example[64]":"We flew off for a week’s break in Spain.","example[65]":"They’re offering weekend breaks in Paris for only £100.","example[66]":"Are you looking forward to the summer break?","note[5]":"the Easter/Christmas etc break","signpost[16]":"at school","definition[35]":"the time during the school day when classes stop and teachers and students can rest, eat, play etc","example[67]":"They get together with their friends at break time.","example[68]":"I’ll speak to you at break.","note[6]":"at break","signpost[17]":"on tv","definition[36]":"a pause for advertisements during a television or radio programme","example[69]":"Join us again after the break.","example[70]":"We’ll be back with more after a short break.","signpost[18]":"something stops happening","definition[37]":"a period of time when something stops happening before it starts again","example[71]":"There was no sign of a break in the weather (=an improvement in bad weather).","example[72]":"We’ll go for a walk if there’s a break in the rain.","example[73]":"Latecomers will be admitted at a suitable break in the performance.","example[74]":"She waited for a break in the conversation.","signpost[19]":"end a relationship","definition[38]":"a time when you leave a person or group, or end a relationship with someone","example[75]":"I wanted a clean break so that I could restart my life.","example[76]":"It was years before I plucked up enough courage to make the break and leave him.","example[77]":"He was beginning to regret his break with the Labour Party.","note[7]":"break with","signpost[20]":"space/hole","definition[39]":"a space or hole in something","example[78]":"We crawled through a break in the hedge.","example[79]":"The sun shone through a break in the clouds.","signpost[21]":"chance","definition[40]":"a sudden or unexpected chance to do something that allows you to become successful in your job","example[80]":"There are hundreds of young musicians out there looking for their first break.","example[81]":"He got his first big break in 1998.","example[82]":"a lucky break","definition[41]":"the place where a bone in your body has broken","example[83]":"It’s quite a bad break, which will take several months to heal.","signpost[22]":"tennis","definition[42]":"a situation in a game of tennis in which you win a game when your opponent is starting the game by hitting the ball first","example[84]":"She really needs a break of serve now if she wants to win this match.","signpost[23]":"snooker","definition[43]":"the number of points that a player wins when it is their turn to hit the ball in a game such as snooker","collocation[6]":"have/take a break","example[85]":"After two hours, she took a break and switched on the radio.","collocation[7]":"need a break","example[86]":"I’m sorry, I can’t do any more - I need a break.","form[1]":"ADJECTIVES/NOUN + break","collocation[8]":"a short/quick break","example[87]":"Shall we have a quick five-minute break?","collocation[9]":"a lunch break","example[88]":"What time’s your lunch break?","collocation[10]":"a coffee/tea break","example[89]":"How about a coffee break?","collocation[11]":"a morning/afternoon break","example[90]":"I don’t usually have time for a morning break.","collocation[12]":"a well-earned break","example[91]":"Everyone’s looking forward to a well-earned break when the exams are over.","definition[44]":"if someone breaks a law, rule, agreement etc, they do not do what it says they should do","example[92]":"If you copy music files from the Internet, you could easily be breaking the law.","example[93]":"The other company broke the terms of its agreement.","definition[45]":"if employers break a STRIKE, they force the strikers to end it, perhaps with the help of the army or the police","example[94]":"He broke the ambulancemen’s strike by getting the army to answer emergency calls.","definition[46]":"to neither make a profit nor lose money","example[95]":"The company needs to charge $13 a ton to break even.","example[96]":"The retailer warns that it expects sales to be down by 15%, and it may only break even.","definition[47]":"a period of time when you stop working or stop what you are doing in order to rest, eat, take a holiday etc","example[97]":"He was entitled to a forty-five minute lunch break.","example[98]":"Employers must provide people who work at computers with rest breaks.","example[99]":"We’ll be back with more music after the break.","definition[48]":"a sudden, large fall in market prices, especially the price of shares on a stockmarket","example[100]":"The big break in cattle prices has forced ranchers to stop selling young cattle.","definition[49]":"a sudden or unexpected chance to do something, especially to be successful in your job","example[101]":"She got her first break in 1951 on Broadway.","example[102]":"He did small commercials for Yellow Pages before getting his big break with the Porsche advert.","definition[50]":"a period of several weeks or years during which something stops, before continuing again","example[103]":"If you have a break in paid employment for two complete consecutive tax years, you must pay full-rate contributions when you return to work."}