{"word[0]":"treat","signpost[0]":"behave towards somebody/something","definition[0]":"to behave towards someone or something in a particular way","example[0]":"The prisoners were well treated by their guards.","note[0]":"badly treated/well treated","example[1]":"Despite her seniority, Margot was never treated with much respect.","note[1]":"treat somebody with respect/contempt/courtesy etc","example[2]":"I don’t know why he stays with her – she treats him like dirt.","note[2]":"treat somebody like dirt/a dog","example[3]":"She treats me like one of the family.","note[3]":"treat somebody like/as something","example[4]":"Penny doesn’t think her co-workers treat her as an equal.","example[5]":"He treated his automobiles almost as tenderly as he did his wife.","signpost[1]":"deal with something","definition[1]":"to deal with, regard, or consider something in a particular way","example[6]":"Any complaint about safety standards must be treated very seriously.","note[4]":"treat something favourably/seriously/carefully etc","example[7]":"Please treat this information as completely confidential.","note[5]":"treat something as something","example[8]":"She treats everything I say as a joke.","signpost[2]":"illness/injury","definition[2]":"to try to cure an illness or injury by using drugs, hospital care, operations etc","example[9]":"It was difficult to treat patients because of a shortage of medicine.","example[10]":"Nowadays, malaria can be treated with drugs.","note[6]":"treat somebody/something with something","signpost[3]":"buy something for somebody","definition[3]":"to buy or do something special for someone that you know they will enjoy","example[11]":"I treated myself to a new dress.","example[12]":"We treated Mom to lunch at the Savoy.","note[7]":"treat somebody to something","signpost[4]":"protect/clean","definition[4]":"to put a special substance on something or use a chemical process in order to protect, clean, or preserve it","example[13]":"sewage treated so that it can be used as fertilizer","collocation[0]":"well","example[14]":"The majority of workers are well treated.","collocation[1]":"badly","example[15]":"Why did he treat me so badly?","collocation[2]":"fairly/unfairly","example[16]":"I just want to be treated fairly.","collocation[3]":"equally","example[17]":"All people should be treated equally, whatever their age.","collocation[4]":"differently","example[18]":"Should girls be treated differently from boys in school?","collocation[5]":"harshly","example[19]":"The guards treated the prisoners harshly.","collocation[6]":"kindly","example[20]":"The world had not treated him kindly.","collocation[7]":"treat somebody with respect/contempt/suspicion etc","example[21]":"When you treat the kids with respect, they act responsibly.","collocation[8]":"treat somebody like dirt","example[22]":"He treated this wife like dirt.","definition[5]":"something special that you give someone or do for them because you know they will enjoy it","example[23]":"Steven took his son to a cricket match as a birthday treat.","note[8]":"as a treat","definition[6]":"an event that gives you a lot of pleasure and is usually unexpected","example[24]":"When we were kids, a trip to the beach was a real treat.","definition[7]":"a special food that tastes good, especially one that you do not eat very often","example[25]":"The cafe serves an assortment of gourmet treats.","definition[8]":"to deal with someone or something in a particular way","example[26]":"We treat all complaints very seriously.","example[27]":"Proceeds from the asset transfers won’t be treated as income.","note[9]":"treat somebody/something as","example[28]":"Some information ought to betreated as confidential.","definition[9]":"to put a special substance on something to clean or protect it, or to make it safe","example[29]":"The convention insists that countries should treat their own hazardous wastes."}