{"word[0]":"hurry","definition[0]":"to do something or go somewhere more quickly than usual, especially because there is not much time","synonym[0]":"rush","example[0]":"If we hurry, we’ll get there in time.","example[1]":"I hate having to hurry a meal.","example[2]":"We’ll have to hurry, otherwise we’ll miss the start.","example[3]":"There’s no need to hurry. We’ve got plenty of time.","example[4]":"They were hurrying to catch their train.","note[0]":"hurry to do something","example[5]":"She hurried down the corridor as fast as she could.","note[1]":"hurry through/along/down etc","example[6]":"John hurried after his girlfriend.","note[2]":"hurry after","definition[1]":"to make someone do something more quickly","example[7]":"Don’t hurry me. I’m doing this as fast as I can.","example[8]":"She doesn’t want to be hurried into making a decision.","note[3]":"hurry somebody into (doing) something","definition[2]":"to take someone or something quickly to a place","example[9]":"Emergency supplies have been hurried to the areas worst hit by the famine.","note[4]":"hurry something to/through/across etc something","definition[3]":"to go somewhere or do something more quickly than usual, for example because you are late or you must finish something soon","example[10]":"If you don’t hurry, you’ll miss the bus.","example[11]":"We have plenty of time. There’s no need to hurry.","definition[4]":"to go somewhere very quickly, or to do something too quickly and without thinking carefully enough","example[12]":"Everyone rushed out into the street to see what was happening.","example[13]":"Try to answer the questions calmly, without rushing.","example[14]":"A police car rushed past.","display[0]":"dash","definition[5]":"to go somewhere very quickly, especially because there is something important or urgent you must do","example[15]":"I’ve got to dash to the shops to get some more milk.","example[16]":"She had to dash off and get the kids from school.","display[1]":"in a hurry/in a rush","definition[6]":"doing something quickly because you do not have much time, usually with the result that you make mistakes","example[17]":"She had left in a hurry, and forgotten her passport.","example[18]":"I had to choose a present for her in a rush.","display[2]":"get a move on/get moving","definition[7]":"to start to do something or go somewhere more quickly than before","example[19]":"Get a move on – it’s already 8 o'clock!","example[20]":"I think we’d better get moving, it’s only five minutes to boarding time.","display[3]":"get cracking","definition[8]":"to start working quickly","example[21]":"It’s time you got cracking with your homework.","example[22]":"When Alfie arrives we’ll get cracking moving the furniture."}