{"word[0]":"steal","past_tense[0]":"stole","past_participle[0]":"stolen","signpost[0]":"take something","definition[0]":"to take something that belongs to someone else","example[0]":"Boys broke into a shop and stole £45 in cash.","example[1]":"He stole money from his parents.","note[0]":"steal from","example[2]":"He’d stolen the flowers from our garden.","note[1]":"steal something from somebody/something","signpost[1]":"use ideas","definition[1]":"to use someone else’s ideas without getting permission or without admitting that they are not your own ideas","synonym[0]":"pinch","example[3]":"Inventors know that someone is always going to try to steal their designs.","example[4]":"A well-known scientist was accused of stealing ideas from his former student.","note[2]":"steal something from somebody","signpost[2]":"move somewhere","definition[2]":"to move quietly without anyone noticing you","synonym[1]":"creep","example[5]":"He dressed quietly and stole out of the house.","note[3]":"steal into/across etc","definition[3]":"to run to the next base before someone hits the ball in the sport of baseball","definition[4]":"to suddenly take control of the ball, puck etc when the other team had previously had control of it, for example in basketball or ice hockey","example[6]":"Roy steals the ball four times in the first half.","definition[5]":"to illegally take something that belongs to someone else","example[7]":"The thieves stole over £10,000 worth of computer equipment.","example[8]":"Thousands of cars get stolen every year.","definition[6]":"to steal something – used when it is clear from the situation that you mean that someone takes something dishonestly","example[9]":"The boys broke into her house and took all her money.","example[10]":"They didn’t take much – just a few items of jewellery.","display[0]":"burgle","definition[7]":"to go into someone’s home and steal things, especially when the owners are not there","example[11]":"Their house was burgled while they were away.","example[12]":"If you leave windows open, you are asking to be burgled.","display[1]":"rob","definition[8]":"to steal money or other things from a bank, shop, or person","example[13]":"The gang were convicted of robbing a bank in Essex.","example[14]":"An elderly woman was robbed at gunpoint in her own home.","example[15]":"He’s serving a sentence for robbing a grocery store.","display[2]":"mug","definition[9]":"to attack someone in the street and steal something from them","example[16]":"People in this area are frightened of being mugged when they go out.","example[17]":"Someone tried to mug me outside the station.","display[3]":"nick/pinch","example[18]":"Someone’s nicked my wallet!","example[19]":"When I came back, my car had been pinched.","display[4]":"embezzle","definition[10]":"to steal money from the organization you work for, especially money that you are responsible for","example[20]":"Government officials embezzled more than $2.5 million from the department.","display[5]":"shoplifting","definition[11]":"stealing things from a shop by taking them when you think no one is looking","example[21]":"Shoplifting costs stores millions of pounds every year.","display[6]":"phishing","definition[12]":"the activity of dishonestly persuading people to give you their credit card details over the Internet, so that you can steal money from their bank account","example[22]":"Phishing is becoming very popular with computer criminals.","definition[13]":"the act of suddenly taking control of the ball when the other team had previously had control of it, especially in basketball","example[23]":"Johnson had ten points and a steal in the first half.","definition[14]":"the act of running to the next base before someone hits the ball in the sport of baseball","definition[15]":"to take something that belongs to someone, without their permission","example[24]":"They had admitted stealing from clients.","definition[16]":"to do something new or good before other people do it, for example by producing a new product","example[25]":"The American computer company really stole a march on the competition with its latest PCs.","definition[17]":"to be very cheap","example[26]":"At 20 bucks the camera was a steal."}