{"word[0]":"consult","definition[0]":"to ask for information or advice from someone because it is their job to know something","example[0]":"If symptoms persist, consult a doctor without delay.","example[1]":"An increasing number of people are consulting their accountants about the tax laws.","note[0]":"consult somebody about something","example[2]":"I need to consult with my lawyer.","note[1]":"consult with","explanation[0]":"In everyday English, people usually say ask someone, or see someone, rather than consult someone:","example[3]":"You need to ask your lawyer.","example[4]":"I think you should go and see your doctor.","definition[1]":"to discuss something with someone so that you can make a decision together","example[5]":"I can’t believe you sold the car without consulting me!","example[6]":"The president consulted with European leaders before taking action.","definition[2]":"to look for information in a book, map, list etc","example[7]":"Have you consulted a dictionary?","definition[3]":"to get advice from someone who is trained in a particular profession, for example a lawyer or a doctor","example[8]":"You should consult your lawyer before exchanging contracts.","definition[4]":"to go to someone and ask them for for their advice, especially a professional person such as a lawyer or doctor. See is the usual word to use in everyday English","example[9]":"I think he needs to see a doctor.","example[10]":"Why don’t you go and see an accountant?","display[0]":"ask somebody’s advice","definition[5]":"to ask someone to tell you what they think you should do in a particular situation","example[11]":"I asked my teacher’s advice when it was time to apply for colleges.","display[1]":"check with somebody","definition[6]":"to ask someone whether something is correct or a good idea","example[12]":"Check with your doctor before starting on a new exercise program.","display[2]":"turn to somebody","definition[7]":"to go to someone to ask for help, advice, or sympathy","example[13]":"Many people who were struggling to repay mortgages turned to the Citizens’ Advice Bureau for help.","display[3]":"pick somebody’s brains","definition[8]":"to ask someone who knows a lot about something for their ideas about it","example[14]":"The conference was a great place to meet other managers and pick their brains about issues I was also facing."}