{"word[0]":"work out","definition[0]":"to think carefully about how you are going to do something and plan a good way of doing it","example[0]":"UN negotiators have worked out a set of compromise proposals.","example[1]":"I had it all worked out (=had made very careful plans).","example[2]":"We need to work out how we’re going to get there.","note[0]":"work out what/where/how etc","signpost[0]":"calculate","definition[1]":"to calculate an answer, amount, price etc","example[3]":"See if you can work this bill out.","example[4]":"We’ll have to work out how much food we’ll need for the party.","note[1]":"work out how much/how many etc","definition[2]":"to think about something and manage to understand it","example[5]":"The plot is very complicated – it’ll take you a while to work it out.","example[6]":"I’m sure you can work it out for yourself.","note[2]":"work something out for yourself","definition[3]":"if a cost or amount works out at a particular figure, it is found to be that much when you calculate it","example[7]":"The bill works out at £15 each.","note[3]":"work out at/to £10/$500 etc","example[8]":"If we go by taxi, it’s going to work out very expensive.","note[4]":"work out expensive/cheap etc","signpost[1]":"get better","definition[4]":"if a problem or complicated situation works out, it gradually gets better or gets solved","example[9]":"Things will work out, you’ll see.","example[10]":"I hope it all works out for Gina and Andy.","example[11]":"I’m sure everything will work itself out.","note[5]":"work itself out","definition[5]":"if a situation works out in a particular way, it happens in that way","synonym[0]":"turn out","example[12]":"Financially, things have worked out well for us.","note[6]":"work out well/badly","signpost[2]":"exercise","definition[6]":"to make your body fit and strong by doing exercises","example[13]":"He works out with weights twice a week.","definition[7]":"used to say that you cannot understand what someone is really like or why they behave in the way they do","example[14]":"I couldn’t work her out at all.","definition[8]":"if a mine is worked out, all the coal, gold etc has been removed from it","definition[9]":"to calculate an amount, price, or value","example[15]":"We need to work out how much they owe us.","example[16]":"Can anyone work this bill out?","definition[10]":"if something works out at a particular amount, you calculate that it costs that amount","example[17]":"If we employ contract workers, it’s going to work out very expensive.","example[18]":"The leading industrial nations have agreed to work out some arrangements for debt rescheduling."}