{"past_tense[0]":"gave","past_participle[0]":"given","signpost[0]":"present or money","definition[0]":"to let someone have something as a present, or to provide something for someone","example[0]":"Most people are willing to give to charity.","example[1]":"The situation is now desperate, so please give generously.","example[2]":"What did Bob give you for your birthday?","example[3]":"Researchers were given a £10,000 grant to continue their work.","example[4]":"I’ve got some old diaries that my grandmother gave me years ago.","example[5]":"a ring which was given to him by his mother","note[0]":"give something to somebody","example[6]":"I didn’t steal it! Maria gave it to me!","signpost[1]":"put something in somebody’s hand","definition[1]":"to put something in someone’s hand","example[7]":"Give me the letter, please.","example[8]":"He poured some wine into a glass and gave it to her.","signpost[2]":"let somebody do something","definition[2]":"to allow or make it possible for someone to do something","example[9]":"She was given absolute control over all recruitment decisions.","note[1]":"give somebody control/authority/responsibility etc","example[10]":"He finally gave us permission  to leave.","example[11]":"These meetings give everyone a chance to express their opinions.","example[12]":"Students are given the freedom to choose their own topics.","example[13]":"Language gives us the ability to communicate at a much higher level than any other animal.","example[14]":"Women were given the vote in the early 1900s.","example[15]":"This bill will give more power to local authorities.","signpost[3]":"tell somebody something","definition[3]":"to tell someone information or details about something, or to tell someone what they should do","example[16]":"She gave me some information on university courses.","example[17]":"My secretary will be able to give you more details.","example[18]":"Let me give you some advice.","example[19]":"Can you give me directions to the station (=tell me how to go there)?","example[20]":"He gave the following example.","example[21]":"You may have to give evidence in court  (=tell a court about what you have seen or know to be true).","example[22]":"She certainly likes giving orders.","note[2]":"give orders/instructions","example[23]":"They were given strict instructions not to tell anyone.","example[24]":"He gave a disturbing account of the murder.","note[3]":"give an account/description","signpost[4]":"make a movement/do an action","definition[4]":"to do something by making a movement with your hand, face, body etc","example[25]":"She gave a little frown.","note[4]":"give a smile/laugh/grin/frown/yawn etc","example[26]":"Joel gave me a smile as I walked in.","example[27]":"He gave her a big hug.","example[28]":"He gave a wave of his hand.","note[5]":"give a wave/movement/signal","example[29]":"Don’t move until I give the signal.","example[30]":"She picked up the envelope and gave it a shake.","note[6]":"give something a shake/rattle/tug etc","signpost[5]":"speech/talk/performance","definition[5]":"to make a speech, perform a piece of music etc for a group of people","example[31]":"He’s giving a talk on early Roman pottery.","note[7]":"give a talk/speech/lecture","example[32]":"They gave one of their best performances to date.","note[8]":"give a performance/display","signpost[6]":"make somebody have a feeling","definition[6]":"to make someone have a feeling","example[33]":"Keep the noise down – you’re giving me a headache!","note[9]":"give somebody a headache/hangover","example[34]":"He gave us quite a shock.","example[35]":"The course has given me a lot more confidence.","example[36]":"His job did not give him much sense of fulfilment.","example[37]":"Their music has given pleasure to a lot of people over the years.","signpost[7]":"make somebody have problems","definition[7]":"to make someone have problems","example[38]":"The new software has given us quite a few problems.","note[10]":"give somebody problems/trouble/difficulties","signpost[8]":"make somebody ill","definition[8]":"to infect someone with the same illness that you have","example[39]":"Don’t come too close – I don’t want you to give me your cold!","example[40]":"It’s very unlikely a doctor could give HIV to a patient.","signpost[9]":"organize a social event","definition[9]":"to organize a social event such as a party","example[41]":"We’re giving a small party for dad’s birthday next week.","signpost[10]":"make somebody do something","definition[10]":"to tell someone to do a job or piece of work","example[42]":"How much homework are you given in a week?","note[11]":"give somebody work/homework etc","example[43]":"He’s always giving us chores to do around the house.","signpost[11]":"make somebody/something have a quality","definition[11]":"to make someone or something have a particular quality","synonym[0]":"lend","example[44]":"The ginger gives the dish a wonderful spicy flavour.","note[12]":"give somebody/something sth","example[45]":"His grey hair gave him an air of distinction.","example[46]":"Its association with the movie industry has given the place a certain glamor.","signpost[12]":"pay for","definition[12]":"to pay a particular amount of money for something","example[47]":"They say they’re not willing to give any more than they’ve already offered.","example[48]":"They gave us £700 for our old car.","note[13]":"give somebody something for something","example[49]":"How much will you give me for these two games?","signpost[13]":"behave towards","definition[13]":"to behave towards someone in a way that shows you have a particular attitude or feeling towards them","example[50]":"The people were expected to give their leader absolute obedience and loyalty.","note[14]":"give somebody loyalty/obedience/respect","signpost[14]":"punishment","definition[14]":"to officially say that someone must have a particular punishment","example[51]":"If you don’t pay on time, you could be given a fine of up to $1,000.","note[15]":"give somebody a fine/a sentence","example[52]":"The judge gave her two years in prison.","note[16]":"give somebody six months/three years etc","signpost[15]":"be less strict","definition[15]":"to be willing to change what you think or do according to what else happens","example[53]":"I think that both sides need to give a little.","signpost[16]":"state a decision","definition[16]":"to state what your official decision or judgment is, for example in a game","example[54]":"The referee has given a penalty.","example[55]":"The jury will be giving its verdict within the next couple of days.","signpost[17]":"give a mark/score","definition[17]":"to decide that someone should have a particular score or mark for something that they have done","example[56]":"She only gave me a B for my last essay.","example[57]":"The judges have given him top marks for this performance.","signpost[18]":"bend/stretch","definition[18]":"if a material gives, it bends or stretches when you put pressure on it","example[58]":"New shoes often feel tight, but the leather should give a little after a few days.","signpost[19]":"break/move","definition[19]":"if something gives, it breaks or moves away suddenly because of weight or pressure on it","example[59]":"The branch suddenly gave beneath him.","example[60]":"I pushed against the door with all my might, but it still wouldn’t give.","definition[20]":"if a woman gives herself to a man, she has sex with him","definition[21]":"to let someone have something, without expecting to be paid for it","example[61]":"He was always giving me gifts.","example[62]":"They gave a free drink to all their customers.","display[0]":"donate","definition[22]":"to give money to an organization that helps people or protects something, or to give your blood or part of your body to save someone’s life","example[63]":"The company donates 1 per cent of its profits to charity.","example[64]":"70% of people wanted to donate their organs after death.","display[1]":"award","definition[23]":"to officially give money or a prize to someone","example[65]":"She was awarded a million dollars in damages.","example[66]":"Hollywood awarded him an Oscar for his performance.","display[2]":"present","definition[24]":"to formally or officially give something to someone by putting it in their hands, especially at a formal ceremony","example[67]":"They presented her with a bouquet of flowers.","definition[25]":"to officially arrange for someone to have something that you own after your death","example[68]":"He left most of his property to his wife.","display[3]":"lavish somebody with something/lavish something on somebody","definition[26]":"to give someone a lot of something, especially praise, attention, or gifts","example[69]":"After his team won, the press lavished him with praise.","display[4]":"confer","definition[27]":"to give someone an honour, a university degree, or the right or power to do something","example[70]":"the powers conferred on him by Parliament","example[71]":"the highest honor that her country could confer on her","display[5]":"bestow","definition[28]":"to give someone something to show how much they are respected, for example an honour, a title, or a gift – a very formal use","example[72]":"He was also bestowed the title of ‘Cultural Ambassador of Grenada’.","heading[0]":"to give something to a group of people","display[6]":"hand something out/give something out","definition[29]":"to give something to each of the people in a group","example[73]":"The teacher handed out the test papers.","example[74]":"I’m going to give out some forms for you to fill in.","display[7]":"distribute","definition[30]":"to give things to a large number of people, especially in the streets","example[75]":"Anti-war protesters were distributing leaflets.","display[8]":"share","definition[31]":"to divide something into equal parts and give a part to each person","example[76]":"They shared the profits among the staff.","definition[32]":"the ability of a material or substance to bend or stretch when put under pressure","example[77]":"The rope has quite a bit of give in it."}