{"word[0]":"forget","past_tense[0]":"forgot","past_participle[0]":"forgotten","signpost[0]":"facts/information","definition[0]":"to not remember facts, information, or people or things from the past","example[0]":"I’m sorry, I’ve forgotten your name.","example[1]":"I know you told me, but I forgot.","example[2]":"What happened that day will never be forgotten.","example[3]":"He’s someone who never forgets a face (=forgets who someone is).","example[4]":"Oh yes, I was forgetting she was pregnant.","note[0]":"I was forgetting ...","example[5]":"Karl says he forgot about our date.","note[1]":"forget about","example[6]":"She forgot all about their anniversary.","example[7]":"I forgot that there’s a speed limit here.","note[2]":"forget (that)","example[8]":"How can you forget where you’ve parked the car?","note[3]":"forget how/what/when/why etc","signpost[1]":"something you must do","definition[1]":"to not remember to do something that you should do","example[9]":"‘Did you remember to post that letter?’ ‘Oh, sorry, I forgot.’","example[10]":"Give me your phone number before I forget (=forget to get it).","example[11]":"He meant to invite Monica, but he clean forgot.","note[4]":"clean forget","example[12]":"Someone’s forgotten to turn off their headlights.","note[5]":"forget to do something","signpost[2]":"leave something somewhere","definition[2]":"to not remember to bring something that you need with you","example[13]":"Oh no, I’ve forgotten my wallet.","note[6]":"forget your keys/money/cigarettes etc","signpost[3]":"stop thinking about","definition[3]":"to stop thinking or worrying about someone or something","example[14]":"Forget him, he’s not worth it.","example[15]":"At my age, I think I can forget fashion.","example[16]":"After a while you’ll forget you’re wearing contact lenses.","example[17]":"I’ll never be able to forget about the accident.","signpost[4]":"not care about","definition[4]":"to not care about or give attention to someone or something any longer","example[18]":"Don’t forget about your old friends when you go off to college, okay?","example[19]":"You can’t afford to forget your relationship with your husband.","signpost[5]":"stop a plan","definition[5]":"to stop planning to do something because it is no longer possible or sensible","example[20]":"We’ll have to forget about going on holiday.","example[21]":"If we can’t get any funding we might as well forget the whole thing.","definition[6]":"to not remember something or someone","example[22]":"It was an experience she would never forget.","display[0]":"don’t remember/can’t remember","definition[7]":"used when saying that you have forgotten something","example[23]":"I know I needed something at the shops, but I can’t remember what it was.","display[1]":"have no recollection of something","definition[8]":"to not remember anything about something that happened in the past","example[24]":"He told the jury that he had no recollection of the accident.","display[2]":"slip your mind","definition[9]":"if something that you must do slips your mind, you forget to do it because you are busy thinking about other things","example[25]":"I’m sorry I didn’t call. There was so much going on that it completely slipped my mind.","display[3]":"it goes in one ear and out the other","definition[10]":"used to say that someone forgets what you tell them very quickly because they are not interested or do not listen properly","example[26]":"With kids you have to say everything twice. It all goes in one ear and out the other.","display[4]":"my mind goes blank","definition[11]":"used to say that you are suddenly unable to remember something at a time when you need it","example[27]":"I was so nervous that my mind went blank as soon as they asked me a question.","heading[0]":"to try to forget something","definition[12]":"to deliberately try not to think about something sad or unpleasant","example[28]":"After the divorce came through, I just wanted to forget about it all.","display[5]":"put something out of your mind","definition[13]":"to make yourself stop thinking about something that stops you concentrating or makes you angry, sad, or nervous","example[29]":"When I’m competing I put everything out of my mind and concentrate on winning.","display[6]":"put something behind you","definition[14]":"to stop thinking about something sad or unpleasant that happened to you in the past, so that you can continue with your life and be happy","example[30]":"It can take a long time to put a traumatic experience like that behind you.","display[7]":"take/keep your mind off something","definition[15]":"to do something that helps you stop thinking about a problem for a short time","example[31]":"Sara went out for a walk to try and take her mind off things.","display[8]":"blot something out","definition[16]":"to forget an unpleasant memory or thought, by deliberately stopping yourself from thinking about it","example[32]":"He started drinking heavily in an effort to blot out the thought of what he had done.","example[33]":"I wanted to blot out the events of the previous day.","display[9]":"shut somebody/something out","definition[17]":"to deliberately forget someone or something and not let them be part of your thoughts and feelings","example[34]":"The marriage was a disaster, and her husband shut her out of his life completely."}