{"word[0]":"contrast","definition[0]":"a difference between people, ideas, situations, things etc that are being compared","example[0]":"While there are similarities in the two cultures, there are also great contrasts.","example[1]":"The approach to learning at this school stands in marked contrast to the traditional methods used at other schools nearby.","example[2]":"The winter heat wave in California is a stark contrast to the below-freezing temperatures on the East Coast.","note[0]":"(in) stark/marked/sharp etc contrast to something","example[3]":"The spirited mood on Friday was in sharp contrast to the tense atmosphere last week.","example[4]":"the economic and social contrasts between the poor and the rich","note[1]":"contrast between","example[5]":"The marble is smooth and polished, making a strong contrast with the worn stonework around it.","note[2]":"contrast with","example[6]":"The birth rate for older women has declined, but, by contrast, births to teenage mothers have increased.","note[3]":"by contrast (to/with)","example[7]":"The stock lost 60 cents a share, in contrast to last year, when it gained 21 cents.","note[4]":"in contrast (to/with)","definition[1]":"something that is very different from something else","example[8]":"The sauce is quite sweet, so add dried thyme as a contrast.","example[9]":"The red stems of this bush provide a contrast to the drab brown of the winter garden.","note[5]":"contrast to","definition[2]":"the degree of difference between the light and dark parts of a television picture, X-ray, photocopy etc","example[10]":"This button adjusts the contrast.","definition[3]":"the differences in colour, or between light and dark, that an artist uses in paintings or photographs to make a particular effect","example[11]":"The artist has used contrast marvellously in his paintings.","collocation[0]":"a complete/total contrast","example[12]":"A complete contrast in building style can be seen in Commercial Road.","collocation[1]":"a sharp/stark/strong contrast","example[13]":"There is a sharp contrast between the type of people who read the two newspapers.","collocation[2]":"a marked/striking contrast","example[14]":"I noticed a marked contrast in his behaviour before and after treatment.","collocation[3]":"a startling contrast","example[15]":"The big modern factories make a startling contrast to the opposite side of the road.","collocation[4]":"a dramatic contrast","example[16]":"Alaska is a land of dramatic contrast.","collocation[5]":"an interesting contrast","example[17]":"the interesting contrast between his early and later paintings","collocation[6]":"a clear/obvious contrast","example[18]":"There was a clear contrast between the father and the son.","collocation[7]":"make a contrast","example[19]":"The fruit and the meat make a delicious contrast of flavours.","collocation[8]":"draw a contrast","example[20]":"It is tempting to draw sharp contrasts between religion and science.","collocation[9]":"provide/offer contrast","example[21]":"The plant is very attractive, and provides excellent contrast to other plants.","collocation[10]":"highlight a contrast","example[22]":"The research will highlight the contrasts between different approaches to taxation.","collocation[11]":"stand in sharp/stark etc contrast to something","example[23]":"The mountains stand in stark contrast to the area around them.","collocation[12]":"in direct contrast to something/somebody","example[24]":"She’s fun and warm and amusing – in direct contrast to James.","collocation[13]":"in sharp/stark etc contrast","example[25]":"We are still getting some sun, in marked contrast to last year’s everlasting grey skies.","definition[4]":"if two things contrast, the difference between them is very easy to see and is sometimes surprising","example[26]":"These results contrast sharply with other medical tests carried out in Australia.","note[6]":"contrast sharply/strikingly with something","example[27]":"The snow was icy and white, contrasting with the brilliant blue sky.","definition[5]":"to compare two things, ideas, people etc to show how different they are from each other","example[28]":"an essay comparing and contrasting (=showing how two things are similar and different) Verdi and Wagner and their operas","example[29]":"In another passage, Melville again contrasts the land with the sea.","note[7]":"contrast something with something"}