{"word[0]":"commission","definition[0]":"a group of people who have been given the official job of finding out about something or controlling something","example[0]":"The Government set up a commission to investigate allegations of police violence.","example[1]":"the Royal Commission on Environmental Pollution","note[0]":"commission on","definition[1]":"an extra amount of money that is paid to a person or organization according to the value of the goods they have sold or the services they have provided","example[2]":"The dealer takes a 20% commission on the sales he makes.","example[3]":"He sold cosmetics on commission.","note[1]":"on commission","definition[2]":"a request for an artist, designer, or musician to make a piece of art or music, for which they are paid","example[4]":"a commission from the Academy for a new sculpture","definition[3]":"the position of an officer in the army, navy etc","definition[4]":"the commission of a crime is the act of doing it","collocation[0]":"set up/establish/create a commission","example[5]":"They set up a commission to investigate the problem of youth crime.","collocation[1]":"appoint a commission","example[6]":"The president appointed a commission to develop standards in schools.","collocation[2]":"head a commission","example[7]":"He was elected to head a commission on tax reform.","collocation[3]":"a commission recommends something","example[8]":"The commission recommended that the federal government change the way it measures inflation.","collocation[4]":"a commission approves something","example[9]":"The commission approved the plan.","form[0]":"ADJECTIVES/NOUN + commission","collocation[5]":"a special commission","example[10]":"A special commission was set up to investigate the killings.","collocation[6]":"an independent commission","example[11]":"The plan requires approval by an independent commission.","collocation[7]":"an international commission","example[12]":"an international commission on climate change","collocation[8]":"a parliamentary commission","example[13]":"A report was made by a special parliamentary commission.","collocation[9]":"a government commission","example[14]":"A government commission regulates the process.","collocation[10]":"a national/federal commission","example[15]":"the National Commission on Terrorism","collocation[11]":"a presidential commission","example[16]":"the Presidential Commission on Health Care","collocation[12]":"a joint commission","example[17]":"a new India-Sri Lanka joint commission","collocation[13]":"an investigative/investigating commission","example[18]":"An investigative commission was set up immediately after the incident.","definition[5]":"to formally ask someone to write an official report, produce a work of art for you etc","example[19]":"The report was commissioned by the Welsh Office.","example[20]":"Macmillan commissioned her to illustrate a book by Spike Milligan.","note[2]":"commission somebody to do something","definition[6]":"an informal name for the European Commission","definition[7]":"an amount of money paid to someone according to the value of goods, shares, bonds etc they have sold","example[21]":"He didn’t charge a commission on trades, as other brokers do.","example[22]":"All of the sales staff are on commission.","definition[8]":"a request for a writer, musician, or artist to produce a piece of work for which they are paid","example[23]":"a commission from the company for a new sculpture","definition[9]":"an official organization that ensures that the law is obeyed in a particular activity","example[24]":"the New Jersey Casino Control Commission","example[25]":"the Equal Employment Opportunity Commission","definition[10]":"a temporary official organization looking at problems in a particular area and suggesting changes","example[26]":"A state senate commission was created last year to study tax reform.","definition[11]":"to formally ask someone to produce a report, work of art etc","example[27]":"One of the new team’s first acts was to commission a report on Fox’s operations."}