{"word[0]":"open up","signpost[0]":"opportunity","definition[0]":"if opportunities open up, or a new situation opens them up, they become available or possible","example[0]":"With a microscope, a whole new world of investigation opens up.","example[1]":"The new international agreement opens up the possibility of much greater co-operation against terrorism.","note[0]":"open something ↔ up","definition[1]":"if someone opens up an area of land, they make it easier to reach and ready for development","example[2]":"The new road will open up 300 acres of prime development land.","signpost[1]":"door/container etc","definition[2]":"to open something that is closed, locked, or covered","example[3]":"Open up, this is the police!","example[4]":"He opened up his case and took out a clean sweater.","signpost[2]":"shop/office etc","definition[3]":"if a shop, office etc opens up or is opened up, someone starts it","definition[4]":"if a shop, office etc opens up at a particular time, it starts business at that time","signpost[3]":"disagreement/discussion","definition[5]":"to start a discussion or argument","example[5]":"The article was written with the intention of opening up a public debate.","signpost[4]":"competition/race","definition[6]":"if someone opens up a lead in a competition or race, they increase the distance or number of points by which they are winning","definition[7]":"to stop being shy and say what you really think","example[6]":"Last night was the first time that Ken had opened up about his feelings.","signpost[5]":"with a gun","definition[8]":"to start shooting","signpost[6]":"hole/crack etc","definition[9]":"if a hole, crack etc opens up or is opened up, it appears and becomes wider","definition[10]":"if a new business opens up or is opened up, someone starts it","example[7]":"More than a dozen US law firms have opened up in the city.","definition[11]":"if a shop, business etc opens up or is opened up at a particular time, it starts business at that time","definition[12]":"if a country or market opens up, or someone opens it up, it becomes possible or easier to invest there or sell foreign goods there","example[8]":"Algeria opened up its big oil and natural gas industry to foreign investment.","example[9]":"When China opened up, over-optimistic Americans were full of ideas of selling to one billion Chinese.","definition[13]":"if a job opens up, it becomes available","example[10]":"When the U.S. attorney’s job opened up, he applied."}