{"word[0]":"entry","plural[0]":"entries","signpost[0]":"act of entering","definition[0]":"the act of going into something","opposite[0]":"exit","example[0]":"Harry made his entry into the village.","example[1]":"There was no sign of a forced entry.","example[2]":"How did the thieves gain entry (=get in)?","example[3]":"It was dark and their entry into the camp had gone unnoticed.","note[0]":"entry into","signpost[1]":"becoming involved","definition[1]":"when someone starts to take part in a system, a particular kind of work etc, or the permission they need in order to do this","example[4]":"the minimum height for entry into the police force","example[5]":"This enabled European banks to gain entry into new markets.","example[6]":"the entry requirements for a degree course","example[7]":"Britain’s entry into the European Union","note[1]":"entry into/to","signpost[2]":"right to enter","definition[2]":"the right to enter a place, building etc","note[2]":"no entry (=written on signs to show that you are not allowed to go somewhere)","example[8]":"The refugees were repeatedly refused entry into  (=not allowed in) the country.","example[9]":"an entry visa","example[10]":"Entry to the gardens is included in the price of admission.","note[3]":"entry to/into","definition[3]":"something that you write, make, do etc in order to try and win a competition","example[11]":"The winning entry will be published in our April issue.","example[12]":"What’s the closing date for entries?","definition[4]":"the number of people or things taking part in a competition","example[13]":"We’ve attracted a record entry this year.","signpost[3]":"something written","definition[5]":"a piece of writing in a diary, or in a book containing information such as a dictionary","example[14]":"a dictionary entry","definition[6]":"the act of putting information into a computer","example[15]":"data entry","signpost[4]":"door","definition[7]":"a door, gate, or passage that you go through to enter a place","heading[0]":"– Meaning 1: the act of going into something","collocation[0]":"gain entry","example[16]":"Burglars use various methods to gain entry to houses.","collocation[1]":"force an entry","example[17]":"The church was locked, but he managed to force an entry.","collocation[2]":"make your entry","example[18]":"She waited until everyone was sitting down before she made her entry.","collocation[3]":"illegal entry","example[19]":"The two men were later arrested and charged with illegal entry.","collocation[4]":"unauthorized entry","example[20]":"There was a big sign on the door saying NO UNAUTHORIZED ENTRY.","collocation[5]":"forced entry","example[21]":"There were no signs of a forced entry, but several paintings were missing.","form[0]":"entry + NOUN","collocation[6]":"an entry point","example[22]":"The 2,000 mile border is the main entry point into the country for illegal aliens.","heading[1]":"– Meaning 2: when someone starts to take part in a system, a particular kind of work etc, or the permission they need in order to do this","example[23]":"You need good exam results to gain entry to the best universities.","collocation[7]":"restrict entry","example[24]":"Tariffs on trade have the effect of restricting entry into the market.","form[1]":"NOUN + entry","collocation[8]":"university/college/school entry","example[25]":"Japan has one of the highest rates of college and university entry in the world.","collocation[9]":"entry requirements","example[26]":"Applicants must satisfy the normal entry requirements for the school.","collocation[10]":"entry qualifications","example[27]":"What are the entry qualifications for the course?","heading[2]":"– Meaning 3: the right to enter a place, building etc","example[28]":"Guests have free entry to the hotel spa and gym.","example[29]":"Entry is free for children.","example[30]":"Visitors to the United States must first obtain an entry visa.","collocation[11]":"an entry ticket","example[31]":"The holiday includes a 2-day entry ticket to the Euro Disneyland Theme Park.","collocation[12]":"apply for entry","example[32]":"The number of people applying for entry into the country is increasing every year.","collocation[13]":"allow (somebody) entry","example[33]":"Citizens of most EU countries are allowed automatic entry into Britain.","collocation[14]":"refuse/deny (somebody) entry","example[34]":"He was refused entry to the club because he was wearing trainers.","collocation[15]":"no entry","example[35]":"The door had ‘No Entry’ written in large letters.","definition[8]":"the arrival of people or goods in a country","example[36]":"border patrol officers who control illegal entry into the US","definition[9]":"when a company starts selling goods or services in a market where they have not sold them before","example[37]":"In South Korea, smoking rates among teenage boys nearly doubled after the entry of US brands.","example[38]":"Technological changes have helped reduce the costs of market entry, especially in telecommunications.","definition[10]":"a figure or other piece of information entered in a set of accounts","example[39]":"In a double-entry system of bookkeeping, each debit has a corresponding credit entry.","definition[11]":"when you put information into a computer","example[40]":"Press Esc to return to menu at any time duringdata entry."}