{"signpost[0]":"character","definition[0]":"someone who is honest always tells the truth and does not cheat or steal","opposite[0]":"dishonest","example[0]":"He was a hard-working honest man.","example[1]":"Ann had an honest face.","signpost[1]":"statement/answer etc","definition[1]":"not hiding the truth or the facts about something","synonym[0]":"frank","example[2]":"Do you want my honest opinion?","example[3]":"an honest answer","example[4]":"Let’s be honest: the only reason she married him was for his money.","example[5]":"At least he was honest with you.","note[0]":"honest with","example[6]":"She was always very honest about her feelings.","note[1]":"honest about","definition[2]":"honest work is done using your own efforts and without cheating","example[7]":"I bet he’s never done an honest day’s work in his life!","example[8]":"I’m just trying to earn an honest living.","signpost[2]":"ordinary good people","definition[3]":"honest people are not famous or special, but behave in a good, socially acceptable way","example[9]":"She came from a good honest working-class background.","heading[0]":"not cheating, stealing, lying etc","definition[4]":"always saying what is true, and not cheating, stealing etc","example[10]":"I liked them because they were good honest people.","example[11]":"You can trust Noah – he’s totally honest.","display[0]":"reputable","definition[5]":"known to be honest and good in your business or work – used about people, companies, or organizations","example[12]":"It’s best to buy from a reputable company.","example[13]":"They were highly reputable sports physicians.","display[1]":"above board","definition[6]":"honest and legal – used about the way something is done, organized etc","example[14]":"The deal was entirely above board.","example[15]":"Was the voting in the elections above board?","display[2]":"upright","definition[7]":"always behaving in an honest way","example[16]":"an upright citizen","example[17]":"George was an upright man from a military family.","heading[1]":"not hiding the truth or the facts","definition[8]":"saying what you really think and not hiding the truth or the facts","example[18]":"I’m going to ask you something, and I want you to be honest with me.","example[19]":"To be honest, I didn’t think his speech was very good.","definition[9]":"honest and saying what you really think","example[20]":"I can’t help you if you’re not straight with me.","example[21]":"I need a straight answer.","definition[10]":"willing to talk about what you think, feel etc in an honest way, rather than trying to hide it","example[22]":"People have become more open about their feelings.","example[23]":"She’s very easy to talk to because she’s so open.","definition[11]":"speaking honestly and directly about something, especially something that people find difficult to discuss","example[24]":"In his book, he’s brutally frank about his experience with his illness.","example[25]":"a frank discussion about sex","definition[12]":"saying exactly what you think in an honest clear way, even when this might annoy or upset people","example[26]":"Not everyone liked his direct manner.","example[27]":"She can be very direct.","display[3]":"blunt","definition[13]":"speaking in a completely honest way, even if it upsets people, when it would be better to be more careful or polite","example[28]":"Sorry if I was a bit blunt with you.","example[29]":"His hard tone and blunt words were hurtful.","example[30]":"She didn’t reply and I knew I had been too blunt.","display[4]":"upfront","definition[14]":"talking and behaving in an honest way, even when it is difficult to do this, in a way that people respect","example[31]":"It’s best to be upfront about your financial problems.","example[32]":"You have to be upfront with kids.","display[5]":"outspoken","definition[15]":"expressing your opinions publicly in a very direct way, which may offend or annoy some people","example[33]":"an outspoken critic of the government","example[34]":"He was known for his outspoken views on various controversies.","display[6]":"forthright","definition[16]":"saying exactly what what you think, without being afraid of what other people will think","example[35]":"The opposition have not come up with a clear forthright statement of their policies.","example[36]":"At times, Helena was a little too forthright.","display[7]":"candid","definition[17]":"honest about the facts, or about your opinions and feelings, even if other people disapprove of them","example[37]":"He’d always been completely candid about his past.","example[38]":"It was an unusually candid admission for a politician.","definition[18]":"used to try to make someone believe you","example[39]":"I didn’t mean to hurt him, honest!"}