{"word[0]":"net","signpost[0]":"for fishing/catching things","definition[0]":"something used for catching fish, insects, or animals which is made of threads or wires woven across each other with regular spaces between them","example[0]":"a fishing net","example[1]":"a butterfly net","signpost[1]":"for sports","definition[1]":"the thing that players must hit the ball over in games such as tennis","definition[2]":"the thing behind the posts that players try to kick or hit the ball into in games such as football or hockey","example[2]":"Henry kicked the ball into the back of the net.","signpost[2]":"for keeping things out","definition[3]":"something used for keeping things out, for example insects or birds, which is made of threads woven across each other with regular spaces between them","example[3]":"a mosquito net","signpost[3]":"material","definition[4]":"very thin material made from fine threads woven together, with small spaces between","example[4]":"net curtains","definition[5]":"the net amount is the final amount that remains after all the other amounts have been taken away","example[5]":"The net profit  (=after taxes, costs etc) was up 16.3% last month.","example[6]":"The company reported a net loss of $56 million last year.","example[7]":"Vernon estimates the company’s net worth at over $8 billion.","example[8]":"The United States is a net importer of beef  (=it imports more than it exports).","definition[6]":"to earn a particular amount of money as a profit after tax has been paid","example[9]":"I was netting around $64,000 a year.","definition[7]":"to succeed in getting something, especially by using your skill","example[10]":"The company has recently netted several large contracts.","example[11]":"An undercover sweep netted 22 suspects in one evening.","definition[8]":"to hit or kick the ball into the net in sport","example[12]":"Rooney has netted nine goals for United so far this season.","definition[9]":"to catch a fish in a net","example[13]":"We netted three fish in under an hour.","definition[10]":"a net amount of money is one that remains after things such as costs and tax have been taken away","example[14]":"Net income after higher taxes, provisions and depreciation jumped more than 25%.","example[15]":"The company reported a net loss for the period after a charge related to reorganization costs.","example[16]":"The payment is net of tax.","note[0]":"net of","definition[11]":"in buying, exporting etc, concerning a situation where the amount bought etc by one side is more than the amount bought etc by the other","example[17]":"Because of its oil fields in the North Sea, Britain is a net exporter (=a country that exports more than it imports) of oil, though a small one.","example[18]":"Canadian investors were net purchasers of US equities for the third straight quarter  (=the value of US shares bought by Canadians was more than the value of Canadian shares bought by people in the US).","definition[12]":"the net weight of something is its weight without its container or wrapping","definition[13]":"the system that allows computer users all over the world to communicate with each other; the Internet","example[19]":"Most users do not aimlessly surf the net (=look at information in different places as a form of entertainment). They always or usually go back to the same sites.","definition[14]":"a company’s profit after tax has been taken away","synonym[0]":"NET PROFIT","example[20]":"The supermarket chain said net for the quarter was $40.3 million.","definition[15]":"a system that will prevent people from suffering financial problems if they become ill, unemployed etc","example[21]":"safety net programs, including unemployment compensation and retraining of workers","example[22]":"The social welfare net is essential.","past_tense[0]":"netted","definition[16]":"if something nets a company or a person a particular amount of money, it gives them that amount, perhaps after costs are taken away","example[23]":"Its public stock offering netted the company $72 million.","example[24]":"charges involving a fraud scheme that netted him $12 million","definition[17]":"if a person or a company nets a certain amount in a year, they earn that amount as income or as profit after tax is taken away","example[25]":"The farm netted as much as $1.5 million a year.","example[26]":"After the capital-gains tax was paid, we only netted about $3.25 per hour.","definition[18]":"after things such as costs and tax have been taken away","example[27]":"someone who earns more than £40,000 net","example[28]":"All fund dividends are paid gross rather than net of tax."}