{"word[0]":"suffer","definition[0]":"to experience physical or mental pain","example[0]":"At least he died suddenly and didn’t suffer.","example[1]":"She’s suffering a lot of pain.","signpost[0]":"disease/medical condition","definition[1]":"to have a particular disease or medical condition, especially for a long time","example[2]":"Craig suffers from a rare bone disease.","note[0]":"suffer from","example[3]":"The writer suffered from ill health for most of his life.","explanation[0]":"In everyday English, people usually say that someone has a medical condition, rather than suffers from it:","example[4]":"Both her children have asthma.","signpost[1]":"bad experience/situation","definition[2]":"if someone suffers an unpleasant or difficult experience, or is in a difficult situation, it happens to them or they experience it","example[5]":"Most of us have suffered the consequences of stupid decisions taken by others.","example[6]":"In June 1667, England suffered a humiliating defeat by the Dutch.","example[7]":"Small businesses have suffered financially during the recession.","example[8]":"They are unlikely to suffer any further loss of business. ","note[1]":"suffer loss/damage/injury","example[9]":"He suffered head injuries in the crash.","example[10]":"A man who suffered serious brain damage during an operation is suing the hospital.","example[11]":"London employers were suffering from a desperate shortage of school-leavers.","signpost[2]":"become worse","definition[3]":"to become worse in quality because a bad situation is affecting something or because nobody is taking care of it","opposite[0]":"benefit","example[12]":"Safety might suffer if costs are cut.","example[13]":"I’m worried and my work is beginning to suffer.","heading[0]":"– Meaning 2: to have a particular disease or medical condition, especially for a long time","collocation[0]":"suffer an injury","example[14]":"Ten people suffered minor injuries.","collocation[1]":"suffer a heart attack/stroke","example[15]":"He died after suffering a massive heart attack.","collocation[2]":"suffer damage","example[16]":"The U.S. ship suffered no damage.","collocation[3]":"suffer a defeat","example[17]":"The team has now suffered five successive defeats.","collocation[4]":"suffer a setback","example[18]":"Her preparations for the Olympic Games suffered a setback when she injured her leg during training.","collocation[5]":"suffer a blow","example[19]":"The government suffered another blow when a report claimed that standards in education were falling.","collocation[6]":"suffer a loss","example[20]":"Both companies have suffered heavy financial losses.","collocation[7]":"suffer a problem","example[21]":"Research shows that children of alcoholic parents are more likely to suffer problems in adulthood.","collocation[8]":"suffer the consequences","example[22]":"If they cannot learn to adapt, they will suffer the consequences.","collocation[9]":"suffer badly/greatly","example[23]":"The town had suffered badly in the war.","collocation[10]":"suffer financially","example[24]":"The museum suffered financially under his administration.","explanation[1]":"You suffer from an illness, disease, or condition","example[25]":"He is suffering from pneumonia","example[26]":"She suffers from anxiety","bad_example[0]":"He is suffering pneumonia","bad_example[1]":"She suffers anxiety","explanation[2]":"You suffer injury, loss, damage, or pain","example[27]":"He suffered terrible injuries"}