{"word[0]":"invitation","definition[0]":"a written or spoken request to someone, inviting them to go somewhere or do something","example[0]":"an invitation to speak at a scientific conference","note[0]":"an invitation to do something","example[1]":"Roger never turns down an invitation to dinner.","note[1]":"invitation to","definition[1]":"the act of being invited or of inviting someone to go somewhere or do something","example[2]":"They were always dropping by, usually without invitation.","example[3]":"Attendance at the seminars is by invitation only  (=only those people who have been invited can attend).","note[2]":"by invitation","example[4]":"Kegl traveled to Nicaragua at the invitation of the Education Minister.","note[3]":"at somebody’s invitation/at the invitation of somebody","definition[2]":"a card inviting someone to attend a party, wedding etc","example[5]":"We sent out more than 300 wedding invitations.","note[4]":"party/wedding invitation","example[6]":"Did you get an invitation to Jason’s party?","definition[3]":"encouragement to do something","example[7]":"He seemed to take my silence as an invitation to talk.","note[5]":"take something as an invitation to do something","collocation[0]":"get/receive an invitation","example[8]":"Did you get an invitation to Janet's party?","collocation[1]":"have an invitation","example[9]":"The following week, I had an invitation to give a talk in Cambridge.","collocation[2]":"accept an invitation","example[10]":"She accepted his invitation to dinner.","collocation[3]":"take up somebody's invitation/take somebody up on their invitation","example[11]":"I decided to take them up on their invitation to dinner.","collocation[4]":"refuse/turn down an invitation","example[12]":"She turned down an invitation to take part in a televised debate.","collocation[5]":"give somebody an invitation","example[13]":"He has issued an invitation to the Chinese president to come to Washington.","collocation[6]":"send (somebody) an invitation","example[14]":"We sent out the invitations last week.","collocation[7]":"thank somebody for an invitation","example[15]":"I'll have to write a letter thanking Martha for the invitation to her wedding.","form[0]":"ADJECTIVES/NOUN + invitation","collocation[8]":"a party/wedding invitation","example[16]":"He had a wedding invitation from Rob and Jen.","collocation[9]":"a dinner/lunch invitation","example[17]":"Fred's wife has accepted the dinner invitation.","collocation[10]":"a formal/official invitation","example[18]":"The president received a formal invitation to visit Nigeria.","collocation[11]":"a personal invitation","example[19]":"Each parent was sent a personal invitation for the school's open day.","collocation[12]":"somebody's kind invitation","example[20]":"It gives me great pleasure to accept your kind invitation.","collocation[13]":"a special invitation","example[21]":"We received a special invitation to attend a reception at the embassy.","collocation[14]":"an open/standing invitation","example[22]":"Phillip kindly gave me an open invitation to stay at his villa in Tuscany.","collocation[15]":"a long-standing invitation","example[23]":"He had accepted a long-standing invitation to address the conference.","form[1]":"invitation + NOUN","collocation[16]":"an invitation card","example[24]":"Everyone entering will have to show an invitation card.","collocation[17]":"a flood of invitations","example[25]":"He got a flood of invitations to appear on TV and radio shows.","definition[4]":"an offer of an opportunity that is made to someone","example[26]":"She turned down an invitation to serve on the company’s board.","definition[5]":"an occasion when a company offers shares for sale","example[27]":"This document is not a prospectus and does not constitute or form any part of an invitation to subscribe for, underwrite or purchase securities.","definition[6]":"an occasion when an organization asks companies to say how much they will charge to perform particular work. The company with the lowest price usually gets the work","example[28]":"We can offer advice on where to find invitations to tender for contracts in Europe."}