{"word[0]":"word","signpost[0]":"group of letters","definition[0]":"a single group of letters that are used together with a particular meaning","example[0]":"Write an essay of about five hundred words.","example[1]":"What does that word mean?","example[2]":"'Vater' is the German word for  (=that means) 'father'.","example[3]":"Perhaps 'lucky' is not exactly the right word.","signpost[1]":"news/information","definition[1]":"a piece of news or a message","example[4]":"Word came that our duties would be changed.","example[5]":"‘Have you heard from Ann?’ ‘No, not a word.’","example[6]":"There was still no word from John.","example[7]":"Word of mouth (=information you get by someone telling you) is one of the best ways of getting business.","example[8]":"It’s a very small town and if you do something bad, word gets around.","note[0]":"word gets out/around","example[9]":"The word is that the two companies are planning a merger.","note[1]":"the word is (that)/word has it (that)","example[10]":"Health officials are encouraging people to spread the word about the benefits of exercise.","note[2]":"spread/pass the word","example[11]":"The mayor sent word he’d be late.","note[3]":"send/bring word","example[12]":"Much of this information is picked up by word of mouth from previous students.","note[4]":"by word of mouth","signpost[2]":"an order","definition[2]":"an order to do something","example[13]":"On the word ‘go’ everyone has to run to the end of the room and back.","example[14]":"When I give the word,  grab him.","collocation[0]":"a new word","example[15]":"Computer technology has brought many new words into our language.","collocation[1]":"the right/exact word","example[16]":"He struggled to find the right word.","collocation[2]":"a German/Italian etc word","example[17]":"Prosciutto is the Italian word for ham.","collocation[3]":"a long word","example[18]":"She didn’t understand all the long words.","collocation[4]":"a short word","example[19]":"a short word beginning with ‘d’ and ending with ‘g’","collocation[5]":"big words","example[20]":"It scares me, when you use big words like that.","collocation[6]":"a five-letter/nine-letter etc word","example[21]":"Can you think of a six-letter word meaning ‘difficult’?","collocation[7]":"a rude word","example[22]":"Someone had written a rude word on the back of his chair.","collocation[8]":"a swear word","example[23]":"He learned a few swear words on the playground.","collocation[9]":"a dirty word","example[24]":"You couldn’t say dirty words on television.","collocation[10]":"a four-letter word","example[25]":"The programme was full of four letter words.","collocation[11]":"a taboo word","example[26]":"This has now become a taboo word.","collocation[12]":"say/speak a word","example[27]":"She said the words ‘my husband’ in a firm voice.","collocation[13]":"use a word","example[28]":"Be very careful how you use the word ‘natural’.","collocation[14]":"pronounce a word","example[29]":"How do you pronounce this word?","collocation[15]":"spell a word","example[30]":"I always find that word hard to spell.","collocation[16]":"have a word","example[31]":"It is not true that Eskimos have more than forty words for snow.","collocation[17]":"find the word","example[32]":"She couldn’t find the words to explain how she felt.","collocation[18]":"search for words","example[33]":"She hesitated, searching for words.","collocation[19]":"look up a word","example[34]":"I looked the word up in my dictionary.","example[35]":"‘Casa’ is the Italian word for ‘house’.","example[36]":"I looked up the word in a dictionary.","display[0]":"name","definition[3]":"a word that you use for a particular thing, place, organization etc","example[37]":"Iberia is the ancient name for the Spanish Peninsula.","example[38]":"What’s the name of that type of dog?","display[1]":"term","definition[4]":"a word or group of words that is used in a specific subject or area of language","example[39]":"The medical term for losing your hair is ‘alopecia’.","example[40]":"People use the term ‘carbon footprint’ to talk about man’s polluting effect on the environment.","display[2]":"phrase","definition[5]":"a group of words that have a particular meaning when used together, or which someone uses on a particular occasion","example[41]":"We don’t really have a phrase for ‘bon appétit’ in English.","example[42]":"Politicians keep using the phrase ‘family values’.","example[43]":"an Italian phrase book","definition[6]":"a fixed phrase which is used in a language and has a particular meaning","example[44]":"He uses a lot of obscure expressions that I don’t really understand.","example[45]":"What does the expression ‘wage slavery’ mean?","display[3]":"buzzword","definition[7]":"a word or group of words that people in a particular type of work or activity have started using a lot because they think it is important","example[46]":"E-learning is the buzzword in educational publishing at the moment.","example[47]":"For anthropologists, ethnodiversity has been a buzzword for quite a while.","display[4]":"idiom","definition[8]":"a group of words that has a special meaning which you cannot guess from the meanings of each separate word","example[48]":"‘Full of beans’ is an idiom which means feeling lively and energetic.","display[5]":"cliché","definition[9]":"a group of words that is used so often that it seems rather boring, annoying, or silly","example[49]":"It’s a bit of a cliché, but good communication skills are the key to success.","example[50]":"the old movie cliché ‘we can’t go on meeting like this’","display[6]":"slang","definition[10]":"very informal words used especially by a particular group of people such as young people, criminals, or soldiers","example[51]":"Grass is slang for marijuana.","example[52]":"prison slang","example[53]":"army slang","display[7]":"jargon","definition[11]":"words and phrases used in a particular profession or by a particular group of people, which are difficult for other people to understand – often used to show disapproval","example[54]":"The instructions were full of technical jargon.","example[55]":"complicated legal jargon","definition[12]":"used to say that you understand or agree with what someone has just said","definition[13]":"to use words that are carefully chosen in order to express something","example[56]":"How can we word the letter so as not to offend the parents?","definition[14]":"a popular type of computer software used for word processing  (=typing letters, reports etc and storing information), produced by the Microsoft Corporation"}