{"word[0]":"organ","signpost[0]":"body part","definition[0]":"a part of the body, such as the heart or lungs, that has a particular purpose","example[0]":"the liver, heart, and other internal organs","example[1]":"loss of blood flow to his vital organs","example[2]":"Extra doses of the hormone caused the animals’ reproductive organs to develop sooner than usual.","example[3]":"In Arizona, 480 people are waiting for organ transplants.","example[4]":"dying people who have agreed to be organ donors","definition[1]":"a penis – used because you want to avoid saying this directly","definition[2]":"a large musical instrument used especially in churches, with keys like a piano and large pipes that air passes through to produce the sound","definition[3]":"an electronic musical instrument that produces music similar to a pipe organ, but that does not have pipes","example[5]":"an electronic organ","definition[4]":"an organization that is part of, or works for, a larger organization or group","example[6]":"the decision-making organs","example[7]":"The courts are organs of government.","note[0]":"organ of","signpost[1]":"newspaper/magazine","definition[5]":"a newspaper or magazine which gives information, news etc for an organization or group","example[8]":"the official organ of the Communist Party","form[0]":"ADJECTIVES/NOUN + organ","collocation[0]":"internal organs","example[9]":"She died after suffering serious damage to internal organs.","collocation[1]":"vital organs","example[10]":"Luckily, the bullet passed through his body without hitting vital organs.","collocation[2]":"sexual/reproductive/sex organs","example[11]":"the male and female sexual organs","collocation[3]":"sense/sensory organs","example[12]":"Our minds function through the brain, nervous system, and sense organs.","example[13]":"As with the other sensory organs, taste is highly developed in babies at birth.","collocation[4]":"digestive organs","example[14]":"a disorder of the digestive organs","collocation[5]":"a donor organ","example[15]":"There is a chronic shortage of donor organs.","form[1]":"organ + NOUN","collocation[6]":"an organ transplant","example[16]":"Up to 5,000 people are waiting for an organ transplant.","collocation[7]":"an organ donor","example[17]":"Not all patients who die are suitable as organ donors.","definition[6]":"a magazine or newspaper which presents the ideas and opinions of a political party or other organization","example[18]":"These newspapers were essentially house organs for political factions.","example[19]":"a copy of the McDonald’s Corp. in-house organ (=magazine that it produces for its own employees)","definition[7]":"an organization that does a particular kind of work for the government or another organization or group","example[20]":"an overall accrual of power to the central organs of state","example[21]":"The International Court of Justice is the principal judicial organ of the UN."}