{"word[0]":"shoot","past_tense[0]":"shot","signpost[0]":"kill/injure","definition[0]":"to deliberately kill or injure someone using a gun","example[0]":"Police shot one suspect when he pulled a gun on them.","example[1]":"Smith killed his wife, and then shot himself.","example[2]":"A woman was shot dead in an attempted robbery.","example[3]":"The guards have orders to shoot intruders on sight (=shoot them as soon as they see them).","example[4]":"He had been shot in the back while trying to escape.","note[0]":"shoot somebody in the leg/head etc","signpost[1]":"fire a gun etc","definition[1]":"to make a bullet or arrow come from a weapon","example[5]":"Don’t shoot! I’m coming out with my hands up.","example[6]":"The soldiers had orders to shoot to kill (=shoot at someone with the intention of killing them).","example[7]":"They shot arrows from behind the thick bushes.","note[1]":"shoot bullets/arrows","example[8]":"Tod’s grandfather taught him to shoot a rifle.","note[2]":"shoot a gun/rifle etc","example[9]":"Two guys walked in and started shooting at people.","note[3]":"shoot at","signpost[2]":"birds/animals","definition[2]":"to shoot and kill animals or birds as a sport","example[10]":"They spent the weekend in Scotland shooting grouse.","signpost[3]":"move quickly","definition[3]":"to move quickly in a particular direction, or to make something move in this way","example[11]":"She shot past me into the house.","example[12]":"The cat shot across the garden.","example[13]":"‘Where does cotton come from?’ Ron’s hand shot up. ‘America, Miss!’","example[14]":"The fountain shoots water 20 feet into the air.","signpost[4]":"try to score","definition[4]":"to kick or throw a ball in a sport such as football or basketball towards the place where you can get a point","example[15]":"Giggs shot from the halfway line.","signpost[5]":"photograph/film","definition[5]":"to take photographs or make a film of something","example[16]":"The movie was shot in New Zealand.","definition[6]":"if pain shoots through your body, you feel it going quickly through it","note[4]":"shooting pains (=continuous short pains passing through your body)","example[17]":"A sharp pain suddenly shot along his arm.","note[5]":"shoot through/along","signpost[6]":"plants","definition[7]":"if a plant shoots, a new part of it starts to grow, especially a new stem and leaves","signpost[7]":"lock on a door","definition[8]":"to move the bolt on a door so that it is in the locked or unlocked position","definition[9]":"to use a gun to fire bullets, or to kill or injure someone using a gun","example[18]":"He ordered his men to stop shooting.","example[19]":"The guards shot the man as he was trying to escape.","example[20]":"President Kennedy was shot by a lone gunman.","definition[10]":"to shoot bullets from a gun, or send an explosive object towards someone or something","example[21]":"Soldiers fired into the crowd.","example[22]":"Helicopters fired rockets at several buildings.","example[23]":"He regained his balance, took aim, and fired.","example[24]":"The police fired into the air to make the crowd break up.","example[25]":"As soon as we crossed the border, enemy troops started firing at us.","example[26]":"Kendrick fired three shots at the president’s car.","example[27]":"Suddenly the car stopped, and the passenger got out and fired a Kalashnikov rifle at the police car.","display[0]":"launch","definition[11]":"to send a large rocket or missile into the air","example[28]":"American warships launched cruise missiles.","example[29]":"The guerrillas launched their rockets from densely populated towns.","display[1]":"open fire","definition[12]":"to start shooting","example[30]":"Nineteen students were injured after a gunman opened fire.","example[31]":"Troops opened fire on a group of unarmed demonstrators.","example[32]":"The colonel gave the order for the soldiers to open fire.","display[2]":"shell","definition[13]":"to fire shells  (=metal containers filled with an explosive substance) at enemy soldiers, cities etc in a war, using large guns","example[33]":"Border towns have been shelled by enemy aircraft for the past two months.","example[34]":"British warships began shelling German positions along the coast.","display[3]":"bombard","definition[14]":"to attack a place for a long time with shells or bombs","example[35]":"Allied forces bombarded the coast prior to the invasion.","example[36]":"Troops bombarded the area with shells.","example[37]":"The allied forces bombarded the enemy trenches for weeks.","example[38]":"Cromwell’s men had been bombarding the fort with their artillery for several days.","display[4]":"take a potshot at somebody/something","definition[15]":"to shoot at someone or something without aiming very carefully","example[39]":"Someone tried to take a potshot at him, but hit the man behind instead.","definition[16]":"used to tell someone to start speaking","example[40]":"‘I have a few questions.’ ‘OK, shoot.’","definition[17]":"the part of a plant that comes up above the ground when it is just beginning to grow, or a new part that grows on an existing plant","example[41]":"Tender green shoots will appear in February.","definition[18]":"an occasion when someone takes photographs or makes a film","example[42]":"a photo shoot sponsored by Kodak","example[43]":"She’s out on a video shoot.","note[6]":"on a shoot","definition[19]":"an occasion when people shoot birds or animals for sport, or the area of land where they do this","example[44]":"The royal party was on a shoot when the incident occurred.","definition[20]":"used to show that you are annoyed or disappointed about something","example[45]":"Oh, shoot! I forgot to buy milk.","definition[21]":"to quickly increase in number or amount","example[46]":"Oil prices shot above $40 a barrel.","note[7]":"shoot above/from/to","example[47]":"The monthly interest rate shot to 10% in January."}