{"signpost[0]":"say again","definition[0]":"to say or write something again","example[0]":"Can you repeat your question?","example[1]":"Sorry – could you repeat that?","example[2]":"It is not, I repeat not, my fault.","example[3]":"‘I promise, ’ she repeated.","example[4]":"Nick patiently repeated that he had to work that day.","note[0]":"repeat that","example[5]":"Elderly people tend to repeat themselves.","note[1]":"repeat yourself","signpost[1]":"do again","definition[1]":"to do something again","note[2]":"repeat a class/grade/year (=do the same class at school again the following year)","example[6]":"Repeat the exercises twice a day.","example[7]":"We must not repeat the mistakes of the past.","example[8]":"The team are hoping to repeat their success (=achieve the same good result) of last season.","signpost[2]":"learn","definition[2]":"to say something that someone else has just said, especially in order to learn it","example[9]":"Repeat after me: amo, amas, amat ...","note[3]":"repeat (something) after somebody","definition[3]":"to tell someone something that you have heard, especially something secret","example[10]":"Here’s what happened, but don’t repeat it.","signpost[3]":"broadcast","definition[4]":"to broadcast a television or radio programme again","example[11]":"The series will be repeated in the autumn.","definition[5]":"an event that is very like something that happened before","example[12]":"It was a terrible journey – I hope we don’t have a repeat performance (=have the same thing happen again) on the way home.","example[13]":"The match was basically a repeat of last year’s game at Wembley.","note[4]":"repeat of","definition[6]":"a television or radio programme that has been broadcast before","example[14]":"‘Is it a repeat?’ ‘No, it’s a new series.’","definition[7]":"the sign that tells a performer to play a piece of music again, or the music that is played again","definition[8]":"to achieve the same results, level of performance etc","example[15]":"It was the best-selling car last year and may well repeat that success this year.","definition[9]":"an event, situation etc that is very similar to one that has happened before","example[16]":"I don’t think this year will see a repeat of last year’s earnings."}