{"word[0]":"vary","definition[0]":"if several things of the same type vary, they are all different from each other","synonym[0]":"differ","example[0]":"Test scores vary from school to school.","example[1]":"The heights of the plants vary from 8 cm to 20 cm.","example[2]":"Medical treatment varies greatly from state to state.","example[3]":"Cooking times may vary slightly, depending on your oven.","example[4]":"Charges vary according to size.","example[5]":"She has tried different diets with varying degrees of success.","example[6]":"tests of varying levels of difficulty","example[7]":"flowers that vary in color and size","note[0]":"vary in","definition[1]":"if something varies, it changes depending on the situation","example[8]":"Quentin’s mood seems to vary according to the weather.","example[9]":"‘What do you wear when you go out?’ ‘Well, it varies.’","definition[2]":"to change something to make it different","example[10]":"My doctor said I should vary my diet more.","collocation[0]":"considerably/greatly/widely","example[11]":"The amount of food available varies considerably from season to season.","collocation[1]":"enormously","example[12]":"Farm sizes vary enormously within Europe.","collocation[2]":"significantly","example[13]":"The software seems similar, but performance can vary significantly.","example[14]":"The cooking time may vary slightly depending on your oven.","collocation[3]":"wildly","example[15]":"Prices varied wildly from store to store.","collocation[4]":"varying degrees","example[16]":"She was involved in a number of car accidents of varying degrees of seriousness.","collocation[5]":"varying levels","example[17]":"Children with varying levels of ability can still be taught together.","collocation[6]":"varying sizes","example[18]":"a set of jars of varying sizes","collocation[7]":"varying amounts","example[19]":"Tap water may contain varying amounts of rust, grit and silt.","explanation[0]":"Vary belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[1]":"In this sentence, ‘the interest rate’ is the object of vary","example[20]":"Banks can vary the interest rate","explanation[2]":"In this sentence, ‘the interest rate’ is the subject of vary","example[21]":"The interest rate can vary","past_tense[0]":"varied","definition[3]":"if rates, costs, prices etc vary, or something varies them, they change when economic conditions change","example[22]":"Many professional investors vary the proportions of their portfolios invested in stocks.","example[23]":"The returns on bonds for the first five months vary considerably.","example[24]":"Premiums vary with the age of the person insured and length of cover.","note[1]":"vary with","example[25]":"Though estimates vary widely, analysts generally expect investors to earn between £1 to £2 a share.","example[26]":"The officesvaried in size from three to 14 rooms."}