{"word[0]":"gauge","signpost[0]":"instrument","definition[0]":"an instrument for measuring the size or amount of something","example[0]":"The petrol gauge is still on full.","note[0]":"fuel/temperature/pressure etc gauge","signpost[1]":"width/thickness","definition[1]":"a measurement of the width or thickness of something such as wire or metal","example[1]":"a 27-gauge needle","example[2]":"heavy-gauge black polythene","signpost[2]":"railway","definition[2]":"the distance between the lines of a railway or between the wheels of a train","note[1]":"broad/narrow gauge (=with more/less than the standard distance between the rails)","example[3]":"a standard gauge railway","definition[3]":"the width of the barrel of a gun","example[4]":"a 12-gauge shotgun","form[0]":"NOUN + gauge","collocation[0]":"a fuel gauge","example[5]":"The fuel gauge read a little over half full.","collocation[1]":"a pressure gauge","example[6]":"He checked the pressure gauge on the oxygen cylinder.","collocation[2]":"a temperature gauge","example[7]":"The oil temperature gauge was twice its normal reading.","collocation[3]":"a depth gauge","example[8]":"A depth gauge is essential for telling you how deep you are when diving.","collocation[4]":"check the gauge","example[9]":"Steve checked the oil gauge.","collocation[5]":"the gauge shows something","example[10]":"The gauge showed an abnormal increase in radiation.","collocation[6]":"the gauge reads something","example[11]":"The petrol gauge read empty.","definition[4]":"to judge how people feel about something or what they are likely to do","example[12]":"I looked at Chris, trying to gauge his reaction.","example[13]":"It is difficult to gauge what the other party’s next move will be.","note[2]":"gauge whether/what/how etc","definition[5]":"to measure or calculate something by using a particular instrument or method","example[14]":"The thermostat will gauge the temperature and control the heat.","definition[6]":"to measure how people feel about something or the effect that something is likely to have on them","example[15]":"The magazine commissioned research to gauge opinions on how British industry is meeting its environmental responsibilities.","example[16]":"extensive testing togauge consumerreactions","definition[7]":"to calculate what is likely to happen in the future, using a particular method or set of figures","example[17]":"US retail sales will help gauge how the economy is faring.","example[18]":"The building society hopes to gauge the likely demand for each property before the auction starts.","definition[8]":"a measurement of how people feel about something or the effect that something is likely to have on them","example[19]":"The survey is an important gauge of attitudes and aspirations among college freshmen.","definition[9]":"a method or set of figures that helps to calculate what is likely to happen in the future","example[20]":"The government’s economic forecasting gauge rose for the fifth month in a row."}