{"word[0]":"signal","definition[0]":"a sound or an action that you make in order to give information to someone or tell them to do something","example[0]":"At a prearranged signal the lights went out.","example[1]":"When she got up from the table, it was obviously the signal for us to leave.","note[0]":"signal (for somebody) to do something","definition[1]":"an event or action that shows what someone feels, what exists, or what is likely to happen","example[2]":"We don't want to give out the wrong signal to investors.","note[1]":"send/give out a signal","example[3]":"These results are a signal that the child may need special help.","note[2]":"signal (that)","example[4]":"The opinion poll is a clear signal of people’s dissatisfaction with the government.","note[3]":"signal of","example[5]":"the danger signals of a heart attack","definition[2]":"a series of light waves, sound waves etc that carry an image, sound, or message, for example in radio or television","example[6]":"This new pay-TV channel sends signals via satellite to cable companies.","note[4]":"send/transmit a signal","example[7]":"a small antenna which can receive radio signals","note[5]":"receive/pick up/detect a signal","example[8]":"The coastguard picked up a distress signal from a freighter 50 miles out at sea.","definition[3]":"a piece of equipment with coloured lights, used on a railway to tell train drivers whether they can continue or must stop","example[9]":"a stop signal","example[10]":"a signal failure (=when these lights do not work)","heading[0]":"– Meaning 2: an event or action that shows what someone feels, what exists, or what is likely to happen","form[0]":"ADJECTIVES/NOUN + signal","collocation[0]":"a clear/strong signal","example[11]":"My body was giving me a clear signal that something was wrong.","collocation[1]":"a warning/danger/alarm signal","example[12]":"Managers should keep a watchful eye open for the danger signals.","collocation[2]":"the wrong signals","example[13]":"Reducing the penalty for marijuana use perhaps sends the wrong signal to teenagers.","collocation[3]":"mixed signals","example[14]":"Our culture gives girls mixed messages about food, with skinny models and fast-food commercials competing for attention.","example[15]":"The use of the army sends out a clear signal to protesters that their actions will not be tolerated.","collocation[4]":"read the signals","example[16]":"President Nixon read the signals and decided it was time to resign.","heading[1]":"– Meaning 3: a series of light waves, sound waves etc that carry an image, sound, or message, for example in radio or television","collocation[5]":"send (out)/transmit a signal","example[17]":"The signals are transmitted via satellites.","collocation[6]":"emit a signal","example[18]":"The device emits a signal which can be picked up by a submarine.","collocation[7]":"receive/pick up a signal","example[19]":"The antenna that will pick up the signals is a 12-metre dish.","collocation[8]":"carry a signal","example[20]":"Copper wires carry the electrical signals.","collocation[9]":"a signal travels","example[21]":"The signal travels over the cable network.","example[22]":"I can’t use my phone because the signal isn’t strong enough here.","collocation[10]":"weak/faint","example[23]":"The signals were too weak for the receiver to pick up.","collocation[11]":"a radio/electrical/radar signal","example[24]":"A transmitter connected to the door bell sends radio signals to a portable receiver.","collocation[12]":"a digital signal","example[25]":"Digital signals can be compressed to take up less space.","definition[4]":"to make a sound or an action in order to give information or tell someone to do something","example[26]":"She signalled, and the waiter brought the bill.","example[27]":"The whistle signalled the end of the match.","example[28]":"Mary signalled wildly at them, but they didn’t notice.","note[6]":"signal at","example[29]":"The judge signaled to a police officer and the man was led away.","note[7]":"signal to","example[30]":"He pushed his plate away and signalled for coffee.","note[8]":"signal for","example[31]":"She signalled to the children to come inside.","note[9]":"signal (to) somebody to do something","example[32]":"The bell signaled that school was over.","note[10]":"signal that","definition[5]":"to make something clear by what you say or do – used in news reports","example[33]":"Both sides have signaled their willingness to start negotiations.","example[34]":"British sources last night signalled their readiness to talk.","example[35]":"The prime minister’s speech today signals that there will be a shakeup in the cabinet.","definition[6]":"to be a sign that something is going to happen","example[36]":"the lengthening days that signal the end of winter","note[11]":"signal the start/beginning/end of something","definition[7]":"to show the direction you intend to turn in a vehicle, using the lights","example[37]":"Signal before you pull out.","example[38]":"The university has done me the signal honour of making me an Honorary Fellow.","note[12]":"signal achievement/success/failure etc"}