{"definition[0]":"continuing for a short time","example[0]":"We stopped by Alice’s house for a brief visit.","example[1]":"Let’s keep this conversation brief; I have a plane to catch.","example[2]":"Greene spent a brief time at Cambridge.","note[0]":"a brief period/moment/spell etc","definition[1]":"using very few words or including few details","example[3]":"The president read a brief statement to reporters before boarding his plane.","example[4]":"a brief description of the film","definition[2]":"clothes that are brief are short and cover only a small area of your body","example[5]":"a very brief bikini","collocation[0]":"a brief period/time","example[6]":"He lived there all his life, apart from a brief period during the war.","collocation[1]":"a brief spell","example[7]":"For a brief spell in early summer it is the most beautiful of all the trees.","collocation[2]":"a brief moment","example[8]":"The old lady’s gaze rested on her for a brief moment.","collocation[3]":"a brief visit","example[9]":"The president flew to Argentina for a brief visit.","collocation[4]":"a brief look","example[10]":"He gave her a brief look.","collocation[5]":"a brief glimpse","example[11]":"From the train I had a brief glimpse of the city.","collocation[6]":"a brief pause","example[12]":"There was a brief pause before he replied.","collocation[7]":"a brief silence","example[13]":"After a brief silence, she made another suggestion.","collocation[8]":"a brief appearance","example[14]":"He made a brief appearance before reporters outside his Manhattan townhouse.","definition[3]":"official instructions that explain what someone’s job is, what their duties are etc","example[15]":"The architect’s brief is to design an extension that is modern but blends with the rest of the building.","definition[4]":"a short spoken or written statement giving facts about a law case","example[16]":"The ACLU filed a brief  (=gave one to the court) opposing the decision.","definition[5]":"a law case that a lawyer will argue in a court","definition[6]":"a short report about something","definition[7]":"to give someone all the information about a situation that they will need","example[17]":"The president has been fully briefed on the current situation in Haiti.","note[1]":"brief somebody on something","definition[8]":"official instructions that explain what someone’s job is or what their duties are","example[18]":"The auditor’s brief is to monitor and report upon agencies’ effectiveness.","example[19]":"The topic of your talk is specified in advance, and you will be expected to keep to your brief.","definition[9]":"a document prepared for a lawyer to use when representing a client in a court of law. The brief includes all the details of the case and all the points of law relating to it","example[20]":"His lawyer is still preparing his brief.","definition[10]":"a SOLICITOR","example[21]":"It’s time you got yourself a brief.","definition[11]":"to give someone the information they need about something, for example so that they can do work related to it","example[22]":"Allen was in London yesterday to brief investors about the company’s efforts to return to profitability.","definition[12]":"to give instructions to a lawyer who will represent a client in court","example[23]":"The usual action must be taken to retain and brief counsel."}