{"word[0]":"conduct","signpost[0]":"carry out","definition[0]":"to carry out a particular activity or process, especially in order to get information or prove facts","example[0]":"The memorial service was conducted by the Rev. David Prior.","example[1]":"It was the first time that I had conducted business in Brazil.","example[2]":"We are conducting a survey of consumer attitudes towards organic food.","note[0]":"conduct a survey/investigation/review etc","example[3]":"Is it really necessary to conduct experiments on animals?","note[1]":"conduct an experiment/a test","example[4]":"They conducted a campaign of bombings and assassinations.","note[2]":"conduct a campaign","example[5]":"The interview was conducted in English.","note[3]":"conduct an interview","explanation[0]":"In everyday English, people usually say do or carry out rather than conduct: ","example[6]":"They’re doing a survey of opinions about organic food.","definition[1]":"to stand in front of a group of musicians or singers and direct their playing or singing","example[7]":"Who will be conducting?","example[8]":"The orchestra is conducted by John Williams.","note[4]":"conduct an orchestra/choir","signpost[1]":"electricity/heat","definition[2]":"if something conducts electricity or heat, it allows electricity or heat to travel along or through it","example[9]":"Aluminium, being a metal, readily conducts heat.","signpost[2]":"show somebody something","definition[3]":"to take or lead someone somewhere","example[10]":"a conducted tour of Berlin","note[5]":"conducted tour (of something)","example[11]":"On arrival, I was conducted to the commandant’s office.","note[6]":"conduct somebody to something","collocation[0]":"conduct research","example[12]":"He’s conducting educational research at the University of Washington.","collocation[1]":"conduct a survey","example[13]":"They conducted a survey of students’ careers one year after graduation.","collocation[2]":"conduct a study/review","example[14]":"Scientists conducted a study of the area affected by the nuclear disaster.","collocation[3]":"conduct an investigation/inquiry","example[15]":"Experts conducted an investigation into the causes of the crash.","example[16]":"Here are a few guidelines on how to conduct an interview.","example[17]":"The party was criticized for the way it had conducted its election campaign.","collocation[4]":"conduct a test/experiment","example[18]":"Investigators will be conducting tests to determine how the man died.","collocation[5]":"conduct a search","example[19]":"The Spanish authorities conducted a nationwide search for the girl.","collocation[6]":"conduct (a) business","example[20]":"The company had been conducting a lot of business in Latin America.","definition[4]":"the way someone behaves, especially in public, in their job etc","note[7]":"improper/violent/offensive etc conduct","example[21]":"The Senator’s conduct is being investigated by the Ethics Committee.","example[22]":"an inquiry into the conduct of the police","example[23]":"his arrest for disorderly conduct (=noisy violent behaviour)","example[24]":"the Law Society’s Code of Professional Conduct","note[8]":"ethical/professional etc conduct","collocation[7]":"professional conduct","example[25]":"There are strict rules that regulate lawyers’ professional conduct.","collocation[8]":"sexual conduct","example[26]":"The politician’s sexual conduct had caused scandal.","collocation[9]":"violent conduct","example[27]":"Their goalkeeper was sent off the field for violent conduct.","collocation[10]":"disorderly conduct","example[28]":"Her husband was arrested for drunkenness and disorderly conduct.","collocation[11]":"criminal conduct","example[29]":"In some cases of bullying, pupils may be guilty of criminal conduct.","collocation[12]":"proper/improper conduct","example[30]":"There was no evidence of improper conduct on the part of the police.","collocation[13]":"personal conduct","example[31]":"You are expected to maintain a high standard of personal conduct at work.","collocation[14]":"unsportsmanlike conduct","example[32]":"He swore at the referee, and was penalized for unsportsmanlike conduct.","collocation[15]":"human conduct","example[33]":"Societies have certain rules for normal human conduct.","collocation[16]":"a code of conduct","example[34]":"All professions have a code of conduct.","collocation[17]":"rules/standards of conduct","example[35]":"In war, there are established rules of conduct.","collocation[18]":"a course of conduct","example[36]":"The court said that when Harris had embarked on this course of conduct, he knew that it would put lives at risk.","definition[5]":"to manage or organize something","example[37]":"In future, Mr O'Reilly will conduct his business within the rules and regulations.","example[38]":"The Special Fund may, in his name, finalise contractual issues.","definition[6]":"to carry out an activity or process in order to obtain information or prove facts","example[39]":"The European Parliament had asked its legal affairs committee to conduct an investigation into the case.","definition[7]":"to behave in a particular way, especially in a situation where other people judge your behaviour","example[40]":"Members of staff should conduct themselves in an appropriate manner when dealing with customers.","definition[8]":"the way in which a person behaves","example[41]":"It was claimed that the company had engaged in anti-competitive conduct.","definition[9]":"the way in which something is managed or organized","example[42]":"There has been a huge change in the conduct of monetary policy.","example[43]":"rules governing the conduct of shareholder meetings"}