{"word[0]":"deadline","definition[0]":"a date or time by which you have to do or complete something","note[0]":"a tight/strict deadline (=one that must be met but is difficult)","example[0]":"I'm always working under pressure to meet deadlines (=finish something on time).","example[1]":"They've set a deadline of 12 noon. ","note[1]":"set/impose a deadline","example[2]":"He missed the deadline for applications.","note[2]":"deadline for","example[3]":"It has to be in before the deadline of July 1st.","note[3]":"deadline of","collocation[0]":"have a deadline","example[4]":"It's easier to work hard if you have a deadline.","collocation[1]":"work to a deadline","example[5]":"We're all under pressure and working to deadlines.","collocation[2]":"meet a deadline","example[6]":"Everyone's working extremely hard to meet the deadline.","collocation[3]":"miss a deadline","example[7]":"There will be penalties if the government misses the deadline to cut air pollution.","collocation[4]":"set a deadline","example[8]":"The deadline has been set at January 31st.","collocation[5]":"extend a deadline","example[9]":"My editor agreed to extend the deadline by two weeks.","collocation[6]":"a deadline approaches/looms","example[10]":"Things began to get more frantic as the deadline loomed.","collocation[7]":"a deadline passes","example[11]":"The deadline had already passed for him to raise the money.","form[0]":"ADJECTIVES/NOUN + deadline","collocation[8]":"a strict deadline","example[12]":"We're working to a very strict deadline.","collocation[9]":"a tight deadline","example[13]":"As a journalist, you have to be able to work to tight deadlines.","collocation[10]":"the Friday/December etc deadline","example[14]":"The project went on long after the December deadline.","definition[1]":"a date or time by which you have to do or to complete something","example[15]":"September 30 is the deadline for sending in your tax return.","example[16]":"I think we need to set a deadline.","example[17]":"The financially troubled company didn’t meet yesterday’s deadline for filing its annual report.","example[18]":"The Ontario Court extended the deadline for filing its restructuring plan to Jan 31.","example[19]":"The successful applicant must have the ability to work to a deadline under pressure.","example[20]":"He was known as a demanding boss who imposed tight deadlines."}