{"word[0]":"suit","definition[0]":"a set of clothes made of the same material, usually including a jacket with trousers or a skirt","example[0]":"a grey lightweight suit","example[1]":"a business suit","example[2]":"a tweed suit","example[3]":"She was wearing a black trouser suit.","definition[1]":"a problem or complaint that a person or company brings to a court of law to be settled","synonym[0]":"lawsuit","example[4]":"Johnson has filed suit against her.","example[5]":"a civil suit","signpost[0]":"office worker","definition[2]":"a man, especially a manager, who works in an office and who has to wear a suit when he is at work","example[6]":"I bought myself a mobile phone and joined the other suits on the train to the City.","definition[3]":"one of the four types of cards in a set of playing cards","definition[4]":"to be acceptable, suitable, or convenient for a particular person or in a particular situation","example[7]":"Whatever your reason for borrowing, we have the loan that suits your needs.","example[8]":"There’s a range of restaurants to suit all tastes.","example[9]":"There are countryside walks to suit everyone.","example[10]":"We have gifts to suit every pocket  (=of all prices).","example[11]":"Either steak or chicken would suit me fine.","example[12]":"The climate there will suit you down to the ground  (=suit you very well).","example[13]":"She had the ability to suit her performances to the audience.","note[0]":"suit something to something","definition[5]":"clothes, colours etc that suit you make you look attractive","example[14]":"That coat really suits Paul.","example[15]":"Red suits you.","example[16]":"Jill’s new hairstyle doesn’t really suit her.","explanation[0]":"Suit is never passive in this meaning","collocation[0]":"suit somebody's needs/requirements","example[17]":"The building has been adapted to suit the needs of older people.","collocation[1]":"suit somebody's taste","example[18]":"Users can customize the home page to suit their personal tastes.","collocation[2]":"suit somebody's purpose","example[19]":"It suited her purpose to let him believe the lie.","collocation[3]":"suit somebody's mood","example[20]":"You can adjust the colour of the lighting to suit your mood.","collocation[4]":"suit somebody's style","example[21]":"Choose a racket that suits your style of play.","collocation[5]":"suit the circumstances","example[22]":"When writing emails, most people vary the style to suit the circumstances.","collocation[6]":"suit the occasion","example[23]":"I thought a simple black dress would suit the occasion.","collocation[7]":"suit somebody's pocket","example[24]":"The choice is wide, with something to suit everyone's pocket.","collocation[8]":"suit somebody well","example[25]":"Our new house suits us very well.","collocation[9]":"suit somebody perfectly","example[26]":"The arrangement suited me perfectly.","collocation[10]":"suit somebody fine","example[27]":"Either Monday or Tuesday would suit me fine for our meeting.","collocation[11]":"suit somebody down to the ground","example[28]":"Country life suits you down to the ground.","definition[6]":"a case brought to a court of law by a private person or company, not by the police or government","synonym[1]":"LAWSUIT","example[29]":"Ms. Sobel filed a suit, claiming sex discrimination.","definition[7]":"a set of clothes made from the same material and including a JACKET (=short coat) and trousers or a skirt","definition[8]":"someone such as a manager working for a company that produces books, advertisements, or films, and who has to wear a suit when they are at work","example[30]":"He looks more like a copywriter than an account managing ‘suit’."}