{"word[0]":"minimum","definition[0]":"the minimum number, degree, or amount of something is the smallest or least that is possible, allowed, or needed","opposite[0]":"maximum","example[0]":"The minimum number of students we need to run the course is fifteen.","example[1]":"The minimum age for retirement is 55.","definition[1]":"the smallest amount of something or number of things that is possible or necessary","example[2]":"The judge recommended that he should serve a minimum of 12 years.","note[0]":"a minimum of two hours/£1,000 etc","example[3]":"Prison inmates are kept in tiny cells, with the bare minimum of furniture.","note[1]":"absolute/bare minimum","example[4]":"She had reduced her consumption of fat and sugar to an absolute minimum.","note[2]":"keep/reduce something to a minimum","example[5]":"He achieved enviable results with the minimum of effort.","note[3]":"minimum of","collocation[0]":"have a minimum of something","example[6]":"Candidates should have a minimum of five years’ work experience.","collocation[1]":"keep something to a minimum","example[7]":"Keep the noise to a minimum, will you?","collocation[2]":"reduce something to a minimum","example[8]":"We want to reduce the environmental impact to a minimum.","collocation[3]":"need a minimum of something","example[9]":"We’ll need a minimum of two days to get this ready.","collocation[4]":"an absolute/bare minimum","example[10]":"He paid in five pounds, the bare minimum needed to keep the bank account open.","collocation[5]":"the legal/statutory minimum","example[11]":"The wage was often well below the legal minimum.","collocation[6]":"the required/necessary minimum","example[12]":"He received 35 votes, two more than the required minimum.","collocation[7]":"with a minimum of fuss","example[13]":"They checked our passports with the minimum of fuss.","collocation[8]":"with a minimum of effort","example[14]":"The house could be restored with a minimum of effort.","definition[2]":"the smallest or least that is possible, allowed, or needed","example[15]":"Minimum investment in each fund is £2000.","example[16]":"There is a minimum charge of £30.","example[17]":"The minimum requirements for the job are a degree and a teaching qualification.","definition[3]":"the smallest amount or number of something that is possible, allowed, or needed","example[18]":"Applicants should have a minimum of five years’ professional experience.","example[19]":"The company needed to raise a minimum of £150 million in new equity.","definition[4]":"to limit something to the smallest amount or degree possible","example[20]":"It is essential that we keep costs to a minimum.","example[21]":"Risks must be reduced to the absolute minimum."}