{"word[0]":"fashionable","definition[0]":"popular, especially for a short period of time","opposite[0]":"unfashionable","example[0]":"Strong colours are very fashionable at the moment.","example[1]":"It suddenly became fashionable for politicians to talk about green issues.","note[0]":"it is fashionable (for somebody) to do something","definition[1]":"popular with, or used by, rich people","example[2]":"He runs a fashionable restaurant near the Harbor.","note[1]":"a fashionable resort/area/address etc","definition[2]":"popular at a particular time","example[3]":"fashionable clothes","example[4]":"It was fashionable to have red hair.","example[5]":"His theories were fashionable in the 1980s.","display[0]":"trendy","definition[3]":"modern and fashionable – often used in a slightly disapproving or joking way","example[6]":"a trendy tie","example[7]":"a trendy restaurant","example[8]":"The area has become very trendy and a lot of artists live there.","display[1]":"stylish","definition[4]":"fashionable and well-designed in an attractive way","example[9]":"She was wearing a stylish two-piece suit.","example[10]":"The furniture looked very stylish and modern.","definition[5]":"fashionable – used especially when you think someone or something looks good","example[11]":"Michael looked very cool in his dark jacket and sunglasses.","example[12]":"a cool shirt","display[2]":"happening","definition[6]":"a happening place is fashionable and lively","example[13]":"London has always been a happening place.","display[3]":"be in fashion","definition[7]":"to be fashionable at a particular time","example[14]":"The Sixties look is back in fashion.","display[4]":"in","definition[8]":"fashionable at a particular time. In  is not used before a noun, except in the phrases below","example[15]":"Pale colours are in.","example[16]":"New York was the in place to be.","example[17]":"Yoga has become the in thing to do.","example[18]":"fashionable management theories","example[19]":"It has became fashionable for politicians to talk about green issues."}