{"definition[0]":"information that is passed from one person to another about other people’s behaviour and private lives, often including unkind or untrue remarks","example[0]":"What’s the latest gossip?","example[1]":"Do you want to hear some juicy gossip?","example[2]":"She had no time for idle gossip.","example[3]":"It was common gossip how he felt about her.","example[4]":"You miss a lot of office gossip when you have a day off work.","example[5]":"On Sundays all the men gather in the square to exchange local gossip.","example[6]":"Here’s an interesting piece of gossip about Mrs Smith.","note[0]":"gossip about","definition[1]":"a conversation in which you exchange information with someone about other people’s lives and things that have happened","example[7]":"Phil’s in there, having a gossip with Maggie.","definition[2]":"someone who likes talking about other people’s private lives – used to show disapproval","example[8]":"Rick’s a terrible gossip.","form[0]":"ADJECTIVES/NOUN + gossip","collocation[0]":"the latest gossip","example[9]":"Annie usually has all the latest gossip.","collocation[1]":"juicy gossip","example[10]":"He said that he had some especially juicy gossip to tell us.","collocation[2]":"hot gossip","example[11]":"What’s the latest hot gossip going round at work then?","collocation[3]":"idle gossip","collocation[4]":"common gossip","example[12]":"Rumours about her affairs had become common gossip.","collocation[5]":"office gossip","example[13]":"He told her a few bits of office gossip which he thought might interest her.","collocation[6]":"village gossip","example[14]":"She knew from village gossip how Harry had treated his first wife.","collocation[7]":"malicious gossip","example[15]":"Has someone been spreading malicious gossip?","collocation[8]":"a piece of gossip","example[16]":"I’ve got an interesting piece of gossip which might interest you.","collocation[9]":"be the subject of gossip","example[17]":"His close friendship with Carol was the subject of gossip.","collocation[10]":"exchange gossip","example[18]":"They used to meet up and exchange gossip.","collocation[11]":"hear gossip","example[19]":"Have you heard the latest gossip about Steve?","collocation[12]":"listen to gossip","example[20]":"He was always willing to listen to gossip.","collocation[13]":"spread gossip","example[21]":"Someone’s been spreading gossip about Lucy and Ian.","collocation[14]":"gossip goes around","example[22]":"It was a small village, and any gossip went around very quickly.","definition[3]":"to talk about other people’s behaviour and private lives, often including remarks that are unkind or untrue","example[23]":"The whole town was gossiping about them."}