{"word[0]":"code","signpost[0]":"laws/behaviour","definition[0]":"a set of rules, laws, or principles that tell people how to behave","example[0]":"The Torah is the basis for all the Jewish laws and their moral code.","example[1]":"Each state in the US has a different criminal and civil code.","example[2]":"The judge ruled that there had been no breach of the code.","example[3]":"There were plans to introduce a dress code (=rules about what to wear) for civil servants.","example[4]":"the strict code of conduct that is so much a part of karate","note[0]":"code of conduct/behaviour/ethics","example[5]":"The Textile Services Association has drawn up a code of practice endorsed by the Office of Fair Trading.","note[1]":"code of practice","signpost[1]":"secret message","definition[1]":"a system of words, letters, or symbols that you use instead of ordinary writing, so that the information can only be understood by someone else who knows the system","example[6]":"They didn’t realise that we’d broken their secret code.","note[2]":"break/crack a code","example[7]":"All reports must be sent in code.","note[3]":"in code","signpost[2]":"symbols giving information","definition[2]":"a set of numbers, letters, or symbols that shows what something is or gives information about it","example[8]":"Goods that you order must have a product code.","example[9]":"Every item found on the archaeological dig is given a code number.","signpost[3]":"telephones","definition[3]":"the group of numbers that comes before a telephone number when you are calling from a different area","example[10]":"What’s the code for Aberdeen?","definition[4]":"a set of instructions that tell a computer what to do","signpost[4]":"sounds/signals","definition[5]":"a system of sounds or signals that represent words or letters when they are sent by machine","heading[0]":"– Meaning 1: a set of rules, laws, or principles that tell people how to behave","collocation[0]":"a code of practice/conduct/ethics","example[11]":"There is a strict code of conduct for doctors.","collocation[1]":"a code of behaviour","example[12]":"Each tribe follows its own code of behaviour.","collocation[2]":"a code of honour","example[13]":"The family’s code of honour meant that they had to take revenge.","form[0]":"ADJECTIVES/NOUN + code","collocation[3]":"a moral code","example[14]":"Children acquire their parents’ moral code.","collocation[4]":"a legal code","example[15]":"the legal code on the use of pesticides","collocation[5]":"a penal/criminal code","example[16]":"At that time the penal code allowed the death penalty.","collocation[6]":"a dress code","example[17]":"Some of the more expensive clubs have a dress code.","collocation[7]":"the Highway Code","example[18]":"You will be tested on your knowledge of the Highway Code.","collocation[8]":"a strict code","example[19]":"In future we will have to abide by a strict code of environmental standards.","collocation[9]":"a voluntary code","example[20]":"This voluntary code sets standards for retailers on the use of child labour.","collocation[10]":"have a code","example[21]":"Most professional organizations have a code of ethics.","collocation[11]":"create/produce/establish a code","example[22]":"They have established a code of practice for advertisers.","collocation[12]":"draw up/lay down a code","example[23]":"The syndicate decided to draw up a code of conduct for its members.","collocation[13]":"follow a code","example[24]":"When children are near water, it’s important to follow a basic safety code.","collocation[14]":"comply with/adhere to/conform to  a code","example[25]":"All staff must sign and strictly adhere to a Code of Business Ethics.","collocation[15]":"break a code","example[26]":"European steel producers were judged to be breaking the code.","collocation[16]":"breach/violate/contravene a code","example[27]":"Any companies breaching the code will be expelled from the Association.","heading[1]":"– Meaning 2: a system of words, letters, or symbols that you use instead of ordinary writing, so that the information can only be understood by someone else who knows the system","collocation[17]":"a secret code","example[28]":"the secret codes used during the two world wars","example[29]":"The Enigma machine was used to crack the enemy codes.","collocation[18]":"decipher a code","example[30]":"His job involved deciphering the codes used by the enemy.","collocation[19]":"write something in code","example[31]":"All the information we received during the war was written in code.","collocation[20]":"send something in code","example[32]":"The message was sent in code to the task force, as a signal to attack.","form[1]":"code + NOUN","collocation[21]":"a code word","example[33]":"UMBRA was the code word for top secret information.","collocation[22]":"a code name","example[34]":"The spy was referred to in the report only by his code name 'Trevor S'.","definition[6]":"to put a set of numbers, letters, or symbols on something to show what it is or give information about it","example[35]":"Each path is coded to show the level of difficulty.","example[36]":"The researcher codes them X or Y.","definition[7]":"to put a message into code so that it is secret","opposite[0]":"decode","example[37]":"a coded message","explanation[0]":"Code is usually passive in this meaning","definition[8]":"to write computer programs","example[38]":"I think kids should be taught how to code.","definition[9]":"a complete set of written rules or laws","definition[10]":"a set of numbers, letters, or signs that are used to show what something is or give information about it","example[39]":"It is all too easy to miss an employee off a list because a code has been entered incorrectly.","example[40]":"a translator that will take the binary code from Windows applications and produce Alpha code","example[41]":"An ANDF version of the spreadsheet runs to 200,000 lines of code.","definition[11]":"the group of numbers that come before a telephone number when you are calling from a different area","example[42]":"Dial 0101 first, then your area code, followed by your home number.","definition[12]":"a number that is given to an employee showing the amount of money that they are allowed to earn without paying any tax","example[43]":"When you get married your code will change."}