{"word[0]":"bankrupt","definition[0]":"without enough money to pay what you owe","synonym[0]":"insolvent","example[0]":"The firm went bankrupt before the building work was completed.","example[1]":"In 1977 he was declared bankrupt (=by a court).","example[2]":"Mr Trent lost his house when he was made bankrupt.","example[3]":"Seventeen years of war left the country bankrupt.","example[4]":"a bankrupt electrical company","definition[1]":"completely lacking a particular good quality","example[5]":"The opposition attacked the government as morally bankrupt.","definition[2]":"without any money and unable to pay your debts – used about a person or business that has to officially admit this and stop trading permanently","example[6]":"Many small businesses will go bankrupt unless interest rates fall.","example[7]":"He was declared bankrupt in the High Court yesterday.","display[0]":"be in financial difficulties","definition[3]":"to have difficulty paying your bills and debts, often so that you are in danger of becoming bankrupt – used about people and businesses","example[8]":"The firm has been in financial difficulties for some time.","example[9]":"He was in financial difficulties and knew that he would have to sell his home.","display[1]":"go bust/go under","definition[4]":"to become bankrupt and have to stop operating – used about a business","example[10]":"The supermarket isn’t there anymore – it went bust ages ago.","example[11]":"During the last recession, dozens of businesses were going under every day.","definition[5]":"bankrupt – used about people and businesses","example[12]":"The bank was declared insolvent.","example[13]":"Directors of insolvent companies often ignore demands for payment.","example[14]":"Individuals becoming insolvent also jumped 9% to 9,470 in the third quarter.","definition[6]":"to make a person, business, or country bankrupt or very poor","synonym[1]":"ruin","example[15]":"Johns had been nearly bankrupted through a failed business venture.","definition[7]":"someone who has officially said that they cannot pay their debts","note[0]":"certified/uncertified bankrupt British English (=one a court does or does not allow to start a business again)","definition[8]":"not having enough money to pay your debts","example[16]":"Many people would lose their jobs if the firm were to go bankrupt.","example[17]":"He was declared bankrupt at London’s High Court yesterday.","definition[9]":"someone judged to be unable to pay their debts by a court of law, and whose financial affairs are handled by a court official until the debts are settled","definition[10]":"to make a person, business, or country go bankrupt","example[18]":"The new legislation would help restore pride in farming without bankrupting farmers in the process."}