{"word[0]":"propose","signpost[0]":"suggest","definition[0]":"to suggest something as a plan or course of action","example[0]":"The changes were first proposed last year.","example[1]":"the proposed budget cuts","example[2]":"In his speech he proposed that the UN should set up an emergency centre for the environment.","note[0]":"propose (that)","example[3]":"The report also proposes expanding the airport.","note[1]":"propose doing something","example[4]":"He proposed a compromise to me.","note[2]":"propose something to somebody","explanation[0]":"In everyday English, people usually say that someone puts forward plans, ideas etc, rather than proposes them:","example[5]":"The idea was first put forward by a German scientist.","signpost[1]":"meeting","definition[1]":"to formally suggest a course of action at a meeting and ask people to vote on it","example[6]":"The resolution was proposed by the chairman of the International Committee.","note[3]":"propose a motion/amendment/resolution etc","example[7]":"Mr Leesom proposed Mrs Banks for the position of Treasurer  (=he suggested formally that she should be the treasurer).","note[4]":"propose somebody for something","signpost[2]":"theory","definition[2]":"to suggest an idea, method etc as an answer to a scientific question or as a better way of doing something","example[8]":"A number of theories have been proposed to explain the phenomenon.","signpost[3]":"intend","definition[3]":"to intend to do something","example[9]":"How does he propose to deal with the situation?","note[5]":"propose to do something","example[10]":"We still don’t know how the company proposes raising the money.","signpost[4]":"marriage","definition[4]":"to ask someone to marry you, especially in a formal way","example[11]":"Shaun proposed to me only six months after we met.","note[6]":"propose to","definition[5]":"to ask someone to marry you","heading[0]":"GRAMMAR: Patterns with propose","explanation[1]":"In everyday English, you propose that someone does something","example[12]":"I propose that Ms Hallam is appointed","explanation[2]":"In more formal English, you propose that someone do something, using the base form of the verb  (=infinitive without ‘to’)","example[13]":"I propose that Ms Hallam be appointed","bad_example[0]":"I propose Ms Hallam to be appointed","explanation[3]":"You can also use the base form when talking about the past","example[14]":"I proposed that Ms Hallam be appointed","explanation[4]":"You propose that someone should do something  This pattern is used especially in British English","example[15]":"He proposed that we should have another meeting","explanation[5]":"You say it was proposed that someone  (should) do something","example[16]":"It was proposed that we (should) have another meeting","definition[6]":"to suggest something such as a plan or course of action","example[17]":"Lyle proposed large cuts in the training budget.","example[18]":"Hansen has proposed that I become his business partner.","note[7]":"propose that","example[19]":"The chairman proposed a scheme to save both the company and investors’ funds.","example[20]":"He will propose a motion at Monday’s special meeting, calling on the committee to reverse its decision.","example[21]":"Which of his assets is he proposing to sell?","example[22]":"The Sales Director is proposing to boost sales by spending an additional £3,000 per month on advertising."}