{"word[0]":"get into something","definition[0]":"to enter a place, especially when this is difficult","example[0]":"The door was locked and we couldn’t get into the house.","definition[1]":"to arrive at a place","example[1]":"What time do we get into New York?","signpost[0]":"be elected","definition[2]":"to be elected to a Parliament","example[2]":"He first got into Parliament in 1982.","signpost[1]":"college/university","definition[3]":"to be allowed to be a student at a university, college etc","example[3]":"She got into UCLA.","signpost[2]":"team","definition[4]":"to be made a member of a team","example[4]":"Do you think you might get into the Olympic team this year?","signpost[3]":"start doing something","definition[5]":"to start doing or feeling something, or being in a particular situation","example[5]":"He’s started getting into trouble at school.","example[6]":"My parents were always terrified of getting into debt.","example[7]":"She got into the habit of going for long walks by herself.","example[8]":"He got into a terrible temper and started throwing things around.","signpost[4]":"become involved","definition[6]":"to begin to be involved in doing something","example[9]":"How did you first get into script writing?","example[10]":"She was starting to get into politics.","signpost[5]":"enjoy","definition[7]":"to begin to enjoy something or be interested in it","example[11]":"I first got into jazz when I was at college.","definition[8]":"to put on a piece of clothing, especially when this is difficult because the piece of clothing is too small for you","example[12]":"I don’t know how she managed to get into those trousers.","definition[9]":"used to express surprise that someone is behaving very differently from the way they usually behave","example[13]":"I don’t know what’s got into Sally recently.","definition[10]":"to start working or trading in a particular product or service","example[14]":"Many young people want to get into advertising or public relations."}