{"word[0]":"communication","definition[0]":"the process by which people exchange information or express their thoughts and feelings","example[0]":"Good communication is vital in a large organization.","example[1]":"Radio was the pilot’s only means of communication.","definition[1]":"the way people express themselves so that other people will understand","example[2]":"a week’s course in improving communication skills","example[3]":"There has been a breakdown in communication  (=failure to communicate).","definition[2]":"a letter, message, or telephone call","example[4]":"a communication from the Ministry of Defence","heading[0]":"– Meanings 1 & 3","collocation[0]":"a means of communication","example[5]":"There were no roads and no means of communication with the people in the mountains.","collocation[1]":"a line/channel of communication","example[6]":"It's important to maintain good lines of communication between managers and staff.","collocation[2]":"a form/method/system of communication","example[7]":"At university, lectures are the main form of communication.","collocation[3]":"a medium of communication","example[8]":"Photography is a very popular medium of communication.","collocation[4]":"a lack of communication","example[9]":"Disagreements are often due to a lack of communication.","collocation[5]":"a breakdown in communication","example[10]":"Differences in language and traditions can lead to a breakdown in communication.","collocation[6]":"good communication","example[11]":"In our company, there is good communication between the various departments.","collocation[7]":"poor communication","example[12]":"There was poor communication between the air traffic controllers and the aircraft.","collocation[8]":"effective communication","example[13]":"Effective communication plays a key role in the democratic process.","collocation[9]":"direct communication","example[14]":"The new system allows more direct communication between teachers and parents.","collocation[10]":"open communication","example[15]":"The system is aimed at creating trust and open communication.","collocation[11]":"mass communication","example[16]":"Television, radio and other forms of mass communication have made the world a global village.","collocation[12]":"human communication","example[17]":"Speech is the most effective method of human communication.","collocation[13]":"verbal communication","example[18]":"This activity is designed to improve students' verbal communication skills.","collocation[14]":"non-verbal communication","example[19]":"Your appearance and movements are both forms of non-verbal communication.","collocation[15]":"electronic communication","example[20]":"Electronic communication encourages more information exchange.","collocation[16]":"two-way communication","example[21]":"Train drivers need two-way communication with the signal box at all times.","collocation[17]":"establish communication","example[22]":"My job is to establish good communication with our hotel guests.","collocation[18]":"facilitate communication","example[23]":"Computers have facilitated global communication.","form[0]":"communication + NOUN","collocation[19]":"communication skills","example[24]":"Most managers in business spend some time learning communication skills, so that they and their staff can understand each other.","collocation[20]":"a communication system","example[25]":"The natural communication system for humans is speech.","definition[3]":"the process of exchanging information or ideas","example[26]":"Because some editors work in San Francisco and others in London, there is a greater need for communication in the decision-making process.","example[27]":"rules of confidentiality which limit communication","example[28]":"The industry will continue to evolve as communication technology changes and mass communication (=ways of passing information to a large number of people) becomes even more sophisticated.","example[29]":"The CAA recently received a communication from the French Director of Civil Aviation, complaining about the matter.","definition[4]":"to talk or write to someone on a regular basis, or be in the process of talking or writing to someone","example[30]":"We are currently in communication with the company regarding the matter of compensation.","definition[5]":"ways of sending information, especially using a telephone, radio, or computer","example[31]":"The network offers the most cost-effective form of mobile communications available.","definition[6]":"used to talk about ways of travelling or sending goods on the roads, railways etc","example[32]":"With its many airports and train stations, London has excellent communications with the rest of Europe."}