{"word[0]":"hope","definition[0]":"to want something to happen or be true and to believe that it is possible or likely","example[0]":"Liam decided to ignore the warning and just hope for the best (=hope that a situation will end well when there is a risk of things going wrong).","example[1]":"I rang my parents, hoping against hope (=hoping for something that is very unlikely to happen or be true) that they hadn’t left yet.","example[2]":"We hope that more women will decide to join the course.","note[0]":"hope (that)","example[3]":"I do hope everything goes well.","example[4]":"It was hoped that the job would be filled by a local person.","example[5]":"Let’s just hope someone finds her bag.","example[6]":"I hope to God I haven’t left the car window open.","example[7]":"Joan’s hoping to study law at Harvard.","note[1]":"hope to do something","example[8]":"We were hoping for good weather.","note[2]":"hope for","heading[0]":"GRAMMAR: Patterns with hope","explanation[0]":"You hope to do something","example[9]":"We’re hoping to get tickets to the concert","example[10]":"I hope to see you soon","bad_example[0]":"I hope see you soon","explanation[1]":"You hope that something happens","example[11]":"I hope that the rain stops soon","explanation[2]":"You hope that something will happen","example[12]":"I hope that the weather will be fine","explanation[3]":"You hoped that something would happen","example[13]":"She hoped that the weather would be fine","explanation[4]":"You hoped that something might happen","example[14]":"I was hoping that you might come","explanation[5]":"You hope that someone can do something","example[15]":"I hope that I can pass my exam","explanation[6]":"You hoped that someone could do something","example[16]":"She hoped that she could pass her exam","explanation[7]":"In more formal English, you say it is hoped that something will happen","example[17]":"It is hoped that the study will provide some useful information","explanation[8]":"In all the above patterns, ‘that’ is often omitted, especially in spoken English","example[18]":"I hope the rain stops soon","example[19]":"She hoped the weather would be fine","explanation[9]":"Hope is often used in the progressive","example[20]":"I’m hoping to meet him some day","explanation[10]":"Hope is used in the phrases I hope so and I hope not, often to give a short answer","example[21]":"‘Will he be here soon?’ ‘I hope so’","example[22]":"‘Do you think it will rain?’ ‘I hope not!’","bad_example[1]":"I hope it","definition[1]":"a feeling of wanting something to happen or be true and believing that it is possible or likely","example[23]":"When I first arrived in New York, I was full of hope for the future.","example[24]":"The president has expressed the hope that relations will improve.","note[3]":"the hope that","example[25]":"hopes for an end to the fighting","note[4]":"hopes for something","example[26]":"Rita has hopes of studying to be a nurse.","note[5]":"hopes of doing something","example[27]":"Should they hang on in the hope that the shares will go up in value?","note[6]":"in the hope that","example[28]":"Shoppers flocked to the sales in the hope of finding a bargain.","note[7]":"in the hope of doing something","signpost[0]":"something you hope for","definition[2]":"something that you hope will happen","example[29]":"She told him all her secret hopes and fears.","example[30]":"My hope is that by next summer I’ll have saved enough money to go travelling.","note[8]":"somebody’s hope is that ","signpost[1]":"chance","definition[3]":"a chance of succeeding or of something good happening","note[9]":"not a hope! spoken (=used to say that there is no chance of something happening)","example[31]":"They don’t have a hope in hell of winning.","note[10]":"not a hope in hell (of doing something)","example[32]":"‘Your dad might lend you the car.’ ‘Some hope!’","note[11]":"some hope!","example[33]":"It was the rush hour, and there was no hope of getting a seat.","note[12]":"hope of","example[34]":"It was a desperate plan, with little hope of success.","example[35]":"There’s still a faint hope  (=a very small chance) that the two sides will reach an agreement.","collocation[0]":"have hope","example[36]":"The situation looked bad, but we still had hope that things would get better soon.","collocation[1]":"give/offer hope","example[37]":"The research has given hope to thousands of sufferers of the disease.","collocation[2]":"lose/give up/abandon hope","example[38]":"After so long without any word from David, Margaret was starting to lose hope.","collocation[3]":"raise somebody’s hopes","example[39]":"I don't want to raise your hopes too much.","example[40]":"Don’t build your hopes up, Julie. You’ll only get hurt.","collocation[4]":"hold out hope","example[41]":"Negotiators did not hold out much hope of a peaceful solution.","collocation[5]":"pin your hopes on something","example[42]":"After a difficult year, the company is pinning its hopes on its new range of products.","collocation[6]":"cling to the hope that","example[43]":"They clung to the hope that one day a cure would be found.","collocation[7]":"dash/shatter somebody’s hopes","example[44]":"The ending of the talks has dashed any hopes of peace.","collocation[8]":"hopes are fading","example[45]":"Hopes are fading that rescuers will find any more survivors.","collocation[9]":"hope lies in/with something","example[46]":"Our real hope lies with a vaccine.","collocation[10]":"be full of hope","example[47]":"His voice sounded full of hope.","collocation[11]":"a glimmer/ray of hope","example[48]":"The new treatment gives patients a glimmer of hope.","collocation[12]":"somebody’s hopes and dreams","example[49]":"We talked about all our hopes and dreams for the future.","collocation[13]":"somebody’s hopes and fears","example[50]":"The crew members have different hopes and fears about the trip.","collocation[14]":"it is our fervent hope that","example[51]":"It is our fervent hope that change is coming.","collocation[15]":"hope springs eternal","example[52]":"It is unlikely these diets will work, but hope springs eternal.","collocation[16]":"a symbol/beacon of hope","example[53]":"Mandela was a symbol of hope for his whole country.","collocation[17]":"false hope","example[54]":"We don't want to give people false hopes.","collocation[18]":"a vain/forlorn hope","example[55]":"He traveled south in the vain hope of finding work.","collocation[19]":"somebody's only/one hope","example[56]":"My only hope is that someone may have handed in the keys to the police."}