{"definition[0]":"a structure such as a house, church, or factory, that has a roof and walls","example[0]":"The offices are on the top two floors of the building.","example[1]":"a farmhouse and other farm buildings","definition[1]":"the process or business of building things","example[2]":"There is a limited supply of land for building.","example[3]":"stone, timber, and other building materials","example[4]":"The enquiry recommended the building of a tunnel.","note[0]":"building of","collocation[0]":"put up a building","example[5]":"They keep pulling down the old buildings and putting up new ones.","collocation[1]":"pull down/knock down/tear down a building","example[6]":"All the medieval buildings were torn down.","collocation[2]":"demolish/destroy a building","example[7]":"Permission is needed to demolish listed buildings.","form[0]":"ADJECTIVES/NOUN + building","collocation[3]":"a tall building","example[8]":"The park was surrounded by tall buildings.","collocation[4]":"a high-rise building","example[9]":"a New York high-rise building","collocation[5]":"a low building","example[10]":"That low building is a stable block.","collocation[6]":"an office/school/hospital etc building","example[11]":"Our office building is just ten minutes’ walk from where I live.","collocation[7]":"a public building","example[12]":"The town has a number of interesting public buildings, including the old town hall.","collocation[8]":"a beautiful building","example[13]":"The old station was a fine building, but has sadly been demolished.","collocation[9]":"an impressive/imposing building","example[14]":"the impressive buildings around the town’s central square","collocation[10]":"a brick/stone/wooden building","example[15]":"The farmhouse is a long stone building about a century old.","collocation[11]":"a two-storey/three-storey etc building","example[16]":"Our villa was a delightful two-storey building.","collocation[12]":"a single-storey/one-storey building","collocation[13]":"a historic building","example[17]":"Most of the historic buildings are from the 18th century.","collocation[14]":"a listed building","example[18]":"The school is actually a listed building.","collocation[15]":"a derelict building","example[19]":"Near the canal there are a number of derelict buildings.","collocation[16]":"a dilapidated building","example[20]":"He rented an apartment at the top of a dilapidated building in Paris.","collocation[17]":"a ramshackle building","example[21]":"The farm was surrounded by tumbledown buildings.","example[22]":"The college needs money to pay for new buildings.","display[0]":"property","definition[2]":"a building or piece of land, or both together – used especially when talking about buying and selling buildings or land","example[23]":"The next property they looked at was too small.","example[24]":"The company received permission to build six residential properties on the land.","display[1]":"premises","definition[3]":"the buildings and land that a shop, restaurant, company etc uses","example[25]":"You are not allowed to drink alcohol on the premises.","example[26]":"The bread is baked on the premises.","display[2]":"complex","definition[4]":"a group of buildings, or a large building with many parts, used for a particular purpose","example[27]":"The town has one of the best leisure complexes in the country.","example[28]":"a luxury apartment complex","display[3]":"development","definition[5]":"a group of new buildings that have all been planned and built together on the same piece of land","example[29]":"a new housing development","example[30]":"a huge industrial development","display[4]":"block","definition[6]":"a large tall building that contains apartments or offices, or is part of a school, university, or hospital","example[31]":"an office block","example[32]":"a block of flats","example[33]":"a tower block (=a very tall building - often used disapprovingly)","example[34]":"My next lecture is in the science block.","display[5]":"facility","definition[7]":"a place or building used for a particular activity or industry","example[35]":"a research facility on campus","display[6]":"edifice","definition[8]":"a large building, especially one that is tall and impressive – a very formal use","example[36]":"Their head office was an imposing edifice.","display[7]":"structure","definition[9]":"something that has been made to stand upright – used especially when talking about buildings","example[37]":"The stone arch is one of the town’s oldest existing structures.","example[38]":"an immense barn-like structure","example[39]":"Mogul calls this building, designed by Donald and John Parkinson in 1928, ‘the most important structure in Los Angeles of the 20th century.’","definition[10]":"the business of building houses, offices, factories etc","example[40]":"The building industry is still in recession."}