{"signpost[0]":"English/French/Arabic etc","definition[0]":"a system of communication by written or spoken words, which is used by the people of a particular country or area","example[0]":"How many languages do you speak?","example[1]":"one of the best-known poems in the English language","signpost[1]":"communication","definition[1]":"the use of written or spoken words to communicate","example[2]":"the origins of language","signpost[2]":"style/type of words","definition[2]":"a particular style or type of words","example[3]":"The letter was written in complicated legal language.","note[0]":"legal/medical/technical etc language","example[4]":"The expression is mainly used in written language.","note[1]":"spoken/written language","example[5]":"He is able to explain complicated ideas in simple everyday language.","note[2]":"ordinary/everyday language","example[6]":"The plays are full of old-fashioned poetic language. ","note[3]":"literary/poetic language","example[7]":"the language of science","note[4]":"language of","signpost[3]":"swearing","definition[3]":"words that most people think are offensive","note[5]":"bad/foul/abusive language","definition[4]":"a system of instructions for operating a computer","example[8]":"a programming language for the Web","signpost[4]":"signs/actions/sounds","definition[5]":"signs, movements, or sounds that express ideas or feelings","example[9]":"the language of bees","example[10]":"the language of dolphins","collocation[0]":"speak a language","example[11]":"Can you speak a foreign language?","collocation[1]":"use a language","example[12]":"The children use their native language at home.","collocation[2]":"learn a language","example[13]":"Immigrants are expected to learn the language of their new country.","collocation[3]":"master a language","example[14]":"She had had a long struggle to master the Russian language.","collocation[4]":"know a language","example[15]":"He had lived in Japan, but did not know the language.","form[0]":"ADJECTIVES/NOUN + language","collocation[5]":"a foreign language","example[16]":"He found learning a foreign language extremely difficult.","collocation[6]":"the English/Japanese/Spanish etc language","example[17]":"She had some knowledge of the Spanish language.","collocation[7]":"somebody’s first/native language","example[18]":"His first language was Polish.","collocation[8]":"a second language","example[19]":"Most of the students learned English as their second language.","collocation[9]":"modern languages","example[20]":"The school has a good modern languages department.","collocation[10]":"a dead language","example[21]":"She didn’t see the point of learning a dead language.","collocation[11]":"an official language","example[22]":"Canada has two official languages: English and French.","collocation[12]":"a common language","example[23]":"Most of the countries of South America share a common language: Spanish.","form[1]":"language + NOUN","collocation[13]":"the language barrier","example[24]":"Because of the language barrier, it was hard for doctors to give good advice to patients.","collocation[14]":"a language student/learner","example[25]":"Language learners often have problems with tenses.","collocation[15]":"a language teacher","example[26]":"a book for language teachers","collocation[16]":"language teaching","example[27]":"recent developments in language teaching","collocation[17]":"somebody’s command of a language","example[28]":"Does he have a good command of the language?","heading[0]":"different kinds of language","display[0]":"dialect","definition[6]":"a form of a language that is spoken in one area of a country, with different words, grammar, or pronunciation from other areas","example[29]":"Cantonese is only one of many Chinese dialects.","example[30]":"the local dialect","display[1]":"accent","definition[7]":"the way that someone pronounces words, because of where they were born or live, or their social class","example[31]":"Karen has a strong New Jersey accent.","example[32]":"an upper class accent","display[2]":"slang","definition[8]":"very informal spoken language, used especially by people who belong to a particular group, for example young people or criminals","example[33]":"Teenage slang changes all the time.","example[34]":"‘Dosh’ is slang for ‘money’.","display[3]":"terminology","definition[9]":"the technical words or expressions that are used in a particular subject","example[35]":"musical terminology","example[36]":"Patients are often unfamiliar with medical terminology.","display[4]":"jargon","definition[10]":"words and phrases used in a particular profession or subject and which are difficult for other people to understand","example[37]":"The instructions were written in complicated technical jargon.","example[38]":"‘Outsourcing’ is business jargon for sending work to people outside a company to do.","example[39]":"The letter was full of legal jargon.","heading[1]":"techniques used in language","display[5]":"metaphor","definition[11]":"a way of describing something by referring to it as something different and suggesting that it has similar qualities to that thing","example[40]":"The beehive is a metaphor for human society.","display[6]":"simile","definition[12]":"an expression that describes something by comparing it with something else, using the words as or like, for example ‘as white as snow’","example[41]":"The poet uses the simile ‘soft like clay’.","display[7]":"irony","definition[13]":"the use of words that are the opposite of what you really mean, often in order to be amusing","example[42]":"‘I’m so happy to hear that, ’ he said, with more than a trace of irony in his voice.","display[8]":"bathos","definition[14]":"a sudden change from a subject that is beautiful, moral, or serious to something that is ordinary, silly, or not important","example[43]":"The play is too sentimental and full of bathos.","display[9]":"hyperbole","definition[15]":"a way of describing something by saying that it is much bigger, smaller, worse etc than it actually is – used especially to excite people’s feelings","example[44]":"In his speeches, he used a lot of hyperbole.","example[45]":"journalistic hyperbole","display[10]":"alliteration","definition[16]":"the use of several words together that all begin with the same sound, in order to make a special effect, especially in poetry","example[46]":"the alliteration of the ‘s’ sound in ‘sweet birds sang softly’","display[11]":"imagery","definition[17]":"the use of words to describe ideas or actions in a way that makes the reader connect the ideas with pictures in their mind","example[47]":"the use of water imagery in Fitzgerald’s novel ‘The Great Gatsby’","example[48]":"She uses the imagery of a bird’s song to represent eternal hope.","display[12]":"rhetorical question","definition[18]":"a question that you ask as a way of making a statement, without expecting an answer","example[49]":"When he said ‘how can these attitudes still exist in a civilized society?’, he was asking a rhetorical question.","definition[19]":"a system of speaking and writing used by people in one country or area","example[50]":"the French language","example[51]":"Do you speak any foreign languages?","example[52]":"Trading in Europe means communicating in more than one language.","definition[20]":"the kind of words and style used in one kind of writing or by people in a particular job or activity","example[53]":"technical language","definition[21]":"a system of commands and instructions used for operating a computer","example[54]":"Internet Protocol (IP) is a computer language that allows email users to communicate with one another.","example[55]":"the business-oriented Cobol computer language"}