{"word[0]":"obstacle","definition[0]":"something that makes it difficult to achieve something","example[0]":"The tax puts obstacles in the way of companies trying to develop trade overseas.","example[1]":"Women still have to overcome many obstacles to gain equality.","example[2]":"We want to remove all obstacles to travel between the two countries.","example[3]":"the single biggest obstacle to a Conservative victory in the next election","example[4]":"There are formidable obstacles on the road to peace.","example[5]":"Fear of change is an obstacle to progress.","note[0]":"obstacle to","definition[1]":"an object which blocks your way, so that you must try to go around it","collocation[0]":"be an obstacle","example[6]":"This issue is a major obstacle to a successful peace treaty.","collocation[1]":"prove an obstacle","example[7]":"The weather proved an obstacle, with nonstop rains flooding the field.","collocation[2]":"present/pose an obstacle","example[8]":"Serious differences continue to present obstacles to an agreement.","example[9]":"Our reliance on fossil fuels poses an obstacle to achieving these targets.","collocation[3]":"overcome an obstacle","example[10]":"We need to help young people overcome the obstacles that poverty puts in their way.","collocation[4]":"remove an obstacle","example[11]":"Opening the border removed all obstacles to trade and travel between the two countries.","collocation[5]":"face an obstacle","example[12]":"The investigation has faced numerous obstacles.","collocation[6]":"encounter an obstacle","example[13]":"People should not encounter obstacles because of their age, sex, race, or religion.","collocation[7]":"put/place obstacles in the way","example[14]":"Her father put several obstacles in the way of their marriage.","collocation[8]":"a major/serious obstacle","example[15]":"Debt is a major obstacle to economic growth.","example[16]":"There are serious obstacles to obtaining sufficient funding.","collocation[9]":"a real obstacle","example[17]":"The lack of oil and gas resources in Northeast Asia is a real obstacle to the region's economic development.","collocation[10]":"the main/biggest/greatest etc obstacle","example[18]":"The biggest obstacle to women's equality was social expectations of male and female roles.","collocation[11]":"an insuperable/insurmountable obstacle","example[19]":"The problem does not present an insurmountable obstacle.","example[20]":"There are no insuperable obstacles to the purchase of the company.","collocation[12]":"a formidable obstacle","example[21]":"There are formidable obstacles to legal reform.","collocation[13]":"a legal/political/technical etc obstacle","example[22]":"Despite technical obstacles, scientists at NASA are considering the project.","collocation[14]":"an obstacle in the way/path","example[23]":"There were still a number of obstacles in the way of an agreement."}