{"word[0]":"bomb","signpost[0]":"weapon","definition[0]":"a weapon made of material that will explode","example[0]":"The bomb went off at 9.30 in the morning.","example[1]":"Enemy planes dropped over 200 bombs during the raid.","example[2]":"He was killed in a bomb explosion.","signpost[1]":"bad performance/event","definition[1]":"a play, film, event etc that is not successful","example[3]":"This is just another one of Hollywood’s bland and boring bombs.","collocation[0]":"a bomb explodes/goes off","example[4]":"Forty people were injured when the bomb exploded.","example[5]":"A 200 pound bomb went off in the car park.","collocation[1]":"set off a bomb","example[6]":"The area was cleared and the police safely detonated the bomb.","collocation[2]":"drop a bomb","example[7]":"Government forces began dropping bombs on rebel positions.","collocation[3]":"a bomb falls on something","example[8]":"A bomb fell on the cathedral during the war.","collocation[4]":"plant a bomb","example[9]":"It is thought that right-wing extremists planted the bomb.","form[0]":"ADJECTIVES/NOUN + bomb","collocation[5]":"a nuclear/hydrogen bomb","example[10]":"The North Koreans were developing a nuclear bomb.","collocation[6]":"an atom/atomic bomb","example[11]":"Oppenheimer was the father of the atomic bomb.","collocation[7]":"a neutron bomb","collocation[8]":"a car bomb","example[12]":"The car bomb killed 21 shoppers.","collocation[9]":"a letter bomb","example[13]":"A second letter bomb was found among the unopened mail.","collocation[10]":"a time bomb","example[14]":"The terrorists’ time bomb was planned to cause the maximum carnage.","collocation[11]":"a petrol bomb","example[15]":"A petrol bomb was hurled at police as they chased the car.","collocation[12]":"a nail bomb","collocation[13]":"a cluster bomb","collocation[14]":"a dirty bomb","collocation[15]":"a smart bomb","collocation[16]":"a terrorist bomb","example[16]":"The aircraft was blown apart by a terrorist bomb.","collocation[17]":"a suicide bomb","example[17]":"Each time there is a suicide bomb it is a new blow to peace.","collocation[18]":"a homemade bomb","example[18]":"Officers discovered several homemade bombs in the trunk of his car.","collocation[19]":"an unexploded bomb","example[19]":"The workmen found an unexploded bomb.","form[1]":"bomb + NOUN","collocation[20]":"a bomb blast/explosion","example[20]":"The restaurant was destroyed in a massive bomb blast.","collocation[21]":"a bomb attack","example[21]":"No one has yet claimed responsibility for the bomb attack.","collocation[22]":"a bomb threat","example[22]":"He delayed his flight home because of a bomb threat.","collocation[23]":"a bomb scare","example[23]":"The building was evacuated after a bomb scare.","collocation[24]":"bomb disposal","example[24]":"a bomb disposal expert","collocation[25]":"bomb-making equipment","example[25]":"Police found guns and bomb-making equipment in the house.","definition[2]":"a weapon that explodes","example[26]":"The bomb exploded on a bus in Jerusalem during the city’s morning rush hour.","example[27]":"Fifty-five people were injured in a car bomb attack in Baghdad.","example[28]":"Morrow was convicted in 1998 of sending four letter bombs (=a small bomb hidden in a package and sent to someone in order to hurt or kill them) to government officials.","example[29]":"People were worried that terrorists would try to detonate a dirty bomb   (=a bomb that contains nuclear materials )in the city centre.","display[0]":"explosives","definition[3]":"bombs or substances that can cause explosions","example[30]":"They used explosives to blow the door off the front of the building.","example[31]":"The car was packed with 1,000 lbs of high explosives  (=powerful explosives).","display[1]":"device","definition[4]":"a bomb – used especially in news reports","example[32]":"Police found the device hidden in a suitcase.","example[33]":"A bomb threat was received and the building was evacuated, but no device was found.","display[2]":"IED","definition[5]":"a bomb that has been made using whatever materials are available, especially one used to blow up soldiers travelling through a place. IED  is short for ‘improvised explosive device’","example[34]":"Several soldiers were killed when an IED exploded as their convoy drove by.","display[3]":"mine","definition[6]":"a type of bomb that is hidden just below the ground or under water, and that explodes when it is touched","example[35]":"The fields are still full of landmines.","example[36]":"The ship struck a mine and sank.","display[4]":"grenade","definition[7]":"a small bomb that can be thrown by hand or fired from a special gun","example[37]":"He pulled the pin and threw a grenade toward the enemy’s position.","definition[8]":"to attack a place by leaving a bomb there, or by dropping bombs on it from a plane","example[38]":"The town was heavily bombed in World War II.","example[39]":"Government aircraft have been bombing civilian areas.","definition[9]":"to move or drive very quickly","example[40]":"Suddenly a police car came bombing down the high street.","definition[10]":"to fail a test very badly","example[41]":"I bombed my midterm.","definition[11]":"if a play, film, event etc bombs, it is not successful","example[42]":"His latest play bombed on Broadway.","definition[12]":"to cost a lot of money","example[43]":"a new office development that must have cost a bomb","definition[13]":"to make a lot of money","example[44]":"She made a bomb coaching movie stars in Palm Springs.","definition[14]":"if a product or an activity bombs, it fails badly","example[45]":"His original computer design bombed because it lacked power and software applications."}