{"word[0]":"welcome","definition[0]":"used to greet someone who has just arrived","example[0]":"Welcome back – it’s good to see you again.","example[1]":"Hello, welcome home.","example[2]":"Welcome to London!","note[0]":"welcome to","definition[1]":"if someone is welcome in a place, other people are glad that they are there","example[3]":"I had the feeling I wasn’t really welcome.","example[4]":"I didn’t feel welcome in the club.","example[5]":"Mary made us very welcome.","example[6]":"We try to make the new students feel welcome.","definition[2]":"if something is welcome, you enjoy it because you feel that you need it","example[7]":"The weekend was a welcome break from the pressures of work.","example[8]":"Six months in Scotland would make a welcome change from London.","example[9]":"A cup of tea would be very welcome.","definition[3]":"if something is welcome, you are glad that it has happened","example[10]":"The increase in interest rates is welcome news for investors.","example[11]":"This new funding will come as a welcome boost for the industry.","definition[4]":"to say hello in a friendly way to someone who has just arrived","synonym[0]":"greet","example[12]":"I must be there to welcome my guests.","example[13]":"They welcomed us warmly.","example[14]":"His family welcomed me with open arms (=in a very friendly way).","definition[5]":"to be glad to accept something","example[15]":"The college welcomes applications from people of all races.","example[16]":"We would welcome any advice or suggestions with open arms.","definition[6]":"to be glad that something has happened because you think it is a good idea","example[17]":"Economists have welcomed the decision to raise interest rates.","definition[7]":"the way in which you greet someone when they arrive at a place","example[18]":"The president got a tremendous welcome at the airport.","example[19]":"His colleagues gave him a very warm welcome when he returned to work.","note[1]":"warm/friendly welcome","example[20]":"You can be sure of a friendly welcome at all our hotels.","definition[8]":"the way in which people react to an idea, and show that they like it or do not like it","example[21]":"Politicians have given an enthusiastic welcome to the Queen’s speech.","example[22]":"The proposals have so far received a cautious welcome from government ministers.","collocation[0]":"a warm/friendly welcome","example[23]":"You can be sure of a warm welcome.","collocation[1]":"a big welcome","example[24]":"They had planned a big welcome for Martin.","collocation[2]":"a great welcome","example[25]":"Visitors were given a great welcome.","collocation[3]":"a rapturous welcome","example[26]":"He returned to his homeland to a rapturous welcome in 1996","collocation[4]":"a tumultuous welcome","example[27]":"The pope received a tumultuous welcome.","collocation[5]":"a rousing welcome","example[28]":"The audience gave the band a rousing welcome.","collocation[6]":"a hearty welcome","example[29]":"The owner offers a hearty welcome to guests.","collocation[7]":"give somebody a welcome","example[30]":"The Queen was given a decent welcome by the crowd.","collocation[8]":"get/receive a welcome","example[31]":"He received a warm welcome.","collocation[9]":"extend/accord somebody a welcome","example[32]":"Staff and students extended a warm welcome to visiting parents.","collocation[10]":"a smile of welcome","example[33]":"His wrinkled face broke into a smile of welcome.","collocation[11]":"a speech of welcome","example[34]":"The mayor made a brief speech of welcome."}