{"word[0]":"tear","definition[0]":"a drop of salty liquid that comes out of your eye when you are crying","example[0]":"The children were all in tears.","example[1]":"She came home in floods of tears.","example[2]":"I could see that Sam was close to tears.","example[3]":"Bridget suddenly burst into tears and ran out.","example[4]":"He was fighting back tears as he spoke.","example[5]":"A lot of people were moved to tears by his story.","example[6]":"He kissed her cheek, a gesture that brought tears to her eyes.","example[7]":"I must admit I shed a few tears when the school closed.","example[8]":"I saw grown men reduced to tears that day.","example[9]":"‘Please don’t talk like that, ’ Ellen implored him, her eyes filling with tears.","example[10]":"By this time, tears were streaming down my face.","example[11]":"The tears he shed were tears of joy.","collocation[0]":"be in tears","example[12]":"When Evelyn put the phone down, she was in tears.","collocation[1]":"be in floods of tears","example[13]":"By the time she left, she was in floods of tears.","collocation[2]":"be close to/on the verge of tears","example[14]":"He could see that May was close to tears.","collocation[3]":"there are tears in somebody’s eyes","example[15]":"As she watched, there were tears of joy in her eyes.","collocation[4]":"tears of joy/frustration/rage etc","collocation[5]":"burst into tears","example[16]":"She burst into tears and begged me to stay.","collocation[6]":"break down in tears","example[17]":"I broke down in tears when I read the letter.","collocation[7]":"be moved to tears","example[18]":"Members of the audience were moved to tears by her singing.","collocation[8]":"bring tears to somebody’s eyes","example[19]":"This unexpected kindness brings tears to my eyes.","collocation[9]":"reduce somebody to tears","example[20]":"His insults had reduced her to tears, but she had not changed her mind.","collocation[10]":"hold back the tears","example[21]":"She gave her version of events, often struggling to hold back the tears.","collocation[11]":"fight/choke/blink back tears","example[22]":"She fought back tears yesterday as she re-lived the horrors she had seen.","collocation[12]":"shed/weep tears","example[23]":"Don’t shed any tears for him.","collocation[13]":"somebody’s eyes fill with tears","example[24]":"His eyes filled with tears as he recalled his mother’s sacrifices.","collocation[14]":"tears well up in somebody’s eyes","example[25]":"She broke off, feeling the tears welling up in her eyes.","collocation[15]":"tears run/roll/stream down somebody’s face","example[26]":"Oliver laughed until tears ran down his face.","collocation[16]":"bitter tears","example[27]":"She wept bitter tears of remorse for leaving her children behind.","collocation[17]":"hot tears","example[28]":"I felt the hot tears running down my face.","past_tense[0]":"tore","past_participle[0]":"torn","signpost[0]":"paper/cloth","definition[1]":"to damage something such as paper or cloth by pulling it hard or letting it touch something sharp","example[29]":"Be careful not to tear the paper.","example[30]":"His clothes were old and torn.","example[31]":"The dog had torn a huge hole in the tent.","example[32]":"He picked up the envelope and tore it open.","example[33]":"She tore the letter to pieces and threw it in the bin.","example[34]":"Most of her clothes had been torn to shreds.","example[35]":"She realized she had torn her jacket on a nail.","note[0]":"tear something on something","example[36]":"Tear off the slip at the bottom of this page and send it back to us.","note[1]":"tear something off","example[37]":"He tore a page out of his notebook and handed it to her.","note[2]":"tear something out (of something)","definition[2]":"if paper or cloth tears, it splits and a hole appears, because it has been pulled too hard or has touched something sharp","example[38]":"The paper is old and tears easily.","signpost[1]":"move quickly","definition[3]":"to run or drive somewhere very quickly, especially in a dangerous or careless way","example[39]":"She tore back into the house.","example[40]":"We tore down to the hospital.","example[41]":"He tore off into town.","signpost[2]":"remove something","definition[4]":"to pull something violently from a person or place","example[42]":"He tore the letter from my hand.","note[3]":"tear something from somebody/something","example[43]":"A bridge was torn from the bank by the floodwaters.","example[44]":"High winds nearly tore the roof off the house.","note[4]":"tear something off something","signpost[3]":"muscle","definition[5]":"to damage a muscle or ligament","example[45]":"She had torn a muscle in her leg.","collocation[18]":"tear a hole in something","example[46]":"She caught her shawl on a nail and tore a hole in it.","collocation[19]":"tear something open","example[47]":"She tore open the envelope.","collocation[20]":"tear something to pieces/shreds","example[48]":"The dogs tore the meat to pieces.","collocation[21]":"tear something in two","example[49]":"Jack snatched the letter from him and tore it in two.","definition[6]":"to damage paper or cloth by pulling it too hard, or letting it touch something sharp","example[50]":"She unwrapped the present carefully, trying not to tear the paper.","example[51]":"I tore a hole in my jacket, climbing over the fence.","display[0]":"rip","definition[7]":"to tear something quickly or violently","example[52]":"Beth excitedly ripped open the package.","example[53]":"Stop pulling my dress! You’ll rip it!","definition[8]":"to tear your trousers or shirt when you put them on, because they are too tight for you","example[54]":"He bent down and split his trousers.","example[55]":"Oh no, now I’ve split my shirt.","display[1]":"ladder","definition[9]":"if a woman ladders her tights or stockings, she tears them so that a long thin line appears in them","example[56]":"Damn! I’ve laddered my tights!","display[2]":"snag","definition[10]":"to catch a piece of clothing on something rough or sharp so that it tears slightly","example[57]":"I snagged my shirt on a nail.","display[3]":"shred","definition[11]":"to deliberately destroy letters, documents etc by cutting them into thin pieces, often by using a special machine","example[58]":"In order to prevent fraud, it’s best to shred your bank statements.","example[59]":"I went through all my papers shredding things I didn’t need.","display[4]":"frayed","definition[12]":"torn a little along the edges – used about clothes, carpets etc that have been used a lot","example[60]":"He was wearing an old pair of frayed jeans.","example[61]":"The rug was a little frayed around the edges.","example[62]":"The jacket was a little frayed at the cuffs.","definition[13]":"a hole in a piece of cloth or paper where it has been torn","example[63]":"There was a huge tear in his shirt.","note[5]":"tear in","definition[14]":"if your eyes tear, they produce salty liquid, for example because of cold air or smoke","example[64]":"Why does cutting up onions make my eyes tear? "}