{"word[0]":"poison","definition[0]":"a substance that can cause death or serious illness if you eat it, drink it etc","example[0]":"Belladonna and red arsenic are deadly poisons.","example[1]":"a box of rat poison (=poison to kill rats)","example[2]":"He swallowed some type of poison.","definition[1]":"something such as an emotion or idea that makes you behave badly or become very unhappy","example[3]":"Hatred is a poison that will destroy your life.","collocation[0]":"take/swallow poison","example[4]":"He committed suicide by taking poison.","collocation[1]":"give somebody poison","example[5]":"She admitted two charges of giving poison to her daughter.","collocation[2]":"administer poison","example[6]":"He could not have administered the poison that had put Mark in a coma.","collocation[3]":"put poison in something","example[7]":"She put poison in his wine.","collocation[4]":"lace something with poison","example[8]":"He laced the emperor's tea with poison.","collocation[5]":"put poison down","example[9]":"One way of getting rid of rats or mice is to put poison down.","collocation[6]":"a deadly poison","example[10]":"The berries contain a deadly poison.","collocation[7]":"a slow-acting/quick-acting poison","example[11]":"Cyanide is a very strong, quick-acting poison.","collocation[8]":"a virulent poison","example[12]":"Scorpions produce a virulent poison.","collocation[9]":"a dose of poison","example[13]":"He had taken a massive dose of poison.","collocation[10]":"a trace of poison","example[14]":"Traces of the poison were found in the family car.","definition[2]":"to give someone poison, especially by adding it to their food or drink, in order to harm or kill them","example[15]":"She was accused in 1974 of poisoning her second husband, Charles.","example[16]":"He killed several people by poisoning their tea.","example[17]":"Helms attempted to poison his whole family with strychnine.","note[0]":"poison somebody with something","definition[3]":"if a substance poisons someone, it makes them sick or kills them","example[18]":"Thousands of children were poisoned by radiation.","definition[4]":"to make land, rivers, air etc dirty and dangerous, especially by the use of harmful chemicals","example[19]":"Pesticides are poisoning our rivers.","definition[5]":"to have very harmful and unpleasant effects on someone’s mind, emotions, or a situation","example[20]":"Her childhood had been poisoned by an abusive stepfather.","example[21]":"The law will only serve to poison relations between the US and Mexico.","example[22]":"Television violence is poisoning the minds of young people."}