{"word[0]":"earnings","definition[0]":"the money that you receive for the work that you do","example[0]":"an employee’s average weekly earnings","example[1]":"He claimed compensation for loss of earnings.","definition[1]":"the profit that a company or country makes","example[2]":"The company’s earnings have dropped by 5% in the first quarter.","example[3]":"Oil provides 40% of Norway’s export earnings.","form[0]":"ADJECTIVES/NOUN + earnings","collocation[0]":"average earnings","example[4]":"Average earnings for teachers are around $70,000.","collocation[1]":"hourly/weekly/monthly earnings","example[5]":"Some football players have weekly earnings of over £50,000.","collocation[2]":"high earnings","example[6]":"Professional people pay more tax, because of their higher earnings.","collocation[3]":"low earnings","example[7]":"a new government policy which is designed to help people on low earnings","collocation[4]":"annual earnings","example[8]":"His annual earnings are over £1 million.","collocation[5]":"future earnings","example[9]":"With serious injuries, the court may award substantial damages for loss of future earnings.","collocation[6]":"quarterly earnings","example[10]":"The bank will announce its quarterly earnings on January 17.","collocation[7]":"first/second etc quarter earnings","example[11]":"The company’s fourth quarter earnings are excellent.","collocation[8]":"gross earnings","example[12]":"You can usually borrow up to three times the value of your gross earnings per year.","collocation[9]":"net earnings","example[13]":"The company’s net earnings have fallen over the last two years.","collocation[10]":"export earnings","example[14]":"Export earnings from oil bring valuable overseas currency into the country.","collocation[11]":"earnings rise/increase","example[15]":"Average earnings increased by 5 per cent last year.","collocation[12]":"earnings fall","example[16]":"The company’s earnings fell by 21% in the fourth quarter.","collocation[13]":"report earnings","example[17]":"Many car manufacturers have reported disappointing earnings this year.","collocation[14]":"level of earnings","example[18]":"He found he was having to work harder just to maintain his level of earnings.","collocation[15]":"loss of earnings","example[19]":"The insurance policy covers you for loss of earnings due to illness.","collocation[16]":"growth in earnings","example[20]":"The first part of this year has seen a substantial growth in earnings.","definition[2]":"the money that a person receives for the work they do in a particular period of time","example[21]":"He always thought he’d be satisfied even if his earnings didn’t reach $20,000 a year.","example[22]":"the gap between the gross earnings (=income before tax) of manual and non-manual workers","definition[3]":"the total amount that people receive for the work they do in a particular industry or economy in a particular period of time","example[23]":"This month’s figures on inflation, industrial production, average earnings (=the average amount that people earn) and unemployment are expected to show continuing economic weakness.","definition[4]":"the profit that a company makes in a particular period of time, or the total profits that companies make in a particular industry or economy in a particular period of time","example[24]":"British Airways counts on North Atlantic flights for about half its earnings.","example[25]":"This year, the steel industry’s earnings should be higher with the completion of costly modernization programs.","example[26]":"Few can match Quality’s earnings growth of 40% per year over the past five years.","definition[5]":"an investor buys earnings growth by buying shares that are quite cheap in relation to the amount of profit the company made in the previous year, hoping that the value of the shares will increase","example[27]":"The company could buy earnings growth for its shareholders by buying ports overseas with its excess capital."}