{"word[0]":"negotiation","definition[0]":"official discussions between the representatives of opposing groups who are trying to reach an agreement, especially in business or politics","example[0]":"The negotiations with the company had reached a crucial stage.","note[0]":"negotiation with","example[1]":"This follows private negotiations between the landowner and the leisure centre.","note[1]":"negotiation between","example[2]":"He is trying to involve community leaders in negotiations on reform.","note[2]":"negotiation on/over","form[0]":"ADJECTIVES/NOUN + negotiation","collocation[0]":"long/lengthy","example[3]":"After lengthy negotiations, a compromise was finally reached.","collocation[1]":"prolonged/protracted","example[4]":"Despite protracted negotiations, the two sides have failed to reach agreement.","example[5]":"The agreement is the result of two years of long and difficult negotiations.","example[6]":"The company is about to start delicate negotiations with the union about next year's pay agreement.","collocation[2]":"intense","example[7]":"The agreement came after months of intense negotiations.","collocation[3]":"peace/trade etc negotiations","example[8]":"A new round of global trade negotiations is due to start next week.","collocation[4]":"enter into/open negotiations","example[9]":"They have entered into negotiations to acquire another company.","collocation[5]":"conduct negotiations","example[10]":"The country should conduct direct negotiations with its neighbours.","collocation[6]":"break off negotiations","example[11]":"The two companies have broken off negotiations on the deal.","collocation[7]":"resume negotiations","example[12]":"The pressure is on Israel and the Palestinians to resume peace negotiations.","collocation[8]":"negotiations start","example[13]":"Peace negotiations started last week.","collocation[9]":"negotiations stall","example[14]":"The negotiations stalled over the question of arms reductions.","collocation[10]":"negotiations break down","example[15]":"The negotiations broke down over a dispute about working conditions.","collocation[11]":"be under negotiation","example[16]":"The contract is currently under negotiation.","collocation[12]":"be open to negotiation","example[17]":"The price is usually open to negotiation.","example[18]":"The president signalled that he is open to negotiation on the budget.","collocation[13]":"be subject to negotiation","example[19]":"The pay is subject to negotiation.","collocation[14]":"a round of negotiations","example[20]":"the next round of negotiations on trade barriers","collocation[15]":"the initial/early/final stages of negotiation","example[21]":"The offer was in the final stages of negotiation.","collocation[16]":"a breakdown in negotiations","example[22]":"There has been a breakdown in negotiations with the union.","definition[1]":"official discussions between groups who are trying to reach an agreement","example[23]":"The company entered into negotiations for the purchase of a site just outside the town.","example[24]":"The terms of the contract are still open to negotiation (=can be discussed and changed)."}