{"word[0]":"major","definition[0]":"having very serious or worrying results","example[0]":"There is a major problem with parking in London.","example[1]":"The loss of their goalkeeper through injury was a major setback for the team.","example[2]":"He underwent major heart surgery recently.","example[3]":"It could have sparked a major confrontation.","definition[1]":"very large or important, when compared to other things or people of a similar kind","example[4]":"There are two major political parties in the US.","example[5]":"The government’s major concern is with preventing road accidents.","example[6]":"Smoking is one of the major causes of cancer.","example[7]":"the major developments in computer technology","example[8]":"a major road","example[9]":"Britain played a major role in the negotiations.","note[0]":"major role/part/factor etc","definition[2]":"very important","example[10]":"This is major? You got me out of bed for this?","definition[3]":"a major key is based on a musical scale in which there are semitones between the third and fourth and the seventh and eighth notes","example[11]":"a symphony in D major","definition[4]":"an officer of middle rank in the British or US army or Marines, or in the US air force","definition[5]":"the main subject that a student studies at college or university","example[12]":"Her major is history.","definition[6]":"someone studying a particular subject as their main subject at college or university","example[13]":"She’s a history major.","definition[7]":"very large or important when compared with other companies, countries, activities etc of a similar kind","example[14]":"a major New York bank","example[15]":"a meeting of the seven major industrialized nations","example[16]":"The company is currently undergoing a major restructuring.","definition[8]":"very serious","example[17]":"The company’s major problem was its reliance on the big UK market.","example[18]":"There are no major safety concerns with this product.","definition[9]":"a very important company in a particular industry","example[19]":"The majors are taking market share away from smaller companies.","example[20]":"the Hollywood majors","example[21]":"the Japanese oil majors"}