{"word[0]":"fight","past_tense[0]":"fought","signpost[0]":"war","definition[0]":"to take part in a war or battle","example[0]":"Neither country is capable of fighting a long war.","example[1]":"Later the Indians fought the Anglo settlers.","example[2]":"the families of those who fought in the war","note[0]":"fight in","example[3]":"rebel forces fighting against the Russians","note[1]":"fight against/with","example[4]":"They fought for control of the islands.","note[2]":"fight about/over/for","explanation[0]":"Fight is a reciprocal verb This type of verb is used when saying that two or more people or groups do something that involves both or all of them It does not need to have an object  In this sentence, fight is intransitive and does not have an object","example[5]":"The Republicans and the Nationalists fought","explanation[1]":"In these sentences, fight is transitive","example[6]":"The Republicans and the Nationalists fought each other","example[7]":"The Republicans fought the Nationalists","signpost[1]":"hit people","definition[1]":"if someone fights another person, or if two people fight, they hit and kick the other person in order to hurt them","example[8]":"She fought him desperately, kicking and biting.","example[9]":"Two guys were fighting with each other in the street.","note[3]":"fight with","example[10]":"They were fighting over a girl.","signpost[2]":"try to do something","definition[2]":"to try hard to do or get something","example[11]":"The men were fighting for higher wages.","note[4]":"fight for","example[12]":"Stockley is fighting for his life (=trying to stay alive), with serious head injuries.","example[13]":"She fought her way back into the first team.","example[14]":"The president was fighting to survive.","note[5]":"fight to do something","signpost[3]":"prevent something","definition[3]":"to try very hard to prevent something or to get rid of something unpleasant that already exists","example[15]":"We will fight terrorism, wherever it exists.","example[16]":"People are fighting against repression and injustice.","note[6]":"fight against","signpost[4]":"compete","definition[4]":"to take part in an election or compete strongly for something, especially a job or political position","example[17]":"The prime minister decided to fight an early general election.","note[7]":"fight an election/a campaign","example[18]":"He had to fight several other applicants for the job.","note[8]":"fight (somebody) for something","example[19]":"Both men were used to fighting for power.","signpost[5]":"argue","definition[5]":"to argue about something","example[20]":"I heard her fighting with the boss.","example[21]":"They’re fighting about who should do the dishes.","note[9]":"fight about/over","definition[6]":"to take part in a boxing match","example[22]":"Ali fought Foreman for the heavyweight title.","definition[7]":"to try very hard not to have or show a feeling","example[23]":"She fought her fear.","example[24]":"She was clearly fighting with her emotions.","definition[8]":"to try to get something or prevent something in a court of law","example[25]":"The insurance company are fighting the claims in court.","signpost[6]":"people hit each other","definition[9]":"a situation in which two people or groups hit, push etc each other","example[26]":"Her son was always getting into fights at school.","example[27]":"They ended up having a fight with each other.","example[28]":"A fight broke out between the fans.","note[10]":"fight between","example[29]":"fights over territory","note[11]":"fight over/about","signpost[7]":"to achieve/prevent something","definition[10]":"the process of trying to achieve something or prevent something","example[30]":"You’ll have a fight on your hands (=it will be difficult) to convince the committee.","example[31]":"the fight for justice and democracy","example[32]":"The little girl lost her fight for life (=fight to stay alive) last night.","example[33]":"the fight against crime","example[34]":"the fight to get financial aid","signpost[8]":"argument","definition[11]":"an argument","example[35]":"They’ve had a fight with the neighbours.","example[36]":"fights over money","signpost[9]":"boxing","definition[12]":"a boxing match","example[37]":"Are you going to watch the big fight tonight?","signpost[10]":"battle","definition[13]":"a battle between two armies","example[38]":"the fight for Bunker Hill","signpost[11]":"energy","definition[14]":"energy or the desire to keep fighting for something you want","example[39]":"There’s plenty of fight left in your grandmother.","collocation[0]":"have a fight","example[40]":"I didn’t want to have a fight with him.","collocation[1]":"get into a fight","example[41]":"The two men got into a fight over a girl.","collocation[2]":"start a fight","example[42]":"They started a fight in the crowded bar.","collocation[3]":"pick a fight","example[43]":"The guy tried to pick a fight with Jack.","collocation[4]":"stop a fight/break up a fight","example[44]":"The police were called in to break up a fight outside a nightclub.","collocation[5]":"win/lose a fight","example[45]":"He always won every fight he was in at school.","collocation[6]":"be spoiling for a fight","example[46]":"The kids went round in gangs, all spoiling for a fight.","collocation[7]":"a fight breaks out/erupts","example[47]":"A fight broke out and one man was struck on the head.","collocation[8]":"a fight takes place","example[48]":"The fight took place outside a nightclub.","form[0]":"ADJECTIVES/NOUN + fight","collocation[9]":"a big fight","example[49]":"They ended up having a big fight in the pub.","collocation[10]":"a fair fight","example[50]":"It was a fair fight, just two on two.","collocation[11]":"a fierce fight","example[51]":"There was a fierce fight with rebel forces and several soldiers were killed.","collocation[12]":"a street fight","example[52]":"There were reports of street fights every night in the local newspaper.","collocation[13]":"a fist fight","example[53]":"A fist fight broke out after the match.","collocation[14]":"a knife/sword fight","example[54]":"There have been several arrests, following knife fights between drunken fans.","collocation[15]":"a title fight","example[55]":"a heavyweight title fight","heading[0]":"when people hit or attack each other","definition[15]":"a situation in which people hit or attack each other because of an argument, or as a sport","example[56]":"He had a fight with an older boy.","example[57]":"the famous fight between Muhammad Ali and George Foreman","definition[16]":"a fight between opposing armies or groups of people","example[58]":"The English king was killed at the Battle of Hastings.","example[59]":"a battle between two rival gangs","display[0]":"scuffle","definition[17]":"a short fight that is not very violent","example[60]":"There was a short scuffle with the police, but no arrests were made.","display[1]":"punch-up","definition[18]":"a fight in which people hit each other because of an argument","example[61]":"The game turned into a punch-up.","display[2]":"brawl","definition[19]":"a noisy fight between a group of people","example[62]":"He was hurt in a drunken brawl.","display[3]":"altercation","definition[20]":"a short noisy argument or fight, especially one that is not serious","example[63]":"There was a brief altercation and someone called the police.","display[4]":"riot","definition[21]":"a fight involving a large number of people, especially people who are protesting about something","example[64]":"The book provoked riots all over Europe.","heading[1]":"when people try to achieve something","definition[22]":"the process in which people try to stop something bad from happening or to improve a situation","example[65]":"Schools have an important part to play in the fight against drugs.","example[66]":"women’s fight for equality","definition[23]":"a fight to change a situation or deal with a problem in society","example[67]":"The battle against racial discrimination is not over.","display[5]":"campaign","definition[24]":"a planned series of actions intended to achieve something","example[68]":"Motoring organizations started a campaign for safer roads.","display[6]":"struggle","definition[25]":"a long, hard fight for freedom, independence, equal rights etc","example[69]":"Nkrumah led the people in their struggle for independence.","display[7]":"crusade","definition[26]":"someone’s fight against something they think is morally wrong","example[70]":"She intends to continue her crusade against sex and violence on TV."}