{"word[0]":"shocked","definition[0]":"feeling surprised and upset by something very unexpected and unpleasant","example[0]":"For a few minutes she stood in shocked silence.","example[1]":"We were too shocked to talk.","example[2]":"She gave him a shocked look.","note[0]":"shocked look/expression/voice etc","example[3]":"I was deeply shocked by Jo’s death.","note[1]":"shocked by","example[4]":"He is shocked at what happened to his son.","note[2]":"shocked at","definition[1]":"very offended because something seems immoral or socially unacceptable","example[5]":"Many people were shocked by the film when it first came out.","example[6]":"They were deeply shocked at her behaviour.","collocation[0]":"deeply/very/really shocked","example[7]":"We are all deeply shocked by what’s happened.","collocation[1]":"quite shocked","example[8]":"I was quite shocked by her appearance.","collocation[2]":"genuinely shocked","example[9]":"Gilbert sounded genuinely shocked.","collocation[3]":"visibly shocked","example[10]":"Yesterday she was visibly shocked by the conditions she witnessed in the camps.","collocation[4]":"shocked silence","example[11]":"There was a moment of shocked silence.","collocation[5]":"shocked surprise","example[12]":"He smiled at Donna’s expression of shocked surprise.","collocation[6]":"seem/look/appear shocked","example[13]":"He glanced at his mother, who looked shocked.","collocation[7]":"sound shocked","example[14]":"\"Of course not!\" he exclaimed, sounding shocked.","example[15]":"I was shocked when I heard what had happened.","example[16]":"We are all deeply shocked by his death.","example[17]":"They seemed shocked at the suggestion.","display[0]":"shaken","definition[2]":"shocked because something very unpleasant or frightening has happened – used when the experience has made you feel weak or nervous","example[18]":"He was badly shaken by the incident.","example[19]":"She looked shaken by the news.","display[1]":"be in a state of shock","definition[3]":"to feel shocked and unable to do normal things","example[20]":"He was uninjured but in a state of shock after the attack.","display[2]":"horrified","definition[4]":"very shocked because something unpleasant or frightening has happened","example[21]":"She was horrified to discover that her son had been taking drugs.","example[22]":"There was a horrified look on his face.","display[3]":"appalled","definition[5]":"very shocked because you think something is very bad","example[23]":"I was appalled by his behaviour.","example[24]":"Emma was appalled at how he’d treated his mother.","display[4]":"traumatized","definition[6]":"so badly shocked that you are affected for a very long time","example[25]":"The children were severely traumatized by years of civil war.","display[5]":"outraged","definition[7]":"extremely shocked and angry","example[26]":"The victim’s family were outraged at the short jail sentence.","display[6]":"devastated","definition[8]":"extremely shocked and sad – used when someone is extremely badly affected by something","example[27]":"Petra was absolutely devastated by the death of her daughter.","display[7]":"stunned","definition[9]":"so shocked that you are unable to do or say anything immediately","example[28]":"He had been stunned by the news of his friend’s sudden death.","display[8]":"dazed","definition[10]":"very shocked and unable to think clearly","example[29]":"He emerged from the wreck of the car, dazed but unhurt.","display[9]":"aghast","example[30]":"She looked aghast at the suggestion."}