{"word[0]":"determination","definition[0]":"the quality of trying to do something even when it is difficult","example[0]":"his dogged determination (=very strong determination) to succeed","example[1]":"Yuri shows great determination to learn English.","note[0]":"determination to do something","definition[1]":"the act of deciding something officially","example[2]":"the determination of government policy","note[1]":"determination of","definition[2]":"the act of finding the exact level, amount, or cause of something","example[3]":"accurate determination of the temperature","collocation[0]":"have determination","example[4]":"To become a professional musician, you need to have a lot of determination.","collocation[1]":"show determination","example[5]":"From a very early age, she showed great determination.","collocation[2]":"something requires determination","example[6]":"Success requires hard work and determination.","collocation[3]":"express your determination to do something","example[7]":"He made a speech expressing his determination to rebuild the economy.","collocation[4]":"underline your determination to do something","example[8]":"The prime minister underlined his determination to keep interest rates high.","collocation[5]":"great determination","example[9]":"She showed great determination to succeed.","collocation[6]":"fierce determination","example[10]":"They fought with fierce determination.","collocation[7]":"dogged/steely/grim determination","example[11]":"As a politician she was known for her dogged determination.","collocation[8]":"sheer determination","example[12]":"He had survived by sheer determination.","collocation[9]":"ruthless determination","example[13]":"the ruthless determination of his business career","collocation[10]":"single-minded determination","example[14]":"Whatever task he undertook was tackled with single-minded determination.","definition[3]":"the quality of continuing to try to do something, even when it is difficult","example[15]":"Bill got where he is today by sheer hard work and determination.","example[16]":"I really admired her determination to live her own life.","display[0]":"willpower","definition[4]":"the ability to control your mind and body in order to achieve something you have decided to do","example[17]":"It takes a lot of willpower to give up smoking.","example[18]":"She made herself get better by sheer willpower, when everyone else had given up hope.","definition[5]":"the determination and energy to succeed, especially in business or work","example[19]":"We’re looking for young people who have drive, initiative, and new ideas.","example[20]":"He’s clever enough, but he lacks drive.","display[1]":"resolve","definition[6]":"a strong determination to succeed in doing something, especially because you are sure that it is a good thing to do","example[21]":"The poverty she saw there strengthened her resolve to do something to help.","example[22]":"The success of a military enterprise depends partly on the resolve of its leaders.","display[2]":"perseverance","definition[7]":"the ability to continue trying to achieve something over a long period in a patient way, even when this is difficult","example[23]":"Reaching this standard of musical skill requires incredible perseverance.","example[24]":"A good teacher should have imagination and perseverance.","display[3]":"ruthlessness","definition[8]":"the quality of being extremely determined to achieve what you want, and not caring if you have to hurt other people to do it","example[25]":"He was a man who pursued his aims with complete ruthlessness.","example[26]":"The revolt was suppressed with total ruthlessness.","display[4]":"tenacity","definition[9]":"the determination to never stop trying to do something, especially when other people try to stop you","example[27]":"He clung to power with a remarkable tenacity.","example[28]":"When fighting cancer, Tsongas showed the same tenacity he displayed in politics."}