{"word[0]":"snap","definition[0]":"to break with a sudden sharp noise, or to make something do this","example[0]":"A twig snapped under my feet.","example[1]":"The wind snapped branches and power lines.","example[2]":"The teacher snapped the chalk in two and gave me a piece.","note[0]":"snap (something) in two/in half","example[3]":"I snapped the ends off the beans and dropped them into a bowl.","note[1]":"snap (something) off (something)","signpost[0]":"move into position","definition[1]":"to move into a particular position suddenly, making a short sharp noise, or to make something move like this","example[4]":"She snapped her briefcase shut.","note[2]":"snap (something) open/shut","example[5]":"The pieces just snap together like this.","note[3]":"snap together/back etc","example[6]":"The policeman snapped the handcuffs around her wrist.","signpost[1]":"say something angrily","definition[2]":"to say something quickly in an angry way","example[7]":"‘What do you want?’ Mike snapped.","example[8]":"He snapped at Walter for no reason.","note[4]":"snap at","signpost[2]":"become angry/anxious etc","definition[3]":"to suddenly stop being able to control your anger, anxiety, or other feelings in a difficult situation","example[9]":"The stress began to get to her, and one morning she just snapped.","example[10]":"Something inside him snapped, and he hit her.","definition[4]":"if an animal such as a dog snaps, it tries to bite you","example[11]":"The dog started snapping at my heels.","definition[5]":"to take a photograph","example[12]":"Dave snapped a picture of me and Sonia.","definition[6]":"to end a series of events – used especially in newspapers","example[13]":"The Rockets snapped a seven-game losing streak by beating Portland.","definition[7]":"a sudden loud sound, especially made by something breaking or closing","example[14]":"He shut the book with a snap.","definition[8]":"a photograph taken quickly and often not very skilfully","synonym[0]":"snapshot","example[15]":"holiday snaps","definition[9]":"a small metal fastener on clothes that works when you press its two parts together","example[16]":"baby clothing with snaps","definition[10]":"a card game in which players put down one card after another and try to be the first to shout ‘Snap!’ when there are two cards that are the same","definition[11]":"used when you see two things that are exactly the same","example[17]":"Hey, snap! My hat’s the same as yours.","definition[12]":"said in the game of snap when two cards that are the same are put down"}