{"word[0]":"luxury","plural[0]":"luxuries","definition[0]":"very great comfort and pleasure, such as you get from expensive food, beautiful houses, cars etc","example[0]":"He was leading a life of luxury in Australia.","example[1]":"The dress is lambswool – pure luxury.","example[2]":"We stayed in a five-star luxury hotel.","note[0]":"luxury hotel/car/home etc","example[3]":"She stole to keep her boyfriend in luxury.","note[1]":"in luxury","definition[1]":"something expensive that you do not need, but you buy for pleasure and enjoyment","opposite[0]":"necessity","example[4]":"luxuries like chocolate and perfume","collocation[0]":"great luxury","example[5]":"She was used to a life of great luxury.","collocation[1]":"pure/sheer luxury","example[6]":"The blouse was satin, and felt like pure luxury.","collocation[2]":"the ultimate luxury","example[7]":"A hot tub in your own back yard is the ultimate luxury.","collocation[3]":"comparative luxury","example[8]":"We were glad to return to the comparative luxury of our tent away from the rain.","form[0]":"luxury + NOUN","collocation[4]":"a luxury hotel/home/apartment","example[9]":"They stayed at luxury hotels during their trip.","collocation[5]":"a luxury car","example[10]":"The manager drove a luxury car.","collocation[6]":"a luxury ship/yacht","example[11]":"He'd booked a holiday on a luxury cruise ship.","collocation[7]":"a luxury holiday","example[12]":"The first prize in the competition is a luxury holiday for two in Jamaica.","collocation[8]":"luxury items/goods","example[13]":"At Christmas we try to afford a few luxury items.","collocation[9]":"live in luxury","example[14]":"While some people live in luxury, most are struggling to find enough money to live on.","collocation[10]":"a life of luxury","example[15]":"It was difficult to give up a life of luxury.","collocation[11]":"the lap of luxury","example[16]":"After camping for a week, my own bed felt like the lap of luxury.","example[17]":"The foreigners lived in the lap of luxury.","collocation[12]":"a touch of luxury","example[18]":"Leather chairs added a touch of luxury to the room.","collocation[13]":"something is the height of luxury","example[19]":"If you want bath time to be the height of luxury, you will be inspired by our latest range of shower accessories.","definition[2]":"something that is expensive and not really necessary but is pleasing and enjoyable","example[20]":"luxuries such as a yacht and gold-plated bathroom fixtures","definition[3]":"a very expensive and large apartment, car etc","example[21]":"Porsche, Saab and BMW are fierce competitors in the luxury car market.","example[22]":"It has switched its major focus to luxury gift items.","definition[4]":"great pleasure and enjoyment from large, beautiful, and expensive cars, houses etc","example[23]":"The days when Americans paid any price for luxury are probably over."}