{"word[0]":"put out","signpost[0]":"fire/cigarette etc","definition[0]":"to make a fire etc stop burning","synonym[0]":"extinguish","example[0]":"The rescue services are still trying to put out the fires.","definition[1]":"to make a light stop working by pressing or turning a button or switch","synonym[1]":"switch off","signpost[1]":"make available","definition[2]":"to put things where people can find and use them","example[1]":"The girls helped her to put out the cups and plates.","definition[3]":"to feel upset or offended","example[2]":"We were a little put out at not being invited to the wedding.","signpost[2]":"make extra work","definition[4]":"to make extra work or cause problems for someone","example[3]":"Mary can’t come to dinner tonight. She hopes it won’t put you out.","definition[5]":"to make an effort to do something that will help someone","example[4]":"They had put themselves out to entertain her during her visit.","signpost[3]":"take outside","definition[6]":"to take something outside your house and leave it there","note[0]":"put the washing out (=put clothes outside to dry)","example[5]":"Remember to put the cat out before you go to bed.","definition[7]":"to push your tongue out of your mouth, especially as a rude sign to someone","definition[8]":"to move your hand etc forward and away from your body","example[6]":"He put out his hand toward her.","signpost[4]":"make unconscious","definition[9]":"to make someone unconscious before a medical operation","definition[10]":"to injure your back","signpost[5]":"produce something","definition[11]":"to broadcast or produce something for people to read or listen to","example[7]":"They put out a half-hour programme on young refugees.","definition[12]":"to try to discover information or opinions by listening to people or watching what is happening","example[8]":"He had already put out feelers with local employers but they hadn’t been interested.","definition[13]":"if a ship puts out, it starts to sail","signpost[6]":"have sex","definition[14]":"if a woman puts out, she has sex with a man","signpost[7]":"baseball","definition[15]":"to prevent a baseball player from running around the bases, for example by catching the ball that they have hit","definition[16]":"upset or offended","example[9]":"She felt put out that she hadn’t been consulted.","definition[17]":"to produce something for sale","example[10]":"A great many people are involved in putting out a newspaper.","definition[18]":"if a company puts out a piece of work, it sends the work to be done by someone who does not work for the company","example[11]":"These days we put out a lot of work to freelancers."}