{"word[0]":"hug","definition[0]":"to put your arms around someone and hold them tightly to show love or friendship","synonym[0]":"embrace","example[0]":"We stood there crying and hugging each other.","example[1]":"She went to her daughter and hugged her tightly.","definition[1]":"to put your arms around yourself","example[2]":"Sarah sat on the floor, hugging her knees.","note[0]":"hug your knees/arms/legs etc","example[3]":"She stood hugging herself against the cold.","note[1]":"hug yourself","definition[2]":"to move along the side, edge, top etc of something, staying very close to it","example[4]":"The small boats hugged the coast.","definition[3]":"if clothes hug your body, they fit closely","example[5]":"a figure-hugging dress","note[2]":"body-/figure-hugging","definition[4]":"to hold something in your arms close to your chest","example[6]":"He was hugging a big pile of books.","explanation[0]":"Hug is a reciprocal verb This type of verb is used when saying that two or more people or things do something that involves both or all of them It does not need to have an object  In this sentence, hug is intransitive and does not have an object","example[7]":"She and her friend hugged","explanation[1]":"In these sentences, hug is transitive","example[8]":"She hugged her friend","example[9]":"She and her friend hugged each other","example[10]":"Mother hugged him and tucked him into bed.","example[11]":"Come here and give me a big hug.","definition[5]":"to put your arms around someone and hold him or her in a caring way. Embrace is more formal than hug","example[12]":"Jason warmly embraced his son.","example[13]":"The two leaders embraced each other.","display[0]":"cuddle","definition[6]":"to put your arms around someone or something as a sign of love, especially a child or a small animal","example[14]":"She sat on a chair, cuddling her daughter.","example[15]":"He cuddled the puppy.","display[1]":"put your arms around somebody","definition[7]":"to hold someone closely to your body, especially to comfort them or show that you love them","example[16]":"The woman put her arms around the sobbing boy.","display[2]":"cradle","definition[8]":"to hold someone very gently in your arms, like you would hold a baby","example[17]":"She held the baby in her arms.","example[18]":"She cradled his head in her hands and kissed him on the forehead","definition[9]":"the action of putting your arms around someone and holding them tightly to show love or friendship","example[19]":"Paul gave me a big hug.","example[20]":"Nesta greeted the visitors with hugs and kisses."}