{"word[0]":"call","example[0]":"She calls her father every couple of days.","example[1]":"I’ll call you soon.","example[2]":"What time did Tony call?","example[3]":"I think we should call a doctor.","note[0]":"call a doctor/the police/a cab etc","example[4]":"I’m gonna call the cops!","explanation[0]":"You call someone on the phone","example[5]":"Call me tomorrow","bad_example[0]":"Call to me tomorrow","explanation[1]":"If you call to  someone, you shout at them to get their attention","example[6]":"He called to the driver to stop","signpost[0]":"describe","definition[0]":"to use a word or name to describe someone or something in a particular way","example[7]":"The other kids used to call me names, but I tried to ignore them.","note[1]":"call somebody names","example[8]":"Are you calling me a liar?","note[2]":"call somebody something","example[9]":"You may call it harmless fun, but I call it pornography.","signpost[1]":"have a name","definition[1]":"to have a particular name or title, or use a particular name or title for someone or something","example[10]":"Our son is called Matthew.","note[3]":"be called something","example[11]":"The arrow that appears on the screen is called a cursor.","example[12]":"My name’s Virginia, but my friends call me Ginny.","example[13]":"Do you want to be called Miss or Ms?","example[14]":"I prefer to be called by my middle name.","note[4]":"call somebody by something","signpost[2]":"give somebody/something a name","definition[2]":"to give someone or something the name they will be known by in the future","example[15]":"What are you going to call the new puppy?","example[16]":"They’ve decided to call the baby Louise.","signpost[3]":"ask/order by speaking","definition[3]":"to ask or order someone to come to you","example[17]":"Peter called the waitress over and ordered a large brandy.","note[5]":"call somebody into/over/across etc","example[18]":"Marcie was called up to the principal’s office.","definition[4]":"to arrange for something to happen at a particular time","example[19]":"The Security Council has called an emergency session to discuss the crisis.","note[6]":"call a meeting/strike/election etc","example[20]":"According to the law, the election must be called within the next two months.","signpost[4]":"say/shout","definition[5]":"to say or shout something loudly so that someone can hear you","example[21]":"I heard someone calling in the distance.","example[22]":"‘I’m coming!’ she called down the stairs.","example[23]":"Sheila was just sneaking out when her mother called her.","example[24]":"She heard him call her name.","example[25]":"The foreman called to the workmen.","note[7]":"call to","signpost[5]":"read names","definition[6]":"to read names or numbers in a loud voice in order to get someone’s attention","example[26]":"When I call your name, go and stand in line.","signpost[6]":"court","definition[7]":"to tell someone that they must answer questions in a law court or in front of an official committee","example[27]":"The prosecution called its next witness.","example[28]":"They were called to give evidence at the trial.","note[8]":"call somebody to do something","explanation[2]":"Call is often passive in this meaning","signpost[7]":"visit","definition[8]":"to stop at a house or other place for a short time to see someone or do something","example[29]":"She called round for a chat.","example[30]":"Let’s call on James on the way home.","note[9]":"call on somebody","example[31]":"I regularly called in at his office for news.","note[10]":"call (in) at something","example[32]":"People often call into the library while they’re out shopping.","note[11]":"call into something","signpost[8]":"trains/ships","definition[9]":"if a train, ship, bus etc calls at a place, it stops there for a short time","example[33]":"This train calls at all stations to Broxbourne.","signpost[9]":"coin","definition[10]":"to guess which side of a coin will land upwards when it is thrown in the air, in order to decide who will play first in a game","example[34]":"It’s your turn to call.","signpost[10]":"card game","definition[11]":"to risk the same amount of money as the player who plays before you in a poker game","heading[0]":"– Meaning 1: to telephone someone","form[0]":"call for + NOUN","collocation[0]":"call for an end to something","example[35]":"Demonstrators have called for an end to the fighting.","collocation[1]":"call for somebody’s resignation","example[36]":"Opposition parties called for the president’s resignation.","collocation[2]":"call for action","example[37]":"The European Parliament have called for action on age discrimination.","collocation[3]":"call for a ban","example[38]":"French farmers have called for a ban on imports.","collocation[4]":"call for a boycott","example[39]":"In 1980 he called for a boycott of the Olympic Games.","collocation[5]":"call for a change","example[40]":"Scientists are calling for a change in the law.","collocation[6]":"call for an inquiry/investigation","example[41]":"Relatives have called for an inquiry into the causes of the plane crash.","collocation[7]":"call for a return to something","example[42]":"The prime minister called for a return to traditional Labour values.","collocation[8]":"call for reform","example[43]":"The Church has called for reform of the law.","collocation[9]":"call for the abolition of something","example[44]":"Human Rights groups have called for the abolition of the death penalty.","collocation[10]":"call for a ceasefire","example[45]":"The United Nations called for an immediate ceasefire.","definition[12]":"when you speak to someone on the telephone","example[46]":"It’s cheaper to make calls after 6 pm.","example[47]":"I’ll give you a call at the weekend.","example[48]":"Were there any phone calls for me while I was out?","note[12]":"call for","example[49]":"I received a call from an old friend last week.","note[13]":"call from","signpost[11]":"shout/cry","definition[13]":"a loud sound that a bird or animal makes","example[50]":"the call of an owl","note[14]":"call of","definition[14]":"a shout that you make to get someone’s attention","definition[15]":"a visit, especially for a particular reason","note[15]":"pay/make a call (on somebody) (=visit someone)","example[51]":"Sorry, Doctor Pugh is out on a call at the moment.","signpost[12]":"request/order","definition[16]":"a request or order for something or for someone to do something","note[16]":"a call to arms (=an order for people to fight against an enemy)","example[52]":"Members obediently answered the calls for funds.","example[53]":"There have been calls for the secretary to resign.","note[17]":"call for somebody to do something","signpost[13]":"decision","definition[17]":"the decision made by a referee in a sports game","example[54]":"There may have been a few bad calls, but they’re making them for a reason.","note[18]":"make a good/bad call","definition[18]":"a decision","note[19]":"judgment call (=a decision based on your personal judgment of a situation)","example[55]":"Don’t just say what you think I would like. It’s your call.","signpost[14]":"at an airport","definition[19]":"a message announced at an airport that a particular plane will soon leave","example[56]":"This is the last call for flight BA872 to Moscow.","collocation[11]":"make a call","example[57]":"He made a few calls and then went out.","collocation[12]":"give somebody a call","example[58]":"I’ll give him a call later today.","collocation[13]":"get/have a call","example[59]":"At 11 in the evening we got a call from the police.","collocation[14]":"there is/was a call","example[60]":"There was a phone call for you.","collocation[15]":"answer a call","example[61]":"We’re sorry that we cannot answer your call right now.","collocation[16]":"take a call","example[62]":"Monica took the call upstairs.","collocation[17]":"return somebody’s call","example[63]":"I left a message for her but she didn’t return my call.","collocation[18]":"expect a call","example[64]":"She’s expecting a phone call from Matt.","collocation[19]":"transfer a call","example[65]":"The call was transferred to his secretary.","collocation[20]":"put through a call","example[66]":"She asked the switchboard to put the call through.","form[1]":"ADJECTIVES/NOUN + call","collocation[21]":"a phone/telephone call","example[67]":"I had a phone call from Barbara in Australia.","collocation[22]":"a quick call","example[68]":"This is just a quick call to make sure you’re OK.","collocation[23]":"a local call","example[69]":"Local calls are free at weekends.","collocation[24]":"a long-distance call","example[70]":"I’d like to make a long-distance call.","collocation[25]":"an international call","collocation[26]":"a collect call","example[71]":"Can I make a collect call to Florida, please?","collocation[27]":"incoming/outgoing calls","example[72]":"You have to dial 9 first to make an outgoing call.","collocation[28]":"an emergency call","example[73]":"The police normally respond immediately to an emergency call.","collocation[29]":"a hoax call","example[74]":"They received a hoax call warning of a bomb in the building.","collocation[30]":"an anonymous call","example[75]":"The £10,000 demand was made in an anonymous call to his home.","collocation[31]":"a crank call","example[76]":"The heavy breathing sounded like a crank call.","definition[20]":"the use of computers to help people learn foreign languages","example[77]":"She called the airport to ask about flights.","example[78]":"I was told that the office was closed and to call tomorrow.","definition[21]":"to make a telephone call which is paid for by the person you are telephoning","definition[22]":"to arrange for a meeting or an election to happen at a definite time","example[79]":"The company called a shareholders’ meeting to discuss the takeover bid.","definition[23]":"to make a short visit to a person or place in order to do something","example[80]":"If you decide not to go ahead, just return the policy within 15 days. No salesman will call.","definition[24]":"to ask or order someone to come to a place","example[81]":"Mike was called into the manager’s office and told there was no longer a job for him.","note[20]":"call somebody in/into/to","example[82]":"They were called to give evidence before the committee.","definition[25]":"to repay a loan or bond to a lender, usually before it is normally due to be repaid","example[83]":"Interest rates are so low now it’s unlikely the bonds will ever be called.","definition[26]":"an attempt to speak to someone by telephone","example[84]":"Calls cost 36p a minute cheap rate, 48p at all other times.","example[85]":"If you wish to be added to the mailing list, please give me a call on the number above.","example[86]":"Andrew Walker telephoned this morning, and would like you to return his call as soon as possible.","definition[27]":"a request or demand for someone to do something","example[87]":"He made a call for private companies to offer up to 25% of their shares to workers’ co-operatives.","example[88]":"a strike call","definition[28]":"a short visit, especially for a particular reason","example[89]":"I’ll pay a call on our supplier later this week.","definition[29]":"a demand for money that can be made at any time and without warning, especially a demand for a loan to be repaid","example[90]":"There are $200 million in bearer bonds still outstanding, held by people who did not hear about a call.","definition[30]":"if a bank lends money at call or on call, the bank can demand to have it paid back at any time and without warning","synonym[0]":"ON DEMAND","example[91]":"Overdrafts to customers are often granted for a few days or weeks. Some loans to other financial institutions may be loans at call.","definition[31]":"a demand from a company to a shareholder to pay for shares that they have been given","example[92]":"The company is raising £155 million from the first call of 225p a share.","definition[32]":"another name for CALL OPTION (=the right to buy shares etc at a particular price within a specific period of time)","example[93]":"Total options volume was 33,000, with puts at 19,000 outnumbering calls.","definition[33]":"a decision that you have to make yourself","example[94]":"Buy or don’t buy - it’s your call."}