{"word[0]":"selfish","definition[0]":"caring only about yourself and not about other people – used to show disapproval","example[0]":"How can you be so selfish?","example[1]":"selfish behaviour","definition[1]":"thinking only about what you need or want, and not thinking about how other people feel or what other people want – used especially when criticizing a person or their behaviour","example[2]":"Amy, don’t be selfish. Let the others have a turn.","example[3]":"'I’m not doing this for selfish reasons, ' he said.","example[4]":"It was a very selfish thing to do.","display[0]":"egocentric","definition[2]":"believing that what you do and think is the most important thing, and not paying attention to what anyone else thinks or does – used when describing someone’s personality","example[5]":"Teenagers can be highly egocentric, and sometimes find it difficult to see another person’s point of view.","example[6]":"Children start off as self-centred little beings and they do not naturally think of the other person.","display[1]":"egotistical","definition[3]":"believing that you are better or more important than other people","example[7]":"Like many famous writers I’ve met, he was arrogant and egotistical.","example[8]":"He’s just another young player who has gone out of control in the increasingly egotistical world of professional sports.","display[2]":"self-serving","definition[4]":"only thinking of getting advantages for yourself","example[9]":"People’s fears are exaggerated by self-serving politicians.","example[10]":"They described the report as ‘self-serving and contradictory’.","display[3]":"think of nobody but yourself","definition[5]":"to only think of what you want to do, and not consider what other people want – often used when criticizing someone who does this","example[11]":"The trouble with Alan is that he thinks of nobody but himself.","example[12]":"Before I had children, I only thought about myself and what I wanted.","display[4]":"it’s always me me me!","definition[6]":"used when criticizing someone for being selfish","example[13]":"It’s always me, me, me with you and I have had enough. I don’t need this – you’re welcome to yourself, my dear."}