{"word[0]":"cultural","definition[0]":"belonging or relating to a particular society and its way of life","example[0]":"the very real historical and cultural differences between our two societies","example[1]":"the desire to maintain a distinct cultural identity","example[2]":"It is important to look at the political and cultural context in which the novel was written.","example[3]":"people who share the same cultural background","example[4]":"Japan’s unique cultural heritage","note[0]":"cultural heritage/traditions etc","definition[1]":"relating to art, literature, music etc","example[5]":"the city’s rich and varied cultural life","example[6]":"Students need to have time for relaxation and cultural activities, as well as for academic work.","example[7]":"In the later Middle Ages, Prague was an important cultural centre (=a place, usually a big city, where a lot of artistic and musical events happen).","collocation[0]":"cultural heritage","example[8]":"We want to preserve our cultural heritage and pass it on to our children.","collocation[1]":"cultural differences","example[9]":"People must accept each others’ cultural differences.","collocation[2]":"cultural values","example[10]":"the social and cultural values of the western world","collocation[3]":"cultural identity","example[11]":"Children develop a sense of their racial and cultural identity at a young age.","collocation[4]":"cultural diversity","example[12]":"the racial and cultural diversity of British society","collocation[5]":"a cultural context","example[13]":"the cultural context of Europe in the eighteenth century","collocation[6]":"cultural change","example[14]":"These were decades of rapid cultural change.","collocation[7]":"cultural background","example[15]":"people from the same cultural background","collocation[8]":"cultural factors/influences","example[16]":"Research suggests that cultural factors influence scores in intelligence tests.","collocation[9]":"cultural traditions","example[17]":"The ceremony is an important cultural tradition for the tribe."}