{"signpost[0]":"air","definition[0]":"moving air, especially when it moves strongly or quickly in a current","example[0]":"The wind blew from the northeast.","example[1]":"Planes were unable to take off because of high winds.","signpost[1]":"breath","definition[1]":"your ability to breathe normally","note[0]":"knock the wind out of somebody (=hit someone in the stomach so that they cannot breathe for a moment)","signpost[2]":"in your stomach","definition[2]":"the condition of having air or gas in your stomach or intestines, or the air or gas itself","example[2]":"I can’t drink beer – it gives me wind.","example[3]":"‘What’s wrong with the baby?’ ‘Just a little wind.’","definition[3]":"talk that does not mean anything","example[4]":"The wind was so strong he could hardly stand.","collocation[0]":"light/gentle","example[5]":"Winds tomorrow will be light.","collocation[1]":"high winds","example[6]":"High winds are making driving conditions difficult.","collocation[2]":"a cold/chill wind","example[7]":"There was a cold wind this afternoon.","collocation[3]":"an icy/biting/bitter wind","example[8]":"She shivered in the icy wind.","collocation[4]":"a gusty/blustery wind","example[9]":"A blustery wind was sending light flurries of rain against the window.","collocation[5]":"a fresh wind","example[10]":"It will feel colder in places exposed to a fresh northeasterly wind.","collocation[6]":"a 20-/40-mile-an-hour wind","example[11]":"The walkers struggled in 35-mile-an-hour winds.","collocation[7]":"gale force/hurricane force winds","example[12]":"He was buffeted by the gale force winds.","collocation[8]":"the north/south etc wind","example[13]":"They sought shelter from the north wind.","collocation[9]":"a northerly/southerly etc wind","example[14]":"A fresh northerly wind was speeding the ship southwards.","collocation[10]":"the prevailing wind","example[15]":"The prevailing wind comes from the west.","collocation[11]":"the wind blows","example[16]":"A cold wind was blowing.","collocation[12]":"the wind picks up","example[17]":"The rain beat down and the wind was picking up.","collocation[13]":"the wind drops/dies down","example[18]":"The wind had dropped a little.","collocation[14]":"the wind howls","example[19]":"The wind howled round the house all night.","collocation[15]":"the wind changes","example[20]":"The wind had to change before his fighting ships could sail against the Spanish.","collocation[16]":"a gust of wind","example[21]":"A gust of wind rattled the window.","collocation[17]":"be blowing/swaying/flapping etc in the wind","example[22]":"The trees were all swaying in the wind.","form[0]":"wind + NOUN","collocation[18]":"wind speed","example[23]":"Wind speeds of up to 80 miles an hour were recorded.","definition[4]":"air moving in a current, especially strongly or quickly","example[24]":"A cold wind was blowing from the east.","example[25]":"Strong winds caused damage to many buildings.","display[0]":"breeze","definition[5]":"a gentle pleasant wind","example[26]":"The trees were moving gently in the breeze.","example[27]":"A slight breeze ruffled her hair.","display[1]":"draught","definition[6]":"a current of cool air which blows into a room, especially one that makes you feel uncomfortable","example[28]":"There’s a bit of a draught in here – can you close the door?","heading[0]":"a strong wind","display[2]":"gale","definition[7]":"a very strong wind","example[29]":"The ship was blown off course in a severe gale.","example[30]":"Howling gales and torrential rain continued throughout the night.","display[3]":"hurricane","definition[8]":"a storm that has very strong fast winds and that moves over water – used about storms in the North Atlantic Ocean","example[31]":"The hurricane devastated Florida and killed at least 40 people.","display[4]":"typhoon","definition[9]":"a violent tropical storm – used about storms in the Western Pacific Ocean","example[32]":"A typhoon has hit the Philippines, lifting roofs off houses and uprooting trees.","display[5]":"tornado","definition[10]":"a violent storm with strong winds that spin very quickly in a circle, often forming a cloud that is narrower at the bottom than the top","example[33]":"The town was hit by a tornado that damaged several homes.","display[6]":"cyclone","definition[11]":"a violent tropical storm with strong winds that spin in a circle","example[34]":"A devastating cyclone struck Bangladesh in April that year.","example[35]":"This cyclone was traveling at speeds in excess of 21 miles per hour.","definition[12]":"to turn or twist something several times around something else","example[36]":"The hair is divided into sections and wound around heated rods.","note[1]":"wind something around/round something","definition[13]":"to turn part of a machine around several times, in order to make it move or start working","example[37]":"Did you remember to wind the clock?","definition[14]":"if a road, river etc winds somewhere, it has many smooth bends and is usually very long","example[38]":"a winding path","example[39]":"Highway 99 winds its way along the coast.","note[2]":"wind (its way) through/along etc something","definition[15]":"to make a tape move in a machine","example[40]":"Can you wind the video back a little way – I want to see that bit again.","note[3]":"wind something forward/back","past_tense[0]":"winded","definition[16]":"to make someone have difficulty breathing, as a result of falling on something or being hit","example[41]":"The fall winded him and he lay still for a moment."}