{"word[0]":"security","signpost[0]":"protection from danger","definition[0]":"things that are done to keep a person, building, or country safe from danger or crime","example[0]":"The trial was held under tight security.","example[1]":"lax security at airline check-in desks","example[2]":"terrorist activity that is a threat to national security","example[3]":"The prison was ordered to tighten security after a prisoner escaped yesterday.","example[4]":"The Security Commission investigates breaches of security.","example[5]":"We have been asked not to say anything for security reasons.","example[6]":"The security forces opened fire, killing two people.","example[7]":"The thief was caught on a security camera.","example[8]":"There are strict security checks on everyone entering the Opera House.","example[9]":"A large number of homes lack adequate security measures.","signpost[1]":"protection from bad situations","definition[1]":"protection from bad things that could happen to you","opposite[0]":"insecurity","example[10]":"Parenting is about giving your child security and love.","example[11]":"Workers want greater job security (=not being in danger of losing their jobs).","example[12]":"This insurance plan offers your family financial security in the event of your death.","signpost[2]":"guards","definition[2]":"the department of a company or organization that deals with the protection of its buildings and equipment","example[13]":"One of the sales clerks called security.","signpost[3]":"borrowing money","definition[3]":"something such as property that you promise to give someone if you cannot pay back money you have borrowed from them","example[14]":"Reiss used his Brooklyn home as security for the loan.","note[0]":"security for","collocation[0]":"tight/strict","example[15]":"The event passed off peacefully, amid tight security.","collocation[1]":"lax","example[16]":"The prime minister denied that border security had been lax.","collocation[2]":"heightened security","example[17]":"There is heightened security around Heathrow following the bomb threats.","collocation[3]":"national/state security","example[18]":"Did the article contain any information that is damaging to national security?","collocation[4]":"personal security","example[19]":"The department is responsible for the president’s personal security.","collocation[5]":"improve/tighten security","example[20]":"Mexico has tightened security along its southern border.","form[0]":"security + NOUN","collocation[6]":"the security services/forces","example[21]":"Clashes with the security forces continued.","collocation[7]":"security measures/arrangements","example[22]":"Residents have been warned to take extra security measures following a spate of burglaries.","collocation[8]":"a security check","example[23]":"There are security checks at the entrance to the courtrooms.","collocation[9]":"a security guard","example[24]":"There are armed security guards outside the palace.","collocation[10]":"security staff","example[25]":"Teams of security staff guard the laboratory.","collocation[11]":"a security camera","example[26]":"A car park security camera captured the attack.","collocation[12]":"a security system","example[27]":"The first stage would be to install security systems and adequate lighting in churches.","collocation[13]":"a security risk","example[28]":"His presence in the area posed a significant security risk.","collocation[14]":"for security reasons","example[29]":"He can’t be identified for security reasons.","collocation[15]":"a breach of security","example[30]":"There was a serious breach of security at the prison last Friday.","plural[0]":"securities","definition[4]":"actions to keep someone or something safe from being damaged, stolen etc","example[31]":"We spend roughly as much on security as on sales promotion.","example[32]":"On April 29th, a security alert shut down the London Stock Exchange.","example[33]":"teams of professional security guards","definition[5]":"a feeling of being safe and free from worry about what might happen","example[34]":"Job security (=being confident that you are unlikely to lose your job) is the main issue in the dispute.","example[35]":"Many Koreans like thefinancial security of working for big companies.","definition[6]":"property or other assets that you promise to give someone if you cannot pay back the money that you owe them","example[36]":"The bank offers its customers flexible borrowing, usually without security.","example[37]":"His parents have pledged (=promised) their homes as security so that he can obtain finance for his new business.","definition[7]":"a financial investment such as a bond or share etc, or the related CERTIFICATE showing who owns it","example[38]":"Numbers showed that investment in foreign securities slowed in November.","example[39]":"Securities firms outside the EU often operate under different rules.","example[40]":"Almost every country with a developedsecurities market has some form of controls outlawing insider dealing."}