{"word[0]":"dismiss","definition[0]":"to refuse to consider someone’s idea, opinion etc, because you think it is not serious, true, or important","example[0]":"The government has dismissed criticisms that the country’s health policy is a mess.","example[1]":"It’s an idea that shouldn’t be dismissed out of hand  (=dismissed immediately and completely).","example[2]":"He just laughed and dismissed my proposal as unrealistic.","note[0]":"dismiss something as something","definition[1]":"to remove someone from their job","example[3]":"Bryant was unfairly dismissed from his post.","note[1]":"dismiss somebody from something","example[4]":"Employees can be dismissed for sending obscene emails.","note[2]":"dismiss somebody for something","explanation[0]":"In everyday British English, people usually say sack someone, and in everyday American English, people usually say fire someone, rather than use dismiss:","example[5]":"He was sacked  (British English)/fired (American English) for being late all the time.","definition[2]":"to tell someone that they are allowed to go, or are no longer needed","example[6]":"The class was dismissed early today.","definition[3]":"if a judge dismisses a court case, he or she stops it from continuing","example[7]":"The case was dismissed owing to lack of evidence.","definition[4]":"to end the innings of a player or team in the game of cricket","collocation[0]":"dismiss an idea/suggestion","example[8]":"Both actors dismissed any idea of a romantic relationship between them.","collocation[1]":"dismiss a notion","example[9]":"The Minister dismissed the notion that he had cut petrol tax because of the forthcoming by-election.","collocation[2]":"dismiss a possibility","example[10]":"The prime minister dismissed the possibility of an early election.","collocation[3]":"dismiss a claim","example[11]":"An industrial tribunal dismissed his claim of unfair discrimination.","collocation[4]":"dismiss an allegation/charge","example[12]":"She claimed that she was honest and dismissed the allegations against her.","collocation[5]":"dismiss a thought","example[13]":"Was he lying? I tried to dismiss the thought.","collocation[6]":"dismiss fears","example[14]":"The Transport Minister dismissed fears that the Cotswold railway line would close.","collocation[7]":"dismiss criticism","example[15]":"He dismissed criticism of the country's human rights record.","collocation[8]":"easily/lightly","example[16]":"This is a question that cannot be dismissed lightly.","collocation[9]":"dismiss something out of hand","example[17]":"It's an interesting idea so don't dismiss it out of hand.","definition[5]":"to remove someone from their job, usually because they have done something wrong","example[18]":"He was dismissed from his job at a bank for repeatedly turning up to work late.","definition[6]":"to state officially that a court case cannot continue because there is not enough evidence against the accused person","example[19]":"The prosecution offered no evidence and the case was dismissed."}