{"definition[0]":"to organize or make plans for something such as a meeting, party, or trip","example[0]":"Contact your local branch to arrange an appointment.","example[1]":"I’d like to arrange a business loan.","example[2]":"Matthew arrived at 2 o'clock as arranged.","example[3]":"Have you arranged to meet Mark this weekend?","note[0]":"arrange to do something","example[4]":"Beth arranged a meeting with the marketing director.","note[1]":"arrange something with somebody","example[5]":"We still have to arrange how to get home.","note[2]":"arrange when/where/how etc","example[6]":"We had arranged that I would go for the weekend.","note[3]":"arrange that","definition[1]":"to make it possible for someone to have or do something","example[7]":"The company will arrange for a taxi to meet you at the airport.","note[4]":"arrange for something","example[8]":"Dave arranged for someone to drive him home.","note[5]":"arrange for somebody to do something","definition[2]":"to put a group of things or people in a particular order or position","example[9]":"Ben arranged the flowers in a vase.","example[10]":"The list is arranged alphabetically.","example[11]":"The children were arranged in lines according to height.","note[6]":"arrange something in pairs/groups etc","definition[3]":"to write or change a piece of music so that it is suitable for a particular instrument","example[12]":"a symphony arranged for the piano","note[7]":"arrange something for something","heading[0]":"to put in order","definition[4]":"to put things in a particular order or position","example[13]":"I like the way you’ve arranged the room.","example[14]":"a group of numbers arranged in any order","display[0]":"organize","definition[5]":"to arrange things in order according to a system, so that they are more effective or easier to use","example[15]":"The book is organized into three sections.","example[16]":"How is the equipment organized?","definition[6]":"to arrange a group of things so that one comes after the other in a particular order","example[17]":"The books are ordered according to title.","display[1]":"classify","definition[7]":"to arrange things in groups, and give each group a title","example[18]":"The towns were classified according to population size.","display[2]":"set out","definition[8]":"to arrange a group of things on the floor, on a table, on a shelf etc, ready to be used","example[19]":"If we set out the chairs now, they’ll be ready for tonight’s meeting.","display[3]":"be laid out","definition[9]":"to be arranged according to a particular plan – used especially about cities, buildings, and pages","example[20]":"Kyoto is laid out according to a grid system.","heading[1]":"to arrange to do something","example[21]":"He had arranged to meet Marcia outside the restaurant.","example[22]":"The company arranges skiing trips.","display[4]":"fix/fix up","definition[10]":"to arrange something, especially for someone else","example[23]":"John had fixed up for me to give a talk.","example[24]":"I’ve fixed an appointment for you at the doctor’s.","definition[11]":"to make the arrangements for an event, especially a big public event","example[25]":"They had organized a protest against the war.","display[5]":"set a time/date","definition[12]":"to arrange for something to happen at a particular time or on a particular day","example[26]":"Have you set a date for the wedding yet?","example[27]":"We fixed a time for me to visit.","display[6]":"reserve/book","definition[13]":"to arrange to stay in a place, go to a theatre, travel on a plane etc","example[28]":"I’ve booked the flight to Zurich.","example[29]":"He had reserved a table at the restaurant.","display[7]":"take care of/make the arrangements","definition[14]":"to arrange all the details of an event","example[30]":"Uncle James is making all the funeral arrangements."}