{"word[0]":"fold","signpost[0]":"bend","definition[0]":"to bend a piece of paper, cloth etc by laying or pressing one part over another","example[0]":"Fold the paper along the dotted line.","example[1]":"It’ll fit in if you fold it in half.","example[2]":"Spoon the filling onto the dough, fold it over, and press down the edges.","note[0]":"fold something over/under/down etc","signpost[1]":"smaller/neater","definition[1]":"to fold something several times so that it makes a small neat shape","example[3]":"I wish you kids would fold up your clothes!","example[4]":"He folded the map neatly.","signpost[2]":"furniture etc","definition[2]":"if something such as a piece of furniture folds, or you fold it, you make it smaller or move it to a different position by bending it","example[5]":"The chairs fold flat for storage.","example[6]":"a useful little bed that folds away when you don’t need it","note[1]":"fold (something) away/up/down etc","example[7]":"Can you fold the shutters back?","definition[3]":"if an organization folds, it closes because it does not have enough money to continue","signpost[3]":"cover","definition[4]":"to cover something, especially by wrapping it in material or putting your hand over it","example[8]":"a silver dagger folded in a piece of white cloth","note[2]":"fold something in something","definition[5]":"a line made in paper or material when you fold one part of it over another","example[9]":"Bend back the card and cut along the fold.","signpost[4]":"skin/material","definition[6]":"the folds in material, skin etc are the loose parts that hang over other parts of it","example[10]":"Her dress hung in soft folds.","signpost[5]":"sheep","definition[7]":"a small area of a field surrounded by a wall or fence where sheep are kept for safety","synonym[0]":"pen","definition[8]":"a bend in layers of rock, caused by underground movements in the earth","definition[9]":"of a particular number of kinds","example[11]":"The government’s role in health care is twofold: first, to provide the resources and, second, to make them work better for patients.","type[0]":"in adverbs","definition[10]":"a particular number of times","example[12]":"The value of the house has increased fourfold  (=it is now worth four times as much as before).","definition[11]":"if a business folds or folds up, it stops operating or trading because it does not have enough money to continue","example[13]":"The U.K. engineering firm has folded today with the loss of 30 jobs.","example[14]":"His jewellery importing business folded in less than a year.","example[15]":"As the recession deepened, the company folded up.","example[16]":"The value of the house has increased fourfold in the last ten years  (=it is now worth four times as much as it was ten years ago)."}