{"word[0]":"insurance","definition[0]":"an arrangement with a company in which you pay them money, especially regularly, and they pay the costs if something bad happens, for example if you become ill or your car is damaged","note[0]":"health/car/travel etc insurance","example[0]":"Your father took out insurance to cover the mortgage.","example[1]":"We can probably claim the damage on our insurance.","note[1]":"claim (for) something on your insurance","example[2]":"insurance against loss of income due to unemployment","note[2]":"insurance against","example[3]":"Do you have insurance on your house and its contents?","note[3]":"insurance on/for","definition[1]":"the business of providing insurance","example[4]":"My brother works in insurance.","example[5]":"the insurance industry","note[4]":"insurance company/group etc","definition[2]":"the money that you pay regularly to an insurance company","synonym[0]":"insurance premium","example[6]":"How much is the insurance on your car?","note[5]":"insurance on","definition[3]":"protection against something bad happening","example[7]":"An extra lock on the door is an added insurance against burglars.","form[0]":"ADJECTIVES/NOUN + insurance","collocation[0]":"health/medical insurance","example[8]":"None of her family have private health insurance.","collocation[1]":"travel insurance","example[9]":"Most banks are also able to arrange travel insurance.","collocation[2]":"car/motor insurance","example[10]":"He was fined for driving without motor insurance.","collocation[3]":"house/home insurance","example[11]":"The damage may be covered by your house insurance.","collocation[4]":"life insurance","example[12]":"Surprisingly few families have adequate life insurance.","collocation[5]":"accident insurance","example[13]":"You also get free travel accident insurance if you pay for your tickets with a credit card.","collocation[6]":"comprehensive insurance","example[14]":"The cost of comprehensive insurance is likely to drop.","collocation[7]":"third-party insurance","example[15]":"You are legally obliged to take out third-party insurance.","form[1]":"insurance + NOUN","collocation[8]":"an insurance policy","example[16]":"This insurance policy represents excellent value for money.","collocation[9]":"an insurance claim","example[17]":"She filed an insurance claim for the missing jewellery.","collocation[10]":"an insurance company","example[18]":"Rachel works for an insurance company.","collocation[11]":"an insurance broker","example[19]":"Bellingham practised as an insurance broker.","collocation[12]":"an insurance scheme","example[20]":"The costs involved in private medical insurance schemes have risen steeply.","collocation[13]":"an insurance premium","example[21]":"Your insurance premium is payable when you make your holiday booking.","collocation[14]":"an insurance payment","example[22]":"He'd fallen behind with his insurance payments.","collocation[15]":"an insurance certificate/a certificate of insurance","example[23]":"The courts recognize the insurance certificate as evidence of being insured.","collocation[16]":"insurance cover","example[24]":"The scheme provides full insurance cover for pre-existing medical conditions.","collocation[17]":"insurance fraud","example[25]":"Insurance fraud costs the industry millions of pounds each year.","collocation[18]":"an insurance salesman","example[26]":"He offered me a post as a life insurance salesman.","example[27]":"The insurance industry is very competitive.","collocation[19]":"have insurance","example[28]":"Do you have insurance on your yacht?","collocation[20]":"be covered by insurance","example[29]":"Flood damage isn't covered by the insurance.","collocation[21]":"take out insurance","example[30]":"We decided to take out insurance on the house and its contents.","collocation[22]":"get insurance","example[31]":"I'm thinking of getting house insurance.","collocation[23]":"buy insurance","example[32]":"You can buy insurance against risks of all kinds.","collocation[24]":"claim something on your insurance","example[33]":"He claimed the money back on his travel insurance.","collocation[25]":"arrange insurance","example[34]":"A finance company will be able to arrange insurance for you.","collocation[26]":"sell insurance","example[35]":"The company sells insurance alongside its electrical products.","collocation[27]":"insurance covers something","example[36]":"The insurance covered the cost of rebuilding the house after the fire.","collocation[28]":"insurance pays for something","example[37]":"His insurance paid for the damage to the car.","definition[4]":"an arrangement in which a company collects PREMIUMs (=regular payments) from a person or organization and in return agrees to pay them a sum of money if they are involved in an accident, have something stolen, or cause harm or injury to others. The four main classes of insurance are ACCIDENT, LIFE, FIRE, and MARINE INSURANCE","example[38]":"Insurance is the only major financial service regulated by states, rather than the federal government.","example[39]":"The insurance covers you against injury to visitors while on your property.","example[40]":"The company has taken out insurance to indemnify its directors against liability when acting for the Group.","example[41]":"Can you claim on your household insurance if your bike is stolen?","example[42]":"Insurance against stealing by employees is a multi-billion dollar expense.","definition[5]":"the money paid regularly to an insurance company","synonym[1]":"INSURANCE PREMIUM","example[43]":"We have paid home insurance for the last 25 years and have never made a claim.","definition[6]":"shares in insurance companies","example[44]":"Mining stocks advanced and insurances also did well."}