{"word[0]":"carry  something ↔ out","definition[0]":"to do something that needs to be organized and planned","example[0]":"We need to carry out more research.","example[1]":"A survey is now being carried out nationwide.","example[2]":"Turn off the water supply before carrying out repairs.","explanation[0]":"In written English, people often use conduct  when writing about research, experiments etc, because this sounds more formal than carry out:","example[3]":"They conducted experiments to test this theory.","definition[1]":"to do something that you have said you will do or that someone has asked you to do","example[4]":"Nicholson didn’t carry out his threat to take legal action.","example[5]":"We carried out her instructions precisely.","example[6]":"Will the government carry out its promise to reform the law?","collocation[0]":"carry out work","example[7]":"You’ll have to get a builder to carry out the work.","collocation[1]":"carry out your duties/responsibilities","example[8]":"She carried out her duties very efficiently.","collocation[2]":"carry out a task/job","example[9]":"He was unable to carry out simple tasks.","collocation[3]":"carry out research","example[10]":"I was in Italy carrying out research for my book.","collocation[4]":"carry out a survey","example[11]":"The committee has carried out a survey of parking problems in residential areas.","collocation[5]":"carry out a check","example[12]":"Manufacturers carry out safety checks on all new cars.","collocation[6]":"carry out a test","example[13]":"Forensic experts are now carrying out DNA tests.","collocation[7]":"carry out an experiment","example[14]":"Many schools need better facilities for carrying out scientific experiments.","collocation[8]":"carry out a review","example[15]":"The government is carrying out a review of state pension provision.","collocation[9]":"carry out a study","example[16]":"He has carried out various studies into violent behaviour.","collocation[10]":"carry out an investigation","example[17]":"The police will carry out an investigation into what actually happened.","collocation[11]":"carry out an inquiry","example[18]":"A formal inquiry into the cause of death will be carried out.","collocation[12]":"carry out an assessment","example[19]":"The company is carrying out an assessment of staff training needs.","collocation[13]":"carry out a search","example[20]":"Here are some more ways of carrying out information searches online.","collocation[14]":"carry out an attack","example[21]":"It became clear that terrorists had carried out the attack.","definition[2]":"food that you can take away from a restaurant to eat somewhere else, or a restaurant that sells food like this"}