{"word[0]":"stream","signpost[0]":"small river","definition[0]":"a natural flow of water that moves across the land and is narrower than a river","signpost[1]":"continuous series","definition[1]":"a long and almost continuous series of events, people, objects etc","example[0]":"A steady stream of visitors came to the house.","note[0]":"steady/constant/endless etc stream","example[1]":"a stream of traffic","note[1]":"stream of","example[2]":"a stream of abuse","signpost[2]":"air/water","definition[2]":"a flow of water, air, smoke etc, or the direction in which it is flowing","example[3]":"A stream of cold air rushed through the open door.","definition[3]":"a level of ability within a group of students of the same age","example[4]":"Kim’s in the top stream.","definition[4]":"to flow quickly and in great amounts","example[5]":"Water came streaming out of the burst pipe.","note[2]":"stream out/from/onto etc","example[6]":"Tears streamed down her cheeks.","signpost[3]":"flow","definition[5]":"to move in a continuous flow in the same direction","example[7]":"People streamed past us on all sides.","note[3]":"stream out/across/past etc","signpost[4]":"give out liquid","definition[6]":"to produce a continuous flow of liquid","note[4]":"streaming cold British English (=an illness in which a lot of liquid comes out of your nose)","example[8]":"When I got up, my face was streaming with blood.","note[5]":"stream with","definition[7]":"if light streams somewhere, it shines through an opening into a place or onto a surface","example[9]":"The first rays of morning sunlight streamed through the open doorway.","note[6]":"stream in/through/from etc","type[0]":"intransitive always + adverb/preposition, usually in progressive","signpost[5]":"move freely","definition[8]":"to move freely in a current of wind or water","example[10]":"Elise ran, her hair streaming out behind her.","note[7]":"stream in/out/behind etc","definition[9]":"if you stream sound or video, you play it on your computer while it is being downloaded from the Internet, rather than saving it as a file and then playing it","definition[10]":"to put school children in groups according to their ability","definition[11]":"a long and almost continuous series of things","example[11]":"Despite the steady stream of layoffs, federal statisticians are predicting growth in select industries.","example[12]":"The refinery will come on stream (=start producing a stream of oil) next year.","definition[12]":"regular amounts of money coming into a company or organization from a particular activity or source, especially over a long period of time","example[13]":"The city will get an income stream from property and income taxes paid by the new owners.","example[14]":"The new products account for more than 80% of the company’s revenue stream."}