{"word[0]":"stroke","definition[0]":"if someone has a stroke, an artery (=tube carrying blood) in their brain suddenly bursts or becomes blocked, so that they may die or be unable to use some muscles","example[0]":"She died following a massive stroke.","example[1]":"a stroke patient","example[2]":"I looked after my father after he had a stroke.","note[0]":"have/suffer a stroke","signpost[0]":"swimming/rowing","definition[1]":"one of a set of movements in swimming or rowing in which you move your arms or the oar forward and then back","example[3]":"She swam with strong steady strokes.","definition[2]":"a style of swimming or rowing","example[4]":"the breast stroke","definition[3]":"the action of hitting the ball in games such as tennis, golf, and cricket","example[5]":"a backhand stroke","signpost[1]":"pen/brush","definition[4]":"a single movement of a pen or brush when you are writing or painting","example[6]":"A few strokes of her pen brought out his features clearly.","definition[5]":"a line made by a pen or brush","example[7]":"the thick downward strokes of the characters","definition[6]":"an action of hitting someone with something such as a whip or thin stick","example[8]":"He cried out at each stroke of the whip.","signpost[2]":"a movement of your hand","definition[7]":"a gentle movement of your hand over something","example[9]":"I gave her hair a gentle stroke.","signpost[3]":"clock/bell","definition[8]":"a single sound made by a clock giving the hours, or by a bell, gong etc","signpost[4]":"in numbers","definition[9]":"used when you are saying a number written with the mark (/) in it","synonym[0]":"slash","example[10]":"The serial number is seventeen stroke one (=17/1).","example[11]":"My father had a stroke.","collocation[0]":"a stroke leaves somebody paralysed","example[12]":"Two years later she had a stroke which left her paralysed.","collocation[1]":"a massive/major stroke","example[13]":"Her brother has just died of a massive stroke.","collocation[2]":"a minor/mild stroke","example[14]":"She had a minor stroke five years ago.","collocation[3]":"a fatal stroke","example[15]":"He suffered a fatal stroke in April.","form[0]":"stroke + NOUN","collocation[4]":"a stroke patient/victim","example[16]":"Some stroke victims recover fully.","definition[10]":"to move your hand gently over something","example[17]":"He reached out and stroked her cheek tenderly.","definition[11]":"to move something somewhere with gentle movements of your hand","example[18]":"He lifted her face and stroked her hair from her eyes.","definition[12]":"to hit or kick a ball with a smooth movement in games such as tennis, golf, and cricket","example[19]":"He stroked the ball into an empty net, with a minute to go."}