{"word[0]":"inspection","definition[0]":"an official visit to a building or organization to check that everything is satisfactory and that rules are being obeyed","note[0]":"tour of inspection (=an official visit to inspect something)","example[0]":"An inspection was carried out at the school.","example[1]":"regular inspections of the prison","note[1]":"inspection of","definition[1]":"a careful examination of something to find out more about it or to check for anything wrong","example[2]":"However, on closer inspection, a number of problems emerged.","note[2]":"(on) close/closer inspection","example[3]":"Close inspection of the plane’s engines revealed several small defects.","example[4]":"Copies of the documents are available for inspection  (=people can look at them) at local libraries.","note[3]":"for inspection","form[0]":"ADJECTIVES/NOUN + inspection","collocation[0]":"a careful/detailed inspection","example[5]":"The architect has now made his detailed inspection of the building.","collocation[1]":"a full inspection","example[6]":"A full inspection of the site is due to be conducted.","collocation[2]":"a cursory inspection","example[7]":"He made only a cursory inspection of the truck.","collocation[3]":"an official inspection","example[8]":"Preparations were made in advance of the official inspection.","collocation[4]":"a routine inspection","example[9]":"A routine inspection revealed that several lorries were not roadworthy.","collocation[5]":"a daily inspection","example[10]":"A young airman had carried out the daily inspection of the instruments.","collocation[6]":"an annual inspection","example[11]":"The aircraft was due for its annual inspection.","collocation[7]":"regular/frequent inspections","example[12]":"Restaurants are subject to regular health and safety inspections.","collocation[8]":"a safety inspection","example[13]":"A safety inspection was carried out on the boiler system.","collocation[9]":"a school inspection","example[14]":"The arrangements for school inspections have been greatly improved.","collocation[10]":"a weapons inspection","example[15]":"The government has agreed to allow UN weapons inspections in the country.","collocation[11]":"a medical inspection","example[16]":"Schoolchildren had to undergo a compulsory medical inspection.","collocation[12]":"carry out an inspection","example[17]":"Engineers had carried out an inspection on the plane.","collocation[13]":"conduct an inspection","example[18]":"He was conducting an inspection in the factory.","collocation[14]":"do an inspection","example[19]":"We did the inspection last Friday.","collocation[15]":"complete/finish an inspection","example[20]":"The inspection was completed and the relevant forms filled in.","collocation[16]":"pass an inspection","example[21]":"The supermarket can only trade if it passes the cleanliness inspection.","collocation[17]":"fail an inspection","example[22]":"He couldn’t join the army because he failed the medical inspection.","collocation[18]":"an inspection reveals something","example[23]":"The inspection revealed several lapses in safety standards.","form[1]":"inspection + NOUN","collocation[19]":"an inspection visit","example[24]":"To date no inspection visit has been made.","collocation[20]":"a tour of inspection","example[25]":"Morris took off on his tour of inspection.","collocation[21]":"an inspection team","example[26]":"The inspection team described the 1,688 pupil school as ‘outstanding’.","definition[2]":"a visit to a factory or other building to check that everything is satisfactory and all rules are being obeyed","example[27]":"The factory has regular inspections by the Health and Safety Executive.","definition[3]":"an official check done on something to see that it is of the right standard or quality, or whether it is safe to use","example[28]":"The Federal Aviation Administration has ordered inspections of the propeller shafts on all similar planes."}