{"word[0]":"commit","definition[0]":"to do something wrong or illegal","example[0]":"Women commit fewer crimes than men.","example[1]":"Brady committed a series of brutal murders.","note[0]":"commit murder/rape/arson etc","signpost[0]":"say you will do something","definition[1]":"to say that someone will definitely do something or must do something","example[2]":"He has clearly committed his government to continuing down the path of economic reform.","note[1]":"commit somebody to doing something","example[3]":"Meeting them doesn’t commit us to anything.","note[2]":"commit somebody to something","example[4]":"I’d committed myself and there was no turning back.","note[3]":"commit yourself","example[5]":"The banks have committed themselves to boosting profits by slashing costs.","note[4]":"commit yourself to (doing) something","definition[2]":"to give someone your love or support in a serious and permanent way","example[6]":"Anna wants to get married, but Bob’s not sure he wants to commit.","example[7]":"He has not yet committed to any of the candidates.","note[5]":"commit to","signpost[1]":"money/time","definition[3]":"to decide to use money, time, people etc for a particular purpose","example[8]":"A lot of money has been committed to this project.","note[6]":"commit something to something","signpost[2]":"for trial","definition[4]":"to send someone to be tried in a court of law","example[9]":"The two men were committed for trial at Bristol Crown Court.","signpost[3]":"prison/hospital","definition[5]":"to order someone to be put in a hospital or prison","example[10]":"The judge committed him to prison for six months.","collocation[0]":"commit a crime/offence","example[11]":"People who commit crimes end up in jail.","collocation[1]":"commit murder/rape/fraud etc","example[12]":"The couple were accused of committing murder.","collocation[2]":"commit a robbery","example[13]":"She later admitted committing the robbery.","collocation[3]":"commit an act of violence/terrorism/aggression etc","example[14]":"Anyone committing an act of terrorism will be severely punished.","collocation[4]":"commit treason","example[15]":"He was accused of committing treason against the King of England.","collocation[5]":"commit genocide","example[16]":"In some countries, genocide is being committed every day.","collocation[6]":"commit an atrocity","example[17]":"During the civil war both sides committed numerous atrocities.","collocation[7]":"commit a sin","example[18]":"He confessed to having committed the sin of adultery.","past_tense[0]":"committed","example[19]":"He committed his government to support Thailand’s traditional free-market system.","note[7]":"commit somebody to do something","example[20]":"Sorry, I’ve already committed myself to working for Clive.","note[8]":"commit yourself to doing something","example[21]":"She would not want to commit to anything that would last more than a year.","note[9]":"commit to something","example[22]":"A client needs to approve an idea before committing resources to it.","example[23]":"We are confident that we have not committed any fraud."}