{"word[0]":"calendar","definition[0]":"a set of pages that show the days, weeks, and months of a particular year, that you usually hang on a wall","definition[1]":"a book with separate spaces or pages for each day of the year, on which you write down the things you have to do","example[0]":"a desk calendar","definition[2]":"all the things you plan to do in the next days, months etc","example[1]":"an event that deserves a place on your calendar","definition[3]":"a system that divides and measures time in a particular way, usually starting from a particular event","note[0]":"the Roman/Islamic/Gregorian etc calendar","definition[4]":"all the events in a year that are important for a particular organization or activity","example[2]":"The Derby is a major event in the racing calendar.","note[1]":"golfing/sporting/racing etc calendar","definition[5]":"pages showing the days, weeks, and months of a particular year","definition[6]":"a book with separate spaces or pages for each day of the year, where you write down the things you have to do on each day","definition[7]":"all the events or dates in a year that are important for a particular organization, person, or activity","example[3]":"The National Conference is the premier event in the Institute’s calendar.","example[4]":"On today’s economic calendar is the release of the December merchandise trade balance.","definition[8]":"one of the twelve months of the year","example[5]":"Earnings have not exceeded £36,000 in any of the last 12 calendar months.","definition[9]":"a period of time from a certain date to the same date in the next month","example[6]":"Payment terms are one calendar month from date of invoice.","definition[10]":"a period of time from January 1st to December 31st","example[7]":"Italy’s financial year closes at the end of the calendar year.","definition[11]":"the year 2007,2010 etc from January 1st to December 31st","example[8]":"Total domestic automobile demand in calendar 2006 remained largely unchanged."}