{"word[0]":"formal","signpost[0]":"official","definition[0]":"made or done officially or publicly","opposite[0]":"informal","example[0]":"formal recognition of the reformed church","example[1]":"a formal agreement between the countries","example[2]":"There is no formal structure for negotiating pay increases.","example[3]":"Mr Kelly has lodged a formal complaint against the police.","note[0]":"make/lodge a formal complaint","definition[1]":"formal behaviour is very polite, and is used in official or important situations, or with people you do not know well","example[4]":"Over the years, teaching methods have changed and become less formal.","definition[2]":"formal language is used in official or serious situations","example[5]":"‘Yours sincerely’ is a formal way of ending a letter.","signpost[1]":"event/occasion","definition[3]":"a formal event is important, and people who go to it wear special clothes and behave very politely","example[6]":"I’ve met her twice but only on formal occasions.","example[7]":"a formal dinner","definition[4]":"formal dress is clothing such as a tuxedo for men or a long dress for women, that is worn to formal events","opposite[1]":"casual","example[8]":"We insist on formal dress for dinner.","signpost[2]":"organized","definition[5]":"done in a very organized way","example[9]":"The course includes formal lectures.","signpost[3]":"garden/park","definition[6]":"a formal garden, park, or room is arranged in a very organized way","example[10]":"the palace’s beautifully restored formal gardens","definition[7]":"a dance at which you have to wear formal clothes","definition[8]":"an expensive and usually long dress that women wear on formal occasions","definition[9]":"done or given officially and publicly","example[11]":"The companies said they expect to sign a formal agreement before year’s end.","example[12]":"No formal announcement has yet been made.","example[13]":"The British authorities have decided to launch a formal investigation into the company’s trading practices."}