{"word[0]":"dramatic","definition[0]":"great and sudden","example[0]":"Computers have brought dramatic changes to the workplace.","note[0]":"dramatic change/shift/improvement","example[1]":"Universities have suffered a dramatic drop in student numbers.","note[1]":"dramatic increase/rise/fall/drop/reduction etc","example[2]":"A serious accident can have a dramatic effect on your family’s finances.","note[2]":"dramatic effect/results","definition[1]":"exciting or impressive","example[3]":"A superb goal by Owen earned United a dramatic victory yesterday.","example[4]":"Some of the most dramatic events in American history happened here.","example[5]":"the dramatic scenery of the Grand Canyon","definition[2]":"connected with acting or plays","example[6]":"the amateur dramatic society","example[7]":"the dramatic arts","definition[3]":"intended to be impressive, so that people notice","example[8]":"She needed a stunning dress to help her make a dramatic entrance.","example[9]":"Tristan threw up his hands in a dramatic gesture.","collocation[0]":"a dramatic change","example[10]":"The Internet has brought dramatic changes to the way we work.","collocation[1]":"a dramatic increase/rise","example[11]":"There has been a dramatic rise in fuel costs.","collocation[2]":"a dramatic fall/drop/decline","example[12]":"Between these years there was a dramatic fall in youth employment.","collocation[3]":"a dramatic effect/impact","example[13]":"An accident can have a dramatic effect on your family’s finances.","collocation[4]":"a dramatic improvement","example[14]":"There has been a dramatic improvement in the standard of students’ work.","collocation[5]":"a dramatic shift","example[15]":"This announcement signalled a dramatic shift in the government’s policy.","collocation[6]":"a dramatic result","example[16]":"Cameras on the streets have produced dramatic results in reducing crime.","collocation[7]":"a dramatic difference","example[17]":"The programs made a dramatic difference to the lives of millions of people."}