{"word[0]":"trick","signpost[0]":"something that deceives somebody","definition[0]":"something you do in order to deceive someone","example[0]":"Pretending he doesn’t remember is an old trick of his.","example[1]":"He didn’t really lose his wallet – that’s just a trick.","signpost[1]":"joke","definition[1]":"something you do to surprise someone and to make other people laugh","example[2]":"I’m getting tired of your silly tricks.","example[3]":"The girls were playing tricks on their teacher.","signpost[2]":"something that makes things appear different","definition[2]":"something that makes things appear to be different from the way they really are","example[4]":"After walking for hours in the hot sun, his mind began playing tricks on him.","example[5]":"At first he thought someone was coming towards him, but it was just a trick of the light.","signpost[3]":"magic","definition[3]":"a skilful set of actions that seem like magic, done to entertain people","example[6]":"My uncle was always showing me card tricks when I was a kid.","example[7]":"a magic trick","signpost[4]":"clever method","definition[4]":"a way of doing something that works very well but may not be easy to notice","example[8]":"The trick is to bend your knees as you catch the ball.","example[9]":"a salesman who knew all the tricks of the trade  (=clever methods used in a particular job)","definition[5]":"the cards played or won in one part of a game of cards","example[10]":"He won the first three tricks easily.","definition[6]":"someone who pays a prostitute to have sex","note[0]":"turn a trick (=to have sex with someone for money)","definition[7]":"to deceive someone in order to get something from them or to make them do something","example[11]":"She knew she’d been tricked, but it was too late.","example[12]":"He claimed he was tricked into carrying drugs.","note[1]":"trick somebody into doing something","example[13]":"The corporation was tricked out of $20 million.","note[2]":"trick somebody out of something","example[14]":"He tricked his way into her home by pretending to be a policeman.","note[3]":"trick your way into/past/onto etc something"}