{"comparative[0]":"softer","superlative[0]":"softest","signpost[0]":"not hard","definition[0]":"not hard, firm, or stiff, but easy to press","example[0]":"My feet sank into the soft ground.","example[1]":"the softest sofa and pillows","example[2]":"Cook the onions until they go soft.","definition[1]":"less hard than average","example[3]":"a soft lead pencil","example[4]":"soft cheese","signpost[1]":"not rough","definition[2]":"having a surface that is smooth and pleasant to touch","example[5]":"a baby’s soft skin","example[6]":"The fur was soft to the touch.","signpost[2]":"not loud","definition[3]":"a soft sound or voice, or soft music, is quiet and pleasant to listen to","opposite[0]":"loud","example[7]":"soft music","example[8]":"His voice was softer now.","signpost[3]":"colour/light","definition[4]":"soft colours or lights are pleasant and relaxing because they are not too bright","example[9]":"All the stores will be re-fitted with softer lighting.","example[10]":"a soft shade of peach","signpost[4]":"no hard edges","definition[5]":"not having any hard edges or sharp angles","example[11]":"soft curves","signpost[5]":"rain/wind","definition[6]":"gentle and without much force","example[12]":"a soft breeze","example[13]":"soft rain","signpost[6]":"not strict","definition[7]":"someone who is soft seems weak because they are not strict enough with other people","opposite[1]":"strict","example[14]":"If you appear to be soft, people take advantage of you.","example[15]":"Courts have been taking a soft line (=not being strict enough) with young offenders.","example[16]":"No politician wants to seem soft on crime.","note[0]":"soft on","signpost[7]":"sensitive","definition[8]":"kind, gentle, and sympathetic to other people","example[17]":"He has a soft heart beneath that cold exterior.","example[18]":"a soft kiss","signpost[8]":"weak character","definition[9]":"not very brave and not having a strong character","example[19]":"Don’t be soft – just jump!","signpost[9]":"sales/markets","definition[10]":"decreasing in price, value, or the amount sold","example[20]":"soft oil prices","signpost[10]":"too easy","definition[11]":"a soft job, life etc is too easy and does not involve much work or hard physical work","example[21]":"Mike’s found himself a soft job in the stores.","example[22]":"Taking the soft option won’t help your career to develop.","note[1]":"soft option","signpost[11]":"weak body","definition[12]":"having a body that is not in a strong physical condition, because you do not do enough exercise","example[23]":"He’d got soft after all those years in a desk job.","definition[13]":"soft water does not contain many minerals, so that it forms bubbles from soap easily","definition[14]":"stupid or silly","example[24]":"You must be soft if you think I’ll give you fifty quid!","signpost[12]":"consonants","definition[15]":"not sounding hard","example[25]":"a soft g","example[26]":"a soft mattress","example[27]":"Her skin was lovely and soft.","example[28]":"soft ground","display[0]":"tender","definition[16]":"used about meat or vegetables that are soft and easy to cut, especially because they have been well cooked","example[29]":"The beef was very tender.","example[30]":"Cook the carrots until tender.","display[1]":"soggy","definition[17]":"very wet and too soft, in a way that seems unpleasant – used about bread, vegetables, and the ground","example[31]":"soggy cabbage","example[32]":"a piece of soggy bread","example[33]":"The ground was too soggy to walk on.","display[2]":"squishy","definition[18]":"soft and easy to press – used especially about fruit that is too soft, and about soft wet ground which makes a noise when you walk on it","example[34]":"squishy tomatoes","example[35]":"The leaves were squishy under our feet.","display[3]":"squashy","definition[19]":"soft and easy to press – used especially about fruit that is too soft, and about chairs that are soft and comfortable","example[36]":"The peaches have gone all squashy.","example[37]":"a big squashy sofa","display[4]":"mushy","definition[20]":"used about fruit or vegetables that are very soft, wet, and unpleasant, because they are not fresh or have been cooked for too long","example[38]":"mushy pieces of banana","example[39]":"a few mushy carrots","display[5]":"spongy","definition[21]":"soft and full of holes that contain air or liquid like a sponge","example[40]":"a spongy foam","example[41]":"a spongy loaf","example[42]":"His boots sank into the spongy soil.","display[6]":"springy","definition[22]":"used about something that is soft and comes back to its normal shape after being pressed or walked on","example[43]":"springy turf  (=grass)","example[44]":"Her hair felt lovely and springy.","display[7]":"pliable","definition[23]":"used about a material or substance that can be bent or pressed without breaking or cracking","example[45]":"The clay was still pliable and not too dry.","display[8]":"yielding","definition[24]":"used about a surface which is soft and will bend when you press it","example[46]":"yielding flesh","definition[25]":"soft goods are used up soon after they are bought, for example food products","example[47]":"Ohio’s manufacturing base covers a wide range of soft and hard goods.","example[48]":"a soft-commodity trader","definition[26]":"soft loans or soft credit is money that is lent at a lower interest rate than normal, usually because it is for a project that is to be encouraged, for example a new business in an area of high unemployment","example[49]":"The fund was authorized to help the market by providing soft loans to institutional investors.","example[50]":"The mills got $73 million in soft credit to keep their gates open.","definition[27]":"a soft market or economy has prices that are falling because supply is greater than demand","example[51]":"How do you sell your house in a soft market?","example[52]":"Our results continue to be adversely affected by a very soft regional economy.","definition[28]":"if sales, orders, demand etc are soft, there are not as many sales, orders etc or as much demand as usual","example[53]":"Many retailers experienced soft sales in May and June.","example[54]":"The newspaper industry was suffering from a very soft demand for ad space."}