{"word[0]":"expenditure","definition[0]":"the total amount of money that a government, organization, or person spends during a particular period of time","example[0]":"huge cuts in public expenditure  (=the amount of money a government spends on services for the public)","example[1]":"government expenditure on education","example[2]":"capital expenditure  (=spending by a company on buildings, machinery, equipment etc)","example[3]":"expenditure on research and development","note[0]":"expenditure on","example[4]":"an expenditure of £1 million","note[1]":"expenditure of","definition[1]":"the action of spending or using time, money, energy etc","example[5]":"the expenditure of time and money on your house or garden","form[0]":"ADJECTIVES/NOUN + expenditure","collocation[0]":"public/government/state expenditure","example[6]":"The Conservatives want to maintain a firm control on public expenditure.","collocation[1]":"national/local expenditure","example[7]":"There have been cuts in local expenditure on education.","collocation[2]":"military/defence expenditure","example[8]":"Military expenditure has been growing year on year.","collocation[3]":"health/welfare/education expenditure","example[9]":"There has been a steady rise in welfare expenditure.","collocation[4]":"household expenditure","example[10]":"Sally cut her household expenditure and tried to save every penny she could.","collocation[5]":"total/overall expenditure","example[11]":"The company's total expenditure rose by 19%.","collocation[6]":"additional/extra expenditure","example[12]":"Businesses have been forced to pass on the additional expenditure to customers.","collocation[7]":"capital expenditure","example[13]":"Capital expenditure on IT equipment will come from a different budget.","collocation[8]":"gross/net expenditure","example[14]":"Spending on research and development represents 13% of our gross expenditure.","collocation[9]":"increase expenditure","example[15]":"The company plans to increase capital expenditure by 20% this financial year.","collocation[10]":"cut/reduce expenditure","example[16]":"Their policies are designed to cut public expenditure.","collocation[11]":"expenditure rises","example[17]":"As public expenditure has risen, so have taxes.","collocation[12]":"expenditure falls","example[18]":"Government expenditure on scientific research has fallen in the last few years.","collocation[13]":"an increase/rise in expenditure","example[19]":"The government has announced a planned 4.4% increase in public expenditure.","collocation[14]":"a cut/reduction in expenditure","example[20]":"There has been a marked reduction in expenditure on some social and welfare services.","collocation[15]":"an item of expenditure","example[21]":"Housing is the biggest single item of expenditure in the budgets of most households.","example[22]":"An advertiser rarely knows what its return on investment in advertising expenditure is.","example[23]":"a 58% increase in expenditure on books and teaching materials"}