{"word[0]":"newspaper","definition[0]":"a set of large folded sheets of printed paper containing news, articles, pictures, advertisements etc which is sold daily or weekly","example[0]":"She had read about it in the newspaper.","example[1]":"a series of newspaper articles about life in Cuba","explanation[0]":"In everyday English, people often say paper rather than newspaper:","example[2]":"I saw an ad in the paper.","definition[1]":"sheets of paper from old newspapers","example[3]":"Wrap the plates in newspaper to stop them from breaking.","example[4]":"Bella laid the flowers out carefully on a sheet of newspaper.","definition[2]":"a company that produces a newspaper","example[5]":"He works for a local newspaper.","collocation[0]":"read a newspaper","example[6]":"Which newspaper do you read?","collocation[1]":"get a newspaper","example[7]":"We don’t get a newspaper; we tend to watch the news on TV.","collocation[2]":"see/read something in the newspaper","example[8]":"I saw in the newspaper that he had died.","collocation[3]":"appear in a newspaper","example[9]":"Her photo appeared in all the newspapers.","collocation[4]":"a newspaper reports something","example[10]":"The newspapers reported that the police were treating the death as a suicide.","form[0]":"ADJECTIVES/NOUN + newspaper","collocation[5]":"a national newspaper","example[11]":"The story was in all the national newspapers.","collocation[6]":"a local newspaper","example[12]":"The store advertises in the local newspaper.","collocation[7]":"a daily/weekly/Sunday newspaper","example[13]":"Do you get a daily newspaper?","collocation[8]":"a tabloid newspaper","example[14]":"Their wedding made the headlines in all the tabloid newspapers.","collocation[9]":"a quality newspaper","example[15]":"The story has not been given as much coverage in the quality newspapers.","form[1]":"newspaper + NOUN","collocation[10]":"a newspaper article/report/story","example[16]":"I read quite an interesting newspaper report on the war.","collocation[11]":"a newspaper headline","example[17]":"‘Wine is good for you’ announced a recent newspaper headline.","collocation[12]":"a newspaper column","example[18]":"She writes a regular newspaper column about gardening.","collocation[13]":"a newspaper clipping/cutting","example[19]":"I found some old newspaper cuttings of the band's first concert in Liverpool.","collocation[14]":"a newspaper reporter","example[20]":"She was fed up with being followed by newspaper reporters.","collocation[15]":"a newspaper editor","example[21]":"Newspaper editors have a lot of power.","collocation[16]":"a newspaper proprietor","example[22]":"Ultimately, it’s the newspaper proprietor who decides what goes into the newspaper.","heading[0]":"GRAMMAR: Patterns with newspaper","explanation[1]":"You read something in a newspaper","example[23]":"She saw an ad in the newspaper","bad_example[0]":"on the newspaper","explanation[2]":"You often talk about the newspaper","example[24]":"I read something about it in the newspaper","bad_example[1]":"in newspaper","example[25]":"The New York Times is a popular daily newspaper.","definition[3]":"a newspaper. Paper is more common than newspaper in everyday English","example[26]":"There was an interesting article in the local paper today.","example[27]":"the Sunday papers","display[0]":"the press","definition[4]":"newspapers and news magazines in general, and the people who write for them","example[28]":"the freedom of the press","example[29]":"The press are always interested in stories about the royal family.","display[1]":"the media","definition[5]":"newspapers, magazines, television, radio, and the Internet, considered as a group that provides news and information","example[30]":"This issue has received a lot of attention in the media.","example[31]":"Her public image was shaped by the media.","display[2]":"tabloid","definition[6]":"a newspaper that has small pages, a lot of photographs, short stories, and not much serious news","example[32]":"The tabloids are full of stories about her and her boyfriend.","display[3]":"broadsheet","definition[7]":"a serious newspaper printed on large sheets of paper, with news about politics, finance, and foreign affairs","example[33]":"the quality broadsheets","display[4]":"the nationals","definition[8]":"the newspapers that give news about the whole country where they are printed, in contrast to local newspapers","example[34]":"The results of the nationwide survey became headlines in the nationals.","display[5]":"the dailies","definition[9]":"the daily newspapers","example[35]":"The dailies reported the story.","heading[1]":"parts of a newspaper","display[6]":"article","definition[10]":"a piece of writing in a newspaper about a particular subject","example[36]":"an article on the education reforms","display[7]":"report","definition[11]":"a piece of writing in a newspaper about an event","example[37]":"newspaper reports on the war","display[8]":"story","definition[12]":"a report in a newspaper about an event, especially one that is not very serious or reliable","example[38]":"You can’t always believe what you read in newspaper stories.","display[9]":"a headline","definition[13]":"the title of an important newspaper article, printed in large letters above the article. The headlines are the titles of the most important stories on the front page","example[39]":"The singer’s drug problem has been constantly in the headlines.","display[10]":"front page","definition[14]":"the page on the front of a newspaper which has the most important news stories","example[40]":"The story was all over the front page.","display[11]":"section/pages","definition[15]":"the pages in a newspaper dealing with a particular area of news such as sports, business, or entertainment","example[41]":"the financial pages of The Times","example[42]":"the arts section","display[12]":"editorial","definition[16]":"the page of a newspaper on which the editor of a newspaper and other people express their opinions about the news, rather than just giving facts","example[43]":"an editorial on the vaccination programme","display[13]":"column","definition[17]":"an article on a particular subject or by a particular writer that appears regularly","example[44]":"his weekly column on gardening"}