{"word[0]":"sort","signpost[0]":"type/kind","definition[0]":"a group or class of people, things etc that have similar qualities or features","synonym[0]":"type","example[0]":"Most of the victims developed psychological problems of one sort or another (=of various different types).","example[1]":"They do burgers, pizzas, that sort of thing.","example[2]":"I like all sorts of food – I’m not fussy.","note[0]":"all sorts (of something)","example[3]":"He wondered if Rosa was in some sort of trouble.","note[1]":"of some sort/some sort of something","example[4]":"There was a game of some sort going on inside.","example[5]":"What sort of shampoo do you use?","note[2]":"sort of","example[6]":"On expeditions of this sort, you have to be prepared for trouble.","note[3]":"of this/that sort","definition[1]":"someone who has a particular type of character, and is therefore likely to behave in a particular way","example[7]":"Iain’s never even looked at another woman. He’s not the sort.","definition[2]":"if a computer does a sort, it puts things in a particular order","collocation[0]":"this/that sort","example[8]":"We must ensure that this sort of thing does not happen again.","collocation[1]":"some sort","example[9]":"There has been some sort of error.","collocation[2]":"the same sort","example[10]":"We had the same sort of background.","collocation[3]":"a similar sort","example[11]":"It’s a similar sort of house.","collocation[4]":"a different sort","example[12]":"Barbara never stopped wanting a different sort of life.","collocation[5]":"the right sort","example[13]":"Wearing the right sort of clothing could save your life.","collocation[6]":"other sorts","example[14]":"What other sorts of books do you like?","collocation[7]":"all sorts","example[15]":"He collects all sorts of musical instruments.","collocation[8]":"of one sort or another","example[16]":"Quite a large number of them suffered injuries of one sort or another.","definition[3]":"to put things in a particular order or arrange them in groups according to size, type etc","example[17]":"The eggs are sorted according to size.","example[18]":"Let’s sort all the clothes into piles.","note[4]":"sort something into something","example[19]":"All the names on the list have been sorted into alphabetical order.","definition[4]":"to deal with a situation so that all the problems are solved and everything is organized","example[20]":"Right, I’ll leave this for Roger and Terry to sort, then.","example[21]":"If you do a sort on the computer, it will list entries in alphabetical order."}