{"definition[0]":"facts or details that tell you something about a situation, person, event etc","example[0]":"I need more information.","example[1]":"My information is that Gary wants to stay with the club.","note[0]":"my/our etc information is","example[2]":"We have received information that Grant may have left the country.","note[1]":"information that","example[3]":"The book contains information about a wide variety of subjects.","note[2]":"information about/on","explanation[0]":"Information is an uncountable noun and is not used in the plural You say","example[4]":"I need some information about hotels","bad_example[0]":"I need some informations about hotels","explanation[1]":"Information is always followed by a singular verb","example[5]":"The information is strictly confidential","explanation[2]":"When talking about one fact or detail, you say a piece of information or a bit of information","example[6]":"He told me an interesting piece of information","definition[1]":"the telephone service which provides telephone numbers to people who ask for them","form[0]":"ADJECTIVES/NOUN + information","collocation[0]":"useful/valuable","example[7]":"The information he gave me was very useful.","collocation[1]":"correct/accurate","example[8]":"Are you sure this information is correct?","collocation[2]":"wrong/false","example[9]":"He was jailed for providing false information to the police.","collocation[3]":"relevant","example[10]":"Some of the information in the article is not particularly relevant.","collocation[4]":"confidential/secret","example[11]":"That information was confidential and should not have been passed on.","collocation[5]":"more/further/additional information","example[12]":"For more information, visit our website.","collocation[6]":"new information","example[13]":"The police have received new information about the case.","collocation[7]":"the latest information","example[14]":"We have access to all the latest information.","collocation[8]":"the necessary information","example[15]":"This leaflet should provide you with all the necessary information.","collocation[9]":"detailed information","example[16]":"More detailed information is available free on request.","collocation[10]":"financial/economic information","example[17]":"The financial information contained in the report is based on the company's audited accounts.","collocation[11]":"background information","example[18]":"He gave us some background information about the trial.","collocation[12]":"have information","example[19]":"Do you have any information about coach trips to Oxford?","collocation[13]":"contain information","example[20]":"The documents contained top secret information.","collocation[14]":"get/receive information","example[21]":"It is vital that people receive the information they need.","collocation[15]":"give/provide information","example[22]":"a booklet giving information about local education services","collocation[16]":"collect/gather information","example[23]":"The job consisted of gathering information about consumer needs.","collocation[17]":"need information","example[24]":"When I needed information for my report, Jack was always extremely helpful.","collocation[18]":"look for information","example[25]":"Journalists going to the building to seek information were denied entry.","collocation[19]":"exchange information","example[26]":"The meetings provided an opportunity to exchange information.","collocation[20]":"disseminate information","example[27]":"The internet plays a key role in disseminating information.","collocation[21]":"a piece/bit of information","example[28]":"He provided me with several useful pieces of information.","collocation[22]":"a source of information","example[29]":"Newspapers are valuable sources of information.","definition[2]":"facts or details that tell you about something or someone","example[30]":"This is highly confidential information.","example[31]":"Corporations are making more financial information available to investors.","definition[3]":"written on copies of letters and documents that are sent to someone who needs to know about them but does not need to deal with them","definition[4]":"written on the front or at the top of a letter when you want a particular person to read it or deal with it","definition[5]":"the telephone service that provides telephone numbers to people who ask for them"}