{"signpost[0]":"not proud","definition[0]":"someone who is modest does not want to talk about their abilities or achievements","opposite[0]":"immodest","example[0]":"You’re too modest! You’ve been a huge help to us.","example[1]":"He was always modest about his role in the Everest expedition.","note[0]":"modest about","signpost[1]":"not big","definition[1]":"not very great, big, or expensive","example[2]":"a modest increase in costs","example[3]":"She had saved a modest amount of money.","example[4]":"The new service proved a modest success.","example[5]":"a modest house with a small garden","example[6]":"his modest ambitions","signpost[2]":"shy","definition[2]":"shy about showing your body or attracting sexual interest, because you are easily embarrassed","example[7]":"She was a modest girl, always keeping covered, even in summer.","definition[3]":"modest clothing covers the body in a way that does not attract sexual interest","example[8]":"a modest knee-length dress","definition[4]":"not wanting to talk about your abilities or achievements and to say that you are good at something, even when you are – used to show approval","example[9]":"Miller, a quiet, modest man, gave credit to Asher for the initial discovery.","example[10]":"She was surprisingly modest about her own achievements as a player.","display[0]":"self-effacing","definition[5]":"not wanting to talk about yourself or to attract attention","example[11]":"Her husband was a quiet, self-effacing man who spent much of his time in his study.","display[1]":"unassuming","definition[6]":"not wanting to be noticed and not expecting to be treated in a special way","example[12]":"By now Chapman was famous, but he remained as unassuming as ever.","example[13]":"He then began, in typically unassuming fashion, to establish the first modern dance company.","display[2]":"humble","definition[7]":"believing that you are not more important, better, or cleverer than other people, and therefore not expecting to be treated in a special way","example[14]":"A good leader is humble enough to get advice from experts.","display[3]":"unpretentious","definition[8]":"not trying to seem better than other people, even if you are rich, famous, clever etc","example[15]":"President Eisenhower was a friendly and unpretentious man who seemed to embody American virtues.","example[16]":"It's his unpretentious boyish charm that ensures Jackie Chan's position as one of the giants of international cinema.","display[4]":"self-deprecating","definition[9]":"behaving or talking about your own abilities or achievements in a way that makes them seem unimportant","example[17]":"Despite his intellect, he had an appealing self-deprecating humour.","example[18]":"The nice thing about him is his self-deprecating manner. His intellectual ability was never pushed at you, yet he obviously had great potential.","example[19]":"a self-deprecating smile"}