{"word[0]":"blind","signpost[0]":"unable to see","example[0]":"a school for blind children","example[1]":"the needs of blind people","example[2]":"He was slowly going blind (=becoming blind).","example[3]":"Beverley was born blind.","example[4]":"She’s almost blind in her right eye.","note[0]":"totally/completely/almost/partially blind","definition[0]":"people who are unable to see","example[5]":"talking books for the blind","definition[1]":"unable to see well – used humorously","example[6]":"I’m as blind as a bat without my glasses.","definition[2]":"unable to see because of tears, pain, or a strong emotion","example[7]":"She screamed at him, her eyes blind with tears.","definition[3]":"strong feelings that someone has without thinking about why they have them – used to show disapproval","example[8]":"Blind faith sent thousands of people to a pointless war.","example[9]":"a story about blind loyalty","definition[4]":"strong feelings of fear or anger that you cannot control","example[10]":"In a moment of blind panic, she had pulled the trigger and shot the man dead.","example[11]":"Blind rage took hold of him.","definition[5]":"blind flying is when you use only instruments to fly an aircraft because you cannot see through cloud, mist etc","definition[6]":"to make it difficult for someone to see for a short time","example[12]":"For a moment, I was blinded by the glare of headlights coming towards me.","example[13]":"The dust choked and blinded him.","example[14]":"Blinded by tears, I walked towards the door.","definition[7]":"to make someone lose their good sense or judgment and be unable to see the truth about something","example[15]":"He should have known better, but he was blinded by his own wants.","example[16]":"Children’s bad behaviour should not blind us to their need for love.","note[1]":"blind somebody to something","example[17]":"His single-minded determination to win the war is blinding him to other dangers.","definition[8]":"to permanently destroy someone’s ability to see","example[18]":"He had been blinded in an explosion.","definition[9]":"a covering, especially one made of cloth, that can be rolled up and down to cover a window inside a building","note[2]":"open/pull down/draw the blinds","example[19]":"The blinds were drawn (=pulled down) to protect the new furniture from the sun.","definition[10]":"a small shelter where you can watch birds or animals without being seen by them","definition[11]":"a trick or excuse to stop someone from discovering the truth"}