{"definition[0]":"to make someone or something move by pressing them with your hands, arms etc","opposite[0]":"pull","example[0]":"It didn’t move, so she pushed harder.","example[1]":"I promised to push him on the swings for as long as he wanted.","example[2]":"shoppers pushing their grocery carts","example[3]":"I slowly pushed the door open.","note[0]":"push something open/shut","example[4]":"She pushed him away.","note[1]":"push somebody/something away/back/aside etc","example[5]":"Maria pushed her hair back from her forehead.","example[6]":"Philip pushed him towards the door.","note[2]":"push somebody/something towards/into etc something","signpost[0]":"button/switch","definition[1]":"to press a button, switch etc in order to make a piece of equipment start or stop working","example[7]":"I got in and pushed the button for the fourth floor.","example[8]":"Push the green button to start the engine.","signpost[1]":"try to get past","definition[2]":"to use your hands, arms etc to make people or things move, so that you can get past them","example[9]":"Don’t push. Everyone will get a turn.","example[10]":"A fat man pushed past me in his rush to leave.","note[3]":"push (your way) past/through/into etc","example[11]":"She pushed her way to the front.","definition[3]":"to encourage or force someone to do something or to work hard","example[12]":"Encourage your kids to try new things, but try not to push them too hard.","example[13]":"athletes who push their bodies to the limit","example[14]":"He’s been pushing himself too hard, working 12-hour days.","note[4]":"push yourself","example[15]":"My husband pushed me into leaving the job.","note[5]":"push somebody into (doing) something","example[16]":"The teachers pushed the students to achieve.","note[6]":"push somebody to do something","definition[4]":"to try to persuade people to accept your ideas, opinions etc in order to achieve something","example[17]":"The president is trying to push his agenda in Congress.","example[18]":"He was pushing hard for welfare reform.","note[7]":"push for","example[19]":"Company representatives are pushing to open foreign markets to their products.","note[8]":"push to do something","example[20]":"We don’t try to push our religion on anyone.","note[9]":"push something on somebody","definition[5]":"to change someone’s situation, or to make a situation change, especially when some people do not want it to change","example[21]":"The law would push even more children into poverty.","example[22]":"attempts to push the peace process forward","signpost[2]":"increase/decrease","definition[6]":"to increase or decrease an amount, value, or number","example[23]":"New technology has pushed the cost of health care even higher.","note[10]":"push something higher/lower","example[24]":"Slow sales have pushed down orders.","note[11]":"push something up/down","definition[7]":"if an army pushes somewhere, it moves in that direction","example[25]":"The army was pushing north.","example[26]":"We pushed deep into enemy territory.","signpost[3]":"advertise","definition[8]":"to try to sell more of a product by advertising it a lot","example[27]":"Sports stars earn big bucks for pushing everything from shoes to soft drinks.","definition[9]":"to sell illegal drugs","definition[10]":"to automatically send your email to your smartphone, so that you receive it immediately","definition[11]":"to make something or someone move by pressing them with your hands, arms etc","example[28]":"Push the door, don’t pull it.","example[29]":"She pushed him away and walked out.","display[0]":"shove","definition[12]":"to push someone or something in a rough or careless way","example[30]":"People were shoving to get to the front of the queue.","example[31]":"Tom shoved his suitcase under the bed.","display[1]":"stuff","definition[13]":"to push something quickly and carelessly into a small space","example[32]":"She stuffed a few clothes into a bag and left.","display[2]":"poke","definition[14]":"to push someone or something with your finger or something sharp","example[33]":"I poked the snake with a stick but it was dead.","display[3]":"nudge","definition[15]":"to push someone beside you gently with your elbow to get their attention","example[34]":"Toby nudged me and pointed out of the window.","display[4]":"roll","definition[16]":"to push something round or something on wheels so that it moves forward","example[35]":"They rolled the logs down the hill.","example[36]":"The car still didn’t start so we tried to roll it off the road.","display[5]":"wheel","definition[17]":"to push something with wheels, for example a bicycle or a trolley, so that it moves forward, while guiding it with your hands","example[37]":"Rob wheeled his bike round the back of the house.","signpost[4]":"pushing movement","definition[18]":"when someone pushes something","example[38]":"Jodi had stopped swinging. ‘Want a push?’ her dad asked.","example[39]":"If the door’s stuck, just give it a push.","example[40]":"Files can be attached to your email at the push of a button.","note[12]":"at/with the push of a button","signpost[5]":"effort","definition[19]":"when someone, especially a business, tries to get or achieve something","example[41]":"the pre-Christmas advertising push","example[42]":"The company has recently made a big push into the Japanese market.","note[13]":"push into","example[43]":"the push for improved productivity","example[44]":"a push to attract new members","signpost[6]":"encouragement","definition[20]":"if someone gives someone else a push, they encourage or persuade them to try something","example[45]":"She just needed a gentle push to get her to join in.","definition[21]":"a planned military movement into the area where the enemy is","example[46]":"The army has made another big push into enemy territory.","definition[22]":"to work hard to persuade people to buy more of a product, for example by advertising it a lot","example[47]":"Our sales staff will be pushing the new model hard.","example[48]":"IBM will use its huge sales force to push this product.","definition[23]":"to try to get people to accept an idea, proposal etc","example[49]":"Manufacturing groups are pushing a federal products liability law to limit punitive damages.","definition[24]":"a period of determined effort in business, especially one in which you gain an advantage over your opponents","example[50]":"a sales push","example[51]":"The company recently made a big push into the Japanese market.","definition[25]":"to make someone leave their job, especially because they have done something wrong","example[52]":"So they gave you the push, did they? You’re so lazy, I’m not surprised!","definition[26]":"on the Internet, push systems deliver information, advertising etc to your computer without you having to ask for it to be DOWNLOADED","example[53]":"push technologies"}