{"word[0]":"hero","plural[0]":"heroes","definition[0]":"a man who is admired for doing something extremely brave","example[0]":"He had dared to speak out against injustice, and overnight he became a national hero.","example[1]":"His father was a war hero, a former fighter pilot.","example[2]":"the unsung heroes who drove convoys of aid to Bosnia","example[3]":"A man hailed as a hero for 50 years has been unmasked as a traitor.","example[4]":"a hero of the Great War","note[0]":"hero of","definition[1]":"the man or boy who is the main character in a book, film, play etc","example[5]":"Phileas Fogg, hero of Jules Verne’s ‘Around the World in Eighty Days’","definition[2]":"a man who is admired very much for a particular skill or quality","example[6]":"When I was small, Uncle Fred was my hero.","note[1]":"somebody’s hero","example[7]":"Einstein is the hero of those who explore science at its deepest level.","definition[3]":"a long thin sandwich filled with meat, cheese etc","heading[0]":"– Meanings 1 & 3","form[0]":"ADJECTIVES/NOUN + hero","collocation[0]":"a real/true hero","example[8]":"The real heroes were the guys who fought in the front lines.","collocation[1]":"a great hero","example[9]":"He finally got to meet his great hero, the Brazilian footballer, Pele.","collocation[2]":"a national hero","example[10]":"They regard Aung San as a national hero and martyr.","collocation[3]":"a local hero","example[11]":"Richards was a local hero, a star of the football club.","collocation[4]":"a popular hero","example[12]":"Ross was an arctic explorer and popular hero.","collocation[5]":"a cult hero","example[13]":"He became a cult hero among surfers.","collocation[6]":"a war hero","example[14]":"Coming home, he was hailed as a war hero.","collocation[7]":"an unsung hero","example[15]":"These volunteers are the unsung heroes of the campaign.","collocation[8]":"an unlikely hero","example[16]":"Baxter was the unlikely hero of the game.","collocation[9]":"a sporting hero","example[17]":"Tiger Woods was his sporting hero.","collocation[10]":"a folk hero","example[18]":"Cesar Chavez has folk hero status in the Latino community.","collocation[11]":"an accidental hero","example[19]":"He became an accidental hero after discovering the injured child while out walking.","collocation[12]":"a conquering hero","example[20]":"Team members were greeted like conquering heroes on their return.","collocation[13]":"somebody’s boyhood/childhood hero","example[21]":"McEnroe had been one of his boyhood heroes.","collocation[14]":"become a hero","example[22]":"He became a national hero for his part in the war.","collocation[15]":"be hailed (as) a hero","example[23]":"He was hailed a hero after saving the young girl’s life.","collocation[16]":"get/be given a hero’s welcome","example[24]":"The team were given a hero’s welcome when they returned to the city."}