{"definition[0]":"an area of ground, especially when used for farming or building","example[0]":"They own a lot of land.","example[1]":"He bought a piece of land.","signpost[0]":"not sea","definition[1]":"the solid dry part of the Earth’s surface","example[2]":"After 21 days at sea, we sighted land.","example[3]":"The white stork is one of the biggest land birds of the region.","note[0]":"land bird/animal","example[4]":"Troops began an assault on the city by land and sea.","note[1]":"by land","example[5]":"The crocodile lays its eggs on land.","note[2]":"on land","signpost[1]":"country","definition[2]":"a country or area","example[6]":"Their journey took them to many foreign lands.","example[7]":"Australia represented a real land of opportunity for thousands of people.","example[8]":"He’s fiercely proud of his native land.","note[3]":"native land","signpost[2]":"property","definition[3]":"the area of land that someone owns","note[4]":"private/public/common land","example[9]":"He ordered us to get off his land.","collocation[0]":"an acre/hectare of land","example[10]":"The family owned hundreds of acres of land.","collocation[1]":"a piece of land","example[11]":"He built a house on a piece of land near the river.","collocation[2]":"a plot/parcel of land","example[12]":"They farmed a small plot of land.","collocation[3]":"a strip of land","example[13]":"They owned the strip of land between the forest and the sea.","collocation[4]":"a tract of land","example[14]":"Cattle ranching requires large tracts of land.","collocation[5]":"fertile/rich","example[15]":"The land near the river is very fertile.","example[16]":"It is poor land that should never have been farmed.","collocation[6]":"vacant/derelict","example[17]":"The houses could be built on derelict land.","collocation[7]":"open land","example[18]":"In the middle of the city are several hundred acres of open land.","collocation[8]":"agricultural land","example[19]":"The factory is causing severe pollution to nearby agricultural land.","collocation[9]":"arable land","example[20]":"Some pastures were converted into arable land.","collocation[10]":"industrial land","example[21]":"The canal basin area is designated as industrial land.","collocation[11]":"housing/building land","example[22]":"The shortage of housing land is a problem in the south-east.","definition[4]":"an area that is owned by someone or that can be used for farming or building houses","example[23]":"This is private land.","example[24]":"They moved to the country and bought some land.","display[0]":"farmland","definition[5]":"land that is used for farming","example[25]":"The area is one of gently rolling hills and farmland.","display[1]":"territory","definition[6]":"land that belongs to a country or that is controlled by a country during a war","example[26]":"His plane was forced to make an emergency landing in Chinese territory.","example[27]":"The army was advancing into enemy territory.","display[2]":"the grounds","definition[7]":"the gardens and land around a big building such as a castle, school, or hospital","example[28]":"The grounds of the castle are open to visitors every weekend.","example[29]":"the school grounds","display[3]":"estate","definition[8]":"a large area of land in the country, usually with one large house on it and one owner","example[30]":"The film is set on an English country estate.","signpost[3]":"plane/bird/insect","definition[9]":"if a plane, bird, or insect lands, it moves safely down onto the ground","example[31]":"Flight 846 landed five minutes ago.","example[32]":"The bird landed gracefully on the water.","definition[10]":"to make a plane move safely down onto the ground at the end of a journey","example[33]":"The pilot managed to land the aircraft safely.","signpost[4]":"arrive by boat/plane","definition[11]":"to arrive somewhere in a plane, boat etc","example[34]":"We expect to be landing in Oslo in about fifty minutes.","note[5]":"land on/in/at etc","example[35]":"In 1969, the first men landed on the Moon.","signpost[5]":"fall/come down","definition[12]":"to come down through the air onto something","synonym[0]":"drop","example[36]":"A large branch landed on the hood of my car.","note[6]":"land in/on/under etc","example[37]":"Louis fell out of the tree and landed in a holly bush.","example[38]":"She fell and landed heavily on the floor.","example[39]":"A couple of bombs landed quite near to the village.","signpost[6]":"goods/people","definition[13]":"if a boat or aircraft lands people or goods, it brings them to a place, and the people get out or the goods are carried out","example[40]":"The troops were landed by helicopter.","signpost[7]":"job/contract etc","definition[14]":"to succeed in getting a job, contract etc that was difficult to get","example[41]":"He landed a job with a law firm.","example[42]":"Bill’s just landed himself a part in a Broadway show.","note[7]":"land yourself something","signpost[8]":"problems","definition[15]":"to arrive unexpectedly, and cause problems","example[43]":"Just when I thought my problems were over, this letter landed on my desk.","signpost[9]":"catch fish","definition[16]":"to catch a fish","explanation[0]":"Land belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[1]":"In this sentence, ‘the plane’ is the object of land","example[44]":"He landed the plane in a field","explanation[2]":"In this sentence, ‘the plane’ is the subject of land","example[45]":"The plane landed in a field","definition[17]":"ground, especially ground used for building or farming on","example[46]":"Land has always been a good investment.","definition[18]":"ground in the country used for growing food, animals etc","example[47]":"Many farmers have given up working the land because of low rates of return.","definition[19]":"an area of land that a person or organization owns","example[48]":"He exploited the mineral resources which he found under his lands.","definition[20]":"if a plane lands, or if a pilot lands it, it moves down on to the ground in a controlled way","definition[21]":"to put someone or something on land from an aircraft or boat","example[49]":"He landed his load of illegal immigrants on the Kent coast at midnight.","definition[22]":"if you land a job or a contract, you manage to get it","example[50]":"It has just landed a big contract to install a defense communications system."}