{"word[0]":"explode","signpost[0]":"burst","definition[0]":"to burst, or to make something burst, into small pieces, usually with a loud noise and in a way that causes damage","example[0]":"The device was thrown at an army patrol but failed to explode.","example[1]":"Far sooner than anyone thought possible, the Russians exploded an atomic bomb.","explanation[0]":"In everyday English, people usually say that a bomb goes off rather than explodes:","example[2]":"A bomb went off in the city centre.","signpost[1]":"increase suddenly","definition[1]":"to suddenly increase greatly in number, amount, or degree","synonym[0]":"rocket","example[3]":"Florida’s population exploded after World War II.","signpost[2]":"strong feelings","definition[2]":"to suddenly express strong feelings such as anger","example[4]":"Paul exploded. ‘What has it got to do with you?’ he yelled.","example[5]":"She exploded with grief and anger.","note[0]":"explode with","example[6]":"He told a joke which made Hank explode with laughter.","example[7]":"He exploded into a screaming, kicking rage.","note[1]":"explode into","signpost[3]":"become dangerous","definition[3]":"if a situation explodes, it is suddenly no longer controlled, and is often violent","synonym[1]":"blow up","example[8]":"Riots may explode at any time.","example[9]":"The continued tension could explode into more violence.","signpost[4]":"make a loud noise","definition[4]":"to make a very loud noise","example[10]":"A clap of thunder exploded overhead.","heading[0]":"to explode","definition[5]":"if a bomb explodes, it bursts suddenly and violently with a loud noise","example[11]":"A bomb exploded in a crowded metro station this morning, killing five people.","display[0]":"go off","definition[6]":"if a bomb goes off, it explodes. Go off is less formal than explode and is the usual phrase to use in everyday English","example[12]":"Luckily the station was empty when the bomb went off.","example[13]":"As many as ten bombs went off across the city, most of them car bombs.","definition[7]":"if a building, car, plane etc blows up, it bursts suddenly and violently into pieces, causing a lot of damage","example[14]":"The plane blew up in mid-air, killing all the passengers and crew.","example[15]":"In early 1986, a US space shuttle blew up shortly after launch.","display[1]":"erupt","definition[8]":"if a volcano erupts, it explodes and sends smoke and rock into the sky","example[16]":"The volcano has erupted at least fifteen times since 1883.","definition[9]":"if something that has air or liquid inside it bursts, it explodes and the air or liquid comes out","example[17]":"One of the water pipes had burst.","example[18]":"The plane caught fire after its tyre burst on landing.","heading[1]":"to make something explode","definition[10]":"to make a bomb burst suddenly and violently with a loud noise","example[19]":"The terrorists planned to explode a car bomb outside the US embassy.","display[2]":"set off","definition[11]":"to make a bomb explode, either deliberately or accidentally. Set off is less formal than explode and is the usual phrase to use in everyday English","example[20]":"The group set off a bomb outside a crowded cafe in Izmir last September.","example[21]":"Police say radio signals were probably used to set the bomb off.","display[3]":"detonate","definition[12]":"to make a bomb explode, especially by using special equipment. Detonate is a more technical word than set off","example[22]":"Army experts detonated the bomb safely in a nearby field.","example[23]":"The 200 kg bomb was detonated by terrorists using a remote-control device.","display[4]":"let off","definition[13]":"to deliberately make a bomb explode","example[24]":"Terrorists let off a bomb in the city centre.","example[25]":"The bomb was let off shortly before 3 pm.","definition[14]":"to make a building, car, plane etc explode","example[26]":"He was involved in a plot to blow up a passenger jet.","example[27]":"He struck a match and blew the whole place up."}