{"word[0]":"punch","definition[0]":"to hit someone or something hard with your fist (=closed hand)","example[0]":"He punched me and knocked my teeth out.","example[1]":"He punched Jack in the face.","note[0]":"punch somebody on/in something","signpost[0]":"make holes","definition[1]":"to make a hole in something, using a metal tool or other sharp object","example[2]":"The guard punched my ticket and I got on.","example[3]":"These bullets can punch a hole through 20 mm steel plate.","signpost[1]":"push buttons","definition[2]":"to push a button or key on a machine","example[4]":"Just punch the button to select a track.","signpost[2]":"cattle","definition[3]":"to move cattle from one place to another","definition[4]":"a quick strong hit made with your fist (=closed hand)","example[5]":"The two men started throwing punches (=trying to hit each other).","example[6]":"a punch in the kidneys","note[1]":"punch in/on","example[7]":"I managed to land a punch on his chin.","definition[5]":"a strong effective way of expressing things that makes people interested","example[8]":"Thirty years after it was written, Orton’s ‘Entertaining Mr Sloane’ still packs a punch.","definition[6]":"a drink made from fruit juice, sugar, water, and usually some alcohol","example[9]":"a glass of hot punch","definition[7]":"a metal tool for cutting holes or for pushing something into a small hole","collocation[0]":"throw a punch","example[10]":"Rob was so angry that he turned round and threw a punch at the man.","collocation[1]":"land a punch","example[11]":"Then I began to land some good punches.","collocation[2]":"give somebody a punch","example[12]":"He gave me a punch on the nose.","collocation[3]":"deliver a punch","example[13]":"Who actually delivered the punch that killed the man?","collocation[4]":"take a punch","example[14]":"I took a lot of punches but I gave a lot too.","form[0]":"ADJECTIVES/NOUN + punch","collocation[5]":"a hard/powerful punch","example[15]":"My stomach took a couple of hard punches.","collocation[6]":"a good punch","example[16]":"Tyson landed one good punch but it wasn’t enough.","collocation[7]":"a knockout punch","example[17]":"In the fourth round, Lewis produced a knockout punch that ended the fight.","definition[8]":"the main character in a Punch and Judy show","definition[9]":"a British weekly magazine which was started in 1841 and continued to be published until 2002. It is known especially for its humorous articles and cartoons.","definition[10]":"a metal tool used for making holes in paper or steel","example[18]":"Pass me the punch.","definition[11]":"to make a hole in something, for example a card that shows what time you arrived at work or left work","example[19]":"Any employee forgetting to punch his card must report it to his supervisor as soon as possible for payment authorization."}