{"word[0]":"but","definition[0]":"used to connect two statements or phrases when the second one adds something different or seems surprising after the first one","example[0]":"It’s an old car, but it’s very reliable.","example[1]":"They rushed to the hospital, but they were too late.","example[2]":"We’ve invited the boss, but she may decide not to come.","example[3]":"an expensive but extremely useful book","example[4]":"‘Has he got any experience?’ ‘No, but he’s keen to learn.’","definition[1]":"used to introduce a statement that explains why the thing you have mentioned did not happen or is not possible","example[5]":"I’d like to go but I’m too busy.","example[6]":"They would have married sooner, but they had to wait for her divorce.","definition[2]":"used after a negative to emphasize that it is the second part of the sentence that is true","example[7]":"He lied to the court not just once, but on several occasions.","example[8]":"The purpose of the scheme is not to help the employers but to provide work for young people.","definition[3]":"except","example[9]":"What can we do but sit and wait?","example[10]":"I had no choice but to accept the challenge.","example[11]":"Not a day goes by but I think of dear old Larry  (=I think of him every day).","definition[4]":"used when you are replying to someone and expressing strong feelings such as anger, surprise etc","example[12]":"But that’s marvellous news!","example[13]":"‘They won’t even discuss the problem.’ ‘But how stupid!’","definition[5]":"used when disagreeing with someone","example[14]":"‘It was a good idea.’ ‘But it didn’t work.’","definition[6]":"used to emphasize a word or statement","example[15]":"It’ll be a great party – everyone, but everyone, is coming.","example[16]":"They’re rich, but I mean rich.","definition[7]":"used to change the subject of a conversation","example[17]":"But now to the main question.","example[18]":"But tell me, are you really planning to retire?","definition[8]":"used after expressions such as ‘Excuse me’ and ‘I’m sorry’","example[19]":"Excuse me, but I’m afraid this is a no-smoking area.","definition[9]":"used when linking two words or phrases that seem opposite or very different in meaning. Don’t use but at the beginning of a sentence in written English","example[20]":"The plant’s leaves are big, but its flowers are quite small.","example[21]":"Her books are fascinating but often rather disturbing.","example[22]":"Many French dishes are basically simple, but they can take a long time to prepare.","example[23]":"Most of us value human life, but but some people think of animals as being equally important.","display[0]":"although","definition[10]":"used when contrasting one clause with another in the same sentence","example[24]":"Although you are in the middle of the city, you feel as if you are in the countryside.","example[25]":"The windmill is still in good working order, although it has not been used since the 1950s.","example[26]":"I enjoyed German although I wasn’t very good at it.","example[27]":"Although lack of sleep causes some problems, it has a relatively small effect on performance at work.","display[1]":"however","definition[11]":"used when saying something that seems different or surprising after your previous statement. It is usually used in the middle of a sentence, separated from the rest of the sentence by commas. It can also come at the beginning","example[28]":"Jack and his family managed to escape before the soldiers arrived. Other families in the village, however, were less lucky.","example[29]":"Their economy was incredibly successful in the 1980s. Since then, however, there has been a big rise in unemployment.","example[30]":"The town is a long way from the nearest big city. However, there is a good bus service.","example[31]":"He began his academic career as a mathematician. However, his main achievements were in the field of nuclear physics.","display[2]":"nevertheless/nonetheless","definition[12]":"used when saying something that seems different or surprising after your previous statement. It is used at the beginning or end of a sentence","example[32]":"A series of studies 20 years ago suggested that there was a link between watching violent films and violent behaviour. Nevertheless, the results remain highly controversial.","example[33]":"It was certainly a terrible accident. Nevertheless, air travel is still the safest form of transport.","example[34]":"The weather turned bad early in the day, but the festival was a great success nonetheless.","example[35]":"It was very hard digging in the dry ground, but the work was satisfying nevertheless.","display[3]":"while/whereas","definition[13]":"used when making comparisons and saying that something is true of one person, thing, or situation, but it is different for another. They are used when contrasting one clause with another in the same sentence","example[36]":"Taxes make up 62% of the price of a litre of petrol in France, whereas in Britain, the tax is 75%.","example[37]":"Some people visit their doctor once every few weeks, while others may not visit a doctor for several years.","example[38]":"Whereas in most of the world they drive on the right, in the UK and Japan they drive on the left.","display[4]":"by contrast","definition[14]":"used when making comparisons and saying that a person, thing, or situation is very different from the one you have just mentioned. It is used when referring back to the previous sentence","example[39]":"The surface temperature on Venus is higher than the boiling point of water. Mars, by contrast, is very cold.","example[40]":"A report by the FBI shows that 26% of female murder victims in 1995 were killed by their husbands or boyfriends. By contrast, only 3% of male victims were killed by their wives or girlfriends.","definition[15]":"apart from","example[41]":"I could come any day but Thursday.","example[42]":"There’s no one here but me.","example[43]":"I could still see nothing but the spirals of desert dust.","example[44]":"He was unable to swallow anything but liquids.","example[45]":"This is but one example of what can happen when things go badly wrong.","example[46]":"It’s going to be difficult. Anyway, we can but try.","example[47]":"We have relationships of many different sorts – with our children, our parents, our boss and our friends, to name but a few."}