{"word[0]":"one","definition[0]":"the number 1","example[0]":"They had one daughter.","example[1]":"one hundred and twenty-one pounds","example[2]":"Come back at one  (=one o'clock).","example[3]":"Katie’s almost one  (=one year old).","plural[0]":"ones","definition[1]":"used to mean someone or something of a type that has already been mentioned or is known about","example[4]":"‘Have you got a camera?’ ‘No.’ ‘You should buy one (=buy a camera).'","example[5]":"The train was crowded so we decided to catch a later one  (=catch a later train).","example[6]":"The only jokes I tell are the ones that I hear from you.","note[0]":"the one(s) (that/who/which)","example[7]":"I like all the pictures except this one.","note[1]":"this one/that one/these ones/those ones","definition[2]":"used to refer to a member of a group or pair of people or things","example[8]":"The children seemed upset. One was crying.","example[9]":"She has two daughters. One is a primary school teacher, the other is a musician.","example[10]":"One of the girls I work with is getting married.","note[2]":"one of","example[11]":"This is one of my favourite books.","explanation[0]":"Although one of is followed by a plural noun, you use a singular verb","example[12]":"One of the windows was open","example[13]":"One of them has gone","definition[3]":"used to mean people in general, including yourself","example[14]":"One can never be too careful.","example[15]":"Great pictures make one think.","explanation[1]":"In everyday English, people usually use you rather than one:","example[16]":"You can never be too careful.","definition[4]":"used in particular phrases to mean ‘an alcoholic drink’","note[3]":"(have) one for the road (=have one last alcoholic drink before you leave a place)","example[17]":"How about a quick one at the pub?","definition[5]":"used to emphasize a particular person or thing","example[18]":"One person I find very difficult is Bob.","example[19]":"If there’s one thing I can’t stand, it’s people who bite their nails.","definition[6]":"used to talk about a particular person or thing in comparison with other similar people or things","example[20]":"Why does my card work in one cash machine and not in another?","definition[7]":"used before the name of someone you do not know or have not heard of before","synonym[0]":"a certain","example[21]":"He was accused of stealing a horse from one Peter Wright.","example[22]":"Her one concern was to get to the door without being seen.","example[23]":"Claire is the one person I can trust.","definition[8]":"a piece of paper money worth one dollar","example[24]":"I don’t have any ones."}