{"word[0]":"device","definition[0]":"a machine or tool that does a special job","synonym[0]":"gadget","example[0]":"modern labour-saving devices","example[1]":"a device for separating metal from garbage","note[0]":"device for doing something","example[2]":"The company makes devices to detect carbon monoxide.","note[1]":"device to do something","definition[1]":"a special way of doing something that makes it easier to do","example[3]":"a memory device","example[4]":"Testing yourself with information on cards is a useful device for studying.","definition[2]":"a plan or trick, especially for a dishonest purpose","example[5]":"Their proposal was only a device to confuse the opposition.","definition[3]":"a bomb or other explosive weapon","note[2]":"explosive/nuclear/incendiary etc device","definition[4]":"the special use of words in literature, or of words, lights etc in a play, to achieve an effect","example[6]":"Metaphor is a common literary device.","form[0]":"ADJECTIVES/NOUN + device","collocation[0]":"an electronic device","example[7]":"The shops are always full of new electronic devices.","collocation[1]":"a mechanical device","example[8]":"One day it will be technically possible to replace patients’ hearts with mechanical devices.","collocation[2]":"a simple device","example[9]":"He invented a simple device for chopping onions.","collocation[3]":"a clever device","example[10]":"This clever little device rings to tell you where you left your keys.","collocation[4]":"a labour-saving device","example[11]":"Modern houses have so many labour-saving devices.","collocation[5]":"a security device","example[12]":"Cars today have better alarms and security devices.","collocation[6]":"a safety device","example[13]":"The accident happened because a simple safety device wasn’t properly fitted.","collocation[7]":"a handheld device","example[14]":"This is a handheld device for playing electronic games.","collocation[8]":"a storage device","example[15]":"You may need an additional storage device if you have a lot of data.","collocation[9]":"a medical device","example[16]":"The company makes medical devices that use laser technology for correcting eye disorders."}