{"word[0]":"ice","definition[0]":"water that has frozen into a solid state","example[0]":"Would you like some ice in your drink?","example[1]":"Her hands were as cold as ice.","example[2]":"The city spent $7 million to remove snow and ice from the roads.","definition[1]":"a frozen sweet food made with fruit juice","definition[2]":"an ice cream","definition[3]":"diamonds","example[3]":"Thick ice was preventing the ship from moving.","example[4]":"The ice is too thin to skate on.","collocation[0]":"black ice","example[5]":"Black ice on the roads is making driving conditions very dangerous.","collocation[1]":"crushed ice","example[6]":"Serve the cocktail with crushed ice.","collocation[2]":"polar ice","example[7]":"Global warming directly causes the melting of polar ice.","collocation[3]":"be covered in ice","example[8]":"Our driveway was covered in ice.","collocation[4]":"ice melts","example[9]":"The ice in my glass had begun to melt.","collocation[5]":"ice forms","example[10]":"Ice was forming on the surface of the lake.","collocation[6]":"ice cracks","example[11]":"We could feel the ice cracking beneath our feet.","collocation[7]":"scrape the ice off something","example[12]":"I scraped the ice off the car windscreen.","form[0]":"ice + NOUN","collocation[8]":"an ice cube","example[13]":"She put a couple of ice cubes in her glass.","collocation[9]":"ice crystals","example[14]":"Ice crystals fall from the sky as snowflakes.","collocation[10]":"a block of ice","example[15]":"The fish were packed in blocks of ice, ready for transportation.","collocation[11]":"a lump of ice","example[16]":"Huge lumps of ice break off from the glaciers and float in the sea.","collocation[12]":"a sheet of ice","example[17]":"A thin sheet of ice had formed over the surface of the pond.","collocation[13]":"a slab of ice","example[18]":"Huge slabs of ice drifted down the frozen river.","example[19]":"ice cubes in her Coke","example[20]":"the ice on the lake","display[0]":"frost","definition[4]":"a thin coating of white powder-like ice that forms on the ground and plants, or the weather conditions in which this powder appears","example[21]":"There was frost on the ground.","example[22]":"Even in May we can sometimes get a late frost.","definition[5]":"an area of ice that is very difficult to see on a road","example[23]":"Driving conditions are dangerous, with black ice in many areas.","display[1]":"icicle","definition[6]":"a long thin pointed piece of ice that hangs from a roof or other surface","example[24]":"There were icicles hanging down from the side of the house.","display[2]":"hailstones","definition[7]":"frozen balls of ice which fall like rain from the sky","example[25]":"Hailstones as big as marbles flattened the crops.","display[3]":"glacier","definition[8]":"a large mass of ice which moves slowly down a mountain valley","example[26]":"The high mountain glaciers of South America and Asia are melting at an alarming rate.","example[27]":"the Kangshung glacier","display[4]":"iceberg","definition[9]":"a very large mass of ice floating in the sea, most of which is under the surface of the water","example[28]":"The ship sank after hitting an iceberg in the North Atlantic.","display[5]":"ice cap","definition[10]":"an area of thick ice that permanently covers the North and South Poles","example[29]":"We all know that the polar ice caps are melting because of global warming.","definition[11]":"to cover a cake with icing (=a mixture made of liquid and very fine sugar)"}