{"word[0]":"trail","signpost[0]":"pull","definition[0]":"to pull something behind you, especially along the ground, or to be pulled in this way","example[0]":"A plane trailing a banner was circling overhead.","example[1]":"She walked slowly along the path, her skirt trailing in the mud.","note[0]":"trail in/on/over etc","example[2]":"Rees was leaning out of the boat trailing his hand through the water.","note[1]":"trail something in/across/through etc something","signpost[1]":"walk slowly","definition[1]":"to walk slowly, especially behind other people because you are tired or bored","example[3]":"Susie trailed along behind her parents.","note[2]":"trail behind/around","example[4]":"We spent the afternoon trailing around the shops.","type[0]":"intransitive, transitive usually in progressive","signpost[2]":"lose a competition","definition[2]":"to be losing in a game, competition, or election","example[5]":"The Democratic candidate is still trailing in the opinion polls.","example[6]":"He trailed in last after a disastrous race.","note[3]":"trail in/home","example[7]":"Manchester United were trailing by two goals to one.","note[4]":"trail (somebody) by something","signpost[3]":"follow somebody","definition[3]":"to follow someone by looking for signs that they have gone in a particular direction","example[8]":"Police trailed the gang for several days.","definition[4]":"a rough path across countryside or through a forest","example[9]":"The trail led over Boulder Pass before descending to a lake.","definition[5]":"a long line or a series of marks that have been left by someone or something","example[10]":"a trail of wet footprints","note[5]":"trail of","example[11]":"The bus left a trail of black smoke behind it.","example[12]":"The typhoon left a trail of devastation.","definition[6]":"a series of unpleasant situations or feelings that have been left by someone or something","example[13]":"He left a trail of broken hearts and broken promises.","definition[7]":"a sign that a person or animal has been in a place, used for finding or catching them","example[14]":"The hunters lost the tiger’s trail in the middle of the jungle.","example[15]":"Police tracked him to Valencia and there the trail went cold  (=they could not find any signs of him).","definition[8]":"all the places that a particular group of people visit for a particular purpose","example[16]":"a town on the tourist trail","example[17]":"politicians on the campaign trail","note[6]":"campaign/election trail","definition[9]":"the set of things that someone does to achieve something","example[18]":"New players should put the team back on the winning trail."}