{"word[0]":"plain","definition[0]":"very clear, and easy to understand or recognize","note[0]":"as plain as day/the nose on your face (=very clear)","example[0]":"The advantages were plain to see.","example[1]":"You have made your feelings plain enough.","example[2]":"Let me make it plain (=state it clearly). We do not want you here.","example[3]":"If you do that again you will be severely punished. Do I make myself plain?","note[1]":"make yourself plain","example[4]":"It was plain that Giles was not going to agree.","note[2]":"it is plain (that)","definition[1]":"without anything added or without decoration","example[5]":"a plain white blouse","example[6]":"a plain wooden table","example[7]":"plain yoghurt","example[8]":"a plain gold wedding ring","example[9]":"Your essay should be written on plain paper (=paper with no lines on it).","definition[2]":"showing clearly and honestly what is true or what you think about something","synonym[0]":"frank","example[10]":"Let’s have some plain, truthful answers.","example[11]":"I don’t know, and that’s the plain truth.","example[12]":"The plain fact is people still buy books.","signpost[0]":"emphasis","definition[3]":"used to emphasize that a particular type of behaviour, attitude etc is involved, usually a bad one","example[13]":"His motive was plain greed.","example[14]":"When you told him his house was too cold that was just plain bad manners.","signpost[1]":"not beautiful","definition[4]":"not beautiful or attractive – often used because you want to avoid saying this directly","note[3]":"plain Jane (=used to talk about a woman who is not beautiful)","example[15]":"Mrs Jones was a rather plain woman.","definition[5]":"without anything added, or without decoration","example[16]":"a plain shirt","example[17]":"The fireplace was plain apart from a small design at the top.","definition[6]":"not having a lot of decoration or unnecessary things, but attractive","example[18]":"She was wearing a simple black dress.","example[19]":"The accommodation is simple but clean.","display[0]":"austere","definition[7]":"very plain and with very little decoration, or very little in it – used about a room or place that does not make you feel welcome","example[20]":"He dreaded having dinner in that austere dining room.","example[21]":"The building was grey and a little austere.","example[22]":"the austere beauty and grandeur of mountain scenery","display[1]":"spartan","definition[8]":"plain and without anything that would make life easier or more comfortable – used especially about rooms, conditions, or ways of living","example[23]":"Her apartment is quite spartan.","example[24]":"They had a very spartan life.","display[2]":"stark","definition[9]":"very plain in a surprising way, with very little colour or decoration – used about rooms and places","example[25]":"Sam sat looking at the stark white walls.","example[26]":"It is a landscape of stark beauty.","definition[10]":"empty, or not covered by any decorations","example[27]":"Her office seemed very bare now that her desk had gone.","example[28]":"He was tired of looking at the bare walls of his prison cell.","definition[11]":"a large area of flat dry land","example[29]":"The grassy plain gave way to an extensive swamp.","example[30]":"the vast plains of central China","definition[12]":"the ordinary stitch in knitting","collocation[0]":"the open plain(s)","example[31]":"On the open plains of east Africa are zebras, antelopes, and gazelles.","collocation[1]":"the vast/great plain(s)","example[32]":"Beyond lay the vast plains of the Central Valley.","collocation[2]":"a flat plain","example[33]":"Here a group of small hills rises unexpectedly out of the flat plain.","collocation[3]":"a grassy plain","example[34]":"The village is situated on the high grassy plains at the foot of the Sierra.","collocation[4]":"a fertile plain","example[35]":"The rains washed soil down to create fertile plains.","definition[13]":"used to emphasize an adjective, usually one referring to a bad quality","example[36]":"It’s just plain crazy to spend all your pay as soon as you get it."}