{"word[0]":"factory","plural[0]":"factories","definition[0]":"a building or group of buildings in which goods are produced in large quantities, using machines","example[0]":"a car factory","example[1]":"factory workers","form[0]":"NOUN + factory","collocation[0]":"a car/textile/shoe etc factory","example[2]":"There is a large car factory where many of the local people work.","form[1]":"factory + NOUN","collocation[1]":"a factory worker","example[3]":"The factory workers are threatening to go on strike.","collocation[2]":"a factory owner","example[4]":"The factory owner placed a large order for some new equipment.","collocation[3]":"a factory manager","example[5]":"He held the position of factory manager.","collocation[4]":"a factory inspector","example[6]":"Factory inspectors reported that safety precautions had been ignored.","collocation[5]":"the factory gates","example[7]":"A crowd of protesters had gathered outside the factory gates.","collocation[6]":"open a factory","example[8]":"The company has just opened a new factory in Swindon.","collocation[7]":"close/shut (down) a factory","example[9]":"The factory was closed down in 2006.","collocation[8]":"work in a factory","example[10]":"Donna works in a shoe factory.","collocation[9]":"a factory produces/makes something","example[11]":"The factory produces an incredible 100 cars per hour.","example[12]":"She works in a chocolate factory.","example[13]":"a clothing factory","definition[1]":"a large factory where cars, chemicals, or energy is produced","example[14]":"Local residents are protesting about the new nuclear power plant.","example[15]":"a car plant","example[16]":"a nuclear power plant","display[0]":"facility","definition[2]":"a factory. Facility is often used instead of factory  in business English","example[17]":"The new production facility is one of the most up-to-date in the area.","display[1]":"works","definition[3]":"used in the following compounds to describe a factory that produces a particular thing","display[2]":"mill","definition[4]":"a factory that produces paper, cotton, or cloth","example[18]":"a paper mill","example[19]":"The textile mill has been converted into luxury flats.","display[3]":"shipyard","definition[5]":"a place where ships are built or repaired","example[20]":"The vessel was built in the Kobe shipyard.","display[4]":"foundry","definition[6]":"a factory where metal is made into things using moulds","example[21]":"Mandela’s statue was cast here in a local foundry.","display[5]":"sweatshop","definition[7]":"a small factory where people work hard in bad conditions for very little money","example[22]":"The company was fined for selling goods produced in sweatshops.","definition[8]":"a large building or group of buildings where goods are made, using large industrial machinery and usually employing many people","example[23]":"The owner wouldn’t comment on the factory’s future.","example[24]":"the textile factories of Catalonia"}