{"word[0]":"range","signpost[0]":"variety of things/people","definition[0]":"a number of people or things that are all different, but are all of the same general type","example[0]":"students from a wide range of backgrounds","note[0]":"wide/broad/whole/full range of something","example[1]":"advice on a whole range of subjects","example[2]":"A fairly narrow range of people are responsible for key decisions.","note[1]":"narrow/limited range of something","example[3]":"a range of services","note[2]":"range of","example[4]":"The drug is effective against a range of bacteria.","signpost[1]":"limits","definition[1]":"the limits within which amounts, quantities, ages etc vary","example[5]":"Even the cheapest property was out of our price range (=too expensive for us).","example[6]":"toys suitable for children in the pre-school age range","note[3]":"age/price/temperature etc range","example[7]":"a temperature range of 72–85º, ","example[8]":"Your blood pressure’s well within the normal range.","note[4]":"in/within a ... range","example[9]":"a salary in the range of $25,000 to $30,000","note[5]":"in the range (of) something to something","signpost[2]":"products","definition[2]":"a set of similar products made by a particular company or available in a particular shop","example[10]":"The watches in this range are priced at £24.50.","example[11]":"We have a very large product range.","example[12]":"a new range of kitchenware","example[13]":"A company from Darlington has just launched its latest range of fashion jewellery.","definition[3]":"the distance over which a particular weapon can hit things","example[14]":"Both men had been shot at point-blank range.","note[6]":"at close/short/point-blank range","example[15]":"missiles with a range of 3000 km","example[16]":"We waited until the enemy was within range.","note[7]":"within range (of something)","example[17]":"I ducked down to get out of range of the gunshots.","note[8]":"out of/beyond range (of something)","definition[4]":"the distance within which something can be seen or heard","example[18]":"One way to see birds at close range is to attract them into your own garden.","example[19]":"a handsome man who drew admiring glances from any female within range","example[20]":"any spot within range of your radio signal","example[21]":"Joan hoped that the others were out of range of her mother’s voice.","definition[5]":"the distance which a vehicle such as an aircraft can travel before it needs more fuel etc","example[22]":"The plane has a range of 3,600 miles.","definition[6]":"all the musical notes that a particular singer or musical instrument can make","example[23]":"His vocal range is amazing.","signpost[3]":"mountains/hills","definition[7]":"a group of mountains or hills, usually in a line","example[24]":"a land of high mountain ranges and deep valleys","example[25]":"the longest range of hills in the Lake District","note[9]":"range of mountains/hills","signpost[4]":"place for shooting","definition[8]":"an area of land where you can practise shooting or where weapons can be tested","example[26]":"a rifle range","example[27]":"the police shooting range","signpost[5]":"ability","definition[9]":"the number of different things that someone, especially an actor or actress, does well","example[28]":"an actor of extraordinary range and intensity","definition[10]":"a large area of land covered with grass, on which cattle are kept","signpost[6]":"cooking","definition[11]":"a cooker","definition[12]":"a large piece of kitchen equipment in which you make a fire and use this heat to cook food","example[29]":"a coal-fired kitchen range","heading[0]":"– Meaning 1: a number of people or things that are all different, but are all of the same general type","collocation[0]":"a wide/broad range","example[30]":"The Institute organises talks on a wide range of topics.","collocation[1]":"a whole range","example[31]":"He also supports a whole range of other charities.","collocation[2]":"a large/great/huge/vast range","example[32]":"A vast range of plants are used in medicines.","collocation[3]":"a diverse range","example[33]":"During his career he has run a diverse range of businesses.","collocation[4]":"a narrow/limited range","example[34]":"They only had a very limited range of products available.","heading[1]":"– Meaning 3: a set of similar products made by a particular company or available in a particular shop","form[0]":"ADJECTIVES/NOUN + range","collocation[5]":"a full/complete range","example[35]":"The store stocks a full range of groceries.","collocation[6]":"an extensive range","example[36]":"The winner will receive a brand-new kitchen from Magnet’s extensive range.","collocation[7]":"a comprehensive range","example[37]":"We offer a comprehensive range of services for the business traveller.","collocation[8]":"a new/latest range","example[38]":"Body Blitz is a new range of toiletries specially designed for teenagers.","collocation[9]":"a product range","example[39]":"We need to broaden our product range.","collocation[10]":"a colour range","example[40]":"These curtains are available in a much wider colour range.","signpost[7]":"include","definition[13]":"to include a variety of different things or people in addition to those mentioned","example[41]":"The show had a massive audience, ranging from children to grandparents.","note[10]":"range from something to something","definition[14]":"if prices, levels, temperatures etc range from one amount to another, they include both those amounts and anything in between","example[42]":"The shoes range in price from $25 to $100.","note[11]":"range in age/size/price etc","example[43]":"There were 120 students whose ages ranged from 10 to 18.","example[44]":"The population of these cities ranges between 3 and 5 million.","note[12]":"range between something and something","signpost[8]":"deal with many subjects","definition[15]":"to deal with a wide range of subjects or ideas in a book, speech, conversation etc","example[45]":"The discussion ranged widely.","example[46]":"The conversation had ranged over a variety of topics, from sport to current affairs.","note[13]":"range over","signpost[9]":"move around","definition[16]":"to move around in an area without aiming for a particular place","synonym[0]":"wander","example[47]":"Cattle ranged over the pastures in search of food.","note[14]":"range over/through","definition[17]":"to put things in a particular order or position","example[48]":"In the dining room, team photographs were ranged along the wall.","definition[18]":"the limits within which amounts, quantities etc can vary","example[49]":"We are looking at properties within a certain price range.","example[50]":"People in the 35 to 44 age range are most likely to hold more than one job.","example[51]":"Brokers typically charge commissions in the 4% to 8% range.","example[52]":"Sales will rise to a range of $12 million to $13 million.","definition[19]":"the highest and lowest prices reached by a SECURITY (=bond, share etc) or market over a period of time","example[53]":"GM shares traded in the $37 to $42 range for most of last year.","example[54]":"Oil remains in the $70-to-$80-a-barrel range.","example[55]":"a wide range of products and systems","example[56]":"the top of the range (=best sold by a company or shop) Rucanor shoe","definition[20]":"the area of power, responsibility, or activities that a person or organization has","example[57]":"These issues fall outside the range of the enquiry.","definition[21]":"if prices, levels etc range from one amount to another, they include both those amounts and anything in between","example[58]":"The judges’ salaries range from $82,000 to $99,000.","note[15]":"range from/to/between etc","example[59]":"The population of these cities ranges between 3 and 5 million inhabitants.","example[60]":"The mainframe systems range in price from $1.3 million to $3.6 million."}