{"definition[0]":"an attempt to find someone or something","example[0]":"Bad weather is hampering the search for survivors.","example[1]":"Two more bodies were found after a search of the woods.","note[0]":"search of","definition[1]":"a series of actions done by a computer to find information","example[2]":"A search found 46 websites.","example[3]":"an online search","example[4]":"Do a search on ‘rabbit’ and see what it brings up.","note[1]":"perform/run/do a search","example[5]":"a computerized search of 10,000 medical journals","definition[2]":"an attempt to find an explanation or solution","example[6]":"the search for a cure","collocation[0]":"carry out a search","example[7]":"Police have carried out a search of his home.","collocation[1]":"launch/mount a search","example[8]":"A massive search was launched for the former soldier.","collocation[2]":"call off/abandon a search","example[9]":"They called off the search when it got dark.","form[0]":"ADJECTIVES/NOUN + search","collocation[3]":"a thorough/careful search","example[10]":"We conducted a thorough search of the building.","collocation[4]":"a painstaking search","example[11]":"Police officers carried out a painstaking search of the area around the house.","collocation[5]":"a systematic search","example[12]":"They set about a systematic search of the ship.","collocation[6]":"a desperate/frantic search","example[13]":"After the war, many people returned to rural areas in a desperate search for food.","collocation[7]":"a fruitless search","example[14]":"I spent many hours in a fruitless search for accommodation.","collocation[8]":"a police search","example[15]":"Her disappearance sparked a massive police search.","collocation[9]":"a nationwide search","example[16]":"Kim was missing for two months, prompting a nationwide search.","collocation[10]":"a house-to-house search","example[17]":"Police are conducting house-to-house searches in the area where the girl disappeared.","collocation[11]":"a fingertip search","example[18]":"Police have started a fingertip search of the area and appealed for witnesses.","collocation[12]":"the search is on","example[19]":"The search is on for someone with the same blood type.","collocation[13]":"a search is underway","example[20]":"A search is underway for two walkers in the Cairngorm mountains.","form[1]":"search + NOUN","collocation[14]":"the search area","example[21]":"The search area has now been widened.","signpost[0]":"looking","definition[3]":"to try to find someone or something by looking very carefully","example[22]":"It was too dark to search further.","example[23]":"The area was thoroughly searched.","example[24]":"An RAF plane searched for the missing men.","note[2]":"search for somebody/something","example[25]":"I’ve searched high and low (=everywhere) for my glasses.","example[26]":"Detectives are searching the yard for clues.","note[3]":"search something for somebody/something","example[27]":"Alice bent to search through a heap of clothes.","note[4]":"search in/under/through something","definition[4]":"to use a computer to find information","example[28]":"Search the Web for cheap flights.","note[5]":"search something for something","definition[5]":"if someone in authority searches you or the things you are carrying, they look for things you might be hiding","example[29]":"He was searched by the guards for weapons.","note[6]":"search somebody for something","signpost[1]":"solution","definition[6]":"to try to find an explanation or solution","example[30]":"Scientists are still searching for a cure.","example[31]":"She paused, searching for inspiration.","signpost[2]":"examine","definition[7]":"to examine something carefully in order to find something out, decide something etc","example[32]":"Anya searched his face anxiously.","collocation[15]":"search something carefully","example[33]":"We searched the whole house carefully, but didn’t find anything.","collocation[16]":"search something thoroughly","example[34]":"They searched the garden thoroughly.","collocation[17]":"search frantically/desperately","example[35]":"Panic-stricken parents frantically searched for their children.","collocation[18]":"search high and low","example[36]":"We searched high and low for him, but couldn’t find him.","collocation[19]":"search something from top to bottom","example[37]":"They searched the house from top to bottom.","collocation[20]":"search in vain","example[38]":"He searched in vain for a means of escape.","definition[8]":"to look carefully for someone or something","example[39]":"Detectives continue to search for clues.","example[40]":"She searched through all his clothes.","display[0]":"look for somebody/something","definition[9]":"to try to get someone or something you want or need","example[41]":"I’m looking for something to wear for my sister’s wedding.","example[42]":"The band is looking for a singer.","example[43]":"He’s decided to look for a new career.","display[1]":"try to find somebody/something","definition[10]":"used especially when someone or something is difficult to find","example[44]":"I spent half an hour trying to find a parking space.","example[45]":"She was in the kitchen, trying to find something to eat that wasn’t raw carrot.","display[2]":"seek","definition[11]":"to try to find something or someone – used especially about jobs, help, or information. Also used in newspaper advertisements when trying to find a suitable person","example[46]":"They went there seeking work.","example[47]":"She decided to seek help.","example[48]":"Tall blond 18-year-old male seeks female 17+ for friendship.","display[3]":"hunt","definition[12]":"to look for someone or something. Used when you look very carefully and thoroughly, or in the phrase house/job/bargain hunting","example[49]":"I’ve hunted everywhere, but I can’t find a recipe for French onion soup.","example[50]":"She’s gone out bargain-hunting in the sales.","display[4]":"be on the lookout for somebody/something","definition[13]":"to be continuously looking for someone or something","example[51]":"I’m always on the lookout for a good bargain.","display[5]":"leave no stone unturned","definition[14]":"to look for someone or something in every possible place","example[52]":"The police say they will leave no stone unturned in their search for the killer.","definition[15]":"an attempt to find someone or something, usually one that takes a lot of time","example[53]":"Their offer ended a five-month search for a buyer for the company.","example[54]":"Graduates in debt simply can’t afford lengthy job searches.","definition[16]":"when police or other people with official power look through someone’s possessions, business records etc because they think they have done something illegal","example[55]":"Evidence of copyright infringement was found during a recent search of the company offices.","definition[17]":"the action of looking for information in a computer’s memory or on the Internet","example[56]":"I did a search on the company and found out it had a lot of money in real estate.","note[7]":"search on","definition[18]":"to spend time looking for someone or something","example[57]":"We searched the whole state for a contractor.","example[58]":"Geophysical methods are widely used in searching for oil.","definition[19]":"to look for information on a computer or on the Internet","example[59]":"You have to wait a few minutes while the software is searching.","example[60]":"Try searching the web using a Subject Directory Service.","example[61]":"I spent my lunch hour searching the Internet for a cheap flight.","note[8]":"seacrch something for something"}