{"word[0]":"buck","signpost[0]":"dollar","definition[0]":"a US, Canadian, or Australian dollar","note[0]":"make a fast/quick buck (=make some money quickly, often dishonestly)","example[0]":"He owes me ten bucks.","example[1]":"The movie is about a group of men trying to make a buck  (=earn some money) as male strippers.","example[2]":"Using celebrities in advertising is guaranteed to pull in big bucks.","note[1]":"big/mega bucks","definition[1]":"a male rabbit, deer, and some other male animals","signpost[1]":"man","definition[2]":"a young man","signpost[2]":"horse","definition[3]":"if a horse bucks, it kicks its back feet into the air, or jumps with all four feet off the ground","signpost[3]":"move suddenly","definition[4]":"to suddenly move up and down, or backwards and forwards, in an uncontrolled way","example[3]":"The plane bucked sharply.","signpost[4]":"oppose","definition[5]":"to oppose something in a direct way","example[4]":"He was a rebel who bucked the system  (=opposed rules or authority).","example[5]":"Unemployment in the area has bucked the trend by falling over the last month.","example[6]":"Initially, he had bucked against her restraints.","note[2]":"buck against","signpost[5]":"make somebody happier","definition[6]":"to make someone feel more happy, confident, or healthy","example[7]":"He was bucked by the success he’d had.","example[8]":"She gave me a tonic which bucked me a little.","definition[7]":"a dollar","example[9]":"I owe 500 bucks but I haven’t paid yet.","example[10]":"I hope that you guys can make a buck (=earn some money) out of it.","example[11]":"There are big bucks (=a lot of money) to be made from sport.","example[12]":"We won’t sacrifice investments in research and development for the sake of a fast buck (=money that you can make quickly and easily).","definition[8]":"to do something that goes against the rules or against the normal way of doing something","example[13]":"Those who try to buck the system tend to miss out on promotion.","definition[9]":"to do well in business when other companies are doing badly","example[14]":"Britain will buck the global recessionary trend next year with growth of around 1.1pc."}