{"word[0]":"deteriorate","definition[0]":"to become worse","example[0]":"Ethel’s health has deteriorated.","example[1]":"America’s deteriorating economy","explanation[0]":"In everyday English, people usually say get worse rather than deteriorate:","example[2]":"Her health got worse.","example[3]":"The situation is getting worse.","example[4]":"Air quality is rapidly deteriorating in our cities.","example[5]":"Living conditions here have deteriorated in the past few years.","display[0]":"get worse","definition[1]":"to become worse. Get worse is less formal and more common than deteriorate in everyday English","example[6]":"My eyesight seems to be getting worse.","example[7]":"He’s never been well-behaved, but he’s getting even worse.","display[1]":"go down","definition[2]":"to become gradually worse – used especially about the standard of something","example[8]":"The hotel’s gone down since its management changed.","example[9]":"Nick’s teachers say that his work has gone down recently.","display[2]":"go downhill","definition[3]":"to become much worse and be in a very bad condition, especially after a particular time or event","example[10]":"During the recession the business began to go downhill.","example[11]":"Her health went downhill rapidly after Christmas.","display[3]":"decline","definition[4]":"to become gradually worse – used especially about standards of living, education, health etc","example[12]":"After the war, the standard of living declined.","example[13]":"Over the years, the standard of public transport has declined.","display[4]":"degenerate","definition[5]":"to become worse, or to become something bad instead of something good","example[14]":"Relations between the two countries have degenerated.","example[15]":"The debate degenerated into an argument between the two sides.","display[5]":"escalate","definition[6]":"to become much worse very quickly – used especially about fighting, violence, or a bad situation","example[16]":"Further violence could escalate into a full-scale armed conflict.","example[17]":"The political crisis escalated.","display[6]":"spiral out of control","definition[7]":"to become worse in a way that cannot be controlled and is extremely serious and worrying","example[18]":"Police say that the violence has spiralled out of control.","example[19]":"Scientists are worried that global warming could soon spiral out of control.","example[20]":"Costs have been spiralling out of control.","example[21]":"The economy deteriorated further in August, with orders for manufactured goods falling."}