{"word[0]":"observation","definition[0]":"the process of watching something or someone carefully for a period of time","example[0]":"He spent two nights under close observation in hospital.","example[1]":"His orders were to keep the men under observation.","example[2]":"Art classes help develop children’s powers of observation.","example[3]":"Careful observation suggests that this is not the case.","example[4]":"Detailed observations were carried out on the behaviour of the students.","example[5]":"From their direct observations, children absorb a model of marriage.","example[6]":"Bloomfield’s approach to linguistics was based on observation of the language.","note[0]":"observation of","definition[1]":"something that you notice when watching something or someone","example[7]":"Some interesting observations emerged from this research.","definition[2]":"a spoken or written remark about something you have noticed","example[8]":"Darwin’s observations on the habits of certain birds","note[1]":"observation on","example[9]":"Paz makes some observations about the role of the critic.","note[2]":"observation about","definition[3]":"the act of obeying a law etc","synonym[0]":"observance","collocation[0]":"be under observation","example[10]":"The police said that the house had been under observation.","collocation[1]":"keep somebody under observation","example[11]":"The doctor ordered that the patient be kept under observation.","collocation[2]":"somebody’s powers of observation","example[12]":"In the past, people used their own powers of observation to forecast the weather.","form[0]":"ADJECTIVES/NOUN + observation","collocation[3]":"close/careful/detailed observation","example[13]":"A lot of useful knowledge is gained by careful observation of the world around you.","collocation[4]":"casual observation","example[14]":"Even casual observation makes this theory improbable.","collocation[5]":"direct observation","example[15]":"Piaget developed his theories based on direct observation of children.","collocation[6]":"personal observation","example[16]":"I knew cigarettes were addictive from personal observation.","collocation[7]":"scientific observation","example[17]":"Scientific observation led to the discovery of vaccines.","collocation[8]":"classroom observation","example[18]":"Classroom observation is only part of what school inspectors do.","form[1]":"observation + NOUN","collocation[9]":"an observation post/point","example[19]":"The peak of the mountain was a natural location for an observation post.","collocation[10]":"an observation deck/platform/tower","example[20]":"The army built an observation tower on the top of the building.","collocation[11]":"a period of observation","example[21]":"The hospital released him after a period of observation."}