{"signpost[0]":"way of standing/sitting etc","definition[0]":"the way someone is standing, sitting, or lying","example[0]":"Lie in a comfortable position.","example[1]":"Frankie shifted his position so that his knees would not become cramped.","example[2]":"I struggled up into a sitting position.","note[0]":"sitting/kneeling/standing position","signpost[1]":"situation","definition[1]":"the situation that someone is in, especially when this affects what they can and cannot do","example[3]":"I’m not sure what I would do if I were in your position.","example[4]":"You’re putting me in rather a difficult position.","example[5]":"Next week we will be in a much better position to comment.","note[1]":"be in a position to do something","example[6]":"She is in the enviable position of having three job offers.","note[2]":"be in the position of doing something","signpost[2]":"place where somebody/something is","definition[2]":"the place where someone or something is, especially in relation to other objects and places","example[7]":"Our hotel was in a superb central position near St Mark’s Square.","example[8]":"the strategic position (=useful or important position) of Egypt in relation to the Arabian peninsula","example[9]":"the position of the sun in the sky","note[3]":"position of","signpost[3]":"correct place","definition[3]":"the place where someone or something is needed or supposed to be","example[10]":"He pulled the ladder into position.","note[4]":"into position","example[11]":"All parking signs have now been placed in position.","note[5]":"in/out of position","definition[4]":"the direction in which an object is pointing","example[12]":"She turned the switch to the ‘on’ position.","example[13]":"Make sure the container remains in an upright position.","note[6]":"vertical/upright/horizontal position","definition[5]":"an opinion or judgment on a particular subject, especially the official opinion of a government, a political party, or someone in authority","synonym[0]":"attitude","example[14]":"The principal took the position that the students didn’t need music classes.","example[15]":"I hope you’ll reconsider your position.","example[16]":"What’s the party’s position on tax reform?","note[7]":"position on","definition[6]":"a job","example[17]":"Bill took up his new position as Works Director in October.","note[8]":"somebody’s position as something","example[18]":"She has held the position of Chief Financial Officer since 1992.","example[19]":"Bruce is thinking of applying for the position.","example[20]":"I’m sorry, the position has been filled (=someone has been found to do the job).","signpost[4]":"level/rank","definition[7]":"someone’s or something’s level, authority, or importance in a society or organization","note[9]":"abuse your position as something (=use your authority wrongly)","example[21]":"As a priest, he was in a position of trust.","example[22]":"Many of his supporters used their positions of power for personal advantage.","note[10]":"position of power/authority/influence etc","example[23]":"the position of women in society","note[11]":"the position of somebody","signpost[5]":"race/competition","definition[8]":"the place of someone or something in a race or competition in relation to the other people or things","example[24]":"Alesi finished in third position.","note[12]":"(in) 2nd/3rd/4th etc position","definition[9]":"the area where someone plays in a sport, or the type of actions they are responsible for doing","example[25]":"What position do you play?","definition[10]":"a place where an army has put soldiers, guns etc","example[26]":"an attack on the enemy positions","heading[0]":"– Meaning 1: the way someone is standing, sitting, or lying","collocation[0]":"a comfortable position","example[27]":"She wriggled into a more comfortable position.","collocation[1]":"an awkward position","example[28]":"My foot was in an awkward position.","collocation[2]":"a sitting/kneeling/standing position","example[29]":"The priest rose from his kneeling position by the bed.","collocation[3]":"a foetal position","example[30]":"I crawled into my bed and curled up in a foetal position.","collocation[4]":"change/shift your position","example[31]":"He shifted his position to get a better view of the stage.","collocation[5]":"pull/drag/haul yourself into a position","example[32]":"She pulled herself into a sitting position.","collocation[6]":"assume/adopt a position","example[33]":"The patient should adopt this position for five minutes every half hour.","collocation[7]":"hold a position","example[34]":"Pull in your tummy muscles and hold that position.","heading[1]":"– Meaning 2: the situation that someone is in, especially when this affects what they can and cannot do","collocation[8]":"the same position","example[35]":"A lot of people are in the same position.","collocation[9]":"a similar position","example[36]":"You can ask to be put in contact with others in a similar position.","collocation[10]":"a strong/good position","example[37]":"A victory tonight will put them in a very strong position to win the cup.","collocation[11]":"a unique position","example[38]":"Their close knowledge of the area places them in a unique position to advise on social policy.","collocation[12]":"a difficult/awkward position","example[39]":"I was in the difficult position of having to choose between them.","collocation[13]":"an enviable position","example[40]":"He is in the enviable position of not needing to work.","collocation[14]":"an impossible position","example[41]":"She was furious with Guy for putting her in such an impossible position.","collocation[15]":"a weak position","example[42]":"Someone who is desperate to sell their house is in a weak position.","collocation[16]":"a vulnerable position","example[43]":"Today we are in the vulnerable position of producing barely half our own food.","collocation[17]":"the present/current position","example[44]":"The following statistics indicate the present position.","collocation[18]":"the legal position","example[45]":"The legal position is far from clear.","collocation[19]":"somebody’s financial position","example[46]":"Has your financial position changed recently?","collocation[20]":"a bargaining/negotiating position","example[47]":"The new law has strengthened workers' bargaining position.","collocation[21]":"be in a strong/weak etc position","example[48]":"We are in a good position to help.","collocation[22]":"find yourself in a similar/awkward etc position","example[49]":"The refugee organizations now found themselves in a difficult position.","collocation[23]":"reach a position","example[50]":"It has taken two years to reach the position we are now in.","collocation[24]":"put/place somebody in a good/awkward etc position","example[51]":"I'm sorry if I put you in an awkward position.","collocation[25]":"strengthen somebody’s position","example[52]":"People said that he used the conflict to strengthen his own position.","collocation[26]":"weaken somebody’s position","example[53]":"The prime minister's position had been weakened by allegations of financial mismanagement.","collocation[27]":"somebody’s position improves","example[54]":"By March, the Democrats' position had improved.","collocation[28]":"a position of strength","example[55]":"By now they were negotiating from a position of strength.","heading[2]":"– Meaning 6: an opinion or judgment on a particular subject, especially the official opinion of a government, a political party, or someone in authority","collocation[29]":"take/hold a position","example[56]":"We take the position that these changes are to be welcomed.","collocation[30]":"adopt a position","example[57]":"In 1898, the Church adopted its current position.","collocation[31]":"change your position","example[58]":"Since then, the party has changed its position.","collocation[32]":"reconsider your position","example[59]":"The UN Secretary General urged the US to reconsider its position.","collocation[33]":"defend a position","example[60]":"Each of the next three speakers defended a different position.","collocation[34]":"an official position","example[61]":"This was the French government’s official position.","collocation[35]":"an extreme position","example[62]":"Few people hold this extreme position today.","collocation[36]":"a middle position","example[63]":"They took a middle position, favouring decentralization but with some controls.","collocation[37]":"a neutral position","example[64]":"The US claimed that Jordan had abandoned its neutral position and sided with Iraq.","heading[3]":"– Meaning 7: a job","example[65]":"She had previously held a senior position in another school.","collocation[38]":"apply for a position","example[66]":"I decided to apply for the position of head teacher.","collocation[39]":"take up a position","example[67]":"Woods took up a new position as managing director of a company in Belfast.","collocation[40]":"leave a position","example[68]":"He left his position as Chief Conductor of the Moscow Radio Symphony Orchestra.","collocation[41]":"resign from a position","example[69]":"She has resigned from her position as department secretary.","collocation[42]":"offer somebody a position","example[70]":"They offered me the position of store manager.","collocation[43]":"fill a position","example[71]":"We are now seeking to fill some key positions in the company.","collocation[44]":"a senior position","example[72]":"Decision making is done by managers holding the most senior positions.","collocation[45]":"a junior position","example[73]":"I left school and was offered a junior position in a bank.","collocation[46]":"a permanent/temporary position","example[74]":"It's a temporary position initially, for six months.","example[75]":"He has no official position in the government.","heading[4]":"– Meaning 8: someone’s or something’s level, authority, or importance in a society or organization","collocation[47]":"a position of power/authority","example[76]":"Many used their positions of power for personal advantage.","collocation[48]":"a position of influence","example[77]":"The media have an unrivalled position of influence.","collocation[49]":"a position of trust","example[78]":"As a church leader, he was in a position of trust.","collocation[50]":"a position of responsibility","example[79]":"Did you hold any positions of responsibility at school or university?","collocation[51]":"a position of leadership","example[80]":"She had risen to a position of leadership.","collocation[52]":"a privileged position","example[81]":"The public expects the Royal Family to earn its privileged position.","collocation[53]":"an influential position","example[82]":"It's useful if you have friends in influential positions.","collocation[54]":"a powerful position","example[83]":"Many leaders from that period are still in powerful positions in government.","collocation[55]":"a dominant position","example[84]":"The firm achieved a dominant position in the world market.","collocation[56]":"occupy a position","example[85]":"Those who occupy positions of power do not want democracy.","collocation[57]":"maintain a position","example[86]":"High-status groups do all they can to maintain their positions.","collocation[58]":"use your position","example[87]":"She can now use her position to do some good.","collocation[59]":"abuse your position","example[88]":"He abused his position as a doctor.","heading[5]":"describing someone’s position in an organization","display[0]":"senior","definition[11]":"used about someone who has an important position in an organization. Senior can also be used about someone who has a higher position than you in an organization","example[89]":"a senior executive","example[90]":"She’s a senior partner in a law firm.","example[91]":"She is senior to me.","display[1]":"chief","definition[12]":"used, especially in job titles, about someone who has the most important or one of the most important positions in an organization","example[92]":"Carole is the company’s chief financial officer.","example[93]":"He’s the chief economist at Hangseng Bank.","display[2]":"high-ranking","definition[13]":"used about someone who has a high position in an organization such as the government, the army, or the police","example[94]":"high-ranking government officials","example[95]":"a high-ranking police officer","display[3]":"top","definition[14]":"used about someone who is very good, important, or successful in their job","example[96]":"a top lawyer","example[97]":"He’s one of the president’s top aides.","example[98]":"top diplomats","display[4]":"junior","definition[15]":"used about someone who has a low position in an organization. Junior can also be used about someone who has a lower position than you in an organization","example[99]":"a junior clerk","example[100]":"a junior doctor","example[101]":"His role as naval officer was junior to Nelson.","display[5]":"assistant","definition[16]":"an assistant manager, director, editor etc has a position just below a manager etc","example[102]":"He’s an assistant professor of neurology at Harvard University.","example[103]":"She became assistant director at the Belgrade Theatre.","definition[17]":"to carefully put something in a particular position","example[104]":"Position the cursor before the letter you want to delete.","example[105]":"I positioned myself where I could see the door.","note[13]":"position yourself","definition[18]":"the situation that a person or organization is in, or the situation concerning a particular subject","example[106]":"The company is in a strong financial position, with more than $7 million in cash and no short-term debt.","example[107]":"The investment would weaken the company’s competitive position.","example[108]":"The new legislation puts the unions in a difficult position.","example[109]":"What’s the present position with regard to import restrictions?","definition[19]":"to be able to do something because you have the ability, money, or power to do it","example[110]":"We will refund your money when we are in a position to do so.","definition[20]":"to try to get an advantage over other people who are all trying to succeed in the same activity","example[111]":"US advertising agencies are jostling for position in Eastern Europe.","definition[21]":"the level or rank someone or something has in society or in an organization","example[112]":"He was a doctor with a respectable position in society.","note[14]":"position in","example[113]":"We need more women in positions of authority and influence in television.","example[114]":"Financial institutions are in a unique position of trust when handling funds belonging to the public.","example[115]":"He did not want to be accused of abusing his position (=using his authority wrongly).","definition[22]":"a job, especially an important one","example[116]":"She is retiring from her position as chief executive.","note[15]":"position as","example[117]":"Twelve people applied for the position (=asked to have the job).","example[118]":"He is filling a position (=taking a job) that has been vacant since July.","example[119]":"He has been offered amanagement position in Cairo.","example[120]":"He is older than most executives in their first senior position (=important job) abroad.","definition[23]":"someone’s opinion or judgement on something","example[121]":"What’s your position on using freelance staff?","definition[24]":"an investment in something, or the amount invested","example[122]":"The family has a recent history of buying positions of over 5% in public companies.","example[123]":"It said it will take a 10% equity position (=buy 10% of the shares) in the company.","example[124]":"After we have earned a modest profit, we will simply cash our position out (=sell our investment).","definition[25]":"if you position yourself in a particular way, or if something positions you in that way, you are prepared for a situation that you want to happen or think is going to happen","example[125]":"It has been working to position itself as a seller of group health insurance to major corporations.","example[126]":"The company’s restructuring has positioned it to compete more effectively.","definition[26]":"if a company positions a product in a particular way, it tries to get people to think about it in that way in relation to the company’s other products and to competing products","example[127]":"The trend over the past decade has been to position pizza as a health food.","example[128]":"We’re trying to position the product toward younger buyers."}