{"word[0]":"start","signpost[0]":"begin doing something","definition[0]":"to do something that you were not doing before, and continue doing it","synonym[0]":"begin","example[0]":"There’s so much to do I don’t know where to start.","example[1]":"Have you started your homework?","example[2]":"He got up and started running again.","example[3]":"I’d better get started (=start doing something) soon.","example[4]":"Then the baby started crying.","note[0]":"start doing something","example[5]":"It’s starting to rain.","note[1]":"start to do something","example[6]":"What Kerry said started me thinking  (=made me start thinking).","note[2]":"start somebody doing something","signpost[1]":"begin happening","definition[1]":"to begin happening, or to make something begin happening","example[7]":"What time does the film start?","example[8]":"Lightning started a fire that burned 500 acres.","example[9]":"The party was just getting started when Sara arrived.","example[10]":"You have two hours to complete the test, starting now.","note[3]":"starting (from) now/tomorrow/next week etc","signpost[2]":"begin in a particular way","definition[2]":"to begin something in a particular way, or to begin in a particular way","example[11]":"A healthy breakfast is a good way to start the day.","example[12]":"Any new exercise program should start slowly.","note[4]":"start badly/well/slowly etc","example[13]":"The festivities started with a huge fireworks display.","note[5]":"start with","example[14]":"The restaurant started as a small take-out place.","note[6]":"start as","example[15]":"Chao starts by explaining some basic legal concepts.","note[7]":"start (something) by doing something","signpost[3]":"business/organization","definition[3]":"to make something begin to exist","example[16]":"She wanted to start her own catering business.","note[8]":"start a business/company/firm etc","signpost[4]":"job/school","definition[4]":"to begin a new job, or to begin going to school, college etc","example[17]":"When can you start?","example[18]":"I started college last week.","note[9]":"start school/college/work","signpost[5]":"car/engine etc","definition[5]":"if you start a car or engine, or if it starts, it begins to work","example[19]":"The car wouldn’t start this morning.","example[20]":"He couldn’t get his motorbike started.","note[10]":"get the car/engine etc started","signpost[6]":"begin going somewhere","definition[6]":"to begin travelling or moving in a particular direction","synonym[1]":"set out","example[21]":"We’ll have to start early to get there by lunchtime.","signpost[7]":"life/profession","definition[7]":"to begin your life or profession in a particular way or place","example[22]":"It’s difficult for new lawyers to get started in private practice.","example[23]":"She started as a dancer in the 1950s.","note[11]":"start as/in","signpost[8]":"road/river/path etc","definition[8]":"if a river, road, path etc starts somewhere, it begins in that place","example[24]":"The trail starts immediately behind the hotel.","example[25]":"The race will start at the town hall.","note[12]":"start in/at","signpost[9]":"prices/amounts","definition[9]":"if prices, amounts, or rates start at or from a particular number, that is the lowest number at which you can get or buy something","example[26]":"Room prices start from £25 a night.","note[13]":"start at/from","signpost[10]":"deliberately begin something","definition[10]":"to deliberately make something start happening, especially something bad","example[27]":"I started a fire to warm the place up.","example[28]":"Other girls were starting rumours about me.","example[29]":"Oh, don’t go trying to start an argument.","note[14]":"start a fight/argument","definition[11]":"if a player starts in a game, or if someone starts them, they begin playing when the game begins, especially because they are one of the best players on the team","example[30]":"Astacio started for the Dodgers on Tuesday night.","note[15]":"start for","signpost[11]":"move suddenly","definition[12]":"to move your body suddenly, especially because you are surprised or afraid","synonym[2]":"jump","example[31]":"A loud knock at the door made her start.","example[32]":"Emma started from her chair and rushed to the window.","note[16]":"start from","explanation[0]":"Start belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[1]":"In this sentence, ‘the show’ is the object of start","example[33]":"We’ll start the show at 730","explanation[2]":"In this sentence, ‘the show’ is the subject of start","example[34]":"The show will start at 730","heading[0]":"to start doing something","definition[13]":"to begin doing something","example[35]":"I’m starting a new job next week.","example[36]":"It’s time we started.","definition[14]":"to start doing something. Begin is more formal than start, and is used especially in written English","example[37]":"He began to speak.","example[38]":"The orchestra began playing.","example[39]":"Shall we begin?","display[0]":"commence","example[40]":"The company will commence drilling next week.","example[41]":"Work was commenced on the next power station.","display[1]":"get down to something","definition[15]":"to finally start doing something, especially your work","example[42]":"Come on, Sam – it’s time you got down to some homework.","example[43]":"We’d better get down to business.","display[2]":"set off","definition[16]":"to start a journey","example[44]":"What time do you have to set off in the morning?","example[45]":"I usually set off for work at about 8.30.","definition[17]":"to start a long journey","example[46]":"The ship set out from Portsmouth on July 12th.","display[3]":"embark on something","definition[18]":"to start something, especially something new, difficult, or exciting","example[47]":"The Law Society has embarked on a major programme of reform.","example[48]":"Jamaica was embarking on a decade of musical creativity.","display[4]":"resume","definition[19]":"to start doing something again after stopping it or being interrupted","example[49]":"Normal train services will be resumed on April 5th.","example[50]":"Trade was resumed after the end of the war.","display[5]":"get cracking","definition[20]":"to start doing something or going somewhere","example[51]":"I think we should get cracking straightaway.","heading[1]":"to start happening","display[6]":"start/begin","definition[21]":"to begin","definition[22]":"to start. Begin is more formal than start and is used especially in written English","example[52]":"The trial began in March.","example[53]":"Work on the new bridge will begin early next year.","definition[23]":"to start being shown to the public – used about a play, show, or exhibition","example[54]":"Lloyd Webber’s new musical opened in London last week.","example[55]":"A major exhibition of her work will open in New York in November.","example[56]":"The voting has already commenced.","example[57]":"The work is scheduled to commence in April.","display[7]":"get under way","definition[24]":"to start happening or being done – used especially about something that is likely to last a long time","example[58]":"Construction work is getting under way on a new train network.","example[59]":"Discussions concerning the plan got under way on April 2.","display[8]":"break out","definition[25]":"to start happening – used especially about a fire, a fight, war, or a disease","example[60]":"Police were called in when fighting broke out in the crowd.","example[61]":"The blaze broke out on the third floor of the hotel.","display[9]":"kick off","definition[26]":"to start – used especially about a football game or a meeting","example[62]":"The match is due to kick off this afternoon at Wembley Stadium.","example[63]":"What time will the celebrations kick off?","signpost[12]":"of an activity/event","definition[27]":"the first part of an activity or event, or the point at which it begins to develop","example[64]":"She read the letter from start to finish without looking up.","example[65]":"He wanted an early start on his election campaign.","example[66]":"We’ve had problems with this project right from the start.","note[17]":"(right) from the start","example[67]":"a free bottle of wine to get your holiday off to a great start","note[18]":"get off to a good/bad etc start","example[68]":"After a rocky start, the show is now very popular.","note[19]":"a rocky/shaky/slow etc start","example[69]":"We arrived late and missed the start of the film.","note[20]":"start of","signpost[13]":"of a period of time","definition[28]":"the first part of a particular period of time","synonym[3]":"beginning","example[70]":"the start of an election year","note[21]":"the start of the year/day/season","example[71]":"Since the start of 1992, the company has doubled in size.","signpost[14]":"sudden movement","definition[29]":"a sudden movement of your body, usually caused by fear or surprise","example[72]":"She said his name, and Tom gave a start (=made a sudden movement).","example[73]":"Ted woke up with a start and felt for the light switch.","note[22]":"with a start","signpost[15]":"being ahead","definition[30]":"the amount of time or distance by which one person is ahead of another, especially in a race or competition","example[74]":"The prisoners had a three-hour start on their pursuers.","note[23]":"start on","definition[31]":"the beginning of someone’s job, which they will develop in the future, especially a job that involves acting, writing, painting etc","example[75]":"Pacino got his start on the stage, before his success in films.","example[76]":"I gave you your start, so remember me when you win the Pulitzer Prize.","definition[32]":"a job that has just started, a business that has just been started, or someone who has just started a new job","example[77]":"The number of business starts plummeted 10.5% during the second half of the year.","example[78]":"a training course for new starts","definition[33]":"a race or competition that someone has taken part in","example[79]":"The horse Exotic Wood was unbeaten in five starts.","definition[34]":"an occasion when a player plays when a sports match begins","example[80]":"Jackson played in 353 games, with 314 starts.","collocation[0]":"a good/great start","example[81]":"A 3-0 win is a good start for the team.","collocation[1]":"a flying start","example[82]":"The appeal got off to a flying start at the weekend when the group held a raffle.","collocation[2]":"a promising start","example[83]":"Her teacher says she's made a promising start in learning Spanish.","collocation[3]":"a bad/poor/disastrous start","example[84]":"Things got off to a bad start when two people turned up late.","collocation[4]":"a rocky/shaky start","example[85]":"After a shaky start, they managed two wins in five matches.","collocation[5]":"a disappointing start","example[86]":"He accepted full responsibility for the club’s disappointing start to the season.","collocation[6]":"a slow start","example[87]":"Work got off to a very slow start because of bad weather.","collocation[7]":"an auspicious/inauspicious start","example[88]":"His second term in office has got off to an extremely inauspicious start.","collocation[8]":"an early/late start","example[89]":"It was long trip so we had planned an early start.","example[90]":"On your first day at work, you want to get off to a good start.","collocation[9]":"make a good/bad/early etc start","example[91]":"He made a flying start at college, but then he didn't manage to keep it up.","collocation[10]":"have a good/bad etc start","example[92]":"We’ve had a disappointing start but we are hoping to improve.","definition[35]":"(Strategic Arms Reduction Talks) talks between the US and the former Soviet Union, which aimed to reach agreement about reducing the number of nuclear weapons that each country kept. Two START Treaties  (=official agreements)  were signed, START I (1991) and START II (1993), in which each country promised to destroy several types of nuclear weapons","definition[36]":"if prices start at or from a particular figure, that is the lowest figure at which you can buy something, for example for the most basic product, service etc in a range","example[93]":"Delivery prices start at £10.40.","definition[37]":"to create a new business or new business activity","example[94]":"My brother started his own plumbing business when he was only 24.","example[95]":"On April 5 the airline started up a Stansted to Waterford daily link.","example[96]":"How soon can you start?","example[97]":"The sales manager phoned this morning to ask if I could start next week.","definition[38]":"the beginning of an activity, event, or situation","example[98]":"The share price has increased by 22% since the start of the year.","example[99]":"They’ve had problemsright from the start.","example[100]":"The whole process takes 10 days from start to finish.","example[101]":"Shops got off to a bad start in the weeks after currency union.","definition[39]":"a job that has just started, a business that has just been created, or someone who has just started a new job","example[102]":"The number of business starts plummeted 10.5% during the second half.","definition[40]":"the beginning of a new job","example[103]":"He went to the building site and asked if there was any chance of a start.","definition[41]":"a situation in which you have an advantage over other people","example[104]":"We’ve got a real head start on the rest of the industry, and very few real competitors."}