{"word[0]":"extra","definition[0]":"more of something, in addition to the usual or standard amount or number","example[0]":"Could you get an extra loaf of bread?","example[1]":"Allow extra time for your journey.","example[2]":"Drivers are advised to take extra care.","example[3]":"Residents can use the gym at no extra cost.","example[4]":"I asked for an extra two weeks to finish the work.","note[0]":"an extra ten minutes/three metres etc","definition[1]":"if something is extra, it is not included in the price of something and you have to pay more for it","opposite[0]":"included","example[5]":"Dinner costs $15 but wine is extra.","definition[2]":"in addition to the usual or standard cost, time, amount etc","example[6]":"They let the kids stay up an extra hour.","example[7]":"Some stores charge extra for delivery.","example[8]":"Postage is extra.","display[0]":"additional","definition[3]":"more than the basic amount or the amount that you expected or agreed. Additional  is more formal than extra","example[9]":"An evening job would provide additional income.","example[10]":"There may be an additional charge for paying bills by credit card.","display[1]":"added","definition[4]":"extra – used when talking about something that makes something better or more effective","example[11]":"an added benefit","example[12]":"an added precaution","example[13]":"It was a beautiful place, and the good weather was an added bonus.","example[14]":"Use a sunscreen for added protection.","display[2]":"spare","definition[5]":"kept in addition to the one you usually use, so that it is available if the one you usually use breaks, gets lost etc","example[15]":"a spare key","example[16]":"a spare tyre","example[17]":"a spare set of clothes","definition[6]":"in addition to the usual things or the usual amount","example[18]":"They need to offer something extra to attract customers.","example[19]":"I got a few extra in case anyone else decides to come.","note[1]":"one/a few etc extra","example[20]":"I’ll be making $400 extra a month.","definition[7]":"used to emphasize an adjective or adverb","example[21]":"You’re going to have to work extra hard to pass the exam.","example[22]":"an extra special effort","definition[8]":"an amount of something, especially money, in addition to the usual, basic, or necessary amount","synonym[0]":"more","example[23]":"I earn extra for working on Sunday.","note[2]":"pay/charge/cost etc extra","definition[9]":"something which is added to a basic product or service that improves it and often costs more","example[24]":"Tinted windows and a sunroof are optional extras (=something that you can choose to have or not).","example[25]":"Be careful, there may be hidden extras (=additional charges which you are not told about).","example[26]":"It’s got lots of useful little extras.","definition[10]":"an actor in a film who does not say anything but is part of a crowd","example[27]":"He started his acting career as an extra.","definition[11]":"outside or beyond","example[28]":"extragalactic  (=outside our galaxy)","example[29]":"extracellular  (=outside a cell)","definition[12]":"very or more than normal","example[30]":"extra-large","example[31]":"extra-strong","example[32]":"extra-special","definition[13]":"more than normal, or in addition to something else","example[33]":"We will be advertising for 200 extra staff.","example[34]":"an extra 1% on National Insurance contributions","definition[14]":"something which is added on, especially charges on a bill","example[35]":"Cruise control is available as an optional extra.","example[36]":"Be clear about what you are paying for, as there may be hidden extras."}