{"word[0]":"behave","definition[0]":"to do things that are good, bad, sensible etc","synonym[0]":"act","example[0]":"She behaved in a very responsible way.","example[1]":"I think he behaved disgracefully towards you.","note[0]":"behave towards","example[2]":"grown men behaving like schoolboys","note[1]":"behave like","example[3]":"He was a little boy, but he behaved as if he was an adult.","note[2]":"behave as if/though","definition[1]":"to not do things that annoy or offend people","opposite[0]":"misbehave","example[4]":"Will you children please behave!","example[5]":"I hope Nicholas behaved himself at the party.","example[6]":"a badly-behaved class","note[3]":"well-behaved/badly-behaved","definition[2]":"if something behaves in a particular way, it does those things","example[7]":"Quantum mechanics is the study of the way atoms behave.","definition[3]":"to do and say things that are good, bad, normal, strange etc","example[8]":"His teacher said he’d been behaving badly at school.","example[9]":"I’m not going to talk to her until she starts behaving reasonably.","example[10]":"Oh, be quiet! You’re behaving like a two-year-old.","definition[4]":"to behave in a particular way, especially in a way that seems unusual, surprising, or annoying to other people","example[11]":"Tina’s been acting very strangely lately.","example[12]":"What makes grown people act like that?","display[0]":"treat","definition[5]":"to behave towards someone or deal with someone in a particular way","example[13]":"She said that he’d treated her really badly throughout their two-year marriage.","example[14]":"I’m sick of my parents treating me like a child.","display[1]":"conform","definition[6]":"to behave in the way that most other people in your group or society behave","example[15]":"Young people sometimes want to rebel and therefore they refuse to conform.","example[16]":"Society typically brings pressure on individuals and groups to conform to civilised norms.","display[2]":"conduct yourself","definition[7]":"to behave in a particular way, especially in a situation where people will notice and judge the way you behave","example[17]":"Public figures have a duty to conduct themselves responsibly, even in their private lives.","example[18]":"By the end of the course, you should be able to conduct yourself with confidence in any meeting.","definition[8]":"to act or to do something in a particular way","example[19]":"Both gold and oil prices behaved exactly as analysts and investors had been predicting."}