{"definition[0]":"used when you are comparing two people, things, situations etc","example[0]":"Please let me know your decision as soon as possible (=as soon as you can).","example[1]":"His last album sold half a million copies and we hope this one will be just as (=equally) popular.","example[2]":"Tom’s not as old as you, is he?","note[0]":"as ... as","example[3]":"an old woman with hair as white as snow","example[4]":"Some of the doctors are paid almost twice as much as the nurses.","example[5]":"We work as hard as any other team in England.","definition[1]":"used to say what job, duty, use, or appearance someone or something has","example[6]":"As a parent, I feel that more should be done to protect our children.","example[7]":"A flat stone was used as a table.","example[8]":"Dad dressed up as Santa Claus.","definition[2]":"used to say what someone thinks or says a person or thing is","example[9]":"The problem is regarded as serious.","example[10]":"The result of last week’s election will be seen as a victory for the right-wing government.","example[11]":"He’s described as being in his late teens, tall, and of slim build.","definition[3]":"when someone was in a particular age group","example[12]":"As a young man, Eliot had studied art in Paris.","example[13]":"I’ll take you to all the places I loved as a girl.","heading[0]":"USAGE: As, like, as if/though","explanation[0]":"Use as in comparisons in the expression as  as, with an adjective or adverb in between","explanation[1]":"As is also used after be the same (age/size etc)","explanation[2]":"Do not use as on its own before a noun or pronoun in comparisons Use like","bad_example[0]":"A movie is not as a book","bad_example[1]":"As other people, he values his privacy","explanation[3]":"Use as if/as though before a clause describing an imaginary situation","explanation[4]":"Some people also use like in this way, although this is often considered to be incorrect","example[14]":"They act like they own the place","explanation[5]":"Do not use as if/as though directly before a noun You say","bad_example[2]":"You treat him as if your servant","definition[4]":"used in comparisons","example[15]":"They want peace as much as we do.","example[16]":"Helen comes to visit me as often as she can.","example[17]":"I can’t run as fast as I used to.","definition[5]":"in the way that someone says or that something happens, or in the condition something is in","example[18]":"Do as I say!","example[19]":"We’d better leave things as they are until the police arrive.","example[20]":"The money was repaid, as promised.","example[21]":"He did not need to keep moving house, as his father had.","example[22]":"Roberta was late as usual (=in the way that she usually was).","definition[6]":"used to say that what you are saying is already known or has been stated before","example[23]":"David, as you know, has not been well lately.","example[24]":"As I explained on the phone, your request will be considered at the next meeting.","example[25]":"As Napoleon once said, attack is the best method of defence.","definition[7]":"while or when","example[26]":"I saw Peter as I was getting off the bus.","example[27]":"As time passed, things seemed to get worse.","example[28]":"Just as the two men were leaving, a message arrived.","definition[8]":"used to state why a particular situation exists or why someone does something","example[29]":"As it was getting late, I turned around to start for home.","example[30]":"We asked Philip to come with us, as he knew the road.","definition[9]":"though","example[31]":"Unlikely as it might seem, I’m tired too.","example[32]":"Try as she might, Sue couldn’t get the door open.","example[33]":"As popular as he is, the president hasn’t always managed to have his own way."}