{"word[0]":"miss","signpost[0]":"not do something","definition[0]":"to not go somewhere or do something, especially when you want to but cannot","example[0]":"I’m absolutely starving – I missed lunch.","example[1]":"He missed 20 games after breaking a bone in his wrist.","example[2]":"She was upset at missing all the excitement.","example[3]":"He had missed being elected by a single vote.","note[0]":"miss doing something","signpost[1]":"not hit/catch","definition[1]":"to fail to hit or catch an object that is close to you, or to fail to hit a distant object that you are aiming at","example[4]":"Every time she missed the ball she became more angry.","example[5]":"He fired, missed and loaded again.","example[6]":"The bullet narrowly missed her heart.","signpost[2]":"feel sad about somebody","definition[2]":"to feel sad because someone you love is not with you","example[7]":"She missed her family badly.","example[8]":"Will you miss me?","example[9]":"John will be sorely missed by his family and friends.","signpost[3]":"feel sad about something","definition[3]":"to feel sad because you do not have something or cannot do something you had or did before","example[10]":"I miss the car, but the bus system is good.","example[11]":"Ben knew he would miss working with Sabrina.","explanation[0]":"Miss is followed by an -ing form, not an infinitive You say","example[12]":"I miss seeing you every day","bad_example[0]":"I miss to see you every day","signpost[4]":"too late","definition[4]":"to be too late for something","example[13]":"We got there late and missed the beginning of the movie.","example[14]":"I overslept and missed the train.","note[1]":"miss the train/bus etc","signpost[5]":"not see/hear","definition[5]":"to not see, hear, or notice something, especially when it is difficult to notice","example[15]":"Maeve’s sharp eyes missed nothing.","example[16]":"Perhaps there’s something the police have missed.","example[17]":"It’s a huge hotel on the corner. You can’t miss it (=it is very easy to notice or recognize).","example[18]":"You don’t miss much, do you  (=you are good at noticing things)?","example[19]":"John didn’t miss a trick (=noticed every opportunity to get an advantage) when it came to cutting costs.","signpost[6]":"avoid something","definition[6]":"to avoid something bad or unpleasant","example[20]":"If we leave now we should miss the traffic.","example[21]":"They narrowly missed being killed in the fire.","example[22]":"As he crossed the street, a bus just missed hitting him.","signpost[7]":"notice something isn’t there","definition[7]":"to notice that something or someone is not in the place you expect them to be","example[23]":"I didn’t miss my wallet till it came to paying the bill.","signpost[8]":"engine","definition[8]":"if an engine misses, it stops working for a very short time and then starts again","signpost[9]":"young woman","definition[9]":"used as a polite way of speaking to a young woman when you do not know her name","example[24]":"Excuse me, miss, you’ve dropped your umbrella.","signpost[10]":"teacher","definition[10]":"used by children when speaking to a female teacher, whether she is married or not","example[25]":"I know the answer, Miss.","definition[11]":"an occasion when you fail to hit, catch, or hold something","example[26]":"Will he score a goal this time? No, no it’s a miss.","signpost[11]":"young girl","definition[12]":"a young girl, especially one who has been bad or rude","example[27]":"She’s a cheeky little miss.","definition[13]":"used in front of the family name of a woman who is not married to address her politely, to write to her, or to talk about her","example[28]":"I’d like to make an appointment with Miss Taylor."}