{"word[0]":"drawing","definition[0]":"a picture that you draw with a pencil, pen etc","example[0]":"a drawing of Canterbury Cathedral","note[0]":"drawing of","definition[1]":"the art or skill of making pictures, plans etc with a pen or pencil","example[1]":"I’ve never been very good at drawing.","definition[2]":"a competition in which people whose names or tickets are chosen by chance win money or prizes","example[2]":"The church social will include a buffet dinner and a prize drawing.","collocation[0]":"do/make a drawing","example[3]":"Sammy was doing a drawing of his sister.","collocation[1]":"a drawing shows something","example[4]":"The drawing showed a castle surrounded by woods.","form[0]":"ADJECTIVES/NOUN + drawing","collocation[2]":"a detailed drawing","example[5]":"He made detailed drawings of animals and flowers.","collocation[3]":"a line drawing","example[6]":"The front cover had a line drawing of a girl on the beach.","collocation[4]":"a pencil/ink/charcoal etc drawing","example[7]":"I like to do a few pencil drawings when I go away anywhere.","collocation[5]":"a scale drawing","example[8]":"The architect made a scale drawing of the new room.","definition[3]":"a picture drawn with a pencil, pen, crayon etc","example[9]":"I did a drawing of the front of the house.","display[0]":"sketch","definition[4]":"a drawing that is done quickly and has few details","example[10]":"When she was traveling, she drew quick sketches of the places she’d seen.","display[1]":"doodle","definition[5]":"a shape or pattern that you draw when you are bored or thinking about other things","example[11]":"His schoolbooks were always covered in doodles.","display[2]":"graffiti","definition[6]":"drawings or writing that people secretly put on walls or other public places","example[12]":"Vandals had covered the station in graffiti.","display[3]":"comic strip","definition[7]":"a series of pictures drawn inside boxes that tell a story, especially in a newspaper or magazine","example[13]":"Asterix started off in a comic strip.","display[4]":"cartoon","definition[8]":"a funny drawing in a newspaper or magazine","example[14]":"There is a 'New Yorker' cartoon which depicts various inventions for keeping warm."}