{"definition[0]":"the amount of money that you have to pay in order to buy, do, or produce something","example[0]":"This doesn’t include the cost of repairing the damage.","example[1]":"The new building’s going up at a cost of $82 million.","example[2]":"low cost housing","example[3]":"the high cost of production","example[4]":"Travel insurance is included at no extra cost.","example[5]":"The funds will just cover the museum’s running costs.","example[6]":"the cost of accommodation","note[0]":"cost of","example[7]":"I offered to pay the cost of the taxi.","example[8]":"Insurance to cover the cost of a funeral is possible.","explanation[0]":"In everyday English, people usually ask how much did it cost? or how much was it? rather than using the noun cost:","definition[1]":"something that you lose, give away, damage etc in order to achieve something","example[9]":"He’s determined to win, whatever the cost (=no matter how much work, money, risk etc is needed).","example[10]":"We must avoid a scandal at all costs (=whatever happens).","example[11]":"They need to weigh up the costs and benefits (=disadvantages and advantages) of regulation.","note[1]":"social/environmental etc cost","example[12]":"She had kept her promise to Christine, but at what cost to herself?","note[2]":"at (a) cost to somebody","definition[2]":"the price that someone pays for something that they are going to sell","synonym[0]":"cost price","example[13]":"His uncle’s a car dealer and let him buy the car at cost  (=without making a profit).","note[3]":"at cost","collocation[0]":"pay the cost of something","example[14]":"I’m not sure how I’m going to pay the cost of going to college.","collocation[1]":"cover the cost","example[15]":"The money he had saved just covered the cost of the trip.","collocation[2]":"meet/bear the cost of something","example[16]":"His family were unable to meet the cost of his operation.","collocation[3]":"afford the cost of something","example[17]":"We can’t afford the cost of a holiday abroad this year.","collocation[4]":"reduce/lower/bring down the cost","example[18]":"If you go later in the year, it will bring down the cost of your holiday.","collocation[5]":"cut the cost","example[19]":"The government has promised to cut the cost of medical care.","collocation[6]":"increase/push up the cost","example[20]":"The new tax will increase the cost of owning a car.","collocation[7]":"the cost rises/goes up","example[21]":"The cost of electricity has risen again.","collocation[8]":"the cost falls/goes down","example[22]":"Airline costs have fallen considerably.","collocation[9]":"high/low","example[23]":"the high cost of fuel","collocation[10]":"the average cost","example[24]":"What’s the average cost of a wedding in the UK?","collocation[11]":"an extra/additional cost","example[25]":"At the campsite, many activities are available at no extra cost.","collocation[12]":"the full/total cost","example[26]":"Experts are still assessing the full cost of the disaster.","collocation[13]":"the estimated cost","example[27]":"The estimated cost was in the region of £3,000.","collocation[14]":"the annual/monthly cost","example[28]":"This figure represents the annual cost of a loan.","collocation[15]":"labour/production/transport etc costs","example[29]":"They had to pay £30,000 in legal costs.","collocation[16]":"running/operating costs","example[30]":"The new technology is cheaper and the running costs are lower.","collocation[17]":"borrowing costs","example[31]":"Interest rates and borrowing costs are likely to be higher next year.","collocation[18]":"the cost of living","example[32]":"People are complaining about the rising cost of living.","definition[3]":"the amount of money you need to buy or do something. Cost is usually used when talking in a general way about whether something is expensive or cheap rather than when talking about exact prices","example[33]":"The cost of running a car is increasing.","example[34]":"the cost of raw materials","display[0]":"price","definition[4]":"the amount of money you must pay for something that is for sale","example[35]":"They sell good-quality clothes at reasonable prices.","example[36]":"the price of a plane ticket to New York","display[1]":"value","definition[5]":"the amount of money that something is worth","example[37]":"A new kitchen can increase the value of your home.","display[2]":"charge","definition[6]":"the amount that you have to pay for a service or to use something","example[38]":"Hotel guests may use the gym for a small charge.","example[39]":"bank charges","display[3]":"fee","definition[7]":"the amount you have to pay to enter a place or join a group, or for the services of a professional person such as a lawyer or a doctor","example[40]":"There is no entrance fee.","example[41]":"The membership fee is £125 a year.","example[42]":"legal fees","display[4]":"fare","definition[8]":"the amount you have to pay to travel somewhere by bus, plane, train etc","example[43]":"I didn’t even have enough money for my bus fare.","example[44]":"fare increases","display[5]":"rent","definition[9]":"the amount you have to pay to live in or use a place that you do not own","example[45]":"The rent on his apartment is $800 a month.","display[6]":"rate","definition[10]":"a charge that is set according to a standard scale","example[46]":"Most TV stations offer special rates to local advertisers.","display[7]":"toll","definition[11]":"the amount you have to pay to travel on some roads or bridges","example[47]":"You have to pay tolls on many French motorways.","definition[12]":"to have a particular price","example[48]":"A full day’s activities will cost you £45.","example[49]":"His proposals could cost the taxpayer around £8 billion a year.","example[50]":"How much would it cost us to replace?","example[51]":"Lighting can change the look of a room and needn’t cost the earth (=have a price which is too high).","example[52]":"Getting that insured is going to cost you an arm and a leg (=have a very high price).","example[53]":"It won’t cost you a penny for the first six months.","note[4]":"not cost somebody a penny","example[54]":"It’s costing us a fortune in phone bills.","note[5]":"cost a (small) fortune/a pretty penny","example[55]":"What a fantastic dress. It must have cost a bomb!","note[6]":"cost a bomb/a packet","explanation[1]":"Cost is a linking verb that links the subject of the sentence with a noun, often an amount","example[56]":"Tickets cost $15 ","example[57]":"A second-hand car doesn’t cost much","definition[13]":"to calculate the total price of something or decide how much the price of something should be","example[58]":"We’ll get the plan costed before presenting it to the board.","explanation[2]":"Cost is often passive in this meaning","collocation[19]":"cost a lot","example[59]":"Their hair products are really good but they cost a lot.","collocation[20]":"not cost much","example[60]":"Second hand clothes don’t cost much.","collocation[21]":"cost something per minute/hour/year etc","example[61]":"Calls cost only 2p per minute.","collocation[22]":"cost something per person","example[62]":"There’s a one-day course that costs £80 per person.","collocation[23]":"cost something per head","example[63]":"The meal will cost about £20 per head.","collocation[24]":"not cost (somebody) a penny","example[64]":"Using the Internet, you can make phone calls that don’t cost a penny.","collocation[25]":"cost a fortune/cost the earth","example[65]":"If you use a lawyer, it will cost you a fortune.","example[66]":"He has a new sports car that must have cost a bomb.","collocation[26]":"cost an arm and a leg","example[67]":"A skiing holiday needn’t cost you an arm and a leg.","example[68]":"The book costs $25.","example[69]":"A new kitchen will cost you a lot of money.","example[70]":"It’s a nice dress and it didn’t cost much.","display[8]":"be","definition[14]":"to cost a particular amount of money","example[71]":"These shoes were only £5.","display[9]":"be priced at something","definition[15]":"to have a particular price – used when giving the exact price that a shop or company charges for something","example[72]":"Tickets are priced at $20 for adults and $10 for kids.","display[10]":"retail at something","definition[16]":"to be sold in shops at a particular price – used especially in business","example[73]":"The scissors retail at £1.99 in department stores.","display[11]":"sell/go for something","definition[17]":"used for saying what people usually pay for something","example[74]":"Houses in this area sell for around £200,000.","display[12]":"fetch","definition[18]":"used for saying what people pay for something, especially at a public sale","example[75]":"The painting fetched over $8,000 at auction.","example[76]":"A sports car built for Mussolini is expected to fetch nearly £1 million at auction.","display[13]":"set somebody back something","definition[19]":"to cost someone a lot of money","example[77]":"A good set of speakers will set you back around £150.","display[14]":"come to","definition[20]":"if a bill comes to a particular amount, it adds up to that amount","example[78]":"The bill came to £100 between four of us.","example[79]":"The distributor bears the full cost of promoting a film.","example[80]":"Siemens is moving production to low cost sites in Portugal and Mexico.","example[81]":"The policy covers all major illnesses and includes children’s cover at no extra cost.","example[82]":"The company had to bring in skilled workers from abroad, often at high cost.","definition[21]":"the money that a business or an individual must regularly spend","example[83]":"The rising costs of land and labour have weakened the ship repair business in Singapore.","example[84]":"Delays in construction could increase costs significantly.","example[85]":"Kraft is seeking to cut costs by closing plants.","example[86]":"Rents will be sufficient to cover costs (=pay for costs) and allow the developer a profit.","example[87]":"This dress cost $75.","example[88]":"How much did the work cost you?","note[7]":"cost (somebody) something","definition[22]":"to have a very high price","example[89]":"The meal cost a small fortune, but it was well worth it.","type[0]":"transitive usually passive","definition[23]":"to calculate the cost of something or decide how much something should cost","example[90]":"We’ll get the plan costed before sending it to the board."}