{"word[0]":"criticism","definition[0]":"remarks that say what you think is bad about someone or something","opposite[0]":"praise","example[0]":"Despite strong criticism, the new system is still in place.","example[1]":"There has been widespread criticism of the decision.","example[2]":"We try to give students constructive criticism.","example[3]":"Another criticism levelled at him was that his teaching methods were old-fashioned.","example[4]":"The government’s economic strategy has attracted a lot of criticism.","example[5]":"You must learn to accept criticism.","example[6]":"Many employees find it hard to take even mild criticism.","example[7]":"His actions provoked severe criticism from civil rights groups.","example[8]":"the storm of criticism that followed his announcement","example[9]":"My main criticism of the scheme is that it does nothing to help families on low incomes.","note[0]":"criticism of","definition[1]":"writing which expresses judgments about the good or bad qualities of books, films, music etc","example[10]":"literary criticism","collocation[0]":"strong/severe/heavy criticism","example[11]":"This decision attracted heavy criticism from environmental groups.","collocation[1]":"fierce/bitter/harsh/sharp criticism","example[12]":"The prison system has been the object of fierce criticism.","collocation[2]":"public criticism","example[13]":"As a politician, you have to get used to public criticism.","collocation[3]":"constructive criticism","example[14]":"Praise and constructive criticism are both very useful.","collocation[4]":"widespread criticism","example[15]":"There was widespread criticism of his speech.","collocation[5]":"growing/mounting criticism","example[16]":"The government was faced with mounting criticism at home and abroad.","collocation[6]":"outspoken criticism","example[17]":"I was surprised by his outspoken criticism of the system.","collocation[7]":"implied criticism","example[18]":"She sensed the implied criticism in his remarks.","collocation[8]":"draw/attract/provoke criticism","example[19]":"The plan has drawn criticism from some groups.","collocation[9]":"come under criticism/come in for criticism","example[20]":"The deal came under fierce criticism from other American airlines.","collocation[10]":"meet (with) criticism","example[21]":"His theory met with harsh criticism from colleagues.","collocation[11]":"face criticism","example[22]":"He has often faced criticism in the local press.","collocation[12]":"accept/take criticism","example[23]":"Very few people know how to accept criticism.","collocation[13]":"level criticism at somebody/something","example[24]":"A great deal of criticism was levelled at the company.","collocation[14]":"single somebody out for criticism","example[25]":"The goalkeeper was singled out for criticism.","collocation[15]":"be the subject of criticism/be subjected to criticism","example[26]":"The club has been the subject of criticism since last October.","collocation[16]":"be open to criticism","example[27]":"Management have decided this and I don't think they're open to criticism.","collocation[17]":"be sensitive to criticism","example[28]":"He was highly sensitive to criticism in the press.","collocation[18]":"a storm/barrage of criticism","example[29]":"His comments provoked a barrage of criticism."}