{"word[0]":"arm","definition[0]":"one of the two long parts of your body between your shoulders and your hands","example[0]":"Dave has a broken arm.","example[1]":"Tim’s mother put her arms around him.","example[2]":"Pat was carrying a box under his arm.","example[3]":"He had a pile of books in his arms.","example[4]":"They walked along the beach arm in arm (=with their arms bent around each other’s).","example[5]":"The old lady rushed to greet him, arms outstretched.","example[6]":"He had a tattoo on his left arm.","note[0]":"left/right arm","example[7]":"She took him by the arm and pushed him out of the door.","note[1]":"take somebody by the arm","example[8]":"Gerry took Fiona in his arms and kissed her.","note[2]":"take somebody in your arms","example[9]":"He folded his arms and leaned back in his chair.","note[3]":"cross/fold your arms","signpost[0]":"furniture","definition[1]":"the part of a chair, sofa etc that you rest your arms on","definition[2]":"the part of a piece of clothing that covers your arm","synonym[0]":"sleeve","signpost[1]":"part of group","definition[3]":"a part of a large group that is responsible for a particular type of activity","example[10]":"the political arm of a terrorist organization","example[11]":"Epson America is the US marketing arm of a Japanese company.","signpost[2]":"object/machine","definition[4]":"a long part of an object or piece of equipment","example[12]":"the arm of a record player","example[13]":"There is a 15-foot arm supporting the antenna.","collocation[0]":"somebody’s left/right arm","example[14]":"She broke her left arm in a riding accident.","collocation[1]":"broken/fractured","example[15]":"He was taken to hospital with a broken arm.","example[16]":"a muscular man with strong arms","example[17]":"She wore no stockings and her arms were bare.","collocation[2]":"wave your arms","example[18]":"The man was waving his arms and shouting something.","collocation[3]":"raise your arm","example[19]":"Stand with your feet apart and your arms raised above your head.","collocation[4]":"fold/cross your arms","example[20]":"He folded his arms across his chest and waited.","collocation[5]":"stretch/hold out your arms","example[21]":"I dreamt I saw my mother again with her arms stretched out towards me.","collocation[6]":"grab somebody’s arm","example[22]":"‘Wait’, he cried, grabbing her arm.","collocation[7]":"put/wrap your arms around somebody","example[23]":"I put my arms around Bobby and gave him a hug.","collocation[8]":"take/hold somebody in your arms","example[24]":"He took her in his arms and kissed her.","example[25]":"‘It’s this way’ he said, taking me by the arm.","collocation[9]":"arm in arm","example[26]":"There were several young couples, walking arm in arm.","collocation[10]":"with arms akimbo","example[27]":"Anna stood with arms akimbo, ready to challenge me.","collocation[11]":"with outstretched arms","example[28]":"Manuel came forward with outstretched arms to welcome Magda.","definition[5]":"to provide weapons for yourself, an army, a country etc in order to prepare for a fight or a war","example[29]":"The local farmers have armed themselves with rifles and pistols.","note[4]":"arm somebody with something","example[30]":"The rebels armed a group of 2,000 men to attack the city.","definition[6]":"to provide all the information, skills, or equipment you need to do something","synonym[1]":"equip","example[31]":"Arm yourself with all the facts you need to argue your case.","example[32]":"The guidebook arms the reader with a mass of useful information.","definition[7]":"abbreviation for ADJUSTABLE RATE MORTGAGE"}