{"word[0]":"draw up","definition[0]":"to prepare a written document, such as a list or contract","example[0]":"Draw up a list of all the things you want to do.","example[1]":"The contract was drawn up last year.","example[2]":"He was asked to draw up proposals for reforming the law.","note[0]":"draw up plans/proposals","definition[1]":"if a vehicle draws up, it arrives somewhere and stops","example[3]":"A taxi drew up at the gate.","definition[2]":"to move a chair closer to someone or something","definition[3]":"to stand up very straight because you are angry or determined about something","example[4]":"He drew himself up and said, ‘This has gone far enough.’","definition[4]":"to bring your legs closer to your body","example[5]":"Ruth sat, knees drawn up under her chin, and waited.","collocation[0]":"draw up a plan/scheme","example[6]":"Local authorities have drawn up new plans for waste disposal.","collocation[1]":"draw up a proposal","example[7]":"The European Communities were drawing up proposals to control the export of chemicals.","collocation[2]":"draw up a list","example[8]":"They drew up a list of suitable candidates for the job.","collocation[3]":"draw up guidelines","example[9]":"A committee of teachers has drawn up guidelines for schools on how to deal with difficult students.","collocation[4]":"draw up a report","example[10]":"Environmental organizations have been involved in drawing up the report.","collocation[5]":"draw up a contract/agreement","example[11]":"Some people draw up a contract when they get married.","collocation[6]":"draw up a timetable/schedule","example[12]":"They haven’t yet drawn up a timetable for the elections.","collocation[7]":"draw up a programme","example[13]":"A small team has drawn up a programme of action.","collocation[8]":"draw up a constitution","example[14]":"The first Czech constitution was drawn up here in 1920.","collocation[9]":"draw up a budget","example[15]":"Each year business managers draw up a budget.","definition[5]":"to write out or prepare an agreement, list, plan etc","example[16]":"The chairman had drawn up an agenda.","example[17]":"The first thing you need to do is draw up a business plan.","example[18]":"Our selection committee drew up the list of candidates."}