{"word[0]":"impossible","definition[0]":"something that is impossible cannot happen or be done","opposite[0]":"possible","example[0]":"‘I want to speak to Mr Franks.’ ‘I’m afraid that’s impossible.’","example[1]":"It’s impossible to be accurate about these things.","example[2]":"The noise made sleep impossible.","example[3]":"Members with young children often found it impossible to attend evening meetings.","example[4]":"It is difficult to find work these days, but for blind people it is virtually impossible.","example[5]":"He was faced with a seemingly impossible task.","example[6]":"It was physically impossible to get the fridge through the door.","example[7]":"Six months ago, peace seemed an impossible dream.","example[8]":"Such mental attitudes are difficult, if not impossible, to change.","definition[1]":"a situation that is impossible is one that you cannot deal with","example[9]":"We were in an impossible situation. Whatever we decided to do would upset someone.","example[10]":"Helen’s refusal to cooperate put me in an impossible position.","example[11]":"His attitude is making life impossible for the rest of the team.","example[12]":"He was facing impossible odds.","definition[2]":"behaving in a very unreasonable and annoying way","example[13]":"Oh, you’re just impossible!","collocation[0]":"seem impossible","example[14]":"It seemed impossible that he would ever recover from the injury.","collocation[1]":"become impossible","example[15]":"As it became darker, it became impossible for the players to see the ball.","collocation[2]":"prove impossible","example[16]":"It proved impossible for the two sides to reach an agreement.","collocation[3]":"find something impossible","example[17]":"He found it impossible to sleep because of the noise coming from next door.","collocation[4]":"make something impossible","example[18]":"Heavy snow made travelling impossible.","collocation[5]":"render something impossible","example[19]":"The large number of prison guards rendered any escape impossible.","collocation[6]":"absolutely impossible","example[20]":"It is absolutely impossible to drive in these conditions.","collocation[7]":"almost/nearly impossible","example[21]":"He thought that winning would be almost impossible.","collocation[8]":"virtually/practically impossible","example[22]":"Getting tickets for the concert is practically impossible.","collocation[9]":"well-nigh impossible","example[23]":"Policing the entire coastline is well-nigh impossible.","collocation[10]":"seemingly impossible","example[24]":"He managed to win the chess game from a seemingly impossible position.","collocation[11]":"physically impossible","example[25]":"It is physically impossible to survive for long in the desert without water.","collocation[12]":"an impossible job/task","example[26]":"He faced the impossible task of paying back huge debts.","collocation[13]":"an impossible feat","example[27]":"She achieved the seemingly impossible feat of breaking the world record.","collocation[14]":"an impossible dream","example[28]":"For a small club, winning the cup final will always be the impossible dream.","collocation[15]":"impossible demands","example[29]":"She was growing tired of the company’s impossible demands.","collocation[16]":"it is impossible to do something","example[30]":"It is impossible to know if this story is true.","collocation[17]":"difficult, if not impossible","example[31]":"Obtaining funding for the film will be difficult, if not impossible.","explanation[0]":"Impossible is not used with ‘very’ You say","example[32]":"It was an absolutely impossible task","bad_example[0]":"It was a very impossible task","example[33]":"It’s impossible to get a taxi around here.","example[34]":"At times, finding a job felt like an impossible task.","display[0]":"impractical","definition[3]":"something that is impractical is too expensive, takes too much time, is too difficult etc and therefore it is not sensible to try to do it","example[35]":"It’s a nice idea, but it’s totally impractical.","example[36]":"We cannot all just stop using our cars - that would be completely impractical.","example[37]":"an impractical suggestion","display[1]":"out of the question","definition[4]":"used when saying that something is completely impossible, especially because it is not allowed","example[38]":"It’s out of the question for you to go alone.","display[2]":"there’s no way","definition[5]":"used when saying that you think something is completely impossible","example[39]":"There’s no way we can get to the airport in less than an hour.","display[3]":"inconceivable","definition[6]":"impossible to imagine or believe","example[40]":"It seemed inconceivable that there could be an end to the fighting in Northern Ireland.","display[4]":"unthinkable","definition[7]":"impossible to imagine or believe – used especially about something that seems very shocking to people","example[41]":"In those days it was unthinkable for a lady to work outside the home.","display[5]":"unattainable","definition[8]":"impossible to achieve","example[42]":"an unattainable goal","example[43]":"Victory seemed unattainable.","display[6]":"it can’t be done","definition[9]":"used when saying very definitely that something is impossible","example[44]":"I’m afraid it can’t be done."}