{"word[0]":"valley","definition[0]":"an area of lower land between two lines of hills or mountains, usually with a river flowing through it","example[0]":"the San Fernando Valley","form[0]":"ADJECTIVES/NOUN + valley","example[1]":"The valley becomes narrower at this point.","collocation[0]":"wide/broad","example[2]":"We looked down on the wide valley below.","collocation[1]":"deep/steep","example[3]":"a bridge across a deep valley","collocation[2]":"a river valley","example[4]":"The route passes through beautiful wooded river valleys.","collocation[3]":"a green/wooded/lush valley","example[5]":"We were on a ridge above a green valley, with the mountains beyond it.","collocation[4]":"the Thames/San Fernando etc Valley","example[6]":"There are extensive views across the Forth Valley.","form[1]":"valley + NOUN","collocation[5]":"the valley floor","example[7]":"Most of the town is built on the valley floor.","collocation[6]":"the side of a valley","example[8]":"He looked across to the far side of the valley.","collocation[7]":"the slopes of a valley","example[9]":"They live in houses of stone on the slopes of a wooded valley.","collocation[8]":"the head of a valley","example[10]":"There is a great waterfall at the head of a valley.","collocation[9]":"the bottom of a valley","example[11]":"The stream in the bottom of the valley was spanned by a narrow bridge.","example[12]":"The route passes through a remote mountain valley.","example[13]":"a trek up the Gokyo Valley to see Mount Everest","display[0]":"gorge","definition[1]":"a deep narrow valley with steep sides – often used in names, especially in Europe","example[14]":"The river flows through a deep gorge.","example[15]":"Cheddar Gorge","display[1]":"canyon","definition[2]":"a deep valley with very steep sides – often used in names, especially in North and South America","example[16]":"She looked down the side of the canyon.","example[17]":"We visited the Grand Canyon in Arizona.","display[2]":"ravine","definition[3]":"a small valley with very steep sides","example[18]":"He fell down a ravine.","display[3]":"glen","definition[4]":"a deep narrow valley in Scotland or Ireland","example[19]":"They followed the river along the glen.","example[20]":"the Glens of Antrim","display[4]":"gully","definition[5]":"a small narrow valley, usually formed by a lot of rain flowing down the side of a hill","example[21]":"They reached the top by scrambling up a gully."}