{"word[0]":"learn","past_tense[0]":"learned","signpost[0]":"subject/skill","definition[0]":"to gain knowledge of a subject or skill, by experience, by studying it, or by being taught","example[0]":"What’s the best way to learn a language?","example[1]":"The teacher’s task is to help the pupil learn.","example[2]":"The student will learn from experience about the importance of planning.","example[3]":"I learnt to drive when I was 17.","note[0]":"learn (how) to do something","example[4]":"Hector spent the winter learning how to cope with his blindness.","example[5]":"I learned a lot from my father.","note[1]":"learn (something) from somebody","example[6]":"Kids can have fun and learn about music at the same time.","note[2]":"learn about","example[7]":"Youngsters must learn what is dangerous and what is not to be feared.","note[3]":"learn what","heading[0]":"GRAMMAR: Patterns with learn","explanation[0]":"You learn to do something","example[8]":"She’s learning to play the piano","explanation[1]":"You learn how to do something","example[9]":"She is learning how to play the piano","bad_example[0]":"She is learning playing the piano","signpost[1]":"find out","definition[1]":"to find out information or news by hearing it from someone else or reading it","synonym[0]":"discover","example[10]":"I didn’t tell her the truth. She would learn it for herself soon enough.","example[11]":"He learned about his appointment by telephone yesterday.","note[4]":"learn of/about","example[12]":"Last week I learned that I was pregnant.","note[5]":"learn (that)","example[13]":"She was surprised to learn that he was a lot older than she had thought.","example[14]":"I waited to learn whether I’d secured a college place.","note[6]":"learn whether/who/why","example[15]":"We have yet to learn who will be the new manager.","signpost[2]":"remember","definition[2]":"to get to know something so well that you can easily remember it","synonym[1]":"memorize","example[16]":"The actors hardly had time to learn their lines before filming started.","signpost[3]":"change your behaviour","definition[3]":"to gradually understand a situation and start behaving in the way that you should","example[17]":"I’ve told him a hundred times not to bully people, but he never learns.","example[18]":"the lessons learned in the Gulf War","example[19]":"They have to learn that they can’t just do whatever they like.","example[20]":"Young hairdressers must learn to treat the client as a person, not a head of hair.","note[7]":"learn to do something","example[21]":"You have to learn from your mistakes (=understand why what you did was wrong).","note[8]":"learn from","definition[4]":"to gain knowledge of a subject or skill, especially by being taught or trained","example[22]":"How long have you been learning Italian?","example[23]":"At what age can you learn to drive in America?","display[0]":"study","definition[5]":"to learn about a subject by reading books, going to classes etc, especially at school or university","example[24]":"She’s studying music at Berkeley College in California.","definition[6]":"to learn the skills and get the experience that you need in order to do a particular job","example[25]":"Julie’s training to be a nurse.","display[1]":"pick something up","definition[7]":"to learn something without much effort, by watching or listening to other people","example[26]":"It’s easy to pick up a language when you’re living in a country.","example[27]":"The rules of the game are easy – you’ll soon pick them up.","display[2]":"get the hang of something","definition[8]":"to learn how to do or use something that is fairly complicated, especially with practice","example[28]":"It took me a while to get the hang of all the features on my new camera.","display[3]":"revise","definition[9]":"to study facts again, especially on your own, in order to learn them before an examination","example[29]":"Jenny’s upstairs revising for her Maths exam tomorrow.","display[4]":"master","definition[10]":"to learn something so well that you have no difficulty with it, especially a skill or a language","example[30]":"She gave me a book called ‘Mastering the Art of French Cooking’.","example[31]":"I learnt Spanish for years but I never really mastered it."}