{"definition[0]":"why something happens, or why someone does something","example[0]":"People give different reasons for wanting to change jobs.","note[0]":"reason for","example[1]":"We’d like to know the reason why she didn’t accept the job.","note[1]":"reason why","example[2]":"The reason I called was to ask about the plans for Saturday.","note[2]":"reason (that)","example[3]":"He explained the reasons behind the decision.","note[3]":"reason behind","example[4]":"The bridge is closed for reasons of safety.","note[4]":"for reasons of something","example[5]":"This work gives me a reason to live.","note[5]":"reason to do something","example[6]":"There is no reason whatsoever to doubt her story.","note[6]":"there is no reason to do something","example[7]":"a person disqualified by reason of age","note[7]":"by reason of something","signpost[0]":"good or fair","definition[1]":"a fact that makes it right or fair for someone to do something","example[8]":"Under the circumstances, we had every reason (=had very good reasons) to be suspicious.","example[9]":"There is no reason to panic.","note[8]":"(no) reason to do something","example[10]":"She has reason to feel guilty.","example[11]":"We have reason to believe that the goods were stolen.","example[12]":"I know I’m late, but that’s no reason to shout at me.","example[13]":"Natalie was alarmed by the news, and with reason.","note[9]":"with (good) reason","signpost[1]":"good judgment","definition[2]":"sensible judgment and understanding","synonym[0]":"sense","example[14]":"There’s reason in what he says.","example[15]":"They’re not prepared to listen to reason (=be persuaded by someone’s sensible advice).","example[16]":"There’s no way of making my grandfather see reason (=accept advice and make a sensible decision).","signpost[2]":"ability to think","definition[3]":"the ability to think, understand, and form judgments that are based on facts","note[10]":"lose your reason old-fashioned (=become mentally ill)","example[17]":"the human power of reason","collocation[0]":"have a reason","example[18]":"We had many reasons to celebrate.","collocation[1]":"give a reason","example[19]":"No reason was given for the change.","collocation[2]":"think of a reason/see a reason","example[20]":"I see no reason why it shouldn’t work.","example[21]":"I can’t think of any reason why she would want to leave.","collocation[3]":"explain the reasons for something","example[22]":"Explain the reasons for your choice.","collocation[4]":"a good reason","example[23]":"There is usually a good reason why the price is so cheap.","collocation[5]":"the main reason","example[24]":"The main reason for the decline in the railways is lack of investment.","collocation[6]":"a major reason","example[25]":"His personality was a major reason for his success.","example[26]":"A big reason for the decrease in smoking is the ban on cigarette advertising.","collocation[7]":"the real reason","example[27]":"What do you think was the real reason for their decision?","collocation[8]":"a valid/legitimate reason","example[28]":"An employer can’t fire someone without a valid reason.","collocation[9]":"a compelling reason","example[29]":"There are compelling reasons to believe that this is true.","collocation[10]":"a simple reason","example[30]":"I hate mobile phones, for the simple reason that it is now impossible to get away from them.","collocation[11]":"a logical reason","example[31]":"People don’t always have logical reasons for the things they do.","collocation[12]":"the only reason","example[32]":"The only reason he’s coming tonight is that I said you’d be here.","collocation[13]":"for legal/political/medical etc reasons","example[33]":"The boy cannot be named for legal reasons.","collocation[14]":"for security reasons","example[34]":"The road will be closed for security reasons.","collocation[15]":"for personal reasons","example[35]":"He resigned for personal reasons.","collocation[16]":"for sentimental reasons","example[36]":"I wanted to keep the picture for sentimental reasons.","collocation[17]":"for obvious reasons","example[37]":"This arrangement must be kept secret, for obvious reasons.","collocation[18]":"for no apparent reason","example[38]":"He tried to kill me for no apparent reason.","collocation[19]":"for some reason (or other)","example[39]":"For some reason she felt like crying.","example[40]":"For some unknown reason, the curtains were always drawn.","collocation[20]":"for reasons best known to somebody","example[41]":"For reasons best known to herself, she decided to sell the house.","collocation[21]":"have your reasons","example[42]":"‘Why did he marry her?’ ‘He must have had his reasons.’","explanation[0]":"You say the reason for something","example[43]":"What do you think was the reason for their success?","bad_example[0]":"the reason of their success","explanation[1]":"You say the reason why something happens","example[44]":"Can you tell me the reason why you did this?","explanation[2]":"You say the cause of something","example[45]":"There will be a police investigation into the cause of the fire","bad_example[1]":"the cause for the fire","explanation[3]":"You say there is cause for concern/alarm/complaint/worry etc","example[46]":"The doctor said there was no cause for concern","example[47]":"What was the reason for the delay?","example[48]":"I don’t know the reason why he left his last job.","definition[4]":"the reason why something happens, especially something bad","example[49]":"What was the cause of his death?","example[50]":"We studied the causes of the First World War.","display[0]":"explanation","definition[5]":"a set of reasons that helps you to understand why something happens, especially when it seems difficult to understand","example[51]":"There are various possible explanations for climate change.","example[52]":"Is there any explanation for his behavior?","display[1]":"motive","definition[6]":"a reason that makes someone decide to do something – often used about crimes","example[53]":"Police say that there is no obvious motive for the attack.","display[2]":"justification","definition[7]":"a good reason for doing something that seems wrong","example[54]":"There is never any justification for torture or abuse.","example[55]":"They try to use the situation in the Middle East as a justification for killing innocent civilians.","example[56]":"There’s no justification for this type of behaviour.","display[3]":"grounds","definition[8]":"a reason that makes it right or fair to do something, especially according to legal, official, or moral rules","example[57]":"The court will decide if she has grounds for divorce.","example[58]":"They claim the war is justified on moral grounds (=because of moral reasons).","display[4]":"basis","definition[9]":"the main ideas or reasons on which something is based","example[59]":"The doctor makes his decisions purely on the basis of clinical observation.","example[60]":"What do you think is the basis for this advice?","display[5]":"rationale","definition[10]":"a set of reasons that are used to explain why someone does something in a particular way","example[61]":"the rationale behind the government’s economic reforms","example[62]":"This chapter explains the nature of yearly plans, and provides a rationale for their use.","heading[0]":"a reason that does not seem believable","display[6]":"excuse","definition[11]":"a reason that you give to explain why you have done something bad, or not done something that you should have done – especially one that is not completely true","example[63]":"She said she couldn’t come because she had to work late, but it was just an excuse.","example[64]":"a feeble excuse (=one that is hard to believe)","display[7]":"pretext","definition[12]":"an untrue reason that you give for doing or not doing something, in order to hide the real reason","example[65]":"He would often find some pretext to go out in the evening alone.","example[66]":"They used this as a pretext for taking military action.","definition[13]":"to form a particular judgment about a situation after carefully considering the facts","example[67]":"They reasoned that other businesses would soon copy the idea.","definition[14]":"to think and make judgments","example[68]":"the ability to reason"}