{"signpost[0]":"think about","definition[0]":"to think about something carefully, especially before making a choice or decision","note[0]":"be considering your position formal (=be deciding whether or not to leave your job)","example[0]":"We will have to consider your offer carefully.","example[1]":"Have you considered the possibility of retraining?","note[1]":"consider the possibility of (doing) something","example[2]":"I seriously considered resigning  (=almost actually resigned).","note[2]":"consider doing something","example[3]":"We are considering whether to change our advice to tourists.","note[3]":"consider whether (to do something)","example[4]":"We’re still considering where to move to.","note[4]":"consider where/how/why etc","explanation[0]":"Consider is followed by an -ing form, not an infinitive You consider doing something","example[5]":"I considered asking for my money back","bad_example[0]":"I considered to ask for my money back","definition[1]":"to think of someone or something in a particular way or to have a particular opinion","example[6]":"I did not consider it necessary to report the incident.","note[5]":"consider it necessary/important etc to do something","example[7]":"I consider it a great honour to be invited.","example[8]":"Consider yourself lucky you weren’t in the car at the time.","note[6]":"consider yourself lucky/fortunate","example[9]":"The local authority considered that the school did not meet requirements.","note[7]":"consider (that)","example[10]":"A further increase in interest rates is now considered unlikely.","note[8]":"consider somebody/something (to be) something","example[11]":"Liz Quinn was considered an excellent teacher.","example[12]":"They consider themselves to be Europeans.","example[13]":"The campaign was considered to have failed.","note[9]":"consider somebody/something to do something","example[14]":"They consider themselves to be middle class.","note[10]":"consider yourself (to be) something","signpost[1]":"people’s feelings","definition[2]":"to think about someone or their feelings, and try to avoid upsetting them","example[15]":"You’ve got to learn to consider other people!","example[16]":"Have you considered my feelings?","signpost[2]":"important fact","definition[3]":"to think about an important fact relating to something when making a judgment","example[17]":"It’s not surprising when you consider that he only arrived six months ago.","example[18]":"All things considered, I’m sure we made the right decision.","signpost[3]":"discuss","definition[4]":"to discuss something such as a report or problem, so that you can make a decision about it","example[19]":"The committee has been considering the report.","signpost[4]":"look at","definition[5]":"to look at someone or something carefully","example[20]":"Ben considered the statue with an expert eye.","explanation[1]":"In meaning 1, consider is often used in the progressive You say","example[21]":" I am considering investing some money  (=I am thinking about it and may do it) ","explanation[2]":"In meaning 2, consider is not used in the progressive You say","example[22]":"I consider it a good investment  (=I believe that it is)","bad_example[1]":"I am considering it a good investment","definition[6]":"to have an opinion about someone or something after thinking carefully about them","example[23]":"We do not consider this film suitable for young children.","example[24]":"She is considered to be one of the finest pianists of her generation.","definition[7]":"to think about someone or something in a particular way, or as being a particular kind of person or thing","example[25]":"Having a child makes you see things differently.","example[26]":"America was seen as the land of opportunity.","example[27]":"The country sees itself as a bridge between East and West.","display[0]":"regard/view","definition[8]":"to think about someone or something in a particular way, or as being a particular kind of person or thing. Regard/view are a little more formal than see","example[28]":"She regards herself more as an entertainer than a singer.","example[29]":"Many people in the industry viewed him with suspicion.","display[1]":"perceive","example[30]":"Historically, nursing has been perceived as a job for women, but things have changed now.","example[31]":"The group were perceived to have little real talent.","example[32]":"Do other people perceive us as we perceive ourselves?","display[2]":"think of somebody/something as","definition[9]":"to think that someone or something is a particular type of person or thing","example[33]":"He looked on his job as a welcome relief from the problems at home.","example[34]":"Even though he’s 18, his parents still think of him as a child.","example[35]":"I think of her more as a sister."}