{"word[0]":"rude","comparative[0]":"ruder","superlative[0]":"rudest","definition[0]":"speaking or behaving in a way that is not polite and is likely to offend or annoy people","synonym[0]":"impolite","opposite[0]":"polite","example[0]":"a rude remark","example[1]":"I didn’t mean to be rude, but I had to leave early.","example[2]":"Why are you so rude to her?","note[0]":"rude to","example[3]":"It’s rude to stare.","note[1]":"it is rude to do something","definition[1]":"rude jokes, words, songs etc are about sex","definition[2]":"made in a simple basic way","example[4]":"a rude wooden hut","definition[3]":"not following the rules of good social behaviour or treating other people with a lack of respect","example[5]":"It’s rude to interrupt.","example[6]":"He’s the rudest man I’ve ever met.","example[7]":"rude remarks about her stomach","display[0]":"impolite/not polite","definition[4]":"not following the rules of good social behaviour. Impolite sounds rather formal","example[8]":"It is impolite to stare.","example[9]":"It’s not polite to talk with your mouth full of food.","display[1]":"cheeky","definition[5]":"behaving in a way that is a little rude, especially when this is amusing or annoying – used especially about children","example[10]":"a cheeky grin","example[11]":"Let go, you cheeky monkey (=cheeky child)!","example[12]":"Don’t get smart with me!","display[2]":"tactless","definition[6]":"saying things that are likely to upset or embarrass someone, without intending to","example[13]":"a tactless remark","example[14]":"How could you be so tactless?","display[3]":"offensive","definition[7]":"speaking or behaving in a way that is likely to upset or offend someone","example[15]":"His remarks are offensive to African-Americans.","example[16]":"offensive language","display[4]":"insulting","definition[8]":"speaking or behaving in a way that is very rude and offensive to someone","example[17]":"comments that are insulting to women","example[18]":"The article was full of insulting language.","display[5]":"discourteous","definition[9]":"rather rude. Discourteous  sounds very formal and is often used when talking about being careful not to upset someone’s feelings","example[19]":"He did not wish to appear discourteous towards his host.","example[20]":"It would seem discourteous to refuse her offer.","display[6]":"ill-mannered","definition[10]":"behaving in a rude way, especially because you have never been taught how to behave politely","example[21]":"Ill-mannered movie-goers talked throughout the entire picture.","example[22]":"It was very bad-mannered.","display[7]":"disrespectful","definition[11]":"not showing the proper respect for someone or something","example[23]":"I felt her comments were disrespectful to all the people who have worked so hard on this project.","display[8]":"impertinent","definition[12]":"not showing a proper respect for someone, especially by asking or talking about subjects that you do not have a right to know about","example[24]":"an impertinent question about his private life","example[25]":"an impertinent young man","example[26]":"Would it be impertinent to ask how old you are?","display[9]":"insolent","definition[13]":"behaving in a way that is deliberately very rude to someone in authority","example[27]":"The girl’s only response was an insolent stare.","example[28]":"Don’t be so insolent!","display[10]":"impudent","definition[14]":"rude, and having no respect for people who are older or more important","example[29]":"The boy gave an impudent smile.","display[11]":"irreverent","definition[15]":"showing a lack of respect for someone or something who people are supposed to respect – used especially about comedy programmes and newspaper articles","example[30]":"an irreverent look at the week’s events","example[31]":"his irreverent sense of humour"}