{"word[0]":"hide","past_tense[0]":"hid","past_participle[0]":"hidden","definition[0]":"to deliberately put or keep something or someone in a place where they cannot easily be seen or found","example[0]":"Marcia hid the pictures in her desk drawer.","note[0]":"hide something in/under/behind etc","example[1]":"She keeps a bottle of gin hidden behind a stack of books.","example[2]":"He was accused of trying to hide evidence from the police.","note[1]":"hide something/somebody from somebody","definition[1]":"to cover something so that it cannot be seen clearly","example[3]":"The church roof was half hidden by trees.","example[4]":"Her tangled hair hid her face.","definition[2]":"to go or stay in a place where no one will see or find you","example[5]":"Quick, he’s coming! We’d better hide.","example[6]":"Harry hid under the bed.","note[2]":"hide in/under/behind etc","example[7]":"Weiss spent two years hiding from the Nazis.","note[3]":"hide from somebody","definition[3]":"to keep someone in a place where other people will not find them","example[8]":"The old woman hid him in her cellar for three days.","example[9]":"We’ll have to hide him from the soldiers.","note[4]":"hide somebody from somebody","definition[4]":"to keep your real feelings, plans, or the truth secret, so that they cannot be known by other people","example[10]":"He took off his ring to hide the fact that he was married.","example[11]":"He told the jury that he is innocent and has nothing to hide.","example[12]":"She laughed to hide her nervousness.","note[5]":"hide your disappointment/embarrassment/confusion etc","example[13]":"Don’t try to hide anything from me.","note[6]":"hide something from somebody","definition[5]":"to make something difficult to see or find, or to not show your true feelings","example[14]":"He hid the gun in his pocket.","example[15]":"She tried to hide her anger.","example[16]":"The actress put up a hand to hide her face from the cameras.","display[0]":"conceal","definition[6]":"to hide something, especially by carefully putting it somewhere. Also used when talking about hiding your feelings, especially in negative sentences","example[17]":"Several kilos of drugs were concealed in the back of the truck.","example[18]":"He could not conceal his feelings any longer.","example[19]":"The girl quickly concealed the photograph she had been gazing at.","display[1]":"cover up","definition[7]":"to put something over another thing that you do not want people to see, in order to hide it completely","example[20]":"People cover up cracks with wallpaper or tiles.","example[21]":"I used some make-up to cover up the spots.","example[22]":"She was wearing a thin shawl to cover up the bruises on her arm.","display[2]":"disguise","definition[8]":"to make someone or something seem like a different person or thing, so that other people cannot recognize them","example[23]":"She managed to get into the camp by disguising herself as a soldier.","example[24]":"The men had disguised the vessel as fishing boat.","display[3]":"camouflage","definition[9]":"to hide something by covering it with materials that make it look like the things around it","example[25]":"We camouflaged the plane by covering it with leaves.","example[26]":"The troops used charcoal to camouflage their faces.","example[27]":"Soldiers had camouflaged the trucks with branches and dirt.","display[4]":"obscure","definition[10]":"to make it difficult to see something clearly","example[28]":"The view was obscured by mist.","example[29]":"His body was found, partially obscured by bushes, at the bottom of a shallow canyon.","display[5]":"mask","definition[11]":"to make something less noticeable, for example a taste, a smell, a sound, or a feeling","example[30]":"The lemon helps to mask the taste of the fish.","example[31]":"Helen had turned on the radio to mask the noise of the traffic.","example[32]":"He did little to mask his contempt.","definition[12]":"a place from which you can watch animals or birds without being seen by them","definition[13]":"an animal’s skin, especially when it has been removed to be used for leather","example[33]":"ox hide gloves"}