{"word[0]":"gate","definition[0]":"the part of a fence or outside wall that you can open and close so that you can enter or leave a place","example[0]":"We went through the gate into the orchard.","example[1]":"the wrought-iron gates of the palace","example[2]":"I left the engine running and ran back to close the gate.","note[0]":"open/close/shut a gate","example[3]":"Make sure that the back gate is locked, please.","note[1]":"front/back/main gate","example[4]":"The children poured out of the school gates.","note[2]":"garden/farm/school gate","definition[1]":"the place where you leave an airport building to get on a plane","example[5]":"Air France flight 76 leaves from gate 6A.","definition[2]":"the number of people who go in to see a sports event, especially a football match","definition[3]":"the amount of money that these people pay","collocation[0]":"open a gate","example[6]":"He heard Jack open the gate.","collocation[1]":"close/shut a gate","example[7]":"Please close the gate.","collocation[2]":"lock/padlock a gate","example[8]":"She locked the gate behind her.","collocation[3]":"go through a gate","example[9]":"They went through the gate into the orchard.","collocation[4]":"leave the gate open","example[10]":"Someone left the gate open, and the dog got out.","form[0]":"ADJECTIVES/NOUN + gate","collocation[5]":"the front/back gate","example[11]":"She stood outside the front gate of the cottage.","collocation[6]":"the entrance gate","example[12]":"Derek met us at the entrance gate.","collocation[7]":"the main gate","example[13]":"Soldiers were guarding the main gate.","collocation[8]":"a garden gate","example[14]":"Ellie ran down the path towards the garden gate.","collocation[9]":"a farm/factory/school etc gate","example[15]":"I carefully shut the farm gate behind me.","example[16]":"Lots of parents were waiting outside the school gate.","collocation[10]":"a wooden/iron/wrought-iron gate","example[17]":"Their way was barred by huge wrought-iron gates.","definition[4]":"to prevent a student from leaving a school as a punishment for behaving badly","definition[5]":"used after the name of a place, person, or thing to give a name to an event involving dishonest behaviour by a politician or other public official","example[18]":"Irangate  (=when members of the US government sold weapons to Iran in exchange for the return of American hostages)","definition[6]":"the door leading to the planes at an airport","example[19]":"Air France flight 76 will leave from gate 6A.","definition[7]":"the number of people attending a public place or event such as a football match, amusement park, film etc, or the total sum of money that these people pay","example[20]":"Revenue for the television rights and gate receipts will exceed $10 million.","example[21]":"Universal Studios Hollywood concedes itstotal gate is slightly lower this year.","definition[8]":"if a company or organization opens its gates, it opens for business for the first time. If it closes its gates, it is no longer in business","example[22]":"By the time Disneyland opened its gates, the city of Anaheim had increased to four times its size.","example[23]":"Falling orders forced the factory to close its gates."}