{"word[0]":"exact","definition[0]":"completely correct in every detail","example[0]":"Police are still investigating the exact cause of the accident.","example[1]":"What were his exact words?","example[2]":"The timing had to be exact.","example[3]":"The exact location of the hostages is unknown.","note[0]":"exact location/position/spot etc","example[4]":"I know her birthday’s in July, but I can’t remember the exact date.","note[1]":"exact date/time/number/amount etc","example[5]":"It’s not an exact copy, but most people wouldn’t notice the difference.","note[2]":"exact copy/replica etc","example[6]":"Some concepts in Chinese medicine have no exact equivalent in Western medicine.","definition[1]":"someone who is exact is very careful and thorough in what they do","synonym[0]":"precise","collocation[0]":"the exact amount/number/figure","example[7]":"I don’t know the exact amount, but it was a lot.","collocation[1]":"the exact size","example[8]":"First, cut a piece of wood about 1cm x 10cm – the exact size doesn’t matter.","collocation[2]":"the exact date","example[9]":"He plans to retire soon, but the exact date is not fixed.","collocation[3]":"the exact time/moment","example[10]":"At that exact moment, the phone rang.","collocation[4]":"the exact position/location/spot etc","example[11]":"The satellite pictures showed the enemy’s exact location.","collocation[5]":"an exact copy/replica","example[12]":"The vessel is an exact replica of a Viking longboat.","collocation[6]":"an exact equivalent","example[13]":"There is no exact equivalent in English for the phrase.","collocation[7]":"an exact match","example[14]":"The two DNA samples were an exact match.","collocation[8]":"the exact details","example[15]":"Nobody knows the exact details of what happened.","collocation[9]":"somebody’s exact words","example[16]":"Try to remember his exact words – it’s very important.","collocation[10]":"the exact wording","example[17]":"What was the exact wording of the message?","collocation[11]":"the exact same thing/way etc","example[18]":"If you’d been there, you’d have done the exact same thing.","definition[2]":"an exact  number, amount, or time is completely correct and is no more and no less than it should be","example[19]":"The exact weight of the baby at birth was 3.2 kg.","example[20]":"The exact time is 8:16 a.m.","definition[3]":"precise  information is based on clear and exact figures or measurements, especially when it is important that no mistakes are made","example[21]":"We need to know your precise location.","example[22]":"It’s difficult to be precise about the number of deaths caused by smoking.","definition[4]":"completely correct because all the details are true","example[23]":"The witness tried to give an accurate description of what she had seen.","example[24]":"accurate financial forecasts","definition[5]":"to demand and get something from someone by using threats, force etc","example[25]":"I exacted a promise from Ros that she wouldn’t say a word.","note[3]":"exact something from somebody","definition[6]":"to demand and get something from someone, especially using forceful methods","example[26]":"My client is only claiming the return of taxes exacted under an unlawful demand."}