{"word[0]":"pocket","signpost[0]":"in clothes","definition[0]":"a type of small bag in or on a coat, trousers etc that you can put money, keys etc in","example[0]":"Luke came in with his hands in his pockets.","example[1]":"The policeman told me to turn out my pockets  (=take everything out of them).","example[2]":"The keys are in my trouser pocket.","note[0]":"jacket/trouser etc pocket","example[3]":"the inside pocket of his jacket","note[1]":"pocket of","definition[1]":"the amount of money that you have to spend","example[4]":"There are eight hotels, with a price range to suit every pocket.","example[5]":"The deepening recession has hit people’s pockets.","example[6]":"For investors with deep pockets  (=a lot of money), the Berlin property market is attractive.","example[7]":"Dan had to pay for the repairs out of his own pocket.","note[2]":"from/out of/into your own pocket","example[8]":"He was accused of diverting some of the firm’s money into his own pocket.","signpost[1]":"small container","definition[2]":"a small bag or piece of material fastened to something so that you can put things into it","example[9]":"Please read the air safety card in the pocket of the seat in front.","signpost[2]":"small area/amount","definition[3]":"a small area or amount of something that is different from what surrounds it","example[10]":"In some parts, there are still pockets of violence and unrest.","example[11]":"pockets of air inside the hull of the ship","definition[4]":"a small net on a pool, snooker, or billiard table, which you try to hit balls into","collocation[0]":"put something in your pocket","example[12]":"I put the £5 note in my pocket.","collocation[1]":"stuff/thrust something in your pocket","example[13]":"He took off his cap and stuffed it in his pocket.","collocation[2]":"take something out of/from your pocket","example[14]":"Marcia took a pair of dark glasses out of her pocket.","collocation[3]":"reach into your pocket","example[15]":"\"Do you want a cigarette?\" he asked, reaching into his pocket.","collocation[4]":"search your pocket","example[16]":"I searched my pockets for my train ticket but it wasn't there.","collocation[5]":"turn out/empty your pockets","example[17]":"His mother made him turn out his pockets.","collocation[6]":"dig in your pocket","example[18]":"Boris dug in his pocket for his keys.","collocation[7]":"with your hands in your pockets","example[19]":"I saw him wandering along the beach with his hands in his pockets.","collocation[8]":"somebody's pockets are bulging","example[20]":"Tony's pockets were bulging with loose change.","form[0]":"ADJECTIVES/NOUN + pocket","collocation[9]":"a back/front/side pocket","example[21]":"He took a wad of money from his back pocket.","collocation[10]":"a breast pocket","example[22]":"There was a silk handkerchief in his breast pocket.","collocation[11]":"an inside pocket","example[23]":"Gregson pulled a photo from the inside pocket of his jacket.","collocation[12]":"a jacket/trouser/shirt etc pocket","example[24]":"She slipped the map into her jacket pocket.","definition[5]":"to put something into your pocket","example[25]":"Maggie locked the door and pocketed the keys.","definition[6]":"to steal money, especially money that you are responsible for","example[26]":"One inspector had pocketed up to $500,000 in bribes.","definition[7]":"to get a large amount of money, win a prize etc, especially in a way that seems very easy or slightly dishonest","example[27]":"Johnston pocketed $2,500 in prize money.","definition[8]":"to hit a ball into a pocket in the game of pool, snooker or billiards","synonym[0]":"pot","definition[9]":"small enough to be carried in your pocket","example[28]":"a pocket dictionary","definition[10]":"used to refer to the amount of money people have available to spend","example[29]":"We need to find a way to put more money in people’s pockets.","example[30]":"a savings scheme to suit all pockets (=suitable however much money you have)","example[31]":"a company with deep pockets (=a lot of money)","definition[11]":"a small area or part of something where a situation is very different from other areas or parts","example[32]":"Certain pockets of the aircraft market already have shown themselves to be vulnerable.","definition[12]":"to have less money than you should have after an event such as a business deal","example[33]":"All expenses will be paid. You won’t be out of pocket.","definition[13]":"to give money to someone who needs it","definition[14]":"to earn a lot of money, especially by using unfair methods","example[34]":"Banks are lining their pockets by charging their customers sky-high interest rates.","definition[15]":"a calculator, dictionary etc that is small enough to carry in your pocket","example[35]":"a pocket television","definition[16]":"to get money, especially in a slightly dishonest way or when you do not deserve it","example[36]":"For operating the network, Jefferies pockets about $60,000 a day.","example[37]":"He sold her car for more than she asked for, and pocketed the difference (=kept the extra money for himself).","definition[17]":"to steal money, especially money you are responsible for","example[38]":"The insurer had no record of the policy because the agent had pocketed the premiums."}