{"word[0]":"double","signpost[0]":"of two parts","definition[0]":"consisting of two parts that are similar or exactly the same","example[0]":"a double sink","example[1]":"a double wardrobe","example[2]":"the great double doors of the cathedral","example[3]":"Don’t park your car on double yellow lines.","signpost[1]":"two different uses","definition[1]":"combining or involving two things of the same type","example[4]":"a double murder case","example[5]":"A lot of the jokes were based on double meaning.","signpost[2]":"twice as big","definition[2]":"twice as big, twice as much, or twice as many as usual","example[6]":"a double whisky","example[7]":"The city was enclosed by walls of double thickness.","signpost[3]":"for two people","definition[3]":"made for two people or things to use","example[8]":"Do you need a double bed or two singles?","example[9]":"a double room","example[10]":"a double garage","signpost[4]":"two letters/numbers","definition[4]":"used to say that a particular letter or number is repeated","example[11]":"My name’s Robbins with a double ‘b’.","example[12]":"The number is 869 double 2 (=86922).","signpost[5]":"flower","definition[5]":"a double flower has more than the usual number of petals","signpost[6]":"twice the size","definition[6]":"something that is twice as big, as much etc as usual or as something else","example[13]":"Scotch and water, please – make it a double.","example[14]":"‘They offered me £10,000.’ ‘I’ll give you double.’","definition[7]":"a room for two people in a hotel","example[15]":"A double costs $95 a night.","signpost[7]":"baseball","definition[8]":"a hit in baseball which allows the batter to reach second base","example[16]":"Walker led the inning with a double.","signpost[8]":"in films","definition[9]":"an actor who takes the place of a more famous actor in a film, especially because the acting involves doing something dangerous","example[17]":"I think they used a double in the shower scene.","definition[10]":"to become twice as big or twice as much, or to make something twice as big or twice as much","example[18]":"The church has doubled its membership in the last five years.","example[19]":"Within two years the company had doubled in size.","note[0]":"double in size/number/value etc","example[20]":"A promise was given to double the number of police on duty.","note[1]":"double the size/number/amount etc (of something)","definition[11]":"to fold something in half","example[21]":"Take a sheet of paper and double it over.","definition[12]":"to hit the ball far enough to get to second base in a game of baseball","pos[0]":"predeterminer","definition[13]":"twice as big, twice as much, or twice as many","example[22]":"The value of the house is double what it was.","example[23]":"We’ll need double this amount for eight people.","note[2]":"double the amount/number/size etc","definition[14]":"twice as big, twice as much, or twice as many as usual, or twice as big, much, or many as something else","example[24]":"The number of men receiving professional degrees today is still nearly double that of women.","definition[15]":"something that is nearly twice the size, quantity, value, or strength of something else","example[25]":"‘What did they offer you?’ ‘Ten thousand.’ ‘I’ll give you double.’","definition[16]":"to become twice as much or as many, or to make something twice as big","example[26]":"The costs of providing medical insurance for employees has doubled in recent years.","example[27]":"GE plans to more than double the size of its railcar leasing operation."}