{"word[0]":"check","signpost[0]":"find out","definition[0]":"to do something in order to find out whether something really is correct, true, or in good condition","example[0]":"Check the tiles carefully before you buy them.","example[1]":"A first rule in solving any mystery is to check the facts.","example[2]":"Fill in the cash book carefully and always check your calculations.","example[3]":"Positive test results are double-checked (=looked at twice) to make absolutely sure.","example[4]":"Check that all the doors are locked securely.","note[0]":"check (that)","example[5]":"Let me just check whether the potatoes are cooked.","note[1]":"check whether/how/who etc","example[6]":"They paused to check how the other climbers were getting on.","example[7]":"I checked the typing for errors.","note[2]":"check (something) for something","example[8]":"Turn the tap on and check for leaks.","example[9]":"You must check the evidence against other sources and decide if it is reliable.","note[3]":"check something against/with something","signpost[1]":"ask somebody","definition[1]":"to ask someone whether something is correct, true, or allowed","example[10]":"I’m not authorized to give you a refund – I’ll have to check first.","example[11]":"Make a phone call to check that you’re writing to the right person.","example[12]":"Call the factory to check whether the beds can be delivered today.","example[13]":"Check with your doctor before going on a diet.","note[4]":"check with","signpost[2]":"not do something","definition[2]":"to suddenly stop yourself from saying or doing something because you realize it would be better not to","example[14]":"I had to check the urge to laugh out loud.","example[15]":"He grinned, and then checked himself, not wanting to upset Jack.","note[5]":"check yourself","signpost[3]":"stop something","definition[3]":"to stop something bad from getting worse or continuing to happen","example[16]":"The police are failing to take adequate measures to check the growth in crime.","signpost[4]":"bags/cases etc","definition[4]":"to leave your bags at an official place so they can be put on a plane or a train, or to take someone’s bags in order to do this","example[17]":"Any luggage over five kilos must be checked.","signpost[5]":"make a mark","definition[5]":"to make a mark (✓) next to an answer, something on a list etc to show you have chosen it, that it is correct, or that you have dealt with it","definition[6]":"to look at something carefully and thoroughly in order to make sure that it is correct, safe, or working properly","example[18]":"I’ll just check the water level in the battery.","example[19]":"The immigration officer checked their passports.","example[20]":"We need to check the building for structural damage.","display[0]":"examine","definition[7]":"to look at something carefully and thoroughly because you want to find out something about it","example[21]":"Experts who examined the painting believe it is genuine.","example[22]":"The police will examine the weapon for fingerprints.","display[1]":"inspect","definition[8]":"to look at something carefully and thoroughly in order to make sure that it is correct, safe, or working properly, especially when it is your job to do this","example[23]":"The building is regularly inspected by a fire-safety officer.","example[24]":"Some insurance people have already been here to inspect the damage caused by the storm.","display[2]":"go through something","definition[9]":"to examine something such as a document or plan from beginning to end, especially in order to check that it is correct","example[25]":"You should go through the contract before you sign.","example[26]":"I’ve finished my essay, but I just need to go through it to check for spelling mistakes.","display[3]":"double-check","definition[10]":"to check something again so that you are completely sure it is correct, safe, or working properly","example[27]":"I double-checked all my calculations and they seemed fine.","example[28]":"Travellers should double-check flight information before setting off today.","definition[11]":"to examine or use something in order to find out whether it works or what its qualities are, or in order to check that it is satisfactory","example[29]":"Test your brakes to check they are working correctly.","example[30]":"These products have not been tested on animals.","display[4]":"monitor","definition[12]":"to carefully watch or keep checking someone or something in order to see what happens over a period of time","example[31]":"Doctors monitored her progress during the night.","example[32]":"Observers have been monitoring the situation in Burma closely.","definition[13]":"say this when someone mentions each thing on a list, to tell them that you have it or have done it","example[33]":"‘Passport?’ ‘Check.’ ‘Ticket?’ ‘Check’.","signpost[6]":"finding out","definition[14]":"the process of finding out if something is safe, correct, true, or in the condition it should be","note[6]":"health/medical/dental etc check (=a test done to make sure you are healthy)","example[34]":"I keep a careful check on my blood pressure.","example[35]":"the airport’s routine security checks","example[36]":"random drug checks","example[37]":"I decided to run a check on all personnel.","note[7]":"run/carry out/make a check","example[38]":"Have a check in your bag first and see if it’s there.","note[8]":"have a check","example[39]":"a spot check on the accounts","note[9]":"spot check","example[40]":"the need for tighter checks on arms sales","note[10]":"check on","example[41]":"Conduct regular checks on your water quality.","signpost[7]":"a control on something","definition[15]":"something that controls something else and stops it from getting worse, continuing to happen etc","example[42]":"Higher interest rates will act as a check on public spending.","signpost[8]":"pattern","definition[16]":"a pattern of squares, especially on cloth","example[43]":"a shirt with brown and black checks","example[44]":"a blue cotton check dress","note[11]":"check suit/jacket etc","signpost[9]":"from your bank","definition[17]":"the American spelling of cheque","example[45]":"a check for $30","note[12]":"check for","example[46]":"Can I pay by check?","note[13]":"by check","signpost[10]":"in a restaurant","definition[18]":"a list that you are given in a restaurant showing what you have eaten and how much you must pay","definition[19]":"a mark (✓) that you put next to an answer to show that it is correct or next to something on a list to show that you have dealt with it","signpost[11]":"chess","definition[20]":"the position of the king (=most important piece) in chess where it can be directly attacked by the opponent’s pieces","collocation[0]":"do a check","example[47]":"I did a quick check of all the windows, locked the door and left.","collocation[1]":"make a check","example[48]":"One of the nurses makes regular checks during the night.","collocation[2]":"run a check","example[49]":"You should run a virus check before downloading from the Internet.","collocation[3]":"carry out/conduct a check","example[50]":"The police carried out a check on the car’s registration number.","example[51]":"Always have a final check to make sure you’ve got your ticket and passport.","collocation[4]":"give something a check","example[52]":"I’d like you to give the car a careful check.","collocation[5]":"keep a check on somebody/something","example[53]":"Keep a check on your baby’s temperature.","collocation[6]":"go for a medical/dental etc check","example[54]":"She advised me to go for a medical check.","form[0]":"ADJECTIVES/NOUN + check","collocation[7]":"a quick check","example[55]":"A quick check showed that someone had been in the room.","collocation[8]":"a thorough/careful check","example[56]":"An engineer gave the computer a thorough check.","collocation[9]":"a routine check","example[57]":"I went to the doctor for a routine health check.","collocation[10]":"a random check","example[58]":"Customs officials were carrying out random checks on cars.","collocation[11]":"a regular check","example[59]":"It’s vital to keep a regular check on your bank balance.","collocation[12]":"a close check","example[60]":"His teacher was keeping a close check on his progress.","collocation[13]":"a safety/security check","example[61]":"The security checks at the airport can take a long time.","collocation[14]":"a health/medical check","example[62]":"People over 60 should have regular medical checks.","collocation[15]":"a background check","example[63]":"The company conducts background checks on security employees.","collocation[16]":"a credit check","example[64]":"Banks usually do a credit check before they give you a loan.","collocation[17]":"a spot check","example[65]":"They did a spot check on 160 vehicles to see how many passengers were wearing seat belts.","collocation[18]":"a spell check","example[66]":"Have you done a spell check on your essay?","definition[21]":"the American spelling of CHEQUE","example[67]":"After a minute, she wrote out the check and placed it on the table.","definition[22]":"an examination or investigation of something to see that it is correct, true, or safe and in the condition it should be","example[68]":"The fund is monitored regularly by carrying out a check of all outgoing payments against the register.","example[69]":"You can get a free safety check on your gas fire from British Gas.","example[70]":"I passed my medical check and was then sent to HQ.","definition[23]":"to watch or examine something regularly to make sure that it is correct, true, or safe and in the condition it should be","example[71]":"It’s important to keep a constant check on cashflow.","definition[24]":"something that controls another thing and stops it from happening more or getting worse","example[72]":"Higher interest rates act as a check on government spending.","definition[25]":"to keep something under control","example[73]":"The bank may have to raise interest rates further to keep inflation in check.","definition[26]":"the bill you are given in a restaurant at the end of your meal, showing what you have eaten and the cost","definition[27]":"a mark that you put next to an answer to show it is correct or against an item on a list to show that you have dealt with it","definition[28]":"to find out whether something is correct, true, or safe","example[74]":"Insurance arrangements will be included in the pension scheme, but you should check that cover is adequate.","example[75]":"Employers have the right to check the criminal record of a potential employee.","definition[29]":"to stop something bad from happening more or getting worse","example[76]":"They welcomed the Bundesbank’s tighter monetary policy to check inflation and provide for a healthier economic recovery next year.","definition[30]":"to hand your bags to someone at an airport so that they will be put on the plane you are going to take","example[77]":"We checked our baggage and went for a meal.","definition[31]":"to make a mark next to an answer or something on a list to show that it is correct or has been dealt with"}