{"word[0]":"feel","past_tense[0]":"felt","type[0]":"linking verb, transitive","signpost[0]":"feeling/emotion","definition[0]":"to experience a particular physical feeling or emotion","example[0]":"Do you still feel hungry?","example[1]":"You can never tell what he’s feeling.","example[2]":"Stop exercising if you feel any pain.","example[3]":"I felt like I’d really achieved something.","example[4]":"I’m feeling a little better today.","note[0]":"feel fine/good/comfortable etc","example[5]":"Marie immediately felt guilty.","example[6]":"When his dad left, he felt as though his world had turned upside-down.","note[1]":"feel as if/as though","definition[1]":"to notice something that is happening to you, especially something that is touching you","example[7]":"She felt his warm breath on her cheek.","example[8]":"The earthquake was felt as far south as San Diego.","example[9]":"She felt his arms go round her.","note[2]":"feel somebody/something do something","example[10]":"I felt myself blushing.","note[3]":"feel yourself doing something","signpost[1]":"feel smooth/dry etc","definition[2]":"to give you a particular physical feeling, especially when you touch or hold something","example[11]":"It’s nice fabric – it feels like velvet.","example[12]":"Her hands felt rough.","note[4]":"feel smooth/cold/damp etc","example[13]":"The house felt hot and stuffy.","example[14]":"My leg feels as if it’s broken.","signpost[2]":"feel good/strange/exciting etc","definition[3]":"if a situation, event etc feels good, strange etc, that is the emotion or feeling that it gives you","example[15]":"After twenty years, seeing him again felt very strange.","example[16]":"It’s been a year since her daughter died, but to her, it still feels like yesterday.","example[17]":"It felt wonderful to be wearing clean clothes again.","note[5]":"feel ... to be/do something","example[18]":"How does it feel to be 40?","signpost[3]":"have an opinion","definition[4]":"to have a particular opinion, especially one that is based on your feelings, not on facts","example[19]":"She felt sure she’d made the right decision.","note[6]":"feel sure/certain","example[20]":"Some of the parents felt the school wasn’t doing enough about bullying.","note[7]":"feel (that)","example[21]":"How would you feel about working with Nicole for a while?","note[8]":"feel about","example[22]":"What does your partner feel about all this?","explanation[0]":"Feel is not usually used in the progressive in this meaning You say","example[23]":"I feel this is probably the right decision","bad_example[0]":"I’m feeling this is probably the right decision","explanation[1]":"In more formal English, you say it is felt that when saying what many people think","example[24]":"It was felt that the experiment should be stopped","definition[5]":"to touch something with your fingers to find out about it","example[25]":"She felt his forehead. Perhaps he had a temperature.","example[26]":"Mum, feel this stone. Isn’t it smooth?","example[27]":"He could feel how damp his shirt was against his chest.","note[9]":"feel how hard/soft/rough etc something is","explanation[2]":"Feel is a linking verb This type of verb links the subject of the sentence with an adjective or noun","example[28]":"She felt tired at the end of the day","example[29]":"I feel such an idiot","definition[6]":"a quality that something has that makes you feel or think a particular way about it","example[30]":"Despite their age, the photographs have a modern feel.","example[31]":"The restaurant has a nice relaxed feel about it.","definition[7]":"the way that something feels when you touch it","example[32]":"a soft feathery feel","example[33]":"I like the feel of this cloth.","note[10]":"feel of","definition[8]":"when you use your hands, body etc to feel something","example[34]":"She found the light switch by feel.","note[11]":"by feel"}