{"word[0]":"threshold","definition[0]":"the entrance to a room or building, or the area of floor or ground at the entrance","example[0]":"She opened the door and stepped across the threshold.","definition[1]":"the level at which something starts to happen or have an effect","note[0]":"a high/low pain/boredom etc threshold (=the ability or inability to suffer a lot of pain or boredom before you react to it)","example[1]":"Eighty percent of the vote was the threshold for approval of the plan.","definition[2]":"at the beginning of a new and important event or development","synonym[0]":"brink","example[2]":"The creature is on the threshold of extinction.","note[1]":"be on the threshold of something","heading[0]":"– Meaning 2: the level at which something starts to happen or have an effect","form[0]":"ADJECTIVES/NOUN + threshold","collocation[0]":"somebody’s pain threshold","example[3]":"‘Will it hurt?’ ‘That all depends on your pain threshold.’","collocation[1]":"somebody’s boredom threshold","example[4]":"She loves challenges and admits she has a low boredom threshold.","collocation[2]":"a tax threshold","example[5]":"The Conservatives promised to help the lower paid by increasing the tax threshold.","collocation[3]":"a high threshold","example[6]":"Professional football players have a pretty high pain threshold.","collocation[4]":"a low threshold","example[7]":"I know that young children have very low boredom threshold.","collocation[5]":"exceed a threshold","example[8]":"The value of many family homes far exceeds the inheritance tax threshold.","collocation[6]":"lower a threshold","example[9]":"the demand to lower the retirement threshold to 60","collocation[7]":"raise a threshold","example[10]":"They should raise the threshold to at least £245 a week.","collocation[8]":"cross the threshold","example[11]":"Such a person has sufficiently crossed the threshold of criminality to justify punishment.","definition[3]":"the level at which something belongs in a particular class or is affected by a particular rule","example[12]":"Many large mortgages were taken out, on the assumption that interest rates would remain below the ten percent threshold.","example[13]":"The vehicles will have 70% U.S. content, which is the legal threshold for being an American car.","note[2]":"threshold for"}