{"word[0]":"choose","past_tense[0]":"chose","past_participle[0]":"chosen","definition[0]":"to decide which one of a number of things or people you want","example[0]":"It took us ages to choose a new carpet.","example[1]":"A panel of judges will choose the winner.","example[2]":"He chose his words carefully as he spoke.","example[3]":"I don’t mind which one we have – you choose.","example[4]":"For pudding we could choose between ice cream and apple tart.","note[0]":"choose between","example[5]":"You can choose from a wide range of vehicles.","note[1]":"choose from","example[6]":"I chose to learn German rather than French.","note[2]":"choose to do something","example[7]":"They chose Donald to be their leader.","note[3]":"choose somebody/something to do something","example[8]":"The company chose London as its base.","note[4]":"choose somebody/something as something","example[9]":"Why did you choose me for the job?","note[5]":"choose somebody/something for something","example[10]":"You can choose what you want to do first.","note[6]":"choose which/whether/what etc","definition[1]":"to decide to do something because that is what you prefer to do","example[11]":"You can, if you choose, invest in the stock market.","example[12]":"I chose to ignore his advice.","definition[2]":"to decide which one of several things you want","example[13]":"I chose a black dress.","example[14]":"Which dessert should I choose?","display[0]":"pick","definition[3]":"to choose something, especially without thinking carefully. Pick is more informal than choose","example[15]":"Pick any number from one to ten.","display[1]":"select","definition[4]":"to choose something, especially after thinking carefully","example[16]":"The committee will meet to select a new chairman.","example[17]":"All our instructors are carefully selected.","display[2]":"opt for/go for","definition[5]":"to choose one thing instead of another","example[18]":"Many car buyers opt for used vehicles.","example[19]":"I think I’ll go for the chocolate cake.","display[3]":"decide on","definition[6]":"to choose something from many possible things, especially when the decision has been difficult or taken a long time","example[20]":"Thomas had decided on a career as a writer.","display[4]":"single out","definition[7]":"to choose one person or thing from a group because they are better, worse, more important etc than the others","example[21]":"Why should he be singled out for special treatment?","example[22]":"One student was singled out for special attention.","display[5]":"take your pick","definition[8]":"to choose anything you want, especially when there are many different things available","example[23]":"You can take your pick from Bodrum’s many bars and restaurants."}