{"definition[0]":"to become less or go down to a lower level, or to make something do this","example[0]":"The number of people who have the disease has decreased significantly in recent years.","example[1]":"They want to decrease their reliance on oil.","example[2]":"Average house prices decreased by 13% last year.","note[0]":"decrease by","example[3]":"By 1881, the population of Ireland had decreased to 5.2 million.","note[1]":"decrease to","example[4]":"The North’s share of the world’s energy consumption is expected to decrease from 70% to 60%.","note[2]":"decrease from","example[5]":"Attacks of asthma decrease in frequency through early adult life.","note[3]":"decrease in","collocation[0]":"significantly","example[6]":"Violent crime has significantly decreased over the last ten years.","collocation[1]":"considerably/substantially","example[7]":"During this period unemployment decreased considerably.","collocation[2]":"markedly","example[8]":"Aircraft collisions decreased markedly during the 1990s.","collocation[3]":"rapidly","example[9]":"Since then, elephant numbers have been decreasing rapidly.","collocation[4]":"dramatically","example[10]":"The survival rate decreases dramatically as the disease progresses.","example[11]":"Population levels actually began to slightly decrease five years ago.","collocation[5]":"steadily","example[12]":"The proportion of adult cigarette smokers has been steadily decreasing.","explanation[0]":"Decrease belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[1]":"In this sentence, ‘the number of buses’ is the object of decrease","example[13]":"They decreased the number of buses","explanation[2]":"In this sentence, ‘the number of buses’ is the subject of decrease","example[14]":"The number of buses decreased","definition[1]":"to become less in number or amount","example[15]":"The average rainfall has decreased by around 30 percent.","display[0]":"go down","definition[2]":"to decrease. Go down is less formal than decrease and is the usual word to use in conversation","example[16]":"Unemployment has gone down in the past few months.","display[1]":"decline","definition[3]":"to decrease – used with numbers or amounts, or about the level or standard of something","example[17]":"The standard of living has declined.","example[18]":"Support for the government is  steadily declining.","example[19]":"Salaries have declined by around 4.5%.","display[2]":"diminish","definition[4]":"to become smaller or less important","example[20]":"Union membership diminished from 30,000 at its height to just 2,000 today.","display[3]":"fall/drop","definition[5]":"to decrease, especially by a large amount. Fall and drop are less formal than decrease","example[21]":"The number of tigers in the wild has fallen to just over 10,000.","example[22]":"At night, the temperature drops to minus 20 degrees.","display[4]":"plunge","definition[6]":"to suddenly decrease very quickly and by a very large amount","example[23]":"Share prices have plummeted 29% in the last four months.","example[24]":"Climate change could cause global temperatures to plummet.","display[5]":"slide","definition[7]":"if a price or value slides, it gradually decreases in a way that causes problems – used especially in news reports","example[25]":"The dollar fell in late trading in New York yesterday and slid further this morning.","display[6]":"dwindle","definition[8]":"to gradually decrease until there is very little left of something, especially numbers or amounts, popularity, or importance","example[26]":"Support for the theory is dwindling.","display[7]":"taper off","definition[9]":"if a number or the amount of an activity that is happening tapers off, it gradually decreases, especially so that it stops completely","example[27]":"Political violence tapered off after the elections.","definition[10]":"the process of becoming less, or the amount by which something becomes less","synonym[0]":"reduction","example[28]":"Teachers reported decreases in drug use and verbal abuse of teachers.","note[4]":"a decrease in something","example[29]":"There has been a decrease of 1 degree in average temperature.","note[5]":"a decrease of 50/5% etc","definition[11]":"used when the number, amount, or level of something becomes less than it used to be","example[30]":"There has been a significant decrease in the number of deaths from lung cancer.","example[31]":"a 5% decrease in housing prices","definition[12]":"used when the price, amount, or level of something is made lower","example[32]":"There will be further price reductions in the sales.","example[33]":"A small reduction in costs can mean a large increase in profits.","definition[13]":"used when a government or company reduces the price, amount, or level of something","example[34]":"a 1% cut in interest rates","example[35]":"tax cuts","example[36]":"It is possible that there will be further job cuts.","display[8]":"drop/fall","definition[14]":"used when the number, amount, or level of something goes down, especially by a large amount","example[37]":"The figures showed a sharp fall in industrial output.","example[38]":"There was a dramatic drop in temperature.","definition[15]":"used when the number, amount, level, or standard of something goes down, especially gradually","example[39]":"During the 1970s, there was a gradual decline in the birthrate.","example[40]":"a decline in educational standards","definition[16]":"to go down to a lower level, or to make something do this","example[41]":"Network television viewing continues to decrease.","example[42]":"The bank decreased its dividend to 15 cents from 31.25 cents a share.","definition[17]":"the process of reducing something, or the amount by which it reduces","example[43]":"The government announced a 25% decrease in the price of fuel.","example[44]":"Industrial production last month rose 0.5%, after a decrease of 0.2% in December.","note[6]":"decrease of"}