{"word[0]":"exclusive","definition[0]":"available or belonging only to particular people, and not shared","example[0]":"Our figure skating club has exclusive use of the rink on Mondays.","note[0]":"exclusive access/rights/use etc","example[1]":"Tune in to our exclusive coverage of Wimbledon.","note[1]":"exclusive report/interview/coverage etc","example[2]":"This offer is exclusive to readers of ‘The Sun’.","note[2]":"exclusive to","definition[1]":"exclusive places, organizations, clothes etc are so expensive that not many people can afford to use or buy them","example[3]":"Bel Air is an exclusive suburb of Los Angeles.","example[4]":"an exclusive girls’ school","definition[2]":"deliberately not allowing someone to do something or be part of a group","example[5]":"a racially exclusive hiring policy","definition[3]":"concerned with only one thing","opposite[0]":"inclusive","example[6]":"The committee’s exclusive focus will be to improve public transportation.","heading[0]":"– Meaning 1: available or belonging only to particular people, and not shared","collocation[0]":"the exclusive rights to something","example[7]":"BSkyB had exclusive rights to all the live matches.","collocation[1]":"exclusive access to something","example[8]":"Regulations prohibit anyone having exclusive access to the data.","collocation[2]":"the exclusive use of something","example[9]":"We had exclusive use of the house while he was away.","collocation[3]":"an exclusive report/interview/picture","example[10]":"The newspaper featured exclusive pictures of the couple’s new baby.","collocation[4]":"exclusive coverage","example[11]":"You can watch exclusive coverage of all the matches on BBC1.","collocation[5]":"an exclusive deal/contract","example[12]":"Our firm has an exclusive contract to handle the company’s legal affairs.","collocation[6]":"an exclusive club","example[13]":"Unfortunately, I’m not a member of the exclusive club of millionaires.","heading[1]":"– Meaning 2: exclusive places, organizations, clothes etc are so expensive that not many people can afford to use or buy them","collocation[7]":"an exclusive suburb/area","example[14]":"They live in an exclusive suburb on the north side of the city.","collocation[8]":"an exclusive neighbourhood","example[15]":"Some of these kids are from the most exclusive neighbourhoods.","collocation[9]":"an exclusive hotel","example[16]":"With its marble columns and crystal chandeliers, the Crillon is one of the most exclusive hotels in Paris.","collocation[10]":"an exclusive school","example[17]":"Marjorie went to an exclusive girls’ school.","collocation[11]":"an exclusive shop","example[18]":"I walked along Bond Street, past all the exclusive shops.","definition[4]":"an important or exciting story that is printed in only one newspaper, because that newspaper was the first to find out about it","example[19]":"a New York Post exclusive about the Kennedy marriage","definition[5]":"an exclusive agreement, contract, or right is one that a single person or organization has and no one else has","example[20]":"They have signed anexclusive agreement to market and sell the diamonds to retail jewelers in Switzerland.","example[21]":"We hold an exclusive license (=a right that no one else has) to make and market the systems in Japan.","example[22]":"The parent company has exclusive rights to any commercial product that exploits the research.","example[23]":"This offer is exclusive to readers of The Economist.","definition[6]":"exclusive places, products etc are so expensive that not many people can afford to buy them","definition[7]":"if a figure is exclusive of a particular amount, it does not include that amount","example[24]":"The manufacturer’s operating costs fell 8%, exclusive of depreciation and amortization.","example[25]":"It costs £200, exclusive of VAT."}