{"word[0]":"class","signpost[0]":"social group","definition[0]":"one of the groups in a society that different types of people are divided into according to their jobs, income, education etc","example[0]":"a member of the landed class  (=people who own land)","definition[1]":"the system in which people are divided into these groups","example[1]":"Defining the concept of class is not an easy task.","example[2]":"The class system is slowly disappearing.","signpost[1]":"students","definition[2]":"a group of students who are taught together","example[3]":"Gary came top of the class in English.","example[4]":"My class are going to the science museum.","example[5]":"We’re in the same class for chemistry.","note[0]":"in a class","definition[3]":"a group of students who finished studying together in the same year","example[6]":"a class reunion","example[7]":"The class of '69 spent almost as much time protesting as learning.","note[1]":"the class of 1965/2001 etc","signpost[2]":"teaching period","definition[4]":"a period of time during which someone teaches a group of people, especially in a school","example[8]":"I missed Bible class last week.","example[9]":"He was injured in a science class.","example[10]":"No talking in class!","note[2]":"in class","signpost[3]":"studying","definition[5]":"a series of classes in a particular subject","example[11]":"a dance class","example[12]":"Cindy’s taking a class on dealing with stress.","example[13]":"a class in photography at night school","note[3]":"class in","signpost[4]":"same type of something","definition[6]":"a group of people, animals, or things that are considered together because they are similar in some way","example[14]":"Have you passed a test for this class of vehicle?","note[4]":"class of","signpost[5]":"train/aircraft etc","definition[7]":"one of the different standards of seats, food etc available on a train, aircraft etc","example[15]":"We always travel first class.","note[5]":"first/business/tourist etc class","signpost[6]":"quality","definition[8]":"a group into which people or things are divided according to their quality or abilities","example[16]":"He’s not in the same class (=not as good) as her at tennis.","example[17]":"The port now attracts a wealthier class of visitor.","note[6]":"nicer/better etc class of something","example[18]":"Its sheer versatility puts this computer in a different class.","note[7]":"in a class of its own/in a different class","signpost[7]":"style/skill","definition[9]":"a high level of style or skill in something","note[8]":"class player/actress etc","example[19]":"A fountain will give your garden a touch of class.","example[20]":"The team showed real class in this afternoon’s match.","note[9]":"have/show class","example[21]":"Laughton is a class act who’s proved his worth in the game.","note[10]":"a class act","signpost[8]":"university degree","definition[10]":"one of the three levels of a university degree","example[22]":"a second class degree","collocation[0]":"social class","example[23]":"Is there a link between crime and social class?","collocation[1]":"the working/lower class","example[24]":"At this time most of the working class was very poor.","collocation[2]":"the middle class","example[25]":"A new middle class emerged after the war.","collocation[3]":"the upper class","example[26]":"Members of the upper class didn’t have to work.","collocation[4]":"the ruling class","example[27]":"For a long time, French was the language of the ruling class.","collocation[5]":"the professional class","example[28]":"Doctors, lawyers, and teachers are all members of the professional class.","collocation[6]":"the landowning/landed class","example[29]":"This imposition of taxes angered the landed classes.","collocation[7]":"the educated class","example[30]":"The educated classes shared certain values and experiences.","collocation[8]":"the privileged class","example[31]":"Holidays abroad used to be only for the rich and privileged classes.","collocation[9]":"belong to a class","example[32]":"Like you, I belong to the working class.","collocation[10]":"be a member of a class","example[33]":"I suppose I’m a member of the middle class.","form[0]":"class + NOUN","collocation[11]":"a class system/structure","example[34]":"He felt he was a victim of the class system.","collocation[12]":"a class division","example[35]":"Nowadays, class divisions are related to economic status.","collocation[13]":"class differences","example[36]":"There are noticeable class differences in family size.","collocation[14]":"the class struggle/war","example[37]":"the class struggle between workers and capitalists","collocation[15]":"class conflict","example[38]":"This is the basis of class conflict in capitalist society.","collocation[16]":"class consciousness","example[39]":"There is a high level of class consciousness among the workers.","heading[0]":"– Meanings 3 & 4","form[1]":"ADJECTIVES/NOUN + class","collocation[17]":"a French/geography/history etc class","example[40]":"I have a history class at nine o'clock today.","collocation[18]":"an evening class","example[41]":"Mum goes to an evening class on Tuesdays.","collocation[19]":"a beginners’/elementary/intermediate/advanced class","example[42]":"An advanced class might be available.","collocation[20]":"go to/attend a class","example[43]":"I’ve got to go to a science class now.","collocation[21]":"attend class","example[44]":"You can’t pass your exams if you don’t attend class.","collocation[22]":"take a class","example[45]":"I’m taking some art classes at the moment.","collocation[23]":"teach a class","example[46]":"One of the other teachers was ill so I taught her class.","collocation[24]":"miss a class","example[47]":"Students who miss classes get behind with their work.","collocation[25]":"be late for class","example[48]":"David was late for class again.","collocation[26]":"have a class","example[49]":"What classes do you have this morning?","collocation[27]":"hold a class","example[50]":"Evening classes are held in the local school.","definition[11]":"a group of students or schoolchildren who are taught together","example[51]":"There are twenty kids in the class.","example[52]":"She gets along well with the other children in her class.","example[53]":"I’m going out with some friends from my dance class.","example[54]":"'I graduated in 1999.' 'What class were you in?'","display[0]":"background","definition[12]":"the type of home and family you come from, and its social class","example[55]":"The school takes kids from all sorts of backgrounds.","example[56]":"We come from the same town and share a similar background.","example[57]":"The organization helps children from working-class backgrounds to go to university.","display[1]":"middle-class","definition[13]":"belonging to the class of people who are usually well educated, fairly rich, and who work in jobs which they have trained to do. For example, doctors, lawyers, and managers are middle-class","example[58]":"The newspaper’s readers are mostly middle class.","example[59]":"They live in a middle-class neighbourhood on the edge of town.","display[2]":"white-collar","definition[14]":"someone who works in an office, not a factory, mine etc","example[60]":"The economic recession has put many white-collar workers in danger of losing their jobs.","display[3]":"working-class","definition[15]":"belonging to the class of people who do not have much money or power, and who have jobs where they do physical work. For example, factory workers, builders, and drivers are  working-class","example[61]":"Most of the people who live round here are working class.","example[62]":"I come from a working-class family – I’m the first one to graduate from college.","display[4]":"blue-collar","definition[16]":"someone who does physical work, for example in a factory or a mine, and does not work in an office","example[63]":"His political support comes mainly from blue-collar workers.","display[5]":"upper-class","definition[17]":"belonging to the class of people who originally had most of the money and power, especially families that own a lot of land","example[64]":"Most senior politicians in the UK are from upper-class families.","example[65]":"He spoke with an upper-class accent.","display[6]":"underclass","definition[18]":"the lowest social class, who are very poor and may not have jobs, homes etc","example[66]":"The government has created an underclass who do not feel they have any rights in society.","definition[19]":"to consider people, things etc as belonging to a particular group, using an official system","synonym[0]":"classify","example[67]":"Heroin and cocaine are classed as hard drugs.","note[11]":"class somebody/something as something","explanation[0]":"Class is often passive","definition[20]":"one of the groups that society can be divided into according to their jobs, income etc","example[68]":"the professional classes","example[69]":"Social class 4 consists of semi-skilled manual occupations.","example[70]":"a working-class area of the city","definition[21]":"a particular quality of product or service","example[71]":"Many more women are now buying their own luxury class jewellery.","example[72]":"Boeing 767s have 174 seats — 14 for first class, 30 for business class, and 130 for economy class.","definition[22]":"a particular type of product or service","example[73]":"The company is developing a new class of pharmaceuticals based on nucleotides.","definition[23]":"a particular type of a company’s liabilities, or the people to whom they are owed","example[74]":"One class of secured creditors will receive 95% of the face value of their bonds.","definition[24]":"different types of shares in a company whose owners have different rights in the company, for example different voting rights and different rights to be repaid if the company goes bankrupt","example[75]":"Google said it planned to sell 14.16 million of its Class A shares."}