{"word[0]":"ugly","comparative[0]":"uglier","superlative[0]":"ugliest","definition[0]":"extremely unattractive and unpleasant to look at","synonym[0]":"hideous","opposite[0]":"beautiful","example[0]":"a very ugly man","example[1]":"the ugliest building in town","example[2]":"Nick’s dog is as ugly as sin (=very ugly).","definition[1]":"used to describe a situation which is very bad or violent, and which makes you feel frightened or threatened","example[3]":"There were ugly scenes as rival gangs started attacking each other.","example[4]":"an ugly incident","definition[2]":"ugly ideas, feelings, remarks etc are unpleasant","example[5]":"Jealousy is an ugly emotion.","example[6]":"ugly rumors","definition[3]":"very unpleasant to look at – used about people, objects, and buildings","example[7]":"She thinks she's ugly but she's not.","example[8]":"an ugly block of flats","example[9]":"cheap ugly furniture","display[0]":"unattractive","definition[4]":"not pleasant to look at. Unattractive sounds more formal and less strong than ugly","example[10]":"an unattractive modern town which was built during the 1960s","example[11]":"Women found him unattractive.","display[1]":"unsightly","definition[5]":"not pleasant to look at, and spoiling the appearance of something","example[12]":"Unsightly red spots started to appear on her face.","example[13]":"The windows have been blocked off with unsightly metal bars.","heading[0]":"extremely ugly","example[14]":"His hideous face twisted into a smile.","example[15]":"a hideous concrete shopping centre","example[16]":"a hideous monster","display[2]":"repulsive","definition[6]":"extremely ugly, especially in a way that makes you want to look away","example[17]":"His appearance was so repulsive he had to wear a mask.","display[3]":"grotesque","definition[7]":"extremely ugly in a strange or unnatural way","example[18]":"A grotesque figure appeared out of the darkness.","display[4]":"an eyesore","definition[8]":"something that is so ugly that it spoils the appearance of an area","example[19]":"Local residents regard the new office building as an eyesore.","example[20]":"I think wind turbines are a blot on the landscape - why can't people just use less electricity?"}