{"word[0]":"destruction","definition[0]":"the act or process of destroying something or of being destroyed","example[0]":"weapons of mass destruction","example[1]":"the environmental destruction caused by the road building programme","example[2]":"The floods brought death and destruction to the area.","example[3]":"the destruction of the rainforest","note[0]":"destruction of","form[0]":"ADJECTIVES/NOUN + destruction","collocation[0]":"total/complete destruction","example[4]":"In a populated area, a wave that high would cause total destruction.","collocation[1]":"wholesale destruction","example[5]":"It was an act of war, the wholesale destruction of a city.","collocation[2]":"wanton destruction","example[6]":"People were shocked by the wanton destruction that occurred during the riots.","collocation[3]":"environmental destruction","example[7]":"The islands are already threatened by environmental destruction.","collocation[4]":"forest/rainforest destruction","example[8]":"a Brazilian report on rainforest destruction","collocation[5]":"habitat destruction","example[9]":"Habitat destruction has reduced elephant herds in central Africa.","collocation[6]":"widespread destruction","example[10]":"The rains caused widespread destruction to crops.","collocation[7]":"great/massive destruction","example[11]":"Much of the city was rebuilt after the massive destruction of World War II.","collocation[8]":"ozone destruction","example[12]":"Ozone destruction is most severe over the Antarctic due to climatic and atmospheric extremes.","collocation[9]":"cause/lead to/bring about destruction","example[13]":"It's clear that the bomb was intended to cause death and destruction.","collocation[10]":"wreak destruction","example[14]":"The destruction wrought by the hurricane left thousands of people homeless.","example[15]":"The country is believed to have the potential to develop weapons of mass destruction.","collocation[11]":"a trail of destruction","example[16]":"The accident, involving five vehicles, caused a trail of destruction on the motorway."}