{"signpost[0]":"natural/artificial light","definition[0]":"the energy from the Sun, a flame, a lamp etc that allows you to see things","example[0]":"We saw a flash of light.","example[1]":"Everything looked grey in the dim light of the oil lamp.","note[0]":"in/by the light of something","example[2]":"I read by the light of the fire.","example[3]":"The man moved forward into the light.","note[1]":"in/into the light","definition[1]":"a particular type of light, with its own particular colour, level of brightness etc","example[4]":"The colours look different in different lights.","signpost[1]":"lamp/electric light etc","definition[2]":"something that produces light, especially electric light, to help you to see","example[5]":"Ahead of us we could see the lights of the city.","example[6]":"We’re having a mixture of wall lights and ceiling lights in different parts of the house.","example[7]":"Can you turn the light down (=make it less bright) a bit?","example[8]":"I switched on the light in the bedroom.","note[2]":"turn/switch/put on a light","example[9]":"Don’t forget to switch the lights off when you go out.","note[3]":"turn/switch/put off a light","example[10]":"Can you turn the light out downstairs?","note[4]":"turn/switch/put out a light","example[11]":"The lights in the office were still on.","note[5]":"a light is/comes/goes on","example[12]":"The street lights were just beginning to come on.","example[13]":"He left a light on in the kitchen.","example[14]":"Make sure all the lights are off when you leave.","note[6]":"a light is off/out","example[15]":"Suddenly all the lights in the house went out.","definition[3]":"something such as a lamp that you can carry to give you light","example[16]":"Shine a light over here, will you?","signpost[2]":"traffic control","definition[4]":"one of a set of red, green, and yellow lights used for controlling traffic","synonym[0]":"traffic lights","example[17]":"We waited for the lights to change.","example[18]":"Eventually the lights turned green.","example[19]":"The driver had failed to stop at a red light.","signpost[3]":"on a vehicle","definition[5]":"one of the lights on a car, bicycle etc that help you to see at night","example[20]":"He was dazzled by the lights of oncoming traffic.","example[21]":"You’ve left your lights on.","signpost[4]":"in somebody’s eyes","definition[6]":"an expression in someone’s eyes that shows an emotion or intention","synonym[1]":"gleam","example[22]":"There was a murderous light in his eyes.","signpost[5]":"window","definition[7]":"a window in a roof or wall that allows light into a room","form[0]":"ADJECTIVES/NOUN + light","collocation[0]":"bright/strong","example[23]":"The light was so bright he had to shut his eyes.","collocation[1]":"blinding/dazzling","example[24]":"The white buildings reflected a blinding light.","collocation[2]":"dim","example[25]":"Gradually her eyes became accustomed to the dim light.","example[26]":"Stand over here where the light is good.","collocation[3]":"poor/bad","example[27]":"The light was too poor for me to read.","collocation[4]":"soft/warm","example[28]":"the soft light of the candles","collocation[5]":"cold/harsh","example[29]":"the cold light of the moon","collocation[6]":"the morning/dawn light","example[30]":"The flowers glowed brightly in the morning light.","collocation[7]":"natural light","example[31]":"The only natural light came from two high windows.","collocation[8]":"artificial light","example[32]":"The office was windowless, lit only by artificial light.","collocation[9]":"light shines","example[33]":"The light from the streetlamp shone through the curtains.","collocation[10]":"light comes from somewhere","example[34]":"The only light came from the fire.","collocation[11]":"light streams/floods in","example[35]":"Light streamed in through the window.","collocation[12]":"light falls on/across etc something","example[36]":"The light fell on her book.","collocation[13]":"light illuminates something","example[37]":"The light from the screen illuminated the people gathered round it.","collocation[14]":"the light is fading","collocation[15]":"produce light","example[38]":"the light produced by the sun","collocation[16]":"cast light","example[39]":"the gold circle of light cast by the lamp","collocation[17]":"reflect light","example[40]":"Snow reflects a lot of light.","collocation[18]":"something is bathed in light","example[41]":"The fields and woods were bathed in golden light.","collocation[19]":"a beam/ray/shaft of light","example[42]":"There was a shaft of light from the doorway.","collocation[20]":"a flash of light","example[43]":"A flash of light caught his attention.","collocation[21]":"a pool/circle of light","example[44]":"They stood in the pool of light cast by the streetlamp.","example[45]":"She switched the kitchen light on.","example[46]":"The lights in the house were all off.","display[0]":"lamp","definition[8]":"an object that produces light by using electricity, oil, or gas – often used in names of lights","example[47]":"a bedside lamp","example[48]":"a street lamp","example[49]":"a desk lamp","example[50]":"a table lamp","example[51]":"an old oil lamp","example[52]":"a paraffin lamp","display[1]":"lantern","definition[9]":"a lamp that you can carry, consisting of a metal container with glass sides that surrounds a flame or light","example[53]":"The miners used lanterns which were lit by candles.","display[2]":"torch","definition[10]":"a small electric lamp that you carry in your hand","example[54]":"We shone our torches around the cavern.","display[3]":"candle","definition[11]":"a stick of wax with a string through the middle, which you burn to give light","example[55]":"The restaurant was lit by candles.","display[4]":"bulb","definition[12]":"the glass part of an electric light, that the light shines from","example[56]":"a 100 watt bulb","example[57]":"an energy-saving light bulb","heading[0]":"on a car","display[5]":"headlight","definition[13]":"one of the two large lights at the front of a vehicle","example[58]":"It was getting dark so she switched the headlights on.","display[6]":"sidelight","definition[14]":"one of the two small lights next to the main lights, at the front and back of a car","display[7]":"tail light","definition[15]":"one of the two red lights at the back of a vehicle","display[8]":"indicator","definition[16]":"one of the lights on a car that flash to show which way the car is turning","comparative[0]":"lighter","superlative[0]":"lightest","definition[17]":"a light colour is pale and not dark","example[59]":"You look nice in light colours.","example[60]":"I wanted a lighter yellow paint for the walls.","example[61]":"She had blue eyes and light brown hair.","note[7]":"light blue/green/grey etc","signpost[6]":"rooms","definition[18]":"a room that is light has plenty of light in it, especially from the sun","example[62]":"The kitchen was light and spacious.","example[63]":"The office was a big light room at the back of the house.","signpost[7]":"not heavy","definition[19]":"not very heavy","example[64]":"You can carry this bag – it’s fairly light.","example[65]":"You should wear light, comfortable shoes.","example[66]":"The truck was quite light and easy to drive.","example[67]":"She was as light as a feather (=very light) to carry.","signpost[8]":"not great","definition[20]":"if something is light, there is not very much of it or it is not very great","example[68]":"Traffic is lighter before 8 a.m.","example[69]":"A light rain began to fall.","example[70]":"She was wearing only light make-up.","example[71]":"people who have suffered only light exposure to radiation","definition[21]":"light clothes are thin and not very warm","example[72]":"She took a light sweater in case the evening was cool.","example[73]":"a light summer coat","definition[22]":"a light wind is blowing without much force","example[74]":"Leaves were blowing about in the light wind.","example[75]":"There was a light easterly breeze.","definition[23]":"a light sound is very quiet","opposite[0]":"loud","example[76]":"There was a light tap at the door.","example[77]":"Her voice was light and pleasant.","definition[24]":"a light touch is gentle and soft","example[78]":"She gave him a light kiss on the cheek.","example[79]":"He felt a light tap on his shoulder.","signpost[9]":"work/exercise","definition[25]":"light work is not hard or tiring","example[80]":"I found him some light work to do.","example[81]":"She only has a few light duties around the house.","example[82]":"The doctor has advised me to take regular light exercise.","definition[26]":"food or drink that is light either does not have a strong taste or does not make you feel full very quickly, for example because it does not contain very much fat, sugar, or alcohol","example[83]":"We had a light white wine with the fish.","example[84]":"a light, refreshing dessert","example[85]":"a new light cheese spread with virtually no fat","definition[27]":"a light meal is a small meal","example[86]":"I had a light lunch in town.","example[87]":"a delicious light snack","definition[28]":"food that is light contains a lot of air","example[88]":"a type of light, sweet bread","example[89]":"Beat the mixture until it is light and fluffy.","signpost[10]":"punishment","definition[29]":"a light punishment is not very severe","example[90]":"a fairly light sentence","signpost[11]":"not serious","definition[30]":"not serious in meaning, style, or manner, and only intended to entertain people","example[91]":"His speech gradually became lighter in tone.","example[92]":"an evening of light music","example[93]":"It’s a really good book if you want a bit of light reading.","example[94]":"The show looks at some of the lighter moments from the world of politics.","signpost[12]":"soil","definition[31]":"light soil is easy to break into small pieces","example[95]":"Carrots grow well in light soils.","past_tense[0]":"lit","definition[32]":"to start to burn, or to make something start to burn","example[96]":"He stopped to light a cigarette.","example[97]":"I lit the fire and poured a drink.","example[98]":"I couldn’t get the candles to light.","definition[33]":"to provide light for a place","example[99]":"The porch is always well lit at night.","example[100]":"The kitchen was warm and brightly lit.","example[101]":"a poorly lit car park","example[102]":"The room was lit by one large, central light.","note[8]":"be lit by/with something","explanation[0]":"Light is usually passive in this meaning","definition[34]":"light equipment, materials, machines etc are easily moved and used for fairly small tasks","example[103]":"thelight aircraft company, Cessna","example[104]":"The empty space will be converted for light industrial use.","definition[35]":"when buying and selling of shares etc is light, very little business is being done on a financial market","example[105]":"Stocks fell for an eighth day in light trading.","definition[36]":"if someone in authority uses a light touch, they trust the people or organizations they are in charge of and often let them make their own decisions","example[106]":"He ruled his staff with a light touch.","definition[37]":"if you see something in a particular light, you think about it in a particular way","example[107]":"As long as the customer perceives the price and the product in a positive light, the extra price will be viable.","example[108]":"As rates rise in the money markets, equities may be seen in a less favourable light.","definition[38]":"if something is decided in the light of something else, it is decided after taking that thing into consideration","example[109]":"Companies need to be satisfied that the contract is suitable in the light of their circumstances and financial position.","definition[39]":"to approve a project, plan etc so that it can begin","example[110]":"The removal of investment controls gave the green light to financial institutions to invest in property."}