{"word[0]":"thing","signpost[0]":"idea/action/feeling/fact","definition[0]":"an idea, action, feeling, or fact that someone thinks, does, says, or talks about, or that happens","example[0]":"People say things they don’t mean when they are angry.","example[1]":"It was a horrible thing to happen.","example[2]":"I plan to do all the things I’ve been meaning to do for ages.","example[3]":"The first thing to do is to give them food and shelter.","example[4]":"That’s a terrible thing to say.","example[5]":"Getting more American ideas into British business would be a good thing.","example[6]":"‘I did no such thing, ’ he protested.","example[7]":"I know a thing or two (=a lot) about dogs.","example[8]":"In a democracy, it is no bad thing to be able to compromise  (=it is good, even though it may not seem good).","example[9]":"I kept wondering if I was doing the right thing.","note[0]":"do the right/decent/honourable etc thing","example[10]":"A priest has to arrange funerals, marriages, that sort of thing.","note[1]":"this/that/what sort of thing","definition[1]":"an object that you are talking about without saying its name, or whose name you do not know","example[11]":"What’s that red thing?","example[12]":"I’ll just switch this thing off.","example[13]":"There was a round metal thing on the path.","example[14]":"The shed is where we keep our tools and things.","note[2]":"... and things","signpost[1]":"nothing","definition[2]":"used as part of a negative statement to mean ‘anything’","example[15]":"There’s no such thing as ghosts  (=they do not exist).","example[16]":"I couldn’t find a thing that I wanted to buy.","note[3]":"not a thing","example[17]":"He took his glasses off and couldn’t see a thing.","example[18]":"Don’t worry about a thing.","signpost[2]":"person/animal","definition[3]":"used to talk to or about a person or animal, when you are describing what they are like or showing sympathy for them","example[19]":"The baby is a nice little thing when he’s not screaming.","example[20]":"She was terribly upset, poor thing.","signpost[3]":"make a comment","definition[4]":"used to say something about a particular part of a situation, person etc","example[21]":"It’s a good thing  you saw her before she saw you.","example[22]":"The funny thing is, I really enjoyed it, even though I hadn’t expected to.","note[4]":"the funny/strange/best etc thing","example[23]":"The thing about teaching is that it takes more time to prepare than most people realize.","note[5]":"thing about","heading[0]":"– Meaning 3:","collocation[0]":"things go well/badly etc","example[24]":"If things went well, we would double our money in five years.","example[25]":"How did things go?","collocation[1]":"things change","example[26]":"Things have changed dramatically over the last few years.","collocation[2]":"things improve","example[27]":"Things appear to be improving.","collocation[3]":"things get worse","example[28]":"As the recession proceeds, things will get worse.","collocation[4]":"make things worse/easier/difficult","example[29]":"Measures to slow down traffic on the main street have actually made things worse.","collocation[5]":"as things stand","example[30]":"As things stand at the moment, I have no intention of becoming a candidate myself.","collocation[6]":"as things turned out","example[31]":"Obviously, there had to be some mistake. As things turned out, there was.","collocation[7]":"the way things are","example[32]":"I’m not at all dissatisfied with the way things are at the moment.","definition[5]":"used when you do not need to say the name, or when you do not know the name","example[33]":"What’s that thing on the kitchen table?","example[34]":"Have you got all your things?","display[0]":"something","definition[6]":"a thing – used when you are not sure what the thing is","example[35]":"There’s something on your shirt.","definition[7]":"a solid thing","example[36]":"a sharp metal object","display[1]":"item","definition[8]":"a particular kind of thing, or one of a group of things","example[37]":"household items","example[38]":"a luxury item","example[39]":"an item of equipment","example[40]":"The items included pieces of old pottery.","example[41]":"You are not allowed to take sharp items onto the plane.","display[2]":"article","definition[9]":"a particular kind of thing, or one of a group of things. Article is very formal, and is used especially in the phrase an article of clothing","example[42]":"They found several articles of clothing in the bushes.","example[43]":"suspicious articles","example[44]":"Each article has a card with it giving more information.","display[3]":"artifact","definition[10]":"an object that someone has made, especially one that is very old and has historical value","example[45]":"The museum has a collection of early Roman artifacts.","display[4]":"thingy","definition[11]":"a thing – used especially when you cannot remember the name of the thing, but often the other person knows what you are talking about","example[46]":"Can you pass me the thingy?"}