{"word[0]":"follow something ↔ up","definition[0]":"to find out more information about something and take action if necessary","example[0]":"The police take people’s statements and then follow them up.","definition[1]":"to do something in addition to what you have already done in order to make it more likely to succeed","example[1]":"This experiment was quickly followed up by others using different forms of the drug.","example[2]":"If there is no response to your press release, follow it up with a phone call.","definition[2]":"something that is done to make sure that earlier actions have been successful or effective","example[3]":"preventative treatment and follow-up several weeks later","definition[3]":"a book, film, article etc that comes after another one that has the same subject or characters","example[4]":"Spielberg says he’s planning to do a follow-up next year.","example[5]":"a follow-up to their hit album","note[0]":"follow-up to","definition[4]":"done in order to find out more or do more about something","example[6]":"a follow-up study on children and poverty","definition[5]":"to do something as a result of something someone has suggested or something you have found out","example[7]":"Many of the report’s recommendations are worth following up.","definition[6]":"a follow-up letter, visit etc is done to make sure that earlier actions have been effective or successful, or to continue a plan of action that was started earlier","example[8]":"By lunchtime, I usually know how many follow-up letters, informational packets, and other documents that I need to send out to clients.","example[9]":"Follow-up interviews have indicated that the advertising campaign was widely misunderstood.","definition[7]":"something that is done to make sure that earlier actions have been effective or successful, or to continue a plan of action that was started earlier","example[10]":"Ask one of the sales reps if we have sent a follow-up yet.","example[11]":"I know that the email was flagged for follow-up."}