{"definition[0]":"a group of people who have been trained to do military work for a government or other organization","example[0]":"He strengthened US forces in the Gulf.","example[1]":"a plan to disarm the rebel forces (=those fighting against the government)","example[2]":"The riots were suppressed by government forces.","note[0]":"government/military/defence etc forces","definition[1]":"the army, navy, and air force","example[3]":"Both her sons are in the forces.","note[1]":"in the forces","definition[2]":"nuclear weapons or ordinary weapons","example[4]":"short-range nuclear forces","signpost[0]":"military action","definition[3]":"military action used as a way of achieving your aims","example[5]":"Peace cannot be imposed by force.","example[6]":"The UN will allow the use of force against aircraft violating the zone.","signpost[1]":"violence","definition[4]":"violent physical action used to get what you want","example[7]":"The police used force to overpower the demonstrators.","example[8]":"They kicked the door down using sheer brute force.","example[9]":"In the end he had to be thrown out of the house by force.","note[2]":"by force","signpost[2]":"physical power","definition[5]":"the amount of physical power with which something moves or hits another thing","example[10]":"He raised his hand and struck her with terrifying force.","note[3]":"with great/considerable/increasing etc force","example[11]":"The force of the explosion blew out all the windows.","note[4]":"force of","signpost[3]":"natural power","definition[6]":"a natural power or event","example[12]":"the force of gravity","example[13]":"powerful natural forces such as earthquakes, floods, and drought","example[14]":"the forces of nature","signpost[4]":"organized group","definition[7]":"a group of people who have been trained and organized to do a particular job","example[15]":"the company’s sales force","example[16]":"the quality of the teaching force","signpost[5]":"strong influence","definition[8]":"something or someone who is powerful and has a lot of influence on the way things happen","example[17]":"He’s a quick and decisive player – a force to be reckoned with (=a person, team, company etc that influences what happens).","example[18]":"The fall in prices was due to forces beyond their control.","example[19]":"Betty Coward was the driving force behind the project.","note[5]":"the driving force (behind something/somebody)","example[20]":"Healthy competition is a force for innovation.","note[6]":"a force for change/peace/democracy etc","signpost[6]":"powerful effect","definition[9]":"the powerful effect that something has on you","example[21]":"Even after 30 years, the play has lost none of its force.","example[22]":"the force of his personality","definition[10]":"a unit for measuring the strength of the wind","definition[11]":"extremely strong wind that does a lot of damage","form[0]":"ADJECTIVES/NOUN + forces","collocation[0]":"the armed forces","example[23]":"Israel refused to withdraw its armed forces from the area.","collocation[1]":"American/British/French etc forces","example[24]":"Several battles took place involving American forces.","collocation[2]":"government forces","example[25]":"Government forces reportedly shot dead 300 unarmed civilians.","collocation[3]":"security forces","example[26]":"The government claimed that the security forces had destroyed the rebels’ headquarters.","collocation[4]":"rebel forces","example[27]":"The village was attacked by rebel forces.","collocation[5]":"military forces","example[28]":"He served with the military forces during the war.","collocation[6]":"a defence force","example[29]":"Should the European Union have its own defence force?","collocation[7]":"enemy forces","example[30]":"Enemy forces now occupy substantial areas of the city.","collocation[8]":"a peacekeeping force","example[31]":"A large UN peacekeeping force is being assembled.","collocation[9]":"special forces","example[32]":"Special forces were employed to support the local army.","collocation[10]":"be in the forces","example[33]":"Her husband is in the forces.","collocation[11]":"join the forces","example[34]":"He was too young to join the forces when the war broke out.","collocation[12]":"withdraw your forces","example[35]":"Expecting the Allies to attack again, he began to withdraw his forces eastward.","signpost[7]":"make somebody do something","definition[12]":"to make someone do something they do not want to do","example[36]":"Government troops have forced the rebels to surrender.","note[7]":"force somebody to do something","example[37]":"Due to the high cost of borrowing, many companies have been forced to close.","example[38]":"I had to force myself to get up this morning.","note[8]":"force yourself to do something","example[39]":"women who are forced into arranged marriages","note[9]":"force somebody/something into (doing) something","example[40]":"Bad health forced him into taking early retirement.","signpost[8]":"make somebody/something move","definition[13]":"to make someone or something move in a particular direction or into a different position, especially through or using great strength","example[41]":"Strong winds forced the ship off course.","example[42]":"Firemen tried to enter the building, but were forced back by the flames.","example[43]":"She tried to keep the door shut but the man forced it open.","signpost[9]":"make something happen","definition[14]":"to make something happen or change, especially more quickly than planned or expected","example[44]":"the unfortunate events that forced his resignation","example[45]":"We need to force the pace on alternative energy policies.","example[46]":"The effect will be to increase unemployment and force down wages.","note[10]":"force prices/interest rates etc down/up","explanation[0]":"You force someone to do something","example[47]":"The robbers forced him to hand over the money","explanation[1]":"Force is often used in the passive","example[48]":"The minister was forced to resign because of the scandal","explanation[2]":"You make someone do something","example[49]":"The robbers made him hand over the money","bad_example[0]":"make someone to do something","display[0]":"compel ","explanation[3]":"You compel someone to do something","example[50]":"The court can compel witnesses to give evidence","explanation[4]":"Compel is very often used in the passive","example[51]":"He became seriously ill and was compelled to retire two years later","display[1]":"oblige","explanation[5]":"You say that someone is obliged to do something Oblige is almost always used in the passive","example[52]":"Hotels are obliged by law to install smoke alarms","definition[15]":"to make someone do something they do not want to do. Used when people or situations make you do something","example[53]":"They were beaten and forced to confess to crimes they had not committed.","example[54]":"The drought forced millions of farmers to sell their cattle.","definition[16]":"to force someone to do something by using pressure, threats, or violence. Make somebody do something  is more common than force somebody to do something in everyday English","example[55]":"Her parents disapproved of Alex and they made her stop seeing him.","example[56]":"Two men with guns made the staff hand over the money.","display[2]":"pressure","definition[17]":"to try to force someone to do something by making them feel that they should do it","example[57]":"Some employers pressure their staff into working very long hours.","example[58]":"She felt they were trying to pressurize her into getting married.","display[3]":"blackmail","definition[18]":"to force someone to give you money or do what you want by threatening to tell embarrassing secrets about them","example[59]":"She tried to blackmail him with photographs of them together at the hotel.","display[4]":"compel","definition[19]":"to force someone to do something using official power or authority. Also used when someone has to do something because of their situation","example[60]":"The town was surrounded and compelled to surrender.","example[61]":"I felt compelled to offer them some kind of explanation.","example[62]":"You are compelled by law to carry an ID card.","display[5]":"coerce","definition[20]":"to force someone to do something by threatening them","example[63]":"Local people were coerced into joining the rebel army.","display[6]":"be obliged to do something","definition[21]":"if someone is obliged to do something, they must do it because it is the law or the rule, or because of the situation they are in","example[64]":"You are not obliged to say anything which may harm your defence in court.","example[65]":"They were obliged to sell the land.","definition[22]":"a group of people who have been trained and organized for a particular purpose","example[66]":"Our division has expanded its sales force (=the people in a company who sell the company’s products) to 160.","definition[23]":"if a law or rule is in force, it exists and must be obeyed","example[67]":"These regulations have been in force since 1997.","example[68]":"New EU directivescome into force (=start to operate) in April.","definition[24]":"something or someone that has a strong influence on an activity or the way events develop","example[69]":"She is the driving force (=person or thing that has the strongest influence on the way things happen) behind the group’s creation.","example[70]":"The group is certainly a force to be reckoned with (=has a lot of power and influence) in the publishing industry.","definition[25]":"the way that the behaviour of buyers and sellers affects the levels of SUPPLY AND DEMAND in a particular market, especially when the government does nothing to change this","example[71]":"By ending the electricity monopoly, market forces rather than state utilities will set prices.","example[72]":"Whether there is enough demand to sustain all of the car manufacturers is a question we will have toleave to market forces (=allow market forces to take effect so that the market works in the most efficient way).","definition[26]":"influence or authority","example[73]":"The City’s code of practice does not have the force of law.  (=the same authority as the law)","definition[27]":"if a situation forces you to do something, it makes you do it, even though you do not want to","example[74]":"Massive debts have forced them to close the store.","example[75]":"We were forced to raise prices because of increased costs.","definition[28]":"to make something happen against the wishes of the people who are affected","example[76]":"The imposition of VAT would force the closure of 20% of regional newspapers.","example[77]":"fears of a forced takeover"}