{"signpost[0]":"agree and help","definition[0]":"to say that you agree with an idea, group, or person, and usually to help them because you want them to succeed","example[0]":"The bill was supported by a large majority in the Senate.","example[1]":"We strongly support the peace process.","example[2]":"We need to support our teachers in their efforts to raise standards.","note[0]":"support somebody in (doing) something","signpost[1]":"be kind to somebody","definition[1]":"to help someone by being sympathetic and kind to them during a difficult time in their life","example[3]":"My wife supported me enormously.","signpost[2]":"provide money to live","definition[2]":"to provide enough money for someone to pay for all the things they need","example[4]":"I have a wife and two children to support.","example[5]":"She supports her family by teaching evening classes.","note[1]":"support somebody by (doing) something","example[6]":"I have no idea how I am going to support myself.","note[2]":"support yourself","signpost[3]":"give money to something","definition[3]":"to give money to a group, organization, or event etc to encourage it or pay for its costs","example[7]":"There are a handful of charities which I support regularly.","signpost[4]":"hold something up","definition[4]":"to hold the weight of something, keep it in place, or prevent it from falling","example[8]":"The middle part of the bridge is supported by two huge towers.","example[9]":"During sleep, our spine no longer needs to support the weight of our body.","example[10]":"I got to my feet, supporting myself on the side of the table.","note[3]":"support yourself (on something)","signpost[5]":"prove something","definition[5]":"if results, facts, studies etc support an idea or statement, they show or prove that it is correct","example[11]":"The results support our original theory.","example[12]":"There is little evidence to support such explanations.","signpost[6]":"sports team","definition[6]":"to like a particular sports team and go to watch the games they play","example[13]":"Which team do you support?","example[14]":"I’ve supported Liverpool all my life.","definition[7]":"to provide information and material to improve a computer program or system, or to make it keep working","example[15]":"I don’t think they support that version of the program anymore.","definition[8]":"if land can support people or animals, it is of good enough quality to grow enough food for them to live","example[16]":"This land can’t support many cattle.","signpost[7]":"water/air/earth","definition[9]":"if water, air, or earth can support life, it is clean enough, has enough oxygen etc to keep animals or plants alive","example[17]":"Because of pollution, this lake is now too acid to support fish.","example[18]":"healthy soil that can support plant life","heading[0]":"to agree with and help somebody/something","definition[10]":"to say that you agree with a person or idea, and usually help them because you want them to succeed","example[19]":"We will support your decision.","example[20]":"Thanks to everyone who supported us throughout the trial.","example[21]":"The tsunami appeal was supported by thousands of people.","definition[11]":"to support a person or plan by providing money or practical help – used about governments or other powerful groups","example[22]":"The £100 million scheme is backed by the British government.","example[23]":"The people backing him do not have the interests of the club at heart.","display[0]":"endorse","definition[12]":"to formally and officially say that you support a person, plan, or idea","example[24]":"Agriculture ministers refused to endorse the Commission's proposals.","display[1]":"get behind somebody/something","definition[13]":"to support a person or plan and help them be successful – used especially about a group of people","example[25]":"The England fans really got behind the team.","example[26]":"I really believe in this initiative, but it was hard to find business people who were willing to get behind it.","example[27]":"The police can't do anything unless the public gets behind them.","display[2]":"stand up for somebody/something","definition[14]":"to say that you support someone or something when they are being attacked","example[28]":"You were the only person who stood up for me at the meeting.","example[29]":"He stood up for what he believed in.","display[3]":"side with somebody","definition[15]":"to support one of the people or groups involved in an argument – used especially when you disapprove of this or think it is unfair","example[30]":"I felt she was siding with her mother rather than standing up for me.","example[31]":"The jury often side with the defendant in these situations.","heading[1]":"to stop something from falling","definition[16]":"to hold the weight of something and stop it from falling","example[32]":"The branch was too weak to support his weight.","example[33]":"The ceiling was supported by huge stone columns.","example[34]":"Her body was so weak that she had to be supported by two nurses.","display[4]":"hold up","example[35]":"These poles hold up the outer part of the tent.","example[36]":"His trousers were held up by an old piece of string.","display[5]":"prop up","definition[17]":"to stop something from falling by putting something against it or under it","example[37]":"The builders have propped up the walls with steel beams.","display[6]":"carry","definition[18]":"to support the weight of someone or something – used about something supporting several people, vehicles etc","example[38]":"The bridge could only carry up to two cars at a time.","example[39]":"The lift can carry up to 12 people.","definition[19]":"to be strong enough to support the weight of someone or something","example[40]":"Are you sure the branch will hold both of us?","example[41]":"She prayed that the roof would hold her weight as she crawled along it.","display[7]":"bear","definition[20]":"to hold the weight of something","example[42]":"The truck did not look strong enough to bear the weight of all those people.","example[43]":"a load-bearing wall","display[8]":"take somebody's/something's weight","example[44]":"His damaged leg would not take his weight.","example[45]":"Any large mirrors should have additional support to take their weight.","example[46]":"Make sure you choose a pole that will take the weight of your curtains.","signpost[8]":"approval","definition[21]":"approval, encouragement, and perhaps help for a person, idea, plan etc","example[47]":"Local people have given us a lot of support in our campaign.","example[48]":"There was widespread support for the war.","note[4]":"support for","example[49]":"They signed a petition in support of the pay claim.","note[5]":"in support","example[50]":"He had the full support of the general committee.","note[6]":"support of","signpost[9]":"sympathy/help","definition[22]":"sympathy and help that you give to someone who is in a difficult situation or who is very unhappy","example[51]":"I couldn’t have made it through those times without the support of my boyfriend Rob.","definition[23]":"money that you give a person, group, organization etc to help pay for their costs","example[52]":"The European Union is considering whether to provide financial support for the expedition.","example[53]":"With your support, we can help these youngsters.","note[7]":"with somebody’s support","signpost[10]":"holding something up","definition[24]":"something that presses on something else to hold it up or in position","example[54]":"The roof may need extra support.","example[55]":"the wooden supports of the bridge","example[56]":"She grabbed at his shoulders for support.","note[8]":"for support","signpost[11]":"proof","definition[25]":"facts that show that an idea or statement is correct","example[57]":"My own research provides some support for this view. ","definition[26]":"the help or information that you receive to improve a computer system, make it continue working, or use it correctly","example[58]":"our technical support team","signpost[12]":"concert/performance","definition[27]":"a band, singer, or performer that performs for a short time at the same concert as a more famous and popular band etc","example[59]":"We played support to a band called Shallow.","example[60]":"the support band","example[61]":"the support act (=the support band)","signpost[13]":"soldiers","definition[28]":"help or protection that is given by one group of soldiers to another group who are fighting in a battle","note[9]":"air/ground support (=help or protection that comes from people in aircraft or people on the ground)","example[62]":"logistical support","signpost[14]":"for part of body","definition[29]":"something that you wear to hold a weak or damaged part of your body in the right place","note[10]":"back/neck/knee etc support","collocation[0]":"have support","example[63]":"The extreme right-wing parties don’t have much popular support.","collocation[1]":"give (your) support","example[64]":"The American people gave him their enthusiastic support.","example[65]":"The naturalist Sir David Attenborough has lent his support to the campaign.","collocation[2]":"pledge/offer (your) support","example[66]":"Both the opposition parties pledged full support for the new administration.","collocation[3]":"get/draw support","example[67]":"The plan drew wide support from parents.","collocation[4]":"win/gain/attract support","example[68]":"Try to win the support of local shopkeepers.","collocation[5]":"enjoy/command support","example[69]":"His views were too extreme to command general support.","collocation[6]":"drum up/rally support","example[70]":"Both sides have been drumming up support through the internet.","collocation[7]":"enlist somebody’s support","example[71]":"He wrote to the prime minister in an attempt to enlist his support.","collocation[8]":"mobilize support","example[72]":"Part of their mission was to mobilize popular support for Franco.","collocation[9]":"build (up) support","example[73]":"Now he needs to build his support by explaining what he believes in.","collocation[10]":"withdraw support","example[74]":"He's decided to withdraw his support for the project.","collocation[11]":"public/popular support","example[75]":"There seemed to be no popular support for war.","collocation[12]":"widespread/wide/general support","example[76]":"There is widespread support for the Government’s proposal.","collocation[13]":"strong support","example[77]":"A survey found strong support for the project among hospital staff.","collocation[14]":"massive support","example[78]":"We have massive public support.","collocation[15]":"somebody’s full support","example[79]":"That view deserves the full support of all farmers.","collocation[16]":"whole-hearted/enthusiastic support","example[80]":"I want you to know that you have my whole-hearted support.","collocation[17]":"active support","example[81]":"Les, with the active support of his wife Pam, has spent several years compiling a list of the prisoners.","collocation[18]":"unanimous support","example[82]":"There was nearly unanimous support for the proposal.","definition[30]":"to provide enough money for something to begin or continue","example[83]":"Community funds will be available to support the plan.","definition[31]":"to show you agree with a person or group of people, or their ideas, plans etc","example[84]":"10 countries indicated they would support a suspension of production quotas.","example[85]":"Most lawmakersstrongly support governmentalpolicy.","example[86]":"Sony issued a statement supporting the chief executive.","definition[32]":"to help a system continue to work properly","example[87]":"The company will provide equipment tosupport the complex electronicssystems.","example[88]":"A Group of Seven move to support the dollar had been disappointing.","definition[33]":"to show or prove that something is true or correct","example[89]":"We’ve got a good, solid defense case supported by clinical research.","example[90]":"Many economists believe the economic recovery will be slow, and yesterday’sdata supported that view.","definition[34]":"money or other help given to someone or something","example[91]":"The young entrepreneur had approached the bank several times forfinancial support.","example[92]":"Developing countries will requiretechnical support.","definition[35]":"approval and encouragement for a person or group of people, or their ideas, plans etc","example[93]":"The striking workers have key support from their labor unions.","example[94]":"The rate cut foundwidespread support within Japan.","example[95]":"Shareholders believe there is adequatesupport for theproposal.","note[11]":"support for something","example[96]":"Many financial services companies are lobbying in support of the new laws.","note[12]":"in support of something"}