{"word[0]":"senior","definition[0]":"having a higher position, level, or rank","example[0]":"the senior Democrat on the House committee","example[1]":"White men hold most of the jobs in senior management.","example[2]":"the senior partner in a law firm","example[3]":"He is also a diplomat, but senior to me.","note[0]":"senior to","definition[1]":"a senior competition is for older people or for people at a more advanced level","example[4]":"I won the 60-metre race, my first senior success.","collocation[0]":"senior management","example[5]":"Within the week senior management approved her proposal.","collocation[1]":"senior staff","example[6]":"Some senior staff criticized the headteacher's behaviour.","collocation[2]":"a senior manager","example[7]":"She's now a senior manager for a large toy company.","collocation[3]":"a senior executive","example[8]":"All the company's senior executives get large bonuses.","collocation[4]":"a senior official","example[9]":"a meeting of senior government officials","collocation[5]":"a senior officer","example[10]":"Inspector Wild is the senior officer in charge of the investigation.","collocation[6]":"a senior partner","example[11]":"He was a senior partner in a prestigious Canadian law firm.","collocation[7]":"a senior member","example[12]":"The president announced a reshuffle involving several senior members of his Cabinet.","definition[2]":"a student in their last year of high school or university","example[13]":"Jen will be a senior this year.","definition[3]":"a senior citizen","example[14]":"Seniors can get a 10% discount.","definition[4]":"an adult or a person who has reached an advanced level in a particular sport","example[15]":"Juniors and seniors train together on Wednesdays.","definition[5]":"used after the name of a man who has the same name as his son","example[16]":"John J. Wallace, Sr.","definition[6]":"used after a man’s name to show that he is the older of two men with the same name and from the same family","example[17]":"John Walker, Snr.","definition[7]":"having a high position in an organization, company etc","example[18]":"a panel ofsenior corporateexecutives","example[19]":"He has held severalsenior management positions.","example[20]":"Previously, he had been a senior partner (=the more important person in a business partnership) in a law firm.","example[21]":"Staff senior to the area supervisor play an active part in shaping the standards to be set.","definition[8]":"senior lenders, SHAREHOLDERs etc have to be paid before other lenders etc if the borrower gets into financial difficulty","example[22]":"Only after senior creditors were paid in full would ordinary shareholders get some cash.","example[23]":"The group has agreed a plan with its senior lenders to restructure its credit facilities.","definition[9]":"a company’s senior shares, bonds etc are considered to be more valuable because investors owning them will be paid before those owning ordinary shares, bonds etc. Those with senior shares etc will also be paid a larger percentage of what they are owed if the company gets into financial difficulty","example[24]":"Half of the purchase price was paid in cash and the balance insenior stock.","definition[10]":"someone who has a higher rank than others in an organization or profession","example[25]":"He found it difficult to interest his seniors in the venture."}