{"word[0]":"root","definition[0]":"the part of a plant or tree that grows under the ground and gets water from the soil","example[0]":"tree roots","example[1]":"These plants produce a number of thin roots.","signpost[0]":"cause of a problem","definition[1]":"the main cause of a problem","example[2]":"The love of money is the root of all evil.","example[3]":"A competent mechanic should be able to get to the root of the problem (=find out the cause of a problem).","example[4]":"the root causes of crime","example[5]":"Allergies are at the root of a lot of health problems.","note[0]":"be/lie at the root of something","signpost[1]":"origin/main part","definition[2]":"the origin or main part of something such as a custom, law, activity etc, from which other things have developed","example[6]":"Jazz has its roots in the folk songs of the southern states of the US.","example[7]":"the liberal economic policies which lie at the root of American power","example[8]":"a legal system with roots in English common law","note[1]":"root in","signpost[2]":"tooth/hair etc","definition[3]":"the part of a tooth, hair etc that connects it to the rest of your body","example[9]":"She’d pulled some of Kelly’s hair out by the roots.","definition[4]":"the basic part of a word which shows its main meaning, to which other parts can be added. For example, the word ‘coldness’ is formed from the root ‘cold’ and the suffix ‘ness’.","definition[5]":"a number that, when multiplied by itself a certain number of times, equals the number that you have","example[10]":"2 is the fourth root of 16.","definition[6]":"to grow roots","example[11]":"New shrubs will root easily in summer.","definition[7]":"if a plant is rooted somewhere, it is held in the ground firmly by its roots","example[12]":"a bush firmly rooted in the hard ground","example[13]":"Clumps of thyme had rooted themselves between the rocks.","note[2]":"root itself","definition[8]":"to search for something by moving things around","synonym[0]":"rummage","example[14]":"Leila rooted through her handbag for a pen.","note[3]":"root through/in/amongst something (for something)","type[0]":"intransitive usually + adverb/preposition","signpost[3]":"pigs","definition[9]":"if a pig roots somewhere, it looks for food under the ground","example[15]":"pigs rooting for truffles","note[4]":"root for"}