{"word[0]":"guide","signpost[0]":"for deciding/judging","definition[0]":"something that provides information and helps you to form an opinion or make a decision","example[0]":"The polls are not a reliable guide of how people will vote.","example[1]":"The figures are only a rough guide.","definition[1]":"someone whose job is to take tourists to a place and show them around","example[2]":"a tour guide","example[3]":"an experienced mountain guide","definition[2]":"someone who advises you and influences the way you live","example[4]":"my spiritual guide","signpost[1]":"instructions","definition[3]":"a book or piece of writing that provides information on a particular subject or explains how to do something","example[5]":"Follow our step-by-step guide.","example[6]":"Details of how to use the various programs are in the user guide.","example[7]":"a guide to North American birds","note[0]":"guide to","definition[4]":"a guidebook","signpost[2]":"girl","definition[5]":"the Guides Association, which teaches girls practical skills","definition[6]":"a member of the Guides Association","definition[7]":"to take someone to a place","synonym[0]":"lead","example[8]":"He guided us through the narrow streets to the central mosque.","note[1]":"guide somebody along/through etc","definition[8]":"to help someone or something to move in a particular direction","example[9]":"He guided her firmly towards the sofa.","note[2]":"guide somebody/something into/towards etc","example[10]":"Searchlights were used to guide the ship into the harbour.","definition[9]":"to influence someone’s behaviour or ideas","example[11]":"Teenagers need adults to guide them.","definition[10]":"to show someone the right way to do something, especially something difficult or complicated","example[12]":"Guide your students through the program one section at a time.","note[3]":"guide somebody through something","definition[11]":"something that provides you with information, figures etc on which you can base your judgement or method of doing something","example[13]":"The key US and foreign annual interest rates below are a guide to general levels but don’t always represent actual transactions.","definition[12]":"a book that provides information on a particular subject or explains how to do something","example[14]":"the latest version of the company guide","definition[13]":"someone whose job is to show a place to people visiting it","example[15]":"Sandra, who liked traveling, started a new career in her forties as a professional tour guide.","example[16]":"The Justice Department issued regulations to guide businesses on how to deal with their customers under the new laws.","definition[14]":"to take someone through or to a place that you know very well, showing them the way","example[17]":"On the tour, we were personally guided through five of the rooms in the White House."}