{"word[0]":"clock","definition[0]":"an instrument that shows what time it is, in a room or outside on a building","example[0]":"I heard the clock strike six (=make six loud sounds).","example[1]":"The station clock was ten minutes slow (=showed a time ten minutes earlier than the real time).","example[2]":"What time is it by the kitchen clock?","note[0]":"by the hall/kitchen/church etc clock","collocation[0]":"look/glance at the clock","example[3]":"She looked at the clock. It was eight thirty.","collocation[1]":"the clock says eight/nine etc","example[4]":"The clock said five so I went back to sleep.","collocation[2]":"a clock strikes eight/nine etc","example[5]":"In the distance I heard a church clock strike eleven.","collocation[3]":"a clock ticks","example[6]":"There was no sound in the room apart from a clock ticking.","collocation[4]":"a clock is fast/slow","example[7]":"There’s no need to hurry – that clock’s fast.","collocation[5]":"a clock stops","example[8]":"My clock had stopped at 6 am so the alarm didn’t work.","collocation[6]":"an alarm clock goes off","example[9]":"What time do you want the alarm clock to go off tomorrow?","collocation[7]":"set a clock","example[10]":"Don’t forget to set your clocks to summer time.","collocation[8]":"wind (up) a clock","example[11]":"It was one of those old clocks that you have to wind up.","collocation[9]":"the hands of/on a clock","example[12]":"The hands on the clock said ten past two.","collocation[10]":"the face of a clock/the clock face","example[13]":"I couldn’t see the clock face from where I was sitting.","form[0]":"ADJECTIVES/NOUN + clock","collocation[11]":"the kitchen/sitting-room etc clock","example[14]":"Harry glanced at the kitchen clock and saw that he was late.","collocation[12]":"an alarm clock","example[15]":"He forgot to set his alarm clock.","collocation[13]":"a wall clock","example[16]":"A loud ticking came from the wall clock.","collocation[14]":"a grandfather clock","example[17]":"Where did you get that beautiful grandfather clock?","collocation[15]":"a digital clock","example[18]":"A digital clock at the finish line shows runners their times.","collocation[16]":"a travel/travelling clock","collocation[17]":"a cuckoo clock","collocation[18]":"a church clock","collocation[19]":"a carriage clock","definition[1]":"to cover a distance in a particular time, or to reach a particular speed in a race","example[19]":"Karen won in the 300 metres, clocking 42.9 seconds.","example[20]":"the first steam engine to clock 100 miles an hour","definition[2]":"to measure or record the time or speed that someone or something is travelling at","example[21]":"The police clocked him doing between 100 and 110 miles per hour.","note[1]":"clock somebody at/doing something","definition[3]":"to notice someone or something, or to look at them carefully","example[22]":"Did you clock the bloke by the door?","definition[4]":"to reduce the number of miles or kilometres shown on the instrument in a car that says how far it has gone, in order to sell the car for more money","example[23]":"He knew the car had been clocked, but he couldn’t prove it."}