{"word[0]":"intense","definition[0]":"having a very strong effect or felt very strongly","example[0]":"Young people today are under intense pressure to succeed.","example[1]":"the intense heat of the desert","example[2]":"The pain was so intense I couldn’t sleep.","example[3]":"He took an intense interest in all religious matters.","example[4]":"a look of intense dislike","definition[1]":"intense activity is very serious, uses a lot of effort, and often involves doing a great deal in a very short time","example[5]":"The job demands intense concentration.","example[6]":"At least 3,000 people were killed in a week of intense fighting.","definition[2]":"someone who is intense is serious and has very strong feelings or opinions – used to show disapproval","example[7]":"She’s a little too intense for me.","collocation[0]":"intense pressure","example[8]":"The prime minister is under intense pressure to call a general election.","collocation[1]":"intense competition","example[9]":"There is intense competition for places on the course.","collocation[2]":"intense heat","example[10]":"He could feel the intense heat of the Egyptian sun.","collocation[3]":"intense cold","example[11]":"He was shivering with intense cold.","collocation[4]":"intense pain","example[12]":"She felt an intense pain in her right shoulder.","collocation[5]":"intense pleasure","example[13]":"Anne read the letter with intense pleasure.","collocation[6]":"an intense desire","example[14]":"Fred felt an intense desire to punch Max in the face.","collocation[7]":"an intense interest in something","example[15]":"The police are aware of the intense interest in the case.","collocation[8]":"intense dislike","example[16]":"He had taken an intense dislike to Robert.","collocation[9]":"intense activity","example[17]":"The opening of the restaurant was preceded by a period of intense activity.","collocation[10]":"intense debate","example[18]":"Abortion has become the subject of intense debate.","collocation[11]":"intense negotiations","example[19]":"The hostages were freed after intense negotiations.","collocation[12]":"intense scrutiny","example[20]":"The mining industry is coming under intense scrutiny over its environmental record.","collocation[13]":"intense speculation","example[21]":"After weeks of intense speculation, the actress announced that she was pregnant.","collocation[14]":"intense opposition","example[22]":"Locals have voiced intense opposition to plans to expand the airport.","collocation[15]":"intense feelings/emotion","example[23]":"Her lips trembled with intense emotion."}