{"word[0]":"natural","signpost[0]":"nature","definition[0]":"existing in nature and not caused, made, or controlled by people","example[0]":"the study of the natural world  (=trees, rivers, animals, plants etc)","example[1]":"an area of spectacular natural beauty","example[2]":"natural disasters  (=things such as floods or earthquakes)","example[3]":"death from natural causes","example[4]":"the need for natural light in offices","definition[1]":"normal and as you would expect","opposite[0]":"unnatural","example[5]":"At the time, accepting his offer had seemed the most natural thing in the world.","example[6]":"It’s only natural that he should be interested in what happens.","example[7]":"It was a perfectly natural  (=not surprising) mistake to make.","example[8]":"It’s not natural for a child of his age to be so quiet.","note[0]":"it is natural (for somebody) to do something","definition[2]":"a natural tendency or type of behaviour is part of your character when you are born, rather than one that you learn later","example[9]":"Babies have a natural fear of falling.","signpost[1]":"ability","definition[3]":"having a particular quality or skill without needing to be taught and without needing to try hard","example[10]":"a natural musician","example[11]":"Cheryl has a natural elegance about her.","example[12]":"his natural ability with figures","definition[4]":"behaving in a way that is normal and shows you are relaxed and not trying to pretend","example[13]":"Be cool, be natural.","signpost[2]":"parent/child","definition[5]":"someone’s natural parent or child is their real parent or child, who is biologically related to them","example[14]":"An adopted young person has the right to trace his natural parents.","definition[6]":"if someone is the natural child of someone, their parents were not married to each other","example[15]":"He was rumoured to be the natural son of a duke.","definition[7]":"not connected with gods, magic, or spirits","opposite[1]":"supernatural","example[16]":"I’m sure there’s a perfectly natural explanation.","definition[8]":"with nothing added to change the taste","example[17]":"natural yoghurt","definition[9]":"a musical note that is natural has been raised from a flat by one semitone or lowered from a sharp by one semitone","example[18]":"a natural lake","example[19]":"natural light","example[20]":"the Earth's natural resources","example[21]":"We only use natural ingredients in our products.","example[22]":"his natural hair colour","display[0]":"wild","definition[10]":"used about flowers, plants, and animals that are not controlled by people. Also used about areas of land where there are no humans","example[23]":"We found some wild strawberries.","example[24]":"wild horses","example[25]":"wild open spaces","display[1]":"pure","definition[11]":"used about food, drink, or materials that have not had anything added to them","example[26]":"pure orange juice","example[27]":"pure new wool","display[2]":"organic","definition[12]":"used about fruit, vegetables, meat etc produced without using chemicals","example[28]":"organic carrots","example[29]":"organic milk","example[30]":"organic beauty products","display[3]":"unspoiled","definition[13]":"a place that is unspoiled is still beautiful because no one has built roads or buildings on it","example[31]":"It was a pleasant unspoilt village.","example[32]":"The countryside is remarkably unspoiled.","display[4]":"untouched","definition[14]":"a place that is untouched has not been affected by human activity","example[33]":"There are few forested areas of the world that remain untouched by humans.","display[5]":"virgin","definition[15]":"virgin forest or land is still in its natural state and has not been spoiled or changed in any way by humans","example[34]":"Large areas of virgin rainforest will be protected from destruction.","example[35]":"He bought 14,000 acres of virgin land in Ontario.","definition[16]":"a musical note that has been changed from a flat to be a semitone higher, or from a sharp to be a semitone lower","definition[17]":"the sign in written music that shows this kind of musical note","definition[18]":"not caused, made, or controlled by human beings","example[36]":"A series of natural disasters created huge losses for the insurance market.","example[37]":"All our hair-care products are made from natural ingredients.","definition[19]":"happening as a normal part of a process or situation","example[38]":"There is a natural career progression through the police force.","example[39]":"The company termed the organizational changes a ‘natural evolution’ of its global business."}