{"word[0]":"legend","definition[0]":"an old well-known story, often about brave people, adventures, or magical events","example[0]":"a book of ancient Greek legends","example[1]":"Local legend has it that  (=says that) the island was the original Garden of Eden. ","example[2]":"the legend of St George and the dragon","note[0]":"legend of","example[3]":"According to legend, he escaped by leaping from the cliffs into the sea.","note[1]":"according to legend","definition[1]":"someone who is famous and admired for being extremely good at doing something","example[4]":"a marvellous player who was a legend in his own lifetime","example[5]":"We must put more money into the sport if we want to create the tennis legends of the future.","note[2]":"tennis/footballing/music etc legend","definition[2]":"words that have been written somewhere, for example on a sign","example[6]":"A sign above the door bore the legend ‘Patience is a Virtue’.","definition[3]":"the words that explain a picture or map","collocation[0]":"an old/ancient legend","example[7]":"You will have heard the old legend about how the rocks were formed.","collocation[1]":"a local legend","example[8]":"According to a local legend, the tree was planted by a wizard.","collocation[2]":"a popular legend","example[9]":"A popular legend grew up about him.","collocation[3]":"a Greek/Roman/Celtic etc legend","example[10]":"the figure of Hercules in Greek legend","collocation[4]":"Arthurian legend(s)","example[11]":"The castle of Camelot plays an important role in Arthurian legend.","collocation[5]":"become legend/pass into legend","example[12]":"The incident became legend.","collocation[6]":"a legend grew (up)","example[13]":"The legend of his bravery grew after he killed the dragon.","collocation[7]":"(the) legend says","example[14]":"Legend says King Arthur’s sword was thrown into one of the pools here.","collocation[8]":"the legend tells how","example[15]":"The legend tells how the King of Troy offended Poseidon, the sea god.","collocation[9]":"the legend goes","example[16]":"Two people, so the legend goes, refused to flee.","collocation[10]":"a legend is attached to something","example[17]":"The cave has an unusual legend attached to it.","collocation[11]":"legend has it that","example[18]":"Legend has it that Rhodes was home to the sun god Helios.","collocation[12]":"be the subject of legend","example[19]":"The island has long been the subject of legend.","collocation[13]":"myths and legends","example[20]":"I read and reread the Greek myths and legends.","definition[4]":"very good – used especially by young people","example[21]":"This song is absolutely legend!"}