{"word[0]":"opposition","definition[0]":"strong disagreement with, or protest against, something such as a plan, law, or system","example[0]":"He is confident in his ability to overcome all opposition with his personal charm.","example[1]":"The proposals have aroused the opposition of teachers.","example[2]":"Strong opposition resulted in rejection of the bill.","example[3]":"Plans to turn the site into a £600 million leisure complex have met with stiff opposition.","example[4]":"Much public opposition to the new law remained.","example[5]":"Workers found themselves in opposition to local interests.","example[6]":"There was a great deal of opposition to the war.","note[0]":"opposition to","example[7]":"They face opposition from local residents as well as from environmentalists.","note[1]":"opposition from","definition[1]":"the people who you are competing against","example[8]":"They played well against good opposition.","explanation[0]":"In this meaning, opposition is usually followed by a singular verb","example[9]":"The opposition was too strong for us","example[10]":"The opposition were too strong for us","definition[2]":"when two things are completely opposite","example[11]":"the opposition between capitalism and socialism","note[2]":"opposition between","collocation[0]":"strong opposition","example[12]":"The scheme has met with strong opposition from local people.","collocation[1]":"fierce/intense/stiff opposition","example[13]":"It is certain that there will be fierce opposition to the changes.","collocation[2]":"violent/vehement opposition","example[14]":"The 2,000-strong congress met the violent opposition of left-wingers.","example[15]":"There has been vehement opposition from the fishing industry.","collocation[3]":"considerable opposition","example[16]":"The development went ahead in spite of considerable opposition.","collocation[4]":"growing/mounting opposition","example[17]":"There was growing opposition to the war.","collocation[5]":"local opposition","example[18]":"It took three years to overcome local opposition from environmentalists.","collocation[6]":"widespread opposition","example[19]":"Journalists have reported widespread opposition to the regime.","collocation[7]":"public opposition","example[20]":"Public opposition has blocked the building of nuclear power stations.","collocation[8]":"organized opposition","example[21]":"The proposal was passed with no organized opposition.","collocation[9]":"face opposition","example[22]":"The proposal faced opposition from road safety campaigners.","collocation[10]":"meet (with) opposition/run into opposition","example[23]":"A new tax would meet a lot of opposition.","example[24]":"The Bill ran into opposition in the House of Lords.","collocation[11]":"encounter opposition","example[25]":"The police encountered little opposition, and restored order within the hour.","collocation[12]":"express (your) opposition","example[26]":"Parents expressed their opposition to the tests.","collocation[13]":"overcome opposition","example[27]":"Nothing he said could overcome their opposition.","collocation[14]":"arouse opposition/arouse the opposition of somebody","example[28]":"A plan to build on farm land aroused local opposition.","collocation[15]":"opposition comes from somebody","example[29]":"The strongest opposition came from Republican voters.","definition[3]":"strong disagreement with or protest against something","example[30]":"Opposition to the proposed scheme was widespread.","example[31]":"The plan met with stiff opposition  (=strong opposition).","display[0]":"objection","definition[4]":"a reason you give for opposing an idea or plan","example[32]":"My main objection is that it will cost too much money.","example[33]":"A number of objections were raised.","display[1]":"antagonism","definition[5]":"a strong feeling of opposition to something, or dislike for someone, which is shown in your behaviour, and has often existed for a long time","example[34]":"his own antagonism to any form of authority","example[35]":"There is no antagonism towards tourists on the island.","example[36]":"people’s antagonism to communism","display[2]":"hostility","definition[6]":"angry remarks or behaviour that show someone opposes something very strongly, or dislikes someone very much","example[37]":"The announcement was greeted with hostility from some employees.","example[38]":"There is a certain amount of hostility towards the police among local people.","display[3]":"antipathy","definition[7]":"a strong feeling of opposition and dislike for someone or something","example[39]":"his fundamental antipathy to capitalism","example[40]":"Her long-standing antipathy to Herr Kohl was well-known.","example[41]":"Darwin shared Lyell's antipathy to the idea that the same species could appear independently in different areas."}