{"word[0]":"nervous","definition[0]":"worried or frightened about something, and unable to relax","example[0]":"I wish you’d stop looking at me like that. You’re making me nervous.","example[1]":"By the time I got into the interview I was a nervous wreck (=was extremely nervous).","example[2]":"Paul always gets nervous whenever he has to give a presentation.","note[0]":"feel/get nervous","example[3]":"‘Don’t be silly, ’ she said with a nervous laugh. ‘There’s no such thing as ghosts.’","note[1]":"nervous smile/laugh/look/glance","example[4]":"She was so nervous about her exams that she couldn’t sleep.","note[2]":"nervous about something","example[5]":"We were all a bit nervous of him at first  (=frightened of him).","note[3]":"nervous of somebody","definition[1]":"often becoming worried or frightened, and easily upset","example[6]":"She’s a nervous, sensitive child.","example[7]":"The film is unsuitable for people of a nervous disposition (=who are easily frightened).","definition[2]":"relating to the nerves in your body","example[8]":"He had a nervous twitch (=his body made small uncontrolled movements).","example[9]":"She was suffering from a nervous condition.","note[4]":"nervous condition/illness/disorder","collocation[0]":"feel nervous","example[10]":"He looked at her for so long that she began to feel nervous.","collocation[1]":"get/become nervous","example[11]":"Everyone gets nervous before a big game.","collocation[2]":"seem/appear nervous","example[12]":"She seemed nervous at first, but her presentation was good.","collocation[3]":"look/sound nervous","example[13]":"He sounded nervous and uncertain.","collocation[4]":"make somebody nervous","example[14]":"Being alone in the house made her nervous.","collocation[5]":"slightly nervous","example[15]":"Looking slightly nervous, Paul began to speak.","collocation[6]":"a little/a bit nervous","example[16]":"I was a little nervous before the interview.","collocation[7]":"extremely nervous","example[17]":"The policeman noticed that the driver seemed extremely nervous.","collocation[8]":"a nervous smile/laugh/giggle","example[18]":"‘It doesn’t matter, ’ she said, with a nervous smile.","collocation[9]":"nervous laughter","example[19]":"His comment was met with nervous laughter.","collocation[10]":"a nervous look/glance","example[20]":"Lucy swallowed as she sent him a nervous glance.","collocation[11]":"nervous tension","example[21]":"It was the play’s opening night, and Gloria was in a state of nervous tension.","collocation[12]":"be a nervous wreck","example[22]":"By the end of the rehearsal I was a nervous wreck.","definition[3]":"worried or a little frightened about something and unable to relax","example[23]":"Kelly was so nervous about her exam that she couldn’t sleep.","example[24]":"It makes me nervous when you drive that fast.","display[0]":"tense","definition[4]":"worried and unable to relax in a way that makes you get angry or upset easily","example[25]":"Mary’s problems at work were making her tense and irritable.","display[1]":"uneasy","definition[5]":"nervous because you feel that something bad might happen, so that you are unable to relax until the danger has passed","example[26]":"I began to feel uneasy when he still hadn’t phoned by 11 o'clock.","display[2]":"on edge","definition[6]":"if you are on edge or your nerves are on edge, you feel nervous because you are worried about what might happen","example[27]":"My nerves were on edge, waiting for the results of the test.","example[28]":"Redundancies and other work upheavals have put employees on edge.","display[3]":"neurotic","definition[7]":"nervous and anxious in a way that is not normal or reasonable","example[29]":"She’s completely neurotic about food hygiene.","example[30]":"a neurotic mother","display[4]":"edgy/jumpy/jittery","definition[8]":"nervous because you are worried about what might happen","example[31]":"Investors are a little edgy about the financial markets these days.","example[32]":"There was a lot of pressure on the team tonight and that’s why they were a little jumpy.","display[5]":"highly-strung","definition[9]":"becoming nervous or upset easily because that is your character","example[33]":"Like many musicians, he’s very sensitive and highly-strung.","definition[10]":"to feel extremely nervous and unable to relax","example[34]":"After 10 months of teaching, I was a total nervous wreck.","display[6]":"have butterflies (in your stomach)","definition[11]":"to feel nervous about something that you are going to do very soon because it is important and you want to do it well","example[35]":"Actors often have butterflies before going on stage."}