{"word[0]":"hang","past_tense[0]":"hung","signpost[0]":"top part fastened","definition[0]":"to put something in a position so that the top part is fixed or supported, and the bottom part is free to move and does not touch the ground","example[0]":"Philip hung his coat on a hook behind the door.","example[1]":"She hung the sheets on the washing line.","definition[1]":"to be in a position where the top part is fixed or supported, and the bottom part is free to move and does not touch the ground","example[2]":"An old-fashioned gas lamp hung from the ceiling.","example[3]":"Her long hair hung loose about her shoulders.","example[4]":"The shirt hung down almost to his ankles.","signpost[1]":"picture etc","definition[2]":"to fix a picture, photograph etc to a wall","example[5]":"I wanted to hang the picture in the hall.","definition[3]":"if a picture, photograph etc is hanging somewhere, it is fixed to a wall","example[6]":"There was a family photograph hanging on the wall.","definition[4]":"if the walls of a room are hung with pictures or decorations, the pictures etc are on the walls","example[7]":"The entrance hall was hung with rich tapestries.","signpost[2]":"kill/be killed","definition[5]":"to kill someone by dropping them with a rope around their neck, or to die in this way, especially as a punishment for a serious crime","example[8]":"If he is found guilty, he will almost certainly hang.","example[9]":"He was hanged for murder.","note[0]":"be hanged for something","example[10]":"Corey hanged himself in his prison cell.","note[1]":"hang yourself","definition[6]":"to fasten attractive paper to a wall in order to decorate a room","example[11]":"We spent the afternoon hanging wallpaper.","signpost[3]":"door","definition[7]":"to fasten a door in position","example[12]":"Hanging a door is quite a tricky job.","type[0]":"intransitive + adverb/preposition","signpost[4]":"mist/smoke/smell","definition[8]":"if something such as smoke hangs in the air, it stays in the air for a long time","example[13]":"The smoke from the bonfires hung in the air.","example[14]":"A thick mist hung over the town.","definition[9]":"to spend time somewhere, relaxing and enjoying yourself","example[15]":"We were just hanging with the dudes at Mike’s house.","note[2]":"hang with"}