{"word[0]":"together","signpost[0]":"with each other","definition[0]":"if two or more people do something together, they do it with each other","example[0]":"We’ve very much enjoyed working together.","example[1]":"They’ve decided to spend more time together.","example[2]":"He and my father were at school together.","example[3]":"Together they went back inside the villa.","signpost[1]":"make one thing","definition[1]":"if you put two or more things together, you join them so that they touch or form one whole thing or group","opposite[0]":"apart","example[4]":"He’d tried to glue the broken pieces together.","example[5]":"Mix the butter and sugar together.","example[6]":"She clasped her hands together.","example[7]":"He took the engine apart and then put it back together again.","example[8]":"The model was held together with string.","signpost[2]":"be a couple","definition[2]":"if two people are together, they are married, or are having a romantic or sexual relationship","example[9]":"Mark and I have been together eight years now.","example[10]":"Are those two together?","example[11]":"A lot of people live together before getting married.","example[12]":"Sometimes I don’t know what keeps us together.","signpost[3]":"in one place","definition[3]":"if you keep, collect etc things together, you keep or collect them all in one place","example[13]":"She keeps all the important documents together in one file.","example[14]":"Embarrassed, she gathered her things together and left.","example[15]":"Goods of a similar kind should be stored together.","signpost[4]":"against each other","definition[4]":"if you rub or hit things together, you rub or hit them against each other","example[16]":"Max was rubbing his hands together with glee.","example[17]":"Knock the brushes together to clean them.","signpost[5]":"in agreement","definition[5]":"if people are together, come together etc, they are or become united, especially in order to try and achieve something","example[18]":"Together we can win.","example[19]":"The Conference called on all good men to come together to resist socialism.","example[20]":"He said that the main purpose of the Baha'i faith was to bring people together.","signpost[6]":"at the same time","example[21]":"Both letters should have arrived. I mailed them together.","example[22]":"‘Oh!’ they said together.","example[23]":"Right men. All together now ... push!","note[0]":"all together (now)","signpost[7]":"combine amounts","definition[6]":"when two amounts or quantities are added together, they are combined","example[24]":"Add these numbers together and then divide the total by 7.","example[25]":"Together they won only 21% of the votes.","example[26]":"The table and chairs are together worth about £200.","definition[7]":"someone who is together is confident, thinks clearly, and does things in a sensible organized way – used to show approval","example[27]":"Jane is such a together person."}