{"word[0]":"excited","definition[0]":"happy, interested, or hopeful because something good has happened or will happen","example[0]":"Steve flies home tomorrow – we’re all really excited.","example[1]":"The food was nothing to get excited about (=not very good or special).","example[2]":"excited crowds of shoppers","example[3]":"Maria’s starting to get pretty excited about the wedding.","note[0]":"excited about","example[4]":"We’re all excited by the prospect of a party.","note[1]":"excited by/at","example[5]":"Michelle sounded excited to hear from him.","note[2]":"excited to do something","example[6]":"I’m so excited that we’re going to New York.","note[3]":"excited (that)","definition[1]":"very nervous and upset about something so that you cannot relax","example[7]":"There’s no point getting excited about it. We can’t change things.","definition[2]":"feeling sexual desire","definition[3]":"feeling happy, especially about something good that has happened or is going to happen","example[8]":"He’s excited about his new job.","example[9]":"The kids always get excited on their birthday.","example[10]":"An excited crowd watched their team win 3–0.","example[11]":"When we get home, the dogs are always excited to see us.","example[12]":"Doctors are very excited by the discovery.","display[0]":"thrilled","definition[4]":"very excited and pleased","example[13]":"She was thrilled to hear that you were in London.","example[14]":"I was thrilled when they told me that I’d got a place on the course.","display[1]":"exhilarated","definition[5]":"very excited and full of energy, especially because you are experiencing something new or something that involves risks","example[15]":"She felt exhilarated by her new freedom.","example[16]":"The climb left him feeling exhilarated.","display[2]":"look forward to something","definition[6]":"to feel excited about something good that is going to happen and to think about it a lot","example[17]":"The kids are looking forward to their vacation – they’ve never been to California before.","example[18]":"She’s really looking forward to meeting him.","display[3]":"can’t wait to do something","definition[7]":"to be very excited about something good that is going to happen","example[19]":"I can’t wait to see him again.","display[4]":"on the edge of your seat","definition[8]":"extremely excited and interested when you are watching a film, game etc, because you do not know what is going to happen next","example[20]":"I was on the edge of my seat throughout the movie.","example[21]":"The game kept fans on the edge of their seats.","display[5]":"on tenterhooks","definition[9]":"very excited and nervous because you are waiting to find out what has happened","example[22]":"Don’t keep us on tenterhooks! Did you pass your test?","display[6]":"rapturous","definition[10]":"rapturous behaviour shows that a large group of people are extremely excited and pleased","example[23]":"They received a rapturous welcome.","example[24]":"He came on the stage to rapturous applause (=everyone was clapping and cheering)."}