{"word[0]":"bored","definition[0]":"tired and impatient because you do not think something is interesting, or because you have nothing to do","note[0]":"bored stiff/to tears/to death/out of your mind (=extremely bored)","example[0]":"He was easily bored.","example[1]":"After a while, I got bored and left.","example[2]":"Are you bored with your present job?","note[1]":"bored with","collocation[0]":"get bored","example[3]":"I get bored if I’m at home on my own all day.","collocation[1]":"grow bored","example[4]":"She grew bored and started gazing out of the window.","collocation[2]":"look/sound/feel bored","example[5]":"Some of the students were starting to look bored.","collocation[3]":"easily bored","example[6]":"Teenagers are easily bored in the holidays.","collocation[4]":"be bored to tears/to death","example[7]":"Rob was bored to tears trailing around the shops.","collocation[5]":"be bored stiff/silly/rigid","example[8]":"Patti was bored stiff with small-town Massachusetts life.","collocation[6]":"be bored out of your mind","example[9]":"In some of the lessons, I was bored out of my mind.","definition[1]":"feeling that you are not interested in something or that you have nothing interesting to do","example[10]":"Julia soon got bored with lying on the beach.","example[11]":"I'm bored. Can we go home now?","display[0]":"fed up","definition[2]":"feeling very bored and annoyed or unhappy – used especially when something has continued for too long, and you do not want it to continue any longer","example[12]":"He got fed up with his old job and decided to start looking for a new one.","example[13]":"I’m fed up with listening to you complain!","example[14]":"You sound a bit fed up. Is everything alright?","display[1]":"be tired of somebody/something","definition[3]":"to feel very annoyed and bored with something that has continued for too long. Be sick of somebody/something sounds stronger and more annoyed than be tired of somebody/something","example[15]":"People are tired of hearing politicians make promises that they never keep.","example[16]":"Do it yourself – I’m sick of cleaning up after you!","display[2]":"have had enough","definition[4]":"to be so bored with something that has continued for a long time that you decide to leave, do something different, or change the situation","example[17]":"She put up with him for ten years before she finally decided that she had had enough.","example[18]":"I've had enough of all this moaning! Can we try and be more positive?","heading[0]":"USAGE: Bored or boring?","explanation[0]":"You use bored about a person who is not interested in something","example[19]":"I'm bored!","explanation[1]":"You use boring about something that makes you feel bored","example[20]":"a boring film"}