{"word[0]":"present","definition[0]":"in a particular place","opposite[0]":"absent","example[0]":"Foreign observers were present at the elections.","note[0]":"present at/in","example[1]":"the gases present in the Earth’s atmosphere","signpost[0]":"memory","definition[1]":"to be felt strongly or remembered for a long time","example[2]":"The memory of her brother’s death is still present in her mind.","note[1]":"present in","definition[2]":"happening or existing now","example[3]":"the present situation of the millions of people who are suffering poverty and disease","example[4]":"At the present time we have no explanation for this.","example[5]":"The present situation could get much worse.","example[6]":"the present century","example[7]":"There are no plans to build more houses here at the present time.","display[0]":"current","definition[3]":"present – used especially about something that is not expected to stay the same for long","example[8]":"current trends in fashion","example[9]":"the current state of the UK economy","display[1]":"existing","definition[4]":"existing or being used now – used about things or situations that you think may be changed in the future","example[10]":"The existing offices are too small.","example[11]":"The proposal will strengthen existing immigration laws.","display[2]":"contemporary","definition[5]":"used about the art, writing, ideas, society etc that belong to the present time","example[12]":"the impact of computer-generated imagery on contemporary art and design","example[13]":"contemporary music in Russia","display[3]":"today’s/of today","definition[6]":"used about conditions and attitudes that exist now, when you are comparing them with those that existed in the past","example[14]":"People struggle to keep up with the pace of life in today’s world of instant communications.","example[15]":"the liberal ideology of today","definition[7]":"to give something to someone, for example at a formal or official occasion","example[16]":"He was presented with a bottle of champagne.","note[2]":"present somebody with something","example[17]":"She was presented with an award.","example[18]":"The computer centre presented a cheque for £500 to cancer research.","note[3]":"present something to somebody/something","signpost[1]":"cause something to happen","definition[8]":"to cause something to happen or exist","example[19]":"Large classes present great problems to many teachers.","note[4]":"present a problem/difficulty","example[20]":"I knew I had presented her with an impossible task.","signpost[2]":"description","definition[9]":"to show or describe someone or something","example[21]":"The artist was determined to present an accurate picture.","example[22]":"We’ll present the information using a chart.","example[23]":"Shakespeare presents the hero as a noble man doomed to make mistakes.","note[5]":"present somebody as something","example[24]":"The government presents itself as being sensitive to environmental issues.","note[6]":"present yourself as something","signpost[3]":"speech","definition[10]":"to give a speech in which you offer an idea, plan etc to be considered or accepted","example[25]":"Our manager is due to present the report at the end of the month.","example[26]":"On January 3 the company will present its plans to the bank.","note[7]":"present something to somebody","signpost[4]":"document/ticket","definition[11]":"to show something such as an official document or ticket to someone in an official position","example[27]":"You must present your passport to the customs officer.","signpost[5]":"theatre/cinema","definition[12]":"to give a performance in a theatre, cinema etc, or broadcast a programme on television or radio","example[28]":"Edinburgh Theatre Company presents ‘The Wind in the Willows’.","signpost[6]":"television/radio","definition[13]":"if you present a television or radio programme, you introduce its different parts","example[29]":"Thursday’s ‘The Late Show’ was presented by Cynthia Rose.","definition[14]":"to give something or someone a particular appearance or style","example[30]":"The restaurant likes to present food with style.","signpost[7]":"formally introduce somebody","definition[15]":"to formally introduce someone to another person, especially to someone of a very high rank","example[31]":"I was presented to the Queen in 1964.","definition[16]":"to show an illness by having a particular symptom (=sign of an illness)","example[32]":"The doctor asked whether any of the children had been presenting any unusual symptoms.","example[33]":"Three of the five patients presented with fever and severe headaches.","heading[0]":"– Meaning 2: to cause something to happen or exist","collocation[0]":"present a problem","example[34]":"These mountain roads present problems even to experienced drivers.","collocation[1]":"present difficulties","example[35]":"Juggling work and family responsibilities presents difficulties for women.","collocation[2]":"present a challenge","example[36]":"I'm enjoying my new job because it presents an interesting challenge.","collocation[3]":"present a threat","example[37]":"The disease presents a grave threat to the livestock industry.","collocation[4]":"present an obstacle","example[38]":"The lack of money presented a massive obstacle.","definition[17]":"something you give someone on a special occasion or to thank them for something","synonym[0]":"gift","example[39]":"I’m looking for a present for Mark.","collocation[5]":"give somebody a present","example[40]":"He gave everyone a present.","collocation[6]":"give something as a present","example[41]":"I was given this book as a present.","collocation[7]":"buy somebody a present","example[42]":"I want to buy a present for Lucy but I’m not sure what she’d like.","example[43]":"Did you get Bill a birthday present?","collocation[8]":"get a present","example[44]":"Children soon learn to enjoy giving presents as well as getting them.","collocation[9]":"wrap a present","example[45]":"She spent the afternoon wrapping Christmas presents.","collocation[10]":"open/unwrap a present","example[46]":"Can we open our presents now?","collocation[11]":"exchange presents","example[47]":"We always exchange Christmas and birthday presents.","form[0]":"ADJECTIVES/NOUN + present","collocation[12]":"a birthday present","example[48]":"Thanks for the birthday present.","collocation[13]":"a Christmas present","example[49]":"What would Dad like as a Christmas present?","collocation[14]":"a wedding present","example[50]":"His wedding present to her had been a diamond necklace.","definition[18]":"to make a speech introducing an idea, plan etc to be considered","example[51]":"a lack of evidence presented by prosecutors","example[52]":"The company has until July to restructure its debt and present an operating plan to its creditors.","definition[19]":"to produce a document, such as a ticket or pass, for an official to check","example[53]":"When a shopper presents a supermarket ID card, the purchases can be linked to his or her name and address.","example[54]":"To receive care, every patient will need to present a health insurance card to the hospital or doctor.","definition[20]":"if something presents an opportunity, advantage, problem etc, it creates it","example[55]":"With interest rates slightly above 8%, the securities present an attractive alternative to stocks.","example[56]":"Microsoft’s Windows presents the most formidable technical challenge ever to the Macintosh."}