{"word[0]":"list","definition[0]":"a set of names, numbers etc, usually written one below the other, for example so that you can remember or check them","example[0]":"Make a list of all the things you have to do.","note[0]":"list of","example[1]":"The first person on my list is Mrs Gilling.","note[1]":"on/in a list","collocation[0]":"make/draw up/write a list","example[2]":"Could you make a list of any supplies we need?","collocation[1]":"compile a list","example[3]":"They’ve compiled a list of children’s clubs and organizations.","collocation[2]":"put somebody/something on a list","example[4]":"I was put on a waiting list to see a specialist at the hospital.","collocation[3]":"top a list","example[5]":"The novel topped the best-seller list.","collocation[4]":"at the top/bottom of a list","example[6]":"Her name was at the top of the list of students.","collocation[5]":"first/last on a list","example[7]":"Your name will be first on my list.","example[8]":"Why am I always last on the list?","form[0]":"ADJECTIVES/NOUN + list","collocation[6]":"long/short","example[9]":"He read out a long list of errors.","collocation[7]":"a complete/full/comprehensive list","example[10]":"The full list of winners is on page seven.","collocation[8]":"a price list","example[11]":"We’ll send you a catalog and price list.","collocation[9]":"a shopping list","example[12]":"a Christmas shopping list","collocation[10]":"a grocery list","example[13]":"Did you put milk on the grocery list?","collocation[11]":"a wine list","example[14]":"a good wine list","collocation[12]":"a waiting list","example[15]":"If  you don’t get the class you want, you can put your name on a waiting list.","collocation[13]":"a mailing list","example[16]":"If you do not want to be on our mailing list, please tick the box below.","collocation[14]":"a guest list","example[17]":"the guest list for the wedding reception","collocation[15]":"a to-do list","example[18]":"Painting the bedroom is at the top of my to-do list.","collocation[16]":"a hit list","definition[1]":"a set of names, places, jobs you need to do etc, which are written one below the other","example[19]":"Henry’s name wasn’t on the list.","example[20]":"She made a list of the people she wanted to invite to the wedding.","example[21]":"Could I have a list of hotels in Bournemouth and the surrounding area?","example[22]":"I forgot to bring my shopping list with me.","display[0]":"checklist","definition[2]":"a list of things you need or things you have to do which you keep in order to help you remember them","example[23]":"Use a checklist when visiting properties to buy, so that you keep a record of which features you liked and didn’t like.","example[24]":"I made a checklist of things I needed to do before the holiday.","display[1]":"short list/shortlist","definition[3]":"a list of the most suitable people for a job or prize, chosen from a larger group of people","example[25]":"Her name is on the shortlist for the Booker Prize.","example[26]":"You were lucky to even get onto the shortlist.","example[27]":"A shortlist is drawn up, from which the successful candidate will be chosen.","display[2]":"register","definition[4]":"an official list containing the names of all the people, organizations, or things of a particular type","example[28]":"a register of qualified translators","example[29]":"a civil register of births, deaths, and marriages","example[30]":"Make sure your name is on the electoral register (=the official list of people who can vote).","display[3]":"programme","definition[5]":"a list of all the activities or events that have been planned, especially one that shows when each event will happen","example[31]":"First on the programme is a speech by the organizer, Mrs Jenkins.","example[32]":"A spectacular program of exhibitions, displays and competitions has been planned.","example[33]":"Because of bad weather, our programme of events has had to be changed slightly.","display[4]":"agenda","definition[6]":"a list of the subjects that will be discussed at a meeting","example[34]":"Have you got a copy of the agenda for tomorrow’s meeting?","example[35]":"the next item on the agenda","example[36]":"The fuel crisis will be at the top of the agenda for today’s board meeting.","display[5]":"index","definition[7]":"an alphabetical list of names and subjects at the back of a book, that shows which page they are mentioned on","example[37]":"It’s a lot quicker if you use the index.","example[38]":"I looked up his name in the index.","display[6]":"inventory","definition[8]":"a list of everything in a house, factory, or shop, written so that you know exactly what is there","example[39]":"Some of the things in the shop were not listed in the inventory.","example[40]":"The company keeps a full inventory of its equipment.","example[41]":"She made an inventory of everything in the apartment.","definition[9]":"to write a list, or mention things one after the other","example[42]":"The guidebook lists 1,000 hotels and restaurants.","definition[10]":"to put someone on an official list, especially a hospital or court list","example[43]":"The case was listed for trial in the Crown Court.","example[44]":"Several passengers were listed in critical condition.","note[2]":"list somebody in fair/stable etc condition","definition[11]":"if a ship lists, it leans to one side","definition[12]":"a set of items such as figures, names etc that belong to a particular group, written down one after the other","example[45]":"detailed lists of proposed prices","definition[13]":"to put items such as figures, names etc together in a group","example[46]":"The names and addresses of these bureaux are listed in Appendix I.","definition[14]":"to make stocks and shares officially available on a stockmarket","example[47]":"It plans to list 29% of its stock on the Tokyo Stock Exchange.","definition[15]":"if something is listed at a particular amount or lists for a particular amount, that is the price asked for it","example[48]":"The house had been listed at just under $4 million.","example[49]":"The basic model lists for $28,045."}