{"word[0]":"compensation","definition[0]":"money paid to someone because they have suffered injury or loss, or because something they own has been damaged","example[0]":"People who are wrongly arrested may be paid compensation.","example[1]":"The parents are seeking compensation for birth defects caused by the drug.","note[0]":"demand/seek/claim compensation","example[2]":"The court awarded Jamieson £30,000 compensation.","note[1]":"award/grant compensation","example[3]":"compensation for injuries at work","note[2]":"compensation for","example[4]":"She received compensation from the government for the damage caused to her property.","note[3]":"compensation from","example[5]":"The jury awarded Tyler $1.7 million in compensation.","note[4]":"in compensation","example[6]":"The workers were given 30 days’ pay as compensation.","note[5]":"as compensation","definition[1]":"something that makes a bad situation better","example[7]":"One of the few compensations of losing my job was seeing more of my family.","example[8]":"By way of compensation he offered to take her out for a meal.","note[6]":"by way of compensation","definition[2]":"when someone behaves in a particular way in order to replace something that is missing or to balance the bad effects of something","example[9]":"Linda’s aggressiveness is just a compensation for her feelings of insecurity.","example[10]":"Lip-reading can act as compensation for loss of hearing.","note[7]":"as compensation (for something)","definition[3]":"the money someone is paid for doing their job","synonym[0]":"remuneration","collocation[0]":"pay somebody compensation","example[11]":"Passengers will be paid compensation if their baggage is lost or damaged.","collocation[1]":"receive compensation","example[12]":"Some people have received compensation from the government for the loss of their homes.","collocation[2]":"be awarded compensation","example[13]":"Many victims have been awarded compensation by the courts.","collocation[3]":"claim compensation","example[14]":"You can claim compensation for unfair dismissal from your job.","collocation[4]":"seek compensation","example[15]":"Survivors of the rail disaster are seeking compensation.","collocation[5]":"demand compensation","example[16]":"Political prisoners are demanding financial compensation.","collocation[6]":"fight for compensation","example[17]":"Alan, who hurt his back and hasn't worked since, is still fighting for compensation.","collocation[7]":"offer compensation","example[18]":"The health authority offered compensation to the families.","collocation[8]":"financial compensation","example[19]":"You may wish to claim financial compensation.","collocation[9]":"full compensation","example[20]":"Full compensation is only paid very rarely.","collocation[10]":"partial compensation","example[21]":"The woman received partial compensation of £5,000.","form[0]":"compensation + NOUN","collocation[11]":"a compensation claim","example[22]":"He was seeking legal advice on a compensation claim.","collocation[12]":"a compensation payment","example[23]":"UK farmers may be in line for compensation payments.","collocation[13]":"a compensation scheme","example[24]":"There is a compensation scheme for radiation-linked diseases.","definition[4]":"an amount paid to someone because they have been hurt or harmed","example[25]":"Mr Lewis was awarded $75,000 compensation for injuries suffered in the accident.","example[26]":"The group will pay compensation to 800 people who have been made redundant.","definition[5]":"the total amount of money and other advantages that someone receives as an employee","example[27]":"Japanese workers get 30% of their compensation in vacation pay and bonuses.","example[28]":"The firm has agreed to a new compensation package for its chairman, including stock options worth $252 million."}