{"word[0]":"dishonest","definition[0]":"not honest, and so deceiving or cheating people","example[0]":"dishonest traders","example[1]":"People on welfare are wrongly seen as lazy or dishonest.","definition[1]":"behaving in a way that is intended to deceive people, for example by lying, cheating, or stealing","example[2]":"Are you accusing me of being dishonest?","example[3]":"The money was acquired through dishonest means.","example[4]":"People are no longer surprised to find that politicians are dishonest.","display[0]":"corrupt","definition[2]":"using your power in a dishonest way for your own advantage – used about people in official positions","example[5]":"corrupt politicians","example[6]":"Law and order has broken down, and most government officials are corrupt.","display[1]":"devious","definition[3]":"good at secretly thinking of clever plans to trick people in order to get what you want","example[7]":"You have a very devious mind!","example[8]":"They use all kinds of devious methods to find out your personal details.","display[2]":"underhand","definition[4]":"underhand methods involve secretly deceiving people in order to get what you want","example[9]":"In a series of underhand moves, Browne managed to gain control of the company.","display[3]":"sneaky","definition[5]":"doing or saying things secretly, in a way that seems wrong because it is slightly dishonest or unfair","example[10]":"It was pretty sneaky when the bank charged me interest on my account without telling me.","display[4]":"sly","definition[6]":"deliberately behaving in a way that hides what you are really thinking or doing, in a way that is slightly dishonest","example[11]":"Lucy decided not to tell him where she was going. She was often a bit sly like that.","example[12]":"He’s a sly old fox.","display[5]":"unscrupulous","definition[7]":"using dishonest and unfair methods to get what you want, without caring if you harm other people","example[13]":"Some unscrupulous companies try to persuade people to borrow huge sums of money.","display[6]":"fraudulent","definition[8]":"deliberately deceiving people in an illegal way in order to gain money or power","example[14]":"You will be prosecuted if you make a fraudulent claim on your insurance policy.","heading[0]":"seeming to be dishonest","display[7]":"suspicious","definition[9]":"if someone or something seems suspicious, they make you think that something dishonest or illegal is happening","example[15]":"The police are treating the boy’s death as suspicious.","display[8]":"dubious","definition[10]":"if something seems dubious, you think it may not be completely true, right, or honest","example[16]":"He has a rather dubious reputation.","example[17]":"It all sounds highly dubious to me.","example[18]":"the country’s dubious record on human rights","display[9]":"shady","definition[11]":"shady business deals or people seem to be dishonest or connected with secret and illegal activities","example[19]":"Several senior members of the party had been involved in shady deals.","example[20]":"a shady character","display[10]":"shifty","definition[12]":"someone who looks shifty looks as if they are doing or planning something dishonest","example[21]":"The man on the market stall looked a bit shifty when he gave me my change.","display[11]":"dodgy","definition[13]":"probably dishonest and not to be trusted – used especially to say that you do not want to be involved with someone or something","example[22]":"There’s something a bit dodgy about him.","example[23]":"dodgy business deals"}