{"word[0]":"boost","definition[0]":"to increase or improve something and make it more successful","example[0]":"The new resort area has boosted tourism.","example[1]":"The win boosted the team’s confidence.","note[0]":"boost somebody’s confidence/morale/ego","definition[1]":"to help someone reach a higher place by lifting or pushing them","example[2]":"He boosted her up.","definition[2]":"if a rocket or motor boosts a spacecraft, it makes it go up into space or go in a particular direction","definition[3]":"something that gives someone more confidence, or that helps something increase, improve, or become successful","example[3]":"Add a little more vanilla, to give the flavor a boost.","example[4]":"The community will get a boost from a new library and recreation center.","note[1]":"get/receive a boost","example[5]":"The poll provided a morale boost for the Conservatives.","note[2]":"morale/ego boost","example[6]":"a major boost to the economy","note[3]":"boost to","example[7]":"a multimillion-pound boost for the British film industry","note[4]":"boost for","definition[4]":"an increase in the amount of power available to a rocket, piece of electrical equipment etc","definition[5]":"to increase something such as production, sales, or prices","example[8]":"The advertising campaign is intended to boost sales.","example[9]":"Another cut in interest rates would boost stock prices.","example[10]":"800 jobs have been cut in an attempt to boost productivity.","definition[6]":"to make the economy stronger, so that business activity increases, prices and wages go up, and unemployment falls","example[11]":"The US Treasury ordered the Fed to lift the yen against the dollar in hopes of boosting the US economy before the November election.","definition[7]":"to increase confidence","example[12]":"The economy needs a positive jolt to boost consumer confidence.","definition[8]":"to advertise a product","example[13]":"a special promotion to boost their new product","definition[9]":"something that helps to increase something such as production, sales, or prices","example[14]":"That optimistic outlook gave stocks and the dollar a boost.","example[15]":"Sales could get a boost in January and February.","definition[10]":"something that helps something to improve or become more successful","example[16]":"The price of oil could soon be $15 a barrel or less, which would be a welcome boost to the American economy.","example[17]":"The sale of such a large nuclear power reactor is expected to give a boost to Canada’s nuclear industry.","example[18]":"The market got a boost on Friday when the Federal Reserve Board cut the interest rate that it charges member banks.","definition[11]":"something that helps to improve confidence or encourage people","example[19]":"The end of the war would almost certainly provide some sort of boost to business and consumer confidence."}