{"word[0]":"by","signpost[0]":"who/what does something","definition[0]":"used especially with a passive verb to say who or what does something or makes something happen","example[0]":"I was attacked by a dog.","example[1]":"a church designed by the famous architect, Sir Christopher Wren","example[2]":"We are all alarmed by the rise in violent crime.","example[3]":"interference by the state in the affairs of the Church","example[4]":"his appointment by the BBC as a producer","signpost[1]":"means/method","definition[1]":"used to say what means or method someone uses to do something","example[5]":"You can reserve the tickets by phone.","example[6]":"Send it by airmail.","example[7]":"Some customers prefer to pay by cheque.","example[8]":"He was taken from his home by force.","example[9]":"They travelled to Chicago by train.","note[0]":"by car/train/bus/taxi etc","example[10]":"All supplies are transported by air.","note[1]":"by air/sea/land/road/rail etc","example[11]":"She earns her living by selling insurance.","note[2]":"by doing something","signpost[2]":"road/door","definition[2]":"used to say which road, entrance, door etc someone uses to get to a place","example[12]":"They came in by the back door.","example[13]":"It’s quicker to go by the country route.","signpost[3]":"taking hold","definition[3]":"used to say which part of an object or of a person’s body someone takes hold of","example[14]":"He took Elaine by the arm and led her across the road.","example[15]":"She grabbed the hammer by the handle.","signpost[4]":"writer/composer etc","definition[4]":"used to give the name of someone who wrote a book, produced a film, wrote a piece of music etc","example[16]":"the ‘New World symphony’ by Dvorak","example[17]":"a short story by Charles Dickens","example[18]":"Who’s it by?","signpost[5]":"beside","definition[5]":"beside or near something","example[19]":"She stood by the window.","example[20]":"Jane went and sat by Patrick.","signpost[6]":"past","definition[6]":"past someone or something without stopping","example[21]":"He walked right by me without even saying hello.","example[22]":"I pass by the farm every day on my way to work.","definition[7]":"before or not later than a particular time","example[23]":"The documents need to be ready by next Friday.","example[24]":"I reckon the film should be over by 9.30.","example[25]":"By the end of the day we had sold over 2,000 tickets.","example[26]":"By the time we got home we were tired and hungry.","signpost[7]":"according to","definition[8]":"according to a particular rule, method, or way of doing things","example[27]":"You’ve got to play by the rules.","example[28]":"Profits were £6 million, but by our standards this is low.","signpost[8]":"change/difference","definition[9]":"used to say how great a change or difference is","example[29]":"The price of oil fell by a further $2 a barrel.","example[30]":"I was overcharged by £3.","example[31]":"Godard’s first film was better by far (=by a large amount or degree).","signpost[9]":"measurements","definition[10]":"used to give the measurements of a room, container etc","example[32]":"a room 15 metres by 23 metres","signpost[10]":"quantity","definition[11]":"used to show what unit of measurement or quantity is involved in selling, paying for, producing etc something","example[33]":"Eggs are sold by the dozen.","example[34]":"We’re paid by the hour.","example[35]":"She wanted to tear his hair out by the handful.","signpost[11]":"gradual change","definition[12]":"used to say that something happens gradually","example[36]":"Day by day, he grew weaker.","example[37]":"Little by little, I was beginning to discover the truth about Garfield.","example[38]":"One by one, the men stepped forward.","signpost[12]":"quick change","definition[13]":"used to say that something or someone is quickly becoming worse, better etc","example[39]":"The financial crisis was growing more serious by the hour.","definition[14]":"used to say that something happens in a particular kind of light","example[40]":"We walked through the palace gardens by moonlight.","signpost[13]":"job/nature etc","definition[15]":"used when you are giving information about someone’s character, job, origin etc","example[41]":"George I and George II were Germans by birth.","example[42]":"Cautious by nature, Simpkin was reluctant to interfere.","example[43]":"Robert Key was a teacher by profession.","signpost[14]":"visiting","definition[16]":"in order to visit a person or place for a short time","example[44]":"On the way, I stopped by the post office.","signpost[15]":"multiplying/dividing","definition[17]":"used between two numbers when talking about multiplying or dividing","example[45]":"What’s 48 divided by 4?","signpost[16]":"emphasis","definition[18]":"used when expressing strong feelings or making serious promises","example[46]":"By God, I’ll kill that boy when I see him!","signpost[17]":"father","definition[19]":"if a woman has children by a particular man, that man is the children’s father","example[47]":"She’s got two children by her previous husband.","heading[0]":"USAGE: By, with","explanation[0]":"By is used, especially after passive verbs, to say who or what does something","example[48]":" The article was written by a university professor","example[49]":"She was hit by a truck","explanation[1]":"With is used after verbs that describe a state rather than an action","example[50]":"The books were covered with dust","example[51]":"Her house is always filled with music ","bad_example[0]":"covered by dust","bad_example[1]":"filled by music","explanation[2]":"By is used to say what means or method someone uses to do something","example[52]":"He replied by email","explanation[3]":"With is used to say what tool is used to do something","example[53]":"Clean the surface thoroughly with a wire brush ","bad_example[2]":"by a wire brush","definition[20]":"past someone or something","example[54]":"As I was standing on the platform, the Liverpool train went whizzing by.","example[55]":"James walked by without even looking in my direction.","definition[21]":"used to say that time passes","example[56]":"As the summer days slipped by, it was easy to forget about the war.","example[57]":"Ten years had gone by since I had last seen Marilyn.","definition[22]":"beside or near someone or something","example[58]":"A crowd of people were standing by, waiting for an announcement.","example[59]":"Why don’t you stop by for a drink after work?","definition[23]":"less important","example[60]":"a by-product  (=something made in addition to the main product)","example[61]":"a by-election  (=one held between regular elections)"}