{"word[0]":"notion","definition[0]":"an idea, belief, or opinion","example[0]":"She had no notion what he meant.","example[1]":"They reject the notion of group guilt.","note[0]":"accept/challenge/reject etc a notion","example[2]":"misguided notions of male superiority","note[1]":"notion of","example[3]":"The traditional notion of marriage goes back thousands of years.","example[4]":"She had only a vague notion of what she wanted to do.","example[5]":"the notion that human beings are basically good","note[2]":"notion that","collocation[0]":"have a notion","example[6]":"He didn’t have a clear notion of what he had to do.","collocation[1]":"accept a notion","example[7]":"Probably 95% of scientists now accept the notion that human activity is causing climate change.","collocation[2]":"support a notion","example[8]":"There is no evidence to support the notion that girls are treated better than boys in school.","collocation[3]":"reinforce a notion","example[9]":"The research reinforces the notion that fathers have an important role in their children’s lives.","collocation[4]":"challenge/dispute a notion","example[10]":"Copernicus challenged the notion that the Sun goes around the Earth.","collocation[5]":"reject/dismiss a notion","example[11]":"Aristotle rejected the notion that the body and the soul are separate.","collocation[6]":"a vague notion","example[12]":"He had only a vague notion of what might happen next.","collocation[7]":"an absurd/ridiculous notion","example[13]":"They had the ridiculous notion that they could make a living from singing.","collocation[8]":"a simple notion","example[14]":"You cannot rate the project according to a simple notion of ‘value for money’: there are too many factors involved.","collocation[9]":"an abstract notion","example[15]":"In art, how can you represent abstract notions such as peace or justice?","collocation[10]":"a romantic notion","example[16]":"He rejected the romantic notion of rugby as a game for gentlemen.","collocation[11]":"a preconceived notion","example[17]":"The police were accused of twisting the evidence to meet their preconceived notion of his guilt.","collocation[12]":"an accepted/received notion","example[18]":"These women challenged accepted notions of female roles in society.","collocation[13]":"the whole notion of something","example[19]":"The movie makes us question the whole notion of what makes a hero.","collocation[14]":"not have the faintest/foggiest notion","example[20]":"He had not the foggiest notion how far he might have to walk."}