{"word[0]":"key","signpost[0]":"lock","definition[0]":"a small specially shaped piece of metal that you put into a lock and turn in order to lock or unlock a door, start a car etc","example[0]":"A bunch of keys hung from his belt.","example[1]":"I lost my house keys.","note[0]":"house/car keys","example[2]":"I can lend you a spare key to the store until you get one cut  (=made).","note[1]":"key to","definition[1]":"the buttons that you press on a computer keyboard to operate the computer","note[2]":"hot key/shortcut key (=a special key on a computer, that does specific things)","example[3]":"Press the ‘Escape’ key to exit.","definition[2]":"the wooden or metal parts that you press on a piano and some wind instruments in order to play them","example[4]":"piano keys","definition[3]":"a scale of notes that begins with one particular note, or the quality of sound this scale has","example[5]":"a tune in the key of A minor","signpost[1]":"map/drawing","definition[4]":"a list of the signs, colours etc used on a map or technical drawing etc that explains what they mean","definition[5]":"the printed answers to a test or set of questions in a book","signpost[2]":"island","definition[6]":"a small flat island, especially one that is part of a group near the coast","example[6]":"the Florida Keys","form[0]":"ADJECTIVES/NOUN + key","collocation[0]":"a spare key","example[7]":"Never hide your spare key under the doormat.","collocation[1]":"door key","example[8]":"I’ll get a new door key cut for you.","collocation[2]":"car keys","example[9]":"She left her car keys on the hall table.","collocation[3]":"house keys","example[10]":"I’ve lost my house keys.","collocation[4]":"the front/back door key","example[11]":"She felt in her pocket for the front door key.","collocation[5]":"the ignition key","example[12]":"Sam turned the ignition key and drove slowly away.","collocation[6]":"a bunch/set of keys","example[13]":"He took out a huge bunch of keys and unlocked the door.","collocation[7]":"the key to a door/house/cupboard","example[14]":"Has anyone seen the key to the garage door?","collocation[8]":"put a key in a lock/the door","example[15]":"I put the key in the lock, but it wouldn’t turn.","collocation[9]":"insert a key","example[16]":"She inserted the key into the lock.","collocation[10]":"turn a key","example[17]":"He climbed into his car and turned the key.","collocation[11]":"cut a key","example[18]":"Could you get a key cut for me?","collocation[12]":"jangle your keys","example[19]":"He walked off down the corridor, jangling his keys.","collocation[13]":"a key unlocks/opens something","example[20]":"The largest key unlocks the front door.","collocation[14]":"a key turns","example[21]":"We heard the key turn in the lock.","definition[7]":"very important or necessary","note[3]":"key factor/points/questions etc","example[22]":"China’s support is key to the success of the coalition.","example[23]":"The president makes all the key decisions on foreign policy.","example[24]":"The show has been hit by the departure of key personnel.","note[4]":"key role/player/figure etc","collocation[15]":"a key factor","example[25]":"A key factor in starting any business is its location.","collocation[16]":"a key element/feature/component","example[26]":"Advertising is a key element in the success of a product.","collocation[17]":"a key role","example[27]":"Sanders played a key role in the team’s winning season.","collocation[18]":"a key area","example[28]":"What are the key areas of economic policy?","collocation[19]":"a key issue/question/point","example[29]":"The environment became a key issue during the election.","collocation[20]":"a key figure","example[30]":"She was a key figure in the election campaign.","collocation[21]":"a key player","example[31]":"He won’t leave key players out of the team.","collocation[22]":"a key witness","example[32]":"She will be a key witness in the murder trial.","collocation[23]":"a key decision","example[33]":"Women made most of the key decisions about how money was spent in the household.","collocation[24]":"a key word","example[34]":"Once you know the key words, you can make your own sentence.","definition[8]":"if you key a win for your team, you help it win a game because you play very well","example[35]":"Abdul keyed the game with three touchdowns.","definition[9]":"to prepare a surface so that a covering such as paint will stick to it","definition[10]":"a part of a computer with a letter, number etc on it that you press with your fingers to make it work","example[36]":"Press any key to continue.","definition[11]":"the part of a plan, arrangement etc that is the most important and which everything else depends on","example[37]":"The key to customer satisfaction is quick access to those best placed to resolve issues quickly.","example[38]":"If managers are free to concentrate on the core business, this could be a key to economicsuccess in the difficult times ahead.","example[39]":"the impact of foreign investment onkey industries","example[40]":"The key elements of Japanese management methods can be applied to Western organisations.","example[41]":"A key factor in these companies’ success is knowing their customers’ preferences.","example[42]":"Technical alliances between companies are key to putting pressure on other cable competitors.","definition[12]":"a person or company that is very important and influential","example[43]":"The key players involved in the change must be identified and their commitment to the change obtained.","example[44]":"Employers are key actors within industrial relations.","definition[13]":"if the level, price, value etc of something is keyed to something else, it is related to it and rises and falls with it","example[45]":"In many cases, brokers’ commissions are keyed to share prices.","example[46]":"The agreement requires banks to hold a certain amount of capital, keyed to the riskiness of loans."}