{"word[0]":"environmental","definition[0]":"concerning or affecting the air, land, or water on Earth","example[0]":"the environmental damage caused by the chemical industry","example[1]":"an international meeting to discuss environmental issues","example[2]":"the environmental impact of pollution from cars","example[3]":"an environmental group (=group of people who want to protect the environment)","definition[1]":"concerning the people and things around you in your life, for example the buildings you use, the people you live or work with, and the general situation you are in","example[4]":"environmental risks to employees’ health","collocation[0]":"environmental issues","example[5]":"Environmental issues, such as cliff erosion and pollution, directly affect people’s lives.","collocation[1]":"environmental protection","example[6]":"Is environmental protection more important than economic growth?","collocation[2]":"environmental damage","example[7]":"the environmental damage caused by opencast mining","collocation[3]":"environmental pollution","example[8]":"Power stations cause a lot of environmental pollution.","collocation[4]":"environmental problems","example[9]":"Acid rain is one of the major environmental problems associated with burning coal.","collocation[5]":"environmental concerns","example[10]":"Residents have raised some valid environmental concerns about the nuclear plant.","collocation[6]":"environmental awareness","example[11]":"Schools are crucial in helping to raise environmental awareness.","collocation[7]":"an environmental group","example[12]":"a campaign by environmental groups to protect the Antarctic","collocation[8]":"the environmental movement","example[13]":"There are differences of opinion about nuclear power within the environmental movement.","collocation[9]":"the environmental impact","example[14]":"Don’t underestimate the environmental impact logging has on the rainforest.","collocation[10]":"environmental effects","example[15]":"The environmental effects of building the dam will be felt by generations to come."}