{"word[0]":"pattern","definition[0]":"the regular way in which something happens, develops, or is done","example[0]":"Weather patterns have changed in recent years.","example[1]":"A general pattern began to emerge.","example[2]":"Their descriptions seemed to follow a set pattern (=always develop in the same way).","example[3]":"His behavior fits a pattern of violent acts.","example[4]":"changing patterns of behaviour among students","note[0]":"pattern of","example[5]":"The child showed a normal pattern of development.","example[6]":"They noticed patterns in the data.","note[1]":"pattern in","definition[1]":"a regularly repeated arrangement of shapes, colours, or lines on a surface, usually as decoration","example[7]":"a black and white striped pattern","example[8]":"a pattern of dots","definition[2]":"a regularly repeated arrangement of sounds or words","example[9]":"A sonnet has a fixed rhyming pattern.","definition[3]":"a thing, idea, or person that is an example to copy","example[10]":"The book set the pattern for over 40 similar historical romances.","definition[4]":"a shape used as a guide for making something, especially a thin piece of paper used when cutting material to make clothes","example[11]":"a dress pattern","definition[5]":"a small piece of cloth, paper etc that shows what a larger piece will look like","synonym[0]":"sample","collocation[0]":"a pattern of behaviour","example[12]":"It's easy to get stuck in the same old pattern of behaviour.","collocation[1]":"a pattern of development","example[13]":"Regular checks help to ensure that the child is following the normal pattern of development","form[0]":"ADJECTIVES/NOUN + pattern","collocation[2]":"the same/a similar pattern","example[14]":"Each of the murders has followed a similar pattern.","collocation[3]":"a different pattern","example[15]":"There are different patterns of social life in urban areas.","collocation[4]":"the basic pattern","example[16]":"The basic pattern of her working day rarely changed.","collocation[5]":"the general pattern","example[17]":"The general pattern of change has been one of upward mobility.","collocation[6]":"the normal/usual pattern","example[18]":"As soon as she could, she resumed the normal pattern of her life.","collocation[7]":"a set/fixed pattern","example[19]":"These incidents followed a set pattern.","collocation[8]":"a weather pattern","example[20]":"Rising global temperatures are affecting weather patterns.","collocation[9]":"a behaviour pattern","example[21]":"He studied animal behaviour patterns.","collocation[10]":"a sleep pattern","example[22]":"Disturbed sleep patterns may be a symptom of depression.","collocation[11]":"a speech pattern","example[23]":"Computers are now able to produce acceptable speech patterns.","collocation[12]":"a spending pattern","example[24]":"The bank’s computer can detect unusual spending patterns.","collocation[13]":"a pattern emerges","example[25]":"Although the numbers are small, a pattern began to emerge.","collocation[14]":"follow a pattern","example[26]":"Her headaches did not seem to follow any particular pattern.","collocation[15]":"fit a pattern","example[27]":"Last week’s bombing fits this pattern.","collocation[16]":"establish a pattern","example[28]":"You should try to establish a pattern of working that suits you.","definition[6]":"a regularly repeated arrangement of shapes, colours, or lines on a surface","example[29]":"Some of his pictures use patterns of dots.","example[30]":"The lines formed a regular pattern.","display[0]":"design","definition[7]":"a pattern used for decorating something, especially cloth or paper","example[31]":"curtains with a floral design  (=based on flowers)","display[1]":"markings","definition[8]":"the coloured patterns and shapes on an animal’s fur, feathers, or skin","example[32]":"the tiger’s black and orange markings","display[2]":"motif","definition[9]":"a single shape that is regularly repeated to form a pattern which decorates something","example[33]":"A triangle within a square is a very common motif in Muslim art.","example[34]":"The shield motif in the frescoes at Knossos is a religious, not a military, symbol.","definition[10]":"to form a pattern on something","example[35]":"Tiny white flowers patterned the ground like confetti.","definition[11]":"the regular way in which something happens, changes, or is done","example[36]":"The standards are expected toset a pattern for cleaner, more expensive fuels.","example[37]":"a survey on the spending patterns of various nationalities","definition[12]":"an agreement etc between a company and a union based on other agreements with similar companies","example[38]":"He disputed that the contract was a pattern settlement because it doesn’t match contracts at foreign steel plants.","example[39]":"Some executives are grumbling thatpattern bargaining is making competition with Japanese auto makers very difficult.","definition[13]":"to be in a period of time when very little trading, spending etc is taking place because people are not sure what to do next","example[40]":"Investors are in a holding pattern waiting for clear signals about the economy’s direction.","definition[14]":"if one thing is patterned on another, it is very similar to it because it has been copied from it","example[41]":"Credit Mobilier of America, a finance company patterned after a French venture","example[42]":"a model of economic development patterned on Japan’s"}