{"word[0]":"compromise","definition[0]":"an agreement that is achieved after everyone involved accepts less than what they wanted at first, or the act of making this agreement","example[0]":"Compromise is an inevitable part of marriage.","example[1]":"To stop the argument they decided on a compromise.","example[2]":"If moderates fail to reach a compromise, the extremists will dominate the agenda.","example[3]":"Be prepared to make compromises.","example[4]":"Fresh attempts at compromise with the legislature were also on the agenda.","note[0]":"compromise with","example[5]":"a compromise between government and opposition","note[1]":"compromise between","definition[1]":"a solution to a problem in which two things or situations are changed slightly so that they can exist together","example[6]":"a happy compromise between the needs of family and work","collocation[0]":"reach a compromise","example[7]":"After a bitter political fight, a compromise was finally reached.","collocation[1]":"come to/arrive at a compromise","example[8]":"The negotiations took place and they arrived at a compromise.","collocation[2]":"accept/agree on a compromise","example[9]":"It would be advantageous for both countries to accept a compromise.","collocation[3]":"find/work out a compromise","example[10]":"A temporary compromise was found.","collocation[4]":"seek a compromise","example[11]":"Both Democrats and Republicans are seeking a compromise on the issue.","collocation[5]":"make a compromise","example[12]":"Marriage involves being tolerant and making compromises.","collocation[6]":"forge/strike a compromise","example[13]":"They met again Wednesday night to try to forge a compromise.","collocation[7]":"broker/negotiate a compromise","example[14]":"They admitted that their efforts to negotiate a compromise had failed.","collocation[8]":"lead to a compromise","example[15]":"Negotiations between the residents and the council led to a compromise.","collocation[9]":"a good compromise","example[16]":"I hope we can reach a good compromise.","collocation[10]":"an acceptable/reasonable/satisfactory compromise","example[17]":"By 1982 an acceptable compromise had been reached.","collocation[11]":"a sensible compromise","example[18]":"The strikes continued and there seemed to be no chance of a sensible compromise.","collocation[12]":"an uneasy compromise","example[19]":"The deal represented an uneasy compromise.","form[0]":"compromise + NOUN","collocation[13]":"a compromise proposal","example[20]":"The House of Representatives accepted a compromise proposal from the administration.","collocation[14]":"a compromise deal","example[21]":"Hopes are rising for a European compromise deal.","collocation[15]":"a compromise solution/agreement","example[22]":"The president was under increasing pressure to reach a compromise solution with his political opponents.","definition[2]":"to reach an agreement in which everyone involved accepts less than what they wanted at first","example[23]":"She admitted that she was unable to compromise.","example[24]":"His workmates demanded that he never compromise with the bosses.","example[25]":"The new regime was prepared to compromise on the oil dispute.","note[2]":"compromise on","definition[3]":"to do something which is against your principles and which therefore seems dishonest or shameful","example[26]":"As soon as you compromise your principles you are lost.","note[3]":"compromise your principles/standards/integrity etc","example[27]":"She had already compromised herself by accepting his invitation.","note[4]":"compromise yourself","heading[0]":"– Meaning 2: to do something which is against your principles and which therefore seems dishonest or shameful","collocation[16]":"compromise your integrity","example[28]":"The journalist would not compromise his integrity by revealing the source for the story.","collocation[17]":"compromise your principles","example[29]":"The government says the plans will not compromise its environmental principles.","collocation[18]":"compromise your standards","example[30]":"Universities should not have to compromise their academic standards.","collocation[19]":"compromise your beliefs/convictions/ideals","example[31]":"Anti-war activists were put in prison for refusing to compromise their beliefs.","definition[4]":"to reach an agreement with someone in which both of you accept less than you really want","example[32]":"The employers will have to be ready to compromise if they want to avoid a strike.","example[33]":"The president might be willing to compromise on defense spending.","display[0]":"meet somebody halfway","definition[5]":"to do part of what someone wants if they do part of what you want, in order to reach an agreement","example[34]":"Is the president ready to meet these senators halfway?","example[35]":"The asking price is £270,000. If the sellers won’t accept £250,000, maybe they would be prepared to meet us halfway and take £260,000?","display[1]":"make concessions","definition[6]":"if one group in a disagreement makes concessions, they let their opponents have something that they are asking for, in order to reach an agreement","example[36]":"The company has already made significant concessions on pay and conditions.","example[37]":"There is a policy of making no concessions to terrorists.","definition[7]":"an agreement between two people or groups in which both sides agree to accept less than they first asked for and to give up something that they value","example[38]":"Representatives of each side might well come to some sort of compromise.","definition[8]":"if two groups compromise, they each accept less than they first asked for, and each give up something that they value","example[39]":"The company has refused to compromise on a reduction in the working week.","example[40]":"We agreed to compromise with the union on certain things."}