{"word[0]":"part","definition[0]":"a piece or feature of something such as an object, area, event, or period of time","example[0]":"in the early part of the 19th century","note[0]":"the early/later/latter/last part","example[1]":"The best part of the holiday was the food.","note[1]":"the best/worst part","example[2]":"You can see the final part of that series on Tuesday.","note[2]":"the first/final/last part etc","example[3]":"I shall be explaining this further in Part Two.","note[3]":"part two/three etc","example[4]":"Getting Dad to agree will be the hard part.","note[4]":"the hard/easy part","example[5]":"The jobs attracted people from all parts of the world.","note[5]":"different parts/all parts of something","example[6]":"the traditions that are an integral part of Jewish life","note[6]":"integral/vital/important part","example[7]":"The front part of the car was damaged.","note[7]":"part of","example[8]":"In parts of Canada, French is the first language.","example[9]":"The cost of living is becoming unbearable for retired people in our part of the world (=where we live).","example[10]":"More heat is lost through the head than any other part of the body.","example[11]":"The film is very violent in parts.","note[8]":"in parts","signpost[0]":"machine/object","definition[1]":"one of the separate pieces that something such as a machine or piece of equipment is made of","note[9]":"spare parts (=kept for when a part breaks, needs replacing etc)","example[12]":"Lay all the parts out before you start assembling the model.","example[13]":"engine parts","definition[2]":"a parting","signpost[1]":"acting","definition[3]":"the words and actions of a particular character in a play or film","synonym[0]":"role","example[14]":"Could someone take the part of Romeo, please?","example[15]":"Katharine’s playing the part of Mary in the school play.","definition[4]":"the music that one type of instrument or voice within a group plays or sings","example[16]":"The violin part is difficult.","example[17]":"The choir sings in four-part harmony.","signpost[2]":"quantity","definition[5]":"used to say how much of each substance there is or should be in a mixture","example[18]":"Prepare the glue with one part powder to three parts water.","example[19]":"The sulphur dioxide level in the air was 32 parts per billion.","heading[0]":"– Meaning 1: a piece or feature of something such as an object, area, event, or period of time","form[0]":"ADJECTIVES/NOUN + part","collocation[0]":"the early part","example[20]":"The school dates from the early part of the nineteenth century.","collocation[1]":"the first part","example[21]":"In the first part of the book he describes his childhood.","collocation[2]":"the later part","example[22]":"in the later part of the twentieth century","collocation[3]":"the latter part","example[23]":"The festival lasts for ten days during the latter part of May.","collocation[4]":"the last/final part","example[24]":"We had reached the last part of our journey.","example[25]":"The worst part was having to work even when it was raining.","example[26]":"Deciding what you’re going to cook is the easy part.","collocation[5]":"an important part","example[27]":"Fresh fruit is an important part of our diet.","collocation[6]":"a vital/essential part","example[28]":"A ceasefire in the region is an essential part of any peace process.","collocation[7]":"an integral part","example[29]":"These workshops are an integral part of the course.","collocation[8]":"different parts of something","example[30]":"Public transport varied between different parts of the country.","collocation[9]":"all parts of something","example[31]":"He had access to all parts of the factory.","collocation[10]":"the component/constituent parts of something","example[32]":"The body is a complex thing with many constituent parts.","collocation[11]":"equal parts","example[33]":"I cut the orange into four equal parts.","collocation[12]":"parts of the world","example[34]":"There are wars going on in many parts of the world.","collocation[13]":"parts of the country","example[35]":"He sometimes went to visit friends in other parts of the country.","collocation[14]":"parts of the body","example[36]":"The cancer may spread to other parts of the body.","collocation[15]":"part one/two/three etc","example[37]":"The questionnaire is in two parts: part one asks for your personal details and part two asks for your comments on the course.","heading[1]":"– Meaning 17: the words and actions of a particular character in a play or film","collocation[16]":"play a part","example[38]":"She plays the part of an ageing beauty queen.","collocation[17]":"have a part","example[39]":"He had a small part in ‘Casino Royale’.","collocation[18]":"take a part","example[40]":"When I was offered the part of the prince, I decided to take it.","collocation[19]":"get a part","example[41]":"I was thrilled when I was told I’d got the part.","collocation[20]":"give somebody a part","example[42]":"Why did they give Sinatra the part?","collocation[21]":"land a part","example[43]":"He landed a part in a cop show.","collocation[22]":"a big part","example[44]":"She felt the studio hadn’t given her enough big parts.","collocation[23]":"a good part","example[45]":"Every time we do a play, the boys get all the good parts.","collocation[24]":"a small part","example[46]":"Toby had a small part in the film.","collocation[25]":"the lead/leading part","example[47]":"Taking the lead part of Annie will be 11-year-old Zoe Jones.","collocation[26]":"a speaking part","example[48]":"I had hoped to be given a speaking part.","collocation[27]":"a walk-on part","example[49]":"She had had walk-on parts in a couple of soap operas.","definition[6]":"something that together with other things forms a whole","example[50]":"It looks like part of a car engine.","example[51]":"The best part of the movie was the end.","example[52]":"The hardest part is getting started.","display[0]":"bit","definition[7]":"a small part of something","example[53]":"Some bits of the book are really funny.","example[54]":"I didn’t read the bottom bit.","definition[8]":"one of several different parts that you join together to make something","example[55]":"One of the pieces of the jigsaw puzzle was missing.","example[56]":"The furniture comes in several pieces.","display[1]":"component","definition[9]":"a part of a machine or process","example[57]":"The company supplies engine components for trucks.","example[58]":"Education is a major component in a child’s growth and development.","display[2]":"section","definition[10]":"a part of something that is clearly different and separate from other parts","example[59]":"The test is divided into two sections.","example[60]":"the reference section of the library","example[61]":"the string section of the orchestra","display[3]":"chapter","definition[11]":"one of the numbered parts that a book is divided into","example[62]":"The opening chapter of the book sets the scene.","display[4]":"scene","definition[12]":"one of the parts that a film or play is divided into","example[63]":"Some scenes had to be cut because they were too violent.","example[64]":"act 1, scene 2 of the play","display[5]":"episode","definition[13]":"a part of a story on the television or the radio, which is told in separate parts","example[65]":"I missed last week’s episode.","definition[14]":"to move the two sides of something apart, or to move apart, making a space in the middle","example[66]":"When he parted the curtains, the sunlight flooded into the room.","example[67]":"The crowd parted to let him through.","example[68]":"Ralph’s lips parted in a delighted smile.","definition[15]":"to separate from someone, or end a relationship with them","example[69]":"They parted on amicable terms.","example[70]":"He has parted from his wife.","note[10]":"part from","definition[16]":"if you part your hair, you comb some of your hair in one direction and the rest in the other direction","definition[17]":"not completely","synonym[1]":"partly","example[71]":"The project is part funded by the council.","example[72]":"The object was part hidden by the grass.","definition[18]":"a piece of something such as an object, area, or group","example[73]":"He will have to repay part of the money.","example[74]":"An important part of the trend towards globalisation is the growth of multinational enterprises.","definition[19]":"one of the separate pieces that a machine, vehicle etc is made of","synonym[2]":"COMPONENT","example[75]":"Demand for replacement parts is increasing as consumers repair aging cars.","example[76]":"a supplier of engines, equipment, and spare parts (=parts used to replace original parts that are broken) for commercial aircraft","definition[20]":"some but not all of a particular thing or group of things","example[77]":"Only part of the company is being sold."}