{"word[0]":"interesting","definition[0]":"if something is interesting, you give it your attention because it seems unusual or exciting or provides information that you did not know about","opposite[0]":"uninteresting","example[0]":"That’s an interesting question.","example[1]":"a really interesting TV programme","example[2]":"Did you meet any interesting people?","example[3]":"It’s interesting that no one remembers seeing the car.","example[4]":"I found his talk very interesting.","note[0]":"find something interesting","example[5]":"It will be interesting to see what happens when he gets a bit older.","note[1]":"it is interesting to see/know etc","definition[1]":"keeping your attention and making you want to know more","example[6]":"There’s an interesting article in the newspaper today.","example[7]":"The lecture was really interesting.","display[0]":"fascinating","definition[2]":"very interesting","example[8]":"a fascinating subject","example[9]":"Everything about ancient Egypt is absolutely fascinating.","display[1]":"stimulating","definition[3]":"giving you new ideas or experiences in a way that is interesting and enjoyable","example[10]":"a stimulating conversation","example[11]":"I found him very stimulating to be with and full of ideas.","display[2]":"intriguing","definition[4]":"interesting because of being unusual, mysterious, or unexpected, so that you want to find out more","example[12]":"Their research has produced some intriguing results.","example[13]":"These discoveries raise intriguing questions about the relationship between viral genes and the normal genes of the cell.","display[3]":"absorbing/engrossing","definition[5]":"interesting in a way that keeps your attention completely or for a long time","example[14]":"Growing your own vegetables can be an absorbing hobby.","example[15]":"her engrossing first novel","display[4]":"gripping/riveting/compelling","definition[6]":"used about a very interesting story, film etc that you feel you must keep reading or watching","example[16]":"a gripping story of love and death","example[17]":"He gives a riveting performance as a tough street cop.","example[18]":"There is something compelling about his work.","display[5]":"enthralling","definition[7]":"very interesting and exciting – used especially about a performance you are watching or listening to","example[19]":"Pakistan won an enthralling match by two wickets.","display[6]":"spellbinding","definition[8]":"very interesting because of being so strange, unusual, or wonderful","example[20]":"The book is a spellbinding tale of her life in China.","display[7]":"I couldn’t put it down","definition[9]":"used when saying that a book was so interesting that you could not stop reading it","example[21]":"It’s a great book – I found that I couldn’t put it down."}