{"word[0]":"launch","signpost[0]":"start something","definition[0]":"to start something, usually something big or important","example[0]":"The organization has launched a campaign to raise $150,000.","example[1]":"The Canadian police plan to launch an investigation into the deal.","example[2]":"The book launched his career as a novelist.","example[3]":"The press launched a vicious attack on the president.","note[0]":"launch an attack/assault/offensive","definition[1]":"to make a new product, book etc available for sale for the first time","example[4]":"The company hopes to launch the new drug by next October.","signpost[1]":"boat","definition[2]":"to put a boat or ship into the water","signpost[2]":"sky/space","definition[3]":"to send a weapon or spacecraft into the sky or into space","example[5]":"A test satellite was launched from Cape Canaveral.","definition[4]":"to make a computer program start","example[6]":"Double-click on an icon to launch an application.","definition[5]":"when a new product, book etc is made available or made known","example[7]":"a new product launch","example[8]":"the launch of a new women’s magazine","note[1]":"launch of","definition[6]":"a large boat with a motor","definition[7]":"when a weapon or spacecraft is sent into the sky or into space","definition[8]":"to show or make a new product available for sale for the first time","example[9]":"The company is launching a new range of hair products.","example[10]":"The bank has launched a commercial insurance service for small businesses.","example[11]":"Our internet service will launch next year.","definition[9]":"to start a new company","example[12]":"Conran launched a business empire that was eventually to employ 83,000 people.","definition[10]":"to start a new activity or profession, usually after planning it carefully","example[13]":"The sports channel launched a major advertising campaign two months before the World Cup.","example[14]":"Luke took advantage of a Youth Training Scheme to launch a successful career.","definition[11]":"if one company launches a bid for another, it makes an offer to buy it","example[15]":"Several of its competitors may launch a bid for the company.","definition[12]":"an occasion at which a new product is shown or made available for sale or use for the first time","example[16]":"Savings are needed to finance new product launches.","example[17]":"Since its launch two years ago, sales of the software have grown to only about 300,000 a year.","definition[13]":"the start of a new activity or plan","example[18]":"the launch on New Year’s day of a set of economic reforms"}