{"word[0]":"fact","signpost[0]":"true information","definition[0]":"a piece of information that is known to be true","example[0]":"The divorce rate is twice as high as in the 1950s – that’s a fact.","note[0]":"it’s a fact/that’s a fact","example[1]":"‘She used to be a professional singer.’ ‘Is that a fact?’","note[1]":"is that a fact?","example[2]":"The book is full of facts about the World Cup.","note[2]":"fact about","example[3]":"First of all, we need to know the facts of the case.","note[3]":"fact of","signpost[1]":"real events/not a story","definition[1]":"situations, events etc that really happened and have not been invented","opposite[0]":"fiction","example[4]":"Much of the novel is based on fact.","example[5]":"It’s a news reporter’s job to separate fact from fiction.","collocation[0]":"the basic/key facts","example[6]":"The report outlines the basic facts concerning the case.","collocation[1]":"a well-known fact","example[7]":"It is a well-known fact that new cars lose a lot of their value in the first year.","collocation[2]":"a little-known fact","example[8]":"It is a little-known fact that the actor was born in London.","collocation[3]":"an interesting fact","example[9]":"The research revealed some interesting facts about the behaviour of cats.","collocation[4]":"a curious/remarkable fact","example[10]":"It is a remarkable fact that elephants do not use their trunks to suck up water until they are over four months old.","collocation[5]":"hard facts","example[11]":"His theory is supported by hard facts.","collocation[6]":"a historical/scientific fact","example[12]":"This was presented as a historical fact when it was just an opinion.","collocation[7]":"the bare facts","example[13]":"We know the bare facts of his life, but nothing about what he was really like.","collocation[8]":"give somebody/provide the facts","example[14]":"Newspapers have a duty to give their readers the facts.","collocation[9]":"establish/piece together the facts","example[15]":"The police are still piecing together the facts.","collocation[10]":"examine the facts","example[16]":"I decided to examine the facts for myself.","collocation[11]":"state the facts","example[17]":"Press reports often fail to state the facts completely.","collocation[12]":"stick to the facts","example[18]":"Just stick to the facts when the police interview you.","collocation[13]":"know for a fact","example[19]":"I know for a fact that she is older than me.","collocation[14]":"get your facts right/straight","example[20]":"You should get your facts straight before making accusations.","collocation[15]":"get your facts wrong","example[21]":"It’s no use putting together a beautifully-written argument if you get your facts wrong."}