{"word[0]":"treatment","definition[0]":"something that is done to cure someone who is injured or ill","example[0]":"There have been great advances in the treatment of cancer.","note[0]":"treatment of/for","example[1]":"The best treatment for a cold is to rest and drink lots of fluids.","signpost[0]":"behaviour towards somebody","definition[1]":"a particular way of behaving towards someone or of dealing with them","example[2]":"Just lately, Kyra has been giving me the silent treatment  (=refusing to speak to me because she is angry with me).","example[3]":"The two young princes were not singled out for special treatment at school.","note[1]":"special/preferential treatment","example[4]":"Civil rights groups have complained about the harsh treatment of prisoners.","note[2]":"treatment of","signpost[1]":"of a subject","definition[2]":"a particular way of dealing with or talking about a subject","example[5]":"I didn’t think the film gave the issue serious treatment.","signpost[2]":"clean/protect","definition[3]":"a process by which something is cleaned, protected etc","example[6]":"the treatment of polluted rivers","collocation[0]":"give somebody treatment","example[7]":"He was given treatment at a local hospital.","collocation[1]":"provide/administer treatment","example[8]":"Paramedics are trained to administer on-the-spot treatment to patients.","collocation[2]":"get/have/receive treatment","example[9]":"Two boys received treatment for gunshot wounds.","collocation[3]":"undergo treatment","example[10]":"A few years earlier she'd undergone fertility treatment.","collocation[4]":"need/require treatment","example[11]":"All three were beaten so badly that they needed hospital treatment.","collocation[5]":"respond to treatment","example[12]":"He contracted a lung infection which did not respond to treatment.","form[0]":"ADJECTIVES/NOUN + treatment","collocation[6]":"effective","example[13]":"The drug may prove to be an effective treatment for brain tumours.","collocation[7]":"medical treatment","example[14]":"Every patient has a right to refuse medical treatment.","collocation[8]":"hospital treatment","example[15]":"Several people needed hospital treatment for burns.","collocation[9]":"emergency treatment","example[16]":"The driver needed emergency treatment.","collocation[10]":"dental treatment","example[17]":"You may be entitled to free dental treatment.","collocation[11]":"cancer treatment","example[18]":"She began to investigate alternative cancer treatments.","collocation[12]":"fertility/infertility treatment","example[19]":"Mrs Smith received fertility treatment using donor eggs.","collocation[13]":"psychiatric treatment","example[20]":"He underwent psychiatric treatment after an episode of severe depression.","collocation[14]":"laser treatment","example[21]":"Laser treatment can be technically difficult.","collocation[15]":"alternative treatments","example[22]":"She found out all she could about alternative cancer treatments.","definition[4]":"a particular way of dealing with someone or something","example[23]":"The range of permissibleaccounting treatments is amazingly broad.","example[24]":"The investigation found that some contractors receivedpreferential treatment (=were given an unfair advantage).","definition[5]":"a process by which something is protected, cleaned, or made safe","example[25]":"an organic waste treatment plant"}