{"word[0]":"shake","past_tense[0]":"shook","past_participle[0]":"shaken","definition[0]":"to move suddenly from side to side or up and down, usually with a lot of force, or to make something or someone do this","example[0]":"She shook him to wake him up.","example[1]":"Shake the bottle before you open it.","example[2]":"The whole house started to shake.","example[3]":"The car shook as it went over a bump.","example[4]":"She shook the sand out of her shoes  (=removed it by shaking).","note[0]":"shake something out of/off/from something","definition[1]":"if someone shakes, or part of their body shakes, they make small sudden movements from side to side or up and down, especially because they are very frightened, cold, ill etc","synonym[0]":"tremble","example[5]":"The little boy’s hand was shaking.","example[6]":"What’s wrong with you? You’re shaking like a leaf (=shaking a lot because you are very nervous or frightened).","example[7]":"I could see my neighbor shaking with laughter.","note[1]":"shake with fear/laughter/anger etc","example[8]":"I was shaking in my shoes – I thought he was going to fire me.","note[2]":"be shaking in your shoes/boots","signpost[0]":"shock","definition[2]":"to make someone feel very upset or shocked","example[9]":"Kerrie was so shaken by the attack that she won’t go out alone.","example[10]":"The murder shook the whole town.","collocation[0]":"shake slightly","example[11]":"Adam opened the envelope, his hand shaking slightly.","collocation[1]":"shake violently","example[12]":"She found him huddled in a corner, shaking violently.","collocation[2]":"shake uncontrollably","example[13]":"His whole body shook uncontrollably.","collocation[3]":"be shaking badly","example[14]":"She had been crying, and was still shaking badly.","collocation[4]":"be visibly shaking","example[15]":"He was visibly shaking with anger.","collocation[5]":"shake with laughter","example[16]":"Both women shook with laughter.","collocation[6]":"shake with anger/fear etc","example[17]":"He stood there shaking with anger.","collocation[7]":"be shaking all over","example[18]":"She was shaking all over, partly from cold, partly from shock.","collocation[8]":"be shaking like a leaf","example[19]":"Diana was shaking like a leaf when she got up to give her talk.","example[20]":"The president must be shaking in his shoes about Tuesday’s vote.","definition[3]":"if a person or part of their body shakes, they make small sudden continuous movements from side to side or up and down, especially because they are very frightened, cold, ill etc","example[21]":"Suddenly he started to shake. ‘Don’t ever scare me like that again!’ he whispered.","example[22]":"The poor girl was shaking.","display[0]":"shudder","definition[4]":"to shake for a short time, especially because you think of something very unpleasant, or because you feel frightened or cold","example[23]":"Corbett shuddered when he thought of what might have happened to them.","example[24]":"I shuddered when I read the article.","example[25]":"He was still shuddering with the cold.","example[26]":"She clung to him, shuddering with emotion.","definition[5]":"to shake slightly in a way that you cannot control, especially because you are frightened, worried, or angry","example[27]":"Ernest opened the letter in silence, his hands trembling.","example[28]":"Her whole body trembled with fear.","example[29]":"He hadn’t dared to move. He was trembling with shock.","example[30]":"‘I won’t be coming back, ’ she said, her body trembling with anger.","display[1]":"shiver","definition[6]":"to shake slightly, especially only a few times, because you are cold or frightened","example[31]":"She shivered, pulling her coat closer around herself.","example[32]":"You make me shiver when you talk like that.","display[2]":"quiver","definition[7]":"to shake slightly and continuously because you are very worried or excited – used especially about someone’s lips, mouth, or body","example[33]":"Her bottom lip began to quiver, and she turned away to hide her tears.","example[34]":"Alice’s eyes began to fill with tears and her mouth quivered. ‘I 'm going away, ’ she said.","display[3]":"wobble","definition[8]":"to move unsteadily from side to side","example[35]":"Mrs Hamilton wobbled precariously on her high heels.","definition[9]":"to move gently backwards and forwards or from side to side","example[36]":"He rocked to and fro in his chair.","heading[0]":"object/vehicle/the ground etc","definition[10]":"to move suddenly from side to side or up and down, usually with a lot of force","example[37]":"The floor shook from a distant explosion.","example[38]":"The walls were still shaking.","example[39]":"The trees were shaking in the wind.","display[4]":"rattle","definition[11]":"to shake and make a noise","example[40]":"The windows rattled in the wind.","example[41]":"The train was rattling over the bridge.","display[5]":"vibrate","definition[12]":"to shake continuously with small fast movements","example[42]":"The music was so loud that the whole room vibrated.","example[43]":"The atoms vibrate at different frequencies.","example[44]":"The bike began to wobble alarmingly as she fought to control it.","example[45]":"The cup wobbled and he grabbed it to stop it from falling.","example[46]":"The trailer rocked in the wind.","example[47]":"The boat was rocking from side to side with the waves.","definition[13]":"if a vehicle or machine shudders, it shakes for a short time.","example[48]":"The lift shuddered then began to descend.","example[49]":"The engine shuddered into life  (=it shook and then started working).","example[50]":"The car juddered to a halt  (=it shook and then stopped) outside the house.","definition[14]":"if you give something a shake, you move it up and down or from side to side","example[51]":"Give the bottle a good shake before use.","example[52]":"He refused with a shake of the head (=a movement of the head from side to side to mean ‘no’).","definition[15]":"a cold drink made from milk, ice cream, and fruit or chocolate","synonym[1]":"milk shake","example[53]":"a strawberry shake","definition[16]":"if something shakes people’s confidence, hopes, belief etc, it makes them feel less confident, hopeful etc","example[54]":"Consumerconfidence has been badly shaken by fears of another recession.","example[55]":"A series of management changes has shaken staff morale."}