{"word[0]":"publicity","definition[0]":"the attention that someone or something gets from newspapers, television etc","example[0]":"Standards in education have received much publicity over the last few years.","example[1]":"It’s important to gain good publicity for the school.","note[0]":"bad/good/unwelcome etc publicity","example[2]":"The adverse publicity had damaged sales.","definition[1]":"the business of making sure that people know about a new product, film etc or what a particular famous person is doing","example[3]":"Who’s going to do the show’s publicity?","example[4]":"The Government has launched a publicity campaign.","example[5]":"Is their much-reported romance just a publicity stunt  (=something that is only done to get publicity)?","collocation[0]":"bad publicity","example[6]":"Fatty foods have received much bad publicity in recent years.","example[7]":"They don't want any more adverse publicity.","collocation[1]":"good publicity","example[8]":"Top exam results are good publicity for schools.","collocation[2]":"free publicity","example[9]":"Giving away samples is one way of getting free publicity for your products.","collocation[3]":"widespread/wide publicity","example[10]":"The scandal had received widespread publicity.","collocation[4]":"national publicity","example[11]":"Candidates aim to get national publicity during election campaigns.","collocation[5]":"considerable/massive/extensive publicity","example[12]":"The opening of the trial generated considerable publicity.","collocation[6]":"maximum publicity","example[13]":"Throughout the strike, the workers achieved maximum publicity for their demands.","collocation[7]":"unwelcome publicity","example[14]":"Their relationship had attracted unwelcome publicity.","collocation[8]":"get publicity","example[15]":"Climate change is getting a lot of publicity.","example[16]":"Such studies have received a lot of publicity.","collocation[9]":"attract publicity","example[17]":"Two recommendations in the report have attracted publicity.","collocation[10]":"gain publicity","example[18]":"Appearing on a chat show means you gain publicity.","collocation[11]":"generate publicity","example[19]":"The publication of the book generated an enormous amount of publicity.","collocation[12]":"give publicity to something","example[20]":"Much publicity was given to their allegations in the British press.","collocation[13]":"avoid publicity","example[21]":"They wanted to settle the matter quietly in order to avoid bad publicity.","collocation[14]":"shun publicity","example[22]":"He lives quietly in Acton with his wife and two sons and shuns publicity.","collocation[15]":"seek publicity","example[23]":"He sought neither reward nor publicity for his work.","collocation[16]":"the glare of publicity","example[24]":"He carried on his life in the full glare of publicity.","collocation[17]":"a blaze of publicity","example[25]":"His marriage broke up in a blaze of publicity.","example[26]":"The case has received massive publicity.","example[27]":"Sales of the drug are falling due to adverse (=negative) publicity about side-effects.","definition[2]":"the business activity of making sure that people know about a new product, film etc","example[28]":"The company plans a major publicity campaign (=a series of events, advertisements etc designed to give something publicity) for the new technology."}