{"word[0]":"retail","definition[0]":"the sale of goods in shops to customers, for their own use and not for selling to anyone else","example[0]":"a retail price of £8.99","example[1]":"The retail value would be around $500.","example[2]":"Retail sales fell by 1.3% in January.","example[3]":"a manager with twenty years’ experience in the retail business","note[0]":"the retail trade/business","example[4]":"We are looking for more retail outlets for our products.","note[1]":"retail outlet/shop/store/chain","definition[1]":"to be sold for a particular price in a shop","example[5]":"The wine retails at £6.95 a bottle.","note[2]":"retail at/for","example[6]":"The decoder is expected to retail for under $300.","definition[2]":"to sell goods in shops","example[7]":"Their products are retailed all over Britain.","definition[3]":"to give other people private information about someone or something","definition[4]":"if you buy or sell something retail, you buy or sell it in a shop","example[8]":"We only deal with wholesalers – we don’t sell any of our goods retail.","definition[5]":"the sale of goods to customers for their own use, rather than to shops etc","example[9]":"His experience in retail includes managing a number of shopping centres in New Zealand.","example[10]":"The Potato Marketing Board determines the size range of potatoes which can be offered for retail.","definition[6]":"the selling of goods or services to members of the public, or companies involved in this","example[11]":"Anyone working in the retail trade will often have to deal with customers who want to exchange or return goods.","definition[7]":"a shop etc that is open to members of the public","example[12]":"These large retail outlets stock a wide range of goods.","definition[8]":"banking or investment services available to members of the public, rather than to businesses or companies","definition[9]":"an individual customer etc, rather than a business or company","example[13]":"The scheme relates to all new cars sold to retail customers.","definition[10]":"to be sold to the public, usually in shops, for a particular price","example[14]":"The doll will retail for about £36.","note[3]":"retail for/at","definition[11]":"to sell goods in small quantities to members of the public, usually in a shop","example[15]":"The product is not being retailed through the right kind of outlets.","definition[12]":"if something is sold retail, it is sold to members of the public, usually in a shop","example[16]":"We only deal with wholesalers - we don’t sell any of our goods retail."}