{"word[0]":"flat","comparative[0]":"flatter","superlative[0]":"flattest","signpost[0]":"surface","definition[0]":"smooth and level, without raised or hollow areas, and not sloping or curving","example[0]":"houses with flat roofs","example[1]":"a perfectly flat sandy beach","example[2]":"The countryside near there is flat as a pancake (=very flat).","example[3]":"Work on a clean, flat surface.","definition[1]":"a flat rate, amount of money etc is fixed and does not change or have anything added to it","example[4]":"Clients are charged a flat rate of £250 annually.","example[5]":"We charge a flat fee for car hire.","signpost[1]":"tyre/ball","definition[2]":"a flat tyre or ball has no air or not enough air in it","signpost[2]":"not deep","definition[3]":"not very deep, thick, or high, especially in comparison to its width or length","example[6]":"The cake came out of the oven flat, not fluffy.","definition[4]":"a drink that is flat does not taste fresh because it has no more bubbles of gas in it","opposite[0]":"fizzy","signpost[3]":"not interesting","definition[5]":"a performance, book etc that is flat lacks interest, excitement, or energy","example[7]":"Arsenal looked flat for large parts of the game.","signpost[4]":"battery","definition[6]":"a flat battery has lost its electrical power","example[8]":"Have you checked that the batteries haven’t gone flat (=become flat)?","signpost[5]":"business/trade","definition[7]":"if prices, economic conditions, trade etc are flat, they have not increased or improved over a period of time","example[9]":"Analysts are expecting flat sales in the coming months.","signpost[6]":"musical sound","definition[8]":"if a musical note is flat, it is played or sung slightly lower than it should be","definition[9]":"not showing much emotion, or not changing much in sound as you speak","example[10]":"‘He’s dead, ’ she said in a flat voice.","signpost[7]":"shoes","definition[10]":"flat shoes have very low heels","definition[11]":"having little variety of light and dark","example[11]":"Flat lighting is typical of Avedon’s portraits.","definition[12]":"on one level, without any holes or raised areas, and not sloping or curving","example[12]":"a flat roof","example[13]":"a flat screen","example[14]":"Before you lay the tiles, make sure that the ground is completely flat.","display[0]":"level","definition[13]":"not sloping in any direction, so that every part is at the same height","example[15]":"Is the top of this picture level?","example[16]":"After four hours coming down the mountain, I was glad to be back on level ground.","definition[14]":"without any holes or raised areas – used especially when saying how something feels when you touch it","example[17]":"her lovely smooth skin","example[18]":"I ran my hand across the animal’s smooth fur.","display[1]":"even","definition[15]":"without any holes or raised areas","example[19]":"Apply the paint to an even surface.","example[20]":"Be careful – the path is not very even here.","display[2]":"horizontal","definition[16]":"going straight across and not sloping","example[21]":"a horizontal line","example[22]":"Raise both arms to a horizontal position.","signpost[8]":"place to live","definition[17]":"a place for people to live that consists of a set of rooms that are part of a larger building","synonym[0]":"apartment","example[23]":"They have a flat in Crouch End.","example[24]":"a two-bedroom flat","example[25]":"The building was knocked down to make way for a block of flats (=a large building with many flats in it).","signpost[9]":"tyre","definition[18]":"a tyre that does not have enough air inside","synonym[1]":"flat tyre","example[26]":"Damn, the car has a flat.","example[27]":"He stopped to change a flat.","definition[19]":"a musical note that is one semitone lower than a particular note","definition[20]":"the sign (Ƅ) in written music that shows that a note is one semitone lower than a particular note","form[0]":"ADJECTIVES/NOUN + flat","example[28]":"The flat was too small for the three of them.","collocation[0]":"big/spacious","example[29]":"It was a big flat with eight or nine rooms.","collocation[1]":"cramped/poky","example[30]":"She spends most days shut up in a poky flat looking after her disabled Mum.","collocation[2]":"a one-bedroom/two-bedroom etc flat","example[31]":"She lived in a one-bedroom flat in Clapham.","collocation[3]":"a one-room/two-room etc flat","example[32]":"Their home is a humble two-room flat.","collocation[4]":"a ground-floor/first-floor/second-floor etc flat","example[33]":"We’re moving into a first-floor flat.","collocation[5]":"a basement flat","example[34]":"They lived in a basement flat in South London.","collocation[6]":"a studio flat","example[35]":"I might just be able to afford a tiny studio flat.","collocation[7]":"high-rise flats","example[36]":"Many high-rise flats were built in the 1970s.","collocation[8]":"a rented flat","example[37]":"He returned to his rented flat in Cheltenham.","collocation[9]":"a luxury flat","example[38]":"Laura shares a luxury flat with her sister Chloe.","collocation[10]":"a self-contained flat","example[39]":"We rented a self-contained flat in the city centre.","collocation[11]":"a furnished/unfurnished flat","example[40]":"She found a job and a furnished flat.","collocation[12]":"a holiday flat","example[41]":"The building has been converted into three holiday flats.","collocation[13]":"a block of flats","example[42]":"At the time, I lived in a block of flats in St John’s Wood.","collocation[14]":"live in a flat","example[43]":"Terry lived in a flat on the second floor.","collocation[15]":"buy a flat","example[44]":"I had planned to buy a flat with Geraldine.","collocation[16]":"rent a flat","example[45]":"Renting a flat can be very expensive in this part of town.","collocation[17]":"move into a flat","example[46]":"They move into their new flat next week.","collocation[18]":"own a flat","example[47]":"The couple own their own flat in Peebles.","signpost[10]":"flat position","definition[21]":"in a position in which the surface of something is against another surface without curving or sloping","example[48]":"The bed can be folded flat for storage.","example[49]":"He lay flat on the floor.","example[50]":"That night I lay flat on my back and stared up at the ceiling.","definition[22]":"if you sing or play music flat, you sing or play slightly lower than the correct note so that the sound is unpleasant","definition[23]":"a flat fee, price etc is fixed and does not change or have anything added to it","example[51]":"Subscribers to the service have to pay a flat charge each month.","definition[24]":"if a market, economy etc is flat or sales are flat, levels of trade or sales are not increasing","example[52]":"In the USA, car sales were flat although truck sales increased.","example[53]":"As demand for the company’s products stays flat and costs remain high, half-year profits have fallen by 70% to £15.1 million.","definition[25]":"if the stockmarket is flat, prices are not rising or falling","example[54]":"The share market closed flat after spending the day trapped in a 10 point range.","definition[26]":"a place where people live that consists of a set of rooms, usually on one floor, which are part of a larger building","synonym[2]":"APARTMENT","example[55]":"Prices start from £89,995 for one-bedroom flats.","example[56]":"The building was knocked down to make way for a block of flats (=a large building divided into many separate flats).","definition[27]":"if something you are doing or planning falls flat, it is unsuccessful","example[57]":"Their plans to build a retirement home in Spain fell flat.","definition[28]":"if you work flat out, you work as fast as possible","example[58]":"Working flat out, the men completed the work by about ten-thirty on Saturday morning."}