{"word[0]":"trend","definition[0]":"a general tendency in the way a situation is changing or developing","example[0]":"The current trend is towards more part-time employment.","example[1]":"the general trend towards the centralization of political power","example[2]":"A disturbing trend is that victims of violence are getting younger.","example[3]":"The growing trend is for single mothers to bring up children by themselves.","example[4]":"Even so, the underlying trend is positive.","example[5]":"national and international economic trends","example[6]":"the downward trend in the price of gold","example[7]":"Successive presidents have tried to reverse this trend, but without success.","example[8]":"Lately there has been a trend towards hiring younger, cheaper employees.","note[0]":"trend towards","example[9]":"recent trends in education","note[1]":"trend in","collocation[0]":"a recent/new trend","example[10]":"He wrote an article attacking many recent trends in education.","collocation[1]":"the current/latest trend","example[11]":"If current trends continue, the amount of carbon dioxide in the atmosphere will double by the year 2030.","collocation[2]":"a general trend","example[12]":"There was a general trend towards marriage at a younger age.","collocation[3]":"a growing/increasing/rising trend","example[13]":"a growing trend towards globalization in world markets","collocation[4]":"an alarming/worrying/disturbing trend","example[14]":"I have detected a worrying trend of late.","collocation[5]":"the underlying/long-term trend","example[15]":"The underlying trend is for rich economies to get richer.","collocation[6]":"a downward/upward trend","example[16]":"The downward trend in population growth was not seen as a problem.","collocation[7]":"economic/market trends","example[17]":"This forecast is based on current economic trends.","collocation[8]":"the national trend","example[18]":"Crime rates in Manchester bucked the national trend.","collocation[9]":"the international/world-wide/global trend","example[19]":"the global trend towards intensive farming","collocation[10]":"reverse a trend","example[20]":"He succeeded in reversing the downward trend of the railway’s fortunes.","collocation[11]":"buck the trend","example[21]":"The recession may still be biting, but video games company Nintendo continues to buck the trend.","collocation[12]":"follow a trend","example[22]":"Divorce rates in Scotland are following the general trend.","collocation[13]":"start a trend","example[23]":"The young started a trend toward living in the downtown area.","definition[1]":"if a subject is trending on the Internet, a lot of people are searching for it or sending messages about it","definition[2]":"if an amount is trending downwards or upwards, it is becoming lower or higher","example[24]":"Average temperatures are trending upwards.","note[2]":"trend downwards/upwards","definition[3]":"the general way in which a particular situation is changing or developing","example[25]":"a New Jersey firm that tracks financialmarket trends","example[26]":"Theprice trend in food grains continued upwards.","example[27]":"Credit card issuers are fighting a trend among consumers toward more conservative spending habits.","note[3]":"trend toward","definition[4]":"if something bucks the trend, it does not develop in the same way as most other similar things","example[28]":"Two of the country’s airlines have bucked theindustry trend by cutting fares during the winter season.","definition[5]":"if something reverses a trend, it changes the way things were developing before","example[29]":"To try to reverse the downward trend in its profits, Tandy will focus on its retail business.","definition[6]":"to start doing something in a way that other people begin to copy","example[30]":"The public sector pay awards haveset an inflationary trend for wage settlements this year."}