{"word[0]":"pick","signpost[0]":"choose something","definition[0]":"to choose a person or thing, for example because they are the best or most suitable","example[0]":"Students have to pick three courses from a list of 15.","example[1]":"I don’t know which colour to pick.","example[2]":"Who’s going to pick the team for the match on Saturday?","example[3]":"Russell spoke slowly, picking his words (=choosing what to say) very carefully.","example[4]":"I wasn’t picked for the hockey team.","note[0]":"pick somebody/something for something","example[5]":"The hotel was picked as the best small hotel in the area.","note[1]":"pick somebody/something as something","example[6]":"He was picked to run in the 100 metres.","note[2]":"pick somebody to do something","signpost[1]":"flowers/fruit etc","definition[1]":"to remove a flower, fruit, nut etc from a plant or tree","example[7]":"We picked some blackberries to eat on the way.","example[8]":"Amy picked a small bunch of wild flowers.","example[9]":"a dish of freshly picked peas","signpost[2]":"remove something","definition[2]":"to remove something carefully from a place, especially something small","example[10]":"Ahmed picked the melon pips from his teeth.","note[3]":"pick something from something","example[11]":"She was nervously picking bits of fluff off her sweater.","note[4]":"pick something off (something)","example[12]":"The goalkeeper spent a lot of his time picking the ball out of the back of the net.","note[5]":"pick something out of something","definition[3]":"to play a musical instrument by pulling at its strings with your fingers","synonym[0]":"pluck","definition[4]":"if you can have your pick or take your pick of different things, you can choose which one you want","example[13]":"Have a look at the menu and take your pick.","example[14]":"He knew he could take his pick of any of the girls in the office.","example[15]":"Sarah could have her pick of any university in the country.","example[16]":"She always gets first pick of the videos.","note[6]":"have/get first pick (of something)","definition[5]":"your pick is the person or thing that you have chosen from a group","synonym[1]":"choice","example[17]":"There are a lot of good horses in the race, but Archimedes would be my pick.","definition[6]":"a pickaxe","definition[7]":"a small flat object that you use for pulling at the strings of a musical instrument such as a guitar","synonym[2]":"plectrum"}