{"word[0]":"secure","signpost[0]":"get/achieve","definition[0]":"to get or achieve something that will be permanent, especially after a lot of effort","example[0]":"Boyd’s goal secured his team’s place in the Cup Final.","example[1]":"Negotiators are still working to secure the hostages’ release.","example[2]":"Redgrave won his third Olympic gold medal, and secured his place in history.","example[3]":"The company secured a $20 million contract.","note[0]":"secure a deal/contract","signpost[1]":"safe from harm","definition[1]":"to make something safe from being attacked, harmed, or lost","example[4]":"Troops were sent to secure the border.","example[5]":"an agreement to secure the future of the rainforest","example[6]":"They built a ten-foot high fence to secure the house against intruders.","note[1]":"secure something against somebody/something","signpost[2]":"tie firmly","definition[2]":"to fasten or tie something firmly in a particular position","example[7]":"John secured the boat firmly to the jetty.","note[2]":"secure something to something","signpost[3]":"borrowing money","definition[3]":"if you secure a debt or a loan, you legally promise that, if you cannot pay back the money you have borrowed, you will give the lender goods or property of the same value instead","example[8]":"He used his house to secure the loan.","signpost[4]":"permanent/certain","definition[4]":"a situation that is secure is one that you can depend on because it is not likely to change","opposite[0]":"insecure","example[9]":"There are no secure jobs these days.","example[10]":"We want a secure future for our children.","example[11]":"United’s position at the top of the league seems relatively secure.","signpost[5]":"place/building","definition[5]":"locked or guarded so that people cannot get in or out or steal anything","example[12]":"The house isn’t very secure – we need some new locks.","example[13]":"Keep your passport in a secure place.","example[14]":"In the last year, only three children under the age of 14 have had to be placed in secure accommodation.","note[3]":"secure accommodation","definition[6]":"safe from and protected against damage or attack","example[15]":"Companies can offer secure credit card transactions over the Internet.","example[16]":"These elephants are relatively secure from poachers.","note[4]":"secure from","signpost[6]":"confident","definition[7]":"feeling confident about yourself and your abilities","example[17]":"We want our children to be secure and feel good about themselves.","signpost[7]":"not worried","definition[8]":"feeling confident and certain about a situation and not worried that it might change","example[18]":"Workers no longer feel secure about the future.","example[19]":"It was enough money to make us feel financially secure.","example[20]":"We huddled together, secure in the knowledge that the rescue helicopter was on its way.","signpost[8]":"firmly fastened","definition[9]":"firmly fastened or tied, and not likely to fall down","example[21]":"Are you sure that shelf is secure?","definition[10]":"to get something you need after a lot of effort","example[22]":"The airline has secured financing of $150 million from private sponsors.","definition[11]":"to promise a lender that they can take certain assets, such as property or shares, if their loan is not paid back within the agreed time limit","example[23]":"Borrowers generally are required to secure a loan with personal property as collateral.","example[24]":"The debt is secured on some of the company’s assets.","note[5]":"secure something against/on something","definition[12]":"investments or companies which are secure are not likely to lose money","example[25]":"afinancially secure company","example[26]":"Higher yields are considered to be less secure.","definition[13]":"feeling confident about a particular situation, especially one which concerns the future","example[27]":"The frequent announcements of staff cuts are making Americans feel less secure in their jobs.","definition[14]":"safe and protected from damage, change, being stolen etc","example[28]":"Customers want guarantees that cash machines will be secure from unauthorized use.","example[29]":"The single currency is giving industry more secure operating conditions."}