{"word[0]":"disagree","definition[0]":"to have or express a different opinion from someone else","example[0]":"Barr strongly disagreed with Kronfeld’s statement.","example[1]":"He is tolerant of those who disagree with him.","note[0]":"disagree with","example[2]":"Experts disagree on how much the program will cost.","note[1]":"disagree about/on/over","definition[1]":"if statements, numbers, or reports about the same event or situation disagree, they are different from each other","example[3]":"The statements of several witnesses disagree.","explanation[0]":"You disagree with someone","example[4]":"I totally disagree with you","bad_example[0]":"I totally disagree you","explanation[1]":"You disagree with an idea, or something that someone says","example[5]":"I disagree with his views on the economy","bad_example[1]":"I disagree his views on the economy","explanation[2]":"People disagree about/on/over  a subject","example[6]":"Experts disagree about the answer to this question","example[7]":"Parents often disagree on the best way to bring up children","example[8]":"Scientists disagree over whether oil is unhealthy ","display[0]":"I disagree","explanation[3]":"You say I disagree when you do not agree with what someone says","example[9]":"‘Women are better drivers than men’ ‘I disagree’","bad_example[2]":"I disagree you","display[1]":"disagree/not agree","definition[2]":"to have a different opinion from someone else about something","example[10]":"Scholars disagree about the meaning of the poem.","example[11]":"I don’t agree with a word of what she says.","display[2]":"be divided/split","definition[3]":"if a group of people is divided or split on something, some of them have one opinion and others have a completely different opinion","example[12]":"The party is divided on this issue.","display[3]":"differ","definition[4]":"if two or more people differ about something, they have different opinions from each other about it","example[13]":"The two men differed on how to handle the crisis.","display[4]":"not see eye to eye","definition[5]":"used to say that two people have different opinions and ideas so that it is difficult for them to be friends or work together","example[14]":"Some of the teachers don’t see eye to eye with the principal of the school.","display[5]":"be mistaken","definition[6]":"used to say that you disagree with someone’s opinion and that you think they are wrong","example[15]":"People are mistaken if they think that this problem will go away on its own.","display[6]":"take issue with somebody/something","definition[7]":"to express strong disagreement with an idea or with what someone has said or done","example[16]":"A number of people took issue with the mayor’s decision.","display[7]":"dissent","definition[8]":"to say publicly that you disagree with an official opinion or one that most people accept","example[17]":"Two members of the jury dissented from the majority verdict.","definition[9]":"to have or express a different opinion from someone","example[18]":"They disagree on how much the project will cost","note[2]":"disagree on/about/over","example[19]":"Some of the team disagreed with him, but they were too afraid to say so.","example[20]":"The figures in column A and B disagree."}