{"word[0]":"guard","definition[0]":"someone whose job is to protect a place or person","example[0]":"There were two security guards on duty outside the building.","example[1]":"We were stopped by border guards.","example[2]":"Armed guards were posted by the exit.","definition[1]":"someone whose job is to prevent prisoners from escaping","example[3]":"The prison guards were reasonably friendly.","signpost[0]":"protection","definition[2]":"the act or duty of protecting places or people, or of preventing prisoners from escaping","example[4]":"Gunmen stood guard at the camp entrance.","note[0]":"keep/stand guard (over somebody/something)","example[5]":"He was taken to hospital, where he is now under police guard.","note[1]":"be under (police/armed etc) guard","example[6]":"Who was on guard the night the fire broke out?","note[2]":"be on guard","signpost[1]":"soldiers","definition[3]":"a group of soldiers who guard someone or something","example[7]":"The president has called in the National Guard.","definition[4]":"a group of soldiers who protect the king or queen","signpost[2]":"equipment","definition[5]":"something that is used to protect someone or something from damage or injury","example[8]":"a face guard","example[9]":"a fire guard","signpost[3]":"on a train","definition[6]":"a person whose job is to be in charge of a train","signpost[4]":"fighting","definition[7]":"the position of holding your arms or hands up in a fight in order to defend yourself","example[10]":"He swung at me and I brought my guard up.","definition[8]":"one of two players on a basketball team who is responsible for moving the ball to help their team gain points","definition[9]":"one of two players on an American football team who plays either side of the centre","definition[10]":"to protect a person, place, or object by staying near them and watching them","example[11]":"The Sergeant told Swift to guard the entrance.","example[12]":"a lioness guarding her cubs","example[13]":"There is no one to guard these isolated farms against attack.","note[3]":"guard somebody/something against something","definition[11]":"to watch a prisoner to prevent them from escaping","definition[12]":"to protect something such as a right or a secret by preventing other people from taking it away, discovering it etc","example[14]":"chiefs who jealously guarded their independence","example[15]":"a closely guarded secret","definition[13]":"to prevent another sports player from gaining points, getting the ball etc"}