{"word[0]":"after","definition[0]":"when a particular event or time has happened, or when someone has done something","example[0]":"After the war many soldiers stayed in France.","example[1]":"I go swimming every day after work.","example[2]":"Do you believe in life after death?","example[3]":"The first attack started just after midnight.","example[4]":"David went to bed straight after (=immediately after) supper.","example[5]":"After you’d called the police, what did you do?","example[6]":"Zimmerman changed his name after he left Germany.","example[7]":"People still remember the 1958 revolution and what came after (=happened after it).","example[8]":"Ten years after he bought the painting, Carswell discovered that it was a fake.","note[0]":"two days/three weeks etc after (something)","example[9]":"His car was outside your house the morning after Bob’s engagement party.","note[1]":"the day/week/year etc after (something)","example[10]":"I’ll see you again tomorrow or the day after.","example[11]":"She retired from politics the year after she received the Nobel Prize.","example[12]":"Not long after the wedding, his wife became ill.","note[2]":"soon/not long/shortly after (something)","example[13]":"The family moved to Hardingham in June 1983, and Sarah’s first child was born soon after.","example[14]":"After leaving school, Mackay worked in a restaurant for a year.","note[3]":"after doing something","definition[1]":"when a particular amount of time has passed","example[15]":"After ten minutes remove the cake from the oven.","example[16]":"You’ll get used to it after a while.","example[17]":"After months of negotiation, an agreement was finally reached.","definition[2]":"following someone or something else in a list or a piece of writing, or in order of importance","example[18]":"Whose name is after yours on the list?","example[19]":"The date should be written after the address.","example[20]":"After football, tennis is my favourite sport.","example[21]":"The UK is the world’s third largest arms producer, after the USA and Russia.","definition[3]":"used when telling the time to say how many minutes have passed since a particular hour","example[22]":"The movie starts at a quarter  (=fifteen minutes) after seven.","definition[4]":"following someone in order to stop or speak to them","example[23]":"Go after him and apologize.","example[24]":"I heard someone running after me, and a voice called my name.","definition[5]":"in the direction of someone who has just left","example[25]":"‘Good luck, ’ she called after me as I left.","example[26]":"Harry stood in the doorway gazing after her.","definition[6]":"when someone has left a place or has finished doing something","example[27]":"Remember to close the door after you.","example[28]":"I spend all day cleaning up after the kids.","definition[7]":"because of something that happened earlier","example[29]":"I’m not surprised he walked out, after the way she treated him.","example[30]":"After your letter, I didn’t think I’d ever see you again.","definition[8]":"in spite of something that was done in the past","example[31]":"How can you treat me like this after all I’ve done for you?","definition[9]":"when you have passed a particular place or travelled a certain distance along a road","example[32]":"Turn left after the hotel.","example[33]":"After a mile you will come to a crossroads.","definition[10]":"used to say who or what first had the name that someone or something has been given","example[34]":"His name is Alessandro, after his grandfather.","example[35]":"It was named Waterloo Bridge, after the famous battle.","definition[11]":"in the same style as a particular painter, musician etc","example[36]":"a painting after Rembrandt","definition[12]":"used to say politely that someone else can use or do something before you do","example[37]":"‘Do you need the copier?’ ‘After you.’","definition[13]":"used to ask someone if you can have or use something after they have finished","example[38]":"After you with that knife, please.","definition[14]":"after something happens, or after a period of time has passed. After is used especially when talking about the past","example[39]":"We went for a walk after lunch.","example[40]":"After an hour, we got tired of waiting and went home.","example[41]":"They got married just after Christmas.","display[0]":"in","definition[15]":"after a particular period of time. In is used especially when talking about the future, especially the next few minutes, hours, days etc","example[42]":"The concert’s due to start in a few minutes.","example[43]":"I’ll come back in an hour.","example[44]":"In a few years’ time, this place will look completely different.","display[1]":"within","definition[16]":"after less than a month, two weeks etc has passed – used especially when the time seems surprisingly short","example[45]":"He developed a headache at lunchtime, and within two hours he was dead.","example[46]":"Within two days of arriving she had managed to upset everyone.","display[2]":"24 hours/a year etc from now","definition[17]":"at a time 24 hours, a year etc after now","example[47]":"A week from now we’ll be in Paris.","display[3]":"afterwards","definition[18]":"after an event or time you have mentioned","example[48]":"Jones admitted afterwards that she had been very nervous during the game.","example[49]":"Speaking to reporters afterward, he said the operation had been a success.","example[50]":"He moved to Belgium, and soon afterwards he met Angela.","display[4]":"later","definition[19]":"some time after now or after the time you are talking about","example[51]":"I’ll tell you about it later when I’m less busy.","example[52]":"James went off, and came back ten minutes later with some food.","display[5]":"subsequently","definition[20]":"after something had happened in the past","example[53]":"The book was published in 1954 and was subsequently translated into fifteen languages.","definition[21]":"in the back part of a boat or an aircraft","definition[22]":"coming or happening afterwards","opposite[0]":"pre-","example[54]":"an after-dinner speech","example[55]":"after-school activities"}