{"word[0]":"diary","plural[0]":"diaries","definition[0]":"a book in which you write down the things that happen to you each day","synonym[0]":"journal","note[0]":"diary entry (=what you have written for a particular day)","example[0]":"Inge kept a diary (=wrote in a diary) during the war years.","definition[1]":"a book with separate spaces for each day of the year, in which you write down the meetings, events etc that are planned for each day","example[1]":"Did you put the meeting date in your diary?","collocation[0]":"keep/write a diary","example[2]":"While I was travelling, I kept a diary every day.","collocation[1]":"write (something) in your diary","example[3]":"‘Severe weather’, he wrote in his diary that day.","collocation[2]":"record something in your diary","example[4]":"James Alvin recorded the incident in his diary.","collocation[3]":"read a diary","example[5]":"I wish you’d let me read your diary.","form[0]":"ADJECTIVES/NOUN + diary","collocation[4]":"a detailed diary","example[6]":"For years she had kept a detailed diary.","collocation[5]":"a personal/private diary","example[7]":"She later agreed to the publication of parts of her personal diary.","collocation[6]":"a secret diary","example[8]":"He found his sister’s secret diary.","collocation[7]":"a daily/weekly diary","example[9]":"Clarke kept a daily diary of San Franciscan life.","collocation[8]":"a travel diary","example[10]":"His travel diary makes fascinating reading.","form[1]":"diary + NOUN","collocation[9]":"a diary entry/entry in a diary","example[11]":"His last diary entry was on June 14th.","definition[2]":"a book in which you write down the things that happen to you each day, and your private thoughts","example[12]":"I decided to keep a diary of our trip to Toronto.","example[13]":"You shouldn’t read anyone’s private diary.","example[14]":"On February 3rd, he wrote the last entry in his diary.","definition[3]":"a diary, especially one written by a famous or important person","example[15]":"In the 1837 journal, Darwin gives an account of his voyage to South America.","example[16]":"Her book draws on letters, diaries, journals and historical sources.","display[0]":"memoirs","definition[4]":"a written record of the important events and people in your life which you write in order to publish – especially one that is written by a famous or important person such as a politician or a military leader","example[17]":"A lot of politicians think about writing their memoirs.","example[18]":"The book was titled ‘The Memoirs of a President’.","display[1]":"blog","definition[5]":"a diary that someone puts on a website, which is a record of their activities, experiences, and opinions, with the latest information always at the top. On some blogs, readers can leave comments","example[19]":"I try to keep a regular online blog.","example[20]":"I came across a great post on a blog I read recently.","display[2]":"log/log book","definition[6]":"an official record of events, especially on a journey in a ship or plane","example[21]":"the ship’s log","example[22]":"The captain had made a few notes in the log book.","definition[7]":"a record of events that have happened, or a book containing these","example[23]":"The bills in this case showed the attorney’s diary entries and descriptions of the work done.","definition[8]":"a book or computer software with marked spaces for separate days of the year where you write down the meetings, events etc which are planned for each day","example[24]":"Did you put the meeting in your diary?","example[25]":"A full diary of engagements has been booked for the months ahead."}