{"word[0]":"complicated","definition[0]":"difficult to understand or deal with, because many parts or details are involved","synonym[0]":"complex","example[0]":"a complicated voting system","example[1]":"For young children, getting dressed is a complicated business.","example[2]":"Mental illness is a very complicated subject.","note[0]":"very/extremely/immensely/highly etc complicated","explanation[0]":"In written English, people often use complex rather than complicated, because it sounds more formal:","example[3]":"The problem is very complex.","definition[1]":"consisting of many closely connected parts","example[4]":"a complicated pattern","example[5]":"The human brain is an incredibly complicated organ.","definition[2]":"consisting of a lot of different parts or details and therefore difficult to understand","example[6]":"The rules of the game seemed very complicated.","example[7]":"I didn’t realize programming the VCR would be so complicated.","example[8]":"The brain is like a very powerful, very complicated computer.","example[9]":"a complicated issue","definition[3]":"a complex process, relationship etc is difficult to understand because it has a lot of parts that are all connected in different ways","example[10]":"The chemical processes involved are extremely complex.","example[11]":"the complex relationship between government and the media","display[0]":"elaborate","definition[4]":"having a lot of parts or details and very carefully planned, but often more complicated than is necessary","example[12]":"Mike had worked out an elaborate system for categorizing his collection of DVDs.","example[13]":"The plan to kidnap her had become even more elaborate.","example[14]":"Sociologists have been coming up with increasingly elaborate theories to explain unsafe sexual practices.","display[1]":"involved","definition[5]":"very long and complicated – use this especially about something that you think should be made simpler","example[15]":"The system for choosing candidates is very involved, and I won’t go into it here.","example[16]":"Adopting a child can be a long involved process.","display[2]":"convoluted","definition[6]":"too complicated and difficult to understand – used especially about someone’s language or arguments, or about a system","example[17]":"convoluted sentences","example[18]":"Procedures for government funding have become more convoluted.","example[19]":"James’s books are full of long paragraphs and convoluted sentences, which many people do not find appealing.","display[3]":"intricate","definition[7]":"having a lot of small parts or details – used especially about something that is cleverly designed or made","example[20]":"Lasers are used to cut intricate designs in the metal.","example[21]":"The farmers use an intricate system of drainage canals.","example[22]":"the intricate workings of a watch","example[23]":"intricate patterns of coloured marble"}