{"word[0]":"knot","signpost[0]":"string/rope etc","definition[0]":"a part where one or more pieces of string, rope, cloth etc have been tied or twisted together","example[0]":"Are you any good at tying knots?","example[1]":"Thread the string through the hoop and tie it in a knot.","definition[1]":"a part where hair, a thread etc has become accidentally twisted together","example[2]":"I can’t get the knots out of my hair.","example[3]":"There’s a knot in my shoelace.","note[0]":"knot in","signpost[1]":"hair style","definition[2]":"a hair style in which your hair is arranged in a tight round shape on top of your head","signpost[2]":"wood","definition[3]":"a hard round place in a piece of wood where a branch once joined the tree","signpost[3]":"ship’s or aircraft's speed","definition[4]":"a unit for measuring the speed of ships and aircraft, equal to about 1,853 metres per hour","definition[5]":"a small group of people standing close together","example[4]":"Knots of delegates stood around outside the conference centre.","note[1]":"knot of","definition[6]":"a tight uncomfortable feeling caused by a strong emotion such as fear or anger","example[5]":"Her stomach was in knots.","example[6]":"a knot of anxiety in her stomach","signpost[4]":"hard mass","definition[7]":"a tight painful place in a muscle","heading[0]":"– Meaning 1a:","collocation[0]":"tie a knot","example[7]":"My uncle taught me how to tie knots.","collocation[1]":"untie/undo a knot","example[8]":"He tried to untie the knot in the rope around his ankles.","collocation[2]":"loosen a knot","example[9]":"Mr Benson loosened the knot in his tie.","collocation[3]":"tight","example[10]":"The knot in my shoelaces is really tight.","collocation[4]":"loose","example[11]":"She tied the belt in a loose knot around her waist.","definition[8]":"to tie together two ends or pieces of string, rope, cloth etc","example[12]":"A pretty scarf was loosely knotted around her neck.","definition[9]":"if hair, a thread etc knots, it becomes twisted together","definition[10]":"if a muscle or other part of your body knots, or is knotted, it feels tight and uncomfortable","example[13]":"Fear and anxiety knotted her stomach.","definition[11]":"if two companies tie the knot, they join and become one company","synonym[0]":"MERGE","example[14]":"Banks across the country tied the knot as a way to cut costs and boost earnings.","definition[12]":"a measurement of the speed at which ships travel, equal to about 1,853 metres an hour"}