{"word[0]":"violent","definition[0]":"involving actions that are intended to injure or kill people, by hitting them, shooting them etc","example[0]":"the increase in violent crime","example[1]":"violent clashes between the police and demonstrators","example[2]":"Thirty-one people have been injured in violent incidents throughout the day.","example[3]":"The riots ended in the violent deaths of three teenagers.","definition[1]":"someone who is violent is likely to attack, hurt, or kill other people","synonym[0]":"aggressive","example[4]":"My father was a violent and dangerous man.","example[5]":"He had a reputation for turning violent (=suddenly attacking people).","definition[2]":"showing very strong angry emotions or opinions","example[6]":"They had a violent quarrel and John stormed out.","note[0]":"violent quarrel/argument/row etc","definition[3]":"violent feelings are strong and very difficult to control","example[7]":"They took a violent dislike to each other.","example[8]":"She has a violent temper.","definition[4]":"extremely bright","example[9]":"Her cheeks turned a violent red colour.","collocation[0]":"a violent crime","example[10]":"He has a number of convictions for violent crime.","collocation[1]":"a violent attack","example[11]":"Blacks were more often victims of violent attacks than other ethnic groups.","collocation[2]":"a violent death","example[12]":"No French king died a violent death during this period.","collocation[3]":"a violent clash","example[13]":"There were violent clashes between police and protesters.","collocation[4]":"a violent incident","example[14]":"Violent incidents such as kidnapping dropped sharply last year.","collocation[5]":"violent acts/behaviour","example[15]":"His dad terrified them all with his violent behaviour.","collocation[6]":"a violent protest/demonstration","example[16]":"This incident sparked violent demonstrations outside the airbase.","collocation[7]":"very/extremely violent","example[17]":"an extremely violent attack","collocation[8]":"increasingly violent","example[18]":"Over the past year, his behavior has become increasingly violent.","definition[5]":"using force to hurt or kill people – used about people, crimes etc. Also used about films or books that contain a lot of violence","example[19]":"a violent man who couldn’t control his temper","example[20]":"The film is too violent to be shown to children.","display[0]":"vicious","definition[6]":"violent and dangerous, and seeming to enjoy hurting people for no reason","example[21]":"a vicious attack on an unarmed man","example[22]":"We were surrounded by a gang of vicious thugs, armed with knives.","definition[7]":"using force or violence, but not causing serious injury","example[23]":"Some of the boys were being a bit rough with the younger kids.","example[24]":"There were complaints about rough treatment by the police.","display[1]":"brutal","definition[8]":"behaving in a way that is very cruel and violent, and showing no pity","example[25]":"Idi Amin was a brutal dictator.","example[26]":"a particularly brutal murder","example[27]":"The prison guards were brutal and corrupt.","display[2]":"savage","definition[9]":"attacking people in a particularly cruel way – used about people and fighting, especially in news reports","example[28]":"a savage killer","example[29]":"There was savage fighting in the capital Mogadishu.","display[3]":"bloody","definition[10]":"a bloody battle or war is very violent and a lot of people are killed or injured","example[30]":"a bloody civil war","example[31]":"The Russians were engaged in a bloody battle against the German army.","display[4]":"ferocious","definition[11]":"a ferocious attack or battle is extremely violent. Also used about animals that are likely to attack in a very violent way","example[32]":"The two armies fought a ferocious battle.","example[33]":"a ferocious beast","example[34]":"It was the most ferocious attack I have ever seen.","display[5]":"fierce","definition[12]":"a fierce animal or person looks frightening and likely to attack people","example[35]":"A fierce dog stood growling at the gate.","example[36]":"Bears are always fierce when they have young.","example[37]":"fierce bodyguards","display[6]":"bloodthirsty","definition[13]":"a bloodthirsty person enjoys watching violence. A bloodthirsty story contains a lot of violent scenes","example[38]":"In Mexico, humans were sacrificed to bloodthirsty gods.","example[39]":"a bloodthirsty tale of revenge","display[7]":"gory","definition[14]":"showing or describing injuries, blood, death etc clearly and in detail","example[40]":"a gory horror movie","example[41]":"The book was too gory for many readers."}