{"word[0]":"confident","definition[0]":"sure that something will happen in the way that you want or expect","example[0]":"We are confident next year’s profits will be higher.","note[0]":"confident (that)","example[1]":"He is quietly confident that there will be no problems this time.","example[2]":"The Prime Minister appeared relaxed and confident of winning an overall majority.","note[1]":"confident of","example[3]":"The company is confident of success.","example[4]":"I feel quite confident about the future.","note[2]":"confident about","definition[1]":"sure that you have the ability to do things well or deal with situations successfully","example[5]":"Despite her disability, Philippa is very confident.","example[6]":"He began to read in a calm confident voice.","note[3]":"confident smile/voice/manner etc","example[7]":"I feel much more confident about myself and my abilities these days.","definition[2]":"sure that something is true","example[8]":"It is not possible to give a confident answer to the question of whether the delay was unreasonable.","example[9]":"We are confident we have done nothing wrong.","example[10]":"He began to feel confident that Zaborski was only guessing.","heading[0]":"GRAMMAR: Patterns with confident","explanation[0]":"You are confident about something","example[11]":"I’m quite confident about my English","bad_example[0]":"I’m quite confident of my English","explanation[1]":"You are confident of victory or success, or confident of doing something","example[12]":"The team is confident of victory","example[13]":"The team is confident of winning","definition[3]":"sure that you have the ability to do something well or deal with situations successfully","example[14]":"She seemed confident that she would pass.","example[15]":"his calm and confident manner","example[16]":"George was very confident about his abilities as a writer.","example[17]":"Baldwin is confident of victory in this year’s senate race.","display[0]":"self-confident/self-assured","definition[4]":"confident, and not shy or nervous in social situations","example[18]":"Jess was only 12, but she was very self-confident.","example[19]":"He was very self-assured and spoke without notes.","example[20]":"I eventually became more self-confident as a public speaker.","example[21]":"She was supremely self-confident, with the gift of being able to talk on any subject whenever the camera was rolling.","display[1]":"self-possessed","definition[5]":"confident, calm, and in control of your feelings even in a difficult situation","display[2]":"assertive","definition[6]":"confident enough to say what you think and want, so that people take notice of you","example[22]":"The course helps women learn how to be more assertive in the workplace.","display[3]":"sure of yourself","definition[7]":"confident that you are right, even when other people do not agree with you","example[23]":"He sounded so sure of himself that I didn’t bother to argue.","example[24]":"Jenny was younger than her sister but seemed much more sure of herself.","display[4]":"extrovert","definition[8]":"someone who behaves in a confident way in social situations and likes talking and being with other people","example[25]":"Most actors are natural extroverts.","example[26]":"Jan says her twin babies are completely different: Kelly is a real extrovert while Jessie is quiet and thoughtful.","example[27]":"He’s a total extrovert who will talk to any stranger.","heading[1]":"not confident","display[5]":"lack confidence/be lacking in confidence","definition[9]":"to not be confident about your abilities or appearance","example[28]":"Francine is lacking in confidence and needs a lot of encouragement.","example[29]":"I was fat, had no friends, and lacked confidence.","example[30]":"While girls lack confidence, boys often overestimate their abilities.","display[6]":"shy","definition[10]":"not confident about meeting or speaking to people who you do not know","example[31]":"Jane is a quiet shy person.","example[32]":"He had been painfully shy (=very shy) as a child.","display[7]":"insecure","definition[11]":"not confident about yourself or your relationships, especially because you are worried that you are not good enough","example[33]":"His childhood had left him very insecure.","example[34]":"Ben’s parents’ divorce left him lonely and insecure.","example[35]":"Models can make young women feel insecure about their own bodies.","display[8]":"unsure of yourself","definition[12]":"not confident, especially because you are young or you do not have much experience","example[36]":"At first, Chris seemed nervous and unsure of herself.","example[37]":"He was only 21 and still very unsure of himself with girls.","display[9]":"discouraged","definition[13]":"not confident that you can succeed, because you have had problems trying to do something","example[38]":"Students can become discouraged very easily if they are not given the help they need.","example[39]":"I was very discouraged at the time, but I still hoped we could find a solution.","example[40]":"Discouraged by her failed marriages, she gradually withdrew from the world.","example[41]":"Hartman was so discouraged about the way his performing career was going, that he gave up acting for writing.","display[10]":"demoralized","definition[14]":"someone who is demoralized has lost all their confidence and wants to give up","example[42]":"The team were completely demoralized after losing a series of games.","example[43]":"a demoralized work force","example[44]":"Many employees became demoralized and cynical when the company announced another round of job cuts."}