{"word[0]":"objection","definition[0]":"a reason that you have for opposing or disapproving of something, or something you say that expresses this","example[0]":"Her objection was that he was too young.","example[1]":"He had moral objections to killing animals for food.","note[0]":"objection to","example[2]":"The bill was passed over the objections of many Democrats.","note[1]":"over the objections of somebody","collocation[0]":"have an objection","example[3]":"Does anyone have any objections to the proposal?","collocation[1]":"make an objection","example[4]":"The Parish Council made several objections to the changes.","collocation[2]":"raise/voice an objection","example[5]":"His father raised no objections when John told him that he wanted to become a dancer.","collocation[3]":"meet somebody’s objections","example[6]":"He altered the plans to meet the objections of community leaders.","collocation[4]":"withdraw an objection","example[7]":"The FBI withdrew its objections to publishing the information.","collocation[5]":"lodge an objection","example[8]":"Residents have lodged an objection to the new development.","collocation[6]":"a strong objection","example[9]":"Parents at the school have voiced strong objections to the closure.","collocation[7]":"a serious/major objection","example[10]":"There were serious objections to using the videotaped evidence at the trial.","collocation[8]":"the main objection","example[11]":"One of the main objections was that classes were being taught by untrained staff.","collocation[9]":"a fundamental objection","example[12]":"A fundamental objection is that the church should not be part of the government.","collocation[10]":"a moral objection","example[13]":"He has expressed moral objections to this type of research.","collocation[11]":"a religious objection","example[14]":"Roman Catholics have religious objections to the use of contraceptives.","collocation[12]":"(a) conscientious objection","example[15]":"Conscientious objection to military service is seen by the United Nations as part of your right to freedom of thought.","definition[1]":"said by lawyers to a judge in a court when they think that what another lawyer has just said should not be allowed"}