{"word[0]":"doubt","definition[0]":"a feeling of being not sure whether something is true or right","example[0]":"There was still one little nagging doubt at the back of his mind.","example[1]":"There’s no doubt that he was a major artist.","example[2]":"The incident raises doubts about the safety of nuclear power.","note[0]":"doubt about","example[3]":"Some government ministers had serious doubts as to whether the policy would work.","note[1]":"doubt as to","collocation[0]":"have doubts","example[4]":"Scientists still have some doubts about the theory.","collocation[1]":"have your doubts","example[5]":"Everyone else thinks it’s a good idea, but I have my doubts.","collocation[2]":"have no/little doubt","example[6]":"I have no doubt that you are right.","collocation[3]":"be in no/any doubt about something","example[7]":"The government is in no doubt about the seriousness of the situation.","collocation[4]":"leave no/little doubt (that)","example[8]":"The evidence left no doubt that he was the murderer.","collocation[5]":"cast/throw doubt on something","example[9]":"Research has cast doubt on the safety of mobile phones.","collocation[6]":"raise doubts about something","example[10]":"His handling of the matter has raised doubts about his competence.","collocation[7]":"call/throw something into doubt","example[11]":"The accuracy of his account was called into doubt.","collocation[8]":"express/voice doubts","example[12]":"Many people expressed doubts about the necessity of the war.","collocation[9]":"serious/grave doubts","example[13]":"They have some serious doubts as to his honesty.","collocation[10]":"considerable doubts","example[14]":"I had considerable doubts about accepting the job.","collocation[11]":"a lingering/nagging doubt","example[15]":"I still had a nagging doubt that there might be something seriously wrong.","collocation[12]":"there is no/little/some doubt","example[16]":"There is little doubt that he will play for England one day.","collocation[13]":"without a shadow of a doubt","example[17]":"I knew without a shadow of a doubt that I was going to win.","collocation[14]":"an element of doubt","example[18]":"There’s an element of doubt about his true age as he doesn’t have a birth certificate.","collocation[15]":"not the slightest doubt","example[19]":"There’s not the slightest doubt in my mind about it.","definition[1]":"to think that something may not be true or that it is unlikely","example[20]":"Kim never doubted his story.","example[21]":"‘Do you think there’ll be any tickets left?’ ‘I doubt it (=I don’t think so).’","example[22]":"I doubt we’ll ever see him again.","note[2]":"doubt (that)","example[23]":"You can complain, but I doubt if it’ll make any difference.","note[3]":"doubt if/whether","definition[2]":"to not trust or have confidence in someone","example[24]":"I never doubted myself. I always knew I could play tennis at this level.","example[25]":"She loved him, and had never doubted him.","example[26]":"I have no reason to doubt his word (=think that he is lying).","explanation[0]":"You doubt whether someone can do something","example[27]":"I doubt whether we can afford a new car","example[28]":"She doubted whether she could trust him again","explanation[1]":"You doubt whether something will happen","example[29]":"I doubt whether the plan will work ","example[30]":"He doubted whether this would happen ","explanation[2]":"doubt if with the same meaning as doubt whether","example[31]":"I doubt if we can afford a new car","example[32]":"I doubt if the plan will work","explanation[3]":"doubt that","example[33]":"I doubt that we can afford a new car","example[34]":"I doubt that the plan will work","explanation[4]":"The verb doubt is not usually used in the progressive You say","example[35]":"I doubt he’ll come to the party","bad_example[0]":"I am doubting he’ll come to the party","example[36]":"‘Do you think she really is eighteen?’ ‘I doubt it.’","example[37]":"There was so much noise that I doubt if anyone slept.","display[0]":"be doubtful/dubious","definition[3]":"to doubt that something will happen, is true, or is a good idea","example[38]":"Economists are doubtful that the situation will improve this year.","example[39]":"‘You can eat the whole fish including the head.’ Janey looked dubious.","example[40]":"When my husband suggested emigrating, I was dubious at first.","example[41]":"Mum looked doubtful when I suggested having a party for all my friends.","display[1]":"have reservations","definition[4]":"to feel that a plan or idea may not be good because you think there may be some problems with it","example[42]":"Health care professionals had reservations about giving both vaccines together.","display[2]":"have misgivings","definition[5]":"to feel worried about doing something, because it may have a bad result","example[43]":"Ralph had serious misgivings about changing his career at the age of 50.","display[3]":"have mixed feelings","definition[6]":"to be unsure exactly how you feel about something or someone because there are both good and bad things about them","example[44]":"I have very mixed feelings about moving house – it’s exciting but I’ll miss this area.","display[4]":"have second thoughts","definition[7]":"to start having doubts about whether a decision you have just made is the right one","example[45]":"I liked the dress in the shop, but when I got it home I had second thoughts."}