{"word[0]":"relax","signpost[0]":"rest","definition[0]":"to rest or do something that is enjoyable, especially after you have been working","example[0]":"I just want to sit down and relax.","example[1]":"What Robyn needed was a drink to relax her.","example[2]":"A hot bath should help to relax you.","signpost[1]":"become calm","definition[1]":"to become quiet and calm after you have been upset or nervous, or to make someone do this","example[3]":"Once out of danger, he started to relax.","example[4]":"Relax! Everything’s fine.","signpost[2]":"muscle","definition[2]":"if you relax a part of your body or it relaxes, it becomes less stiff or less tight","example[5]":"Gentle exercise can relax stiff shoulder muscles.","signpost[3]":"rules/laws","definition[3]":"to make a rule or law less strict","example[6]":"Hughes believes that immigration controls should not be relaxed.","note[0]":"relax rules/regulations/controls","definition[4]":"to rest or do something that is enjoyable after you have been working","example[7]":"In the evenings, I like to relax with some music and a nice meal.","example[8]":"In two weeks’ time I’ll be relaxing on a beach in Greece.","definition[5]":"to stop working or stop being active, and sit down or lie down so that you become less tired","example[9]":"If you’re tired, we’ll stop and rest for a while.","example[10]":"The doctor told me to take some time off work and try to rest.","display[0]":"unwind","definition[6]":"to gradually relax after you have been working hard or feeling anxious","example[11]":"It had been a bad day and he just wanted to get home and unwind.","example[12]":"Set in spectacular countryside, the Shiga Hotel is the perfect place to unwind.","display[1]":"take it/things easy","definition[7]":"to relax and not do very much, especially after working very hard or being ill","example[13]":"Now that you’ve finished your exams, you can take it easy.","example[14]":"The doctor said he’ll have to take things easy for while.","display[2]":"put your feet up","definition[8]":"to rest for a short time after a tiring activity, especially by sitting with your feet resting on something","example[15]":"Kate poured herself a drink and put her feet up.","example[16]":"When you’re pregnant and doing a full-time job, you must find time to put your feet up.","display[3]":"chill out/chill","definition[9]":"to relax completely, or stop worrying and getting annoyed about things – used mainly by young people","example[17]":"We spent the day chilling out by the pool.","example[18]":"Hey dude, chill out! It’s only a car!","example[19]":"It’s a great place to chill out.","example[20]":"Let’s go back to my place and chill.","display[4]":"loosen up","definition[10]":"to become more relaxed and stop worrying about things","example[21]":"I keep telling Mum that she needs to loosen up a bit.","example[22]":"Tom had had a few drinks and was beginning to loosen up.","display[5]":"put somebody at ease/make somebody feel at ease","definition[11]":"to make someone feel relaxed, especially in a situation in which they might feel a little nervous","example[23]":"A good interviewer will try to make you feel at ease.","example[24]":"His friendly manner always puts people at their ease.","definition[12]":"to make rules etc less strict","example[25]":"The country decided to relax its rules on the foreign ownership of its airlines.","example[26]":"Many employers are taking steps toward relaxed dress codes (=being allowed to dress informally at work) ."}