{"signpost[0]":"painting/drawing","definition[0]":"shapes, lines etc painted or drawn on a surface, showing what someone or something looks like","example[0]":"The room had several pictures on the walls.","example[1]":"a book with pictures in it","example[2]":"Draw a picture of your house.","note[0]":"draw/paint a/somebody’s picture","example[3]":"He asked her permission to paint her picture  (=paint a picture of her).","example[4]":"I like that picture of the two horses.","note[1]":"picture of","definition[1]":"a photograph","example[5]":"I asked the waiter if he’d mind taking our picture.","note[2]":"take somebody’s picture/take a picture of somebody","example[6]":"Would you like to see the wedding pictures?","note[3]":"wedding/holiday etc pictures","example[7]":"That’s a great picture of you, Dad!","signpost[1]":"television","definition[2]":"an image that appears on a television or cinema screen","example[8]":"satellite pictures from space","example[9]":"upsetting pictures of the famine in Africa","signpost[2]":"description/idea","definition[3]":"a description or idea of what something is like","example[10]":"The description in the guidebook showed rather a rosy picture (=one that makes you think that something is better than it really is).","example[11]":"I now have a vivid picture (=very clear picture) in my mind.","example[12]":"The book gives you a good picture of what life was like in Japan in the early 19th century.","example[13]":"The article paints a rather bleak picture of the future of our planet.","example[14]":"Detectives are trying to build up a picture of the kidnapper.","signpost[3]":"situation","definition[4]":"the general situation in a place, organization etc","example[15]":"The worldwide picture for tribal people remains grim.","example[16]":"the wider political picture","example[17]":"Checks throughout the region revealed a similar picture everywhere.","example[18]":"We were so caught up with the details, we lost sight of the big picture  (=the situation considered as a whole).","note[4]":"big/bigger/wider picture","signpost[4]":"mental image","definition[5]":"an image or memory that you have in your mind","example[19]":"Sarah had a mental picture of Lisbon.","example[20]":"He had a vivid picture in his mind.","definition[6]":"a film","example[21]":"It was voted the year’s best picture.","definition[7]":"the cinema","example[22]":"Would you like to go to the pictures?","heading[0]":"– Meaning 1: shapes, lines etc painted or drawn on a surface, showing what someone or something looks like","collocation[0]":"draw/paint a picture","example[23]":"She drew a picture of a mushroom on the blackboard.","collocation[1]":"do a picture of somebody/something","example[24]":"He’s done a picture of a monster.","collocation[2]":"a picture hangs somewhere","example[25]":"Three pictures hung on the wall over his bed.","collocation[3]":"a picture shows something","example[26]":"The picture shows two women leaning down towards a third.","collocation[4]":"a picture is of somebody/something","example[27]":"There's a picture of his wife above the fireplace.","heading[1]":"– Meaning 4: a description or idea of what something is like","collocation[5]":"a clear/good picture","example[28]":"He still didn’t have a clear picture of what had happened.","collocation[6]":"a vivid picture","example[29]":"Their diaries give us a vivid picture of their lives at the time.","collocation[7]":"an accurate/true picture","example[30]":"Our aim is to build an accurate picture of the needs of disabled people.","collocation[8]":"a distorted/misleading picture","example[31]":"The media coverage left many people with a distorted picture.","example[32]":"These figures give a misleading picture of the company’s financial health.","collocation[9]":"a detailed picture","example[33]":"We now have a detailed picture of the bird’s habits.","collocation[10]":"a complete/full picture","example[34]":"By asking these questions, I was able to get a more complete picture.","collocation[11]":"an overall/general picture","example[35]":"The study is intended to provide an overall picture of political activity in the nation.","collocation[12]":"a bleak/gloomy/grim picture","example[36]":"The report paints a bleak picture of the economy.","collocation[13]":"a rosy picture","example[37]":"That figure paints a misleadingly rosy picture.","collocation[14]":"have a picture","example[38]":"I've never been there, but I have a picture of it in my mind.","collocation[15]":"a picture emerges","example[39]":"No clear picture emerges from the studies.","collocation[16]":"get a picture","example[40]":"Scientists have been trying to get a better picture of how the drug works.","collocation[17]":"build up/form a picture","example[41]":"Detectives are still trying to build up a picture of what happened.","collocation[18]":"give/provide a picture","example[42]":"Her book gives us an interesting picture of ordinary people’s homes at the time.","collocation[19]":"present a picture","example[43]":"Newspapers tend to present a grim picture of what's going on in the world.","collocation[20]":"paint a picture","example[44]":"The latest survey paints a grim picture.","definition[8]":"shapes, lines etc painted or drawn on a surface, especially as a piece of art, and often showing what someone or something looks like","example[45]":"a picture of a horse","example[46]":"He painted the picture in 1890, just before he died.","display[0]":"drawing","definition[9]":"a picture drawn with a pencil, pen etc","example[47]":"We had to do a drawing of a sunflower.","display[1]":"sketch","definition[10]":"a picture that is drawn quickly","example[48]":"I made a quick sketch of the kind of room we wanted.","display[2]":"painting","definition[11]":"a picture made using paint","example[49]":"The painting now hangs in the Museum of Modern Art.","example[50]":"Picasso did several paintings of her.","display[3]":"portrait","definition[12]":"a picture of a person","example[51]":"The portrait was painted by Rembrandt.","display[4]":"landscape","definition[13]":"a picture of a place, especially in the countryside or the mountains","example[52]":"Constable painted mainly landscapes.","display[5]":"cartoon","definition[14]":"a funny drawing in a newspaper or magazine that tells a story or a joke","example[53]":"A cartoon in the New York Times showed the president talking to Osama Bin Laden.","display[6]":"comic strip","definition[15]":"a series of pictures drawn inside boxes that tell a story","example[54]":"Charles Schultz was famous for his cartoon strip about Snoopy and Charlie Brown.","display[7]":"caricature","definition[16]":"a funny drawing of someone that makes a part of someone’s face or body look bigger, worse etc than it really is, especially in a funny way","example[55]":"He is famous for his caricatures of politicians.","display[8]":"illustration","definition[17]":"a picture in a book","example[56]":"The book has over 100 pages of illustrations, most of them in colour.","display[9]":"poster","definition[18]":"a large picture printed on paper that you stick to a wall as decoration","example[57]":"old movie posters","example[58]":"There were lots of posters of pop bands on her bedroom wall.","display[10]":"print","definition[19]":"a picture that is usually produced on a printing press, and is one of a series of copies of the same picture","example[59]":"a limited edition of lithographic prints by John Lennon","display[11]":"image","definition[20]":"a picture – used especially when talking about what the picture is like, or the effect it has on you","example[60]":"He produced some memorable images.","example[61]":"a beautiful image","example[62]":"Some of the images are deeply disturbing.","display[12]":"artwork","definition[21]":"pictures or photographs, especially ones that have been produced to be used in a book or magazine","example[63]":"We are still waiting for the artwork to come back from the printers.","definition[22]":"to imagine something by making an image in your mind","example[64]":"Tom, picturing the scene, smiled.","example[65]":"Rob had pictured her as serious, but she wasn’t like that.","note[5]":"picture somebody/something as something","example[66]":"I can’t picture him skiing. He’s so clumsy!","note[6]":"picture somebody doing something","example[67]":"Picture what it would be like after a nuclear attack.","note[7]":"picture what/how","definition[23]":"to show someone or something in a photograph, painting, or drawing","example[68]":"She is pictured with her mum Christine and sister Kelly.","explanation[0]":"Picture is usually passive in this meaning","definition[24]":"to describe something in a particular way","example[69]":"She’s been pictured as a difficult, demanding woman.","note[8]":"be pictured as something"}