{"word[0]":"pace","signpost[0]":"speed of events/changes","definition[0]":"the speed at which something happens or is done","example[0]":"The pace of change in our lives is becoming faster and faster.","note[0]":"pace of","example[1]":"Public spending continues to rise at a steady pace.","note[1]":"at a steady/slow etc pace","signpost[1]":"walk/run","definition[1]":"the speed at which someone walks, runs, or moves","example[2]":"Lucy set off at a leisurely pace back to the hotel.","note[2]":"at a slow/leisurely/brisk etc pace","example[3]":"He quickened his pace, longing to be home.","example[4]":"Traffic slowed to a walking pace.","example[5]":"You need to step up the pace of your exercises.","definition[2]":"a single step when you are running or walking, or the distance you move in one step","example[6]":"Rebecca walked a few paces behind her mum.","example[7]":"He took a pace towards the door.","note[3]":"pace backwards/towards/forwards etc","form[0]":"ADJECTIVES/NOUN + pace","collocation[0]":"rapid/fast","example[8]":"The rapid pace of change creates uncertainty.","collocation[1]":"slow","example[9]":"The pace of life in the countryside is slower.","collocation[2]":"a steady pace","example[10]":"The economy was growing at a slow but steady pace.","collocation[3]":"at your own pace","example[11]":"This allows each child to learn at his or her own pace.","collocation[4]":"at a snail’s pace","example[12]":"Reform is proceeding at a snail’s pace.","collocation[5]":"a breakneck pace","example[13]":"Singapore prospered and modernized at a breakneck pace.","collocation[6]":"a hectic/frantic pace","example[14]":"We worked at a hectic pace.","collocation[7]":"the pace quickens/accelerates","example[15]":"The pace of change is quickening.","collocation[8]":"the pace slows/slackens","example[16]":"After a surge in exports, the pace slackened considerably the following year.","collocation[9]":"gather pace","example[17]":"Support for the campaign is gathering pace.","collocation[10]":"keep up the pace","example[18]":"China's society is transforming but can it keep up the pace?","collocation[11]":"keep up with the pace","example[19]":"It’s essential that we constantly update our skills and keep up with the pace of change.","collocation[12]":"the pace of change","example[20]":"The pace of change accelerated dramatically in the early 1980s.","collocation[13]":"the pace of life","example[21]":"Here, the sun shines every day and the pace of life is slower.","collocation[14]":"the pace of development","example[22]":"The pace of development in computer graphics is amazing.","collocation[15]":"the pace of reform","example[23]":"Some senior party figures favor a slower pace of reform.","definition[3]":"to walk first in one direction and then in another many times, especially because you are nervous","example[24]":"I found Mark at the hospital, pacing restlessly up and down.","example[25]":"Sam stood up and paced the floor, deep in thought.","note[4]":"pace the floor/room","definition[4]":"to measure a distance by walking across it with steps of equal length","example[26]":"The director paced out the length of the stage.","definition[5]":"the rate or speed at which something happens","example[27]":"The average price of a new car began to soar at a faster pace than household incomes.","definition[6]":"to change at the same rate as someone or something else","example[28]":"Next year’s spending may not even keep pace with inflation.","example[29]":"Demand continues to keep pace, with shipments rising about 2.5%.","definition[7]":"to establish the speed at which your competitors try to do something, or the standard of quality they try to achieve","example[30]":"It continues to set the pace for all other local shopping complexes."}