{"word[0]":"principle","signpost[0]":"moral rule","definition[0]":"a moral rule or belief about what is right and wrong, that influences how you behave","example[0]":"Schools try to teach children a set of principles.","example[1]":"He’s got no principles at all!","example[2]":"It’s against my principles to accept gifts from clients.","signpost[1]":"idea behind something","definition[1]":"the basic idea that a plan or system is based on","example[3]":"The general principle is that education should be available to all children up to the age of 16.","example[4]":"He called for a return to first principles (=the most important ideas) of road safety for children.","example[5]":"Similar principles apply in the case of older children  (=the principles are the same as others that have been mentioned).","example[6]":"the basic principles of business management","note[0]":"basic/fundamental/guiding principle","example[7]":"the principles of French law","note[1]":"principle of","example[8]":"Reflexology is based on the principle that specific areas on the feet correspond to different parts of the body.","note[2]":"principle that","example[9]":"The project worked on the principle that each person’s experience was equally valuable.","note[3]":"on a principle","example[10]":"the principles behind government policies","note[4]":"principle behind","signpost[2]":"rules of a process","definition[2]":"a rule which explains the way something such as a machine works, or which explains a natural force in the universe","example[11]":"Archimedes’ principle","example[12]":"the basic principles of physics","heading[0]":"– Meaning 1: a moral rule or belief about what is right and wrong, that influences how you behave","collocation[0]":"strict principles","example[13]":"Rosa is a woman of strict moral principles.","collocation[1]":"strong principles","example[14]":"a man of strong principles","collocation[2]":"high principles","example[15]":"Dunn's high principles and pleasant manner won him the real affection of his colleagues.","collocation[3]":"moral principles","example[16]":"Criminal law should be used to protect and reinforce moral principles.","collocation[4]":"religious/political principles","example[17]":"Doesn’t working on Sunday conflict with your religious principles?","collocation[5]":"socialist principles","example[18]":"Would he stick to his socialist principles after being elected prime minister?","collocation[6]":"have principles","example[19]":"I may have no money and no power but I have principles.","collocation[7]":"stick to your principles","example[20]":"Throughout this time, he stuck to his principles and spoke out against injustice.","collocation[8]":"betray/compromise your principles","example[21]":"I knew I could lie to help him, but it would be betraying my principles.","collocation[9]":"abandon your principles","example[22]":"It has been said that he abandoned his basic political principles while he was in power.","collocation[10]":"be against somebody’s principles","example[23]":"It’s against my principles to eat meat.","collocation[11]":"as a matter of principle","example[24]":"As a matter of principle one should never yield to terrorism.","collocation[12]":"a man/woman of principle","example[25]":"He is the only candidate who has demonstrated that he is a man of principle.","heading[1]":"– Meaning 2: the basic idea that a plan or system is based on","collocation[13]":"a general/broad principle","example[26]":"He explained the general principles of the constitution.","collocation[14]":"an important principle","example[27]":"One important principle is that you should give yourself plenty of reward for your success.","collocation[15]":"a basic/fundamental principle","example[28]":"Applicants should show that they understand the basic principles of marketing.","collocation[16]":"a guiding principle","example[29]":"Fairness is the guiding principle.","collocation[17]":"first principles","example[30]":"The researchers went back to first principles.","collocation[18]":"be based on a principle","example[31]":"A good education ought to be based on multicultural principles.","collocation[19]":"a principle applies","example[32]":"The same principle applies to all kinds of selling.","collocation[20]":"the principle underlying something","example[33]":"What are the principles underlying this form of treatment?","collocation[21]":"establish a principle","example[34]":"Establish the principle that when your office door is shut you must not be disturbed.","collocation[22]":"lay down a principle","example[35]":"The report lays down general principles for the teaching of English.","definition[3]":"a moral rule or set of ideas that makes you behave in a particular way","example[36]":"The single European market works on market principles.","example[37]":"As a matter of principle (=a rule that is very important and that should not be broken), disabled people should have the right to work.","definition[4]":"a rule that explains how something works, or an idea that something is based on","example[38]":"The basic principle is that all information collected for one purpose is confidential.","example[39]":"The US market is built on the principle that a marketplace should be available to everyone.","example[40]":"accounting practice based on the accruals principle","definition[5]":"if something is possible in principle, there is no reason why it should not happen, but it has not actually happened yet","example[41]":"In principle, we pay all our freelance staff within one month.","definition[6]":"if something happens in principle, decisions, rules etc say that it should happen, even if in practice it does not always happen","example[42]":"In principle, a hostile takeover is possible, but we want to discourage it.","definition[7]":"if you agree to do something in principle, you agree in a general way to the idea or plan, without agreeing to any details","example[43]":"North and South Korea agreed in principle to link their separate air-traffic control systems."}