{"word[0]":"hazard","definition[0]":"something that may be dangerous, or cause accidents or problems","example[0]":"That pile of rubbish is a fire hazard  (=something that is likely to cause a fire).","example[1]":"the health hazard posed by lead in petrol","note[0]":"health/safety hazard","example[2]":"Polluted water sources are a hazard to wildlife.","note[1]":"hazard to/for","definition[1]":"a risk that cannot be avoided","example[3]":"the economic hazards of running a small farm","note[2]":"the hazards of something","example[4]":"Divorce seems to be an occupational hazard for politicians.","note[3]":"occupational hazard","form[0]":"ADJECTIVES/NOUN + hazard","collocation[0]":"a health hazard","example[5]":"The rubbish needs to be removed before it becomes a health hazard.","collocation[1]":"a fire hazard","example[6]":"The unoccupied building was declared a fire hazard.","collocation[2]":"a safety hazard","example[7]":"Protesters claim that the nuclear reactor is a safety hazard.","collocation[3]":"a traffic hazard","example[8]":"Cars parked in the wrong places can cause a traffic hazard.","collocation[4]":"a natural hazard","example[9]":"One of the most widespread natural hazards is flooding.","collocation[5]":"an environmental hazard","example[10]":"Oil from the tanker caused an environmental hazard.","collocation[6]":"a serious/major hazard","example[11]":"Lead pipes are a serious hazard to health.","collocation[7]":"a potential hazard","example[12]":"Microwave ovens are a potential hazard if not used properly.","collocation[8]":"cause/create a hazard","example[13]":"There was concern that overhead power lines could cause a health hazard.","collocation[9]":"pose a hazard","example[14]":"It was not known whether radiation from the weapons posed any hazard to soldiers.","collocation[10]":"eliminate a hazard","example[15]":"They took steps to eliminate all potential fire hazards.","collocation[11]":"reduce a hazard","example[16]":"He led the campaign to recognize and reduce the hazard from radiation in our environment.","definition[2]":"to say something that is only a suggestion or guess and that might not be correct","example[17]":"$50,000? I don’t know. I’m only hazarding a guess.","definition[3]":"to risk losing your money, property etc in an attempt to gain something","definition[4]":"something that may be dangerous, cause problems, accidents etc","example[18]":"There may be other workplaces with similar fire hazards.","example[19]":"We want to take waste away from places where it poses a health hazard.","example[20]":"The plant posed serious environmental hazards."}