{"word[0]":"social","signpost[0]":"society","definition[0]":"relating to human society and its organization, or the quality of people’s lives","example[0]":"social issues, such as unemployment and education","example[1]":"the country’s serious social problems","example[2]":"a challenge to the social order  (=how a particular society is organized)","signpost[1]":"rank","definition[1]":"relating to your position in society, according to your job, family, wealth etc","example[3]":"The students come from a variety of social classes  (=groups of people that have the same social position).","example[4]":"the social status of her family","signpost[2]":"meeting people","definition[2]":"relating to meeting people, forming relationships with them, and spending time with them","example[5]":"social interaction","example[6]":"a club with lots of social events","example[7]":"Exercise classes are a good way to keep fit and improve your social life.","example[8]":"Group play helps children develop social skills  (=ability to deal with people easily).","example[9]":"He lacked social graces  (=good and polite behaviour towards other people).","definition[3]":"someone who is social enjoys meeting and talking to other people","synonym[0]":"sociable","definition[4]":"forming groups or living together in their natural state","opposite[0]":"solitary","example[10]":"Elephants are social animals.","heading[0]":"– Meaning 3: relating to meeting people, forming relationships with them, and spending time with them","collocation[0]":"somebody's social life","example[11]":"Teenagers enjoy an active social life.","collocation[1]":"social skills","example[12]":"In school, the children also learn social skills.","collocation[2]":"social graces","example[13]":"I had none of the social graces of my fellow pupils.","collocation[3]":"social contact/interaction","example[14]":"Work provides social contact.","collocation[4]":"a social call","example[15]":"Don't misunderstand, this is purely a social call.","definition[5]":"a party for the members of a group, club, or church","definition[6]":"concerning human society and its organization, or the quality of people’s lives","example[16]":"The only measurable social cost of high speed rail is that of noise.","example[17]":"Companies who dump waste are ignoring their social responsibility.","definition[7]":"related to people’s position in society, according to their job, family, wealth etc","example[18]":"British lawyers enjoy a higher social status than French ones.","example[19]":"Money management is not, as you might expect, dominated by the upper social classes.","definition[8]":"concerning the relationship between companies and employees, and between companies and society","example[20]":"This is the first time that institutional investors have challenged a company on environmental and social issues.","definition[9]":"related to activities you do to enjoy yourself when you are not at work","example[21]":"The firm spent thousands of dollars on social gatherings.","definition[10]":"related to the way you meet people and form relationships","example[22]":"We are looking for graduates with a high level of social skills (=ability to meet people easily and deal with them well)."}