{"word[0]":"protest","definition[0]":"something that you do to show publicly that you think that something is wrong and unfair, for example taking part in big public meetings, refusing to work, or refusing to buy a company’s products","example[0]":"Five thousand employees came out on strike in protest at the poor working conditions.","example[1]":"Students held a protest march against the war.","note[0]":"protest against","definition[1]":"words or actions that show that you do not want someone to do something or that you dislike something very much","example[2]":"She ignored his protests and walked away.","example[3]":"The programme caused a storm of protest (=a lot of angry protest).","example[4]":"The announcement was met with howls of protest.","example[5]":"I turned off the TV, despite loud protests from the kids.","note[1]":"protest from","example[6]":"He accepted his punishment without protest.","note[2]":"without protest","collocation[0]":"hold/stage/mount a protest","example[7]":"Opponents of the plan have staged several protests.","collocation[1]":"lead to/spark (off) protests","example[8]":"The arrests sparked off violent street protests.","collocation[2]":"organize a protest","example[9]":"She organized a protest outside the store.","collocation[3]":"protests erupt","example[10]":"Massive protests erupted across the country.","form[0]":"ADJECTIVES/NOUN + protest","collocation[4]":"a public/popular protest","example[11]":"The announcement led to widespread public protests.","collocation[5]":"political protest","example[12]":"Lee spent five years in prison for his involvement in political protest.","collocation[6]":"a peaceful protest","example[13]":"Some 5,000 students and others began a peaceful protest.","collocation[7]":"a violent/angry protest","example[14]":"Three people died yesterday in violent protests against the war.","collocation[8]":"a mass protest","example[15]":"There were mass protests in the capital.","collocation[9]":"a massive protest","example[16]":"They reacted to the king’s forced abdication with massive public protests.","collocation[10]":"a student protest","example[17]":"Student protests were crushed by police.","collocation[11]":"a street protest","example[18]":"There was a ban on street protests.","collocation[12]":"an anti-government protest","example[19]":"Religious leaders continued to lead anti-government protests.","form[1]":"protest + NOUN","collocation[13]":"a protest group/movement","example[20]":"Students at the heart of the protest movement have called for a general strike.","collocation[14]":"a protest march","example[21]":"They staged a protest march through the city’s streets.","collocation[15]":"a protest rally","example[22]":"A protest rally in the capital was attended by about 400 people.","definition[2]":"to come together to publicly express disapproval or opposition to something","example[23]":"Thousands of people blocked the street, protesting against the new legislation.","note[3]":"protest against/at/about","example[24]":"Students protested the decision.","note[4]":"protest something","definition[3]":"to say that you strongly disagree with or are angry about something because you think it is wrong or unfair","example[25]":"‘I don’t see why I should take the blame for this!’ she protested.","example[26]":"Clive protested that he hadn’t been given enough time to do everything.","note[5]":"protest that","definition[4]":"to state very firmly that something is true, when other people do not believe you","example[27]":"Years later, he is still protesting his innocence.","example[28]":"Sarah protested that she wasn’t Mick’s girlfriend.","note[6]":"protest (that)","definition[5]":"to do something to show publicly that you disagree with something – used especially when a large group of people do this together","example[29]":"Huge crowds gathered in the capital protesting against the war.","example[30]":"Drivers blocked roads around the capital to protest about the rising cost of fuel.","display[0]":"march","definition[6]":"to walk in a large group from one place to another in order to protest about something","example[31]":"Hundreds of students marched through the city in protest against the employment laws.","display[1]":"demonstrate","definition[7]":"to walk or stand somewhere in a large group, in order to protest about something","example[32]":"About 200 people were demonstrating outside the US Embassy.","example[33]":"Environmentalists have been demonstrating against plans to dump waste at sea.","display[2]":"riot","definition[8]":"to protest by behaving in a violent and uncontrolled way","example[34]":"Hundreds of workers rioted after pay negotiations broke down.","example[35]":"The prisoners were rioting against their appalling conditions.","display[3]":"boycott","definition[9]":"to protest about the actions of a company, country, or industry by refusing to buy something, or refusing to go to a place or event","example[36]":"They may boycott the next Olympic Games.","example[37]":"Shoppers are boycotting battery-farmed eggs.","display[4]":"hold/stage a sit-in","definition[10]":"to protest by refusing to leave a place","example[38]":"The students have been staging a sit-in to protest about overcrowding at the polytechnic.","display[5]":"go on a hunger strike","definition[11]":"to protest by refusing to eat","example[39]":"Maynard went on a hunger strike to protest his innocence.","definition[12]":"an angry complaint that shows you disagree with something, or when you state publicly that you think something is wrong or unfair","example[40]":"The union is making a formal protest to the government about the matter.","example[41]":"Miners staged a two-hour strike in protest against the effects of the economic reforms.","note[7]":"protest against/at","example[42]":"Health workers marched on Nov. 17 in protest at government restrictions on health service expenditure.","definition[13]":"an occasion when people meet together in public to express disapproval or opposition to something","example[43]":"17,000 demonstrators took part in a student protest against education loans.","example[44]":"Later this month, protest marches are planned by farmers’ groups.","definition[14]":"unwillingly, and with the feeling that you have been unfairly treated","example[45]":"I only signed the document under protest.","example[46]":"The tax demand was disputed by the company, and the payments were made under protest.","definition[15]":"to show publicly that you disagree with something you think is wrong or unfair","example[47]":"People always protest against new forms of taxation.","definition[16]":"to say or do something publicly to show that you disagree with something you think is wrong or unfair","example[48]":"About 40,000 angry Connecticut residents gathered outside the Capitol in Hartford to protest a new income tax.","definition[17]":"to state very firmly that something is true, especially when other people do not believe you","example[49]":"The AFL-CIO’s Richard Sawyer protested that thousands of local jobs may be lost to Mexico if the trade agreement is approved."}