{"word[0]":"base","definition[0]":"to have your main place of work, business etc in a particular place","example[0]":"The paper had intended to base itself in London.","example[1]":"The new organization will be based in Dallas.","note[0]":"be based in something","explanation[0]":"In this meaning, base is usually either passive or reflexive (=followed by myself/itself etc)","signpost[0]":"lowest part","definition[1]":"the lowest part or surface of something","example[2]":"a frozen dessert with a biscuit base","example[3]":"a wine glass with a heavy base","example[4]":"The leather of his left trainer was coming away from its rubber base.","example[5]":"There is a door at the base of the tower.","note[1]":"base of","example[6]":"the base of a triangle","definition[2]":"the lowest point on a plant or part of your body, where it joins another part","example[7]":"a hole in the base of the tree","example[8]":"He was killed by an axe blow to the base of his skull.","signpost[1]":"knowledge/ideas","definition[3]":"the most important part of something, from which new ideas develop","synonym[0]":"foundation","example[9]":"India has a good scientific research base.","example[10]":"They were laying the base for a new economic recovery.","note[2]":"base for","definition[4]":"a place where people in a military organization live and work","note[3]":"military/naval/air base","signpost[2]":"company/organization","definition[5]":"the main place from which a person, company, or organization controls their activities","example[11]":"He used the house as a base for his printing business.","signpost[3]":"people/groups","definition[6]":"the people, money, groups etc that form the main part of something","example[12]":"The company has built up a loyal customer base.","example[13]":"By broadening the tax base (=all the people who pay taxes), he could raise more revenues.","example[14]":"an attempt to strengthen the city’s economic base (=things that produce jobs and money)","example[15]":"The country’s manufacturing base (=all the factories, companies etc that produce goods in a country) has shrunk by 20%.","signpost[4]":"substance/mixture","definition[7]":"the main part of a substance, meal etc to which other things are added","example[16]":"paint with an oil base","example[17]":"Vodka is the base for many cocktails.","definition[8]":"one of the four places that a player must touch in order to get a point in games such as baseball","signpost[5]":"chemical","definition[9]":"a chemical substance that combines with an acid to form a salt","signpost[6]":"numbers","definition[10]":"the number in relation to which a number system or mathematical table is built up, for example 10 in the decimal system","heading[0]":"– Meaning 2: the most important part of something, from which new ideas develop","collocation[0]":"a good base","example[18]":"This data provided a good base for further research.","collocation[1]":"a solid/firm/strong base","example[19]":"A good education should give you a solid base for life.","collocation[2]":"a sound/secure base","example[20]":"A child needs a responsive mother in order to form a secure base for future development.","collocation[3]":"a broad base","example[21]":"The first year of the course aims to provide students with a broad base of knowledge.","collocation[4]":"a knowledge base","example[22]":"You’re building up a knowledge base that you’ll be able to use later.","collocation[5]":"have a base","example[23]":"Permanent staff have a better base from which to plan their career development.","collocation[6]":"provide a base","example[24]":"It is essential to provide a sound base from which economic progress can be made.","collocation[7]":"build a base","example[25]":"By concentrating on our core businesses we will build a strong base from which to exploit future opportunities.","collocation[8]":"give somebody a base","example[26]":"The training gives you a broad base in actually running an organization.","definition[11]":"not having good moral principles","example[27]":"base attitudes and desires","definition[12]":"the main place from which a company or organization controls its activities","example[28]":"Reps will be invited to Bristol, the company’s base, for a briefing.","example[29]":"The Group’s operating base is in Norway.","definition[13]":"the part of something from which new things can be developed or achieved","example[30]":"Small-scale industries provide a better base for employment growth.","definition[14]":"a figure against which later amounts or other amounts are compared","example[31]":"All employees earned a salary above the wage base.","definition[15]":"all of the people or things that something depends on, considered as a whole"}