{"word[0]":"ordeal","definition[0]":"a terrible or painful experience that continues for a period of time","example[0]":"She was forced to face the ordeal of withdrawal symptoms.","example[1]":"He was beginning to wonder if he would survive the ordeal.","example[2]":"Teresa had a transplant in 1989 and was just recovering from that ordeal when she suffered a brain hemorrhage.","example[3]":"Soon the whole terrifying ordeal would be over.","example[4]":"She then had to go through the ordeal of giving evidence.","note[0]":"ordeal of","collocation[0]":"a terrible/dreadful ordeal","example[5]":"The trial was a dreadful ordeal.","collocation[1]":"a long ordeal","example[6]":"After thirteen days, the hostages' long ordeal finally ended.","collocation[2]":"a terrifying ordeal","example[7]":"Bruce Gordon has described his terrifying ordeal in a shark attack.","collocation[3]":"a painful ordeal","example[8]":"The treatment she had to go through was a painful ordeal.","collocation[4]":"go through an ordeal","example[9]":"I'd already gone through the ordeal of a divorce once.","example[10]":"The girl will not have to undergo the ordeal of giving evidence in court.","collocation[5]":"face an ordeal","example[11]":"He faced the ordeal of caring for his dying wife.","collocation[6]":"endure an ordeal","example[12]":"In his book, he describes how he endured the ordeal of prison life.","collocation[7]":"survive an ordeal","example[13]":"The woman survived her ordeal and identified her attacker.","collocation[8]":"recover from an ordeal","example[14]":"She is recovering from her ordeal after a bomb went off on the train she was on.","collocation[9]":"subject somebody to an ordeal","example[15]":"Simon Collier was subjected to a horrifying ordeal at gunpoint.","collocation[10]":"spare somebody the ordeal of something","example[16]":"Thank goodness she was spared the ordeal of surgery.","collocation[11]":"an ordeal at the hands of somebody","example[17]":"She has only just revealed her ordeal at the hands of her stepfather."}