{"word[0]":"packet","definition[0]":"a container made of paper, plastic, or cardboard that something is sold in","example[0]":"a cereal packet","example[1]":"a packet of envelopes","note[0]":"packet of","example[2]":"a packet of cigarettes","definition[1]":"a small flat paper or plastic container that a liquid or powder is sold in","example[3]":"packets of ketchup and mustard","definition[2]":"a small flat package that is sent by post or delivered to someone","example[4]":"Paul tore open the packet as soon as it arrived.","definition[3]":"a quantity of information that is sent as a single unit from one computer to another on a network or on the Internet","definition[4]":"a small container, usually made of paper, with a set of things in it","synonym[0]":"PACK","example[5]":"United Biscuits produces 5 billion packets a year.","example[6]":"Supermarkets withdrew thousands of packets of chocolates after discovering a production error.","example[7]":"Under a direct-marketing promotion, Quaker Oats sent out packets of coupons to 18 million homes.","definition[5]":"a small plastic or paper package containing a product in liquid or paper form","synonym[1]":"SACHET","example[8]":"a packet of tomato sauce","definition[6]":"a set of related things or services which are offered or sold together","synonym[2]":"PACKAGE","example[9]":"He advised the firm to buy a packet of Jacobs Suchard shares to facilitate the takeover.","example[10]":"We are putting together a packet of services from various parts of the bank.","definition[7]":"a unit of data that is sent over a computer network such as the Internet. Packets that belong to the same file can travel over different routes and be joined together again when they arrive","definition[8]":"to cost a lot of money","example[11]":"It can cost a packet to use a mobile abroad.","definition[9]":"a set of documents kept together between the same covers","example[12]":"a 200-page packet of documents","definition[10]":"another name for package"}