{"word[0]":"bet","definition[0]":"to risk money on the result of a race, game, competition, or other future event","example[0]":"How much do you want to bet?","example[1]":"He bet me £10 that I wouldn’t do it.","note[0]":"bet (somebody) that","example[2]":"She bet all her money on a horse that came last.","note[1]":"bet (something) on something","example[3]":"I wouldn’t bet against him winning the championship this year.","note[2]":"bet against","definition[1]":"an agreement to risk money on the result of a race, game etc or on something happening, or the money that you risk","example[4]":"a £50 bet","example[5]":"Bookmakers are already taking bets on the outcome.","example[6]":"We placed bets on three horses.","note[3]":"place/put/lay a bet","example[7]":"If he scores now, I’ll win my bet.","note[4]":"win/lose a bet","example[8]":"A few of us had a bet on who’d get married first.","note[5]":"bet on","collocation[0]":"have a bet","example[9]":"Are you going to have a bet on the race?","collocation[1]":"place/put/lay a bet on something","example[10]":"She placed a bet on a horse called Beethoven.","collocation[2]":"take a bet","example[11]":"They're taking bets on the result of the election now.","collocation[3]":"win a bet","example[12]":"France won the game and I won my bet.","collocation[4]":"lose a bet","example[13]":"If I have a bet, I always lose it.","collocation[5]":"make a bet","example[14]":"If you want to make money on the stock market, you have to start making bets.","definition[2]":"to risk money on a future event, for example by investing in a company or product or buying stocks or shares","example[15]":"Investors were willing to bet on the company, and its shares jumped $1.94 to $9.06.","note[6]":"bet (something) on","example[16]":"The New Jersey fund has bet $40 million on small stocks.","example[17]":"The market bet heavily that the dollar would fall.","definition[3]":"to risk a lot of money on a future event, for example by investing in a company or product or buying stocks or shares","example[18]":"Do we really want to bet the ranch on this deal?","definition[4]":"when you risk money on a future event, for example by investing in a company or product or buying stocks or shares","example[19]":"They like selling short, or making a bet that share prices will decline.","example[20]":"Shearson placed a big bet on junk bonds and lost.","example[21]":"a huge $11 billion bet on US interest rates that went wrong"}