{"word[0]":"extension","signpost[0]":"making something bigger or longer","definition[0]":"the process of making a road, building etc bigger or longer, or the part that is added","example[0]":"the extension of the Jubilee underground line","note[0]":"extension of","signpost[1]":"extra rooms","definition[1]":"another room or rooms which are added to a building","example[1]":"a loft extension","example[2]":"the planned extension to the National Museum","note[1]":"extension to","signpost[2]":"extra time","definition[2]":"an additional period of time allowed for something","example[3]":"Donald’s been given an extension to finish his thesis.","example[4]":"The pub’s got an extension tonight  (=it will stay open longer than usual).","signpost[3]":"include/affect more than before","definition[3]":"the development of something in order to make it affect more people, situations, areas than before","example[5]":"the extension of the copyright laws to cover online materials","example[6]":"an extension of the powers of the European Parliament","definition[4]":"one of many telephone lines connected to a central system in a large building, which all have different numbers","example[7]":"Can I have extension 316, please?","example[8]":"Do you know Mr Brown’s extension number?","definition[5]":"one of the telephones in a house that all have the same number","definition[6]":"a set of three letters that follow the name of a computer file to show what it is. For example, the extension ‘.doc’ shows that a file is a written document.","signpost[4]":"electric wire","definition[7]":"an extension lead","signpost[5]":"stretch arm/leg","definition[8]":"the position of a part of the body when it is stretched, or the process of stretching it","signpost[6]":"university/college","definition[9]":"part of a university or college that offers courses to people who are not full-time students","definition[10]":"one of many telephone lines in a large building that all have different numbers, but that can be contacted through one central number","example[9]":"Put me through to extension 316, please.","example[10]":"What’s your extension number?","definition[11]":"an additional period of time given to someone to finish a job, repay money that they owe etc","example[11]":"You can request an automatic four-month extension of the due date for paying your tax.","definition[12]":"when lenders agree to lend money for longer than was originally agreed","example[12]":"Lenders have given the retailer a five-year extension of a $87.4 million credit line.","definition[13]":"when a law, tax etc is changed to affect more things than before","example[13]":"an extension of the sales tax to various personal services and power utilities","definition[14]":"another room or rooms that are added to a building","example[14]":"A 250-bedroom extension to the hotel will increase total capacity to 1,576 rooms.","definition[15]":"a set of three letters that follow the name of a computer file to show what it is. For example, the extension ‘.doc’ shows that a file is a written document"}