{"word[0]":"writing","definition[0]":"words that have been written or printed","example[0]":"What does the writing on the back say?","example[1]":"a T-shirt with Japanese writing on it","definition[1]":"books, poems, articles etc, especially those by a particular writer or about a particular subject","note[0]":"travel/feminist/scientific etc writing","example[2]":"Some of his most powerful writing is based on his childhood experiences.","definition[2]":"the activity of writing books, stories etc","example[3]":"In 1991 she retired from politics and took up writing as a career.","example[4]":"a short story that stands out as a brilliant piece of writing","example[5]":"a class in creative writing  (=a subject studied at school or college, where you write your own stories, poems etc)","definition[3]":"the particular way that someone writes with a pen or pencil","synonym[0]":"handwriting","example[6]":"Your writing is very neat.","definition[4]":"the skill of writing","example[7]":"At this age we concentrate on the children’s reading and writing skills.","heading[0]":"– Meanings 2 & 3","form[0]":"ADJECTIVES/NOUN + writing","collocation[0]":"creative writing","example[8]":"He is currently teaching creative writing at the University of Michigan.","collocation[1]":"travel writing","example[9]":"Here is some of the best travel writing from around the globe.","collocation[2]":"historical/sociological/scientific etc writing","example[10]":"Much historical writing today looks at the lives of ordinary people, as well as at the rich and powerful.","collocation[3]":"academic writing","example[11]":"In academic writing, you should avoid contractions such as \"don't\" or \"aren't\".","collocation[4]":"feminist writing","example[12]":"Feminist writing has strongly criticized pornography as treating women as objects rather than people.","form[1]":"NOUN + writing","collocation[5]":"writing materials","example[13]":"Pupils were able to try old writing materials such as slates and steel-nibbed pens.","collocation[6]":"writing skills","example[14]":"a workshop to develop children's writing skills","collocation[7]":"writing style","example[15]":"Different newspapers tend to use different writing styles.","collocation[8]":"a piece of writing","example[16]":"It's a brilliant piece of writing."}