{"word[0]":"under","signpost[0]":"below","definition[0]":"below or at a lower level than something, or covered by something","opposite[0]":"over","example[0]":"Wendy had hidden the box under her bed.","example[1]":"We sailed under the Golden Gate Bridge.","example[2]":"Write your name under your picture.","example[3]":"I could see something glittering under the water.","example[4]":"He was wearing a jacket under his coat.","example[5]":"Under her arm, she carried a large portfolio.","example[6]":"In summer, we often slept under the stars.","example[7]":"I’d scare my mom by diving in and staying under  (=staying under the water) for as long as I could.","example[8]":"The bench collapsed under the weight of (=unable to support the weight of) so many people.","signpost[1]":"less than","definition[1]":"less than a particular number, amount, age, or price","note[0]":"be under age (=be too young to legally drink, have sex etc)","example[9]":"These toys are not suitable for children under five.","example[10]":"Most of the events listed cost under £60.","example[11]":"I spend just under four hours a day seeing customers.","example[12]":"Children aged 12 or under must be accompanied by an adult.","note[1]":"and/or under","signpost[2]":"having something done to it","definition[2]":"used to say what is being done to something or how it is being dealt with","example[13]":"Four new power stations are currently under construction.","example[14]":"The port was coming under attack from enemy warships.","example[15]":"The possibility of employing more staff is still under discussion  (=being discussed, considered etc).","note[2]":"under discussion/consideration/review etc","example[16]":"All categories of expenditure are under review.","signpost[3]":"affected by something","definition[3]":"affected by a particular condition, influence, or situation","example[17]":"She’s been under a lot of pressure at work.","example[18]":"The operation was carried out while she was under general anaesthetic.","example[19]":"I’m glad to see that you have everything under control.","example[20]":"Two of our national parks are currently under threat from road schemes.","example[21]":"The doctor injected something into my arm and I immediately felt myself going under (=becoming unconscious).","example[22]":"He was accused of driving while under the influence of alcohol.","note[3]":"under the influence of alcohol/drink/drugs etc","signpost[4]":"law/agreement","definition[4]":"according to a particular agreement, law etc","example[23]":"the question of whether the trade is illegal under international law","example[24]":"Under the terms of the agreement, the debt will be repaid over a 20-year period.","signpost[5]":"in power","definition[5]":"if something happens under a particular leader, government etc, it happens when they are in power","example[25]":"a program initiated under President Clinton and continued under President Bush","example[26]":"Under her leadership, the magazine’s circulation doubled in less than a year.","example[27]":"Would it have been different under a Labour government?","signpost[6]":"position at work","definition[6]":"if you work under someone, they have a higher position in the company, organization etc than you, and they help to direct your work","example[28]":"She had a total staff of ten working under her.","example[29]":"From 1847 to 1851 he served under Captain John Randolph Stokes.","example[30]":"At Cambridge he studied under  (=was a student of) F. R. Leavis.","signpost[7]":"where information is","definition[7]":"used to say in which part of a book, list, or system particular information can be found","example[31]":"The baby’s records are filed under the mother’s last name.","note[4]":"be/be filed/be listed etc under","signpost[8]":"different name","definition[8]":"if you write or do something under a particular name, you do it using that name instead of your real name","example[32]":"He made a few records under the name of Joe Ritchie.","definition[9]":"something that is under something else has that thing directly above it or covering it","example[33]":"The pen was under the desk.","example[34]":"She had a T-shirt on under her sweater.","definition[10]":"in a lower position than something else, though not always directly under it","example[35]":"From the cliffs we could barely see the people on the beach below us.","example[36]":"His apartment is below ours on the left.","display[0]":"underneath","definition[11]":"under – used especially to emphasize that something covers, touches, or hides something","example[37]":"The girls wear shorts underneath their cheerleading skirts.","example[38]":"I found the book underneath the sofa.","display[1]":"beneath","definition[12]":"under or at a lower level","example[39]":"They strolled hand in hand beneath the summer moon.","example[40]":"The water lies just beneath the surface of the earth.","definition[13]":"less of an action or quality than is correct, needed, or desired","example[41]":"underdevelopment","example[42]":"undercooked cabbage","definition[14]":"going under something","example[43]":"an underpass  (=a road or path that goes under another road)","definition[15]":"inside or beneath other things","example[44]":"undergarments","definition[16]":"less important or lower in rank","example[45]":"a head gardener and three under-gardeners"}