{"word[0]":"flow","signpost[0]":"liquid/gas/electricity","definition[0]":"a smooth steady movement of liquid, gas, or electricity","example[0]":"I tied a towel round his leg to try to stem the flow of blood.","example[1]":"He struggled to swim against the flow of the water.","note[0]":"flow of","signpost[1]":"traffic","definition[1]":"the steady movement of traffic","example[2]":"a new road system to improve traffic flow through the city centre","signpost[2]":"goods/people/information","definition[2]":"the movement of goods, people, or information from one place to another","example[3]":"They have accused the government of trying to block the free flow of information.","example[4]":"an attempt to stem the flow of refugees across the border","example[5]":"the flow of funds from the US to Europe","example[6]":"There has been a steady flow of people leaving the area.","signpost[3]":"speech/writing","definition[3]":"the continuous stream of words or ideas when someone is speaking, writing, or thinking about something","example[7]":"I didn’t want to interrupt her flow, so I said nothing.","signpost[4]":"of the sea","definition[4]":"the regular movement of the sea towards the land","example[8]":"the ebb and flow of the tide","definition[5]":"when a liquid, gas, or electricity flows, it moves in a steady continuous stream","example[9]":"If the windows are shut, air cannot flow freely through the building.","example[10]":"These gates regulate the amount of water flowing into the canal.","note[1]":"flow over/down/through etc","definition[6]":"if goods, people, or information flow from one place to another, they move there in large numbers or amounts","example[11]":"Money has been flowing into the country from Western aid agencies.","example[12]":"The number of refugees flowing into the area is still increasing.","definition[7]":"if traffic flows, it moves easily from one place to another","example[13]":"The new one-way system should help the traffic to flow better.","signpost[5]":"alcohol","definition[8]":"if alcohol flows at a party, people drink a lot and there is a lot available","example[14]":"Beer and whisky flowed freely as the evening wore on.","signpost[6]":"words/ideas","definition[9]":"if conversation or ideas flow, people talk or have ideas steadily and continuously, without anything stopping or interrupting them","example[15]":"Everyone was relaxed and the conversation flowed freely.","signpost[7]":"sea","definition[10]":"when the sea flows, it moves towards the land","example[16]":"We watched the tide ebb and flow.","definition[11]":"if a feeling flows through you or over you, you feel it strongly","example[17]":"She felt hot rage flowing through her.","note[2]":"flow through/over","signpost[8]":"clothes/hair","definition[12]":"if clothing or hair flows, it falls or hangs loosely and gracefully","example[18]":"Her long hair flowed down her back.","definition[13]":"if liquid flows, it moves in a steady continuous stream","example[19]":"Blood flowed from his hand.","example[20]":"The river flows very quickly at this point.","definition[14]":"to flow – used when saying that something flows in a particular direction","example[21]":"Water was running down the walls of the room.","example[22]":"Sweat ran off his nose.","example[23]":"The river runs into the sea.","display[0]":"come out","definition[15]":"to flow out of something","example[24]":"You couldn't drink any of the water that came out of the tap.","definition[16]":"to flow in large quantities","example[25]":"The rain poured down.","example[26]":"Blood was pouring from a wound on his head.","display[1]":"gush","definition[17]":"to flow out quickly in very large quantities","example[27]":"Water was gushing out at more than 3000 gallons a minute.","display[2]":"spurt","definition[18]":"to flow out suddenly with a lot of force","example[28]":"Oil was spurting from a small hole in the pipe.","display[3]":"trickle","definition[19]":"to flow slowly in drops or in a thin stream","example[29]":"Clare felt sweat trickling down the back of her neck.","display[4]":"leak","definition[20]":"to flow in or out through a small hole or crack, usually when this is not meant to happen","example[30]":"Oil was leaking from the engine.","display[5]":"ooze","definition[21]":"to flow from something very slowly – used about blood or a thick liquid","example[31]":"Blood was oozing from the wound.","example[32]":"Jam oozed out as she bit into the cake.","display[6]":"drip","definition[22]":"to fall in drops","example[33]":"Water dripped from the tap continuously.","display[7]":"cascade","definition[23]":"to flow down the side of something in large amounts","example[34]":"Water cascades down the hillside.","definition[24]":"if money flows somewhere, such as into a bank account or into a particular country, it is moved there","example[35]":"A record $10 billion in foreign capital flowed into Mexican stocks last year.","note[3]":"flow from/into/between etc","example[36]":"Throughout the summer, new savings flowed away from building society accounts.","example[37]":"Investment trust money has been flowing back into blue chip companies such as Sony and Honda.","definition[25]":"if an event or action flows from something, it is caused by it","example[38]":"The regulations which flowed from the Charities Act forced charities to improve their accounts.","note[4]":"flow from","definition[26]":"if information or ideas flow, people start to exchange information or their ideas so that they can discuss them","example[39]":"The meeting was relaxed and suggestions soon started to flow."}