{"word[0]":"proportion","signpost[0]":"part of something","definition[0]":"a part of a number or an amount, considered in relation to the whole","example[0]":"The decision affects a significant proportion of the population.","note[0]":"high/large/small etc proportion","example[1]":"Although the majority of offenders are men, a small proportion – about five percent – are women.","example[2]":"The proportion of women graduates has increased in recent years.","note[1]":"proportion of","example[3]":"Every parent is asked to contribute a proportion of the total cost.","explanation[0]":"In this meaning, proportion is usually followed by a singular verb","example[4]":"A small proportion disagrees","example[5]":"A small proportion disagree","definition[1]":"the relationship between two things in size, amount, importance etc","example[6]":"What’s the proportion of boys to girls in your class?","note[2]":"the proportion of something to something","example[7]":"The rewards you get in this job are in direct proportion to the effort you put in.","note[3]":"in proportion to something","signpost[1]":"correct scale","definition[2]":"the correct or most suitable relationship between the size, shape, or position of the different parts of something","example[8]":"Builders must learn about scale and proportion.","example[9]":"Reduce the drawing so that all the elements stay in proportion.","note[4]":"in proportion","example[10]":"Her feet are small in proportion to her height.","example[11]":"The porch is out of proportion with  (=too big or too small when compared with) the rest of the house.","note[5]":"out of proportion with something","definition[3]":"equality in the mathematical relationship between two sets of numbers, as in the statement ‘8 is to 6 as 32 is to 24’","heading[0]":"– Meaning 4:","form[0]":"ADJECTIVES/NOUN + proportions","collocation[0]":"enormous/massive/gigantic etc proportions","example[12]":"The company is heading towards a disaster of enormous proportions.","collocation[1]":"epidemic proportions","example[13]":"Shoplifting has reached epidemic proportions.","collocation[2]":"epic proportions","example[14]":"An argument of epic proportions had ensued.","collocation[3]":"mythic proportions","example[15]":"Achieving this was a feat of mythic proportions.","collocation[4]":"historic proportions","example[16]":"We were trapped for three days by a blizzard of historic proportions.","collocation[5]":"crisis proportions","example[17]":"The water shortage was reaching crisis proportions.","collocation[6]":"manageable proportions","example[18]":"First, narrow the choice down to more manageable proportions.","collocation[7]":"reach epidemic etc proportions","example[19]":"Alcohol abuse has reached epidemic proportions in this country.","collocation[8]":"grow to enormous etc proportions","example[20]":"The fish grows to gigantic proportions.","collocation[9]":"assume epidemic etc proportions","example[21]":"Unless you deal with it quickly, the damage may assume serious proportions.","collocation[10]":"reduce something to manageable etc proportions","example[22]":"The disease had been reduced to negligible proportions by vaccination.","definition[4]":"to put something in a particular relationship with something else according to their relative size, amount, position etc","example[23]":"The amount of damages awarded are proportioned to the degree of injury caused.","note[6]":"be proportioned to something","explanation[1]":"Proportion is usually passive"}