{"definition[0]":"to reduce the amount of something","example[0]":"They’re introducing CCTV cameras in an attempt to cut street crime in the area.","example[1]":"You need to cut the amount of fat and sugar in your diet.","example[2]":"Scientists are warning that unless carbon emissions are cut, we could be heading for an environmental catastrophe.","example[3]":"Seven hundred jobs will be lost in order to cut costs and boost profits.","example[4]":"The major aviation companies need to cut prices if they are to compete with budget airlines.","example[5]":"Staffing levels had already been cut to the bone (=reduced to the lowest level possible).","example[6]":"The welfare budget has been cut by $56 billion.","note[0]":"cut something by £1 million/$5 billion/half etc","example[7]":"A new direct service will cut two hours off the flying time between London and Seoul.","note[1]":"cut something off something","signpost[0]":"divide something with a knife, scissors etc","definition[1]":"to divide something or separate something from its main part, using scissors, a knife etc","example[8]":"Do you want me to cut the cake?","example[9]":"The telephone wires had been cut minutes before the assault.","example[10]":"Cut the orange in half.","note[2]":"cut something in half/in two","example[11]":"Cut the carrots into thin strips.","note[3]":"cut something into slices/chunks/pieces etc","example[12]":"The curtain pole can be cut to length.","note[4]":"cut something to size/length","example[13]":"Jane cut the cord with a knife.","note[5]":"cut something with something","example[14]":"Can you cut me a piece of bread, please?","note[6]":"cut somebody something","example[15]":"Using a pair of scissors, cut carefully along the dotted lines.","note[7]":"cut along/across/round etc","example[16]":"We’ll need a saw that will cut through metal.","note[8]":"cut through","signpost[1]":"make something shorter with a knife etc","definition[2]":"to make something shorter with a knife, scissors etc, especially in order to make it neater","example[17]":"For reasons of hygiene, we had to cut our fingernails really short.","example[18]":"From outside came the sound of someone cutting the hedge.","note[9]":"cut the lawn/grass/hedge etc","example[19]":"It’s about time you got your hair cut.","note[10]":"have/get your hair cut","signpost[2]":"remove parts from film etc","definition[3]":"to remove parts from a film, book, speech etc, for example because it is too long or might offend people","example[20]":"The original version was cut by more than 30 minutes.","signpost[3]":"make a hole/mark","definition[4]":"to make a hole or mark in the surface of something, or to open it using a sharp tool","example[21]":"Cut a hole in the middle of the paper.","example[22]":"Cut open the chillies and remove the seeds.","example[23]":"The blade cut deep into the wood.","note[11]":"cut into","example[24]":"Strange letters had been cut into the stone.","note[12]":"cut something into something","signpost[4]":"injure","definition[5]":"to injure yourself on something sharp that breaks the skin and makes you bleed","example[25]":"She fell and cut her head open.","example[26]":"I noticed he’d cut his finger quite badly.","note[13]":"cut your finger/knee/hand etc","example[27]":"Marcie said she’d cut herself on a broken glass.","note[14]":"cut yourself (on something)","example[28]":"That knife’s extremely sharp! Mind you don’t cut yourself.","example[29]":"On Eric’s chin was a scrap of cotton wool where he’d cut himself shaving.","signpost[5]":"make/form something by cutting","definition[6]":"to make or form something from a solid piece of wood, metal etc using a sharp tool","example[30]":"I’ll get a spare key cut for you.","example[31]":"The chair had been cut from the trunk of a tree.","note[15]":"cut something from something","signpost[6]":"let somebody get free","definition[7]":"to cut something such as metal or rope in order to let someone escape from where they are trapped","example[32]":"He was in the vehicle for an hour before he was cut free.","example[33]":"She had to be cut from the wreckage of her car.","note[16]":"cut somebody from something","signpost[7]":"tool/material","definition[8]":"if a tool cuts well, badly etc, it cuts things well or badly etc","example[34]":"professional quality tools that cut efficiently and smoothly","definition[9]":"if a piece of clothing is cut in a particular way, that is the way it is designed and made","example[35]":"The T-shirt is cut fairly low at the neck.","explanation[0]":"Cut is usually passive in this meaning","signpost[8]":"on computer","definition[10]":"to remove something from a document or file on a computer","example[36]":"To cut text, press Control + C.","example[37]":"Cut and paste the picture into a new file  (=remove it and then make it appear in a new file).","signpost[9]":"go a quick way","definition[11]":"to get to somewhere by a quicker and more direct way than the usual way","example[38]":"I usually cut through the car park to get to work.","note[17]":"cut through/down/across etc","example[39]":"Let’s cut across the field.","signpost[10]":"divide an area","definition[12]":"to divide an area into two or more parts","example[40]":"The river cuts the whole region in two.","note[18]":"cut something in/into something","example[41]":"The new road will cut through a conservation area.","signpost[11]":"playing cards","definition[13]":"to divide a pack of cards into two","example[42]":"First cut the pack, and then deal the cards","definition[14]":"to produce a CD, song etc for people to buy","example[43]":"The band cut their first single in 2001.","signpost[12]":"crops","definition[15]":"to take the top part off crops such as wheat before gathering them","definition[16]":"to put the parts of a film together so that they make a continuous story, and get rid of the parts you do not want","definition[17]":"in a film, if the camera cuts away or cuts to a different scene, the scene on the screen changes to a different one","example[44]":"At the crucial moment, the camera cuts away and we don't see the murder.","example[45]":"The shark is shown moving through the water and then we cut to a shot of the beach. ","definition[18]":"if a line cuts another line, they cross each other at a particular point","signpost[13]":"tooth","definition[19]":"if a baby cuts a tooth, the tooth starts to grow","definition[20]":"to mix an illegal drug such as heroin with another substance","explanation[1]":"Cut is often passive in this meaning","heading[0]":"– Meaning 1: to reduce the amount of something","collocation[0]":"cut costs","example[46]":"They cut costs by getting rid of staff.","collocation[1]":"cut prices","example[47]":"Shops have been forced to cut their prices after very slow sales.","collocation[2]":"cut taxes/rates","example[48]":"The government is expected to cut interest rates next month.","collocation[3]":"cut spending/borrowing","example[49]":"In the 1990s, governments worldwide cut military spending.","collocation[4]":"cut jobs","example[50]":"The bank announced that it was cutting 500 jobs.","collocation[5]":"cut crime","example[51]":"Cameras have helped to cut crime in the town centre.","collocation[6]":"sharply/severely/drastically","example[52]":"Housing benefit was sharply cut for all but the poorest people.","collocation[7]":"cut something to the bone","example[53]":"Funding for art and music in schools has been cut to the bone.","heading[1]":"– Meaning 2: to divide something or separate something from its main part, using scissors, a knife etc","collocation[8]":"cut somebody a piece/slice of something","example[54]":"Shall I cut you a slice of cake?","collocation[9]":"cut something in half/two","example[55]":"Cut the tomatoes in half.","collocation[10]":"cut something into pieces/slices/chunks etc","example[56]":"Next cut the carrots into thin slices.","example[57]":"The place where I bought the wood cut it to size for me.","collocation[11]":"cut something open","example[58]":"Cut open the avocado and remove the stone.","collocation[12]":"cut something lengthways","example[59]":"First cut the fish in half lengthways.","collocation[13]":"cut something cleanly","example[60]":"Branches should be cut cleanly from the tree.","definition[21]":"to divide something into two or more pieces, especially using a knife or scissors","example[61]":"He cut off the lower branches.","display[0]":"snip","definition[22]":"to quickly cut something, especially using scissors","example[62]":"I snipped the label off.","example[63]":"The hairdresser snipped away at her hair.","display[1]":"slit","definition[23]":"to make a long narrow cut through something, especially using a knife","example[64]":"He slit the envelope open with a penknife.","example[65]":"She slit through the plastic covering.","display[2]":"slash","definition[24]":"to cut something quickly and violently with a knife, making a long thin cut","example[66]":"Someone had slashed the tyres on his car.","example[67]":"He tried to slash his wrists.","display[3]":"saw","definition[25]":"to cut wood, using a saw (=a tool with a row of sharp points)","example[68]":"Saw the wood to the correct length.","display[4]":"chop","definition[26]":"to cut wood, vegetables, or meat into pieces","example[69]":"Bill was outside chopping up firewood with an axe.","example[70]":"They chopped down the old tree.","example[71]":"finely chopped onion","display[5]":"slice","definition[27]":"to cut bread, meat, or vegetables into thin pieces","example[72]":"I’ll slice the cucumber.","example[73]":"Slice the bread thinly.","display[6]":"dice","definition[28]":"to cut vegetables or meat into small square pieces","example[74]":"First dice the apple into cubes.","display[7]":"grate","definition[29]":"to cut cheese or a hard vegetable by rubbing it against a special tool","example[75]":"Grate the cheese and sprinkle it over the vegetables.","display[8]":"peel","definition[30]":"to cut the outside part off something such as a potato or apple","example[76]":"I peeled the potatoes and put them in a saucepan.","display[9]":"carve","definition[31]":"to cut thin pieces from a large piece of meat","example[77]":"Uncle Ray carved the turkey.","display[10]":"mow","definition[32]":"to cut the grass in a garden, park etc","example[78]":"A gardener was mowing the lawn.","display[11]":"trim","definition[33]":"to cut a small amount off something, especially to make it look neater","example[79]":"He was trimming his beard.","example[80]":"Trim the excess fat off the meat.","definition[34]":"said by the director of a film to tell people to stop acting, filming etc","signpost[14]":"reduction","definition[35]":"a reduction in the size or amount of something, especially the amount of money that is spent by a government or company","example[81]":"There will be cuts across all levels of the company.","example[82]":"The decision to make cuts in health care provision has been widely criticized.","example[83]":"The building plans could be hit by possible spending cuts.","example[84]":"A shorter working week will mean pay cuts for millions of workers.","note[19]":"tax/pay/job etc cuts","example[85]":"Cuts in public spending mean that fewer people can go on to higher education.","note[20]":"cut in","example[86]":"A cut of 1% in interest rates was announced yesterday.","note[21]":"cut of","signpost[15]":"skin wound","definition[36]":"a wound that is caused when something sharp cuts your skin","example[87]":"That’s quite a nasty cut – you ought to get it seen to by a doctor.","example[88]":"The driver escaped with minor cuts and bruises.","signpost[16]":"hole/mark","definition[37]":"a narrow hole or mark in the surface of something, made by a sharp tool or object","example[89]":"Make a small cut in the paper.","definition[38]":"an act of cutting someone’s hair","example[90]":"How much do they charge for a cut and blow-dry?","definition[39]":"the style in which your hair is cut","example[91]":"a short stylish cut","definition[40]":"the style in which clothes have been made","example[92]":"I could tell by the cut of his suit that he wasn’t a poor man.","signpost[17]":"share of something","definition[41]":"someone’s share of something, especially money","example[93]":"She was determined to claim her cut of the winnings.","signpost[18]":"removal from film","definition[42]":"an act of removing a part from a film, play, piece of writing etc, or a part that has been removed","definition[43]":"the process of putting together the different parts of a film and removing the parts that will not be shown","example[94]":"Spielberg himself oversaw the final cut.","definition[44]":"one of the songs or pieces of music on an album, CD etc","signpost[19]":"meat","definition[45]":"a piece of meat that has been cut to a size suitable for cooking or eating","example[95]":"Long slow cooking is more suitable for cheaper cuts of meat.","definition[46]":"a road that has been made through a hill","heading[2]":"– Meaning 1: a reduction in the size or amount of something, especially the amount of money that is spent by a government or company","collocation[14]":"make cuts","example[96]":"The country needs to make cuts in the carbon dioxide it produces.","collocation[15]":"announce cuts","example[97]":"A major engineering company has announced big job cuts.","collocation[16]":"take/accept cuts","example[98]":"Some employees were forced to take pay cuts.","form[0]":"NOUN + cut","collocation[17]":"tax cuts","example[99]":"The president announced tax cuts.","collocation[18]":"pay/wage cuts","example[100]":"Millions of workers face pay cuts.","collocation[19]":"job/staff cuts","example[101]":"There have been falling sales and job cuts at the newspaper.","collocation[20]":"spending cuts","example[102]":"His proposals could involve spending cuts of up to £12 billion.","collocation[21]":"price cuts","example[103]":"The company announced big price cuts on all its computers.","collocation[22]":"defence cuts","example[104]":"Further proposals for defence cuts were drawn up.","collocation[23]":"deep/severe cuts","example[105]":"Deep cuts were made in research spending.","collocation[24]":"drastic/sharp cuts","example[106]":"He resigned over drastic cuts in the education budget.","heading[3]":"– Meaning 2: a wound that is caused when something sharp cuts your skin","collocation[25]":"have a cut on something","example[107]":"He had a cut on his forehead.","collocation[26]":"get a cut (on something)","example[108]":"I fell and got a bad cut on my head.","collocation[27]":"small/slight","example[109]":"It’s only a small cut.","example[110]":"Two passengers had to be treated for minor cuts.","collocation[28]":"superficial","example[111]":"I’m fine - just a few superficial cuts.","collocation[29]":"bad/nasty","example[112]":"The cut looked quite bad.","example[113]":"How did you get that nasty cut?","example[114]":"She fell and got a deep cut on her leg.","collocation[30]":"cuts and bruises","example[115]":"He escaped the crash with just a few cuts and bruises.","definition[47]":"a planned reduction in the amount or level of something","example[116]":"the president’s programme of budget cuts","example[117]":"Though it announced price cuts in June, its PCs still sell for more than those of its foreign competitors.","example[118]":"The chairman took an $800,000 cut in pay last year because of poor profits.","definition[48]":"the share of an amount of money that someone is allowed to take for themselves, especially as a reward or payment for helping someone to earn the total amount","example[119]":"The video has been hugely popular, yet Jones received only £1,600 after his agents took their cut.","definition[49]":"to reduce prices, amounts, money etc","example[120]":"She criticized supermarkets for failing to pass on profits to customers by cutting prices.","example[121]":"There’s always pressure on the organisation to increase productivity and cut costs.","example[122]":"Unfortunately, we need to cut our workforce by a third."}