{"word[0]":"programme","definition[0]":"a series of actions which are designed to achieve something important","example[0]":"the US space program","example[1]":"a United Nations programme to control the spread of AIDS","note[0]":"programme to do something","example[2]":"a programme of economic reforms","note[1]":"programme of","signpost[0]":"television/radio","definition[1]":"something that you watch on television or listen to on the radio","note[2]":"see/watch a programme","example[3]":"What’s your favourite television programme?","example[4]":"news and current affairs programmes","example[5]":"There’s a programme about killer whales next.","note[3]":"programme about/on","signpost[1]":"education","definition[2]":"a course of study","example[6]":"Stanford University’s MBA program","example[7]":"a research program","signpost[2]":"improvements","definition[3]":"actions that have been planned to keep something in good condition or improve something","example[8]":"a new fitness programme","signpost[3]":"play/concert","definition[4]":"a small book or piece of paper that gives information about a play, concert etc and who the performers are","example[9]":"a theatre programme","signpost[4]":"list of events","definition[5]":"a series of planned activities or events, or a list showing what order they will come in","example[10]":"What’s the programme for tomorrow?","note[4]":"programme for","example[11]":"a programme of exhibitions throughout the year","definition[6]":"a series of actions done in a particular order by a machine such as a washing machine","example[12]":"The light goes off when it finishes the programme.","heading[0]":"– Meaning 1: a series of actions which are designed to achieve something important","form[0]":"ADJECTIVES/NOUN + programme","collocation[0]":"an economic programme","example[13]":"The party did not have a clear economic programme.","collocation[1]":"a development programme","example[14]":"This project is a central part of the development programme for the area.","collocation[2]":"a reform programme","example[15]":"After the elections, they embarked on an ambitious reform programme.","collocation[3]":"an expansion programme","example[16]":"The company’s aggressive expansion program will double the size of the chain in the next four years.","collocation[4]":"a building programme","example[17]":"We will continue with our hospital building programme.","collocation[5]":"a spending programme","example[18]":"The government’s spending programme is the subject of vigorous debate.","collocation[6]":"the space programme","example[19]":"He was involved in the Soviet space programme.","collocation[7]":"a major/massive programme","example[20]":"A major programme of modernisation is transforming public transport in London.","collocation[8]":"an ambitious programme","example[21]":"The European Community embarked on an ambitious programme of research.","collocation[9]":"embark on/launch a programme","example[22]":"The company has embarked on an expansion programme.","collocation[10]":"carry out a programme","example[23]":"They attempted to implement a programme of reform.","heading[1]":"– Meaning 2: something that you watch on television or listen to on the radio","form[1]":"NOUN + programme","collocation[11]":"a television programme","example[24]":"There aren't many good TV programmes on an the moment.","collocation[12]":"a radio programme","example[25]":"I was once interviewed for a radio programme.","collocation[13]":"a cookery/wildlife/news etc programme","example[26]":"More and more people are watching cookery programmes on TV.","collocation[14]":"watch a programme","example[27]":"She was watching a wildlife programme.","collocation[15]":"see a programme","example[28]":"Did you see that programme last night about crocodiles?","collocation[16]":"listen to a programme","example[29]":"A lot of people listen to that programme on the way to work.","collocation[17]":"hear a programme","example[30]":"I heard an interesting programme on the radio yesterday.","collocation[18]":"present a programme","example[31]":"At the time she was also presenting several television programmes.","collocation[19]":"appear on a programme","example[32]":"I was invited to appear on a TV programme.","definition[7]":"something that you watch on television, or listen to on the radio","example[33]":"I watched an interesting programme about Egypt last night.","definition[8]":"a programme on television or the radio, especially an informal one in which people talk together, take part in a game etc","example[34]":"a late-night talk show","example[35]":"game shows","example[36]":"She hosts a weekly call-in radio show called ‘Got a question?’","display[0]":"documentary","definition[9]":"a programme that gives you facts and information about a serious subject, such as history, science, or social problems","example[37]":"a documentary about homeless people","example[38]":"a 50-minute television documentary","display[1]":"soap opera/soap","definition[10]":"a television or radio programme that tells an imaginary story about a group of people and their lives, and is often broadcast regularly for many years","example[39]":"the Australian soap opera ‘Neighbours’","example[40]":"the huge success of television soaps","display[2]":"sitcom","definition[11]":"an amusing programme in which there is a different story each week about the same group of people","example[41]":"the American sitcom ‘Friends’","display[3]":"reality TV","definition[12]":"television programmes that show real people in funny situations or situations in which they must compete with each other. Often the people are filmed continuously for weeks or months","example[42]":"the reality TV show ‘Big Brother’","example[43]":"The trouble with reality TV is that a lot of the time it’s really boring.","display[4]":"webcast","definition[13]":"a programme, event etc that is broadcast on the Internet","example[44]":"Universities may record and broadcast some lectures as webcasts.","display[5]":"podcast","definition[14]":"a file of recorded sound and sometimes pictures that you can download from the Internet","example[45]":"The interview is available as a podcast.","definition[15]":"to set a machine to operate in a particular way","example[46]":"The computers are programmed to search for key words and numbers.","note[5]":"programme something to do something","definition[16]":"to arrange for something to happen as part of a series of planned events or activities","example[47]":"What’s programmed for this afternoon?","definition[17]":"an important plan that will be continued over a period of time","example[48]":"The airline is halfway through an expansion programme.","example[49]":"The commission is in favour of the auto investment programs.","definition[18]":"a television or radio show","example[50]":"the main satellite used to broadcast programmes into Latin America","definition[19]":"to set a machine to work in a particular way","example[51]":"The system can be programmed to shut off the engine or stop it from restarting once the car is parked.","example[52]":"Cable TV operators generally agree that a well-programmed comedy network is an attractive asset."}