{"word[0]":"argument","definition[0]":"a situation in which two or more people disagree, often angrily","example[0]":"She had a big argument with her husband.","note[0]":"argument with","example[1]":"There have been a lot of arguments about who was responsible for the accident.","note[1]":"argument about/over","definition[1]":"a set of reasons that show that something is true or untrue, right or wrong etc","example[2]":"We need to provide a convincing argument as to why the system should be changed.","example[3]":"a powerful argument against smoking","note[2]":"argument for/against","example[4]":"A good argument can be made for comparing the IT revolution with the invention of writing itself.","example[5]":" the arguments in favour of banning tobacco advertising","note[3]":"argument in favour of","example[6]":"the familiar argument that the costs outweigh the benefits","note[4]":"argument that","definition[2]":"when you disagree with something or question whether it is right","example[7]":"If, for the sake of argument, you aren’t offered the job, what will you do?","note[5]":"for the sake of argument","example[8]":"Ian accepted the suggestion without argument.","note[6]":"do something without (further) argument","collocation[0]":"have an argument","example[9]":"I could hear my parents having an argument downstairs.","collocation[1]":"get into an argument/become involved in an argument","example[10]":"She didn’t want to get into another argument about money.","example[11]":"I left to avoid becoming involved in an argument.","collocation[2]":"start/cause an argument","example[12]":"He was deliberately trying to start an argument.","example[13]":"Money often causes arguments.","collocation[3]":"avoid an argument","example[14]":"I was anxious to avoid an argument.","collocation[4]":"win/lose an argument","example[15]":"The party hopes to win the argument about how to reform the health system.","example[16]":"The first one who resorts to violence is usually the one who’s lost the argument.","collocation[5]":"an argument breaks out","example[17]":"The men were drunk and an argument soon broke out.","collocation[6]":"an argument erupts","example[18]":"A bitter argument erupted between the brothers over who should inherit the money.","collocation[7]":"a big/huge/massive argument","example[19]":"There was a big argument about whether we should move to a new house.","collocation[8]":"a heated argument","example[20]":"Someone was having a heated argument with a police officer.","collocation[9]":"a bitter argument","example[21]":"There are bitter arguments about whether he was a hero or a war criminal.","collocation[10]":"a furious/fierce argument","example[22]":"As soon as she had gone a furious argument broke out.","collocation[11]":"a violent argument","example[23]":"The singer was hurt in a violent argument with her husband.","definition[3]":"a situation in which people speak angrily to each other because they disagree about something","example[24]":"an argument between two drivers over who had right of way","example[25]":"A 29-year-old man was shot and killed today after an argument over a gambling debt.","display[0]":"row","definition[4]":"a loud angry argument with someone, especially your boyfriend, girlfriend, or someone in your family. Row is also used about a serious disagreement between politicians about important public issues","example[26]":"There were always fights between my parents.","example[27]":"the continuing row over tax increases","example[28]":"A few months ago they had a big row, and Steve drove off and spent the weekend in London.","display[1]":"disagreement","definition[5]":"a situation in which people disagree with each other, but without shouting or getting angry","example[29]":"There were the occasional disagreements about money, but mostly we got on well.","example[30]":"Ginny had left the company after a disagreement with her boss.","display[2]":"quarrel","definition[6]":"an argument, especially one in which people get angry and that lasts a long time. Quarrel sounds more formal and more serious than argument or row","example[31]":"a bitter family quarrel","display[3]":"feud","definition[7]":"a very bitter argument between two groups, especially families, which lasts for many years and causes people to hate each other","example[32]":"The feud between the Hatfields and the McCoys raged for 20 years.","display[4]":"dispute","definition[8]":"a public or legal argument about something, especially one which continues for a long time","example[33]":"Morris has been involved in a long legal dispute with his publisher.","example[34]":"The settlement will resolve a long-running dispute over the country’s nuclear program.","display[5]":"war/battle of words","definition[9]":"an argument in which two people or groups criticize each other continuously in public","example[35]":"The war of words over construction delays at the airport has erupted again.","display[6]":"bust-up","definition[10]":"a very bad argument, especially one in which people decide to separate from each other","example[36]":"He had a bust-up with the team manager.","display[7]":"shouting match","definition[11]":"an angry argument in which people shout at each other","example[37]":"He got into a shouting match with another driver.","display[8]":"slanging match","definition[12]":"an argument in which people insult each other","example[38]":"He was sacked after a slanging match with a colleague.","heading[0]":"an argument that is not very serious","display[9]":"squabble","definition[13]":"an argument about something that is not important","example[39]":"There were the usual squabbles between brothers and sisters.","example[40]":"Voters are tired of petty squabbles between party leaders.","display[10]":"tiff","definition[14]":"an argument that is not very serious, between people who are in love","example[41]":"Gary had a bit of a tiff with his girlfriend.","display[11]":"misunderstanding","definition[15]":"a slight argument – a rather formal word which is often used humorously","example[42]":"There was a slight misunderstanding over the bill, but everything’s been sorted out now.","display[12]":"skirmish","definition[16]":"a short argument, especially between politicians or sports opponents","example[43]":"Evans and O'Brien had several political skirmishes."}