{"word[0]":"display","signpost[0]":"objects","definition[0]":"an arrangement of things for people to look at or buy","example[0]":"a dazzling display (=very good display) of flowers","example[1]":"The window display caught her eye.","example[2]":"display cases containing old photographs","example[3]":"a superb display of African masks","note[0]":"display of","signpost[1]":"entertainment","definition[1]":"a public performance of something that is intended to entertain people","example[4]":"a fireworks display","example[5]":"a display of juggling","signpost[2]":"on equipment","definition[2]":"a part of a piece of equipment that shows information, for example a computer screen","example[6]":"This time the display flashed a red warning signal.","collocation[0]":"a fine/magnificent/spectacular/dazzling display","example[7]":"The museum has a magnificent display of silver.","collocation[1]":"a window display","example[8]":"I stopped to look at something in the window display.","collocation[2]":"a special display","example[9]":"There was a special display of local photographs.","collocation[3]":"a floral display","example[10]":"The village has won an award for its floral displays.","collocation[4]":"create a display","example[11]":"She created an award-winning display at the national garden show.","form[0]":"display + NOUN","collocation[5]":"a display case/cabinet","example[12]":"There was a display case full of medals.","collocation[6]":"a display board","example[13]":"Some schools have a display board with photographs of all the staff.","collocation[7]":"a display stand","example[14]":"A lot of companies had impressive display stands in the conference hall.","definition[3]":"to show something to people, or put it in a place where people can see it easily","example[15]":"shop windows displaying the latest fashions","example[16]":"All the exam results will be displayed on the noticeboard.","definition[4]":"to clearly show a feeling, attitude, or quality by what you do or say","example[17]":"She displayed no emotion on the witness stand.","example[18]":"ten piano pieces, each written to display the talents of individual players","definition[5]":"if a computer or something similar displays information, it shows it on its screen","example[19]":"I pressed ‘return’ and an error message was displayed.","definition[6]":"if a male bird or animal displays, it behaves in a particular way as a signal to other birds or animals, especially to attract a female","definition[7]":"an attractive arrangement of objects for people to look at or buy, for example in a shop","example[20]":"enormous shops with beautiful window displays","example[21]":"the wide range of goods on display","definition[8]":"printing or page design to attract people’s attention, used especially in advertisements","example[22]":"big display adverts with prominent slogans","definition[9]":"the text or pictures you see on a computer screen, or the style, colour, brightness etc of this","example[23]":"the use of different kinds of devices to control a display on the computer monitor","example[24]":"Select ‘Display’ and a dialogue box will appear with a choice of screen display options.","definition[10]":"to arrange objects in an attractive way for people to look at or buy, for example in a shop","example[25]":"The clothes were beautifully displayed.","definition[11]":"if a computer displays information, it shows it on its screen","example[26]":"If you try to open a document that is already open, the software will display an error message."}