{"word[0]":"view","definition[0]":"what you think or believe about something","example[0]":"In my view, the country needs a change of government.","example[1]":"What’s your view on the subject?","note[0]":"view on/about","example[2]":"Their view is that competition is good for business.","note[1]":"view that","explanation[0]":"In everyday English, people usually say I think ... rather than In my view ..., and What do you think? rather than What is your view?:","example[3]":"What do you think about her new boyfriend?","signpost[0]":"way of considering","definition[1]":"a way of thinking about or understanding something","example[4]":"You need to have a clear view (=a definite idea) of the kind of book you want to write.","example[5]":"a realistic view of human nature","note[2]":"optimistic/pessimistic/balanced etc view","example[6]":"traditional views of religion","example[7]":"She took a pretty dim view of his behaviour.","note[3]":"take a dim/poor view of something","example[8]":"Mum’s view of the situation was different to mine.","note[4]":"view of","signpost[1]":"sight","definition[2]":"what you are able to see or whether you can see it","example[9]":"Fran hit him in full view of all the guests  (=where they could see it clearly).","example[10]":"During an eclipse, the Moon blocks our view of the Sun  (=stops us from seeing it).","example[11]":"The house has wonderful views over the valley.","note[5]":"good/bad/wonderful etc view","example[12]":"Suddenly the pyramids came into view.","note[6]":"be in view/come into view","example[13]":"The gun was hidden from view behind the door.","note[7]":"disappear/vanish/be hidden from view","example[14]":"We’d like a room with a view of the sea.","signpost[2]":"scenery","definition[3]":"the whole area that you can see from somewhere, especially when it is very beautiful or impressive","example[15]":"From the top you get a panoramic view of the city.","example[16]":"A huge nuclear reactor now spoils the view.","definition[4]":"a photograph or picture showing a beautiful or interesting place","example[17]":"The book contains over fifty scenic views of Cambridge.","signpost[3]":"chance to see something","definition[5]":"an occasion or time when it is possible for people to see something such as an art show","example[18]":"A private view of the Summer Exhibition will be held.","example[19]":"The painting is currently on view at the Tate.","note[8]":"on view","heading[0]":"– Meaning 1: what you think or believe about something","collocation[0]":"have/hold a view","example[20]":"He has very left-wing views.","collocation[1]":"take the view that ...","example[21]":"The Government took the view that the law did not need to be changed.","collocation[2]":"express a view","example[22]":"This is a chance for you to express your views.","collocation[3]":"give your view","example[23]":"He did not hesitate to give his own views on the subject.","collocation[4]":"share a view","example[24]":"This view is not shared by his colleagues.","collocation[5]":"support a view","example[25]":"There are many people who would support his views.","collocation[6]":"hear a view","example[26]":"a chance to hear people’s views on a range of different subjects","collocation[7]":"tell somebody your view","example[27]":"We want you to tell us your views.","collocation[8]":"somebody’s view changes","example[28]":"Your view about these things changes as you get older.","collocation[9]":"political views","example[29]":"His political views have not changed.","collocation[10]":"somebody’s personal view","example[30]":"My own personal view is that they’re being optimistic.","collocation[11]":"widely-held view","example[31]":"There is a widely-held view that young people eat too much junk food.","collocation[12]":"the general view","example[32]":"The general view was that he had done well.","collocation[13]":"strong views","example[33]":"She has strong views on education.","collocation[14]":"strongly held/deeply held views","example[34]":"He is known for his strongly held views on modern art.","collocation[15]":"different views","example[35]":"Different people have different views about this subject.","collocation[16]":"conflicting/opposing views","example[36]":"There are conflicting views about the best way to teach reading.","collocation[17]":"extreme","example[37]":"a politician who has extreme views on immigration","collocation[18]":"moderate","example[38]":"His views have recently become more moderate.","collocation[19]":"outrageous","example[39]":"The chairman said that Mr McNeil’s views were outrageous.","collocation[20]":"traditional","example[40]":"traditional views about women","collocation[21]":"old-fashioned","example[41]":"Some of his views now sound very old-fashioned.","collocation[22]":"popular/unpopular","example[42]":"This view has become increasingly popular in society.","example[43]":"It’s now a rather unpopular view.","collocation[23]":"right-wing/left-wing","example[44]":"the students’ extreme left-wing views","collocation[24]":"be of the same view","example[45]":"They were all of the same view.","collocation[25]":"be of differing/different views","example[46]":"They get on well, though they are of differing views on politics.","collocation[26]":"an exchange of views","example[47]":"There was a frank exchange of views at the meeting.","heading[1]":"– Meanings 3 & 4","collocation[27]":"have/get a view of something","example[48]":"She had a clear view of the street from her window.","collocation[28]":"enjoy/admire the view","example[49]":"They sat enjoying the view down the valley.","collocation[29]":"take in the view","example[50]":"Why don’t you walk along the coastline, taking in the breathtaking views?","collocation[30]":"block somebody’s view","example[51]":"A pillar blocked my view of the stage.","collocation[31]":"obscure the view","example[52]":"A wall of mist obscured the view.","collocation[32]":"spoil the view","example[53]":"Some local residents think the wind turbines spoil the view.","collocation[33]":"command a view","example[54]":"The room commanded an excellent view of the river.","form[0]":"ADJECTIVES/NOUN + view","collocation[34]":"wonderful/magnificent/spectacular/breathtaking","example[55]":"There are breathtaking views from the top of the hill.","collocation[35]":"a good view","example[56]":"From here we get a good view of the fortress.","collocation[36]":"a sea/ocean view","example[57]":"I’d like a room with a sea view.","collocation[37]":"a panoramic view","example[58]":"Everyone who made it to the summit was rewarded with a magnificent panoramic view.","collocation[38]":"a bird’s-eye view","example[59]":"The top of the bell tower in the square gives a bird’s-eye view of Venice.","collocation[39]":"be in view","example[60]":"From the window the car was clearly in view.","collocation[40]":"in full view of somebody","example[61]":"He took the money in full view of everyone.","collocation[41]":"come into view","collocation[42]":"disappear from view","example[62]":"She disappeared from view around the corner.","collocation[43]":"be hidden from view","example[63]":"The inside of the house was hidden from view by curtains.","definition[6]":"the area you can see from a window or place, especially when it is beautiful","example[64]":"The hotel has a view of the Colosseum.","example[65]":"There are great views of the Himalayas.","display[0]":"panorama","definition[7]":"an impressive view of a very large area that stretches a long way across in front of you","example[66]":"a panorama of snow-covered hills and mountains","example[67]":"From the top, there is a breathtaking panorama across to the southern slopes of Ben Nevis, Britain’s highest mountain.","display[1]":"vista","definition[8]":"a view of a large area of beautiful scenery","example[68]":"The road around the island offers some spectacular vistas.","example[69]":"On a sparkling spring day, the vista is quite superb.","example[70]":"In front, a simple porch offered a spectacular vista of coconut-fringed beach, lagoon, and open sea beyond.","display[2]":"scene","definition[9]":"what you see in a place, especially when people are moving around and doing things","example[71]":"His paintings are mainly of local scenes.","example[72]":"a peaceful village scene","definition[10]":"something that you see, especially something very impressive or surprising","example[73]":"The mountain is a magnificent sight, soaring up from the carpet of purple heather at its base.","example[74]":"It was an amazing sight. I had never seen elephants in the wild before.","example[75]":"They were met with the sight of riot police shaking hands with the demonstrators.","definition[11]":"to think about something or someone in a particular way","example[76]":"It’s an issue that can be viewed from several perspectives.","note[9]":"view something from a ... perspective/standpoint","example[77]":"The local people viewed newcomers with suspicion.","note[10]":"view something with caution/suspicion/scepticism etc","example[78]":"The law should be viewed as a way of meeting certain social goals.","note[11]":"view something as something","definition[12]":"to look at something, especially because it is beautiful or you are interested in it","note[12]":"view a house/an apartment/a property (=go to see a house etc that you are interested in buying)","example[79]":"Thousands of tourists come to view the gardens every year.","example[80]":"The mountain is best viewed from the north side.","note[13]":"view something from something","definition[13]":"to watch a television programme, film etc","example[81]":"an opportunity to view the film before it goes on general release"}