{"word[0]":"lift","signpost[0]":"move something upwards","definition[0]":"to move something or someone upwards into the air","example[0]":"Sophie lifted the phone before the second ring.","example[1]":"He lifted the lid on the pot of soup.","example[2]":"The lumber was lifted by crane and dropped into the truck.","example[3]":"They lifted Andrew onto the bed.","note[0]":"lift somebody/something onto/into/out of etc something","example[4]":"The driver was lifted from the wreck.","note[1]":"lift somebody from something","signpost[1]":"part of the body","definition[1]":"to move part of your body up to a higher position","example[5]":"He heard a scream and the hairs on the back of his neck began to lift.","example[6]":"She lifted her hand to knock on the door once again.","note[2]":"lift your hand/arm/leg etc","example[7]":"Pam lifted her shoulders in a little shrug.","example[8]":"She lifted her head to gaze at him.","note[3]":"lift your head/eyes","signpost[2]":"controls/laws","definition[2]":"to remove a rule or a law that says that something is not allowed","example[9]":"The government plans to lift its ban on cigar imports.","note[4]":"lift a restriction/an embargo/sanctions etc","signpost[3]":"by plane","definition[3]":"to take people or things to or from a place by aircraft","example[10]":"More troops are being lifted into the area as the fighting spreads.","signpost[4]":"clouds/mist","definition[4]":"if cloud or mist lifts, it disappears","signpost[5]":"sad feelings","definition[5]":"if feelings of sadness lift, they disappear","example[11]":"Jan’s depression seemed to be lifting at last.","signpost[6]":"use somebody’s ideas/words","definition[6]":"to take words, ideas etc from someone else’s work and use them in your work, without stating where they came from and as if they were your own words etc","example[12]":"The words were lifted from an article in a medical journal.","note[5]":"lift something from somebody/something","signpost[7]":"steal","example[13]":"They had lifted dozens of CDs from the store.","definition[7]":"if you lift your voice, you speak, shout, or sing more loudly","definition[8]":"to make prices, profit etc increase","example[14]":"The U.S. may use tax cuts to lift the economy.","signpost[8]":"vegetables","definition[9]":"to dig up vegetables that grow under the ground","example[15]":"She was lifting potatoes.","display[0]":"lift (up)","definition[10]":"to move something or someone upwards to a higher position, especially something heavy, either by using your hands or a machine","example[16]":"You shouldn’t lift anything heavy if you have a bad back.","example[17]":"She lifted the lid from a huge pot and took a sniff.","example[18]":"They lifted me onto a stretcher and took me to the ambulance.","example[19]":"He lifted the girl up onto his knee.","example[20]":"They used a crane to lift the carriages back onto the rails.","example[21]":"The massive bull lifted him bodily into the air and shook him repeatedly.","definition[11]":"to lift something to a higher position for a short time before lowering it again. Raise is more formal than lift","example[22]":"The bridge can be raised to allow ships to pass under it.","example[23]":"‘Cheers, everyone!’ said Larry, raising his glass.","display[1]":"pick up","definition[12]":"to lift something up from the ground, from a table etc, especially something small or light","example[24]":"She picked up her bag and left the room.","example[25]":"Tom picked the papers up off the floor.","example[26]":"Why don’t you just pick up the phone and call him?","example[27]":"Maurin picked up the gun and put it in his pocket.","example[28]":"The lioness picked her cub up by its neck.","example[29]":"There are papers all over the floor – could you pick them up and put them away?","example[30]":"The little girl’s mother laughed and bent down to pick her up.","example[31]":"The vacuum cleaner won’t pick this stuff up.","display[2]":"scoop up","definition[13]":"to lift someone or something quickly from the ground, from a table etc, using your hand or arm","example[32]":"She bent down and scooped up the little dog.","display[3]":"hoist","definition[14]":"to lift up something which is heavy and difficult to carry","example[33]":"Joe picked up the sack and hoisted it onto the truck.","example[34]":"The crowd hoisted him onto their shoulders and carried him triumphantly down the main street.","display[4]":"elevate","definition[15]":"to lift something to a higher position and keep it there","example[35]":"The doctor advised me to rest and elevate my ankle.","display[5]":"put your hand up","definition[16]":"to lift your arm into the air, for example because you want to speak in a class or when voting","example[36]":"Put your hand up if you know the answer.","signpost[9]":"in a building","definition[17]":"a machine that you can ride in, that moves up and down between the floors in a tall building","example[37]":"They took the lift down to the bar.","example[38]":"It’s on the 3rd floor. Let’s use the lift.","signpost[10]":"in a car","definition[18]":"if you give someone a lift, you take them somewhere in your car","synonym[0]":"ride","example[39]":"Do you want a lift into town?","example[40]":"John gave me a lift home.","example[41]":"He very kindly offered me a lift.","signpost[11]":"lifting movement","definition[19]":"a movement in which something is lifted or raised up","example[42]":"She does sit-ups and leg lifts every morning.","signpost[12]":"wind/aircraft","definition[20]":"the pressure of air that keeps something such as an aircraft up in the air or lifts it higher","definition[21]":"to make prices, profits etc rise","example[43]":"Improving international demand lifted product prices.","example[44]":"The interim dividend to shareholders has been lifted from 2.7p to 3.02p.","definition[22]":"to remove a law or rule","example[45]":"After the exchange controls were lifted, Swedes rushed to invest abroad.","example[46]":"the decision to lift economic sanctions against the country"}