{"word[0]":"would","signpost[0]":"past intentions/expectations","definition[0]":"used to say what someone intended to do or expected to happen","example[0]":"They said they would meet us at 10.30 at the station.","example[1]":"She said she wouldn’t be coming to the library anymore.","example[2]":"Arnold knew he would be tired the next day.","example[3]":"It would soon be dark.","signpost[1]":"imagined situations","definition[1]":"used when talking about the result of a possible or imagined situation or event, or describing one","example[4]":"What would you do if you won a million pounds?","example[5]":"I would be amazed if I got the job.","example[6]":"It would be lovely to see you.","definition[2]":"used when talking about something that did not happen, or a situation that cannot exist","example[7]":"I would have phoned you, but there wasn’t time.","example[8]":"Alex would never have found out if you hadn’t told him.","example[9]":"What would have happened if I hadn’t been here?","example[10]":"Everything would be very different if your father were still alive.","definition[3]":"used to mention an unlikely situation or event that you want to happen","example[11]":"I wish they would come and visit us.","example[12]":"If only he would listen to me.","signpost[2]":"past habits","definition[4]":"used to say that something happened often or regularly in the past","example[13]":"When we worked in the same office, we would often have coffee together.","example[14]":"On summer evenings they would sit out in the garden.","signpost[3]":"requesting","definition[5]":"used to ask someone politely to do something","example[15]":"Would you shut the window, please?","example[16]":"Would you mind waiting outside?","example[17]":"Would someone please tell me what is going on?","signpost[4]":"offering/inviting","definition[6]":"used to offer something to someone or invite them somewhere politely","example[18]":"Would you like a coffee?","example[19]":"We’re going to the theatre this evening. Would you be interested in coming?","signpost[5]":"what somebody wants","definition[7]":"used to say that someone wants something or wants to do something","example[20]":"I’d hate (=I do not want) to disappoint you.","example[21]":"Yes, please, I’d love a coffee.","note[0]":"would like/love/prefer","example[22]":"My parents would like to meet you.","example[23]":"Claudia would have liked to refuse  (=wanted to refuse), but she didn’t dare.","example[24]":"I’d rather stay in this evening, if that’s all right with you.","note[1]":"would rather/sooner","signpost[6]":"past purpose","definition[8]":"used after ‘so that’ to show that someone was trying to make something happen or prevent something","example[25]":"We packed all the books in wooden boxes so that they wouldn’t get damaged.","definition[9]":"used when giving or asking for advice","example[26]":"I’d try to get there early if you can.","example[27]":"I would talk to the doctor if I were you.","example[28]":"What would you do if you were in my position?","signpost[7]":"typical behaviour","definition[10]":"used to say that an action is typical or expected – usually used to show disapproval","example[29]":"You would go and spoil it, wouldn’t you!","example[30]":"She insists that she did nothing wrong, but then she would say that, wouldn’t she?"}