{"word[0]":"discipline","definition[0]":"a way of training someone so that they learn to control their behaviour and obey rules","example[0]":"The book gives parents advice on discipline.","example[1]":"serious discipline problems in the police force","definition[1]":"the ability to control your own behaviour, so that you do what you are expected to do","example[2]":"Working from home requires a good deal of discipline.","definition[2]":"a way of training your mind or learning to control your behaviour","example[3]":"Martial arts teach respect, discipline, and cooperation.","example[4]":"Learning poetry is a good discipline for the memory.","note[0]":"discipline for","definition[3]":"an area of knowledge or teaching, especially one such as history, chemistry, mathematics etc that is studied at a university","form[0]":"ADJECTIVES/NOUN + discipline","collocation[0]":"good/strong/firm discipline","example[5]":"Without good discipline in a school, the standard of teaching suffers.","collocation[1]":"strict discipline","example[6]":"Some parents complained about the school's strict discipline.","collocation[2]":"poor discipline","example[7]":"Problems tend to arise in families where there is poor discipline.","collocation[3]":"school discipline","example[8]":"a government report into how to improve school discipline","collocation[4]":"military discipline","example[9]":"I hated the army and the routine of military discipline.","collocation[5]":"keep discipline","example[10]":"A good teacher knows how to maintain discipline.","collocation[6]":"enforce discipline","example[11]":"It is entirely for your own good that we enforce discipline.","collocation[7]":"a lack of discipline","example[12]":"The principal never tolerated a lack of discipline.","collocation[8]":"a breach of discipline","example[13]":"Being absent without permission was a breach of discipline.","form[1]":"discipline + NOUN","collocation[9]":"a discipline problem","example[14]":"Successful schools have fewer discipline problems.","definition[4]":"to punish someone in order to keep order and control","example[15]":"The officers were later disciplined.","definition[5]":"to teach someone to obey rules and control their behaviour","example[16]":"Different cultures have different ways of disciplining their children."}