{"word[0]":"chart","definition[0]":"information that is clearly arranged in the form of a simple picture, set of figures, graph etc, or a piece of paper with this information on it","synonym[0]":"diagram","example[0]":"a chart showing last year’s sales","example[1]":"a weather chart","example[2]":"the theatre’s seating chart","definition[1]":"a detailed map, especially of an area of the sea or the stars","form[0]":"types of charts","collocation[0]":"the pop charts","example[3]":"Their new single went straight to number 1 in the pop charts.","collocation[1]":"the singles charts","example[4]":"The song reached number 9 in the singles charts.","collocation[2]":"the album charts","example[5]":"This put Marley into the album charts for the first time.","collocation[3]":"the indie charts","example[6]":"The song went straight to the top of the indie charts.","collocation[4]":"be in the charts","example[7]":"The song was in the charts for weeks.","collocation[5]":"go into/enter the charts","example[8]":"The album entered the UK charts at number 2.","collocation[6]":"hit the charts","example[9]":"The group eventually hit the charts.","collocation[7]":"top the charts/be top of the charts","example[10]":"‘Without You’ topped the British charts for five weeks.","form[1]":"chart + NOUN","collocation[8]":"a chart hit","example[11]":"At last the band had got a chart hit.","collocation[9]":"chart success","example[12]":"It looks like they are set for chart success.","collocation[10]":"number 1/5/15 etc in the charts","example[13]":"In 1962 'Love Me Do' reached only number 17 in the charts.","definition[2]":"to record information about a situation or set of events over a period of time, in order to see how it changes or develops","example[14]":"Scientists have been charting temperature changes in the oceans.","definition[3]":"to make a plan of what should be done to achieve a particular result","example[15]":"Each team was responsible for making its own decisions and charting its own course.","definition[4]":"to make a map of an area of land, sea, or stars, or to draw lines on a map to show where you have travelled","definition[5]":"if a record charts, it enters the weekly list of the most popular records","example[16]":"Their next single didn’t chart.","definition[6]":"a mathematical drawing or list, showing information arranged in a way that is clear and easy to understand","example[17]":"European companies account for the remaining 89% of sales - see chart on next page.","definition[7]":"to carefully record information about a situation over a period of time to see how it changes or develops","example[18]":"We are collecting large amounts of information on households and companies in order to chart the effects of taxes and benefits.","definition[8]":"to plan something new in detail","example[19]":"a national conference set up to chart a democratic future for the country"}