{"word[0]":"complain","definition[0]":"to say that you are annoyed, not satisfied, or unhappy about something or someone","example[0]":"Residents are complaining because traffic in the area has increased.","example[1]":"‘You never ask my opinion about anything, ’ Rod complained.","example[2]":"Employees complained bitterly about working conditions.","example[3]":"She complained that no one had been at the airport to meet her.","note[0]":"complain (that)","example[4]":"She often complains about not feeling appreciated at work.","note[1]":"complain about","example[5]":"Several women have complained of sexual harassment.","note[2]":"complain of","example[6]":"Neighbours complained to the police about the dogs barking.","note[3]":"complain to","explanation[0]":"You complain about something or someone","example[7]":"They complained about the service","bad_example[0]":"They complained against the service","bad_example[1]":"They complained for the service","collocation[0]":"complain bitterly","example[8]":"My grandfather’s always complaining bitterly about how expensive things are.","collocation[1]":"complain loudly","example[9]":"The kids were complaining loudly about the heat.","collocation[2]":"constantly complain","example[10]":"She was constantly complaining about her job.","collocation[3]":"have the right to complain","example[11]":"You have the right to complain if you’re not satisfied with the service you’re getting.","collocation[4]":"have (good) reason to complain","example[12]":"We felt we had good reason to complain about the food at the hotel.","collocation[5]":"have little/no reason to complain","example[13]":"The school is good and parents have little reason to complain.","collocation[6]":"have cause to complain","example[14]":"Patients sometimes have cause to complain about the hospital treatment they receive.","collocation[7]":"be in a position to complain","example[15]":"If you feel you are bullied at work, you are certainly in a position to complain.","collocation[8]":"be the first to complain","example[16]":"He’s the first to complain if he thinks something is unfair.","definition[1]":"to say that you are annoyed, unhappy, or not satisfied about something or someone","example[17]":"Several customers complained about the service they received.","example[18]":"‘I wish you’d stop telling me what to do, ’ she complained.","display[0]":"make a complaint","definition[2]":"to formally complain about something to someone in authority","example[19]":"His parents made a complaint to the head teacher.","display[1]":"protest","definition[3]":"to complain about something that you think is wrong, especially publicly","example[20]":"Demonstrators were protesting against the war.","definition[4]":"to say that you oppose or disapprove of something","example[21]":"Local residents have objected to the plan.","example[22]":"Some teachers objected to the scheme.","display[2]":"grumble","definition[5]":"to keep complaining in a bad-tempered way about something","example[23]":"Rail travellers have been grumbling about the increase in ticket prices.","example[24]":"What’s he grumbling about now?","display[3]":"moan/whine","definition[6]":"to keep complaining in an annoying way","example[25]":"Everyone was moaning about the hotel food.","example[26]":"Stop whingeing and get on with your work!","display[4]":"kick up/make a fuss","definition[7]":"to complain or become angry about something, especially something that is not very important","example[27]":"The soup wasn’t hot enough, but he didn’t want to make a fuss.","example[28]":"He kicked up such a fuss that they were offered another room."}