{"word[0]":"lot","signpost[0]":"group of people/things","definition[0]":"a group of people or things considered together","example[0]":"Could you help me carry this lot upstairs?","example[1]":"Come on, you lot, hurry up!","example[2]":"His friends are a strange lot.","example[3]":"The last lot of people offered £70,000.","note[0]":"lot of","example[4]":"I did three lots of exams last summer.","signpost[1]":"somebody’s situation","definition[1]":"your lot is your work, duties, social position etc, especially when they could be better","example[5]":"She seems happy enough with her lot.","example[6]":"The unions have always tried to improve the lot of their members.","definition[2]":"an area of land used for building on or for another purpose","example[7]":"the vacant lot (=empty land) behind the Commercial Hotel","example[8]":"a used-car lot","definition[3]":"a building and the land surrounding it where films are made","synonym[0]":"studio","example[9]":"the Universal Studios lot","signpost[2]":"thing to be sold","definition[4]":"something, or a group of things, that is sold at an auction","example[10]":"Lot 54 is a Victorian lamp.","signpost[3]":"choosing","definition[5]":"if someone is chosen by lot, several people each take a piece of paper or an object from a container, and the person who is chosen is the one who gets a particular marked paper or object","example[11]":"In Athens at that time, judges were chosen by lot.","definition[6]":"to choose something or someone by lot","example[12]":"We drew lots to decide who should go first.","definition[7]":"a Polish airline","definition[8]":"something that is sold at an AUCTION, especially a group of things that are sold together","example[13]":"The auction was a record sell-out, with all but two of 111 lots sold for a total of £6.3 million.","definition[9]":"a group of shares that are sold together","definition[10]":"a quantity of goods that is produced at the same time or sold together as a group","example[14]":"Batch production is the production of standardised units in small or large lots.","definition[11]":"an area of land, especially one used for building on","example[15]":"a car lot"}