{"word[0]":"sympathy","plural[0]":"sympathies","type[0]":"plural, uncountable","definition[0]":"the feeling of being sorry for someone who is in a bad situation","example[0]":"Our sympathies are with the families of the victims.","example[1]":"I have a lot of sympathy for her; she had to bring up the children on her own.","note[0]":"sympathy for","example[2]":"I have absolutely no sympathy for students who get caught cheating in exams.","definition[1]":"belief in or support for a plan, idea, or action, especially a political one","example[3]":"Her sympathies lie firmly with the Conservative Party.","example[4]":"Matheson is known for his pro-socialist sympathies.","note[1]":"Communist/Republican/left-wing etc sympathies","example[5]":"Willard is in sympathy with many Green Party issues.","note[2]":"in sympathy with something","example[6]":"Sullivan expressed sympathy for the striking federal workers.","note[3]":"sympathy with/for","definition[2]":"a feeling that you understand someone because you are similar to them","example[7]":"There was no personal sympathy between them.","collocation[0]":"have/feel sympathy for somebody","example[8]":"It’s hard not to feel sympathy for the losing team.","collocation[1]":"express/offer (your) sympathy","example[9]":"Everyone there expressed their sympathy.","collocation[2]":"get sympathy from somebody","example[10]":"I thought at least I’d get some sympathy from you.","collocation[3]":"deserve sympathy","example[11]":"He doesn't deserve any sympathy - it's his own fault.","collocation[4]":"play on somebody’s sympathy","example[12]":"If that doesn’t work, she knows how to play on his sympathy.","collocation[5]":"expect sympathy","example[13]":"I know I can’t expect any sympathy from her!","collocation[6]":"deep/deepest sympathy","example[14]":"We'd like to offer our deepest sympathy to Hilda and her family.","collocation[7]":"great sympathy","example[15]":"I have great sympathy for the people affected by the housing crisis.","collocation[8]":"a message/letter of sympathy","example[16]":"We are grateful for all the messages of sympathy we have received.","collocation[9]":"an expression of sympathy","example[17]":"I murmured an expression of sympathy.","collocation[10]":"have every sympathy for somebody","example[18]":"I have every sympathy for people who find it hard to give up smoking.","collocation[11]":"you have my sympathy","example[19]":"It must be difficult – you have my sympathy.","collocation[12]":"extend your sympathy to somebody","example[20]":"I’d like to extend my deepest sympathy to the victim’s family.","collocation[13]":"my/our sympathy goes out to somebody","example[21]":"Our sympathy goes out to Peggy in her great loss.","definition[3]":"if workers come out in sympathy with workers who STRIKE (=refuse to work), they refuse to work as well","example[22]":"The truck drivers are on strike, and other employees have downed tools  (=stopped working) in sympathy.","definition[4]":"if prices, rates, investments etc change in sympathy with other prices etc, they change at the same time or rate","example[23]":"Wheat futures prices rose in sympathy with corn and soybeans."}