{"word[0]":"king","signpost[0]":"ruler","definition[0]":"a man who rules a country because he is from a royal family","example[0]":"On 2 December Henry VI was crowned king (=made the king at an official ceremony).","example[1]":"Henry VIII, King of England","note[0]":"king of","definition[1]":"if you live like a king, feel like a king etc, you are very successful, happy, rich etc","example[2]":"With her at my side, I felt like a king.","signpost[1]":"chess","definition[2]":"the most important piece in chess","definition[3]":"a playing card with a picture of a king on it","heading[0]":"– Meaning 1 : a man who rules a country because he is from a royal family","collocation[0]":"become king","example[3]":"Prince Charles will become king when his mother, Queen Elizabeth, dies.","collocation[1]":"be crowned king","example[4]":"He was crowned king upon the death of his father.","collocation[2]":"depose a king","example[5]":"The Spanish king was deposed in 1931.","collocation[3]":"a king rules/reigns","example[6]":"How could a Christian king rule if he was banned from the Church?","collocation[4]":"a king abdicates","example[7]":"It shocked the nation when the king abdicated.","collocation[5]":"the rightful king","example[8]":"The Duke of Gloucester claimed that he was the rightful king.","collocation[6]":"the future king","example[9]":"She married the future king of France, Philip Augustus.","collocation[7]":"allegiance/loyalty to a king","example[10]":"They were fighting out of loyalty to their king.","collocation[8]":"a king’s subjects","example[11]":"The new laws were very unpopular with the king’s subjects.","definition[4]":"the male ruler of a country, who comes from a royal family","example[12]":"George III was the king of England at that time.","example[13]":"King Harald V of Norway","display[0]":"queen","definition[5]":"a woman who rules a country because she is from a royal family, or the wife of a king","example[14]":"She became queen when she was only 14 years old.","example[15]":"Queen Elizabeth II of the United Kingdom","display[1]":"monarch","definition[6]":"a king or queen","example[16]":"The bishops were appointed by the monarch.","display[2]":"monarchy","definition[7]":"a country that is ruled by a king or queen, or this type of political system","example[17]":"Britain is a constitutional monarchy.","example[18]":"Some people want the monarchy to be abolished.","display[3]":"prince","definition[8]":"the son of a king, queen, or prince, or the male ruler of a small country or state","example[19]":"Prince Rainier of Monaco","example[20]":"The prince will inherit the throne when his father dies.","definition[9]":"someone such as a king, who has official power over a country and its people","example[21]":"the ruler of Babylonia","example[22]":"General Musharraf was the former military ruler of Pakistan.","display[4]":"emperor","definition[10]":"the ruler of an empire (=group of countries)","example[23]":"the Habsburg emperors of the 19th century","example[24]":"Emperor Hirohito","display[5]":"sovereign","example[25]":"It was hoped that a meeting of the two sovereigns would ease tensions between the countries.","display[6]":"regent","definition[11]":"someone who governs instead of a king or queen, because the king or queen is ill, absent, or still a child","example[26]":"Edward II left his friend Gaveston as regent.","display[7]":"the crown","definition[12]":"the position of king or queen","example[27]":"Warwick was a loyal servant of the crown.","definition[13]":"Elvis Presley; an informal name still used for the famous singer, especially by people who love his music","definition[14]":"if something is king, it is the most important thing and has a strong influence on people’s decisions","example[28]":"We were convinced of the superiority of our product, but ultimatelythe customer is king and it was rejected.","example[29]":"Mr Smith suggests thatcash is king and that readers should look to the health of a company’s cash flow.","definition[15]":"someone who is very influential or successful in a particular area","synonym[0]":"MOGUL","example[30]":"Even the supermarket kings were nervous about the recession."}