{"word[0]":"relative","definition[0]":"a member of your family","synonym[0]":"relation","example[0]":"a gathering of friends and relatives","example[1]":"Her boyfriend is a distant relative of mine.","note[0]":"a close/distant relative","collocation[0]":"a close relative","example[2]":"He lost several close relatives in the war.","collocation[1]":"a distant relative","example[3]":"She claims to be a distant relative of the Queen.","collocation[2]":"a blood relative","example[4]":"332 kidneys were donated last year by blood relatives or spouses.","collocation[3]":"a living/surviving relative","example[5]":"As far as she knew, she had no living relatives.","collocation[4]":"a relative by marriage","example[6]":"How many women would be willing to care for distant relatives by marriage?","collocation[5]":"friends and relatives","example[7]":"About thirty-five close friends and relatives attended the wedding.","definition[1]":"a member of your family, especially one who does not live with you","example[8]":"Most of her relatives were able to come to the wedding.","example[9]":"We have some distant relatives in Australia.","definition[2]":"a member of your family. Relation means the same as relative. It is often used when talking about whether someone is in the same family as another person","example[10]":"Big cities can be lonely places if you have no friends or relations there.","example[11]":"‘What relation is she to you?’ ‘She’s my half sister.’","example[12]":"He’s no relation to the singer.","display[0]":"descendant","definition[3]":"someone who is a family member of a person who lived and died a long time ago, for example the great-grandchild of that person","example[13]":"The people are the descendants of slaves who were brought over from Africa.","display[1]":"ancestor","definition[4]":"a member of your family who lived a long time ago, especially hundreds of years ago","example[14]":"My ancestors originally came from Ireland.","display[2]":"forefathers","definition[5]":"people in your family who lived a long time ago – often used in historical descriptions","example[15]":"His forefathers came to America over a century ago.","display[3]":"extended family","definition[6]":"a family group that consists not only of parents and children, but also includes grandparents, aunts etc","example[16]":"Extended families rarely live together in Britain, but they are still important.","display[4]":"folks","definition[7]":"your family, especially your parents","example[17]":"Are you going to see your folks at Christmas?","display[5]":"next of kin","definition[8]":"the person or people who are most closely related to you, for example your husband or mother, and who need to be told if something serious happens to you","example[18]":"The next of kin must be notified of his death before his name is released to the press.","definition[9]":"having a particular quality when compared with something else","example[19]":"The relative merits of both approaches have to be considered.","example[20]":"her opponent’s relative lack of experience","example[21]":"You may think you’re poor, but it’s all relative (=you are not poor compared to some people).","definition[10]":"having a particular value or quality when compared with similar things","example[22]":"therelative strength of the dollar","example[23]":"IBM was a relative latecomer to the laptop market."}