{"plural[0]":"bodies","signpost[0]":"people/animals","definition[0]":"the physical structure of a person or animal","example[0]":"the human body","example[1]":"My fingers were numb and my whole body ached.","example[2]":"He needs to overcome a negative body image (=what you think about your own body).","example[3]":"Your body temperature is higher in the daytime than at night.","note[0]":"body weight/temperature/size","example[4]":"For their body size, these birds lay very small eggs.","signpost[1]":"dead person","definition[1]":"the dead body of a person","example[5]":"A dog found the body of a girl in the woods.","signpost[2]":"group","definition[2]":"a group of people who work together to do a particular job or who are together for a particular purpose","example[6]":"The British Medical Association is the doctors’ professional body.","example[7]":"Kaplan served on the governing body of the museum  (=the group who control the museum).","example[8]":"The student body (=all the students in a school or college) numbers 5,000.","example[9]":"The research will be used by government departments and other public bodies (=groups whose work is connected to the government).","example[10]":"The women moved towards the building in a body.","note[1]":"in a body","example[11]":"There were reports of a large body of armed men near the border.","note[2]":"body of","signpost[3]":"middle part","definition[3]":"the central part of a person or animal’s body, not including the head, arms, legs, or wings","example[12]":"Nick had bruises on his face and body.","example[13]":"The bird has a small body and long wings.","definition[4]":"the main structure of a vehicle not including the engine, wheels etc","example[14]":"Workers at the factory are making steel bodies for cars.","definition[5]":"an object that is separate from other objects","example[15]":"Keep the caps on the bottles to prevent foreign bodies entering them  (=objects that should not be there).","definition[6]":"if your hair has body, it is thick and healthy","example[16]":"This shampoo will give more body to your hair.","definition[7]":"if food or an alcoholic drink has body, it has a strong flavour (=taste)","example[17]":"A small amount of tomato paste will give extra colour and body to the sauce.","signpost[4]":"instrument","definition[8]":"the wide part of a musical instrument such as a violin or guitar, or of a sports racket (=bat)","example[18]":"The guitar is 16 inches wide across the body.","definition[9]":"a type of tight-fitting shirt worn by women that fastens between their legs","example[19]":"There are billions of cells in an adult human body.","collocation[0]":"the female/male body","example[20]":"his drawings of the female body","collocation[1]":"the upper/lower body","example[21]":"Slowly raise your upper body into a sitting position.","collocation[2]":"somebody’s whole body","example[22]":"Her whole body froze with fear.","form[0]":"body + NOUN","collocation[3]":"body weight","example[23]":"You have exactly the right body weight for your height.","collocation[4]":"body temperature","example[24]":"Exercise will raise your body temperature.","collocation[5]":"body size/shape","example[25]":"differences in body size and shape","collocation[6]":"body fluids","example[26]":"Replace your body fluids by drinking lots of water.","collocation[7]":"body fat","example[27]":"Males have less body fat than females.","collocation[8]":"body language","example[28]":"Nervousness is usually clearly expressed in body language.","collocation[9]":"body image","example[29]":"People tend to have their own body image fixed in their minds.","definition[10]":"the shape, size, and appearance of someone’s body","example[30]":"Many women are not happy with their bodies.","example[31]":"His clothes emphasized his strong body.","display[0]":"figure","definition[11]":"a woman’s figure is the shape of her body – used especially when it is attractive","example[32]":"She has a really nice figure.","example[33]":"Freya had an enviably slim figure.","display[1]":"build","definition[12]":"the size and shape of someone’s body – used in the following phrases","example[34]":"Police described the man as tall and of medium build.","example[35]":"He was of heavy build.","example[36]":"She has a very slight build.","display[2]":"physique","definition[13]":"the size and appearance of someone’s body – used especially about men who look attractive","example[37]":"He was over 1.8 m tall with a muscular physique.","example[38]":"Ben has a very athletic physique.","heading[0]":"a dead body","example[39]":"Her body was discovered at the bottom of a cliff.","example[40]":"Firefighters found the body of a woman in the house.","display[3]":"corpse","definition[14]":"the dead body of a person. Corpse is is used when you are thinking about the body as an object rather than a person","example[41]":"Pathologists examined the corpse.","display[4]":"carcass","definition[15]":"the dead body of an animal","example[42]":"a whale carcass","example[43]":"The carcasses of the infected animals were burned.","display[5]":"remains","definition[16]":"parts of a dead person or animal, especially when they died a long time ago","example[44]":"Police found human remains under the floorboards of the house."}