{"word[0]":"receive","signpost[0]":"be given something","definition[0]":"to be given something","example[0]":"All the children will receive a small gift.","example[1]":"Lee received 324 votes (=324 people voted for him).","example[2]":"She received no support from her parents.","note[0]":"receive attention/affection/support","example[3]":"They will be entitled to receive unemployment benefit.","note[1]":"receive payment/money/a pension etc","example[4]":"He went up to receive his award from the mayor.","note[2]":"receive a prize/award/gift etc","example[5]":"16 to 18-year-olds receiving full-time education","note[3]":"receive education/training","example[6]":"She received an honorary degree from Harvard.","note[4]":"receive something from somebody","explanation[0]":"Receive is a rather formal word, which is used especially in written English. In everyday English, people usually use get. ","example[7]":"What did you get for your birthday?","example[8]":"She got a degree from York University.","signpost[1]":"be sent something","definition[1]":"to get a letter, message, or telephone call, or something which someone has sent you","example[9]":"If you would like to receive further information, return the attached form.","example[10]":"We have received numerous complaints about the noise.","example[11]":"He received a letter from his insurance company.","signpost[2]":"treatment","definition[2]":"if you receive a particular type of medical treatment, it is done to you","example[12]":"He received hospital treatment for a cut over his eye.","signpost[3]":"reaction to something","definition[3]":"to react in a particular way to a suggestion, idea, performance etc","example[13]":"The film was well received by critics  (=they said it was good).","example[14]":"He received the news in silence.","explanation[1]":"Receive is often passive in this meaning","definition[4]":"to officially accept someone as a guest or member of a group","example[15]":"She isn’t well enough to receive visitors yet.","note[5]":"receive guests/visitors","example[16]":"She was later received into the Church.","note[6]":"receive somebody into something","signpost[4]":"by radio","definition[5]":"if a radio or television receives radio waves or other signals, it makes them become sounds or pictures","definition[6]":"to be able to hear a radio message that someone is sending","example[17]":"‘Receiving you loud and clear!’"}