{"word[0]":"advertisement","definition[0]":"a picture, set of words, or a short film, which is intended to persuade people to buy a product or use a service, or that gives information about a job that is available, an event that is going to happen etc","example[0]":"They put an advertisement in ‘The Morning News’, offering a high salary for the right person.","example[1]":"The organizers of the concert had taken out a full page advertisement in ‘The New York Times’.","example[2]":"Only a handful of people answered the advertisement.","example[3]":"The Sunday papers are full of advertisements for cars.","note[0]":"advertisement for","example[4]":"She saw an advertisement for a ski vacation in Vermont.","form[0]":"ADJECTIVES/NOUN + advertisement","collocation[0]":"a car/holiday/shampoo etc advertisement","example[5]":"a glossy magazine full of car advertisements","collocation[1]":"a job advertisement","example[6]":"Jo was reading the job advertisements in the newspaper.","collocation[2]":"a newspaper/magazine advertisement","example[7]":"I got the apartment through a newspaper advertisement.","collocation[3]":"a television/TV/Internet advertisement","example[8]":"the new TV advertisement for the Volkswagen Golf","collocation[4]":"a full-page advertisement","example[9]":"The organization took out a full-page advertisement in the New York Times.","collocation[5]":"a pop-up advertisement","example[10]":"You can buy software that blocks unwanted pop-up advertisements.","collocation[6]":"put/place an advertisement in a paper/newspaper","example[11]":"I tried putting an advertisement for lodgers in the local paper.","collocation[7]":"post an advertisement","example[12]":"The agency has posted an advertisement on its website for graduates to work overseas.","collocation[8]":"take out an advertisement","example[13]":"Their record company took out full-page advertisements in the music press to promote the album.","collocation[9]":"run/carry an advertisement","example[14]":"Broadcasters are no longer allowed to run cigarette advertisements.","collocation[10]":"answer an advertisement","example[15]":"I answered an advertisement in the paper for volunteers.","example[16]":"an advertisement for shampoo","example[17]":"They placed an advertisement in the newspaper.","display[0]":"ad","definition[1]":"an advertisement","example[18]":"She’s been in several TV ads.","display[1]":"advert","example[19]":"a job advert","example[20]":"He took out a front-page advert for his shop.","display[2]":"commercial","definition[2]":"an advertisement on television or radio","example[21]":"television commercials","example[22]":"He was in some commercials for beer.","display[3]":"trailer","definition[3]":"an advertisement in the cinema, on television, or online for a film or programme which will be shown soon","example[23]":"A second trailer for Richard Friedman’s film has just been added to the website.","display[4]":"promotion","definition[4]":"a series of advertisements for a company’s products","example[24]":"The company has spent more than $300 million on promotions for the brand.","display[5]":"poster","definition[5]":"an advertisement on a wall","example[25]":"They selected a famous artist to do the poster for the upcoming performance.","display[6]":"billboard","definition[6]":"a large sign next to a road, with an advertisement on it","example[26]":"billboard advertisements","example[27]":"A huge hoarding shows two contrasting images.","display[7]":"flyer","definition[7]":"a piece of paper with an advertisement on it, often given to you in the street","example[28]":"Someone was handing out flyers for a new nightclub.","display[8]":"banner ad","definition[8]":"an advertisement across the top of a page on the Internet","example[29]":"Banner ads are becoming more sophisticated.","display[9]":"junk mail","definition[9]":"unwanted advertisements that you get in the post","example[30]":"I never read junk mail.","display[10]":"spam","definition[10]":"unwanted emails advertising things","example[31]":"I’m trying to delete all the spam.","display[11]":"classified ad","definition[11]":"a short advertisement that you put in a newspaper if you want to buy or sell something","example[32]":"The bike was advertised for sale in the small ads section.","definition[12]":"a picture, piece of film, or piece of writing that is used to tell people publicly about a product or service in order to persuade them to buy it","example[33]":"She appears in advertisements for health foods.","example[34]":"a television advertisement for a brand of toothpaste","example[35]":"The company has placed advertisements in today’s Wall Street Journal.","example[36]":"The importers of the faulty driers have run advertisements asking owners to contact them."}