{"word[0]":"must","past_tense[0]":"had to","definition[0]":"to have to do something because it is necessary or important, or because of a law or order","example[0]":"All passengers must wear seat belts.","example[1]":"It’s getting late. I really must go.","example[2]":"You must work hard.","example[3]":"We must all be patient.","example[4]":"Must I pay now?","example[5]":"For the engine to work, the green lever must be in the ‘up’ position.","example[6]":"Accidents must be reported to the safety officer.","explanation[0]":"In everyday English, people usually say someone has to or has got to do something rather than say they must do something, which can sound slightly formal or emphatic:","example[7]":"Everyone has to wear a seat belt.","example[8]":"I‘ve got to go at four o’clock.","example[9]":"Do I have to pay now?","definition[1]":"used in negative sentences to say that something should not happen, because of a rule or law or because of the situation","example[10]":"You mustn’t talk to your mother like that.","example[11]":"This book must not be removed from the library.","example[12]":"We must never forget how much we owe to these brave men.","example[13]":"No one must disturb him while he’s sleeping.","definition[2]":"used to say you think something is very likely to be true or very likely to have happened","example[14]":"Sam must be nearly 90 years old now.","example[15]":"His new car must have cost around £20,000.","example[16]":"You must have been really upset.","example[17]":"There must be something wrong with the engine.","example[18]":"Karl must’ve seen ‘Star Wars’ six or seven times.","definition[3]":"used to suggest that someone should do something, especially because you think they will enjoy it or you think it is a good idea","example[19]":"You must come and stay with us in London sometime.","example[20]":"‘We must do this again, ’ he said. ‘I’ve enjoyed it thoroughly.’","definition[4]":"used to say that you intend or want to do something","example[21]":"I must call her tonight.","explanation[1]":"You say that you must do something","example[22]":"I must get a new key","explanation[2]":"Don’t use ‘to’ after must","bad_example[0]":"I must to get a new key","explanation[3]":"You use must not when saying someone should not do something, for example because it is dangerous or wrong","example[23]":"You must not leave without telling me where you’re going","explanation[4]":"You say that something must have happened, or that someone must have done something, when you are fairly sure that this is true, based on what you know","example[24]":"They must have caught an earlier train","display[0]":"have to","explanation[5]":"You say that you have to do something","example[25]":"She has to do some shopping","explanation[6]":"You use don’t have to when it is not necessary for someone to do something","example[26]":"You don’t have to leave yet","explanation[7]":"You use had to instead of ‘must’ when talking about the past","example[27]":"He had to get up early the next day","display[1]":"must do something","definition[5]":"used when saying that it is very important that someone does something, because someone in authority or a rule says this, or because of the situation","example[28]":"You must be home by midnight.","example[29]":"He must not smoke in here.","example[30]":"I must remember to call her.","display[2]":"have to do something","definition[6]":"to need to do something because it is necessary or important","example[31]":"I have to go home early.","example[32]":"She has to talk to him first.","display[3]":"be obliged to do something","definition[7]":"to have to do something, because of a rule or law, or because of the situation you are in","example[33]":"Members of parliament are obliged to declare all their financial interests.","example[34]":"He was obliged to admit defeat.","display[4]":"be required to do something","definition[8]":"to have to do something because of a rule or law – used especially in written notices and official documents","example[35]":"New students are required to register with a doctor.","display[5]":"have an obligation to do something","definition[9]":"to have to do something because it is the duty of someone in your position to do it, or because you have officially agreed to do it","example[36]":"The landlord is under an obligation to keep the building in good repair.","display[6]":"be forced/compelled to do something","definition[10]":"to have to do something that you do not want to do, because you are in a situation that makes it impossible to avoid","example[37]":"She was forced to retire early due to ill health.","definition[11]":"something that you must do or must have","example[38]":"Warm clothes are a must in the mountains."}