{"word[0]":"judgment","definition[0]":"an opinion that you form, especially after thinking carefully about something","example[0]":"It’s too soon to make a judgment about what the outcome will be.","example[1]":"In my judgment, we should accept his offer.","example[2]":"I’d advise you to reserve judgment  (=not decide your opinion before you have all the facts).","example[3]":"Our aim is to help him, not to pass judgment on what he has done.","note[0]":"pass judgment (on something)","example[4]":"I lent him the money, against my better judgment.","note[1]":"against your better judgment","signpost[0]":"ability to decide","definition[1]":"the ability to make sensible decisions about what to do and when to do it","example[5]":"I’ve known him for years and I trust his judgment.","example[6]":"a decision based on sound judgment  (=good judgment)","example[7]":"Watch carefully and use your judgment.","example[8]":"The minister showed a lack of political judgment.","note[2]":"professional/personal etc judgment","definition[2]":"an official decision given by a judge or a court of law","example[9]":"The company were fined £6 million, following a recent court judgment.","collocation[0]":"make a judgment","example[10]":"It's too soon to make a judgment about what the outcome will be.","collocation[1]":"form a judgment","example[11]":"I prefer to form my own judgments, rather than relying on other people's opinions.","collocation[2]":"reserve judgment","example[12]":"Why don't you reserve judgment until you have finished the book?","collocation[3]":"base a judgment on something","example[13]":"His judgment was based on bad information.","collocation[4]":"a moral judgment","example[14]":"People are always making moral judgments about weight loss.","collocation[5]":"a snap judgment","example[15]":"In my business, I often have to make snap judgments about people.","definition[3]":"an opinion formed or a decision made after careful thought","example[16]":"Traders said they would wait to see more economic data before making a judgement about the economy.","example[17]":"Mr Overs has said he is reserving judgment (=not forming an opinion until all the facts are available) on the deal.","definition[4]":"the ability to make good decisions","example[18]":"There is no substitute for common sense and good business judgment.","example[19]":"The company has shown poor judgment in its investment strategy.","definition[5]":"a decision made by a court of law","example[20]":"The former president of the company now faces a $2.2 million federal court judgment against him.","example[21]":"Marx sued his employer and won a judgment for £25,000.","example[22]":"The court upheld a judgment (=said that another court’s judgment was correct) in the firm’s favor."}