{"word[0]":"conclude","definition[0]":"to decide that something is true after considering all the information you have","example[0]":"The report concluded that the school should be closed immediately.","note[0]":"conclude that","example[1]":"Richardson concluded from his studies that equality between the sexes is still a long way off.","note[1]":"conclude from something that","explanation[0]":"In more formal English, you can say it is concluded that something is true","example[2]":"It was concluded that the treatment should be stopped","definition[1]":"to complete something you have been doing, especially for a long time","example[3]":"When the investigation is concluded, the results will be sent to the US Attorney’s office.","example[4]":"Francis, having concluded his business with James, left for Miami.","definition[2]":"to end something such as a meeting, book, event, or speech by doing or saying one final thing","example[5]":"To conclude, I’d like to express my thanks to my family.","example[6]":"‘So now, ’ she concluded, ‘I’m trying to bring some order to the garden.’","example[7]":"Each chapter concludes with a short summary.","note[2]":"conclude with","example[8]":"She concluded by saying she was proud to be from Salford.","note[3]":"conclude by doing something","definition[3]":"to decide that something is true after considering all the facts","example[9]":"The Stock Exchange concluded that the accounts could be regarded as suspect because they made no reference to such businesses.","example[10]":"We can conclude from the statistics that there is still an imbalance between the opportunities for men and women.","definition[4]":"to finish arranging an agreement, treaty, deal etc","example[11]":"We would like to conclude the deal by the end of the financial year.","definition[5]":"when something concludes, or you conclude it, it ends","example[12]":"By five the interview had at last concluded and we left.","example[13]":"Anxious to conclude the meeting, he added: “All the figures you need are in the business plan.”"}