{"word[0]":"prosecution","definition[0]":"when a charge is made against someone for a crime, or when someone is judged for a crime in a court of law","example[0]":"a criminal prosecution","example[1]":"The evidence is not sufficient to bring a prosecution against him.","example[2]":"Walters could face prosecution for his role in the robbery.","note[0]":"prosecution for","example[3]":"the prosecution of war criminals","note[1]":"prosecution of","definition[1]":"when you do something that is your job","example[4]":"the prosecution of her duties","collocation[0]":"(a) criminal prosecution","example[5]":"Failure to hand over the documents could result in criminal prosecution.","collocation[1]":"a private prosecution","example[6]":"The victim's widow is considering a private prosecution.","example[7]":"We do not yet have enough evidence for a successful prosecution.","collocation[2]":"bring a prosecution against somebody","example[8]":"The police did not bring a prosecution against him.","collocation[3]":"face prosecution","example[9]":"The owners of a golf course are facing prosecution for blocking footpaths.","collocation[4]":"escape/avoid prosecution","example[10]":"He was lucky to escape prosecution.","collocation[5]":"be liable to/for prosecution","example[11]":"Businesses which do not meet the standards required are liable for prosecution.","collocation[6]":"immunity from prosecution","example[12]":"He gave information to the police in return for immunity from prosecution.","definition[2]":"the process or act of bringing a charge against someone for a crime, or of being judged for a crime in a court of law","example[13]":"The evidence is now sufficient tobring a prosecution against him.","example[14]":"Making false statements in adverts may lead to criminal prosecution.","definition[3]":"the lawyers in a court of law who try to prove that someone is guilty of a crime","example[15]":"the chief witness for the prosecution","example[16]":"The prosecution asked for costs to be awarded against the defendants."}