{"comparative[0]":"dirtier","superlative[0]":"dirtiest","signpost[0]":"not clean","definition[0]":"covered in or marked by an unwanted substance","example[0]":"a stack of dirty dishes in the sink","example[1]":"How did you get so dirty?","example[2]":"She circled the bedroom, picking up dirty clothes.","note[0]":"dirty clothes/washing/laundry","definition[1]":"relating to sex, in a way that is considered immoral or unpleasant","note[1]":"dirty weekend British English (=a weekend when a man and woman who are not married to each other go away to have sex)","example[3]":"kids telling dirty jokes","example[4]":"a dirty magazine","example[5]":"She looked at me as if I had said a dirty word.","signpost[1]":"bad/immoral","definition[2]":"used to emphasize that you think someone or something is bad, dishonest, or immoral","note[2]":"do the dirty on somebody British English (=treat someone in a way that is unfair or dishonest)","example[6]":"You’re a dirty liar!","example[7]":"a dirty fighter","example[8]":"you and your dirty little deals","example[9]":"What a dirty trick!","definition[3]":"containing or possessing illegal drugs","definition[4]":"a dirty sports event is one in which people competing in the event have illegally used drugs to improve their performance","example[10]":"Many people think that the race has been a dirty event for years.","signpost[2]":"environment","definition[5]":"producing pollution or carbon dioxide","example[11]":"dirty forms of energy","example[12]":"His clothes were untidy and he had dirty hands.","display[0]":"filthy","definition[6]":"very dirty","example[13]":"Each year filthy water causes millions of cases of illness.","display[1]":"muddy","definition[7]":"covered with mud","example[14]":"It had been raining hard and the path was muddy.","display[2]":"dusty","definition[8]":"covered with dust","example[15]":"the dusty shelves in the attic","display[3]":"greasy","definition[9]":"covered with oil or grease","example[16]":"Greasy food is bad for your health.","display[4]":"grubby","definition[10]":"fairly dirty and needing to be cleaned or washed","example[17]":"He was wearing a grubby white T-shirt.","example[18]":"mucky fingers","display[5]":"grimy","definition[11]":"covered with thick dirt or dirt that has been there a long time","example[19]":"I couldn’t see much out of the grimy windows of the train.","display[6]":"dingy","definition[12]":"looking dark, dirty, and unpleasant. Used about rooms, houses, and buildings","example[20]":"We worked in a dingy little office behind the station.","display[7]":"polluted","definition[13]":"used about land, water, or air that has been made dirty","example[21]":"85% of city dwellers breathe heavily polluted air.","display[8]":"contaminated","definition[14]":"made dirty by a dangerous substance or bacteria","example[22]":"The virus is mainly spread through contaminated food.","display[9]":"squalid","definition[15]":"extremely dirty and unpleasant. Used about the place or conditions in which someone lives","example[23]":"People are living in squalid conditions, with little water and no sanitation.","display[10]":"unhygienic","definition[16]":"used about dirty conditions that are likely to cause disease, especially conditions in kitchens, restaurants, and hospitals","example[24]":"The food was prepared under unhygienic conditions.","display[11]":"unsanitary","definition[17]":"used about dirty conditions that are likely to cause disease, especially because there is not a good system for getting rid of waste","example[25]":"People’s health is being threatened by overcrowded and insanitary homes.","example[26]":"They work for long hours in unsanitary conditions.","display[12]":"soiled","definition[18]":"made dirty, especially by waste from your body","example[27]":"Soiled nappies should be changed as quickly as possible.","definition[19]":"to make something dirty","definition[20]":"to make someone feel or seem bad, dishonest, or immoral","example[28]":"The army’s actions dirtied its reputation.","definition[21]":"unfair or dishonest","example[29]":"a dirty political campaign","example[30]":"revelations about dirty dealing in the Treasury bond market","example[31]":"He accused the government of dirty tricks against the Republicans."}