{"word[0]":"copy","plural[0]":"copies","definition[0]":"something that is made to be exactly like another thing","example[0]":"Be sure to make copies of all the documents.","example[1]":"back-up copies of your files","example[2]":"She forwarded them a copy of her British passport.","note[0]":"copy of","example[3]":"This chair is a copy of an original design.","definition[1]":"one of many books, magazines, records etc that are all exactly the same","example[4]":"The hardback costs £16.99 a copy.","example[5]":"The record sold a million copies.","example[6]":"Free copies are available on request.","example[7]":"We have six copies of the movie to give away.","example[8]":"a copy of the local newspaper","definition[2]":"something written in order to be printed in a newspaper, magazine, advertisement etc","example[9]":"Now that I’ve seen the finished copy, I’m delighted.","collocation[0]":"be a copy of something","example[10]":"The rug is a copy of a fine Chinese carpet.","collocation[1]":"make a copy of something","example[11]":"Make a copy of the letter before you send it.","collocation[2]":"keep a copy of something","example[12]":"Did you keep a copy of the email?","collocation[3]":"send/receive a copy of something","example[13]":"Could you send me a copy of the agreement?","collocation[4]":"attach a copy of something","example[14]":"I’m attaching a copy of the schedule.","form[0]":"ADJECTIVES/NOUN + copy","collocation[5]":"a good copy","example[15]":"The painting is a good copy of the original.","collocation[6]":"a close copy","example[16]":"It is a close copy of a bronze figure found in Iceland.","collocation[7]":"a back-up copy","example[17]":"Be sure you regularly make back-up copies of your data.","definition[3]":"to deliberately make or produce something that is exactly like another thing","example[18]":"Could you copy this letter and send it out, please?","example[19]":"To copy a file, press F3.","example[20]":"a design copied from an 18th-century wallpaper","note[1]":"copy (something) from something","example[21]":"The pupils just copy from textbooks and learn facts.","example[22]":"He copied the number into his notebook  (=wrote the same number there).","note[2]":"copy something into something","definition[4]":"to deliberately do something that someone else has done or behave like someone else","example[23]":"Children often copy what they see on television.","example[24]":"I found myself copying him and his mannerisms.","definition[5]":"to cheat in an examination, schoolwork etc by looking at someone else’s work and writing the same thing as they have","example[25]":"Jeremy had copied from the girl next to him.","note[3]":"copy from","example[26]":"You could copy the files onto a CD.","example[27]":"Many people have tried to copy his paintings.","display[0]":"photocopy","definition[6]":"to copy a piece of paper with writing or pictures on it, using a machine","example[28]":"I’ll photocopy the letter and give it to you.","display[1]":"reproduce","definition[7]":"to print a copy of a picture or document, especially in a book or newspaper","example[29]":"The image has been reproduced in many magazines and newspapers around the world.","display[2]":"forge","definition[8]":"to illegally copy something written or printed","example[30]":"He forged my signature.","example[31]":"forged £10 notes","display[3]":"pirate","definition[9]":"to illegally copy and sell something such as a book, DVD, or computer program","example[32]":"The survey suggests that 27% of software in the UK has been pirated.","definition[10]":"one of many documents, books, magazines, computer software packages etc that are all exactly the same","example[33]":"We are offering a free copy of Windows98 with all new PCs.","example[34]":"The book sold 24,000 copies in the first three months.","definition[11]":"a letter, document etc that has been made to look exactly like another one, for example by being PHOTOCOPIED (=copied using a special machine called a photocopier)","example[35]":"Please send copies of all the relevant documents to me as soon as possible.","definition[12]":"written material that is to be printed in a newspaper, magazine etc","example[36]":"Our closing date for copy for the next issue is February 14.","example[37]":"six pages of double-spaced copy","definition[13]":"the written part of an advertisement","example[38]":"“The business of fitness and good health is healthier than ever, ” or so says the advertising copy for the National Exhibition of Health & Leisure.","definition[14]":"a computer program, CD etc that has been made by putting information or music from another one onto a disk. It is illegal to sell copies made in this way","example[39]":"selling pirated copies of computer games","definition[15]":"a file, DIRECTORY etc in which you have put all the same information as is in another one","example[40]":"Before you run this software, you should make a copy of your autoexec.bat file.","past_tense[0]":"copied","definition[16]":"to make a copy of a letter, document etc","example[41]":"Could you copy these letters before you send them out?","example[42]":"The letter was copied to the managing director.","note[4]":"copy something to somebody","definition[17]":"to deliberately use an idea, design etc that legally belongs to someone else","example[43]":"They have issued a patent infringement lawsuit accusing their rivals of copying their design for a range of ready meals.","definition[18]":"to illegally make a copy of a computer program, CD, etc","example[44]":"a new way to protect software from being copied","example[45]":"illegal software copying","definition[19]":"to make a file, DIRECTORY, program etc that is exactly the same as another one so that you can use it if something happens to the original one","example[46]":"The best way to save an email is to copy it to a file.","example[47]":"You can copy, delete, or tag files in a matter of seconds."}