{"word[0]":"head","signpost[0]":"top of body","definition[0]":"the top part of your body that has your face at the front and is supported by your neck","example[0]":"He kissed the top of her head.","example[1]":"Alan fell asleep as soon as he put his head on the pillow.","example[2]":"They dived head first into the water.","example[3]":"She was dressed in black from head to toe  (=over all her body).","example[4]":"He still has a full head of hair  (=has all his hair, even though he is getting rather old).","signpost[1]":"mind","definition[1]":"your mind or mental ability","example[5]":"The problem only exists inside his head.","example[6]":"I can’t do those figures in my head.","note[0]":"do something in your head","example[7]":"Use your head to work out the answer.","example[8]":"Jackie said the first thing that came into her head.","note[1]":"come into/pop into your head","example[9]":"‘It’s over, Jake, ’ she said. ‘Try and get that into your head.’","note[2]":"get something into your head","example[10]":"At about two in the morning, Alan took it into his head to go for a swim.","note[3]":"take/get it into your head (to do something)","example[11]":"Try to put it out of your head for the time being.","note[4]":"get/put something out of your head","example[12]":"What’s put that idea into her head?","note[5]":"put something into somebody’s head","example[13]":"I just can’t get my head round what’s been going on here.","note[6]":"get your head round something","signpost[2]":"calm/sensible","definition[2]":"to remain calm and sensible in a difficult or frightening situation","example[14]":"We need a candidate who can keep his or her head even when clients get aggressive.","example[15]":"Get to sleep early tonight – you’ll need to keep a clear head tomorrow at the trial.","note[7]":"keep a clear/cool/calm head","definition[3]":"to become unable to behave calmly or sensibly in a difficult or frightening situation","example[16]":"You’ll be OK as long as you don’t lose your head and forget he’s the real enemy.","definition[4]":"to be sensible and able to deal with difficult situations","example[17]":"He wondered what Gemma thought about it all. She seemed to have her head screwed on.","signpost[3]":"person in charge","definition[5]":"a leader or person in charge of a group or organization","note[8]":"head waiter/chef/gardener etc (=the person in charge of a group of waiters etc)","example[18]":"You should discuss the matter with your head of department.","note[9]":"head of","example[19]":"A meeting of Commonwealth heads of state will be held next month.","definition[6]":"the person in charge of a school","example[20]":"From now on all violent incidents should be reported directly to the head.","signpost[4]":"front/leading position","definition[7]":"the front or the most important position","example[21]":"At the head of the table (=the place where the most important person sits) sat the senior partners.","example[22]":"Jenny marched proudly at the head of the procession.","note[10]":"(at) the head of something","example[23]":"The band of soldiers marched into the yard, their defeated captain at their head.","note[11]":"at something’s/somebody’s head","definition[8]":"used in particular phrases to talk about someone being crazy or very stupid","example[24]":"People going out in conditions like this need their heads examined.","example[25]":"If I walk in looking like that, they’ll think I’m not right in the head.","example[26]":"You must be off your head if you think that.","note[12]":"be off your head","signpost[5]":"river/valley","definition[9]":"the place where a river, valley etc begins","signpost[6]":"flower/plant","definition[10]":"the top of a plant where its flowers or leaves grow","example[27]":"She was outside cutting the dead heads off the roses.","example[28]":"a head of lettuce","signpost[7]":"height/distance","definition[11]":"the length of a head, used to measure height or distance","note[13]":"by a (short) head (=used to say that a horse won or lost a race but only by a small amount)","example[29]":"She saw her father, a head above the rest of the crowd.","definition[12]":"the wide end of a long narrow tool or piece of equipment","signpost[8]":"beer","definition[13]":"the layer of small white bubbles on the top of a glass of beer","signpost[9]":"electronics","definition[14]":"a piece of equipment that changes information on something magnetic, such as a recording tape or computer hard disk, into electrical messages that electronic equipment can use","definition[15]":"a high area of land that sticks out into the sea – used in names","example[30]":"Beachy Head","signpost[10]":"infection","definition[16]":"the centre of a swollen spot on your skin","collocation[0]":"turn your head","example[31]":"John turned his head to look at the boy.","collocation[1]":"shake your head","example[32]":"‘It’s too much, ’ he said, shaking his head.","collocation[2]":"nod your head","example[33]":"The audience nodded their heads enthusiastically.","collocation[3]":"somebody’s head hurts/aches/throbs","example[34]":"Her head was throbbing and she needed to lie down.","collocation[4]":"raise/lift your head","example[35]":"Tom raised his head to listen, then went back to his book.","collocation[5]":"bow/bend/lower your head","example[36]":"He bowed his head and tried not not to look at her.","collocation[6]":"hang your head","example[37]":"She hung her head, not sure how to reply.","collocation[7]":"scratch your head","example[38]":"He scratched his head and started looking through the drawers again.","collocation[8]":"cock your head","example[39]":"The big dog cocked his head to one side and raised his ears.","example[40]":"The sun beat down on her bare head.","collocation[9]":"bald","example[41]":"His bald head shone with sweat.","collocation[10]":"somebody’s blonde/dark/grey etc head","example[42]":"I saw my son’s blond head sticking out from the car window.","form[0]":"head + NOUN","collocation[11]":"head injury","example[43]":"Wearing a helmet reduces the risk of head injuries.","signpost[11]":"go towards","definition[17]":"to go or travel towards a particular place, especially in a deliberate way","example[44]":"It’s about time we were heading home.","example[45]":"Where are you guys headed?","example[46]":"We headed south towards the capital.","note[14]":"head north/south etc","example[47]":"The ship was heading for Cuba.","note[15]":"head for/towards/back etc","signpost[12]":"be in charge","definition[18]":"to be in charge of a team, government, organization etc","example[48]":"David was asked to head up the technical team.","example[49]":"an interim government headed by the former prime minister","signpost[13]":"at top","definition[19]":"to be at the top of a list or group of people or things","example[50]":"The movie heads the list of Oscar nominations.","definition[20]":"if a page is headed with a particular name, title, image etc, it has it on the top","example[51]":"The page was headed ‘Expenses’.","example[52]":"officially-headed writing paper","signpost[14]":"at front","definition[21]":"to be at the front of a line of people","example[53]":"a procession headed by the Queen","signpost[15]":"football","definition[22]":"to hit the ball with your head, especially in football","definition[23]":"the top of something","example[54]":"the pithead  (=the top of a coal mine)","example[55]":"a letterhead  (=a name and address printed at the top of a letter)","definition[24]":"the place where something begins","example[56]":"a fountainhead","definition[25]":"the leader or person in charge of a group, organization, or part of an organization","example[57]":"The head of each division is responsible for its operating performance.","example[58]":"Stone was head of corporate finance at Coopers & Lybrand.","example[59]":"Work is divided into different areas and is supervised by section heads.","definition[26]":"the most senior RECEPTIONIST etc","example[60]":"Any cash received must be double-checked by the head receptionist.","definition[27]":"to be able to make sensible and PROFITABLE business decisions","definition[28]":"for each person","example[61]":"A conference for 70 people will work out at around £30 a head per day.","example[62]":"Expenditure per head on training had been growing rapidly.","definition[29]":"if you deal with a problem head on, you deal with it in a very brave and direct way","example[63]":"The issue has to be tackled head on.","definition[30]":"if two companies compete head on, they each try to be successful selling the same product or service","example[64]":"Instead of trying to compete head on with stores like Our Price and HMV, he moved down-market, stocking cheaper CDs and tapes.","definition[31]":"to have an advantage that helps you to be successful","example[65]":"Banks will have a head start over their non-banking rivals in selling products in this new market.","note[16]":"have/be given a head start over","definition[32]":"to only just manage to keep your company in business or live on the income you earn","example[66]":"These are savings that defence companies have to make to keep their heads above water.","definition[33]":"if you go over the head of your BOSS (=the person who you normally take orders from at work), you ask his or her boss something instead of asking him or her directly","example[67]":"My boss was angry because I went over his head to the department manager.","definition[34]":"used to say that someone will lose their job or be punished for a mistake they have made","definition[35]":"to be in charge of a group, an organization, or part of an organization","example[68]":"She heads a building company.","definition[36]":"if a page is headed with a particular word or sentence, it has it at the top","example[69]":"The three columns are headed ‘budget’, ‘actual’ and ‘variance’.","definition[37]":"if a share price, currency etc heads north, it rises in value. If it heads south, it falls in value","example[70]":"Right now, the rouble is heading south."}