{"word[0]":"pledge","signpost[0]":"promise","definition[0]":"a serious promise or agreement, especially one made publicly or officially","example[0]":"Parents make a pledge to take their children to rehearsals.","note[0]":"make/take/give a pledge","example[1]":"Eisenhower fulfilled his election pledge to end the war in Korea.","note[1]":"keep/fulfil/honour a pledge","example[2]":"a pledge of support for the plan","note[2]":"pledge of","example[3]":"the government’s pledge to make no deals with terrorists","note[3]":"pledge to do something","definition[1]":"a promise to give money to an organization","example[4]":"Donors have made pledges totaling nearly $4 million.","example[5]":"a pledge of $200 to the public TV station","signpost[1]":"something valuable","definition[2]":"something valuable that you leave with someone else as proof that you will do what you have agreed to do","signpost[2]":"us colleges","definition[3]":"someone who has promised to become a member of a fraternity or sorority at an American university","collocation[0]":"make/give a pledge","example[6]":"Several European countries made similar pledges.","collocation[1]":"take a pledge","example[7]":"He took a pledge never to drink again.","collocation[2]":"keep a pledge","example[8]":"He has not kept his election pledges.","collocation[3]":"fulfil/honour a pledge","example[9]":"The time is coming when they will have to honour that pledge.","collocation[4]":"renege on a pledge","example[10]":"The government reneged on its electoral pledges.","form[0]":"ADJECTIVES/NOUN + pledge","collocation[5]":"an election/campaign/manifesto pledge","example[11]":"The governor had kept her campaign pledge to slash taxes.","collocation[6]":"a spending pledge","example[12]":"I asked him to clarify Labour’s spending pledges.","collocation[7]":"a firm pledge","example[13]":"He also gave a firm pledge to build up the National Health Service.","collocation[8]":"a solemn pledge","example[14]":"We will not forget. That is a solemn pledge.","definition[4]":"to make a formal, usually public, promise that you will do something","example[15]":"He pledged his cooperation.","note[4]":"pledge (your) support/loyalty/solidarity etc","example[16]":"Moore pledged $100,000 to the orchestra at the fund-raising dinner.","note[5]":"pledge something to something/somebody","example[17]":"The new governor pledged to reduce crime.","example[18]":"Herrera pledged that his company would give aid to schools.","note[6]":"pledge that","example[19]":"Trade unions pledged themselves to resist the government plans.","note[7]":"pledge yourself to (do) something","signpost[3]":"make somebody promise","definition[5]":"to make someone formally promise something","example[20]":"Employees were pledged to secrecy.","signpost[4]":"leave something","definition[6]":"to leave something with someone as a pledge1(3)","definition[7]":"to promise to become a member of a fraternity or sorority at an American university","definition[8]":"a formal, usually public, promise that you will do something","example[21]":"the President’s pledge to make employment his priority","definition[9]":"something that you offer as SECURITY (=an asset that lenders can take if you do not repay) when you borrow money","example[22]":"He may have given the painting to someone as a pledge to secure a loan.","example[23]":"Several national charities have pledged money to build the centre.","example[24]":"The government pledged to draw up a program for growth and employment.","definition[10]":"when you borrow money, to offer something you own as SECURITY (=something that lenders have a right to take and sell if you do not repay)","example[25]":"He will pledge virtually all of his assets, including his personal residences, to secure his borrowings."}