{"word[0]":"float","signpost[0]":"on water","definition[0]":"to stay or move on the surface of a liquid without sinking","example[0]":"I wasn’t sure if the raft would float.","example[1]":"She spent the afternoon floating on her back in the pool.","example[2]":"A couple of broken branches floated past us.","note[0]":"float along/down/past etc","definition[1]":"to put something on the surface of a liquid so that it does not sink","example[3]":"The logs are trimmed and then floated down the river.","signpost[1]":"in the air","definition[2]":"if something floats, it moves slowly through the air or stays up in the air","example[4]":"I looked up at the clouds floating in the sky.","example[5]":"Leaves floated gently down from the trees.","signpost[2]":"music/sounds/smells etc","definition[3]":"if sounds or smells float somewhere, people in another place can hear or smell them","example[6]":"The sound of her voice came floating down from an upstairs window.","signpost[3]":"walk gracefully","definition[4]":"to walk in a slow light graceful way","synonym[0]":"glide","example[7]":"Rachel floated around the bedroom in a lace nightgown.","signpost[4]":"ideas","definition[5]":"to suggest an idea or plan in order to see if people like it","example[8]":"We first floated the idea back in 1992.","definition[6]":"if the government of a country floats its money, the value of the money is allowed to change freely in relation to money from other countries","example[9]":"Russia decided to float the rouble on the foreign exchange market.","signpost[5]":"company","definition[7]":"to sell shares in a company or business to the public for the first time","example[10]":"The company will be floated on the stock market next year.","note[1]":"float something on something","signpost[6]":"cheque","definition[8]":"to write a cheque when you do not have enough money in the bank to pay it","definition[9]":"a large vehicle that is decorated to drive through the streets as part of a special event","example[11]":"We stood and watched the Carnival floats drive past.","definition[10]":"a sweet drink that has ice cream floating in it","signpost[7]":"for fishing","definition[11]":"a small light object that floats on the surface of the water, used by people trying to catch fish to show where their line is","signpost[8]":"for swimming","definition[12]":"a flat light object that you can rest part of your body on in water to help you learn to swim","definition[13]":"a small amount of money that someone in a shop keeps so that they have enough money to give change to people","definition[14]":"a time when shares in a company are made available for people to buy for the first time","synonym[1]":"flotation","signpost[9]":"relaxation","definition[15]":"a time when you sit in a flotation tank in order to treat illness or injury, or to relax","definition[16]":"to sell new shares, bonds etc on a financial market","example[12]":"To finance the expansion, the airport has floated $30 billion in bonds, which should cover 75% of construction costs.","definition[17]":"to sell shares in a company on a stockmarket for the first time","example[13]":"The price of the company’s shares on the day it floated on the stock market beat all expectations.","definition[18]":"if the government of a country floats its currency, or if the currency floats, its value is allowed to change in relation to other currencies after a period of time when it has been fixed","example[14]":"He had been responsible for sweeping economic reforms, including floating the Australian dollar and deregulating the financial system.","definition[19]":"if a price, amount etc floats, it moves up or down slowly","example[15]":"The oil market let crude prices float lower.","example[16]":"Throughout the 1970s, the stock and bond markets floated up.","definition[20]":"when shares, bonds etc are sold on a financial market, or when a company sells shares for the first time","synonym[2]":"FLOTATION","example[17]":"The board is still talking with its investment bankers about the timing and terms of the float, which is expected to value the company at between $3 billion and $4 billion.","definition[21]":"when a currency is allowed to change in value in relation to others","example[18]":"Until the float of sterling in 1972 there were few restrictions on investment within the sterling area.","definition[22]":"the money made available to banks while customers’ cheques go through the banking system","example[19]":"Many consumers have long believed that bankers have lengthened the check-clearing process to use the float for their own benefit.","definition[23]":"the amount of notes and coins in the TILL of a shop, restaurant etc when they open for business","example[20]":"Cash floats should be rechecked to ensure that cashiers have enough change for the evening business.","definition[24]":"a small amount of money that is kept in an office for making small payments","synonym[3]":"PETTY CASH","example[21]":"A business credit card removes the need for a cash float."}