{"word[0]":"majority","plural[0]":"majorities","signpost[0]":"most people or things","definition[0]":"most of the people or things in a group","opposite[0]":"minority","example[0]":"In the vast majority of cases the disease is fatal.","note[0]":"great/vast/overwhelming majority of something","example[1]":"The majority of workers find it quite hard to live on the amount of money they earn.","note[1]":"majority of","example[2]":"In this city, Muslims are in the majority.","note[2]":"be in the majority","explanation[0]":"You use a plural verb with  the majority of, when it is followed by a plural noun","example[3]":"The majority of patients are women","explanation[1]":"You use a plural verb with the majority on its own, when you are considering members of a group as individual people","example[4]":"He sees several patients a day The majority are women","explanation[2]":"You usually use a singular verb with majority, when considering people as a single group  In British English, you can also use a plural verb in this meaning","example[5]":"The majority is unwilling to listen to the views of the minority","signpost[1]":"most votes","definition[1]":"if one person or group wins a majority in an election, they win more votes than other people or groups","example[6]":"The Labour Party won a huge majority at the last general election.","example[7]":"He won by a majority of 500.","note[3]":"majority of 50/100 etc","example[8]":"The party won an absolute majority in Portugal in 1987.","note[4]":"clear/overall/absolute majority","example[9]":"The government gained only a narrow majority, with 151 votes against 144.","note[5]":"small/narrow majority","example[10]":"The Labour majority was reduced to just 15 seats at the last election.","note[6]":"Labour/Conservative etc majority","signpost[2]":"becoming an adult","definition[2]":"the age when someone legally becomes an adult","example[11]":"He became a partner in the family firm on reaching his majority.","note[7]":"reach majority/the age of majority","heading[0]":"– Meaning 2: if one person or group wins a majority in an election, they win more votes than other people or groups","collocation[0]":"have/hold a majority","example[12]":"The Democratic party has a majority in the Senate.","collocation[1]":"win a majority","example[13]":"The Conservative Party won a large majority.","collocation[2]":"secure a majority","example[14]":"They failed to secure a majority.","collocation[3]":"get/gain/receive a majority","example[15]":"If no one gets an overall majority, the vote is repeated.","collocation[4]":"command a majority","example[16]":"They were one seat short of being able to command a majority in parliament.","collocation[5]":"increase a majority","example[17]":"Labour increased its majority in the area.","collocation[6]":"lose a majority","example[18]":"The Republicans lost their narrow majority in Congress at the midterm elections.","collocation[7]":"retain a majority","example[19]":"They were able to retain an absolute majority of seats.","collocation[8]":"defend a majority","example[20]":"He is defending a majority of 400 against his Labour opponent.","collocation[9]":"overturn a majority","example[21]":"She hoped to overturn a Tory majority of 2,221.","form[0]":"ADJECTIVES/NOUN + majority","collocation[10]":"a large majority","example[22]":"Parliament voted by a large majority in favour of the ban.","collocation[11]":"a huge majority","example[23]":"Gone are the days of huge majorities and easy victories.","collocation[12]":"a small majority","example[24]":"Their small majority made them worried about winning the next election.","collocation[13]":"a slim/narrow majority","example[25]":"The proposal was passed by a slim majority.","collocation[14]":"an overall majority","example[26]":"What happens if no candidate receives an overall majority?","collocation[15]":"an overwhelming majority","example[27]":"The resolution was passed by an overwhelming majority.","collocation[16]":"an absolute/outright/clear majority","example[28]":"There was no party with an absolute majority in the House of Commons.","collocation[17]":"a simple majority","example[29]":"A simple majority of the people at the meeting were in favour of the changes.","collocation[18]":"a two-thirds/2:1/three to one etc majority","example[30]":"A two-thirds majority in both Houses of Congress is needed to overturn a presidential veto.","collocation[19]":"a Labour/Democratic/Tory etc majority","example[31]":"Republican majorities were elected in both Houses of Congress that year.","collocation[20]":"a parliamentary majority","example[32]":"Labour increased its parliamentary majority.","form[1]":"majority + NOUN","collocation[21]":"a majority vote","example[33]":"The majority vote carries the resolution.","collocation[22]":"the majority party","example[34]":"At that time, Labour was the majority party in Parliament.","collocation[23]":"majority support","example[35]":"a solution that will command majority support in the House","definition[3]":"most of the people or things in a particular group","example[36]":"Some franchisees quit, but the majority are still hanging on.","example[37]":"The majority of successful entrepreneurs have a clear mission statement.","example[38]":"The vast majority of new radio shows fail in their first season on the air.","definition[4]":"the difference between the number of votes gained by the winning party or person in an election and the number of votes gained by the other parties or people","example[39]":"No single party is likely to win a majority.","definition[5]":"the age at which someone legally becomes a responsible adult","example[40]":"The Family Law Reform Act 1969 reduced the age of majority to 18.","definition[6]":"used to say that a someone owns more than half the shares in a company","example[41]":"It will hold a majority stake in the new company.","example[42]":"The group said it did not plan to take majority control of the investment company.","example[43]":"the bank’s majority shareholder"}