{"word[0]":"patch","signpost[0]":"part of an area","definition[0]":"a small area of something that is different from the area around it","example[0]":"Look out for icy patches on the road.","example[1]":"a cat with a white patch on its chest","example[2]":"He combs his hair over his bald patch.","example[3]":"We finally found a patch of grass to sit down on.","note[0]":"patch of","example[4]":"Belinda watched a patch of sunlight move slowly across the wall.","signpost[1]":"over a hole","definition[1]":"a small piece of material that is sewn on something to cover a hole in it","example[5]":"a jacket with leather patches at the elbows","signpost[2]":"for growing something","definition[2]":"a small area of ground for growing fruit or vegetables","example[6]":"a strawberry patch","definition[3]":"a small computer program that is added to software to solve problems","signpost[3]":"eye","definition[4]":"a piece of material that you wear over your eye to protect it when it has been hurt","example[7]":"He had a black patch over one eye.","signpost[4]":"decoration","definition[5]":"a small piece of cloth with words or pictures on it that you can sew onto clothes","form[0]":"ADJECTIVES/NOUN + patch","collocation[0]":"a small/large etc patch","example[8]":"Some of the hills still had small patches of snow.","collocation[1]":"a white/black/red etc patch","example[9]":"The bird has a large black patch on each side of its neck.","collocation[2]":"a damp/wet patch","example[10]":"There were damp patches on the ceilings.","collocation[3]":"a bald patch","example[11]":"He stroked the bald patch on the back of his head .","collocation[4]":"a dark patch","example[12]":"She noticed two dark patches on the sleeve of his shirt.","collocation[5]":"a clear patch","example[13]":"Clear patches of brilliant blue sky appeared briefly through the white storm clouds.","collocation[6]":"a bright patch","example[14]":"Poppies and daisies provided bright patches of colour along the edge of the field.","collocation[7]":"icy patches","example[15]":"Some icy patches are likely on roads as temperatures drop tonight.","collocation[8]":"fog patches","example[16]":"There'll be a widespread frost with mist and one or two fog patches","definition[6]":"to repair a hole in something by putting a piece of something else over it"}