{"word[0]":"presence","definition[0]":"when someone or something is present in a particular place","opposite[0]":"absence","example[0]":"Your presence is requested at the club meeting on Friday.","example[1]":"Tests revealed the presence of poison in the blood.","note[0]":"presence of","signpost[0]":"appearance/manner","definition[1]":"the ability to appear impressive to people because of your appearance or the way you behave","example[2]":"a man of great presence","signpost[1]":"official group","definition[2]":"a group of people, especially soldiers, who are in a place to control what is happening","example[3]":"We will increase police presence in local communities.","example[4]":"Soldiers still maintain a military presence in the area.","definition[3]":"the ability to gain sales because your business is strong or noticeable","example[5]":"a company with a strong presence in all major world markets","signpost[2]":"spirit","definition[4]":"a spirit or influence that cannot be seen but is felt to be near","example[6]":"They felt a strange presence in the deserted house.","collocation[0]":"indicate the presence of something/somebody","example[7]":"These plants indicate the presence of underground water.","collocation[1]":"reveal the presence of something/somebody","example[8]":"Excavations revealed the presence of an ancient burial ground.","collocation[2]":"detect the presence of something/somebody","example[9]":"They invented a device for detecting the presence of submarines.","collocation[3]":"confirm the presence of something/somebody","example[10]":"Tests confirmed the presence of an infection.","collocation[4]":"explain the presence of something/somebody","example[11]":"How could he possibly explain the presence of so much money in his flat?","collocation[5]":"notice somebody's presence","example[12]":"If he had noticed her presence, he gave no sign.","collocation[6]":"sense somebody's presence","example[13]":"The man sensed his presence at once and turned sharply.","collocation[7]":"acknowledge somebody's presence","example[14]":"He acknowledged my presence with a quick wave.","collocation[8]":"be/become aware of somebody's presence","example[15]":"It was only when I coughed that he became aware of my presence."}