{"word[0]":"ride","past_tense[0]":"rode","past_participle[0]":"ridden","definition[0]":"to sit on an animal, especially a horse, and make it move along","example[0]":"She learned to ride when she was seven.","example[1]":"He was riding a large grey mare.","example[2]":"She arrived riding on a white horse.","note[0]":"ride on","example[3]":"He rode away across the marshes.","note[1]":"ride away/across/through etc","signpost[0]":"bicycle/motorbike","definition[1]":"to travel on a bicycle or motorbike","example[4]":"He had never learned to ride a bicycle.","example[5]":"They mounted their bikes and rode off.","definition[2]":"to travel in a bus, car, or other vehicle that you are not driving","example[6]":"We got onto the bus and rode into San Francisco.","example[7]":"Ann rides the bus to work.","note[2]":"ride a bus","example[8]":"The kids were riding in the back.","note[3]":"ride in","signpost[1]":"in a lift","definition[3]":"to travel up or down in a lift","example[9]":"He rode the elevator down to the first floor.","note[4]":"ride up/down","example[10]":"I rode up to the tenth floor.","signpost[2]":"water/air","definition[4]":"to be floating in water or in the air","example[11]":"The smaller boat was lighter and rode higher in the water.","example[12]":"The moon was riding high in the sky.","example[13]":"There was a large ship riding at anchor in the bay.","definition[5]":"to float on a wave and move forward with it","example[14]":"surfboarders riding the waves","signpost[3]":"annoy somebody","definition[6]":"to annoy someone by often criticizing them or asking them to do things","example[15]":"Why are you riding her so hard?","signpost[4]":"car/train etc","definition[7]":"a journey in a vehicle, when you are not driving","example[16]":"Can you give me a ride back to town?","example[17]":"Sammy had promised to take me for a ride in his truck.","example[18]":"I managed to get a ride down to the station.","example[19]":"We hitched a ride (=got a free ride from a passing vehicle) into town.","example[20]":"A fifteen minute taxi ride will take you to the airport.","note[5]":"car/bus/train etc ride","example[21]":"The new model offers a lovely smooth, comfortable ride.","note[6]":"a smooth/comfortable/bumpy etc ride","example[22]":"He invited me to go for a ride in his new car.","signpost[5]":"horse/bicycle","definition[8]":"a journey on a bicycle, a horse, or a similar animal","example[23]":"Shall we go for a bike ride this afternoon?","note[7]":"a bike/bicycle ride","example[24]":"Can I have a ride on your bike?","signpost[6]":"machine at a fair","definition[9]":"a large machine that people ride on for fun at a fair","example[25]":"We went on loads of rides.","signpost[7]":"path","definition[10]":"a path for riding on a horse in the countryside","example[26]":"a grassy ride","collocation[0]":"take/have a ride","example[27]":"Visitors can take a ride on a steam train.","collocation[1]":"go for a ride","example[28]":"He went for a ride in a private plane piloted by a friend.","collocation[2]":"give somebody a ride","example[29]":"Ellie gave us a ride to school.","collocation[3]":"get a ride","example[30]":"I left the farm that night, and got a ride into town.","collocation[4]":"hitch a ride","example[31]":"He hitched a ride to Denver on a truck.","collocation[5]":"take somebody for a ride","example[32]":"Hugh took me for a ride in his new car.","form[0]":"ADJECTIVES/NOUN + ride","collocation[6]":"a car/bus/train etc ride","example[33]":"The resort is a short bus ride away from the hotel.","collocation[7]":"a short/long ride","example[34]":"I climbed slowly aboard the bus for the long ride to Hawkesworth.","collocation[8]":"a smooth/comfortable ride","example[35]":"The new suspension produces a smoother ride.","collocation[9]":"a bumpy ride","example[36]":"Part of the flight had been a bumpy ride through a thunderstorm.","definition[11]":"to be very successful or confident","example[37]":"Investors are riding high at the moment.","definition[12]":"to be doing something unwise that could result in failure","example[38]":"Are junk bond buyers riding for a fall?","definition[13]":"to get an advantage for yourself without doing anything to earn it","example[39]":"Rival firms sometimes free ride on each other’s research and development.","note[8]":"free ride on","definition[14]":"used to say how easy or difficult a process or period of time is for someone","example[40]":"It won’t be an easy ride for the retailer.","example[41]":"Hungarian investors have been having a bumpy ride (=a difficult time) recently.","definition[15]":"if someone gets a free ride, they get an advantage without having to work for it","example[42]":"They’re getting a free ride at the taxpayer’s expense.","definition[16]":"to trick someone, often in order to get money from them","example[43]":"Some auto dealers are taking car buyers for a ride by charging inflated prices on extended warranties."}