{"word[0]":"stake","signpost[0]":"company/business","definition[0]":"if you have a stake in a business, you have invested money in it","example[0]":"He holds a 51% stake in the firm.","note[0]":"hold/have a stake in something","signpost[1]":"money risked","definition[1]":"money that you risk as the result of a horse race, card game etc","example[1]":"For a dollar stake, you can win up to $1,000,000.","signpost[2]":"pointed stick","definition[2]":"a pointed piece of wood, metal etc, especially one that is pushed into the ground to support something or mark a particular place","example[2]":"tent stakes","example[3]":"Drive two stakes into the ground about three feet apart.","definition[3]":"to risk losing something that is valuable or important to you on the result of something","example[4]":"Kevin is staking his reputation on the success of the project.","note[1]":"stake something on somebody/something","example[5]":"Jim staked his whole fortune on one card game.","definition[4]":"to support something with stakes","example[6]":"Young trees have to be staked.","definition[5]":"to mark or enclose an area of ground with stakes","example[7]":"A corner of the field has been staked off.","definition[6]":"money risked or invested in a business","example[8]":"He has a stake in some liquid assets that could be used for income or held on to as a safety net.","example[9]":"Analysts expect the company to sell its large stake in the HongKong bank.","definition[7]":"if something that you value very much is at stake, you will lose it if a plan or action is not successful","example[10]":"If we lose the contract, hundreds of jobs are at stake.","definition[8]":"money risked on the result of something, especially a horse race","synonym[0]":"BET","example[11]":"a $100 stake","definition[9]":"used to talk about how much risk there is in a particular activity","example[12]":"For foreign investors, high stakes are involved.","definition[10]":"if you play for high stakes, you are in a situation where you gain or lose a lot"}