{"signpost[0]":"in a building","definition[0]":"a part of the inside of a building that has its own walls, floor, and ceiling","example[0]":"I looked around the room.","example[1]":"She nodded toward a man who was standing across the room  (=on the other side of the room).","example[2]":"Someone was laughing in the next room (=the one beside the one you are in).","example[3]":"Here’s your key – room 348.","example[4]":"the doctor’s waiting room","note[0]":"bathroom/dining room/meeting room etc","example[5]":"a three-room apartment","note[1]":"one-room(ed)/two-room(ed) etc","example[6]":"I’d like to book a double room for two nights.","note[2]":"single/double room","example[7]":"Beth, it’s time to clean up your room.","note[3]":"somebody’s room","signpost[1]":"space","definition[1]":"space somewhere for a particular thing, person, or activity","note[4]":"leg-room/head-room (=space for your legs or head in a vehicle)","example[8]":"I’m trying to make room for a vegetable garden in the backyard.","example[9]":"Step back, leave room for people to get past.","example[10]":"The old wardrobe took up too much room.","example[11]":"I hope there’s going to be enough room in the fridge.","note[5]":"room in","example[12]":"My suitcase was so full I didn’t have room for anything else.","note[6]":"room for","example[13]":"The museum doesn’t have enough room to show everything in their collection.","note[7]":"room to do something","example[14]":"There’s plenty of room in the boot for your luggage.","note[8]":"plenty of room/enough room","signpost[2]":"opportunity/possibility","definition[2]":"the chance to do something, or the possibility that something exists or can happen","example[15]":"Make room in your day for exercise.","example[16]":"The evidence was clear, and there was little room for doubt.","note[9]":"room for doubt/debate/argument etc","example[17]":"Teachers feel they have little room for manoeuvre when the curriculum is so demanding.","note[10]":"room for manoeuvre","example[18]":"There’s little room for innovation.","example[19]":"Children need to have room to develop their natural creativity.","definition[3]":"all the people in a room","example[20]":"The whole room started singing ‘Happy Birthday’.","definition[4]":"to rent and live in a room somewhere","definition[5]":"a part of the inside of a building","example[21]":"conference room facilities","example[22]":"the college staff room","definition[6]":"the possibility that something might happen, or the chance to do something","example[23]":"The cellular phone industry still has room for growth over the long haul.","example[24]":"There is little room for expansion in its existing businesses.","definition[7]":"if there is room for improvement, something is not perfect and could or should be improved","definition[8]":"two or more rooms that you rent in a building","definition[9]":"to share a rented room, apartment, or house with someone"}