{"definition[0]":"a visit to a place that involves a journey, for pleasure or a particular purpose","note[0]":"return trip (=when you are travelling back to where you started)","example[0]":"Two lucky employees won a round-the-world trip.","example[1]":"It’s an 80-mile round trip (=a journey to a place and back again) to Exeter.","example[2]":"I’m afraid you’ve had a wasted trip (=a trip in which you do not achieve your purpose), Mr Burgess has already left.","example[3]":"He was unable to make the trip to accept the award.","example[4]":"a business trip to Japan","note[1]":"business/school/shopping etc trip","example[5]":"a boat trip up the Thames","note[2]":"coach/boat/bus trip","example[6]":"We’re thinking of taking a trip to the mountains.","note[3]":"go on/take a trip","example[7]":"Did you enjoy your trip to Disneyland?","note[4]":"trip to","example[8]":"The Palace is only a short trip from here.","note[5]":"trip from","definition[1]":"the strange mental experiences someone has when they take a drug such as LSD","example[9]":"a bad trip","definition[2]":"a person or experience that is amusing and unusual","example[10]":"Julie’s such a trip!","definition[3]":"an act of falling as a result of hitting something with your foot","example[11]":"accidents caused by trips or falls","collocation[0]":"go on a trip","example[12]":"I’ve been on a coach trip to France.","collocation[1]":"take a trip","example[13]":"Take a trip on the Santa Fe railway or cruise on a Mississippi paddle boat.","collocation[2]":"make a trip","example[14]":"I couldn’t see him making the long trip to Minneapolis alone.","form[0]":"ADJECTIVES/NOUN + trip","collocation[3]":"a business trip","example[15]":"I’m on a business trip with my boss.","collocation[4]":"a shopping/fishing/skiing etc trip","example[16]":"He was knocked off his bicycle on his way home from a shopping trip.","collocation[5]":"a school trip","example[17]":"She went on a school trip to Tuscany.","collocation[6]":"a coach/bus/boat trip","example[18]":"They took a boat trip to see the seals.","collocation[7]":"a day trip","example[19]":"Take a day trip to York, which is just 15 miles away.","collocation[8]":"a round trip","example[20]":"His wife makes a hundred and fifty mile round trip to see him twice a week.","collocation[9]":"the return trip","example[21]":"A day or two later she began her return trip to Chicago.","collocation[10]":"a wasted trip","example[22]":"I’m afraid you’ve had a wasted trip. We don’t have those shoes in stock.","explanation[0]":"You go on a trip somewhere","example[23]":"We went on a trip to Morocco","bad_example[0]":"go for a trip somewhere","display[0]":"walk","explanation[1]":"You go for a walk somewhere","example[24]":"Miranda went for a long walk on the beach","explanation[2]":"You go for a drive somewhere","example[25]":"We went for a drive in the mountains","definition[4]":"a visit to a place that involves a journey, done for pleasure, business, shopping etc","example[26]":"The trip to the coast took longer than we expected.","example[27]":"Did you have a good trip?","definition[5]":"an occasion when you travel from one place to another, especially a long distance","example[28]":"a long train journey","example[29]":"We continued our journey on foot.","example[30]":"They made the journey across the plains in a covered wagon.","definition[6]":"the general activity of travelling, especially over long distances for pleasure. Don’t confuse travel and trip","example[31]":"a special ticket for train travel around Europe","example[32]":"Foreign travel is becoming increasingly popular.","display[1]":"travels","definition[7]":"trips to places that are far away","example[33]":"She told us about her travels in South America.","heading[0]":"different types of trip","display[2]":"tour","definition[8]":"a trip for pleasure, during which you visit several different towns, areas etc","example[34]":"She’s on a three week tour of Europe.","display[3]":"excursion","definition[9]":"a short trip to visit a place on holiday, usually by a group of people","example[35]":"You can go on an afternoon excursion to Catalina Island.","display[4]":"expedition","definition[10]":"a long and carefully organized trip, especially to a dangerous or unfamiliar place","example[36]":"Lewis and Clark’s expedition across North America","example[37]":"Scott led an expedition to the South Pole.","display[5]":"commute","definition[11]":"a trip to or from work that someone does every day","example[38]":"How long is your daily commute?","display[6]":"crossing","definition[12]":"a trip by boat from one piece of land to another","example[39]":"The Atlantic crossing was rough and stormy.","display[7]":"cruise","definition[13]":"a trip by boat for pleasure","example[40]":"We went on a cruise around the Caribbean.","display[8]":"voyage","definition[14]":"a very long trip in which you travel by ship or in a spacecraft","example[41]":"Columbus set out on his voyage across the ocean.","display[9]":"trek","definition[15]":"a long and difficult trip on foot, in a place far from towns and cities","example[42]":"They did a trek across the Atlas Mountains.","display[10]":"pilgrimage","definition[16]":"a trip to a holy place for religious reasons","example[43]":"She went on a pilgrimage to Lourdes.","definition[17]":"to hit something with your foot by accident so that you fall or almost fall","synonym[0]":"stumble","example[44]":"He tripped and fell.","example[45]":"Clary tripped over a cable and broke his foot.","note[6]":"trip over","example[46]":"He tripped on the bottom step.","note[7]":"trip on","signpost[0]":"make somebody fall","definition[18]":"to make someone fall by putting your foot in front of them when they are moving","example[47]":"Baggio was tripped inside the penalty area.","signpost[1]":"switch on","definition[19]":"to switch on a piece of electrical equipment by accident","example[48]":"An intruder had tripped the alarm.","signpost[2]":"walk/dance","definition[20]":"to walk, run, or dance with quick light steps","example[49]":"a little girl tripping down the lane","definition[21]":"to experience the mental effects of a drug such as LSD","example[50]":"They must have been tripping."}