{"word[0]":"pack","definition[0]":"to put things into cases, bags etc ready for a trip somewhere","example[0]":"I forgot to pack my razor.","example[1]":"Have you finished packing yet?","example[2]":"Kelly packed her things before breakfast.","note[0]":"pack your things/belongings","example[3]":"You’d better pack your bags. We’re leaving in an hour.","note[1]":"pack a bag/case","example[4]":"Shall I pack us a picnic?","note[2]":"pack somebody something","signpost[0]":"goods","definition[1]":"to put something into a box or other container, so that it can be moved, sold, or stored","example[5]":"Now wild mushrooms are available all year, packed in handy 25 g boxes.","note[3]":"pack something in/into something","definition[2]":"to go in large numbers into a space, or to make people or animals do this, until the space is too full","example[6]":"Fifty thousand fans packed into the stadium.","note[4]":"pack into/in/onto","example[7]":"The sheep had been packed into a truck and transported without food or water.","signpost[1]":"protect something","definition[3]":"to cover or fill an object with soft material so that it does not get damaged","example[8]":"Glass must be packed in several layers of paper.","note[5]":"pack in/with","signpost[2]":"snow/soil etc","definition[4]":"to press snow, soil, sand etc down so that it becomes hard and firm","example[9]":"Pack the soil down firmly.","note[6]":"pack something down","signpost[3]":"things wrapped together","definition[5]":"something wrapped in paper or packed in a box and then sent by post or taken somewhere","example[10]":"Send away for your free information pack today.","example[11]":"a pack of three T-shirts","note[7]":"pack of","signpost[4]":"small container","definition[6]":"a small container, usually made of paper, that something is sold in","example[12]":"a pack of cigarettes","example[13]":"a 10 oz pack of frozen peas","signpost[5]":"bag","definition[7]":"a bag that you carry on your back, especially when climbing or walking, used to carry equipment, clothes etc","synonym[0]":", backpack","definition[8]":"a complete set of playing cards","synonym[1]":"deck","definition[9]":"a group of wild animals that hunt together, or a group of dogs trained to hunt together","example[14]":"a wolf pack","example[15]":"a pack of hounds","definition[10]":"a group of the same type of people, especially a group who you do not approve of","example[16]":"A pack of reporters were waiting outside.","signpost[6]":"on a wound","definition[11]":"a thick soft piece of cloth that you press on a wound to stop the flow of blood","synonym[2]":"compress","definition[12]":"a small container with a set of things in it","synonym[3]":"PACKAGE","example[17]":"Five million tickets to Disney films will be placed in specially-marked packs.","example[18]":"a pack of Marlboro cigarettes","definition[13]":"a pack that contains six, twelve etc items","example[19]":"This brand of beer is now available in 12-packs.","definition[14]":"to be more successful than your competitors","example[20]":"It has fallen to seventh place in the ad-agency rankings, after leading the pack for three years.","example[21]":"The company is demonstrating the kind of innovation that will be needed to keep it ahead of the pack.","definition[15]":"a group of people who all work in the same industry, especially in films, the press, or the theatre, that you do not like or approve of","example[22]":"The whole media pack is closing in on him.","definition[16]":"to put products in boxes, a vehicle etc so they can be taken somewhere","example[23]":"At sixteen, Brian went to work packing freight on the shipping docks.","example[24]":"The video equipment is packed in aluminum trunks and air-freighted to the site.","note[8]":"pack something in something","example[25]":"fish packed in fresh-water ice","definition[17]":"to put a lot of information onto the part of a computer or other piece of ELECTRONIC equipment that stores DATA","example[26]":"The disks are engineered to pack at least twice as much data onto their recording surface.","note[9]":"pack something on/onto/into something","definition[18]":"to arrive in large numbers into a space that is not big enough, or to make people or things do this","example[27]":"Because moviegoers haven’t been packing the theaters this fall, they haven’t seen the trailers for our new releases.","example[28]":"The TV network has infuriated viewers by packing an extra three minutes of commercials into popular hour-long programs.","note[10]":"pack something into something","definition[19]":"to secretly and dishonestly arrange for most of the people on a committee etc to support someone","example[29]":"He packed the company’s board with his relatives."}