{"comparative[0]":"wetter","superlative[0]":"wettest","signpost[0]":"water/liquid","definition[0]":"covered in or full of water or another liquid","example[0]":"I’ve washed your shirt but it’s still wet.","example[1]":"wet grass","example[2]":"The man in the boat was wet through (=completely wet).","example[3]":"Take an umbrella or you’ll get wet.","note[0]":"get (something) wet","example[4]":"The towel was soaking wet.","note[1]":"soaking/dripping/sopping wet","example[5]":"His face was wet with sweat.","note[2]":"wet with","definition[1]":"rainy","example[6]":"There’s more wet weather on the way.","example[7]":"It’s very wet outside.","example[8]":"the wettest summer on record","signpost[1]":"paint/ink etc","definition[2]":"not yet dry","example[9]":"The paint’s still wet.","definition[3]":"someone who is wet does not have a strong character, or is not willing to do something that you think they should do – used to show disapproval","example[10]":"Don’t be so wet! Just tell them you don’t want to go.","definition[4]":"if a child or its nappy is wet, the nappy is full of urine","collocation[0]":"soaking/sopping/wringing wet","example[11]":"His suit was soaking wet.","collocation[1]":"dripping wet","example[12]":"She was dripping wet.","collocation[2]":"wet through","example[13]":"It never stopped raining and our clothes were wet through.","collocation[3]":"get wet","example[14]":"We both got very wet when we tried to give the dog a bath.","collocation[4]":"get something wet","example[15]":"I didn’t want to get my feet wet.","collocation[5]":"cold and wet","example[16]":"I was too cold and wet to keep going.","collocation[6]":"wet and muddy","example[17]":"His boots were wet and muddy.","definition[5]":"covered in water or another liquid","example[18]":"I’ve just washed my hair and it’s still wet.","example[19]":"You’d better change out of those wet clothes.","display[0]":"damp","definition[6]":"slightly wet","example[20]":"Wipe the surfaces with a damp cloth.","example[21]":"The sheets are still a little damp.","example[22]":"The grass was still too damp to sit on.","display[1]":"moist","definition[7]":"slightly wet, especially in a pleasant way – used about soil, food, or about someone’s skin or eyes","example[23]":"It’s important to keep the soil moist.","example[24]":"a delicious moist chocolate cake","example[25]":"Her eyes became moist (=she was almost crying).","display[2]":"clammy","definition[8]":"feeling slightly wet, cold, and sticky – used about someone’s skin, especially when they are nervous or ill","example[26]":"He had clammy hands.","example[27]":"Ruby was feverish and clammy with sweat.","display[3]":"soggy","definition[9]":"unpleasantly wet and soft – used especially about food or the ground","example[28]":"a bowl of soggy rice","example[29]":"It had been raining hard and the ground was soggy underfoot.","display[4]":"humid/muggy","definition[10]":"used when the weather is hot but the air feels wet in a way that makes you uncomfortable","example[30]":"Summers in Tokyo are hot and humid.","example[31]":"a hot muggy day","example[32]":"the humid heat of a tropical forest","heading[0]":"very wet","display[5]":"soaked","definition[11]":"very wet all the way through – used especially about people and their clothes","example[33]":"It absolutely poured with rain and we got soaked.","example[34]":"His shirt was soaked with blood.","display[6]":"drenched","definition[12]":"very wet – used about a person or area after a lot of rain or water has fallen on them","example[35]":"Everyone got drenched when a huge wave hit the boat.","example[36]":"The garden was completely drenched after the rain.","display[7]":"saturated","definition[13]":"extremely wet, and unable to take in any more water or liquid","example[37]":"His bandage was saturated with blood.","example[38]":"The floods were the result of heavy rainfall on already saturated soil.","display[8]":"waterlogged","definition[14]":"used about ground that has water on its surface because it is so wet that it cannot take in any more","example[39]":"The game was cancelled because the field was waterlogged.","display[9]":"sodden","definition[15]":"very wet with water – used about clothes and the ground. Sodden is less common than soaked","example[40]":"The ground was still sodden.","example[41]":"He took off his sodden shirt.","definition[16]":"to make something wet","example[42]":"Wet your hair and apply the shampoo.","definition[17]":"to make yourself, your clothes, or your bed wet because you pass water from your body by accident","example[43]":"Sam’s wet his bed again.","example[44]":"I nearly wet myself I was so scared.","note[3]":"wet yourself","definition[18]":"to put water or another liquid onto something to make it wet. In spoken English, people will often use get something wet rather than wet","example[45]":"He wet the washcloth and washed Tom’s face.","display[10]":"splash","definition[19]":"to make someone or something wet by making a lot of small drops of water fall onto them","example[46]":"The kids were playing around in the pool, splashing each other.","example[47]":"I accidentally splashed soup onto my shirt.","display[11]":"soak","definition[20]":"to put something in water for a long time or to make something very wet – use this especially when something is put into water or the water comes up from underneath to make it wet","example[48]":"Soak the beans overnight before cooking.","example[49]":"The rain had come in through the bottom of our tent and completely soaked our clothes.","display[12]":"drench","definition[21]":"to make someone or something extremely wet with a large amount of water – use this especially when water is poured or falls on something","example[50]":"He drenched us all with the hose.","example[51]":"Her shirt was drenched in sweat.","display[13]":"saturate","definition[22]":"to completely cover or fill something with liquid, so that it is wet all the way through","example[52]":"Heavy rains had saturated the ground.","definition[23]":"to cover an area of land with a large amount of water","example[53]":"Farmers flood the fields in order to grow rice.","display[14]":"moisten","definition[24]":"to make something slightly wet by putting a small amount of water or another liquid on it, especially to stop it from getting too dry","example[54]":"Add just enough water to moisten the cake mixture.","example[55]":"Tom paused and moistened his lips.","display[15]":"dampen","definition[25]":"to make something slightly wet by putting a little water on it","example[56]":"Rain came in through the window, dampening the curtains.","definition[26]":"a politician who belongs to the conservative party, and who supports very moderate ideas – used to show disapproval","example[57]":"Tory wets","definition[27]":"someone who does not have a strong character, or is not willing to do something that you think they should do – used to show disapproval","example[58]":"Go on! Don’t be such a wet!"}