{"word[0]":"barrier","definition[0]":"a rule, problem etc that prevents people from doing something, or limits what they can do","example[0]":"He advocated the removal of trade barriers.","example[1]":"Problems with childcare remain the biggest barrier to women succeeding at work.","note[0]":"barrier to","example[2]":"barriers between doctors and patients","note[1]":"barrier between","definition[1]":"a type of fence or gate that prevents people from moving in a particular direction","example[3]":"Crowds burst through the barriers and ran onto the pitch.","definition[2]":"a physical object that keeps two areas, people etc apart","example[4]":"The mountains form a natural barrier between the two countries.","form[0]":"ADJECTIVES/NOUN + barrier","collocation[0]":"trade barriers","example[5]":"The aim was to remove trade barriers and open up free markets.","collocation[1]":"the language barrier","example[6]":"Living in China was hard for me at first because of the language barrier.","collocation[2]":"cultural/racial/class barriers","example[7]":"Sport is a sure way to break down racial barriers.","collocation[3]":"social barriers","example[8]":"The Internet allows people of all ages to interact without the usual social barriers.","collocation[4]":"technical/legal/political barriers","example[9]":"Most of the technical barriers have been solved.","collocation[5]":"artificial barriers","example[10]":"They were committed to breaking down the artificial barriers to women’s achievement.","collocation[6]":"regulatory barriers","example[11]":"Regulatory barriers have been an obstacle to international co-operation between police forces.","collocation[7]":"bureaucratic barriers","example[12]":"This is one of many bureaucratic barriers preventing the unemployed from claiming benefit.","collocation[8]":"institutional/organizational barriers","example[13]":"Institutional barriers limit what can be achieved.","collocation[9]":"break/tear down barriers","example[14]":"Most companies have broken down the old barriers of status among the workers.","collocation[10]":"cross/transcend barriers","example[15]":"Music has the great advantage of crossing cultural barriers.","collocation[11]":"remove/eliminate/lift barriers","example[16]":"Will this remove the barriers to change?","collocation[12]":"overcome barriers","example[17]":"There are still many more barriers that need to be overcome.","collocation[13]":"reduce/lower barriers","example[18]":"We should be reducing barriers to imports from poor countries.","collocation[14]":"erect/build/put up barriers","example[19]":"Some kids have erected emotional barriers that stop them from learning.","collocation[15]":"create barriers","example[20]":"Uniforms are one of the things that create barriers."}