{"word[0]":"crisis","plural[0]":"crises","definition[0]":"a situation in which there are a lot of problems that must be dealt with quickly so that the situation does not get worse or more dangerous","example[0]":"The country now faces an economic crisis.","example[1]":"The prime minister was criticized for the way in which he handled the crisis.","example[2]":"the current debt crisis","example[3]":"a major political crisis","example[4]":"I was relieved that we had averted yet another financial crisis.","example[5]":"Oil companies were heavily criticized when they made large profits during the oil crisis of the 1970s.","example[6]":"The car industry is now in crisis.","example[7]":"He doesn’t seem to be very good at crisis management.","definition[1]":"a time when a personal emotional problem or situation has reached its worst point","example[8]":"an emotional crisis","example[9]":"In times of crisis, you find out who your real friends are.","example[10]":"He seems to be going through a crisis.","example[11]":"She has reached a crisis point in her career.","example[12]":"Both parties experienced an identity crisis  (=feeling of uncertainty about their purpose) at the end of the '90s.","collocation[0]":"an economic/political/financial etc crisis","example[13]":"The country was headed into an economic crisis.","collocation[1]":"a constitutional crisis","example[14]":"The scandal caused the greatest constitutional crisis of modern times.","collocation[2]":"a major/serious/deep/severe crisis","example[15]":"Our farming industry has been hit by a serious crisis.","collocation[3]":"a worsening/deepening crisis","example[16]":"The strikes came during a worsening economic crisis.","collocation[4]":"create/cause/provoke a crisis","example[17]":"The people fled the country, creating a huge refugee crisis.","collocation[5]":"precipitate a crisis","example[18]":"The rising oil prices precipitated an energy crisis.","collocation[6]":"face a crisis","example[19]":"Many families are facing a debt crisis.","collocation[7]":"resolve/overcome a crisis","example[20]":"We still hope that the hostage crisis can be resolved by negotiation.","collocation[8]":"handle a crisis","example[21]":"Can he handle the crisis in our prisons?","collocation[9]":"defuse a crisis","example[22]":"Diplomatic efforts to defuse the crisis have failed.","collocation[10]":"avert a crisis","example[23]":"More talks were proposed in an attempt to avert the crisis.","form[0]":"NOUN + crisis","collocation[11]":"a debt/food/housing etc crisis","example[24]":"The failure of the crop this year will create a food crisis.","collocation[12]":"a cash crisis","example[25]":"In April the company sold another 30% of its stock to ease its cash crisis.","collocation[13]":"an energy/oil/fuel crisis","example[26]":"There is an energy crisis here, with power cuts happening daily.","form[1]":"crisis + NOUN","collocation[14]":"crisis management","example[27]":"Most of my job consists of crisis management.","collocation[15]":"crisis point","example[28]":"Events were now reaching crisis point.","collocation[16]":"a crisis situation","example[29]":"Emergency powers were needed to deal with the crisis situation.","collocation[17]":"crisis talks","example[30]":"The Prime Minister went back to London for crisis talks.","definition[2]":"a period of great difficulty, danger, or uncertainty, especially in politics or economics","example[31]":"Opposition leaders accused the president of ignoring the country’s growing economic crisis.","example[32]":"Many Americans still remember the long lines at gas stations during the energy crisis of 1972.","definition[3]":"a time when people no longer have confidence in something and no longer support it","example[33]":"There seems to be a crisis of confidence in the economy."}