{"signpost[0]":"disagree","definition[0]":"if a group of people splits, or if it is split, people in the group disagree strongly with each other and the group sometimes divides into separate smaller groups","example[0]":"It was feared that the issue would split the church.","example[1]":"The war has split the nation in two.","note[0]":"split something in two/down the middle","example[2]":"The party is split over the issue of immigration.","note[1]":"be split on/over something","example[3]":"The government appears deeply split on this issue.","example[4]":"The Pan-Africanist Congress split from the ANC in 1959.","note[2]":"split from","signpost[1]":"separate into parts","definition[1]":"to divide or separate something into different parts or groups, or to be divided into different parts or groups","example[5]":"Can you split into groups of three now?","note[3]":"split into","example[6]":"The book is split into six sections.","note[4]":"split something into something","signpost[2]":"break or tear","definition[2]":"if something splits, or if you split it, it tears or breaks along a straight line","example[7]":"The branch split under their weight.","example[8]":"One of the boxes had split open.","example[9]":"The board had split in two.","note[5]":"split (something) in two/half","example[10]":"Split the pineapple down the middle.","signpost[3]":"share","definition[3]":"to divide something into separate parts and share it between two or more people","example[11]":"We agreed to split the cost.","example[12]":"The money will have to be split three ways.","note[6]":"split something three/four etc ways","example[13]":"Profits will be split between three major charities.","note[7]":"split something between somebody/something","example[14]":"He agreed to sell the car and split the proceeds with his brother.","note[8]":"split something with somebody","signpost[4]":"injure","definition[4]":"to make someone’s head or lip have a cut in it, as a result of a fall or hit","example[15]":"She fell against a table and split her lip.","example[16]":"The force of the blow nearly split his head open.","signpost[5]":"end relationship","definition[5]":"if people split, they end a marriage or relationship with each other","example[17]":"The band split two years ago.","example[18]":"He split from his wife last year.","note[9]":"split with/from","definition[6]":"to leave a place quickly","example[19]":"Come on – let’s split.","signpost[6]":"tear","definition[7]":"a tear or crack in something made of cloth, wood etc","example[20]":"a long split in the sleeve of his coat","note[10]":"split in","signpost[7]":"disagreement","definition[8]":"a serious disagreement that divides an organization or group of people into smaller groups","synonym[0]":"rift","example[21]":"The argument could lead to a damaging split in the party.","note[11]":"split in/within","example[22]":"a deep split within the government","example[23]":"a split between the radicals and the moderates within the group","note[12]":"split between","example[24]":"The union is desperate to avoid a split over this issue.","note[13]":"split over","signpost[8]":"end of relationship","definition[9]":"the end of a marriage or relationship – used especially in newspapers and magazines","example[25]":"rumours of a marriage split","example[26]":"She seems to be getting over her recent split with her fiancé.","note[14]":"split with","signpost[9]":"dividing something","definition[10]":"the way in which something, especially money, is shared between several people","example[27]":"In a publishing deal, the average split used to be 50:50 between writer and publisher.","example[28]":"a three-way split in the profits","note[15]":"three-way/four-way etc split","signpost[10]":"separation","definition[11]":"a clear separation or difference between two things","example[29]":"the traditional split between the state and church","definition[12]":"to divide something into separate parts so that two or more people each get a part","example[30]":"We agreed to split the fee.","example[31]":"The merger forced us to split operations between London and Edinburgh.","note[16]":"split something between","example[32]":"All profits will be split three ways  (=into three parts).","definition[13]":"to divide or separate something into different parts, or be divided into different parts","example[33]":"They planned to split into three companies to fight the bid.","example[34]":"He plans to split the firm up between his two sons.","definition[14]":"to divide a company’s shares into smaller units so that the value of each share is reduced and the number of shares is increased. This may be done to make it easier to buy and sell the shares","example[35]":"The company is splitting its 5p nominal shares into units of 2.5p to make them more marketable.","definition[15]":"to agree on a price, charge etc that is exactly half-way between the one that has been offered and the one that has been asked for","definition[16]":"the act of sharing money between a group of people, organizations etc, or the share that each group gets","example[36]":"I paid by credit card for two equal split payments.","example[37]":"The partners have agreed a three-way split (=a share of something that is divided equally between three people)."}