{"word[0]":"riot","definition[0]":"a situation in which a large crowd of people are behaving in a violent and uncontrolled way, especially when they are protesting about something","example[0]":"urban riots","example[1]":"prison riots","example[2]":"His murder triggered vicious race riots (=caused by a problem between different races).","example[3]":"police wearing riot gear (=the special clothing and equipment worn by police officers during a riot)","example[4]":"police in bullet-proof vests and carrying riot shields (=a piece of very hard plastic which police officers stand behind to protect them)","collocation[0]":"cause a riot","example[5]":"When the election results were announced, it caused riots in the capital.","collocation[1]":"spark off a riot","example[6]":"The incident sparked off a riot which lasted for three days.","collocation[2]":"quell a riot","example[7]":"The police marched in to quell the riots.","collocation[3]":"a riot begins/breaks out/erupts","example[8]":"Riots broke out last month following the verdict.","form[0]":"ADJECTIVES/NOUN + riot","collocation[4]":"a prison riot","example[9]":"The prison riots were caused by bad physical conditions and poor security.","collocation[5]":"race riots","example[10]":"In 1967, there were race riots in a number of major American cities.","collocation[6]":"urban/inner-city riots","example[11]":"The urban riots forced the Government to invest in the inner cities.","collocation[7]":"a serious/major riot","example[12]":"The jail was hit by a serious riot last year.","collocation[8]":"a full-scale riot","example[13]":"The disturbance escalated into a full-scale riot.","form[1]":"riot + NOUN","collocation[9]":"riot police","example[14]":"The city deployed riot police to contain the demonstration.","collocation[10]":"the riot squad","example[15]":"Then someone called the riot squad.","example[16]":"Demonstrators clashed with 140 riot squad officers, drawn from the police and the British army.","collocation[11]":"riot gear","example[17]":"Almost 1,000 officers, many in riot gear, were needed to restore order.","collocation[12]":"a riot shield","example[18]":"The police moved in on the demonstration using riot shields and tear gas.","collocation[13]":"riot control","example[19]":"All officers are trained in riot control.","definition[1]":"if a crowd of people riot, they behave in a violent and uncontrolled way, for example by fighting the police and damaging cars or buildings","example[20]":"University students rioted in protest at tuition fees."}