{"word[0]":"think","past_tense[0]":"thought","signpost[0]":"opinion/belief","definition[0]":"to have a particular opinion or to believe that something is true","example[0]":"Do you honestly think I would do something so stupid?","example[1]":"We must start thinking in terms of reducing costs.","example[2]":"What do you think of your new school?","note[0]":"what do you think of/about somebody/sth?","example[3]":"I thought it best to call first.","note[1]":"think it necessary/possible/best etc","example[4]":"I thought it appropriate to invite her to speak at the meeting.","example[5]":"Fraud is thought to be costing software companies millions of dollars a year.","note[2]":"be thought to be (doing) something","example[6]":"I think that you’re being unfair.","note[3]":"think (that)","example[7]":"I thought I heard something.","example[8]":"He didn’t think anyone would believe him.","example[9]":"Do you think I should call him?","example[10]":"For some reason, I keep thinking it’s Friday today.","example[11]":"The recession lasted longer than anyone thought it would.","example[12]":"Am I right in thinking that you have a brother?","example[13]":"I can’t help thinking that he’s made a mistake.","signpost[1]":"use your mind","definition[1]":"to use your mind to decide about something, form an opinion, imagine something etc","example[14]":"She thought very carefully before answering.","example[15]":"Wait a minute – I’m thinking.","example[16]":"Holmes sat thinking deeply (=thinking in a serious and careful way).","example[17]":"She thought very hard before deciding to leave her job.","note[4]":"think (long and) hard","example[18]":"I dread to think how much this call is going to cost.","note[5]":"I dread/shudder/hate to think","example[19]":"She lay awake thinking about the money.","note[6]":"think about/of","example[20]":"I can’t think what else we could have done.","note[7]":"think what/how/when etc","signpost[2]":"have an idea","definition[2]":"to have words or ideas in your mind without telling them to anyone","example[21]":"‘How strange!’ he thought.","example[22]":"‘I don’t care!’ she thought to herself.","example[23]":"It was impossible to know what he was thinking.","example[24]":"I was just thinking what a lovely time we had yesterday.","signpost[3]":"remember","definition[3]":"to remember something","example[25]":"He was trying to think where he’d seen her before.","note[8]":"think where/what etc","example[26]":"I couldn’t think where I’d left my keys.","signpost[4]":"consider somebody/something","definition[4]":"to consider that someone or something is a particular thing or has a particular quality","example[27]":"We have good reason to think kindly of (=consider in an approving way) a school that has provided all our children with an excellent education.","example[28]":"Peter had always thought of Kate as someone to be avoided.","note[9]":"think of somebody/something as something","example[29]":"I want you to think of this as your home.","example[30]":"I’ve always thought of myself as a sensible person.","note[10]":"think of yourself as something","example[31]":"My parents never thought me capable of doing a degree.","note[11]":"think somebody (to be) something","heading[0]":"– Meaning 2: to use your mind to decide about something, form an opinion, imagine something etc","collocation[0]":"carefully","example[32]":"Think carefully about every spending decision you make.","example[33]":"I bet, if you think really hard, you can think of something to do.","collocation[1]":"deeply","example[34]":"I should have thought more deeply before I agreed.","collocation[2]":"seriously","example[35]":"I thought seriously about my doctor’s advice.","collocation[3]":"clearly","example[36]":"She was simply too tired to think clearly.","collocation[4]":"long and hard","example[37]":"I thought long and hard about taking the role.","collocation[5]":"I dread/hate/shudder to think","example[38]":"I dread to think what might have happened if we hadn’t found her.","heading[1]":"GRAMMAR: Patterns with think","explanation[0]":"You think that something is true","example[39]":"I think that she is a great writer","explanation[1]":"You think that something will happen","example[40]":"Do you think the weather will be fine tomorrow?","explanation[2]":"You think that someone can do something","example[41]":"I don’t think that he can come to the meeting","explanation[3]":"You think  that someone should do something, or ought to do something","example[42]":"Do you think that the government should increase taxes?","example[43]":"I think that he ought to be ashamed of himself","explanation[4]":"You think that something could be true or might  be true","example[44]":" I think that the keys might be upstairs","explanation[5]":"You think that something could happen or might happen","example[45]":"Some people think there could be another world economic crisis","explanation[6]":"In negative sentences, you say I don’t think","example[46]":"I don’t think that’s right","example[47]":"I don’t think he liked it","bad_example[0]":"I think that isn’t right","bad_example[1]":"I think he didn’t like it","explanation[7]":"You can use the phrases I think so or I don’t think so, usually to give a short answer","example[48]":"'Is his name John?' 'I think so'","example[49]":"'Are we late?' 'I don’t think so'","bad_example[2]":"I think it","explanation[8]":"When think means ‘believe’, it is not normally used in the progressive You say","example[50]":"I think you look nice","bad_example[3]":"I am thinking you look nice","explanation[9]":"In spoken English, people sometimes say I’m thinking to describe their present thoughts about something that is happening right now","example[51]":"I’m thinking we should leave","explanation[10]":"In more formal English, you can say it is thought that something is true","example[52]":"It is thought that as many as a billion people are learning English","heading[2]":"to have a particular opinion","example[53]":"I think you’re right.","example[54]":"She didn’t think that the film was very good.","display[0]":"believe","definition[5]":"to have an opinion that you are sure is right, especially about an important subject such as politics or religion","example[55]":"The protestors believe that it is wrong to experiment on animals.","example[56]":"Do you really believe that the only solution to violence is more violence?","display[1]":"feel","definition[6]":"to have a particular opinion, especially one that is based on your feelings, not on facts","example[57]":"She feels that there is no alternative.","example[58]":"I just felt that it was the right thing to do.","display[2]":"take the view that","example[59]":"The court took the view that the company had acted unreasonably.","example[60]":"The college takes the view that smoking in the workplace is a fire risk.","heading[3]":"to think about something","example[61]":"I’ve been thinking about what you said – maybe you’re right.","example[62]":"I need some time to think.","definition[7]":"to think about something carefully before deciding what to do","example[63]":"Have you considered working for a year before going to college?","display[3]":"weigh","definition[8]":"to carefully think about a plan or choice by comparing all the advantages and disadvantages involved","example[64]":"You need to weigh up the pros and cons (=the advantages and disadvantages), and decide which investment is the best one for you.","example[65]":"The committee are still weighing the alternatives.","display[4]":"give something some/a lot of thought","definition[9]":"to think carefully about something, before you make a final decision about it","example[66]":"Why don’t you give it some thought and then get back to me?","example[67]":"He had obviously given the matter a lot of thought.","display[5]":"mull something over","definition[10]":"to think about a problem, plan etc before making a decision","example[68]":"Can you give me a bit of time to mull it over?","display[6]":"ponder","definition[11]":"to spend time thinking carefully and seriously about something, especially a problem or something complicated","example[69]":"She is still pondering what to do.","example[70]":"Officials are pondering ways to remove the oil from the beaches.","display[7]":"contemplate","definition[12]":"to think about something you might do in the future","example[71]":"Did you ever contemplate resigning?","display[8]":"reflect","definition[13]":"to think carefully about something, especially something that happened in the past","example[72]":"It was a good time to reflect upon the changes that had happened in my life.","heading[4]":"to keep thinking about something","display[9]":"brood","definition[14]":"to keep thinking for a long time about something that worries you or that makes you angry or upset","example[73]":"There’s no point brooding over things you can’t change.","display[10]":"dwell on something","definition[15]":"to spend too much time thinking about something sad or unpleasant","example[74]":"I try to enjoy my life today and not dwell on the past."}