{"word[0]":"blame","definition[0]":"to say or think that someone or something is responsible for something bad","example[0]":"Don’t blame me – it’s not my fault.","example[1]":"I blame his mother. She does everything for him.","example[2]":"Marie still blames herself for Patrick’s death.","note[0]":"blame somebody/something for something","example[3]":"The report blames poor safety standards for the accident.","example[4]":"The decision to increase interest rates was widely blamed (=blamed by many people) for the crisis.","example[5]":"One of the computers is broken and she’s blaming it on me.","note[1]":"blame something on somebody/something","example[6]":"The crash was blamed on pilot error.","definition[1]":"to say or think that someone or something is responsible for something bad that has happened","example[7]":"Democrats have blamed Republicans for the failure to reach an agreement.","example[8]":"Police blamed bad weather for a series of accidents on the roads.","example[9]":"For many years I blamed myself for her death.","example[10]":"They blamed the failure of the business on the economic downturn.","display[0]":"put/place/lay the blame on somebody/something","definition[2]":"to say who or what you think is responsible for something bad that has happened, often unfairly or wrongly","example[11]":"Don’t try to put the blame on me!","example[12]":"Subsequent investigations placed the blame squarely on city officials.","example[13]":"Farmers have laid the blame for their problems entirely on EU policies.","display[1]":"say it’s somebody’s fault","definition[3]":"to say that someone is responsible for something bad that has happened","example[14]":"Are you saying it’s my fault that we lost the game?","display[2]":"hold somebody responsible","definition[4]":"to say that someone is responsible for something bad that has happened, because it was their duty to prevent it from happening","example[15]":"He was held personally responsible for the failure of the project.","display[3]":"take the rap","definition[5]":"to be blamed and punished for something that you did not do, or that someone else is also responsible for","example[16]":"He expects his wife to take the rap for him.","example[17]":"Alan’s colleagues decided to let him carry the can.","definition[6]":"responsibility for a mistake or for something bad","example[18]":"I always get the blame (=am blamed) for his mistakes!","example[19]":"She stole the money but she’s trying to put the blame on (=blame) me.","example[20]":"Do you accept any blame for what happened?","note[2]":"blame for","collocation[0]":"get the blame","example[21]":"Sam knew that if something went wrong, he’d get the blame.","collocation[1]":"take/accept/shoulder the blame","example[22]":"No one was prepared to take the blame for the disaster.","example[23]":"Parents must shoulder the blame if their kids behave badly.","collocation[2]":"put/pin the blame on somebody","example[24]":"Don’t try to put the blame on me.","example[25]":"Everyone laid the blame for the crisis on the government.","collocation[3]":"shift the blame (onto somebody)","example[26]":"She always tried to shift the blame onto her brother.","collocation[4]":"apportion/assign blame","example[27]":"He seemed to want to apportion blame for her death.","collocation[5]":"share the blame","example[28]":"He admitted he shared the blame for their World Cup defeat.","collocation[6]":"the blame lies with somebody","example[29]":"In this case, the blame lay with the police.","collocation[7]":"place the blame squarely/firmly on somebody","example[30]":"A military investigation placed the blame squarely on city officials.","collocation[8]":"point the finger of blame at somebody","example[31]":"I couldn’t believe it when they started pointing the finger of blame at me."}