{"word[0]":"priest","definition[0]":"someone who is specially trained to perform religious duties and ceremonies in the Christian church","definition[1]":"a man with religious duties and responsibilities in some non-Christian religions","example[0]":"a Catholic priest","example[1]":"a Buddhist priest","example[2]":"Women priests are much more common these days.","example[3]":"The priest who married us was very friendly and helpful.","display[0]":"bishop","definition[2]":"a priest of high rank in some branches of the Christian church, who is the head of all the churches and priests in a large area","example[4]":"the Bishop of Oxford","example[5]":"a meeting of bishops","display[1]":"vicar","definition[3]":"a priest in the Church of England who is in charge of a church in a particular area","example[6]":"our local vicar","display[2]":"preacher","definition[4]":"someone who gives the sermon (=a religious talk as part of a church service) in some Protestant churches","example[7]":"a Methodist preacher","display[3]":"minister","definition[5]":"the formal word for any priest in some branches of the Christian church","example[8]":"In 1843,450 ministers of the church broke away from the established church of Scotland.","display[4]":"chaplain","definition[6]":"someone, especially a priest, who takes care of the religious needs of an organization such as a college, hospital, prison, or the military","example[9]":"the prison chaplain","display[5]":"pastor","definition[7]":"someone who is in charge of the prayers, ceremonies etc in some branches of the Protestant church","example[10]":"a Baptist pastor","display[6]":"rabbi","definition[8]":"the person who is in charge of the prayers, ceremonies etc in the Jewish religion","example[11]":"Israel’s chief rabbis","display[7]":"mullah","definition[9]":"a Muslim teacher of law and religion","example[12]":"The people turned to their traditional leaders, the mullahs.","display[8]":"holy man","definition[10]":"someone who is treated with great respect by people who belong to a religion","example[13]":"A Sadhu, or Hindu holy man, was performing yoga on the banks of the River Ganges.","display[9]":"the clergy","definition[11]":"the official leaders in organized religions, such as the priests, rabbis, and mullahs","example[14]":"Around 30 members of the clergy gathered for the meeting.","display[10]":"clergyman","definition[12]":"a male member of the clergy – used especially in the past","example[15]":"His youngest son decided to become a clergyman."}