{"word[0]":"monitor","definition[0]":"to carefully watch and check a situation in order to see how it changes over a period of time","example[0]":"Patients who are given the new drug will be asked to monitor their progress.","example[1]":"The government is monitoring the situation closely.","example[2]":"The temperature is carefully monitored.","example[3]":"We need a better system for monitoring what is going on.","note[0]":"monitor what/how etc","definition[1]":"to secretly listen to other people’s telephone calls, foreign radio broadcasts etc","example[4]":"He suspected that his phone calls were being monitored.","signpost[0]":"screen","definition[2]":"a television or part of a computer with a screen, on which you can see pictures or information","example[5]":"She was staring at her computer monitor.","note[1]":"television/TV/computer monitor","example[6]":"We could watch what was happening on the TV monitor.","note[2]":"on a monitor","signpost[1]":"piece of equipment for measuring","definition[3]":"a piece of equipment that measures and shows the level, speed, temperature etc of something","example[7]":"a heart monitor","example[8]":"The noise monitor recorded 98 decibels.","signpost[2]":"somebody who watches an activity","definition[4]":"someone whose job is to watch an activity or a situation to see how it changes or develops, or to make sure that it is fair and legal","example[9]":"UN monitors will remain in the country to supervise the elections.","example[10]":"The UN is sending peace monitors to the area.","note[3]":"peace/human rights etc monitors","signpost[3]":"child","definition[5]":"a child who has been chosen to help a teacher in some way in class","signpost[4]":"somebody who listens to radio","definition[6]":"someone whose job is to listen to news or messages on a radio and report on them","definition[7]":"to carefully watch and check a situation in order to see how it changes or progresses over a period of time","example[11]":"The company constantly monitors its performance against that of its competitors.","definition[8]":"the part of a computer that looks like a television and shows information","synonym[0]":"VDU","example[12]":"a color monitor","definition[9]":"an independent person whose job is to make sure that an activity, situation etc is fair or legal","example[13]":"human rights monitors"}