{"word[0]":"make out","signpost[0]":"see/hear","definition[0]":"to be just able to see or hear something","example[0]":"He could just make out a dark shape moving towards him.","example[1]":"I couldn’t make out what he was saying.","note[0]":"make out who/what etc","signpost[1]":"understand something","definition[1]":"to understand something, especially the reason why something has happened","example[2]":"As far as I can make out, he has never been married.","example[3]":"I couldn’t make out what I had done to annoy her.","note[1]":"make out what/how/why etc","type[0]":"usually in questions and negatives","signpost[2]":"understand somebody","definition[2]":"to understand someone’s character and the way they behave","example[4]":"Stuart’s a strange guy – I can’t make him out at all.","signpost[3]":"write cheque etc","definition[3]":"to write something such as a bill or cheque","example[5]":"She was making out a list of people to invite.","example[6]":"The book gives advice on making out a will.","example[7]":"Make the cheque out to ‘Grays Ltd’.","note[2]":"make something ↔ out to","signpost[4]":"say/pretend","definition[4]":"to say that something is true when it is not","example[8]":"The situation was never as bad as the media made out.","example[9]":"She always tried to make out that I was wrong and she was right.","note[3]":"make out (that)","example[10]":"He makes me out to be some sort of idiot.","note[4]":"make somebody/something out to be something","definition[5]":"to find good reasons that prove something or show why you need something","example[11]":"We made out a case for hiring another assistant.","signpost[5]":"succeed","definition[6]":"to succeed or progress in a particular way","synonym[0]":"get on","example[12]":"How did you make out this morning?","definition[7]":"to kiss and touch someone in a sexual way","definition[8]":"to get or win a lot of money","example[13]":"The lawyers made out like bandits.","definition[9]":"to write a cheque, bill etc so that it can be paid to someone","example[14]":"Can you make the cheque out to me?","example[15]":"How did you make out at the interview?"}