{"word[0]":"communicate","signpost[0]":"exchange information","definition[0]":"to exchange information or conversation with other people, using words, signs, writing etc","example[0]":"We communicated mostly by e-mail.","example[1]":"People use more than words when they communicate with each other.","note[0]":"communicate with","example[2]":"The decision was communicated to our staff late in 1998.","note[1]":"communicate something to somebody","signpost[1]":"tell people something","definition[1]":"to express your thoughts and feelings clearly, so that other people understand them","example[3]":"A baby communicates its needs by crying.","example[4]":"His enthusiasm communicated itself to the voters.","example[5]":"A teacher must be able to communicate effectively to students.","example[6]":"Without meaning to, she communicated her anxiety to her child.","definition[2]":"if two people communicate, they are able to talk about and understand each other’s feelings or desires","example[7]":"Many couples make themselves miserable by not communicating.","example[8]":"Parents sometimes find it difficult to communicate with their teenage children.","signpost[2]":"disease","definition[3]":"to pass a disease from one person or animal to another","explanation[0]":"Communicate is often passive in this meaning","signpost[3]":"rooms","definition[4]":"if rooms or parts of a building communicate, you can get directly to one from the other","example[9]":"communicating doors","definition[5]":"to exchange information or have a conversation with someone, by telephone, letter etc, or by seeing them","example[10]":"Now that we live in different cities, we communicate by e-mail.","example[11]":"He is able to communicate using a special keyboard, which is connected to a computer.","example[12]":"This message is not being communicated to staff.","display[0]":"contact","definition[6]":"to write to, phone, or email someone especially for the first time, in order to give or ask for information","example[13]":"Neighbours contacted police after seeing a man with a gun.","example[14]":"She refused to comment when contacted by reporters from the local newspaper.","display[1]":"get in touch (with somebody)","definition[7]":"to write to, telephone, or email someone, especially someone who you do not see very often","example[15]":"I really ought to get in touch with Paula. It's been months since we last spoke.","example[16]":"You've got my phone number if you need to get in touch.","display[2]":"get hold of somebody","definition[8]":"to succeed in contacting someone by telephone after trying several times","example[17]":"Where have you been? I've been trying to get hold of you all week.","example[18]":"It's no use trying to phone Linda at work – she's impossible to get hold of.","display[3]":"approach","definition[9]":"to contact someone that you do not know or have not contacted before, in order to offer them something or ask them for something","example[19]":"He has already been approached by several professional football teams.","example[20]":"The company confirmed that it had been approached about a merger."}