{"word[0]":"some","definition[0]":"a number of people or things, or an amount of something, when the exact number or amount is not stated","example[0]":"I need some apples for this recipe.","example[1]":"My mother has inherited some land.","example[2]":"They’re looking for someone with some experience.","example[3]":"The doctor gave her some medicine for her cough.","definition[1]":"a number of people or things or an amount of something, but not all","example[4]":"Some people believe in life after death.","example[5]":"She’s been so depressed that some days she can’t get out of bed.","definition[2]":"a fairly large number of people or things or a fairly large amount of something","example[6]":"It was some time before they managed to turn the alarm off.","example[7]":"The donation went some way toward paying for the damage.","definition[3]":"used to mean a person or thing, when you do not know or say exactly which","example[8]":"There must be some reason for her behaviour.","example[9]":"Can you give me some idea of the cost?","example[10]":"We can hopefully reach some kind of agreement.","note[0]":"some kind/type/form/sort of something","definition[4]":"used when you are talking about a person or thing that you do not know, remember, or understand, or when you think it does not matter","example[11]":"Some guy called for you while you were gone.","example[12]":"Just give him some excuse or other.","note[1]":"some something or other/another","definition[5]":"used to say that something was very good or very impressive","example[13]":"That was some party last night!","definition[6]":"a number of people or things or an amount of something, but not a large number or amount","example[14]":"There were some children playing in the street.","example[15]":"‘Have we got any biscuits?’ ‘Yes, I’ve just bought some.’","definition[7]":"a small number of people, things etc. A few is used when there is a smaller number than some","example[16]":"‘Are there any chocolates left?’ ‘Only a few.’","example[17]":"I’m going out with a few of my friends.","display[0]":"a couple of","definition[8]":"two or a very small number","example[18]":"Can I ask you a couple of questions?","example[19]":"I’ll just have a couple of drinks.","display[1]":"a little","definition[9]":"a small amount of something","example[20]":"I speak a little Spanish.","example[21]":"He just wants a little sugar.","display[2]":"a certain amount of","definition[10]":"a fairly large amount – use this to talk about people’s feelings, abilities etc","example[22]":"It’s a job that requires a certain amount of skill.","definition[11]":"a number of people or things or an amount of something, when the exact number or amount is not stated","example[23]":"I’ve just made a pot of coffee. Would you like some?","example[24]":"‘Do you know where the screws are?’ ‘There are some in the garage.’","example[25]":"Many local businesses are having difficulties, and some have even gone bankrupt.","example[26]":"Some say it was an accident, but I don’t believe it.","example[27]":"Many of the exhibits were damaged in the fire, and some were totally destroyed.","example[28]":"Some of his jokes were very rude.","note[2]":"some of","example[29]":"Can I have some of your cake?","example[30]":"‘Are you feeling better today?’ ‘Some, I guess.’","definition[12]":"tending to behave in a particular way, or having a particular quality","example[31]":"a troublesome boy  (=who causes trouble)","example[32]":"a bothersome back injury  (=that bothers you)","definition[13]":"a group of a particular number, for example in a game","example[33]":"a golf foursome  (=four people playing golf together)"}