{"word[0]":"convention","definition[0]":"a large formal meeting for people who belong to the same profession or organization or who have the same interests","example[0]":"a teachers’ convention","example[1]":"the city’s new convention center","example[2]":"a convention for science fiction fans","definition[1]":"a formal agreement, especially between countries, about particular rules or behaviour","synonym[0]":"pact","example[3]":"the European convention on human rights","note[0]":"convention on","definition[2]":"behaviour and attitudes that most people in a society consider to be normal and right","synonym[1]":"custom","example[4]":"Playing together teaches children social conventions such as sharing.","example[5]":"They defied the conventions of the time by living together without being married.","example[6]":"By convention, the bride’s father gives her away at her wedding.","note[1]":"by convention","definition[3]":"a method or style often used in literature, art, the theatre etc to achieve a particular effect","example[7]":"the conventions of the 19th-century novel","heading[0]":"– Meaning 3: behaviour and attitudes that most people in a society consider to be normal and right","collocation[0]":"a social/cultural convention","example[8]":"Each society has its own cultural conventions.","collocation[1]":"an established convention","example[9]":"There are established conventions for how you should end a letter.","collocation[2]":"an accepted convention","example[10]":"Saying 'thank you' and 'please' is an accepted convention.","collocation[3]":"defy convention","example[11]":"At the time she was defying convention by living with a man.","collocation[4]":"follow convention","example[12]":"If everyone followed convention, the world would be a boring place.","collocation[5]":"conform to/adhere to convention","example[13]":"He’d always chosen not to conform to convention.","collocation[6]":"flout convention","example[14]":"I was determined to flout convention when it came to the funeral arrangements.","collocation[7]":"a set of conventions","example[15]":"In the East you will have to learn a different set of conventions.","collocation[8]":"rules and conventions","example[16]":"Rules and conventions permeate the whole of social life.","definition[4]":"behaviour and attitudes that most people in a society believe to be normal and right","definition[5]":"a formal agreement, especially between countries, about rules for an activity such as war or trade","example[17]":"The Berne convention requires its signatories to respect copyrights for the life of the author plus 50 years.","definition[6]":"a large meeting of people who belong to the same profession or organization, or work in the same industry","example[18]":"Business was so bad that many dealers decided not to go to that year’s National Automobile Dealers Association convention."}