{"word[0]":"between","definition[0]":"in or through the space that separates two things, people, or places","example[0]":"I sat down between Sue and Jane.","example[1]":"a house and stables, with a yard in between","example[2]":"The ball rolled between his feet.","definition[1]":"in the time that separates two times or events","example[3]":"Are there any public holidays between Christmas and Easter?","example[4]":"You shouldn’t eat between meals.","example[5]":"The team have a lot of work to do between now and Sunday.","example[6]":"A lot of students spend a year abroad in between school and university.","example[7]":"I’ve had a few jobs, with long periods of unemployment in between.","definition[2]":"within a range of amounts, numbers, distances etc","example[8]":"The project will cost between eight and ten million dollars.","example[9]":"Most of the victims were young men between the ages of 16 and 21.","definition[3]":"used to say which two places are joined or connected by something","example[10]":"They’re building a new road between Manchester and Sheffield.","definition[4]":"used to say which people or things are involved in something together or are connected","example[11]":"the long-standing friendship between Bob and Bryan","example[12]":"co-operation between the two countries","example[13]":"She had overheard a private conversation between two MPs.","example[14]":"the link between serious sunburn and deadly skin cancer","definition[5]":"used to say which people or things get, have, or are involved in something that is shared","example[15]":"Tom divided his money between his children.","example[16]":"Between the four of them they managed to lift her into the ambulance.","example[17]":"We collected £17 between us.","definition[6]":"used to say which two things or people you are comparing","example[18]":"the contrast between town and country life","example[19]":"In her book she makes a comparison between Russian and British ballet.","example[20]":"the difference between good music and really great music","definition[7]":"used when it is difficult to give an exact description of something and you therefore have to compare it to two things that are similar to it","example[21]":"He uttered a sound that was something between a sigh and a groan."}