{"word[0]":"habit","signpost[0]":"usual/regular","definition[0]":"something that you do regularly or usually, often without thinking about it because you have done it so many times before","example[0]":"Regular exercise is a good habit.","example[1]":"Thinking negatively can become a habit.","example[2]":"She has a habit of playing with her hair when she’s nervous.","example[3]":"Some people drink alcohol as much from habit as from desire.","example[4]":"I did it out of habit.","note[0]":"by/out of/from habit","definition[1]":"a strong physical need to keep taking a drug regularly","example[5]":"A lot of drug addicts get into petty crime to support their habit.","example[6]":"His cocaine habit ruined him physically and financially.","note[1]":"heroin/cocaine etc habit","definition[2]":"a long loose piece of clothing worn by people in some religious groups","example[7]":"a nun’s habit","collocation[0]":"have a habit (of doing something)","example[8]":"He has a habit of being late.","collocation[1]":"something becomes a habit","example[9]":"Once you have been driving for a few weeks, it becomes a habit.","collocation[2]":"get into a habit","example[10]":"Try to get into the habit of walking for 30 minutes each day.","collocation[3]":"get out of a habit","example[11]":"She couldn’t get out of the habit of saying 'sorry'.","collocation[4]":"break/kick a habit","example[12]":"I’ve smoked for years, but I really want to kick the habit.","collocation[5]":"develop/form a habit","example[13]":"I developed a habit of eating porridge for breakfast.","collocation[6]":"change your habits","example[14]":"It's sometimes difficult for people to change their habits.","collocation[7]":"a good/bad habit","example[15]":"Eating healthy food as snacks is a good habit to get into.","collocation[8]":"eating/drinking habits","example[16]":"You need to change your eating habits.","collocation[9]":"buying/spending habits","example[17]":"The recession will mean that many people will be changing their spending habits.","collocation[10]":"viewing habits","example[18]":"Parents try to control their children’s viewing habits.","collocation[11]":"sexual habits","example[19]":"a survey of the sexual habits of gay men","collocation[12]":"personal habits","example[20]":"Some of his personal habits were unpleasant.","collocation[13]":"social habits","example[21]":"Television changed some of our social habits.","collocation[14]":"an annoying/unpleasant/nasty habit","example[22]":"He had the unpleasant habit of eating with his mouth open.","collocation[15]":"a strange/peculiar/odd habit","example[23]":"He had a lot of peculiar habits, one of them being to stare at you without blinking.","collocation[16]":"be in the habit of doing something","example[24]":"On Friday evenings, Carrie was in the habit of visiting her parents.","collocation[17]":"(by/from) force of habit","example[25]":"I still walk by his house each day - force of habit, I suppose.","collocation[18]":"change/break the habits of a lifetime","example[26]":"It is hard to change the habits of a lifetime, but you must eat more healthily or you will have a heart attack.","collocation[19]":"have the unfortunate habit of doing something","example[27]":"Teenage girls have the unfortunate habit of laughing too loudly.","definition[3]":"something you do regularly, often without thinking about it","example[28]":"Biting your nails is a bad habit.","example[29]":"I always go to the same supermarket, out of habit.","display[0]":"mannerism","definition[4]":"a way of speaking or a small movement of your face or body that is part of your usual behaviour","example[30]":"Even her mannerisms are the same as her sister’s.","display[1]":"custom","definition[5]":"something that people in a particular society do because it is traditional or the accepted thing to do","example[31]":"In Japan, it is the custom to take off your shoes when you enter a house.","display[2]":"tradition","definition[6]":"a belief, custom, or way of doing something that has existed for a long time","example[32]":"The tradition of giving Easter eggs goes back hundreds of years.","example[33]":"In many countries, it’s a tradition for the bride to wear white.","example[34]":"It was a family tradition to go for a walk on Christmas Day.","display[3]":"practice","definition[7]":"something that people often do, especially as part of their work or daily life","example[35]":"The hotel has ended the practice of leaving chocolates in guests’ rooms."}