{"word[0]":"clue","definition[0]":"an object or piece of information that helps someone solve a crime or mystery","example[0]":"Police have found a vital clue.","example[1]":"a desperate search for clues","example[2]":"We now have an important clue as to the time of the murder.","note[0]":"clue to/about/as to","example[3]":"Archaeological evidence will provide clues about what the building was used for.","example[4]":"This information is a valuable clue in our hunt for the bombers.","note[1]":"clue in","definition[1]":"information that helps you understand the reasons why something happens","example[5]":"Childhood experiences may provide a clue as to why some adults develop eating disorders.","definition[2]":"a piece of information that helps you solve a crossword puzzle, answer a question etc","example[6]":"I’ll give you a clue, Kevin, it’s a kind of bird.","collocation[0]":"provide a clue","example[7]":"Any information could provide the police with useful clues.","collocation[1]":"hold a clue","example[8]":"The poem itself holds a clue about who it was written for.","collocation[2]":"leave a clue","example[9]":"The bombers may have left behind vital clues.","collocation[3]":"search (something) for clues","example[10]":"Detectives are still searching the house for clues.","collocation[4]":"look for/hunt for clues","example[11]":"Investigators descended on the crime scene hunting for clues.","collocation[5]":"find a clue","example[12]":"No one had found any clues as to where the missing girl could be.","collocation[6]":"an important/useful/valuable clue","example[13]":"The car used in the robbery may provide important clues.","collocation[7]":"a vital clue","example[14]":"A videotape could hold vital clues to the criminal’s identity.","collocation[8]":"a further clue","example[15]":"They searched the surrounding area for further clues.","collocation[9]":"a search for clues","example[16]":"She opened every drawer in her desperate search for clues.","definition[3]":"the US name for the game Cluedo"}