{"word[0]":"if","definition[0]":"used when talking about something that might happen or be true, or might have happened","example[0]":"We’ll stay at home if it rains.","example[1]":"If you need money, I can lend you some.","example[2]":"If I didn’t apologize, I’d feel guilty.","example[3]":"If you had worked harder, you would have passed your exams.","example[4]":"What would happen to your family if you were to die in an accident?","example[5]":"If Dad were here, he would know what to do.","example[6]":"Taste the soup and add salt and pepper if necessary.","example[7]":"I want to get back by five o’clock if possible.","example[8]":"I think I can fix it tomorrow. If not, you’ll have to wait till Friday.","example[9]":"Is the book available, and if so, where?","example[10]":"The missiles can be fired only if the operator types in a six-digit code.","example[11]":"We’ll face that problem if and when it comes along  (=if it happens or when it happens).","example[12]":"If by any chance you can’t manage dinner tonight, perhaps we can at least have a drink together.","definition[1]":"used to mention a fact, situation, or event that someone asks about, or is not certain about","example[13]":"He stopped to ask me if I was all right.","example[14]":"I don’t know if what I am saying makes any sense.","example[15]":"I doubt if anyone will remember me.","example[16]":"I’m not sure if this is the right road or not.","definition[2]":"used to mention a type of event or situation when talking about what happens on occasions of that type","example[17]":"If I go to bed late, I feel dreadful in the morning.","example[18]":"Plastic will melt if it gets too hot.","definition[3]":"used when saying what someone’s feelings are about a possible situation","example[19]":"You don’t seem to care if I’m tired.","example[20]":"I’m sorry if I upset you.","example[21]":"It would be nice if we could spend more time together.","definition[4]":"used when making a polite request","example[22]":"I wonder if you could help me.","example[23]":"I’d be grateful if you would send me further details.","example[24]":"Would you mind if I open a window?","example[25]":"If you would just wait for a moment, I’ll try to find your papers.","definition[5]":"used when you are adding that something may be even more, less, better, worse etc than you have just said","example[26]":"Brian rarely, if ever, goes to bed before 3 am.","example[27]":"Their policies have changed little, if at all, since the last election.","example[28]":"Her needs are just as important as yours, if not more so.","example[29]":"The snow was now two feet deep, making it difficult, if not impossible, to get the car out.","definition[6]":"used during a conversation when you are trying to make a suggestion, change the subject, or interrupt someone else","example[30]":"If I might just make a suggestion, I think that the matter could be easily settled with a little practical demonstration.","example[31]":"If I could just take one example to illustrate this.","definition[7]":"used to say that, although something may be true, it is not important","example[32]":"If he has a fault at all, it is that he is too generous.","example[33]":"Her only problem, if you can call it a problem, is that she expects to be successful all the time.","definition[8]":"used when adding one criticism of a person or thing that you generally like","example[34]":"The eldest son was highly intelligent, if somewhat lazy.","example[35]":"Lunch was a grand if rather noisy affair.","example[36]":"I’m not sure if I heard him correctly","example[37]":"I don’t know if he is guilty","display[0]":"whether","example[38]":"I’m not sure whether I heard him correctly","example[39]":"I don’t know whether he is guilty","explanation[0]":"You can use whether after a preposition","example[40]":"We discussed the issue of whether to pay","bad_example[0]":"the issue of if to pay","explanation[1]":"whether to do something","example[41]":"He doesn’t know whether to accept","bad_example[1]":"He doesn’t know if to accept","definition[9]":"used when talking about the possibility that something might happen or be true","example[42]":"He faces a long prison sentence if the court finds him guilty.","example[43]":"If scientists’ predictions are correct, average global temperatures could rise by 6 degrees.","display[1]":"unless","definition[10]":"if something does not happen, or if someone does not do something","example[44]":"The star is difficult to see unless the sky is very clear.","example[45]":"Doctors said they could not treat the boy unless his parents gave their permission.","display[2]":"whether or not","definition[11]":"used when saying that it does not matter if something happens or not, or if something is true or not","example[46]":"Most people will get better on their own, whether or not they receive medical treatment.","example[47]":"I’m still going, whether she likes it or not.","display[3]":"otherwise","definition[12]":"used when saying that there will be a bad result if someone does not do something, or if something does not happen","example[48]":"Drink plenty of water – otherwise you will become dehydrated.","display[4]":"in case","definition[13]":"in order to deal with something that might happen","example[49]":"She did not think it would rain, but she took her umbrella just in case.","example[50]":"It is best to keep a medical kit ready in case of emergency.","display[5]":"as long as/provided that","definition[14]":"only if something else happens or is true","example[51]":"Visitors are welcome, as long as they bring their own tent.","example[52]":"Anyone can join the course, provided that there is space available.","example[53]":"As long as you can find a computer, you can access an internet-based bank account wherever you are.","display[6]":"on condition that","definition[15]":"used when you agree to do something only if someone first agrees to do something else","example[54]":"He was offered the job  on condition that he went on a month-long training course.","definition[16]":"something that may or may not happen","example[55]":"There are too many ifs in this plan of yours.","definition[17]":"a famous poem by Rudyard Kipling which starts with the words If you can keep your head when all about you/Are losing theirs and blaming it on you... It describes the qualities of character that some people think of as typically English, such as the ability to remain calm in difficult situations."}