{"word[0]":"intelligent","definition[0]":"an intelligent person has a high level of mental ability and is good at understanding ideas and thinking clearly","example[0]":"a group of highly intelligent (=very intelligent) students","example[1]":"Sontag was once famously described as the most intelligent woman in America.","definition[1]":"an intelligent comment, question, conversation etc shows that you have thought about something carefully and understand it well","example[2]":"an intelligent question","example[3]":"You can’t have an intelligent conversation with him.","definition[2]":"an intelligent creature is able to think and understand","example[4]":"Are there intelligent beings on other planets?","example[5]":"forms of intelligent life","definition[3]":"an intelligent machine, system etc is able to learn and use information","definition[4]":"having a high level of mental ability, and good at thinking clearly and understanding ideas","example[6]":"The top universities aim to select the most intelligent students.","display[0]":"clever","definition[5]":"intelligent, so that you can think and learn quickly and find ways to solve problems","example[7]":"That was very clever of you. How did you do that?","example[8]":"I wasn’t smart enough to be a lawyer.","definition[6]":"intelligent – used especially about children and young people","example[9]":"He’s a very bright kid.","example[10]":"the brightest student in the class","display[1]":"brilliant","definition[7]":"extremely intelligent and good at the work you do","example[11]":"a brilliant scientist","display[2]":"gifted","definition[8]":"a gifted child is much more intelligent than most other children","example[12]":"a special school for gifted children","display[3]":"wise","definition[9]":"able to make good decisions and give sensible advice, especially because you have a lot of experience","example[13]":"a wise old man","display[4]":"cunning/crafty","definition[10]":"good at using your intelligence to get what you want, often by making secret plans or tricking people","example[14]":"She was cunning enough to keep this latest piece of information secret.","example[15]":"He’s a crafty old devil!","display[5]":"brainy","definition[11]":"intelligent and good at studying","example[16]":"My sister is the brainy one in our family."}