{"definition[0]":"belonging to the present time or most recent time","synonym[0]":"contemporary","note[0]":"Modern Greek/Hebrew etc (=the form of the language used today)","example[0]":"Such companies must change if they are to compete in the modern world.","example[1]":"They are the youngest children in modern times to face murder charges.","example[2]":"Smaller families are a feature of modern society.","example[3]":"Computers are an essential part of modern life.","example[4]":"a book about modern history","example[5]":"The original supermarkets were small by modern standards.","definition[1]":"made or done using the most recent designs or methods","synonym[1]":"up-to-date","example[6]":"A lot of progress has been made with the use of modern technology.","example[7]":"advances in modern medicine","example[8]":"modern surgical techniques","definition[2]":"modern art, music, literature etc uses styles that have been recently developed and are very different from traditional styles","example[9]":"an exhibition of modern art","example[10]":"modern dance","definition[3]":"having very recent attitudes or ways of behaving","synonym[2]":"progressive","opposite[0]":"traditional","example[11]":"The school is very modern in its approach to sex education.","collocation[0]":"the modern world","example[12]":"The island has hardly been affected by the modern world.","collocation[1]":"modern society","example[13]":"In modern society, elderly relatives rarely live with their children.","collocation[2]":"modern times","example[14]":"It was one of the greatest disasters of modern times.","collocation[3]":"the modern age/era/period","example[15]":"In the modern age, television is the main means of mass communication.","collocation[4]":"modern life","example[16]":"These problems are a major part of modern life.","collocation[5]":"modern man","example[17]":"Modern man gets much less exercise in his daily life than his ancestors.","collocation[6]":"modern history","example[18]":"a degree in modern history","collocation[7]":"modern languages","example[19]":"French, German and other modern languages","collocation[8]":"the modern equivalent of something","example[20]":"In their own minds they are the modern equivalent of highwaymen.","definition[4]":"something that is modern uses the most recent designs or methods","example[21]":"The house looks very modern.","example[22]":"the city’s modern public transportation system","display[0]":"the latest","definition[5]":"the newest that is available","example[23]":"The camera uses the latest digital technology.","example[24]":"the very latest mobile phones","example[25]":"the latest news","definition[6]":"using the most modern technology, ideas, information etc","example[26]":"The hospital has the most up-to-date equipment in the country.","display[1]":"newfangled","definition[7]":"modern – used when you disapprove of something and do not think it as good as the things that existed before","example[27]":"He doesn’t believe in these new-fangled gadgets.","display[2]":"high-tech, hi-tech","definition[8]":"using very advanced technology, especially electronic equipment and computers","example[28]":"Modern tractors are full of high-tech equipment, including GPS.","example[29]":"It’s all very hi-tech.","display[3]":"state-of-the-art","definition[9]":"using the newest and most advanced features, ideas, and materials that are available","example[30]":"state-of-the-art technology","example[31]":"a state-of-the-art home entertainment system","example[32]":"The brand new arts centre is state-of-the-art."}