{"word[0]":"cap","signpost[0]":"hat","definition[0]":"a type of flat hat that has a curved part sticking out at the front, and is often worn as part of a uniform","example[0]":"a baseball cap","example[1]":"old men in flat caps","example[2]":"a chauffeur’s peaked cap","definition[1]":"a covering that fits very closely to your head","example[3]":"a swimming cap","example[4]":"a shower cap","definition[2]":"a type of simple hat that fits very closely to your head, worn especially by women in the past","example[5]":"a white lace cap","signpost[1]":"covering","definition[3]":"a protective covering that you put on the end or top of an object","synonym[0]":"top","example[6]":"Make sure you put the cap back on the pen.","example[7]":"a bottle cap","definition[4]":"an upper limit that is put on the amount of money that someone can earn, spend, or borrow","example[8]":"a cap on local council spending","definition[5]":"if a sportsperson wins a cap or is given a cap, he or she is chosen to play for their country","example[9]":"He won his first England cap against Wales in 1994.","definition[6]":"a sportsperson who has played for his or her country","example[10]":"Mason is one of two new caps in the team.","signpost[2]":"small explosive","definition[7]":"a small paper container with explosive inside it, used especially in toy guns","definition[8]":"a contraceptive made of a round piece of rubber that a woman puts inside her vagina","synonym[1]":"diaphragm","form[0]":"types of cap","example[11]":"He was wearing a sweater and a baseball cap.","collocation[0]":"a flat cap","example[12]":"We saw an old man in a jacket and a brown flat cap.","collocation[1]":"a peaked cap","example[13]":"She wore a sailor's peaked cap.","collocation[2]":"a swimming/bathing cap","example[14]":"A swimming cap will stop you getting your hair wet.","example[15]":"There was a little bag containing soap, shampoo and a shower cap.","collocation[3]":"wear a cap","example[16]":"He was wearing a baseball cap.","collocation[4]":"put on/take off/remove your cap","example[17]":"He opened the door, took off his cap, and threw it on a hook.","definition[9]":"to limit the amount of something, especially money, that can be used, allowed, or spent","example[18]":"the only county to have its spending capped by the government","explanation[0]":"Cap is often passive in this meaning","signpost[3]":"good/bad","definition[10]":"to say, do, or be something that is better, worse, or more extreme than something that has just happened or been said","example[19]":"Well, we went three nights with no sleep at all. I bet you can’t cap that!","definition[11]":"to choose someone for a national sports team","example[20]":"He’s been capped three times for England.","explanation[1]":"Cap is usually passive in this meaning","signpost[4]":"tooth","definition[12]":"to cover a tooth with a special hard white substance","example[21]":"He’s had his teeth capped.","definition[13]":"(the Common Agricultural Policy) a system of laws arranged by the European Union to control the production of food and other farm crops. It set limits on how much farmers can grow, and provided them with financial support. The CAP has often been criticized as a wasteful use of European Union money, and some people think it has given a lot of money to rich farmers who do not need it.","definition[14]":"abbreviation for COMMON AGRICULTURAL POLICY","definition[15]":"to put a limit on the amount of money that can be charged or spent","example[22]":"The total annual fee is capped at 1.5%.","example[23]":"Up to 150 local government jobs could go if the Council has its spending capped by the new Home Secretary.","definition[16]":"to put a limit on the amount of interest that can be charged on a loan, however much interest rates rise","example[24]":"annual rate increases capped at two percentage points"}