{"word[0]":"score","signpost[0]":"in a game","definition[0]":"the number of points that each team or player has won in a game or competition","example[0]":"At half-time the score was one all.","example[1]":"What’s the score?","example[2]":"Is anybody keeping score (=making a record of the score)?","example[3]":"The final score was Southampton two, Leeds United nil.","example[4]":"a score of 3–2","note[0]":"score of","signpost[1]":"in a test or experiment","definition[1]":"the number of points a student has earned for correct answers in a test","example[5]":"The school’s test scores have not improved.","example[6]":"a score of 90%","definition[2]":"the number of points that a person or group of people gets in a scientific test or experiment","example[7]":"He had an IQ score of 120.","definition[3]":"a written or printed copy of a piece of music, especially for a large group of performers, or the music itself","example[8]":"a musical score","example[9]":"Who wrote the score for the movie?","definition[4]":"a mark that has been cut onto a surface with a sharp tool","example[10]":"deep scores in the wood","signpost[2]":"win points","definition[5]":"to win a point in a sport, game, competition, or test","example[11]":"Great cheers went up when he scored in the final minute of the game.","example[12]":"She scored an average of 9.9 in the test.","example[13]":"He has scored 12 goals so far this season.","note[1]":"score a goal/point/run etc","signpost[3]":"give points","definition[6]":"to give a particular number of points in a game, competition, test, or experiment","example[14]":"Each event will be scored separately.","example[15]":"Responses to the individual items are scored on a scale ranging from 0 to 12.","signpost[4]":"succeed","definition[7]":"to be very successful in something you do","example[16]":"Her new book has scored a spectacular success.","signpost[5]":"have sex","definition[8]":"to have sex with someone, especially someone you have just met","definition[9]":"to mark a line on a piece of paper, wood etc using a sharp instrument","example[17]":"Scoring the paper first makes it easier to fold.","definition[10]":"to arrange a piece of music for a group of instruments or voices","example[18]":"The piece is scored for a soprano voice and orchestra.","note[2]":"be scored for something","explanation[0]":"Score is usually passive in this meaning","signpost[6]":"get drugs","definition[11]":"to manage to buy or get illegal drugs","definition[12]":"a group of 20, or about 20, people or things","note[3]":"three score years and ten old use (=70 years, a person’s expected length of life)","example[19]":"Our coach was escorted by a score of policemen.","note[4]":"a score of something"}