{"word[0]":"public","signpost[0]":"ordinary people","definition[0]":"relating to all the ordinary people in a country, who are not members of the government or do not have important jobs","example[0]":"We have to show that publishing this story is in the public interest  (=helpful or useful to ordinary people).","example[1]":"full public access to information","example[2]":"Public opinion is gradually shifting in favor of the imprisoned men.","example[3]":"There was a public outcry  (=expression of anger by a lot of people) about the shooting.","example[4]":"Their activities have been hidden from the public gaze (=people's eyes or attention).","signpost[1]":"for anyone","definition[1]":"available for anyone to use","opposite[0]":"private","note[0]":"public transport British English,  public transportation American English (=buses, trains etc)","example[5]":"a public telephone","example[6]":"a public footpath","example[7]":"proposals to ban smoking in public places","example[8]":"a public library","definition[2]":"relating to the government and the services it provides for people","example[9]":"the Government’s public spending plans","example[10]":"We do not believe he is fit for public office  (=a job in the government).","example[11]":"efforts to control public expenditure","example[12]":"public funding for the arts","signpost[2]":"known about","definition[3]":"known about by most people","example[13]":"Details of the highly sensitive information have not been made public.","example[14]":"Although not a public figure  (=famous person), he was a man of great influence.","signpost[3]":"not hidden","definition[4]":"intended for anyone to know, see, or hear","example[15]":"Today the school finds itself in the midst of a very public debate.","example[16]":"There will be a public inquiry into the sinking of the oil tanker.","example[17]":"a fear of public speaking","example[18]":"She was acutely embarrassed by his public display of temper.","note[1]":"public display of grief/affection etc","signpost[4]":"place with a lot of people","definition[5]":"a public place usually has a lot of people in it","example[19]":"Let’s go somewhere less public where we can talk.","definition[6]":"the people who like a particular singer, writer etc","example[20]":"He is adored by his public.","example[21]":"The theatre-going public are very demanding.","explanation[0]":"Public is usually followed by a singular verb","example[22]":"The public needs to be better informed","example[23]":"The public need to be better informed","definition[7]":"ordinary people who do not belong to the government or have any special position in society","example[24]":"An offer for the sale of shares to the general public was planned for early next year.","example[25]":"The privatisation was carried out against the wishes of the public.","example[26]":"Companies that take significant sums of money from members of the public before providing goods are in a special position of trust.","definition[8]":"connected with all the ordinary people in a country, who are not members of the government or do not have important jobs","example[27]":"The law was changed as the result of public pressure.","definition[9]":"connected with the government and with the services it provides for people","example[28]":"55% of university funding in Britain comes from public money.","example[29]":"We do not believe he is fit for public office (=the job of being part of a government).","example[30]":"The report will be made public (=told to everyone) in mid-January.","example[31]":"The membership of the Board was public knowledge.","example[32]":"Demands for a public investigation have been ignored.","definition[10]":"to become a PUBLIC COMPANY (=a company that has shares owned by the public)","example[33]":"Investors expected the share price to rise steeply after the company went public."}