{"definition[0]":"the average amount is the amount you get when you add together several quantities and divide this by the total number of quantities","example[0]":"The age of the candidates ranged from 29 to 49 with an average age of 37.","example[1]":"The average cost of making a movie has risen by 15%.","example[2]":"Last winter was colder than average.","example[3]":"The cars were being sold at an average price of $11,000.","definition[1]":"an average amount or quantity is not unusually big or small","example[4]":"They have an average-size front garden and a large rear garden.","example[5]":"He was in his late twenties and of average height.","note[0]":"of average height/build/intelligence etc","definition[2]":"having qualities that are typical of most people or things","example[6]":"The average American has not even thought about next year’s election.","example[7]":"In an average week I drive about 250 miles.","definition[3]":"neither very good nor very bad","definition[4]":"the amount calculated by adding together several quantities, and then dividing this amount by the total number of quantities","example[8]":"The December figures brought the annual average for 2001 up to 10.6 per cent.","example[9]":"The average of 3,8, and 10 is 7.","note[1]":"average of","example[10]":"Each person raised an average of £60 to plant an acre of trees.","definition[5]":"the usual level or amount for most people or things","example[11]":"Streets in the town centre are wider than the average.","example[12]":"The murder rate in the city has risen to four times the national average.","example[13]":"The school’s eighth-graders are above average in science.","note[2]":"above/below average","definition[6]":"to usually do something or usually happen a particular number of times, or to usually be a particular size or amount","example[14]":"The water in the lake is not particularly deep, averaging about 12 metres.","example[15]":"The airport averages about a thousand flights a month.","example[16]":"Inflation averaged just under 2.8% per year.","definition[7]":"to calculate the average of figures","example[17]":"The rate of growth was averaged over a period of three years.","definition[8]":"the average amount is the amount you get when you add together several amounts and divide this by the number of amounts you have added together","synonym[0]":"MEAN","example[18]":"Oil companies are basing their budgets on an average price of $20.40 a barrel.","example[19]":"The electronics industry has increased output by an average rate of 14% a year.","example[20]":"Average earnings in the state are about $2500 a month.","definition[9]":"having qualities that are typical of most of the people or things in a group","example[21]":"The average employee in Chicago must work 18 minutes to buy a hamburger.","example[22]":"Coffee production in an average year here totals 450,000 tonnes.","definition[10]":"the amount calculated by adding together several amounts, and then dividing this amount by the total number of amounts added together","example[23]":"Sales in the various markets improved by an average of 40% last year.","definition[11]":"based on a calculation of how many times something happens, how much money someone usually gets, how often people usually do something etc","example[24]":"On average, people in their 50s require 45% more drug prescriptions than people in their 30s.","example[25]":"Visitors to Legoland on average spend $26 each.","definition[12]":"the usual level or amount for most people or things in a group","example[26]":"Employee pay and benefits are above average here.","example[27]":"Stockmarket volume was below average at 12.1 million shares traded.","example[28]":"Tea productivity in Assam is over 2,000 kg a hectare, compared with a national average in India of 1,790 kg a hectare.","definition[13]":"a list of shares on a stock market, showing the general level of shares at a particular moment","synonym[1]":"INDEX","example[29]":"The industrial average (=shares in industrial companies on a particular stockmarket) surged 535.17 points, or 20.3%.","definition[14]":"a loss relating to damage to a ship or the CARGO (=goods it is carrying)","definition[15]":"if something averages a particular amount or rate, that is its average amount or rate","example[30]":"In Europe, budget deficits average 5% of GDP.","example[31]":"The store is averaging sales of $300,000 on an annual basis.","definition[16]":"to calculate the average of a number of amounts","example[32]":"The new system works by averaging the payments made to local authorities."}