{"word[0]":"embarrassment","definition[0]":"the feeling you have when you are embarrassed","example[0]":"She suffered extreme embarrassment at not knowing how to read.","note[0]":"embarrassment at","example[1]":"He could not hide his embarrassment at his children’s rudeness.","example[2]":"To her embarrassment, she couldn’t remember his name.","note[1]":"to somebody’s embarrassment","definition[1]":"an event that causes a government, political organization etc problems, and makes it look bad","example[3]":"The allegations have been an acute embarrassment  (=serious and severe embarrassment) to the prime minister.","note[2]":"embarrassment to/for","example[4]":"The scandal was a further source of embarrassment to the government.","definition[2]":"someone who behaves in a way that makes you feel ashamed, nervous, or uncomfortable","example[5]":"Tim’s drinking has made him an embarrassment to the whole family.","note[3]":"embarrassment to","heading[0]":"– Meaning 1: the feeling you have when you are embarrassed","collocation[0]":"great embarrassment","example[6]":"To my great embarrassment, my dad started dancing.","collocation[1]":"severe/extreme embarrassment","example[7]":"This scandal could cause severe embarrassment to the government.","collocation[2]":"considerable embarrassment","example[8]":"His behaviour was a source of considerable embarrassment to his family.","collocation[3]":"acute embarrassment","example[9]":"There was a moment of acute embarrassment when we realized people were watching.","collocation[4]":"further embarrassment","example[10]":"His resignation should save the government any further embarrassment.","collocation[5]":"potential embarrassment","example[11]":"By dropping out of the competition, he was spared the potential embarrassment of losing.","collocation[6]":"obvious embarrassment","example[12]":"He shuffled his feet around in obvious embarrassment.","collocation[7]":"cause embarrassment","example[13]":"Some of his jokes caused embarrassment to the older members of the audience.","collocation[8]":"avoid embarrassment","example[14]":"This solution could help both countries avoid embarrassment.","collocation[9]":"hide your embarrassment","example[15]":"She started laughing in an attempt to hide her embarrassment.","collocation[10]":"a source of embarrassment","example[16]":"His views on immigration were a constant source of embarrassment to the party.","heading[1]":"– Meaning 2: an event that causes a government, political organization etc problems, and makes it look bad","collocation[11]":"be/become an embarrassment","example[17]":"Your behaviour is becoming an embarrassment to the school.","collocation[12]":"be considered an embarrassment","example[18]":"He may be popular abroad, but he's considered an embarrassment at home.","collocation[13]":"prove an embarrassment","example[19]":"The publication of the documents proved a severe embarrassment to the company.","collocation[14]":"a big/severe embarrassment","example[20]":"This failure was a severe embarrassment to the government.","collocation[15]":"a huge embarrassment","example[21]":"If the story is true, it could prove a huge embarrassment to the star.","collocation[16]":"a serious/major embarrassment","example[22]":"This episode has been a serious embarrassment for the club.","collocation[17]":"an acute embarrassment","example[23]":"Her memoirs were an acute embarrassment to the president.","collocation[18]":"a considerable embarrassment","example[24]":"The photograph was a considerable embarrassment to the royal family."}