{"comparative[0]":"calmer","superlative[0]":"calmest","definition[0]":"relaxed and quiet, not angry, nervous, or upset","example[0]":"Glen was calm and composed at the funeral.","example[1]":"I tried to stay calm and just ignore him.","note[0]":"remain/stay/keep calm","definition[1]":"if a place, period of time, or situation is calm, there is less activity, trouble etc than there sometimes is, or than there has been recently","example[2]":"The financial markets are calm at the moment.","example[3]":"The streets are calm again after last night’s disturbances.","definition[2]":"a sea, lake etc that is calm is smooth or has only gentle waves","example[4]":"The seas were dead calm.","definition[3]":"not getting angry, nervous, or upset, even in a difficult situation","example[5]":"We’ll talk about this later when you’re feeling calmer.","example[6]":"Everyone praised Douglas for the calm way in which he handled the situation.","definition[4]":"not worried about anything, especially so that people feel comfortable","example[7]":"Looking relaxed and confident, the president answered questions from the press.","example[8]":"There was a relaxed atmosphere.","display[0]":"chilled-out","definition[5]":"very relaxed and not worried – used especially by young people","example[9]":"I’m much more chilled-out about the whole thing this year.","display[1]":"laid-back","definition[6]":"someone who is laid-back is always relaxed and never seems to get worried or annoyed about anything","example[10]":"I like his laid-back attitude to life.","example[11]":"My parents are pretty laid-back and don’t mind me staying out late.","display[2]":"mellow","definition[7]":"relaxed, friendly, and happy, especially after drinking alcohol","example[12]":"After a few drinks, everyone was pretty mellow.","definition[8]":"staying calm and not showing your emotions, especially when other people are getting excited or angry","example[13]":"He is the kind of player who always manages to stay cool, even under pressure.","example[14]":"She was as cool as a cucumber (=very cool).","display[3]":"keep your head","definition[9]":"to manage to stay calm and behave in a sensible way in a difficult or frightening situation","example[15]":"In this job you need to be good at keeping your head in a crisis.","definition[10]":"a situation or time that is quiet and peaceful","example[16]":"Hindu leaders appealed for calm (=asked that the public stay calm) after a temple was burnt to the ground.","example[17]":"The presence of soldiers helped restore calm.","example[18]":"The last five years have seen a period of relative calm.","example[19]":"A scream shattered the late afternoon calm.","note[1]":"morning/afternoon/evening calm","example[20]":"They remained on the terrace after dinner, enjoying the calm of the evening.","note[2]":"calm of","definition[11]":"to become quiet and relaxed after you have been angry, excited, nervous, or upset, or to make someone become quiet and relaxed","example[21]":"He tried to calm the frightened children.","example[22]":"Calm down and tell me what happened.","example[23]":"We tried to calm people’s fears.","example[24]":"She lit a cigarette to calm herself down.","note[3]":"calm yourself (down)","definition[12]":"if a situation calms down, it becomes easier to deal with because there are fewer problems and it is not as busy as it was before","example[25]":"It took months for things to calm down after we had the baby."}