{"word[0]":"outlook","definition[0]":"your general attitude to life and the world","example[0]":"Exercise will improve your looks and your outlook.","example[1]":"She still has an optimistic outlook for the future.","note[0]":"positive/optimistic outlook","example[2]":"He’s got a good outlook on life.","note[1]":"outlook on","definition[1]":"what is expected to happen in the future","example[3]":"a gloomy economic outlook in Western Europe","note[2]":"economic/financial/political etc outlook","example[4]":"The outlook for the weekend is unsettled, with periods of heavy rain.","note[3]":"outlook for","example[5]":"The outlook for sufferers from this disease is bleak.","definition[2]":"a view from a particular place","example[6]":"a very pleasing outlook from the bedroom window","collocation[0]":"a positive/optimistic outlook","example[7]":"Despite her health problems, she has a positive outlook.","collocation[1]":"a negative/pessimistic outlook","example[8]":"This pessimistic outlook on their lives leads to depression.","collocation[2]":"a wider/broader outlook","example[9]":"Education should give students a wider outlook on life.","collocation[3]":"a new/fresh outlook","example[10]":"I saw Helen last week and she seemed to have a fresh outlook on life.","collocation[4]":"somebody's mental outlook","example[11]":"Exercise can help improve your mental outlook.","collocation[5]":"somebody's religious outlook","example[12]":"The Puritans' religious outlook affected every aspect of their lives.","collocation[6]":"somebody's moral/ethical outlook","example[13]":"Their ethical and moral outlook concerning terrorism is the complete opposite of mine.","collocation[7]":"have an outlook","example[14]":"He has quite a conventional outlook.","collocation[8]":"give somebody an outlook","example[15]":"June's new job gave her a fresh outlook.","collocation[9]":"change somebody's outlook","example[16]":"None of my arguments could change his outlook or behavior.","definition[3]":"the way things are expected to develop in the future","example[17]":"Given the currenteconomic outlook, the group expects its media businesses to generate increased earnings over the next five years.","example[18]":"The company blamed its weak performance on the recession and said the outlook for the rest of the year is brighter."}