{"definition[0]":"to allow something to happen, especially by an official decision, rule, or law","example[0]":"Smoking is only permitted in the public lounge.","example[1]":"He had more than the permitted level of alcohol in his blood.","example[2]":"As a punishment, she was not permitted to attend any school activities.","note[0]":"be permitted to do something","example[3]":"Dogs are not permitted inside the shop.","note[1]":"be permitted in/near etc something","example[4]":"The bill would permit workers 12 weeks of unpaid leave for family emergencies.","note[2]":"permit somebody something","explanation[0]":"Permit is a formal word, which is used especially about someone being officially allowed to do something. In everyday situations, people usually say let somebody do something or allow somebody to do something:","example[5]":"His parents won’t let him watch TV after ten o'clock.","definition[1]":"to make it possible for something to happen","example[6]":"The large windows permit a clear view of the lake.","example[7]":"I’ll see you after the meeting, if time permits (=if it finishes early enough).","example[8]":"We’ll have a picnic at the beach, weather permitting (=if the weather is good enough).","example[9]":"The moon permitted me to see a little way into the distance.","note[3]":"permit somebody to do something","explanation[1]":"Something  is permitted","example[10]":"Working from home is permitted","explanation[2]":"Someone is permitted to do something","example[11]":"Employees are permitted to work from home","explanation[3]":"Someone is permitted something","example[12]":"Women were not permitted a vote","explanation[4]":"Permit is usually used in the passive in this meaning","explanation[5]":"You allow someone to do something","example[13]":"Her boss allows her to work from home","explanation[6]":"Something is allowed","example[14]":"Working from home is allowed","explanation[7]":"Someone is allowed something","example[15]":"You are allowed one piece of hand luggage","explanation[8]":"Allow is often used in the passive","explanation[9]":"You let  someone do something","example[16]":"Her boss lets her work from home","bad_example[0]":"let someone to do something","explanation[10]":"Let is not used in the passive","definition[2]":"an official written statement giving you the right to do something","example[17]":"Hikers need a camping permit for overnight stays in the park.","note[4]":"travel/parking/export etc permit","example[18]":"A permit is required for fishing in the canal.","note[5]":"permit for","collocation[0]":"have a permit","example[19]":"Do you have a resident's parking permit?","collocation[1]":"need/require a permit","example[20]":"EU citizens no longer need a permit to work in the UK.","collocation[2]":"get a permit","example[21]":"You have to get a special permit in order to visit the Saiq plateau.","collocation[3]":"issue a permit","example[22]":"Up to ten fishing permits are issued each day.","collocation[4]":"obtain a permit","example[23]":"Hunters are required to obtain a permit.","collocation[5]":"apply for a permit","example[24]":"Farmers must apply for permits to use the new chemicals.","form[0]":"ADJECTIVES/NOUN + permit","collocation[6]":"a work permit","example[25]":"She had problems getting a work permit for the States.","collocation[7]":"a parking permit","example[26]":"You’ll need to apply for a residential parking permit.","collocation[8]":"a travel permit","example[27]":"Palestinians have to obtain a travel permit for travel between the West Bank and the Gaza Strip.","collocation[9]":"a residence permit","example[28]":"Residence permits will be limited to five years.","collocation[10]":"an export permit","example[29]":"An export permit is required for the export of this timber.","collocation[11]":"a gun permit","example[30]":"More than 300,000 civilians, in a country of 6 million, have gun permits.","collocation[12]":"a fishing permit","example[31]":"To fish you’ll need a rod licence and a fishing permit.","definition[3]":"an official document stating that someone is allowed to do something","example[32]":"The government would issue permits for fishing.","example[33]":"The company requested a permit to operate a hazardous-waste treatment plant.","note[6]":"permit to do something"}