{"word[0]":"study","plural[0]":"studies","signpost[0]":"research","definition[0]":"a piece of work that is done to find out more about a particular subject or problem, and usually includes a written report","example[0]":"Recent studies show that women still get paid a lot less than men.","example[1]":"The study was carried out between January and May 2008.","example[2]":"a study of Australian wild birds","note[0]":"study of/into/on","signpost[1]":"learning","definition[1]":"when you spend time learning, especially at home or by yourself rather than during school","example[3]":"Set aside a period of time specifically for study.","example[4]":"ways to improve study skills (=skills that help you study efficiently and be successful in school)","signpost[2]":"subject","definition[2]":"a subject that people study at a college or university","example[5]":"Environmental Studies","example[6]":"the scientific study of earthquakes","note[1]":"literary/historical/scientific etc study","example[7]":"Linguistics is the study of language.","note[2]":"study of","signpost[3]":"careful consideration","definition[3]":"when you examine or consider something very carefully and in detail","example[8]":"a report that deserves careful study","definition[4]":"a room in a house that is used for work or study","signpost[4]":"art","definition[5]":"a small detailed drawing, especially one that is done to prepare for a large painting","example[9]":"Renoir’s studies of small plants and flowers","definition[6]":"a piece of music, usually for piano, that is often intended for practice","collocation[0]":"do a study/carry out a study","example[10]":"The scientists are carrying out a study into the effects of global warming.","collocation[1]":"a study finds something","example[11]":"The study found that men were more likely to take risks.","collocation[2]":"a study shows something","example[12]":"Studies have shown that the drug works.","collocation[3]":"a study suggests/indicates something","example[13]":"A British study suggests that older drivers are safer drivers.","collocation[4]":"a study reveals something","example[14]":"A recent study revealed that 74% of donuts are bought on impulse.","collocation[5]":"a study confirms something","example[15]":"The study confirms what we all know – smoking is also bad for the people around you.","collocation[6]":"a study aims to do something","example[16]":"The study aimed to identify the housing needs of local people.","collocation[7]":"publish a study","example[17]":"The study was published in the British Medical Journal.","collocation[8]":"fund a study","example[18]":"The study was funded by a major US drugs company.","collocation[9]":"commission a study","example[19]":"The government has commissioned a study into the health of residents living near the power station.","form[0]":"ADJECTIVES/NOUN + study","collocation[10]":"a research study","example[20]":"Research studies have found that young people are drinking no more than they were 20 years ago.","collocation[11]":"a detailed study","example[21]":"They carried out a detailed study into the effects of the disease on mice.","collocation[12]":"a two-year/three-month etc study","example[22]":"They are engaged in a five-year study into the effects of calcium on bone health.","collocation[13]":"a huge/massive study","example[23]":"The journal published the results of a massive study of 87,000 women.","collocation[14]":"a previous/earlier study","example[24]":"The report is a summary of the work done in earlier studies.","collocation[15]":"a pilot study","example[25]":"The government has just completed a pilot study, with some encouraging results.","collocation[16]":"a feasibility study","example[26]":"They commissioned a feasibility study into re-opening the whole railway line.","collocation[17]":"the aims of a study","example[27]":"The aims of this study are to examine the reliability of current techniques.","collocation[18]":"the results/findings of a study","example[28]":"The results of this study suggest that the drug is effective in over 80% of cases.","example[29]":"His research confirmed the findings of earlier studies.","definition[7]":"to learn about a subject at school, university etc","example[30]":"I’ve been studying English for six years.","example[31]":"I can’t study with that music playing all the time.","example[32]":"Anna is studying French literature.","note[3]":"study law/business/history etc","example[33]":"My brother’s studying to be an accountant.","note[4]":"study to be a doctor/lawyer etc","example[34]":"I’ve only got three weeks left to study for my exams.","note[5]":"study for an exam/diploma etc","example[35]":"Stephen is currently studying at Exeter University.","note[6]":"study at a university/school etc","example[36]":"a psychologist who studied under Jung in Zurich","note[7]":"study under somebody","definition[8]":"to try to find out more about a subject or problem, using scientific methods","example[37]":"Goodall was studying the behavior of chimpanzees in the wild.","example[38]":"The scientists were studying the action of a protein called ubiquitin.","example[39]":"They’re studying how stress affects body chemistry.","note[8]":"study how/what/why etc","definition[9]":"to look at something carefully","synonym[0]":"look at","example[40]":"She studied his face.","example[41]":"They got out of the car and studied the map.","example[42]":"I haven’t had time to study the proposals yet.","example[43]":"If you study hard, you’ll get a good job.","example[44]":"He studied law at Harvard University.","definition[10]":"to study a subject that you have chosen at school, college etc","example[45]":"What classes are you taking next semester?","example[46]":"In my final year, I decided to take English and economics.","display[0]":"do","definition[11]":"to study a particular subject at school or university","example[47]":"I can’t decide whether to do German or Spanish next year.","example[48]":"Did you do computing at school?","display[1]":"major in something","definition[12]":"to study something as your main subject at a college or university","example[49]":"Diane majored in psychology at the University of Washington.","display[2]":"revise","definition[13]":"to study to prepare for an examination","example[50]":"It’s best to start revising early.","example[51]":"He’s revising for his final exams.","display[3]":"cram","definition[14]":"to study very hard and try to learn a lot of information just before an examination","example[52]":"Everyone’s cramming for their final exams.","display[4]":"do research","definition[15]":"to study something in a very detailed way, especially in order to discover new information about it","example[53]":"He does research at Oxford University.","example[54]":"I’m doing research into second language learning.","example[55]":"It’s difficult to do research on humans.","example[56]":"According to a new study, home ownership in Europe ranges from 29% in Switzerland to 82% in Ireland.","example[57]":"a four-month study of the world’s largest debt market","note[9]":"study of/into","past_tense[0]":"studied","definition[16]":"to carefully consider a plan, idea, document etc","example[58]":"We are studying a bonus system based on how long brokers stay at the firm.","definition[17]":"to watch or examine something carefully over a period of time in order to discover more about it","example[59]":"Japanese firms are studying the U.S. market very carefully.","definition[18]":"to spend time reading, going to classes etc in order to learn about a subject","example[60]":"She was studying economics at Fordham University."}