{"word[0]":"migrant","definition[0]":"someone who goes to live in another area or country, especially in order to find work","note[0]":"economic migrant (=someone who goes to live in another country because they are likely to find a better job there)","example[0]":"A lot of factory work is done by migrant workers.","note[1]":"migrant worker/labourer","definition[1]":"a bird or animal that travels regularly from one part of the world to another","form[0]":"migrant + NOUN","collocation[0]":"a migrant worker","example[1]":"The strawberries are picked by migrant workers.","collocation[1]":"migrant labourer","example[2]":"The centre houses 50 migrant labourers.","collocation[2]":"migrant labour","example[3]":"Many farms rely on migrant labour.","collocation[3]":"a migrant population","example[4]":"The town has a large migrant population.","collocation[4]":"the flow of migrants","example[5]":"the increasing flow of migrants into California","collocation[5]":"an influx of migrants","example[6]":"The growth of towns was due to an influx of migrants from the villages.","collocation[6]":"an illegal migrant","example[7]":"Thousands of illegal migrants were caught trying to cross the sea to England.","collocation[7]":"an economic migrant","example[8]":"They are economic migrants, escaping terrible poverty in their home country.","collocation[8]":"a rural migrant","example[9]":"Rural migrants end up in the slums of Brasilia.","collocation[9]":"a new/recent migrant","example[10]":"Some of the recent migrants have returned to their homes as the fighting finished.","collocation[10]":"a migrant comes from/to a place","example[11]":"A majority of the migrants had come from this region.","collocation[11]":"attract migrants","example[12]":"The settlement attracted new migrants and it expanded quickly.","definition[2]":"someone who goes to another area or country, especially in order to find work","example[13]":"The work is usually done by low-paid migrant workers.","example[14]":"a system to regulate migrant labor in California"}