{"word[0]":"health","definition[0]":"the general condition of your body and how healthy you are","example[0]":"I’m worried about my husband’s health.","definition[1]":"the work of providing medical services to keep people healthy","example[1]":"The government has promised to spend more on health and education.","example[2]":"health insurance","example[3]":"nurses and other health workers","definition[2]":"when you have no illness or disease","example[4]":"Even if you haven’t got much money, at least you’ve got your health.","example[5]":"When we last met, he was glowing with health  (=was clearly very healthy).","definition[3]":"how successful something such as a business, an organization, or a country’s economy is","example[6]":"The monthly trade figures are seen as an indicator of the health of the economy.","example[7]":"Physical exercise is essential to good health.","example[8]":"At the age of 70, her health is excellent.","example[9]":"He wanted to join the army but his health was too poor.","collocation[0]":"ill health","example[10]":"He retired early due to ill health.","collocation[1]":"failing health","example[11]":"Despite failing health, he travelled to Australia to visit his son.","collocation[2]":"mental health","example[12]":"Poverty affects children's physical and mental health.","collocation[3]":"physical health","example[13]":"Her physical health was generally good.","collocation[4]":"sexual health","example[14]":"The programme aims to educate teenagers about sexual health.","collocation[5]":"general health","example[15]":"A balanced diet will improve your general health.","collocation[6]":"human health","example[16]":"Some chemicals pose a significant risk to human health.","collocation[7]":"damage your health","example[17]":"There is no doubt that smoking can seriously damage your health.","collocation[8]":"endanger your health","example[18]":"Being overweight endangers your health.","collocation[9]":"improve (somebody's) health","example[19]":"Doing more exercise will improve your health.","collocation[10]":"somebody's health improves","example[20]":"Her health improved slowly after she came home from hospital.","collocation[11]":"somebody's health deteriorates","example[21]":"Her health deteriorated rapidly.","form[0]":"health + NOUN","collocation[12]":"health care","example[22]":"Many Americans cannot afford even basic health care.","collocation[13]":"a health problem","example[23]":"He missed a lot of time at work through health problems.","collocation[14]":"a health risk/hazard/threat","example[24]":"The report looked at the health risks linked to eating excess sugar.","collocation[15]":"health benefits","example[25]":"the health benefits of doing yoga","collocation[16]":"health effects","example[26]":"The study looked at the long-term health effects of drinking alcohol.","collocation[17]":"a health warning","example[27]":"the health warning on cigarette packets","collocation[18]":"be in good/poor health","example[28]":"Her parents were elderly and in poor health.","collocation[19]":"be good/bad for your health","example[29]":"Eating plenty of vegetables is good for your health.","collocation[20]":"somebody's state of health","example[30]":"Your choice of exercise must depend on your general state of health.","collocation[21]":"health and well-being","example[31]":"The breakfast program improves the health and well-being of the children.","definition[4]":"the business of providing medical services to keep people healthy","synonym[0]":"HEALTHCARE","example[32]":"Increased resources had been made available for health, housing, and education.","example[33]":"Rentokil specialises in industrial products in the field of public health.","example[34]":"Health inspectors came to check the factory’s canteen.","definition[5]":"used to talk about how successful an organization, system, or economy is","example[35]":"This is a serious threat to the health of Japan’s banking system.","example[36]":"The balance sheet provides a lot of information on the financial health of the company.","definition[6]":"if a system or an organization gets a clean bill of health, it is said to be in a good financial position after a detailed examination of it has been made","example[37]":"A meeting of EU finance ministers gave the European exchange-rate mechanism a clean bill of health.","definition[7]":"to make an official statement that a product is not harmful or dangerous","example[38]":"Lawyers said the company had something to hide about the drug’s development, but the FDA gave Prozac a clean bill of health."}