{"word[0]":"produce","definition[0]":"to cause a particular result or effect","example[0]":"New drugs are producing remarkable results.","example[1]":"a rise in sea level produced by climatic change","example[2]":"As a policy, it did not produce the desired effect.","signpost[0]":"create/make","definition[1]":"to make, write etc something to be bought, used, or enjoyed by people","example[3]":"The factory produces an incredible 100 cars per hour.","example[4]":"How did you manage to produce a meal so quickly?","signpost[1]":"make naturally","definition[2]":"to grow something or make it naturally","example[5]":"This region produces the grapes used in champagne.","example[6]":"Plants produce oxygen.","definition[3]":"if you produce an object, you bring it out or present it, so that people can see or consider it","example[7]":"When challenged, he produced a gun.","example[8]":"They were unable to produce any statistics to verify their claims.","signpost[2]":"play/film","definition[4]":"if someone produces a film or play, they find the money for it and control the way it is made","example[9]":"Costner produced and directed the film.","definition[5]":"to give birth to a baby or young animals","example[10]":"An adult cat may produce kittens three times a year.","definition[6]":"food or other things that have been grown or produced on a farm to be sold","note[0]":"dairy produce British English (=milk, butter, cheese etc)","example[11]":"fresh local produce","note[1]":"agricultural/organic etc produce","form[0]":"ADJECTIVES/NOUN + produce","collocation[0]":"organic produce","example[12]":"There is increased demand for organic produce.","collocation[1]":"agricultural/farm produce","example[13]":"The government bought surplus agricultural produce from farmers.","collocation[2]":"garden produce","example[14]":"She had filled a basket with her garden produce.","collocation[3]":"local produce","example[15]":"Local produce is used wherever possible.","collocation[4]":"fresh produce","example[16]":"Wash all fresh produce before use.","collocation[5]":"dairy produce","example[17]":"Vitamin A can also be obtained from dairy produce and eggs.","definition[7]":"food that has been grown on the land or produced in large quantities, using farming methods","example[18]":"Where it once offered 125 items of produce, A&P now sells 300 fruits and vegetables.","definition[8]":"to make or grow something in large quantities to be sold","example[19]":"The plant in Leningrad will produce parts used in building construction.","example[20]":"The British assembly plants still don’t produce as efficiently as those in Germany.","example[21]":"Colombia produced a bumper  (=very large) coffee crop this year.","definition[9]":"to make something happen or to have a particular result or effect","example[22]":"A strong market could mean sales will produce substantial profit gains.","example[23]":"The planning sessions have not yet produced a coherent strategy.","definition[10]":"to control the preparation of a film, television programme etc, especially the amount of money spent making it","example[24]":"Disney’s computer-animated film will be produced by Pixar.","definition[11]":"to show an official document when it is needed, for example as proof of something","example[25]":"The judge ordered officials to produce financial records within three days."}