{"signpost[0]":"continue","definition[0]":"to continue doing something or being in a situation","example[0]":"I can’t go on like this for much longer.","example[1]":"He went on working until he was 91.","note[0]":"go on doing something","example[2]":"One of the actors was unwell and couldn’t go on with the performance.","definition[1]":"to continue without stopping","example[3]":"The noise goes on 24 hours a day.","example[4]":"The screaming went on and on (=continued for a long time).","definition[2]":"to happen","example[5]":"I don’t know what’s going on.","example[6]":"What were the children doing while all this was going on?","example[7]":"Like all good resorts, there is plenty going on.","signpost[1]":"do something next","definition[3]":"to do something after you have finished doing something else","example[8]":"She went on to become a successful surgeon.","note[1]":"go on to do something","example[9]":"Go on to the next question when you’ve finished.","signpost[2]":"continue talking","definition[4]":"to continue talking, especially after stopping or changing to a different subject","example[10]":"Go on, I’m listening.","example[11]":"‘But, ’ he went on, ‘we have to deal with the problems we’re facing.’","example[12]":"After a short pause Maria went on with her story.","definition[5]":"used to encourage someone to do something","example[13]":"Go on, have another piece of cake.","definition[6]":"used when you are agreeing to do something or giving permission for something","example[14]":"‘Are you sure you won’t have another drink?’ ‘Oh, go on then.’","example[15]":"‘Can I go outside, Dad?’ ‘Yeah, go on then.’","definition[7]":"used to tell someone that you do not believe them","signpost[3]":"use as proof","definition[8]":"to base an opinion or judgment on something","example[16]":"Police haven’t much to go on in their hunt for the killer.","signpost[4]":"start to work","definition[9]":"if a machine or piece of equipment goes on, it starts to work","example[17]":"The heat goes on automatically at 6 o’clock.","definition[10]":"to pass","example[18]":"As time went on, I grew fond of him.","signpost[5]":"behave","definition[11]":"the way someone goes on is the way they behave","example[19]":"The way she’s going on, she’ll have a nervous breakdown.","definition[12]":"to be nearly a particular time, age, number etc","example[20]":"Nancy must be going on for 60.","example[21]":"She’s one of those wise teenagers who’s 16 going on 70 (=she behaves as though she is older than she is).","signpost[6]":"go in front","definition[13]":"to go somewhere before the other people you are with","example[22]":"Bill went on in the car and I followed on foot.","signpost[7]":"talk too much","definition[14]":"to talk too much","example[23]":"I really like Clare but she does go on.","example[24]":"He just went on and on about his new girlfriend.","example[25]":"I got tired of him going on about all his problems.","definition[15]":"to continue to criticize someone or ask them to do something in a way that annoys them","example[26]":"The way she went on, you would have thought it was all my fault.","example[27]":"Stop going on at me!","example[28]":"My wife’s always going on at me to dress better.","note[2]":"go on at somebody to do something","example[29]":"He’s always going on at me about fixing the door.","note[3]":"go on at somebody about something","signpost[8]":"develop","definition[16]":"to develop or make progress","definition[17]":"if you have enough of something to be going on with, you have enough for now","example[30]":"Have you got enough money to be going on with?"}