{"word[0]":"payment","definition[0]":"an amount of money that has been or must be paid","example[0]":"You can make a payment in any bank.","example[1]":"They fell behind on their mortgage payments.","definition[1]":"the act of paying for something","example[2]":"Payment can be made by cheque or credit card.","example[3]":"We do accept payment in instalments (=paying in small amounts over a period of time).","example[4]":"She demanded payment in advance.","example[5]":"There are severe penalties for late payment of taxes.","note[0]":"payment of","example[6]":"Most hotels here accept payment in dollars.","note[1]":"payment in","example[7]":"cheques received in payment for goods supplied","note[2]":"in payment for something","example[8]":"Any item can be reserved on payment of a deposit.","note[3]":"on payment of something","collocation[0]":"make (a) payment","example[9]":"He was supposed to make payments of $250 a month.","collocation[1]":"receive (a) payment","example[10]":"You will receive a cash payment on your 65th birthday.","collocation[2]":"meet/keep up the payments (on something)","example[11]":"He was having trouble meeting the interest payments.","collocation[3]":"fall behind on the payments","example[12]":"I’d run up nearly £4,000 in debt, and was beginning to fall behind with the payments.","form[0]":"ADJECTIVES/NOUN + payment","collocation[4]":"a monthly payment","example[13]":"Home buyers have seen their monthly payments go up by more than 50 percent.","collocation[5]":"a cash payment","example[14]":"He provided pills to athletes in return for cash payments.","collocation[6]":"a down payment","example[15]":"We were able to put a down payment on an apartment.","collocation[7]":"an interest payment","collocation[8]":"a mortgage payment","example[16]":"Your mortgage payments could fall if interest rates drop.","collocation[9]":"an interim payment","example[17]":"It may be reasonable for the builder to ask for interim payments as the work progresses.","collocation[10]":"a bonus payment","example[18]":"The team had made illegal bonus payments to players.","definition[2]":"an amount of money that you pay for something, especially when it is only one part of the total amount you have to pay","example[19]":"They have a monthly car payment of £220.","display[0]":"instalment","definition[3]":"a regular payment you make to pay back money that you have borrowed or to pay for things that you have already received","example[20]":"I borrowed $2,000, which was to be paid back in monthly installments of $250.","display[1]":"deposit","definition[4]":"part of the cost of something that you pay before you get it, so that it will not be sold to anyone else","example[21]":"They used the money they inherited as a down payment on a house.","example[22]":"The hotel asks for a $20 deposit to reserve a room.","display[2]":"subscription","definition[5]":"an amount of money you pay, usually once a year, to receive copies of a newspaper or magazine","example[23]":"A subscription to the magazine is $52 a year.","definition[6]":"a small amount of money that you give someone, for example a waitress or taxi driver, in addition to paying for a service they have given you","example[24]":"I usually leave a 10% tip.","display[3]":"premium","definition[7]":"the amount you pay for insurance each year","example[25]":"your monthly life insurance premiums","definition[8]":"an amount of money that must be or has been paid, or the act of paying it","example[26]":"Some suppliers to the company had tightened credit terms, allowing the company only 30 days to make payments.","example[27]":"$900 million of loans to help the country meet payments (=make them on time) for energy imports","example[28]":"Cash discount is an allowance off a debt given to encourage prompt payment (=payment on time).","example[29]":"I enclose a cheque in payment of my account.","example[30]":"The plan also calls for payment in full to creditors by 31 Dec.","definition[9]":"one of the methods of paying for something, and the act of using one of these methods","example[31]":"Buyers made the first payment by letter of credit instead of cash.","example[32]":"Discounts are given for cash payment.","example[33]":"quarterly payments","example[34]":"direct-debit payments","definition[10]":"amounts of money paid at the different stages of buying something or being paid for something","definition[11]":"a payment that is part of the total payment for something","synonym[0]":"PART-PAYMENT","example[35]":"Nothing at all has been paid. There has been no payment on account.","definition[12]":"a way of paying for something using goods or services rather than money","definition[13]":"payment that is made at the time when goods are delivered, often made to the person delivering them","example[36]":"Sellers prefer payment on delivery, but buyers have a different view.","definition[14]":"payment that is made when a buyer receives an INVOICE (=document giving details of goods ordered, their cost, the time allowed for payment etc)","definition[15]":"payment that is made when a buyer receives a statement saying how much is owed on an account at an agreed later date","definition[16]":"money paid to people for the work they do","definition[17]":"money paid to people who are ill, unemployed etc","definition[18]":"money paid to SHAREHOLDERs, or the repayments of loans, bonds etc to lenders","example[37]":"Brazil hasn’t made payments on its bank debt in recent months.","example[38]":"Creditors have also agreed to reschedule payments (=accept later payment) of senior debt initially due next month.","definition[19]":"money paid to someone to settle a claim, dispute etc","example[39]":"Lawyers say that this move is likely to delay the payment of damages to many victims."}