{"word[0]":"write","past_tense[0]":"wrote","past_participle[0]":"written","signpost[0]":"book/article/poem etc","definition[0]":"to produce a new book, article, poem etc","example[0]":"He wrote some very famous books.","example[1]":"Who wrote ‘Harry Potter’?","example[2]":"I can’t come with you – I have an essay to write.","example[3]":"The article is very well written.","note[0]":"well/badly/poorly etc written","example[4]":"O'Brien often writes about her native Ireland.","note[1]":"write about","definition[1]":"someone who writes earns money by writing books, plays, articles etc","example[5]":"Sean decided he wanted to write, and quit his job.","example[6]":"Maureen Dowd writes for ‘The New York Times’.","note[2]":"write for","definition[2]":"to put words in a letter to someone","example[7]":"I wrote her several letters, but she didn’t reply.","example[8]":"I’ve written to my MP, and to the city council.","note[3]":"write to","example[9]":"Chris hasn’t written me for a long time.","note[4]":"write somebody","heading[0]":"GRAMMAR: Patterns with write","explanation[0]":"You write to someone","example[10]":"She writes to me every month","explanation[1]":"In American English, you can also write someone","example[11]":"She writes me every month","explanation[2]":"You write someone a letter, note, story etc","example[12]":"Please write me a letter soon","bad_example[0]":"Please write to me a letter soon","explanation[3]":"You write to someone about a subject or an experience","example[13]":"He wrote to me about his trip to France","bad_example[1]":"He wrote to me his trip to France","explanation[4]":"Write is often used in the progressive","example[14]":"I am writing to tell you something important","signpost[1]":"form words","definition[3]":"to form letters or numbers with a pen or pencil","example[15]":"Kerry could read and write when she was five.","signpost[2]":"state something","definition[4]":"to state something in a book, letter, advertisement etc, or on a label","example[16]":"Isabella wrote that she was dying, and asked him to visit her for the last time.","note[5]":"write (that)","example[17]":"The price is written on the label.","note[6]":"be written on something","signpost[3]":"music/song","definition[5]":"to write a piece of music or a song","example[18]":"Mozart wrote the music.","example[19]":"The song was originally written by Leonard Cohen.","signpost[4]":"computer program","definition[6]":"to make a program for a computer to use","example[20]":"He writes software programs for financial institutions.","signpost[5]":"a computer records something","definition[7]":"if a computer writes something, it records it on a disk or in its memory","example[21]":"data that had been written to disk","note[7]":"write to/onto","signpost[6]":"cheque/document etc","definition[8]":"to write information on a cheque, form etc","example[22]":"Wouldn’t it be easier if I just wrote a cheque for the lot?","example[23]":"The doctor wrote me a prescription for sleeping pills.","signpost[7]":"pen","definition[9]":"if a pen writes, it works properly","example[24]":"Do any of these pens write?","definition[10]":"to use a pen or pencil to make words, letters etc","example[25]":"Have you written a shopping list?","example[26]":"The children are learning to read and write.","display[0]":"write something down","definition[11]":"to write something on paper, in order to remember it or make a record","example[27]":"He wrote down everything she said.","definition[12]":"to write something in a particular place, or to write particular words","example[28]":"I’ve put the dates of the meetings in my diary.","example[29]":"At the end of the email she put ‘PS I love you’.","display[1]":"put something in writing","definition[13]":"to write something that you have agreed or promised, so that there is an official record","example[30]":"They said they would pay me 50%, but they haven’t actually put it in writing.","display[2]":"make a note of something","definition[14]":"to write information that you might need later","example[31]":"I’ll just make a note of your address.","example[32]":"Make a note in your diary.","display[3]":"take notes","definition[15]":"to write things while someone is speaking or while something is happening, so that you can use them later","example[33]":"His lawyer was with him taking notes.","display[4]":"scrawl","definition[16]":"to write something carelessly and untidily, especially in big letters – often used to show disapproval","example[34]":"Someone had scrawled graffiti on the school wall.","example[35]":"He’d scrawled a few unhelpful comments at the bottom of my work.","display[5]":"fill something in/out","definition[17]":"to write information on a form or other official document","example[36]":"Please fill in the application form in black ink.","example[37]":"Would you mind filling out a questionnaire?","display[6]":"sign","definition[18]":"to write your name at the end of a letter, document etc","example[38]":"Read the contract carefully, and then sign it.","example[39]":"Don’t forget to sign your name.","heading[1]":"to write something quickly","display[7]":"jot something down","definition[19]":"to write something very quickly","example[40]":"Start your essay by jotting down a few ideas.","example[41]":"He checked the meter and jotted something down.","display[8]":"scribble","definition[20]":"to write something quickly and in an untidy way","example[42]":"Andy scribbled a quick note and handed it to the chairman.","example[43]":"I’ve scribbled something here but I can’t read it now.","heading[2]":"to write something on a computer","definition[21]":"to make words or numbers appear on a computer screen by pressing the keys","example[44]":"You have to enter your password twice.","example[45]":"The patients medical records are entered into a database.","display[9]":"key something in/type something in","definition[22]":"to write or record information on a computer, especially something you are copying","example[46]":"I’ve keyed in my credit card details.","example[47]":"To visit our website, just type in our address.","definition[23]":"to write information on a cheque or document","example[48]":"He wrote out a cheque for £4000.","definition[24]":"to sell a particular amount of insurance","example[49]":"We have written £5 million of insurance this month."}