{"word[0]":"proof","signpost[0]":"evidence","definition[0]":"facts, information, documents etc that prove something is true","example[0]":"proof of the existence of life on other planets","note[0]":"proof of","example[1]":"This latest interview was further proof of how good at her job Cara was.","example[2]":"Do you have any proof that this man stole your bag?","note[1]":"proof (that)","example[3]":"There is no proof that the document is authentic.","signpost[1]":"copy","definition[1]":"a copy of a piece of writing or a photograph that is checked carefully before the final printing is done","example[4]":"Can you check these proofs?","definition[2]":"a test in mathematics of whether a calculation is correct","definition[3]":"a list of reasons that shows a theorem (=statement) in geometry to be true","signpost[2]":"alcohol","definition[4]":"a measurement of the strength of some types of alcoholic drink, especially spirits","example[5]":"70% proof vodka  (=that contains 70% pure alcohol) British English","example[6]":"70 proof vodka  (=that contains 35% pure alcohol) American English","collocation[0]":"have proof","example[7]":"The newspaper claimed it had proof that I worked for the CIA.","collocation[1]":"provide/give proof","example[8]":"You will be required to provide proof of your identity.","collocation[2]":"need proof","example[9]":"He needed proof to back up those allegations.","collocation[3]":"there is proof","example[10]":"There is now proof that giant squid do exist.","collocation[4]":"further proof","example[11]":"He showed his driving licence as further proof of his identity.","collocation[5]":"scientific proof","example[12]":"They say they have scientific proof that the treatment works.","collocation[6]":"living proof","example[13]":"She is living proof that stress need not necessarily be ageing.","collocation[7]":"clear proof","example[14]":"His indecision is clear proof of his inability to handle the situation.","collocation[8]":"conclusive/tangible proof","example[15]":"There is no conclusive proof that your son is dead.","collocation[9]":"proof of identity","example[16]":"Do you have any proof of identity, such as a passport?","collocation[10]":"proof of purchase","example[17]":"We will give a refund only if proof of purchase is provided.","collocation[11]":"proof of ownership","example[18]":"Take photos of anything unusual you own as proof of ownership.","collocation[12]":"proof positive","example[19]":"Here is proof positive that she's wrong.","collocation[13]":"the burden/onus of proof","example[20]":"The burden of proof is on the prosecution.","definition[5]":"to treat a material with a substance in order to protect it against water, oil etc","example[21]":"climbing gear proofed against water","note[2]":"be proofed against something","explanation[0]":"Proof is usually passive in this meaning","definition[6]":"to proofread something","example[22]":"Do you want me to proof those documents for you?","definition[7]":"used to describe something which a particular thing cannot harm or pass through, or which protects people against that thing","example[23]":"a bulletproof car","example[24]":"a waterproof jacket","example[25]":"an ovenproof dish  (=that cannot be harmed by heat)","definition[8]":"used to describe something which cannot easily be affected or damaged by someone or something","example[26]":"a childproof container","example[27]":"vandal-proof","type[0]":"in verbs","definition[9]":"to treat or make something so that a particular thing cannot harm it or pass through it, or so that it gives protection against it","example[28]":"soundproof a room  (=so that sound cannot get into or out of it)"}