{"word[0]":"can","signpost[0]":"ability","definition[0]":"to be able to do something or to know how to do something","example[0]":"You can swim, can’t you?","example[1]":"Even a small personal computer can store vast amounts of information.","example[2]":"Gabriella can speak French fluently.","example[3]":"I’m afraid Mr Harding can’t see you now – he’s busy.","example[4]":"The police are doing all they can to find her.","signpost[1]":"requesting","definition[1]":"used to ask someone to do something or give you something","example[5]":"Can I have a drink, please?","example[6]":"Can you help me lift this box?","signpost[2]":"allowed","definition[2]":"to be allowed to do something or to have the right or power to do something","example[7]":"You can’t park here – it’s a no parking zone.","example[8]":"‘Can we go home now?’ ‘No we can’t.’","example[9]":"A police officer can insist on seeing a driver’s license.","definition[3]":"used to say that something is possible","example[10]":"I am confident a solution can be found.","example[11]":"There can be no doubt that he is guilty.","example[12]":"The boxes can be stored flat.","example[13]":"Can he still be alive after all this time?","signpost[3]":"seeing/hearing etc","definition[4]":"used with the verbs ‘see’, ‘hear’, ‘feel’, ‘taste’, and ‘smell’, and with verbs connected with thinking, to mean that someone sees something, hears something etc","example[14]":"Here they are – I can see their car.","example[15]":"Can you smell something burning?","example[16]":"I can’t understand why you’re so upset.","example[17]":"He can’t remember where he put the tickets.","type[0]":"in negatives","signpost[4]":"not true","definition[5]":"used to say that you do not believe that something is true","example[18]":"This can’t be the right road.","example[19]":"It can’t be easy caring for someone else’s children. ","type[1]":"in questions and negatives","signpost[5]":"should not","definition[6]":"used to say that someone should not or must not do something","example[20]":"You can’t expect the world to change overnight.","example[21]":"We can’t go on like this.","example[22]":"Jill’s left her husband, but can you blame her after the way he treated her?","type[2]":"usually in questions and negatives","signpost[6]":"surprise/anger","definition[7]":"used when you are surprised or angry","example[23]":"You can’t be serious!","example[24]":"They can’t have arrived already, surely!","example[25]":"How can you be so stupid!","signpost[7]":"sometimes","definition[8]":"used to say what sometimes happens or how someone sometimes behaves","example[26]":"It can be quite cold here at night.","example[27]":"Peter can be really annoying.","signpost[8]":"giving orders","definition[9]":"used to tell someone in an angry way to do something","example[28]":"And you can stop that quarrelling, the pair of you.","example[29]":"If you won’t keep quiet, you can get out.","heading[0]":"GRAMMAR: Patterns with can","explanation[0]":"Like other modal verbs, you use can before the base form of the main verb  (=the infinitive without ‘to’)","example[30]":"We can hear the birds singing ","example[31]":"You can go home now","example[32]":"Sharks can be dangerous","bad_example[0]":"We can to go home","bad_example[1]":"We can going home","explanation[1]":"The past tense of can is could","example[33]":"We could hear the birds singing","example[34]":"The teacher said we could go home","explanation[2]":"You also use was/were able to when talking about the ability to do something in the past, especially something that was difficult","example[35]":"He was able to walk a few steps","explanation[3]":"In questions you say Can I/he/she etc","example[36]":"Can we go home?","explanation[4]":"In negatives you say can’t (spoken) or cannot (written)","example[37]":"I can’t hear you! ","example[38]":"He cannot leave prison","explanation[5]":"You also use is/are unable to when saying that someone does not have the ability to do something","example[39]":"He is unable to walk","heading[1]":"to be able to do something","display[0]":"can do something","definition[10]":"to have the ability, opportunity, time, or equipment that you need in order to do something. Could is used as the past form, and is also used to say what is or may be possible","example[40]":"‘I don’t think Mike can drive.’ ‘Yes, he can.’","example[41]":"He can run faster than me.","example[42]":"Can you see the TV, or should I move?","example[43]":"This program can translate your e-mail into other languages.","example[44]":"How many hamburgers do you think you can eat?","example[45]":"Adrian could read when he was four.","example[46]":"If we had a boat we could row across to the island.","example[47]":"Why didn’t they ask me? I could have done it for them for half the price.","example[48]":"She could win.","display[1]":"be able to do something","definition[11]":"used when talking about ability or success in the past or ability in the future, or when you need to use an infinitive. It is also used instead of can in more formal English","example[49]":"I was able to get a good job (=I got one).","example[50]":"Will you be able to carry those bags on your own?","example[51]":"If you want to join the expedition, you must be able to speak Spanish.","example[52]":"The young birds are now able to fly.","display[2]":"be capable of something","definition[12]":"to have the ability, energy, or qualities needed to do something, especially something very difficult or unusual – use this about people or machines","example[53]":"She’s perfectly capable  (=completely capable) of dealing with the situation.","example[54]":"The car is capable of a top speed of 200 mph.","example[55]":"No one thought he was capable of murder.","display[3]":"have the ability to do something","definition[13]":"to be able to do something, especially something that is unusual or that most people cannot do","example[56]":"She seemed to have the ability to make people do anything she wanted.","example[57]":"I believe the team definitely has the ability to win the championship.","display[4]":"be in a position to do something","definition[14]":"to be able to do something because you have enough knowledge, power, money, or equipment to do it","example[58]":"We will have to run more tests before we are in a position to say whether the document is authentic or not.","example[59]":"They expect be in a position to begin construction within two years.","display[5]":"manage to do something","definition[15]":"to succeed in doing something difficult, especially after trying very hard","example[60]":"He finally managed to find an apartment near his office.","example[61]":"At least three of the hostages managed to escape.","heading[2]":"to be unable to do something","display[6]":"can’t/cannot do something","definition[16]":"to be unable to do something because you do not have the ability, opportunity, time, or equipment that you need. Couldn’t/could not is used as the past form","example[62]":"Louise can’t see anything without her glasses.","example[63]":"He couldn’t remember where he had left the car.","example[64]":"‘Will you help me move this?’ ‘I’m sorry, I can’t – my back’s still giving me trouble.’","example[65]":"I couldn’t have done it without your help.","example[66]":"I could never have climbed that ridge – I’m too out of shape.","example[67]":"Scientists still cannot explain exactly how the virus reproduces.","example[68]":"Sarah could not understand why anyone would want to hurt her.","display[7]":"not be able to do something","definition[17]":"used when talking about inability in the past or the future, when you need to use an infinitive, and in more formal English","example[69]":"Unfortunately, I wasn’t able to help them.","example[70]":"I don’t think I’ll be able to come to the meeting after all.","example[71]":"The doctor told Tina she wouldn’t be able to have children.","example[72]":"I’ve looked all over the house but I haven’t been able to find my keys anywhere.","display[8]":"be unable to do something","definition[18]":"to not be able to do something, especially something important that you want to do or need to do","example[73]":"He was unable to sleep and lay awake all night.","example[74]":"Many passengers were unable to reach the lifeboats in time.","display[9]":"not be in a position to do something","definition[19]":"to not be able to do something because you do not have enough knowledge, power, money, or equipment to do it","example[75]":"I’m afraid I’m not in a position to answer your questions.","example[76]":"Having committed military force there, America is in no position to repeat this strategy elsewhere.","display[10]":"not be capable of something","definition[20]":"to not have the physical strength or mental ability to do something – often used when criticizing someone","example[77]":"My son seems to be incapable of keeping a job.","example[78]":"She’s not capable of looking after herself anymore.","example[79]":"Her father was a man who was utterly incapable of pity or sympathy.","definition[21]":"a metal container in which food or drink is preserved without air","example[80]":"a Coke can","example[81]":"All we’ve got is a couple of cans of soup.","note[0]":"can of","definition[22]":"a special metal container that keeps the liquid inside it under pressure. The liquid is released as a spray when you press the button","example[82]":"a can of hairspray","definition[23]":"a metal container with a lid that can be removed, used for holding liquid","example[83]":"Two large cans of paint ought to be enough.","definition[24]":"to preserve food by putting it into a metal container from which all the air is removed","definition[25]":"to dismiss someone from a job","synonym[0]":"sack"}