{"word[0]":"all right","definition[0]":"satisfactory, but not excellent","synonym[0]":"okay","example[0]":"‘What’s the food like?’ ‘It’s all right, but the place on campus is better.’","example[1]":"‘How’s school going, Steve?’ ‘Oh, all right, I guess.’","signpost[0]":"no problems","definition[1]":"not ill, hurt, or upset or not having any problems","example[2]":"Kate looks really unhappy – I’d better make sure she’s all right.","example[3]":"Are you feeling all right?","example[4]":"The kids seem to be getting on all right at school.","example[5]":"Tony was worried about the meeting but it went all right (=happened with no problems).","example[6]":"Don’t worry, it’ll turn out all right.","definition[2]":"used to say whether something is suitable or convenient","example[7]":"We’ll eat at eight. Does that sound all right to you?","example[8]":"Is Thursday morning all right with you?","note[0]":"all right with/by/for","signpost[1]":"permission","definition[3]":"used to ask or give permission for something","example[9]":"Would it be all right if I left early?","example[10]":"Is it all right to bring my dog?","note[1]":"be all right to do something","definition[4]":"used to agree with someone’s suggestion, although you may be slightly unwilling","example[11]":"‘Why not come along?’ ‘Oh, all right.’","signpost[2]":"understanding","definition[5]":"used to check that someone understands what you have said, or to show that you understand","example[12]":"I’ll leave a key with the neighbours, all right?","example[13]":"‘The train leaves at 5.30.’ ‘All right, I’m coming!’","signpost[3]":"threaten","definition[6]":"used when asking in a threatening or angry way what someone’s intentions are","example[14]":"All right, you two. What are you doing in my room?","signpost[4]":"change/end subject","definition[7]":"used to introduce a new subject or to end a conversation","example[15]":"All right, now I’d like to introduce our first speaker.","signpost[5]":"emphasize","definition[8]":"used to emphasize that you are certain about something","example[16]":"‘Are you sure it was Bill?’ ‘Oh, yes, it was him all right.’","signpost[6]":"happy","definition[9]":"used to say you are happy about something you have just been told","example[17]":"You passed? All right!","signpost[7]":"like","definition[10]":"used to describe someone you like or approve of","example[18]":"‘The new boss isn’t too bad, is she?’ ‘No, she’s all right.’","signpost[8]":"greeting","definition[11]":"used as a greeting when you meet someone you know well, or reply to a greeting","example[19]":"‘How are you, John?’ ‘Oh, all right – can’t complain.’"}