{"word[0]":"gap","signpost[0]":"a space","definition[0]":"a space between two objects or two parts of an object, especially because something is missing","example[0]":"The neighbors’ dog got in through a gap in the hedge.","note[0]":"gap in","example[1]":"a gap in the traffic","example[2]":"the gap between the two rows of seats","note[1]":"gap between","signpost[1]":"difference","definition[1]":"a big difference between two situations, amounts, groups of people etc","example[3]":"the widening gap between the rich and the poor","signpost[2]":"something missing","definition[2]":"something missing that stops something else from being good or complete","example[4]":"He filled the gap left by Hirst’s retirement.","note[2]":"fill/plug the gap","example[5]":"There are huge gaps in my knowledge of history.","example[6]":"Frank’s death has left a big gap in my life.","signpost[3]":"in time","definition[3]":"a period of time when nothing is happening, that exists between two other periods of time when something is happening","example[7]":"an awkward gap in the conversation","example[8]":"The gaps between his visits got longer and longer.","signpost[4]":"in a mountain","definition[4]":"a low place between two higher parts of a mountain","heading[0]":"– Meaning 2: a big difference between two situations, amounts, groups of people etc","form[0]":"ADJECTIVES/NOUN + gap","collocation[0]":"a big/large/wide gap","example[9]":"There’s a big gap between the two test scores.","collocation[1]":"a huge/substantial etc gap","example[10]":"A huge gap exists between the life styles of the rich and the poor.","collocation[2]":"a narrow gap","example[11]":"There’s only a narrow gap between the two candidates in the polls.","collocation[3]":"a yawning gap","example[12]":"There’s a yawning gap between the earnings of men and women.","collocation[4]":"a growing/widening gap","example[13]":"There is a widening gap in the academic performance of boys and girls.","collocation[5]":"an unbridgeable gap","example[14]":"He felt that there was an unbridgeable gap between the negotiating positions of the two sides.","collocation[6]":"a trade gap","example[15]":"Britain’s trade gap almost doubled last month.","collocation[7]":"the gender gap","example[16]":"The gender gap was visible in the way men and women voted during the presidential elections.","collocation[8]":"the generation gap","example[17]":"Taste in music is a good indicator of the generation gap.","collocation[9]":"an age gap","example[18]":"Despite the age gap, they became good friends.","collocation[10]":"a cultural gap","example[19]":"There is a cultural gap between Europe and America on this subject.","collocation[11]":"bridge/close/narrow the gap","example[20]":"The book aims to bridge the gap between theory and practice.","example[21]":"The policies are designed to close the gap between rich and poor.","collocation[12]":"the gap narrows","example[22]":"Polls show the gap between the two candidates has narrowed.","collocation[13]":"widen the gap","example[23]":"Technology has widened the gap between people with and without computer skills.","collocation[14]":"the gap widens","example[24]":"The gap is widening between the incomes of the rich and the less well-off.","collocation[15]":"a gap exists","example[25]":"A cultural gap exists between the older and the younger generations.","definition[5]":"a US clothes company with stores all over the world. The Gap sells informal clothes for men, women, and children, which are fashionable but not very expensive.","definition[6]":"an opportunity to develop and sell a particular product or service because no other company is doing this yet","example[26]":"The sales director believes there is a gap in the market for small jets.","example[27]":"The mail-order company is aiming to fill the gap in the market with a range of swimwear for older people.","definition[7]":"a difference between two situations, amounts, groups of people etc","example[28]":"Brazil had a trade gap (=difference in value of what a country buys from abroad and what it sells) of $3.16 billion last year.","example[29]":"the gap between the earnings of manual and non-manual workers","definition[8]":"something that is missing that stops something else from being complete","example[30]":"The computer manufacturer is trying to fill a gap in its product line by buying an Atlanta software firm for $65 million."}