{"word[0]":"file","definition[0]":"a set of papers, records etc that contain information about a particular person or subject","example[0]":"The FBI keeps files on former White House employees.","example[1]":"We will keep your details on file (=store them for later use).","example[2]":"a copy of the court file","note[0]":"police/case/medical etc file","example[3]":"Mendoza read over the file on the murders.","note[1]":"file on","definition[1]":"a box or piece of folded card in which you store loose papers","example[4]":"She pulled a blue file from the shelf.","definition[2]":"information on a computer that you store under a particular name","example[5]":"a list of all the files and folders on your hard disk","definition[3]":"a metal tool with a rough surface that you rub on something to make it smooth","definition[4]":"a line of people who are standing or walking one behind the other","example[6]":"a file of soldiers marching in step","note[2]":"file of","example[7]":"It was dark as we set off in file.","note[3]":"in file","heading[0]":"– Meaning 3: information on a computer that you store under a particular name","collocation[0]":"open a file","example[8]":"Click on the icon to open the file.","collocation[1]":"close a file","example[9]":"You may need to close the file and restart the computer.","collocation[2]":"save a file","example[10]":"Save the file under a different filename.","collocation[3]":"create a file","example[11]":"I created a file of useful contacts.","collocation[4]":"delete a file","example[12]":"I accidentally deleted the wrong file.","collocation[5]":"access a file","example[13]":"You won’t be able to access the file if another user has opened it.","collocation[6]":"edit a file","example[14]":"I edited the file and saved it to the hard disk.","collocation[7]":"copy a file","example[15]":"To copy a file, save it using a new filename.","collocation[8]":"move a file","example[16]":"He was trying to move  the file from one folder to another.","collocation[9]":"transfer a file","example[17]":"You can transfer files and share your stuff with friends.","collocation[10]":"download a file","example[18]":"It just takes a few seconds to download the file.","collocation[11]":"upload a file","example[19]":"Restart the web browser, and then upload the file.","collocation[12]":"load a file","example[20]":"Double-click on the icon and it will load the zip file onto your computer.","collocation[13]":"send somebody a file","example[21]":"Do you want me to send you the file?","collocation[14]":"attach a file","example[22]":"Sorry, I forgot to attach the file.","collocation[15]":"compress a file","example[23]":"The program allows you to compress files.","form[0]":"NOUN + file","collocation[16]":"a computer file","example[24]":"Delete some of the old computer files and create some space on the hard drive.","collocation[17]":"a backup file","example[25]":"You can burn your backup file to CD or DVD.","collocation[18]":"a text file","example[26]":"The text file contains hints on how to get the best out of the program.","collocation[19]":"a data file","example[27]":"The bigger the data file, the more time is needed to search it.","collocation[20]":"a graphics file","example[28]":"This handy utility allows you to change graphics files from one format to another.","definition[5]":"to keep papers, documents etc in a particular place so that you can find them easily","example[29]":"The contracts are filed alphabetically.","example[30]":"I looked to see if anything was filed under my name.","note[4]":"file something under something","example[31]":"The handbooks are filed away for future reference.","note[5]":"file something away","definition[6]":"to give or send an official report or news story to your employer","example[32]":"The officer left the scene without filing a report.","definition[7]":"to give a document to a court or other organization so that it can be officially recorded and dealt with","example[33]":"Mr Genoa filed a formal complaint against the department.","note[6]":"file a complaint/lawsuit/petition etc (against somebody)","example[34]":"The Morrisons have filed for divorce.","note[7]":"file for","example[35]":"Today is the deadline for Americans to file their tax returns.","definition[8]":"if people file somewhere, they walk there in a line","example[36]":"We began to file out into the car park.","example[37]":"The mourners filed past the coffin.","definition[9]":"to use a metal or wooden tool to rub something in order to make it smooth","example[38]":"File down the sharp edges.","example[39]":"She sat filing her nails.","definition[10]":"information about a person or subject that is kept by a company or other organization","example[40]":"I see from my files that we still have not received payment from you.","example[41]":"A credit reference agency is a company which keeps files on individuals’ debt records.","definition[11]":"if information is kept on file, it is kept so it can be used when it is needed","example[42]":"We will keep your application on file.","definition[12]":"a box or a cover made of heavy paper or plastic, used to store papers, letters, or documents","example[43]":"Copies of every letter are kept in a file to record what was agreed.","definition[13]":"a collection of information on a computer that is stored under a particular name","example[44]":"Be careful not to delete (=remove) any important  files.","example[45]":"You might want to rename the file at a later date.","example[46]":"Save a copy of the file to disk and send it to me.","definition[14]":"to keep or put papers with information on them in a particular place, so that you can find them easily","example[47]":"The reservation form and confirmation slip are then filed alphabetically.","definition[15]":"to officially send your accounts to the authorities","example[48]":"You could be prosecuted for failing to file your accounts before February 28.","definition[16]":"to officially record a complaint, law case, official document etc","example[49]":"Chevron filed a lawsuit to remove Pennzoil as a shareholder.","example[50]":"America’s federal bankruptcy code was rewritten in order to make it easier tofile for bankruptcy (=inform the authorities that a business is bankrupt)."}