{"word[0]":"moral","definition[0]":"relating to the principles of what is right and wrong behaviour, and with the difference between good and evil","example[0]":"It is easy to have an opinion on a moral issue like the death penalty for murder.","example[1]":"moral philosophy","example[2]":"If we accept that certain babies should be allowed to die, we place doctors in a moral dilemma.","example[3]":"Man is gifted with a moral sense by which he distinguishes good from evil.","example[4]":"I think you can run a business to the highest moral standards.","note[0]":"moral standards/values/principles","definition[1]":"based on your ideas about what is right, rather than on what is legal or practical","example[5]":"The book places a high moral value on marriage and the family unit.","example[6]":"The UN feels that it has the moral authority (=influence because people accept that its beliefs are right) to send troops to the area.","example[7]":"It isn’t just lack of moral fibre (=lack of the emotional strength to do what you believe is right) which leads to a rising divorce rate.","example[8]":"A man has a moral duty to obey the law.","note[1]":"moral duty/obligation/responsibility","definition[2]":"always behaving in a way that is based on strong principles about what is right and wrong","opposite[0]":"immoral","example[9]":"a moral man of high integrity","form[0]":"moral + NOUN","collocation[0]":"a moral standard/principle","example[10]":"Has there been a decline in moral standards in our society?","collocation[1]":"a moral value","example[11]":"Schools teach moral values both by example and in lessons.","collocation[2]":"a moral duty/obligation","example[12]":"If you have a pet, you have a moral obligation to take care of it.","collocation[3]":"a moral judgment","example[13]":"We shouldn't make moral judgements about the way other people live their lives.","collocation[4]":"a moral imperative","example[14]":"He felt that rescuing the hostages was a moral imperative.","collocation[5]":"a moral code","example[15]":"His own moral code is based on his religious beliefs.","collocation[6]":"somebody’s moral authority","example[16]":"Corruption in government destroys its moral authority.","collocation[7]":"moral fibre","example[17]":"Single parents are sometimes treated as though they lack moral fibre.","collocation[8]":"a moral issue","example[18]":"a debate on the moral issues surrounding the use of animals in medical research","collocation[9]":"a moral dilemma","example[19]":"Doctors face a moral dilemma when a patient can be kept alive but has no chance of real recovery.","collocation[10]":"somebody’s moral sense","example[20]":"Children’s moral sense develops over a number of years.","collocation[11]":"moral superiority","example[21]":"He connects high social class with moral superiority.","example[22]":"a class in moral philosophy","collocation[12]":"the moral order","example[23]":"Hitler posed the greatest threat to the moral order of the world that history has ever seen.","definition[3]":"a practical lesson about what to do or how to behave, which you learn from a story or from something that happens to you","example[24]":"The moral of the film was that crime does not pay.","note[2]":"moral of","display[0]":"morals","definition[4]":"all of the basic ideas that a person or group of people has about what is morally good and right","example[25]":"The man has no morals at all.","example[26]":"He felt that society's morals were declining, as shown by increases in public drunkenness and violence.","display[1]":"morality","definition[5]":"ideas about what is right and wrong, and what is acceptable behaviour – used when talking about whether it is right to do a particular thing, or when talking about moral standards generally","example[27]":"Several advisers had very different views on the morality of the action  (=on whether it was morally right).","example[28]":"They wanted to ban the film, on the grounds of protecting public morality.","display[2]":"ethics","definition[6]":"moral rules for deciding what is right and wrong – often used about this as a subject that people study and discuss","example[29]":"Doctors must follow a strict code of ethics.","example[30]":"I'm not sure about the ethics of using human embryos for research  (=I'm not sure that it is morally right).","display[3]":"principles","definition[7]":"moral rules or beliefs about what is right and wrong, which make you decide what you should and should not do","example[31]":"He stuck to his principles and spoke out against injustice, despite the risks.","example[32]":"It's against their principles to kill any living thing.","display[4]":"values","definition[8]":"your ideas about what is important in life","example[33]":"During the 1960s, many young people rejected their parents' values.","example[34]":"He stressed the importance of spiritual values.","display[5]":"scruples","definition[9]":"beliefs about what is right and wrong that prevent you from doing bad things","example[35]":"She had no scruples about listening to their private conversation.","example[36]":"My scruples would not allow me to interfere in their relationship."}