{"word[0]":"surrender","definition[0]":"to say officially that you want to stop fighting, because you realize that you cannot win","example[0]":"Germany surrendered on May 7th, 1945.","example[1]":"The terrorists were given ten minutes to surrender.","definition[1]":"to go to the police or the authorities, and say that you want to stop trying to escape from them","example[2]":"He immediately surrendered himself to the authorities.","note[0]":"surrender (yourself) to somebody","definition[2]":"to give up something or someone, especially because you are forced to","example[3]":"They agreed to surrender their weapons.","example[4]":"She was reluctant to surrender her independence.","example[5]":"Marchers who had cameras were forced to surrender their film.","definition[3]":"to give something such as a ticket or a passport to an official","example[6]":"Steir voluntarily surrendered his license to the State.","note[1]":"surrender something to somebody","definition[4]":"to say officially that you want to stop fighting, especially in a war, because you realize that you cannot win – used about people and countries","example[7]":"Two days later, the rebels surrendered.","example[8]":"Japan surrendered in August 1945.","display[0]":"give in","definition[5]":"to accept that you cannot win a game, argument, fight etc and stop trying to win it","example[9]":"The players refused to give in and eventually won the game 4-3 in extra time.","example[10]":"The negotiations went on for days and neither side was prepared to give in.","display[1]":"admit/accept defeat","definition[6]":"to accept that you have not won something","example[11]":"In July 1905, Russia admitted defeat in its war with Japan.","example[12]":"She wanted to run for the Presidency and refused to accept defeat.","display[2]":"concede","definition[7]":"to say that you are not going to win a game, argument, election etc, so that it officially ends","example[13]":"He was forced to concede the match.","example[14]":"Davis conceded defeat in the election.","definition[8]":"when you say officially that you want to stop fighting because you realize that you cannot win","example[15]":"the humiliation of unconditional surrender  (=accepting total defeat)","example[16]":"the Nazis’ surrender to the Allied forces","note[2]":"surrender to somebody/something","definition[9]":"when you give away something or someone, usually because you are forced to","example[17]":"the surrender of all illegal weapons","example[18]":"a surrender of power","note[3]":"surrender of","definition[10]":"when you allow yourself to be controlled or influenced by something","example[19]":"total surrender to drug addiction","definition[11]":"if you surrender an insurance policy, you stop it before it MATUREs (=becomes due for payment) and receive only a part of what it would have been worth if you had kept it","example[20]":"Many policyholders had held theirannuities for years because of heavy penalties forsurrendering them.","example[21]":"The firm paid out $1.33 billion in the first quarter to customerssurrendering insurance policies.","definition[12]":"if someone surrenders their power, influence, high position etc, they allow someone else to have it","example[22]":"Eight months after taking over the running of the business, shesurrendered thatauthority to a man who had only just joined.","example[23]":"He plans tosurrender his majorityownership of the company.","definition[13]":"if shares etc surrender their value, price etc, the value, price etc falls","example[24]":"Aftersurrendering 39% of itsvalue in the early 1990s, the Nikkei average has moved steadily upwards.","definition[14]":"to give something to an official authority when it is asked for","example[25]":"Under the Bankruptcy Code, debtors must surrender most of theirassets.","example[26]":"The seven men have been granted bail on condition that their passports be surrendered.","definition[15]":"the act of stopping an insurance policy before it MATUREs (=becomes due for payment)","example[27]":"Last year’s losses follow a flood ofpolicy surrenders.","example[28]":"Any profit arising on surrender or maturity will be taken into account."}