{"word[0]":"prime","definition[0]":"most important","synonym[0]":"main","example[0]":"Smoking is the prime cause of lung disease.","example[1]":"Our prime concern is providing jobs for all young school leavers.","example[2]":"He was named as the prime suspect in the murder investigation.","example[3]":"Good management is of prime importance in business.","definition[1]":"of the very best quality or kind","example[4]":"prime rib of beef","example[5]":"prime agricultural land","example[6]":"The hotel is in a prime location overlooking the valley.","definition[2]":"the time in your life when you are strongest and most active","example[7]":"He is now past his prime.","example[8]":"a man in the prime of life","example[9]":"a young singer who was tragically cut off in her prime (=died while she was in her prime)","example[10]":"She’s now 40 and still in her prime.","note[0]":"in your prime","signpost[0]":"prepare somebody","definition[3]":"to prepare someone for a situation so that they know what to do","example[11]":"Did you prime her with what to say?","note[1]":"prime somebody with something","example[12]":"He had a shower and primed himself for action.","note[2]":"prime somebody for something","example[13]":"He had been primed to say nothing about it.","note[3]":"prime somebody to do something","signpost[1]":"a gun","definition[4]":"to prepare a gun or bomb so that it can fire or explode","signpost[2]":"paint","definition[5]":"to put a special layer of paint on a surface, in order to prepare it for the next layer","example[14]":"All metal surfaces will have to be primed.","definition[6]":"to pour water into a water pump in order to make it ready to work","definition[7]":"of the best quality","example[15]":"acres of prime real estate right by an international airport","definition[8]":"main or most important","example[16]":"The developer’s prime objective is to build houses at maximum profit, with minimum care for the environment.","example[17]":"their prime concern was for the safety of the international financial system.","example[18]":"Martin Marietta Corp., the prime contractor in the rocket-engine development program","definition[9]":"to make the economy grow faster by increasing government spending, hoping that this will encourage business to invest more","example[19]":"Direct investments in job creation are essential to prime the pump and get the economy up and running again.","definition[10]":"used to talk about how much higher an interest rate is than the PRIME RATE (=the interest rate charged by banks to their best borrowers)","example[20]":"The working-capital loan carried an interest rate of 3½ points above prime."}