{"word[0]":"impact","definition[0]":"the effect or influence that an event, situation etc has on someone or something","example[0]":"Higher mortgage rates have already had a major impact on spending. ","note[0]":"major/significant/profound etc impact","example[1]":"We need to assess the impact on climate change.","note[1]":"impact on/upon","example[2]":"an international meeting to consider the environmental impacts of global warming","note[2]":"impact of","definition[1]":"the force of one object hitting another","example[3]":"The force of the impact knocked the breath out of her.","collocation[0]":"big/great","example[4]":"Winning this competition could have a big impact on my life.","example[5]":"His impact was greater than that of the Beatles.","collocation[1]":"huge/enormous/massive","example[6]":"Industry has a huge impact on the environment we live in.","example[7]":"The impact has been enormous on people’s daily lives.","example[8]":"New technologies have only had a small impact on the overall level of employment.","collocation[2]":"minimal/negligible","example[9]":"The change in government had a minimal impact in the rural areas of the country.","example[10]":"Cuts in federal spending should have a positive impact on America’s economic future.","collocation[3]":"negative/damaging","example[11]":"The expansion of the airport would have a negative impact on the environment.","collocation[4]":"disastrous","example[12]":"His leg injury had a disastrous impact on his career as a footballer.","collocation[5]":"a major/significant impact","example[13]":"The war had a major impact on French domestic politics.","collocation[6]":"a profound impact","example[14]":"Population growth has a profound impact on world food demand.","collocation[7]":"an adverse impact","example[15]":"The loss of forests has had an adverse impact on bird populations.","collocation[8]":"a real impact","example[16]":"The film made a real impact on cinema audiences.","collocation[9]":"a lasting impact","example[17]":"The arrival of the railways made a lasting impact on many sectors of the economy.","collocation[10]":"a long-term impact","example[18]":"Scientists are calculating the long-term impact of the floods.","collocation[11]":"a short-term/immediate impact","example[19]":"A military attack may only have a short-term impact on terrorist activity.","collocation[12]":"an emotional/psychological impact","example[20]":"Their mother’s death had a huge emotional impact on the children.","collocation[13]":"an economic impact","example[21]":"It is difficult to measure the economic impact of the war.","collocation[14]":"an environmental impact","example[22]":"The environmental impact of the construction project is being investigated.","collocation[15]":"the full impact of something","example[23]":"South Wales felt the full impact of the recession.","collocation[16]":"the potential/likely impact","example[24]":"He’s studying the potential impact of climate change.","collocation[17]":"have an impact","example[25]":"New technology has had a massive impact on our lives.","collocation[18]":"make an impact","example[26]":"The product quickly made an impact on the market.","collocation[19]":"feel the impact of something","example[27]":"The industry has felt the impact of rising fuel prices.","collocation[20]":"reduce/lessen/soften the impact of something","example[28]":"The chemical industry is looking at ways to reduce its impact on the environment.","collocation[21]":"lose impact","example[29]":"The picture loses impact when it is reduced in size.","definition[2]":"to have an important or noticeable effect on someone or something","example[30]":"The Food Safety Act will progressively impact on the way food businesses operate.","example[31]":"High interest rates have a negative impact on spending.","note[3]":"impact on","example[32]":"The new advertising campaign has had little impact on sales.","example[33]":"The recession has impacted the domestic business market.","example[34]":"How will this program impact on the local community?"}