{"word[0]":"Sweep","past_tense[0]":"swept","signpost[0]":"clean something","definition[0]":"to clean the dust, dirt etc from the floor or ground, using a brush with a long handle","synonym[0]":"brush","example[0]":"Bert swept the path in front of the house.","example[1]":"Will you sweep the leaves off the patio?","note[0]":"sweep something off/out/up etc","signpost[1]":"push something somewhere","definition[1]":"to move things from a surface with a brushing movement","example[2]":"I swept the papers quickly into the drawer.","signpost[2]":"push somebody/something with force","definition[2]":"to force someone or something to move in a particular direction","example[3]":"The windsurfer was swept out to sea.","example[4]":"Jessie was swept along by the angry crowd.","signpost[3]":"group moves","definition[3]":"if a group of people or animals sweep somewhere, they quickly move there together","example[5]":"The crowd swept through the gates of the stadium.","note[1]":"sweep through/along etc","signpost[4]":"wind/waves etc","definition[4]":"if winds, waves, fire etc sweep a place or sweep through, across etc a place, they move quickly and with a lot of force","example[6]":"Thunderstorms swept the country.","example[7]":"Ninety-mile per hour winds swept across the plains.","note[2]":"sweep across/through etc","signpost[5]":"become popular","definition[5]":"if an idea, feeling, or activity sweeps a group of people or a place, it quickly becomes very popular or common","example[8]":"a wave of nationalism sweeping the country","note[3]":"sweep the country/nation/state etc","example[9]":"the latest craze sweeping through the teenage population","definition[6]":"if a feeling sweeps over you, you are suddenly affected by it","example[10]":"A feeling of isolation swept over me.","note[4]":"sweep over","definition[7]":"if someone sweeps somewhere, they move quickly and confidently, especially because they are impatient or like to seem important","example[11]":"Eva swept into the meeting and demanded to know what was going on.","note[5]":"sweep into/through etc","definition[8]":"to win an election easily and in an impressive way","example[12]":"Herrera was swept into office on the promise of major reforms.","example[13]":"Nixon and Agnew swept to victory with 47 million votes.","note[6]":"sweep to power/victory","definition[9]":"to win all of the games in a series of games against a particular team","example[14]":"Houston swept Orlando to become NBA champions.","signpost[6]":"form a curve","definition[10]":"to form a long curved shape","example[15]":"The hills swept down to the sea.","note[7]":"sweep down/along etc","definition[11]":"to look quickly at all of something","example[16]":"The general’s eyes swept the horizon.","example[17]":"the beam from the lighthouse sweeping across the sea","note[8]":"sweep over/across/around etc","definition[12]":"to pull your hair back from your face","example[18]":"Kerry swept her hair back into a ponytail.","note[9]":"sweep something back/up","definition[13]":"a long swinging movement of your arm, a weapon etc","example[19]":"With a single sweep of his sword, he cut through the rope.","definition[14]":"the act of cleaning a room with a long-handled brush","example[20]":"The kitchen needs a good sweep.","definition[15]":"a search or attack that moves over a large area","example[21]":"He watched the helicopter make a sweep over the beach.","definition[16]":"a series of several games that one team wins against another team","definition[17]":"a chimney sweep"}