{"word[0]":"ticket","signpost[0]":"cinema/bus/train etc","definition[0]":"a printed piece of paper which shows that you have paid to enter a cinema, travel on a bus, plane etc","example[0]":"How much are tickets for the concert?","note[0]":"ticket for","example[1]":"I’d like two tickets to Berlin.","note[1]":"ticket to","example[2]":"a ticket to watch the US Open","note[2]":"a ticket to do something","signpost[1]":"for a prize","definition[1]":"a printed piece of paper with a number on it that you buy because you will get a prize if that number is chosen","note[3]":"raffle/lottery ticket","signpost[2]":"driving offence","definition[2]":"a printed note ordering you to pay money because you have done something illegal while driving or parking your car","note[4]":"parking/speeding ticket","signpost[3]":"in shops","definition[3]":"a piece of paper fastened to something in a shop that shows its price, size etc","example[3]":"How much does it say on the price ticket?","signpost[4]":"election","definition[4]":"a list of the people supported by a particular political party in an election","example[4]":"He ran for governor on the Republican ticket.","form[0]":"ADJECTIVES/NOUN + ticket","collocation[0]":"a train/bus/coach ticket","example[5]":"I’ve lost my train ticket.","collocation[1]":"an airline/plane/air ticket","example[6]":"You can pick up your airline tickets at the check-in desk.","collocation[2]":"a theatre/concert ticket","example[7]":"The special rate includes theatre tickets and transport from the hotel to the theatre.","collocation[3]":"a one-way ticket","example[8]":"I bought a one-way ticket to London.","collocation[4]":"a return ticket","example[9]":"How much is a round trip ticket to Boston?","collocation[5]":"a season ticket","example[10]":"He has a season ticket for Manchester United.","collocation[6]":"a valid ticket","example[11]":"You cannot travel without a valid ticket.","collocation[7]":"book/reserve a ticket","example[12]":"We booked our tickets well in advance.","collocation[8]":"buy a ticket","example[13]":"Sheila bought a ticket for the next flight home.","form[1]":"ticket + NOUN","collocation[9]":"a ticket office/booth/counter","example[14]":"There was a long queue at the ticket office.","collocation[10]":"a ticket machine","example[15]":"The ticket machine wasn’t issuing tickets.","collocation[11]":"the ticket barrier","example[16]":"John insisted on carrying my case as far as the ticket barrier.","collocation[12]":"a ticket agency","example[17]":"Book your tickets online from one of the many ticket agencies.","heading[0]":"types of travel tickets","display[0]":"single (ticket)/one-way ticket","definition[5]":"a ticket that lets you go to a place but not back again","example[18]":"A single to Edinburgh, please.","example[19]":"He bought a one-way ticket to Los Angeles.","display[1]":"return (ticket)","definition[6]":"a ticket that lets you go to a place and back again","example[20]":"A return to London, please.","display[2]":"season ticket","definition[7]":"a ticket that lets you make the same journey every day for a fixed period of time","example[21]":"My company pays for my season ticket.","display[3]":"e-ticket","definition[8]":"a ticket that you buy over the Internet, in which you are given a number which you use when you check in at an airport","example[22]":"All you have to do is print off the e-ticket and show it at the check-in desk.","definition[9]":"to produce and sell tickets for an event, journey etc","example[23]":"air travel sold and ticketed in the UK","example[24]":"ticketed events such as concerts","definition[10]":"to give someone a ticket for parking their car in the wrong place, driving too fast etc","example[25]":"Drivers stopping here will be ticketed and have their cars towed.","definition[11]":"a printed piece of paper which shows that you have paid to travel on a bus or plane, enter a cinema, go to a sports game etc","example[26]":"The price includes theatre tickets and taxis.","example[27]":"The airline is offering frequent fliers a free ticket to Europe.","example[28]":"He bought a ticket for the show.","example[29]":"United Airlines has nearly 14,000 ticket agents."}