{"signpost[0]":"earth","definition[0]":"the surface of the Earth","example[0]":"A raised platform stood two metres off the ground.","example[1]":"The air raids were followed by military action on the ground (=on land).","example[2]":"ground troops (=soldiers who fight on land)","example[3]":"The leaves were slowly fluttering to the ground.","note[0]":"the ground","example[4]":"He lay on the ground and stared up at the sky.","example[5]":"The ground was frozen solid.","example[6]":"At night, badgers feed above ground.","note[1]":"above/below/under ground","example[7]":"These youngsters work 70 metres below ground level.","definition[1]":"the soil on and under the surface of the Earth","example[8]":"Dig the ground over in the autumn.","example[9]":"Plant the seeds 2 cm deep in the ground.","example[10]":"The ground was dry, far too dry for growing corn.","signpost[1]":"area of land","definition[2]":"an area of land without buildings, fences, woods etc","example[11]":"The landscape is a mixture of open ground and woodland.","example[12]":"They were standing on the waste ground (=land in a town that is not being used) behind the car park.","definition[3]":"an area of land or sea that is used for a particular purpose","example[13]":"fishing grounds","example[14]":"These fields served as a hunting ground for the local people.","note[2]":"parade/hunting/burial etc ground","example[15]":"The rivers are used as dumping grounds for industrial waste.","example[16]":"He is buried in sacred ground.","definition[4]":"the land or gardens surrounding a large building","example[17]":"We decided to take a stroll in the hotel grounds.","signpost[2]":"subject","definition[5]":"a subject or area of knowledge","example[18]":"At meetings, we just keep going over the same ground (=talking about the same things).","example[19]":"His latest movie looks set to break new ground (=introduce new and exciting ideas).","example[20]":"In his latest book, McManus returns to more familiar ground.","note[3]":"familiar/home ground","definition[6]":"a general opinion or set of attitudes","example[21]":"Often parents and teenagers find they have little common ground (=they do not share the same attitudes etc).","example[22]":"Both parties are battling to occupy the centre ground.","note[4]":"the middle/centre ground","example[23]":"Careful, Laura. You could be treading on dangerous ground (=expressing opinions etc that might offend someone).","example[24]":"Each side was unwilling to give ground (=change their opinion).","definition[7]":"the place where a particular sport is played","example[25]":"a new football ground","example[26]":"It’s their first defeat at their home ground (=the ground that belongs to a particular team) all season.","signpost[3]":"electrical","definition[8]":"a wire that connects a piece of electrical equipment to the ground for safety","signpost[4]":"background","definition[9]":"the colour used as the background for a design","definition[10]":"the surface of the Earth, or the soil on its surface","example[27]":"He collapsed and fell to the ground.","example[28]":"The ground was wet and muddy.","display[0]":"the ocean/forest/cave etc floor","definition[11]":"the ground at the bottom of the ocean, a forest, a cave etc","example[29]":"Many wonderful creatures live on the ocean floor.","definition[12]":"used when talking about an area of ground that is owned by someone, or is used for an activity. Also used when talking about the part of the Earth’s surface that is not covered with water","example[30]":"His family owns a lot of land.","example[31]":"agricultural land","example[32]":"She got off the ferry, happy to be back on dry land.","display[1]":"terrain","definition[13]":"a type of land – used when talking about how easy an area of land is to cross, and whether it is rocky, flat etc","example[33]":"The Land Rover is built to go over rough terrain.","example[34]":"The terrain gets flatter when you go further south.","display[2]":"earth/soil","definition[14]":"the substance that plants grow in","example[35]":"The vegetables were still covered in black soil.","display[3]":"mud","definition[15]":"wet earth","example[36]":"Your shoes are covered in mud.","definition[16]":"to stop an aircraft or pilot from flying","example[37]":"All planes are grounded until the fog clears.","explanation[0]":"Ground is usually passive in this meaning","signpost[5]":"boat","definition[17]":"if you ground a boat or if it grounds, it hits the bottom of the sea so that it cannot move","example[38]":"Both boats grounded on a mud bank.","signpost[6]":"child","definition[18]":"to stop a child going out with their friends as a punishment for behaving badly","example[39]":"I got home at 2 am and Dad grounded me on the spot.","definition[19]":"to make a piece of electrical equipment safe by connecting it to the ground with a wire","definition[20]":"ground coffee or nuts have been broken up into powder or very small pieces, using a special machine","definition[21]":"the past tense and past participle of grind1","definition[22]":"a reason, often a legal or official one, for doing or believing something","example[40]":"There are grounds for optimism that the slump in the housing market may end.","note[5]":"ground for","example[41]":"Are there grounds for dismissing him?","example[42]":"The factory was closed on health and safety grounds.","definition[23]":"to get an advantage or to rise in price","example[43]":"The dollar gained ground against sterling.","definition[24]":"to lose an advantage or to fall in price","example[44]":"Prices were lower across the board, with nearly all blue-chip stocks losing ground.","definition[25]":"if a plan, business idea etc gets off the ground, it gets started or it starts to be successful","example[45]":"This fund is intended to help new projects get off the ground.","definition[26]":"to do something completely new that no one has ever done before or discover something new about a subject","example[46]":"Our scientists are breaking new ground in AIDS research.","definition[27]":"to be based on a particular idea, principle etc","example[47]":"His fiscal strategy is firmly grounded in Keynesian economics."}