{"word[0]":"period","signpost[0]":"length of time","definition[0]":"a particular length of time with a beginning and an end","example[0]":"Tomorrow’s weather will be dry with sunny periods.","example[1]":"The drug was tested over a five-week period.","example[2]":"They adopted the system for a trial period (=time in which something is tested to see if it works well).","example[3]":"His playing improved in a very short period of time.","note[0]":"period of","example[4]":"a brief period of silence","signpost[1]":"life/history","definition[1]":"a particular time in someone’s life or in history","example[5]":"the conflict of the Cold War period","example[6]":"Van Gogh’s early period","example[7]":"the Jurassic period","example[8]":"the behaviour of children during the period of adolescence","signpost[2]":"blood","definition[2]":"the flow of blood that comes from a woman’s body each month","example[9]":"I was 12 years old when I started my periods.","definition[3]":"the mark (.) used in writing to show the end of a sentence or of an abbreviation","definition[4]":"one of the equal parts that the school day is divided into","example[10]":"What class do you have first period?","example[11]":"a double period of Science","definition[5]":"one of the equal parts that a game is divided into in a sport such as ice hockey","example[12]":"The Bruins scored twice in the first period.","form[0]":"ADJECTIVES/NOUN + period","collocation[0]":"a long/lengthy period","example[13]":"They had to spend long periods apart.","collocation[1]":"a short/brief period","example[14]":"He lived for a short period in Manchester.","collocation[2]":"a limited period","example[15]":"From May, the site will be open to the public for a limited period.","collocation[3]":"a fixed/set period","example[16]":"A tourist visa allows you to stay for a fixed period.","collocation[4]":"an indefinite period","example[17]":"The painting had been loaned to the gallery for an indefinite period.","collocation[5]":"a six month/five year etc period","example[18]":"They studied the behaviour of the ocean during a five year period.","collocation[6]":"a trial period","example[19]":"We could introduce the system for a trial period.","collocation[7]":"a period of time","example[20]":"Over a period of time, this pressure can damage the fibres of the carpet.","heading[0]":"a period in history","definition[6]":"a particular time in history, especially one studied as a subject","example[21]":"the late Victorian period","example[22]":"the interwar period","example[23]":"During that period many people moved from the countryside to the towns.","definition[7]":"a period of years, months, days etc","example[24]":"The 1960s were a time of great social change.","example[25]":"the biggest earthquake in modern times","example[26]":"Verdun was an important city in Roman times.","display[0]":"age","definition[8]":"a long period, especially one that represents a particular stage in the development of civilization or technology","example[27]":"the industrial age","example[28]":"We are now in the age of the Internet.","example[29]":"the Stone Age (=when people used tools made of stone)","display[1]":"era","definition[9]":"a long period that has a particular character or that is marked by particular events","example[30]":"We live in an era of breathtaking change.","example[31]":"the post-war era","example[32]":"De Gaulle’s death marked the end of an era.","display[2]":"epoch","definition[10]":"means the same as era, but sounds more formal and important","example[33]":"We are now entering a new epoch in human history.","example[34]":"the colonial epoch","example[35]":"It was the end of an epoch.","definition[11]":"used to emphasize that you have made a decision and that you do not want to discuss the subject any more","synonym[0]":"full stop!","example[36]":"I’m not going, period!","definition[12]":"a particular length of time","example[37]":"She has been taken on for a 6-month trial period."}