{"word[0]":"tackle","definition[0]":"to try to deal with a difficult problem","example[0]":"There is more than one way to tackle the problem.","example[1]":"It took twelve fire engines to tackle the blaze.","definition[1]":"to try to take the ball away from an opponent in a game such as football or hockey","definition[2]":"to force someone to the ground so that they stop running, in a game such as American football or rugby","definition[3]":"to talk to someone in order to deal with a difficult problem","example[2]":"When I tackled Susan about it, she admitted she’d made a mistake.","note[0]":"tackle somebody about something","definition[4]":"to start fighting someone, especially a criminal","example[3]":"I certainly couldn’t tackle both of them on my own.","collocation[0]":"tackle a problem/issue/question","example[4]":"The government has failed to tackle the problem of youth crime.","collocation[1]":"tackle a job/challenge","example[5]":"She said she couldn’t face tackling the job on her own.","collocation[2]":"tackle a blaze/fire","example[6]":"Fire crews tackling the blaze were hampered by exploding gas canisters.","collocation[3]":"tackle crime","example[7]":"The police set up a special task force to tackle street crime in the capital.","collocation[4]":"tackle poverty","example[8]":"He believes education is the long-term key to tackling poverty.","collocation[5]":"tackle unemployment","example[9]":"The government announced a new initiative to tackle unemployment.","collocation[6]":"tackle something head-on","example[10]":"The issue of cost must be tackled head-on.","definition[5]":"an attempt to take the ball from an opponent in a game such as football","definition[6]":"an attempt to stop an opponent by forcing them to the ground, especially in American football or rugby","definition[7]":"a player in American football who stops other players by tackling them or preventing them from moving forward","definition[8]":"the equipment used in some sports and activities, especially fishing","definition[9]":"ropes and pulleys (=wheels) used for lifting heavy things","definition[10]":"a man’s sexual organs"}