{"word[0]":"shelter","definition[0]":"a place to live, considered as one of the basic needs of life","example[0]":"They are in need of food and shelter.","definition[1]":"protection from danger or from wind, rain, hot sun etc","example[1]":"The men took shelter in a bombed-out farmhouse.","example[2]":"All around me, people were running for shelter.","example[3]":"We reached the shelter of the caves.","note[0]":"shelter of","example[4]":"They were standing under the shelter of a huge tree.","note[1]":"in/into/under etc the shelter of something","example[5]":"An old hut gave shelter from the storm.","note[2]":"shelter from","definition[2]":"a building where people or animals that have nowhere to live or that are in danger can stay and receive help","example[6]":"a homeless shelter (=for people who have no homes)","example[7]":"an animal shelter","example[8]":"a shelter for battered women","note[3]":"shelter for","definition[3]":"a building or an area with a roof over it that protects you from the weather or from danger","note[4]":"bus shelter British English (=a small structure with a roof where you wait for a bus)","heading[0]":"– Meaning 2: protection from danger or from wind, rain, hot sun etc","collocation[0]":"take shelter","example[9]":"When it started raining, they took shelter in a cave.","collocation[1]":"find shelter","example[10]":"He slept wherever he could find shelter.","collocation[2]":"seek shelter","example[11]":"They sought shelter under the trees.","collocation[3]":"run for shelter","example[12]":"The residents were running for shelter from the bombing.","collocation[4]":"give/provide shelter","example[13]":"The trees gave shelter from the wind.","definition[4]":"to provide a place where someone or something is protected, especially from the weather or from danger","example[14]":"Collins was arrested for sheltering enemy soldiers.","example[15]":"Plant herbs next to a wall to shelter them from the wind.","note[5]":"shelter somebody/something from somebody/something","definition[5]":"to stay in or under a place where you are protected from the weather or from danger","example[16]":"We sat in the shade, sheltering from the sun.","definition[6]":"a British charity organization that helps people who are homeless (=do not have a home to live in)"}