{"word[0]":"chase","signpost[0]":"follow","definition[0]":"to quickly follow someone or something in order to catch them","example[0]":"The dogs saw him running and chased him.","example[1]":"kids chasing around the house","example[2]":"The police chased the suspect along Severn Avenue.","note[0]":"chase somebody along/down/up something etc","example[3]":"A gang of boys chased after her, calling her names.","note[1]":"chase after","signpost[1]":"make somebody/something leave","definition[1]":"to make someone or something leave, especially by following them for a short distance and threatening them","example[4]":"The men were chased off by troops, who fired warning shots.","note[2]":"chase somebody away/off","example[5]":"Anne went to chase the dog out of the garden.","note[3]":"chase somebody out of something","signpost[2]":"try to get something","definition[2]":"to use a lot of time and effort trying to get something such as work or money","example[6]":"Top graduates from the university are chased by major companies.","example[7]":"reporters chasing after a story","signpost[3]":"hurry","definition[3]":"to rush or hurry somewhere","example[8]":"I was chasing around getting everything organized.","note[4]":"chase around/up/down etc","signpost[4]":"romance","definition[4]":"to try hard to make someone notice you and pay attention to you, because you want to have a romantic relationship with them","example[9]":"‘Sometimes a girl wants to be chased, ’ Amelia said.","signpost[5]":"metal","definition[5]":"to decorate metal with a special tool","example[10]":"chased silver","definition[6]":"the act of following someone or something quickly in order to catch them","example[11]":"a high-speed car chase","example[12]":"Police spotted the car and gave chase (=chased it).","definition[7]":"when you use a lot of time and effort trying to get something","example[13]":"the chase after higher-paying jobs","definition[8]":"a large bank in the US, with its main offices in New York City. It was formerly called the Chase Manhattan Bank, and merged with JP Morgan in 2000."}