{"past_tense[0]":"threw","past_participle[0]":"thrown","signpost[0]":"throw a ball/stone etc","definition[0]":"to make an object such as a ball move quickly through the air by pushing your hand forward quickly and letting the object go","example[0]":"He threw his shirt to someone in the crowd.","note[0]":"throw something to somebody","example[1]":"Someone threw a stone at the car.","note[1]":"throw something at somebody/something","example[2]":"a crowd of boys throwing snowballs at each other","example[3]":"Throw me that towel, would you.","note[2]":"throw somebody something","signpost[1]":"put something carelessly","definition[1]":"to put something somewhere quickly and carelessly","example[4]":"He threw a handful of money onto the table.","example[5]":"Don’t just throw your clothes on the floor – pick them up!","signpost[2]":"push roughly/violently","definition[2]":"to push someone or something roughly and violently","example[6]":"The bus stopped suddenly and we were all thrown forwards.","example[7]":"The guards threw Biko to the ground and started kicking him.","example[8]":"The bomb exploded, throwing bricks and debris into the air.","example[9]":"She drew the curtains and threw open the windows.","signpost[3]":"make somebody fall","definition[3]":"to make your opponent fall to the ground in a sport in which you fight","definition[4]":"if a horse throws its rider, it makes them fall onto the ground","signpost[4]":"move hands/head etc","definition[5]":"to suddenly and quickly move your hands, arms, head etc into a new position","example[10]":"I threw my arms around her and kissed her.","example[11]":"He threw his head back and laughed.","signpost[5]":"confuse somebody","definition[6]":"to make someone feel very confused","example[12]":"It threw me completely when she said she was coming to stay with us.","definition[7]":"to make something such as a ball or stone move quickly through the air using your hand","example[13]":"I threw the ball back to him.","example[14]":"Protestors began throwing stones at the police.","example[15]":"I just threw the letter in the bin.","display[0]":"toss","definition[8]":"to throw something, especially in a careless way without using much effort","example[16]":"She tossed her coat onto the bed.","example[17]":"Can you chuck me the remote control?","display[1]":"hurl","definition[9]":"to throw something with a lot of force","example[18]":"Someone hurled a brick through his window.","display[2]":"fling","definition[10]":"to angrily throw something somewhere with a lot of force, or to carelessly throw something somewhere because you have very little time","example[19]":"He flung her keys into the river.","example[20]":"I flung a few things into a suitcase.","display[3]":"heave","definition[11]":"to throw something heavy using a lot of effort","example[21]":"They heaved the log into the river.","display[4]":"lob","definition[12]":"to throw something high into the air over someone or something","example[22]":"The police lobbed tear gas canisters over the heads of the demonstrators.","heading[0]":"to throw a ball in a sport","definition[13]":"to throw the ball to another member of your team","example[23]":"He passed the ball to Wilkinson, who kicked the ball over the goalposts.","display[5]":"pitch","definition[14]":"to throw the ball to the batter in a game of baseball","example[24]":"Stoddard pitched for the Chicago White Sox.","display[6]":"bowl","definition[15]":"to throw the ball towards the person who is batting in a game of cricket","example[25]":"Harmison bowled superbly and took 5 wickets.","definition[16]":"an action in which someone throws something","example[26]":"That was a great throw!","example[27]":"a throw of over 80 metres","definition[17]":"an action in which someone rolls a dice in a game","example[28]":"It’s your throw.","definition[18]":"a large piece of cloth that you put loosely over a chair to cover it and make it look attractive","example[29]":"a brightly-coloured cotton throw","definition[19]":"to try to solve a problem by spending a lot of money, without really thinking about the problem","example[30]":"There is no point throwing money at the pollution problem.","definition[20]":"to waste money by spending it on something that has already failed","example[31]":"As the project devoured more than £4 million, we began to wonder if we were throwing money down the drain."}