{"word[0]":"same","signpost[0]":"not different","definition[0]":"the same person, place, thing etc is one particular person etc and not a different one","example[0]":"He sits in the same chair every night.","example[1]":"They went to the same school.","example[2]":"It is those same people who voted for the Democrats who now complain about their policies.","example[3]":"We stood in front of the very same house in which Shakespeare wrote his plays.","note[0]":"the very same","example[4]":"She was born on the same day as me.","note[1]":"same as","definition[1]":"used to say two or more people, things, events etc are exactly like each other","example[5]":"Both women were wearing the same dress.","example[6]":"The same thing could happen again.","example[7]":"The furniture is made in much the same (=almost the same) way as it was 200 years ago.","example[8]":"That’s funny – Simon said exactly the same thing.","note[2]":"just/exactly the same something","example[9]":"He gets the same pay as me but he gets his own office.","signpost[1]":"not changing","definition[2]":"used to say that a particular person or thing does not change","example[10]":"Her perfume has always had the same effect on me.","example[11]":"He’s the same old Peter – moody and irritable.","display[0]":"the same","definition[3]":"used to say that two people, things, events etc are exactly like each other","example[12]":"The houses on the street all look the same.","example[13]":"They were doing the same jobs as the men, but being paid less.","display[1]":"just like/exactly like","definition[4]":"used to say that there is very little difference between two people, things etc","example[14]":"He’s just like his father.","example[15]":"There are insects that look exactly like green leaves.","display[2]":"identical","definition[5]":"identical  things are exactly the same in every way","example[16]":"The tablets were identical in size, shape, and colour.","example[17]":"identical names","display[3]":"indistinguishable","definition[6]":"two things that are indistinguishable are so similar that it is impossible to know which is which or to see any differences between them","example[18]":"The copy was indistinguishable from the original painting.","display[4]":"equal","definition[7]":"two or more amounts, totals, levels etc that are equal are the same as each other","example[19]":"Spend an equal amount of time on each essay question.","display[5]":"be no different from somebody/something","definition[8]":"to be the same, even though you expect them to be different","example[20]":"People often think that movie stars are special, but really they’re no different from anybody else.","display[6]":"can’t tell the difference","definition[9]":"if you  can’t tell the difference  between two people or things, or if you  can’t tell them apart, they look, sound, or seem exactly the same to you","example[21]":"Emma and Louise sound so alike on the phone that I can’t tell the difference.","heading[0]":"GRAMMAR: Patterns with same","explanation[0]":"You usually say the same","example[22]":"They both gave the same reason for leaving","example[23]":"I’d like the same sort of car","example[24]":"The buildings all look the same","bad_example[0]":"They both gave a same reason","bad_example[1]":"I’d like a same sort of car","explanation[1]":"You say the same as","example[25]":"His answer was the same as mine","bad_example[2]":"the same like mine","bad_example[3]":"the same with mine","explanation[2]":"this same or that same followed by a noun, to emphasize it","example[26]":"At that same moment, the telephone rang"}