{"word[0]":"bold","signpost[0]":"person/action","definition[0]":"not afraid of taking risks and making difficult decisions","example[0]":"In a surprisingly bold move, he is threatening court action against the company.","example[1]":"My aunt Flo was a bold determined woman.","example[2]":"He had the ability to take bold imaginative decisions.","signpost[1]":"manner/appearance","definition[1]":"so confident or determined that you sometimes offend people","example[3]":"You should be feeling confident and bold when you meet your bank manager.","example[4]":"She marched into his office as bold as brass (=very confident and not showing enough respect).","signpost[2]":"colours/shapes","definition[2]":"very strong or bright so that you notice them","example[5]":"bold geometric shapes","example[6]":"Stripes are bold, bright, and fun to wear.","example[7]":"bold colours","signpost[3]":"lines/writing","definition[3]":"written or drawn in a very clear way","example[8]":"an envelope addressed to her in a bold black hand","example[9]":"The graphics are bold and colourful.","example[10]":"The print should be bold and easy to read.","signpost[4]":"printed letters","definition[4]":"printed in letters that are darker and thicker than ordinary printed letters","example[11]":"All the headings are in bold type.","collocation[0]":"a bold move","example[12]":"The newspapers described her resignation as a bold move.","collocation[1]":"a bold step","example[13]":"The following year he made a bold step to expand his business.","collocation[2]":"a bold attempt","example[14]":"It was a bold attempt to win back public confidence.","collocation[3]":"a bold statement/assertion/claim","example[15]":"In a surprisingly bold statement, the couple said they had no intention of marrying.","collocation[4]":"a bold decision","example[16]":"Deciding to emigrate is a bold decision for anyone to make.","collocation[5]":"a bold initiative","example[17]":"Investors have become used to the company’s bold initiatives.","collocation[6]":"a bold experiment","example[18]":"Making a film from the book was a bold experiment, and it worked."}