{"word[0]":"duty","plural[0]":"duties","signpost[0]":"something you must do","definition[0]":"something that you have to do because it is morally or legally right","synonym[0]":"obligation","example[0]":"I promise I will do my duty.","example[1]":"We feel it is our duty to help her.","example[2]":"Local authorities have a duty to keep the streets clean.","example[3]":"You have a duty to your husband and to your children.","example[4]":"She has a strong sense of moral duty.","example[5]":"The unions have failed in their duty to female workers.","example[6]":"In the traditional Hindu family, the son is duty-bound to look after his mother.","definition[1]":"something you have to do as part of your job","example[7]":"He will soon be fit enough to carry out his duties  (=do his job).","example[8]":"He can only do light duties.","example[9]":"When Juliet reported for duty  (=arrived and said she was ready to start work) she was sent to check on a new patient.","example[10]":"A teacher may be fired for neglect of duty  (=failing to do their job properly).","example[11]":"He did three tours of duty in Vietnam  (=three periods working in a foreign country as a soldier, government officer etc).","example[12]":"Martin’s duties included cleaning the cars.","example[13]":"She works for her father doing part-time secretarial duties.","signpost[1]":"tax","definition[2]":"a tax you pay on something you buy","note[0]":"customs duty (=tax paid on goods coming into the country)","example[14]":"the duty on cigarettes","note[1]":"duty on","heading[0]":"– Meaning 1: something that you have to do because it is morally or legally right","collocation[0]":"have a duty to do something","example[15]":"Parents have a duty to make sure that their children receive an education.","collocation[1]":"do your duty","example[16]":"I felt I had done my duty by voting.","collocation[2]":"fulfil your duty","example[17]":"The school has failed to fulfil its legal duty towards students.","collocation[3]":"have/owe a duty to somebody","example[18]":"A tenant owes a duty to the landlord to keep the house in reasonable condition.","collocation[4]":"fail in your duty","example[19]":"I would be failing in my duty if I didn't warn you of the dangers.","collocation[5]":"a moral duty","example[20]":"She felt it was her moral duty to treat everyone equally.","collocation[6]":"a legal duty","example[21]":"Employers have a legal duty to ensure the safety of their workforce.","collocation[7]":"a statutory duty","example[22]":"Local authorities have a statutory duty to ensure that parks are clean.","collocation[8]":"a public duty","example[23]":"The media has a public duty to report the truth.","collocation[9]":"a civic duty","example[24]":"It is your civic duty to vote.","collocation[10]":"a sense of duty","example[25]":"He was caring for his parents out of a sense of duty rather than love.","collocation[11]":"be duty-bound to do something","example[26]":"Soldiers are here to do a job and are duty-bound to complete it.","heading[1]":"– Meaning 2: something you have to do as part of your job","collocation[12]":"carry out your duties","example[27]":"She has always carried out her duties efficiently.","collocation[13]":"take up your duties","example[28]":"Neale has agreed a three-year contract and takes up his duties on March 1.","collocation[14]":"resume your duties","example[29]":"She hopes to be well enough to resume her duties next week.","collocation[15]":"report for duty","example[30]":"You must report for duty at 8:30 tomorrow morning.","collocation[16]":"neglect/shirk your duties","example[31]":"No soldier can be allowed to neglect his duties.","form[0]":"ADJECTIVES/NOUN + duty","collocation[17]":"official duties","example[32]":"The new president will take up his official duties next month.","collocation[18]":"presidential/royal/ministerial etc duties","example[33]":"The prince is now old enough to carry out royal duties.","collocation[19]":"household/domestic duties","example[34]":"My husband and I share most of the household duties.","collocation[20]":"light duties","example[35]":"He'd been wounded, sent home and put on light duties.","collocation[21]":"guard duty","example[36]":"There were two soldiers on guard duty outside the embassy.","collocation[22]":"neglect of duty","example[37]":"Six police officers were fired for neglect of duty.","collocation[23]":"a tour of duty","example[38]":"He became a General, and his tours of duty included Korea and Vietnam.","collocation[24]":"beyond the call of duty","example[39]":"She's a doctor who has gone beyond the call of duty in her care for her patients.","collocation[25]":"in the course of duty","example[40]":"Stewart received a medal for outstanding bravery in the course of duty.","definition[3]":"something that you have to do as part of your job","example[41]":"Thomas J Hutchison was named chief executive officer, adding to his duties as president and chief operating officer.","definition[4]":"a tax you pay on something you buy, import etc","example[42]":"Democrats want these imported vans classified as trucks and hit with a 25% duty.","example[43]":"Duty is levied (=charged) on every bottle of wine brought into the country."}