{"word[0]":"realize","definition[0]":"to know and understand something, or suddenly begin to understand it","example[0]":"It took us a while to realize the extent of the tragedy.","example[1]":"It was only later that I realized my mistake.","example[2]":"I suddenly realized that the boy was crying.","note[0]":"realize (that)","example[3]":"Do you realize you’re an hour late?","example[4]":"I’m sorry, I didn’t realize who you were.","note[1]":"realize who/what/how etc","explanation[0]":"In this meaning, realize is not usually used in the progressive You say","example[5]":"Nobody realizes how important this is","bad_example[0]":"Nobody is realizing how important this is","explanation[1]":"In spoken English, people sometimes say I’m realizing to say that they have recently begun to realize something","example[6]":"Now I’m a parent, I’m realizing what my parents went through","signpost[0]":"achieve","definition[1]":"to achieve something that you were hoping to achieve","example[7]":"She never realized her ambition of winning an Olympic gold medal.","example[8]":"a young singer who has not yet realized her full potential (=achieved as much as she can achieve)","definition[2]":"to obtain or earn an amount of money","example[9]":"The campaign realized $5000.","example[10]":"We realized a small profit on the sale of the house.","definition[3]":"to change something that you own into money by selling it","definition[4]":"to begin to understand, notice, or know something that you did not understand etc before","example[11]":"I hadn’t realized that Ben was his brother.","example[12]":"She suddenly realized who the man in the photograph was.","display[0]":"become aware","definition[5]":"to gradually realize that something is happening or is true, over a period of time","example[13]":"He slowly became aware that he was not alone","example[14]":"People are becoming more aware of the harmful effects of cars on the environment.","display[1]":"dawn on somebody","definition[6]":"if something dawns on you, you realize it for the first time – often used in the phrase it dawned on somebody","example[15]":"It dawned on me that he could be lying.","example[16]":"It only dawned on her that she was in danger when she saw rescue workers running away from the building.","example[17]":"He thought about the dream for a long time before its meaning began to dawn on him.","display[2]":"sink in","definition[7]":"if something sinks in, you begin to realize its full meaning or importance, especially gradually","example[18]":"It took a few minutes for the doctor’s words to sink in.","example[19]":"The reality of what I had done slowly began to sink in.","definition[8]":"if a fact hits you, you suddenly understand it and how important it is","example[20]":"It hit me one day that he didn’t care. He’d talk when I phoned him, but he’d never call me.","display[3]":"strike","definition[9]":"if an idea or thought strikes you, you suddenly think of it","example[21]":"It suddenly struck her what a risk she was taking.","example[22]":"A thought has just struck me - there must be other people with the same problem.","definition[10]":"to make money from something","example[23]":"He estimated they could realize $115 million on the sale before taxes.","example[24]":"The company was able to realize a 35% increase in operating profit.","definition[11]":"to sell something that has increased in value or lost value","example[25]":"People rushed to realize gains because the capital gains tax rate was about to rise.","example[26]":"The bank will realize losses from sales of certain parts of its investment portfolio.","definition[12]":"to sell assets that you own in order to make money","example[27]":"They have three years to realize the firm’s assets and pay back as much of the debt as possible.","example[28]":"Both of these boys realized their ambitions and become successful solicitors."}