{"word[0]":"steer","signpost[0]":"car/boat etc","definition[0]":"to control the direction a vehicle is going, for example by turning a wheel","example[0]":"He was steering with only one hand.","example[1]":"Steer towards the left.","note[0]":"steer for/towards etc","signpost[1]":"change somebody/something","definition[1]":"to guide someone’s behaviour or the way a situation develops","example[2]":"Helen tried to steer the conversation away from herself.","example[3]":"Teachers try to steer pupils away from drugs.","note[1]":"steer somebody towards/away from/through etc something","signpost[2]":"be in charge of","definition[2]":"to be in charge of an organization, team etc and make decisions that help it to be successful, especially during a difficult time","example[4]":"McKinney steered the company through the recession.","note[2]":"steer something through/to etc something","signpost[3]":"guide somebody to a place","definition[3]":"to guide someone to a place, especially while touching them","example[5]":"Joel steered Don and Louise towards the backyard.","note[3]":"steer somebody towards/to etc something","definition[4]":"a young male cow whose sex organs have been removed","definition[5]":"to guide the way a situation develops, by influencing people’s ideas or actions","example[6]":"He managed to steer his colleagues to a compromise.","note[4]":"steer somebody to something","example[7]":"Farmers must be steered away from high-yield farming, towards more environmentally friendly methods.","note[5]":"steer somebody away from something","definition[6]":"to be in charge of an organization, team, or process and make decisions that help it to be successful, especially during a difficult time","example[8]":"Rivetti is steering a comprehensive restructuring program that will transform the company.","definition[7]":"to avoid something or someone unpleasant or difficult","example[9]":"Will the economy steer clear of a recession?","definition[8]":"to choose a course of action that is not extreme and that does not favour one side more than another","example[10]":"The President will try to steer a middle course between environmentalists and the oil industry.","note[6]":"steer a middle course between"}