{"word[0]":"gang","definition[0]":"a group of young people who spend time together, and who are often involved in crime or drugs and who often fight against other groups","example[0]":"two rival street gangs","example[1]":"the problem of inner-city gang violence","example[2]":"a victim of gang warfare","example[3]":"The parents have denied that their son is a gang member.","note[0]":"gang member/member of a gang","definition[1]":"a group of young people together in one place, especially young people who might cause trouble","example[4]":"There were always gangs of kids hanging around the mall.","note[1]":"gang of","definition[2]":"a group of criminals who work together","example[5]":"Several gangs were operating in the area.","example[6]":"Armed gangs have hijacked lorries.","example[7]":"a gang of smugglers","definition[3]":"a group of friends, especially young people","example[8]":"The whole gang will be there next weekend.","definition[4]":"a group of workers or prisoners doing physical work together","form[0]":"ADJECTIVES/NOUN + gang","collocation[0]":"a criminal gang","example[9]":"He had links with drug smuggling and criminal gangs.","collocation[1]":"an armed gang","example[10]":"An armed gang stole jewels worth more than five million pounds.","collocation[2]":"a rival gang","example[11]":"Fighting between rival gangs left dozens of people injured.","collocation[3]":"a street gang","example[12]":"He belonged to a notorious street gang which terrorized a Chicago suburb.","collocation[4]":"a teenage/youth gang","example[13]":"At age nine, Pedro joined one of the youth gangs in his neighborhood, just to survive.","form[1]":"gang + NOUN","collocation[5]":"a gang member/a member of a gang","example[14]":"Gang members are thought to be responsible for up to 20% of murders in the city.","collocation[6]":"a gang leader","example[15]":"Gang leaders used cellphones to order the attacks.","collocation[7]":"gang violence","example[16]":"Residents say that gang violence is common.","collocation[8]":"gang warfare","example[17]":"Gang warfare is wrecking the neighborhood.","collocation[9]":"gang crime","example[18]":"The initiative aims to cut gang crime in Los Angeles.","collocation[10]":"gang activity","example[19]":"In most areas, gun crime is linked to gang activity.","collocation[11]":"join a gang","example[20]":"He was only eight when he joined the gang.","collocation[12]":"belong to a gang","example[21]":"Eleven men belonging to a local gang were arrested."}