{"word[0]":"privilege","definition[0]":"a special advantage that is given only to one person or group of people","example[0]":"He had no special privileges and was treated just like every other prisoner.","example[1]":"the privilege of a good education","note[0]":"privilege of","definition[1]":"something that you are lucky to have the chance to do, and that you enjoy very much","example[2]":"Today, we have the privilege of listening to two very unusual men.","note[1]":"the privilege of doing something","example[3]":"I had the great privilege to play for Yorkshire.","note[2]":"the privilege to do something","example[4]":"It is a privilege to hear her play.","definition[2]":"a situation in which people who are rich or of a high social class have many more advantages than other people","example[5]":"wealth and privilege","definition[3]":"a situation in which doctors, lawyers etc are allowed to keep information about their discussions with their patients or clients secret from other people","definition[4]":"the right to do or say something unacceptable without being punished, especially in Parliament","note[3]":"breach of privilege (=a breaking of the rules about what a Member of Parliament can do or say)","definition[5]":"to treat some people or things better than others","definition[6]":"a special advantage given to a small group of people, organizations, countries etc","example[6]":"The newtrade privileges will enhance Vienna’s effort to attract US companies.","example[7]":"The Treasury will allow dealers to bid on government securities, a privilege previously restricted to only 39 firms.","definition[7]":"a right in law that protects a person, for example by not forcing them to discuss something, or allowing them freedom to say things that would not normally be acceptable","synonym[0]":"IMMUNITY","example[8]":"Ms. Backiel asserted theattorney-client privilege and refused to discuss the case.","example[9]":"Committee members expressed concern that the case could threaten Parliament’s traditional privileges."}