{"word[0]":"responsibility","plural[0]":"responsibilities","definition[0]":"a duty to be in charge of someone or something, so that you make decisions and can be blamed if something bad happens","example[0]":"Kelly’s promotion means more money and more responsibility.","example[1]":"The Minister has responsibility for the National Health Service.","example[2]":"a manager with responsibility for over 100 staff","note[0]":"with responsibility for something","example[3]":"It’s your responsibility to inform us of any changes.","note[1]":"it is somebody’s responsibility to do something","definition[1]":"blame for something bad that has happened","example[4]":"The firm is denying all responsibility. ","example[5]":"So far no one has claimed responsibility   (=said that they are responsible) for the bombings.","example[6]":"No one wants to take responsibility for the problem.","note[2]":"responsibility for","example[7]":"The surgeon accepted full responsibility  for the error that led to her death.","definition[2]":"something that you must do as part of your job or duty","example[8]":"My responsibilities include answering the phone and dealing with customer enquiries.","example[9]":"a single parent struggling to balance work and family responsibilities","note[3]":"family/professional/parental etc responsibilities","definition[3]":"something that you ought to do because it is morally or socially right","synonym[0]":"duty","example[10]":"Parents need to encourage a sense of responsibility in their children  (=the ability to behave sensibly in a way that will not harm themselves or other people).","example[11]":"The company saw it as part of its social responsibility to provide education for its workers.","note[4]":"moral/social/legal etc responsibility","example[12]":"We all have a responsibility to protect the environment.","note[5]":"a responsibility to do something","heading[0]":"– Meaning 1: a duty to be in charge of someone or something, so that you make decisions and can be blamed if something bad happens","collocation[0]":"have responsibility for (doing) something","example[13]":"The Council has responsibility for maintaining the streetlights.","collocation[1]":"take responsibility for (doing) something","example[14]":"Who do you trust to take responsibility for our country's defence?","collocation[2]":"take on responsibility","example[15]":"These days men tend to take on more responsibility at home.","example[16]":"The government must assume greater responsibility for the care of the elderly.","collocation[3]":"shoulder responsibility","example[17]":"The city, she said, would shoulder responsibility for caring for the children.","collocation[4]":"shirk responsibility","example[18]":"He doesn't shirk responsibility.","collocation[5]":"exercise responsibility","example[19]":"The citizens of ancient Athens met here to exercise their responsibility to govern themselves.","collocation[6]":"abdicate responsibility","example[20]":"The state should not allow parents to abdicate responsibility for their children.","collocation[7]":"the responsibility lies with somebody","example[21]":"Ultimate responsibility for admissions lies with the Course Co-ordinator.","collocation[8]":"personal responsibility","example[22]":"So far, no one had taken personal responsibility for the project.","collocation[9]":"overall responsibility","example[23]":"The Department of Education has overall responsibility for schools and universities.","collocation[10]":"direct responsibility","example[24]":"He has direct responsibility for all the programmes on Radio 1.","collocation[11]":"sole responsibility","example[25]":"The financial director has sole responsibility for financial matters.","collocation[12]":"collective responsibility","example[26]":"Head teachers should encourage a sense of collective responsibility among teachers.","collocation[13]":"primary responsibility","example[27]":"I have primary responsibility for the children.","collocation[14]":"ultimate responsibility","example[28]":"The National Assembly will have ultimate responsibility for ensuring that health targets are met.","collocation[15]":"a burden of responsibility","example[29]":"Being the only wage earner put a great burden of responsibility on my father.","collocation[16]":"a position of responsibility","example[30]":"Before the age of 21 he had attained a position of responsibility in the factory.","heading[1]":"– Meaning 2: blame for something bad that has happened","collocation[17]":"accept/take responsibility for something","example[31]":"To his credit, he took responsibility for his actions.","collocation[18]":"claim responsibility (for something)","example[32]":"No group has yet claimed responsibility for the bombings.","collocation[19]":"deny responsibility for something","example[33]":"The company denied responsibility for the oil spillage.","collocation[20]":"bear responsibility for something","example[34]":"Developed countries must bear much of the responsibility for environmental problems.","collocation[21]":"full responsibility","example[35]":"The airline accepted full responsibility for the crash.","example[36]":"I take personal responsibility for what went wrong.","definition[4]":"when someone is officially in charge of something and has to make decisions about it","example[37]":"In his new post, he willassume responsibility for all the company’s radio and TV operations.","definition[5]":"all the things someone is in charge of in a particular job, position etc","example[38]":"My workload and responsibilities have increased more than my salary.","example[39]":"As chief executive, Iaccept responsibility for certain administrative problems.","example[40]":"Lawyers for the airlinedenied anyresponsibility for the incident."}