{"word[0]":"custom","definition[0]":"something that is done by people in a particular society because it is traditional","example[0]":"The guide offers information on local customs.","note[0]":"local/ancient/French etc custom","example[1]":"It’s the custom for the bride’s father to pay for the wedding.","note[1]":"it is the custom (for somebody) to do something","example[2]":"The custom of naming women after flowers is becoming less common.","note[2]":"the custom of doing something","definition[1]":"something that you usually do every day, or in a particular situation","synonym[0]":"habit","example[3]":"He awoke early, as was his custom.","definition[2]":"the practice of regularly using a particular shop or business","example[4]":"an advertisement to attract more custom","example[5]":"Smaller shops lose a lot of custom when supermarkets open nearby.","form[0]":"ADJECTIVES/NOUN + custom","collocation[0]":"a local custom","example[6]":"We were unfamiliar with the local customs.","collocation[1]":"an old/ancient/age-old custom","example[7]":"Here on the island, many of the old customs have survived.","collocation[2]":"an established custom","example[8]":"He had criticized some of the school’s established customs.","collocation[3]":"a traditional custom","example[9]":"The children learn about traditional customs, crafts, music, and dance.","collocation[4]":"a social custom","example[10]":"Our people do not want to imitate western social customs.","collocation[5]":"a French/Greek etc custom","example[11]":"The Spanish custom is to add the mother’s surname after the father’s.","collocation[6]":"a tribal custom","example[12]":"He spoke four African languages and knew most of the tribal customs.","collocation[7]":"burial customs","example[13]":"the diversity of burial customs in different parts of the world","collocation[8]":"follow/observe a custom","example[14]":"Following a Chinese custom, Deng changed his given name to mark the occasion.","collocation[9]":"respect a custom","example[15]":"Strangers should respect the customs of the country they are in.","collocation[10]":"a custom survives","example[16]":"The custom of slaughtering an animal to welcome guests still survives in some areas.","collocation[11]":"a custom dies out/disappears","example[17]":"Sometimes the streets are decorated with flower petals, although this custom is dying out.","definition[3]":"custom products or services are specially designed and made for a particular person","synonym[1]":"bespoke","example[18]":"His son operates a custom furniture business.","definition[4]":"when people use a particular shop or business","example[19]":"a marketing campaign to attract more custom","example[20]":"Saturday is usually our busiest day and we have missed out on a great deal of custom through the closure."}