{"word[0]":"award","definition[0]":"something such as a prize or money given to someone to reward them for something they have done","example[0]":"The movie has won a number of awards.","example[1]":"an award-winning restaurant","example[2]":"the award for best student","note[0]":"award for","definition[1]":"something, especially money, that is officially given to someone as a payment or after a legal decision","example[3]":"the teachers’ pay award","example[4]":"an award for unfair dismissal","collocation[0]":"win an award","example[5]":"Caprio won the award for best actor.","example[6]":"an award-winning novel","collocation[1]":"get/receive an award","example[7]":"He is the youngest person ever to receive the award.","collocation[2]":"give somebody an award","example[8]":"The award is given each year to the best new artist.","collocation[3]":"present somebody with an award","example[9]":"She cried when she was presented with her award.","collocation[4]":"be nominated for an award","example[10]":"Four films have been nominated for the award.","example[11]":"The book is up for an award.","collocation[5]":"pick up/scoop up an award","example[12]":"Angelina Jolie scooped up the award for best actress.","collocation[6]":"the award goes to somebody/something","example[13]":"The poetry award went to Lisa Mueller for ‘Alive Together'.","form[0]":"ADJECTIVES/NOUN + award","collocation[7]":"the highest award","example[14]":"The Victoria Cross is Britain’s highest military award.","collocation[8]":"a top award/a major award","example[15]":"The restaurant has won several top awards.","example[16]":"Their design won a major award at a Paris exhibition.","collocation[9]":"a special award","example[17]":"He received a special award for his work as a movie director.","collocation[10]":"a prestigious award","example[18]":"The Nobel Prize is regarded as the most prestigious award in the world.","collocation[11]":"a film/music/poetry etc award","example[19]":"the annual British music awards","collocation[12]":"a literary award","example[20]":"The book was nominated for a major US literary award.","form[1]":"award + NOUN","collocation[13]":"an awards ceremony","example[21]":"My parents wanted to be at the awards ceremony.","example[22]":"The stars are gathering for the annual awards ceremony.","collocation[14]":"an award winner","example[23]":"The award winners will be announced in December.","collocation[15]":"an award scheme","example[24]":"The league started a new award scheme for young players.","definition[2]":"to officially give someone something such as a prize or money to reward them for something they have done","example[25]":"Moodie has been awarded a golf scholarship at the University of Hawaii.","example[26]":"The judge awarded me first prize.","note[1]":"award somebody something","example[27]":"A Nobel Prize was awarded to Waksman in 1952.","note[2]":"award something to somebody","definition[3]":"to officially decide that someone should receive a payment or a formal agreement","example[28]":"The government awarded a German company the contract.","example[29]":"£45,000 was awarded to a typist with an injured hand.","definition[4]":"an amount of money that is given to someone as a result of an official decision or judgment","example[30]":"the basic award for unfair dismissal","example[31]":"The nurses’ pay award (=increase in pay) was not nearly as much as they had expected.","definition[5]":"something such as a prize or an amount of money given to a person or company to reward them for something they have done","example[32]":"85% of the company’s product is sold overseas, a feat which won it the Queen’s Award for Export.","definition[6]":"to officially decide that someone should have something such as an amount of money","example[33]":"We were naturally delighted to be awarded this contract.","note[3]":"be awarded something","example[34]":"The tribunal can award you compensation or order your reinstatement.","definition[7]":"to officially give a prize or an amount of money to a person or company, to reward them for what they have done","example[35]":"He has been awarded the MBE for services to the electricity supply industry.","example[36]":"The university awarded her a scholarship."}