{"word[0]":"impression","definition[0]":"the opinion or feeling you have about someone or something because of the way they seem","example[0]":"When we looked around the school we got a very good impression.","example[1]":"I got the impression that she wasn't very happy with her job.","example[2]":"What was your impression of Roger?","note[0]":"impression of","definition[1]":"if you do an impression of a famous person, you copy their speech or behaviour in order to make people laugh","synonym[0]":"imitation","example[3]":"Jean does a great impression of Madonna.","definition[2]":"a picture or drawing of what someone or something might look like, or what something will look like in the future","example[4]":"an artist’s impression of the new building","definition[3]":"a mark left by pressing something into a soft surface","example[5]":"Some of the fallen trees had left a clear impression  in the hardened mud.","definition[4]":"all the copies of a book printed at one time","collocation[0]":"make an impression","example[6]":"Think about what sort of impression you want to make.","collocation[1]":"give an impression","example[7]":"Her speech definitely gave the impression that she was enthusiastic about the project.","collocation[2]":"create an impression","example[8]":"Arriving late won’t create a very good impression.","collocation[3]":"get an impression","example[9]":"What sort of impression did you get of the city?","collocation[4]":"leave an impression on somebody","example[10]":"Janet certainly left an impression on him.","collocation[5]":"a good/positive impression","example[11]":"He was keen to make a good impression on his boss.","collocation[6]":"a bad/negative impression","example[12]":"Arriving late for an interview gives a very negative impression.","collocation[7]":"somebody’s first/initial/immediate impression","example[13]":"My first impression was that Terry’s version of the events was untrue.","collocation[8]":"a clear/vivid impression","example[14]":"He had the clear impression that most people were in favour of the idea.","collocation[9]":"a vague impression","example[15]":"Dave only had a vague impression of the man who had attacked him.","collocation[10]":"a strong/deep impression","example[16]":"She made a strong impression on me the first time I met her.","collocation[11]":"a lasting impression","example[17]":"Sam’s performance had clearly made a lasting impression on the audience.","collocation[12]":"the overwhelming/overriding impression","example[18]":"The overwhelming impression after the meeting was one of optimism.","collocation[13]":"an indelible impression","example[19]":"Alan’s wartime experiences had left an indelible impression on him.","collocation[14]":"a wrong/misleading impression","example[20]":"The advertisement gave a misleading impression of the product.","collocation[15]":"a false/mistaken impression","example[21]":"He had the mistaken impression that Julia was married.","example[22]":"Many people got the false impression she didn’t care.","collocation[16]":"the overall/general impression","example[23]":"The general impression was of a very efficiently run company.","collocation[17]":"the distinct impression","example[24]":"We were left with the impression that the contract was ours if we wanted it.","collocation[18]":"somebody’s personal impression","example[25]":"My personal impression is that the new manager has greatly improved things.","collocation[19]":"first impressions count","example[26]":"When attending a job interview, remember that first impressions count.","definition[5]":"an occasion when a particular advertisement is seen by someone on the Internet","example[27]":"A log of ad impressions is kept by the site server."}