{"word[0]":"consumption","signpost[0]":"amount used","definition[0]":"the amount of energy, oil, electricity etc that is used","example[0]":"dramatic rises in fuel consumption","note[0]":"energy/fuel etc consumption","example[1]":"Vigorous exercise increases oxygen consumption.","signpost[1]":"food/drink","definition[1]":"the act of eating or drinking","example[2]":"The meat was declared unfit for human consumption.","note[1]":"fit/unfit for human consumption","example[3]":"The consumption of alcohol on the premises is forbidden.","note[2]":"consumption of","definition[2]":"the amount of a substance that people eat, drink, smoke etc","example[4]":"The Government wants to reduce tobacco consumption by 40%.","note[3]":"alcohol/tobacco/caffeine etc consumption","signpost[2]":"buying","definition[3]":"the act of buying and using products","note[4]":"conspicuous consumption (=when people buy expensive products to prove they are rich)","example[5]":"art intended for mass consumption (=to be bought, seen etc by lots of people)","example[6]":"China’s austerity program has cut domestic consumption (=when products are bought in the country where they were produced).","definition[4]":"tuberculosis","form[0]":"ADJECTIVES/NOUN + consumption","collocation[0]":"high/low","example[7]":"People should stop using expensive cars with a high petrol consumption.","collocation[1]":"total consumption","example[8]":"Total consumption of petrol has risen by 20%.","collocation[2]":"domestic consumption","example[9]":"Domestic consumption of oil has increased.","collocation[3]":"household consumption","example[10]":"The government is encouraging us to reduce our household consumption of water.","collocation[4]":"energy consumption","example[11]":"Over a quarter of our energy consumption is in the home.","collocation[5]":"fuel/electricity/gas consumption","example[12]":"There are three possible methods of reducing oil consumption.","collocation[6]":"reduce consumption","example[13]":"The system will be introduced into all stores to reduce energy consumption by up to 10%","collocation[7]":"cut consumption","example[14]":"a plan to cut energy consumption by 40%","collocation[8]":"consumption rises/increases/goes up","example[15]":"Consumption of unleaded fuel rose by 17% in 1992.","collocation[9]":"consumption falls/decreases/goes down","example[16]":"Coal consumption has fallen dramatically.","definition[5]":"the amount of goods, services, energy, or natural materials used in a particular period of time","example[17]":"Texas is second only to California in beer consumption.","example[18]":"Cuban households have been asked to reduce their electricity consumption by 10%.","definition[6]":"the act of buying and using products, services etc","example[19]":"The spread of mass production, mass consumption and urbanisation have all contributed to the pollution of Lake Biwa.","definition[7]":"the amount spent on goods by consumers in a particular period of time","example[20]":"Developing countries keep their currencies’ value low and this allows them to limit consumption and imports and to stimulate exports, investment and growth.","example[21]":"He recommends a tax system that would tax consumption rather than income."}