{"word[0]":"conclusion","definition[0]":"something you decide after considering all the information you have","example[0]":"These are the report’s main conclusions.","example[1]":"It is still too early to reach a conclusion on this point.","example[2]":"There are perhaps two main conclusions to be drawn from the above discussion.","example[3]":"All the evidence pointed to the conclusion that he was guilty.","example[4]":"It’s important not to jump to conclusions.","example[5]":"The police came to the inescapable conclusion that the children had been murdered.","example[6]":"I soon came to the conclusion that she was lying.","note[0]":"conclusion (that)","definition[1]":"the end or final part of something","example[7]":"At the conclusion of the meeting, little progress had been made.","note[1]":"conclusion of","definition[2]":"the final arrangement of an agreement, a business deal etc","example[8]":"the conclusion of a peace treaty","collocation[0]":"come to/arrive at/reach a conclusion","example[9]":"I eventually came to the conclusion that I wanted to study law.","collocation[1]":"draw a conclusion","example[10]":"We tried not to draw any conclusions too early in the investigation.","collocation[2]":"jump to/leap to conclusions","example[11]":"Everyone jumped to the conclusion that we would get married.","collocation[3]":"lead to/point to a conclusion","example[12]":"All the data led to only one conclusion.","collocation[4]":"support a conclusion","example[13]":"The evidence supports the conclusion that his death was an accident.","collocation[5]":"an obvious conclusion","example[14]":"All her symptoms led to the obvious conclusion – she was pregnant.","collocation[6]":"the wrong conclusion","example[15]":"Reporters saw the couple together and leapt to the wrong conclusion.","collocation[7]":"the right/correct conclusion","example[16]":"I am sure that you came to the right conclusion.","collocation[8]":"the opposite conclusion","example[17]":"A lot of scientific evidence supports the opposite conclusion.","collocation[9]":"the inescapable/inevitable conclusion","example[18]":"The inescapable conclusion was that the country needed a change of leadership.","collocation[10]":"the logical conclusion","example[19]":"The logical conclusion is that short commercials are just as effective as longer ones.","collocation[11]":"a firm conclusion","example[20]":"At the end of the day, no firm conclusion had been reached.","collocation[12]":"a surprising/startling conclusion","example[21]":"After years of research, he reached a startling conclusion.","collocation[13]":"a hasty conclusion","example[22]":"Researchers must beware of drawing hasty conclusions.","example[23]":"Doctors failed to reach a conclusion on the exact cause of death.","example[24]":"The report’s main conclusion was that global warming was a serious threat.","display[0]":"findings","definition[3]":"the information that someone has discovered as a result of their study, work etc","example[25]":"Surveys conducted in other countries reported similar findings.","definition[4]":"the answers that are provided by a scientific study or test","example[26]":"Have you had the result of your blood test yet?"}