{"word[0]":"superior","definition[0]":"better, more powerful, more effective etc than a similar person or thing, especially one that you are competing against","opposite[0]":"inferior","example[0]":"Fletcher’s superior technique brought him victory.","example[1]":"He loves making fun of women. It makes him feel superior.","example[2]":"a vastly superior (=very much better, stronger etc) army","example[3]":"Your computer is far superior to mine.","note[0]":"superior to","definition[1]":"thinking that you are better than other people – used to show disapproval","example[4]":"She had that superior tone of voice.","definition[2]":"having a higher position or rank than someone else","example[5]":"Don’t you usually salute a superior officer?","example[6]":"a superior court","definition[3]":"of very good quality – used especially in advertising","example[7]":"a superior wine","collocation[0]":"far/vastly/greatly superior","example[8]":"They soon realized that the opposing team’s players were far superior to their own.","collocation[1]":"infinitely superior","example[9]":"You’d be better off visiting the infinitely superior Imperial War Museum.","collocation[2]":"inherently superior","example[10]":"He believed that some races were inherently superior to others.","collocation[3]":"morally superior","example[11]":"They also accuse Christians of pretending to be morally superior.","collocation[4]":"technically superior","example[12]":"Our job is to convince consumers that our product is technically superior to its competitors.","collocation[5]":"superior quality","example[13]":"Digital radios offer a superior quality of sound.","collocation[6]":"superior performance","example[14]":"This boat meets the needs of serious yachtsmen who demand superior performance.","collocation[7]":"superior knowledge/intelligence","example[15]":"She was always showing off her superior knowledge.","collocation[8]":"superior strength/power","example[16]":"He used his superior strength to wrestle Ben to the ground.","explanation[0]":"Something or someone is superior to another thing or person","example[17]":"We can’t say one language is superior to another","bad_example[0]":"superior than","explanation[1]":"Superior already has ‘more’ as part of its meaning","bad_example[1]":"more superior","definition[4]":"someone who has a higher rank or position than you, especially in a job","example[18]":"He had a good working relationship with his immediate superior (=the person directly above him).","definition[5]":"better in quality than other things of the same kind","example[19]":"The agency lets superior apartments and houses to international companies.","example[20]":"Its products are seen as superior to many models produced by its American rival.","definition[6]":"having a higher position or rank than someone or something","example[21]":"Civil servants are accountable for their decisions either tosuperior officers or to the general public.","example[22]":"The case was filed in the Los Angelessuperior court.","definition[7]":"someone with a higher position or rank than another person, especially in a job","example[23]":"Superiors sometimes find it difficult to delegate their authority.","example[24]":"You should communicate clearly both to subordinates  (=people of a lower position or rank) and your superiors."}