{"word[0]":"deceive","definition[0]":"to make someone believe something that is not true","example[0]":"He had been deceived by a young man claiming to be the son of a millionaire.","example[1]":"He tried to deceive the public into thinking the war could still be won.","note[0]":"deceive somebody into doing something","example[2]":"I wouldn’t deceive you about anything as important as this.","note[1]":"deceive somebody about something","explanation[0]":"In everyday English, people usually say trick rather than deceive: ","example[3]":"She thought they were trying to trick her.","definition[1]":"to give someone a wrong belief or opinion about something","example[4]":"Don’t be deceived by the new cover – this is a rehash of old hits.","definition[2]":"to make someone who trusts you believe something that is not true","example[5]":"This was a deliberate attempt to deceive the public.","display[0]":"trick","definition[3]":"to make someone believe something that is not true, in order to get something from them or make them do something","example[6]":"A man posing as an insurance agent had tricked her out of thousands of dollars.","display[1]":"fool","definition[4]":"to make someone believe something that is not true by using a clever but simple trick","example[7]":"His hairpiece doesn’t fool anyone.","display[2]":"mislead","definition[5]":"to make people believe something that is not true, by deliberately not giving them all the facts, or by saying something that is only partly true","example[8]":"The company was accused of misleading customers about the nutritional value of the product.","display[3]":"dupe","definition[6]":"to trick or deceive someone, especially so that they become involved in someone else’s dishonest activity without realizing it","example[9]":"The spies duped government and military officials alike.","display[4]":"con","definition[7]":"to trick someone, especially by telling them something that is not true","example[10]":"I’m pretty good at judging people; I didn’t think he was trying to con me.","definition[8]":"to make someone believe something that is not true in order to get what you want","example[11]":"Postal officials have long deceived the public on how slow mail delivery really is.","example[12]":"Investors were deceived into thinking that their money would be protected.","note[2]":"deceive somebody into something"}