{"word[0]":"analysis","plural[0]":"analyses","definition[0]":"a careful examination of something in order to understand it better","example[0]":"Further analysis of the data is needed.","example[1]":"They were doing some type of statistical analysis.","note[0]":"do/carry out/conduct an analysis","example[2]":"a detailed analysis of the week’s news","note[1]":"analysis of","definition[1]":"the way in which someone describes a situation or problem, and says what causes it to happen","example[3]":"Do you agree with Marx’s analysis of the failure of free-market capitalism?","definition[2]":"a careful examination of a substance to see what it is made of","example[4]":"You’ll get the results when the analysis is complete.","example[5]":"analysis of genetic material","example[6]":"Blood samples were sent for analysis.","note[2]":"for analysis","definition[3]":"a process in which a doctor makes someone talk about their past experiences, relationships etc in order to help them with mental or emotional problems","synonym[0]":"psychoanalysis","example[7]":"She’s been in analysis for three years.","form[0]":"ADJECTIVES/NOUN + analysis","collocation[0]":"a detailed/in-depth analysis","example[8]":"a detailed analysis of the firm’s earnings","collocation[1]":"an in-depth analysis","example[9]":"an in-depth analysis of global warming","collocation[2]":"a careful/close analysis","example[10]":"Students learn to make a close analysis of the texts.","collocation[3]":"a brief analysis","example[11]":"Let’s start with a brief analysis of the situation.","collocation[4]":"statistical analysis","example[12]":"Their research was based on statistical analysis.","collocation[5]":"a critical analysis","example[13]":"Write a critical analysis of the following poem.","collocation[6]":"economic/political/scientific etc analysis","example[14]":"His book provided a scientific analysis of human behaviour.","collocation[7]":"data analysis","example[15]":"the use of databases for data analysis","collocation[8]":"be based on an analysis of something","example[16]":"This work has been based entirely on an analysis of large mammals.","collocation[9]":"do/carry out/perform/conduct an analysis","example[17]":"No similar analysis has been done in this country.","collocation[10]":"provide/produce an analysis","example[18]":"The report provided an analysis of the problems we need to address.","collocation[11]":"an analysis shows something","example[19]":"DNA analysis shows that the blood and the saliva come from the same person.","collocation[12]":"an analysis suggests/indicates something","example[20]":"Our analysis suggests that these problems are widespread.","example[21]":"The researchers carried out a detailed analysis of recent trends in share prices.","example[22]":"different methods of statistical analysis","definition[4]":"someone’s opinion about a situation, after examining it and thinking about it carefully","example[23]":"Many other economists agree with his analysis.","example[24]":"What’s your analysis of the situation?"}