{"word[0]":"witness","signpost[0]":"crime/accident","definition[0]":"someone who sees a crime or an accident and can describe what happened","example[0]":"Police have appealed for witnesses to come forward.","example[1]":"an eye witness (=someone who sees an event) to the robbery","example[2]":"One witness to the accident said the driver appeared to be drunk.","note[0]":"witness to","signpost[1]":"in a court of law","definition[1]":"someone who appears in a court of law to say what they know about a crime or other event","note[1]":"witness for the prosecution/defence (also prosecution/defence witness) (=someone the prosecution or defence lawyers choose as a witness in order to help prove their case)","example[3]":"The defence is expected to call them as witnesses.","example[4]":"the key witness in the case against the brothers","note[2]":"key/star/principal witness","signpost[2]":"signing a document","definition[2]":"someone who is present when an official document is signed, and who signs it too, to say that they saw it being signed","example[5]":"a witness to a will","signpost[3]":"christian belief","definition[3]":"a public statement of strong Christian belief, or someone who makes such a statement","heading[0]":"– Meaning 2: someone who appears in a court of law to say what they know about a crime or other event","form[0]":"ADJECTIVES/NOUN + witness","collocation[0]":"a key witness","example[6]":"Rupert is expected to be a key witness at the trial.","collocation[1]":"a star witness","example[7]":"The judge ruled that the state’s star witness had lied on the stand.","collocation[2]":"a principal witness","example[8]":"The principal witness was too ill to testify.","collocation[3]":"an expert witness","example[9]":"The jury had to choose between the conflicting testimonies of expert witnesses.","collocation[4]":"a character witness","example[10]":"He said he would gladly be a character witness for her.","collocation[5]":"a prosecution witness","example[11]":"During the trial, over thirty prosecution witnesses were called.","collocation[6]":"a defence witness","example[12]":"A defence witness said that Carter was not holding a gun when the shot was fired.","collocation[7]":"a witness for the prosecution/defence","example[13]":"Witnesses for the prosecution have not sounded convincing.","collocation[8]":"call a witness","example[14]":"She was the final witness to be called.","collocation[9]":"question a witness","example[15]":"They were not permitted to question government witnesses.","collocation[10]":"cross-examine a witness","example[16]":"His attorney cross-examined the witness.","collocation[11]":"appear as a witness","example[17]":"He appeared as an expert witness at several government enquiries.","collocation[12]":"a witness testifies","example[18]":"We had two witnesses who testified that they had seen him hitting his wife.","collocation[13]":"a witness gives evidence","example[19]":"Child witnesses gave evidence using closed circuit television cameras.","form[1]":"witness + NOUN","collocation[14]":"the witness box/stand","example[20]":"He spent three hours in the witness stand.","collocation[15]":"the statement/testimony of a witness","example[21]":"The testimony of one witness led to his conviction.","definition[4]":"to see something happen, especially a crime or accident","example[22]":"Several residents claim to have witnessed the attack.","signpost[4]":"experience something","definition[5]":"to experience important events or changes","example[23]":"Priests have witnessed an increase in religious intolerance.","signpost[5]":"time/place","definition[6]":"if a time or place witnesses an event, the event happens during that time or in that place","example[24]":"Recent years have witnessed the collapse of the steel industry.","signpost[6]":"official document","definition[7]":"if you witness the signing of an official document, you are there when it is signed, and sign it yourself to prove this","example[25]":"Will you witness my signature?","definition[8]":"to speak publicly about your Christian beliefs","definition[9]":"someone in a court of law who tells the court what they saw or what they know about a crime","example[26]":"The government’s case rested on one key (=important) witness.","example[27]":"I was asked to testify as a defense witness (=acting to defend the person accused of committing a crime).","example[28]":"the main prosecution witness (=acting to show that the accused person is guilty)","definition[10]":"someone who is present when an official paper is signed and who also signs it to prove this","example[29]":"You will need two witnesses to the signing of the document.","definition[11]":"to be present when someone signs an official document, and to sign it yourself to show this"}