{"word[0]":"cabinet","definition[0]":"the politicians with important positions in a government who meet to make decisions or advise the leader of the government","example[0]":"a cabinet meeting","example[1]":"a member of the Cabinet","explanation[0]":"Cabinet can be followed by a singular or a plural verb","example[2]":"The cabinet has been discussing the plans","example[3]":"The cabinet have been discussing the plans","definition[1]":"a piece of furniture with doors and shelves or drawers, used for storing or showing things","synonym[0]":"cupboard","example[4]":"the medicine cabinet","form[0]":"cabinet + NOUN","example[5]":"A cabinet meeting will consider the government's environmental policies.","collocation[0]":"a cabinet member/a member of the cabinet","example[6]":"Two senior cabinet members have resigned.","collocation[1]":"a cabinet minister","example[7]":"Cabinet ministers voted against the proposal.","collocation[2]":"a cabinet reshuffle","example[8]":"Putin promoted his Defence Minister in a surprising cabinet reshuffle.","collocation[3]":"a cabinet post","example[9]":"She accepted a cabinet post with the new Conservative government.","collocation[4]":"appoint a cabinet","example[10]":"The prime minister appoints the cabinet.","collocation[5]":"form a cabinet","example[11]":"Ministers remain in office until a new cabinet is formed.","collocation[6]":"join a cabinet","example[12]":"Lee was considered a likely candidate to join the cabinet.","collocation[7]":"the cabinet meets","example[13]":"The cabinet will meet again on April 30th.","collocation[8]":"the inner cabinet","example[14]":"He was a member of Howard's inner cabinet.","collocation[9]":"the full cabinet","example[15]":"There was a meeting of the full cabinet.","collocation[10]":"the shadow cabinet","example[16]":"He joined the shadow cabinet as transport spokesman.","definition[2]":"the group of politicians, including the leader of the government, who hold important positions in the government and meet regularly to discuss important issues","example[17]":"a law approved by the prime minister and his cabinet","example[18]":"Cabinet ministers were ordered to reduce the size of their offices."}