{"word[0]":"limitation","definition[0]":"the act or process of controlling or reducing something","example[0]":"a nuclear limitation treaty","example[1]":"Any limitation to the king’s power could be permanent.","note[0]":"limitation to","definition[1]":"qualities that stop someone or something from being as good or as effective as you wish they could be","example[2]":"It’s a good little car, but it has its limitations.","example[3]":"Despite the limitations of the survey, it did suggest some general trends.","note[1]":"limitation of","definition[2]":"a rule or condition that stops something from increasing beyond a particular point","example[4]":"The new law imposes limitations on campaign contributions.","note[2]":"put/place/impose limitations","example[5]":"a limitation on the number of hours children can work","note[3]":"limitation on/upon","heading[0]":"– Meaning 2: qualities that stop someone or something from being as good or as effective as you wish they could be","collocation[0]":"have limitations","example[6]":"The system does have its limitations.","collocation[1]":"place limitations on something","example[7]":"Spending limitations have been placed on the council's housing budget.","collocation[2]":"impose limitations on something","example[8]":"The government has imposed severe limitations on the types of food that can be imported.","collocation[3]":"overcome limitations","example[9]":"Can men and women ever transcend the limitations of their roles?","collocation[4]":"know/recognize limitations","example[10]":"Know your limitations, and don't exercise too hard or you'll get injured.","collocation[5]":"accept the limitations of something","example[11]":"Take pride in your achievements, but accept your limitations.","collocation[6]":"expose/reveal/show something's/somebody's limitations","example[12]":"The film shows his limitations as a actor.","collocation[7]":"severe/serious/important limitations","example[13]":"This approach to the problem has serious limitations.","collocation[8]":"inherent limitations","example[14]":"We recognize the inherent limitations of our research.","collocation[9]":"technical limitations","example[15]":"This odd effect on the film results from technical limitations in the video equipment.","collocation[10]":"physical limitations","example[16]":"He has physical limitations which prevent him from lifting heavy objects.","collocation[11]":"practical limitations","example[17]":"Practical limitations, such as a shortage of equipment, may prevent them from achieving their goal.","collocation[12]":"legal limitations","example[18]":"Certain legal limitations are placed on the scope of Parliament's power.","definition[3]":"when only a certain amount, number etc of something is allowed"}