{"word[0]":"cloud","signpost[0]":"in the sky","definition[0]":"a white or grey mass in the sky that forms from very small drops of water","example[0]":"Dark clouds floated across the moon.","note[0]":"heavy/thick/dense etc clouds","example[1]":"Heavy clouds had gathered over the summit of Mont Blanc.","example[2]":"Visibility was bad due to low cloud.","note[1]":"low/high cloud","signpost[1]":"in the air","definition[1]":"a mass of dust, smoke etc in the air, or a large number of insects flying together","example[3]":"clouds of mosquitoes buzzing around us","example[4]":"A cloud of steam rose into the air.","note[2]":"cloud of dust/smoke/gas etc","signpost[2]":"problem","definition[2]":"something that makes you feel afraid, worried, unhappy etc","example[5]":"Fears of renewed terrorist attacks cast a cloud over the event  (=spoilt the happy situation).","example[6]":"He returned to New York under a cloud of gloom and despair.","example[7]":"The only cloud on the horizon was her mother’s illness.","note[3]":"cloud on the horizon","example[8]":"the cloud of economic recession","note[4]":"cloud of","form[0]":"ADJECTIVES/NOUN + cloud","collocation[0]":"a black/grey cloud","example[9]":"Black clouds usually mean rain.","collocation[1]":"a dark cloud","example[10]":"A dark cloud covered the sun.","collocation[2]":"a white cloud","example[11]":"There was a bright blue sky with a few white clouds.","collocation[3]":"heavy/thick cloud","example[12]":"By midday, heavy clouds had spread across the sky.","example[13]":"The weather was overcast, with heavy low clouds.","collocation[4]":"storm clouds","example[14]":"Dark storm clouds were moving in from the Atlantic.","collocation[5]":"rain clouds","example[15]":"The sky had been full of rain clouds for days.","collocation[6]":"a bank/mass of cloud","example[16]":"A heavy bank of cloud was creeping across the sky.","collocation[7]":"a layer of cloud","example[17]":"The moon was shining through a thin layer of cloud.","collocation[8]":"wisps of cloud","example[18]":"The plane flew through occasional wisps of cloud.","collocation[9]":"a band of cloud","example[19]":"Long narrow bands of cloud stretched across the valley.","collocation[10]":"a blanket of cloud","example[20]":"In the morning, a blanket of cloud still covered the country.","collocation[11]":"a veil of cloud","example[21]":"A thin veil of cloud hid the moon.","collocation[12]":"clouds gather/form","example[22]":"The sky had darkened and clouds had gathered.","collocation[13]":"clouds cover something","example[23]":"For days thick cloud had covered the whole sky.","collocation[14]":"clouds clear/lift","example[24]":"At last the rain had stopped and the clouds had cleared.","collocation[15]":"clouds part","example[25]":"Suddenly the clouds that covered the moon parted.","collocation[16]":"clouds move/roll","example[26]":"A narrow band of cloud has been moving across the country.","collocation[17]":"clouds drift/float","example[27]":"A few clouds drifted across the top of the mountains.","collocation[18]":"clouds race/scud","example[28]":"A wind was blowing and soft clouds were scudding across the sky.","collocation[19]":"clouds hang","example[29]":"Heavy grey clouds hung low in the sky.","form[1]":"cloud + NOUN","collocation[20]":"cloud cover","example[30]":"The cloud cover should disappear by the afternoon.","collocation[21]":"cloud formation","example[31]":"There are many different types of cloud formation.","example[32]":"The storm was still a way off but black clouds were gathering.","example[33]":"Thick cloud obscured the top of the hill.","display[0]":"fog","definition[3]":"very thick cloud near the ground which is difficult to see through","example[34]":"The cars crashed into each other in thick fog.","example[35]":"The fog had lifted  (=disappeared)slightly.","display[1]":"mist","definition[4]":"light cloud near the ground that makes it difficult for you to see very far. Mist is usually not as thick as fog. You often get mist near areas of water or mountains","example[36]":"The morning mist was lifting and the sun was coming up.","example[37]":"A grey mist hung over the water.","example[38]":"The hills were shrouded in mist  (=surrounded by mist).","display[2]":"haze","definition[5]":"smoke, dust, or mist in the air which is difficult to see through","example[39]":"He saw the horses coming towards him through a haze of dust.","example[40]":"The road shimmered in the heat haze.","example[41]":"A pale blue haze hung over the far-off mountains.","display[3]":"smog","definition[6]":"dirty air that looks like a mixture of smoke and fog, caused by smoke from cars and factories in cities","example[42]":"The city is covered in smog for much of the year.","example[43]":"A smog warning was issued for parts of Southern Oregon.","display[4]":"thundercloud","definition[7]":"a large dark cloud that you see before or during a storm","example[44]":"He watched the thunderclouds roll across the valley.","display[5]":"vapour trail","definition[8]":"the white line that is left in the sky by a plane","example[45]":"High overhead, a jet left its vapour trail across the blue sky.","definition[9]":"to make someone less able to think clearly or make sensible decisions","example[46]":"Don’t let your personal feelings cloud your judgement.","note[5]":"cloud somebody’s judgment/mind/vision etc","example[47]":"Fear had clouded his vision.","definition[10]":"if someone’s face or eyes cloud, or if something clouds them, they start to look angry, sad, or worried","example[48]":"Ann’s eyes clouded with the pain.","example[49]":"Then suspicion clouded his face.","definition[11]":"to make something less pleasant or more difficult than it should have been","example[50]":"Her happiness was clouded by having to leave her son behind.","explanation[0]":"Cloud is usually passive in this meaning","definition[12]":"if glass or a liquid clouds, or if something clouds it, it becomes less clear and more difficult to see through","example[51]":"windows clouded up with steam","example[52]":"The water clouded and I could no longer see the river bed.","definition[13]":"to cover something with clouds","example[53]":"Thick mist clouded the mountain tops.","definition[14]":"using or related to cloud computing","example[54]":"cloud storage of data"}