{"definition[0]":"a large group of people who have gathered together to do something, for example to watch something or protest about something","example[0]":"There were crowds of shoppers in the street.","example[1]":"A vast crowd gathered in the main square.","example[2]":"She mingled with the crowd of guests, exchanging greetings.","example[3]":"Saturday’s game was watched by a capacity crowd (=the maximum number of people that a sports ground etc can hold).","example[4]":"Troops fired tear gas and shots to disperse a crowd of 15,000 demonstrators.","example[5]":"a crowd of angry protesters","note[0]":"crowd of","example[6]":"a crowd of 30,000 spectators","definition[1]":"a group of people who know each other, work together etc","example[7]":"I didn’t know him; he wasn’t one of the usual crowd.","collocation[0]":"a crowd gathers","example[8]":"A large crowd had gathered to watch the procession go past.","collocation[1]":"a crowd cheers","example[9]":"The crowd cheered as the team came onto the pitch.","collocation[2]":"a crowd roars","example[10]":"As the band appeared the crowd roared in approval.","collocation[3]":"a crowd surges forward","example[11]":"Police officers began to lose control and the crowd surged forward.","collocation[4]":"a crowd disperses/breaks up","example[12]":"Seeing there would be no more entertainment, the crowd began to disperse.","collocation[5]":"a crowd lines the street/route etc","example[13]":"A crowd lined the street to catch a glimpse of the president.","collocation[6]":"attract/draw a crowd","example[14]":"The ceremony is expected to draw a crowd of more than 1,000.","collocation[7]":"pull a crowd/pull in the crowds","example[15]":"Low prices always pull in the crowds.","collocation[8]":"disperse/break up a crowd","example[16]":"A few warning shots were fired in an attempt to disperse the crowd.","collocation[9]":"mingle/mix with the crowd","example[17]":"The actors went outside to talk to and mingle with the crowd.","collocation[10]":"a big/large/huge crowd","example[18]":"A big crowd is expected tomorrow for the final match.","collocation[11]":"a good crowd","example[19]":"There was a good crowd on the first night of the show.","collocation[12]":"a capacity crowd","example[20]":"The band performed brilliantly to a capacity crowd.","collocation[13]":"a sellout crowd","example[21]":"The team won in front of a sellout crowd of 17,765.","collocation[14]":"a record crowd","example[22]":"They were playing before a record crowd of 50,000.","collocation[15]":"a bumper crowd","example[23]":"As usual there was a bumper crowd at the festival.","collocation[16]":"a crowd of people","example[24]":"I pushed my way through the crowd of people.","collocation[17]":"a crowd of onlookers","example[25]":"A crowd of onlookers had gathered to see what all the fuss was about.","definition[2]":"a large number of people together in one place","example[26]":"The exhibition is expected to attract large crowds of visitors.","display[0]":"mob","definition[3]":"a crowd of noisy and violent people who are difficult to control","example[27]":"The mob set fire to cars and buildings.","display[1]":"mass","definition[4]":"a very large crowd which is not moving and which is very difficult to move through","example[28]":"the mass of people in the station","display[2]":"horde","definition[5]":"a large crowd of people, especially people who are behaving in a way that you disapprove of or that annoys you","example[29]":"the hordes of tourists on the island","display[3]":"droves","definition[6]":"a crowd of people – used especially when you are talking about a crowd of people who move from one place to another","example[30]":"The public came in droves to see the event.","display[4]":"throng","definition[7]":"a very large crowd","example[31]":"A great throng had gathered to listen to his speech.","display[5]":"flock","definition[8]":"a large group of people of the same type, especially when they have a leader","example[32]":"A flock of children were being shown through the museum.","display[6]":"pack","definition[9]":"a group of people of the same type, especially a group you do not approve of","example[33]":"A pack of reporters shouted questions.","display[7]":"swarm","definition[10]":"a large crowd of people who are moving quickly in many directions in a very uncontrolled way","example[34]":"a swarm of children in the playground","display[8]":"crush","definition[11]":"a crowd of people who are pressed close together","example[35]":"There was such a crush on the Metro this morning.","display[9]":"multitude","definition[12]":"a very large number of people, especially ordinary people","example[36]":"The Emperor came out to speak to the multitude.","definition[13]":"if people crowd somewhere, they gather together in large numbers, filling a particular place","example[37]":"Hundreds of people crowded into the church for the funeral.","note[1]":"crowd into","example[38]":"We all crowded round the table.","note[2]":"crowd round/around","example[39]":"the rapid spread of infection in areas where people are crowded together","note[3]":"be crowded together","definition[14]":"if people or things crowd a place, there are a lot of them there","example[40]":"Holidaymakers crowded the beaches.","example[41]":"Range after range of mountains crowd the horizon.","definition[15]":"if thoughts or ideas crowd your mind or memory, they fill it, not allowing you to think of anything else","example[42]":"Strange thoughts and worries were crowding his mind.","definition[16]":"to make someone angry by moving too close to them","example[43]":"Stop crowding me – there’s plenty of room.","definition[17]":"to make someone angry or upset by making too many unfair demands on them"}