{"word[0]":"insist","definition[0]":"to say firmly and often that something is true, especially when other people think it may not be true","example[0]":"Mike insisted that he was right.","note[0]":"insist (that)","example[1]":"His friends insisted he had no connection with drugs.","example[2]":"She kept insisting on her innocence.","note[1]":"insist on something","definition[1]":"to demand that something should happen","example[3]":"Stay for supper – I insist!","example[4]":"They insisted that everyone should come to the party.","note[2]":"insist (that) somebody should do something","example[5]":"He insisted I should take a taxi.","example[6]":"We insist on the highest standards of cleanliness in the hotel.","example[7]":"He insisted upon checking everything himself.","note[3]":"insist on/upon doing something","heading[0]":"GRAMMAR: Patterns with insist","explanation[0]":"You insist on something","example[8]":"She insists on her own bedroom","explanation[1]":"You insist on doing something","example[9]":"She insists on having her own bedroom","bad_example[0]":"She insists her own bedroom","explanation[2]":"In everyday English, you insist that someone does something","example[10]":"I insist that he waits","explanation[3]":"In formal English, you insist that someone do something, using the base form of the verb  (=infinitive without ‘to’)","example[11]":"I insist that he wait","explanation[4]":"You use the base form of the verb when talking about the past  In everyday English, people also say","example[12]":"I insisted that he wait","example[13]":"I insisted that he waited","explanation[5]":"You insist that someone should do something  This pattern is often used in the past, when reporting what someone has insisted","example[14]":"They insisted that I should join them","definition[2]":"to say firmly that someone should do something or that something should happen","example[15]":"She insisted that it was her turn to drive.","display[0]":"demand","definition[3]":"to say very strongly and sometimes angrily that you want something or that something must happen","example[16]":"I wrote a letter to the company, demanding an apology and a refund.","example[17]":"The guards demanded to see her ID.","display[1]":"require","definition[4]":"if you are required to do something, a rule or law says that you must do it","example[18]":"The successful applicant will be required to sign a two-year contract.","display[2]":"be adamant","definition[5]":"to say very firmly that something must happen or is right, and refuse to change your mind when other people try to persuade you","example[19]":"The actress has always been adamant about keeping her private life private.","display[3]":"won’t take no for an answer","definition[6]":"to insist that someone must do what you say or ask","example[20]":"You’re coming home with me – I won’t take no for an answer.","display[4]":"put your foot down","definition[7]":"to say very firmly that someone must not do something","example[21]":"Ed was talking about dropping out of school, but Mom and Dad put their foot down."}