{"word[0]":"discuss","definition[0]":"to talk about something with another person or a group in order to exchange ideas or decide something","example[0]":"Littman refused to discuss the case publicly.","example[1]":"If you would like to discuss the matter further, please call me.","example[2]":"Pupils should be given time to discuss the book with their classmates.","note[0]":"discuss something with somebody","example[3]":"Your accountant will discuss with you how to complete these forms.","note[1]":"discuss what/who/where etc","explanation[0]":"In everyday English, people usually say talk about rather than discuss:","example[4]":"It’s good to be able to talk about these things.","definition[1]":"to talk or write about something in detail and consider different ideas or opinions about it","example[5]":"This topic will be discussed in Chapter 4.","collocation[0]":"discuss the question/subject","example[6]":"We’d never discussed the question of having children.","collocation[1]":"discuss the problem","example[7]":"I suggested going out for a drink to discuss the problem.","collocation[2]":"discuss the matter/issue","example[8]":"The two leaders met to discuss the issue further.","collocation[3]":"discuss a topic","example[9]":"I sometimes let the class choose which topic they want to discuss.","collocation[4]":"discuss the situation","example[10]":"They held a three-hour meeting to discuss the situation.","collocation[5]":"discuss a possibility","example[11]":"Government officials were seriously discussing the possibility of war.","collocation[6]":"discuss a plan/idea","example[12]":"It’s a good idea to discuss your plans with your parents.","collocation[7]":"discuss the future of something","example[13]":"He met the chairman of Nuclear Electric to discuss the future of the nuclear generating industry.","collocation[8]":"discuss the details","example[14]":"Let’s get together soon to discuss the details of the trip.","explanation[1]":"You discuss something with someone","example[15]":"She discussed the idea with her parents","bad_example[0]":"discuss about something","explanation[2]":"You talk about something with someone","example[16]":"She talked about the idea with her parents","display[0]":"debate","explanation[3]":"People debate something","example[17]":"Congress will debate the bill"}