{"word[0]":"tax","definition[0]":"an amount of money that you must pay to the government according to your income, property, goods etc and that is used to pay for public services","example[0]":"He already pays 40% tax on his income.","example[1]":"profits before tax of £85.9m","note[0]":"before/after tax","example[2]":"a tax on fuel","note[1]":"tax on","collocation[0]":"pay tax","example[3]":"Many people feel they are paying too much tax.","collocation[1]":"raise/increase taxes","example[4]":"He claimed the Labour Party would put up taxes.","collocation[2]":"lower/cut/reduce taxes","example[5]":"There’s no point promising to cut taxes if you can’t afford it.","form[0]":"ADJECTIVES/NOUN + tax","example[6]":"Higher taxes will slow down consumer spending.","example[7]":"Republican voters say they want lower taxes and sensible spending cuts.","collocation[3]":"income tax","example[8]":"The rich should pay more income tax.","collocation[4]":"sales tax","example[9]":"We have to pay 15% sales tax on everything we buy.","collocation[5]":"inheritance tax","example[10]":"Inheritance tax applies to the total value of the deceased’s assets.","collocation[6]":"a direct tax","example[11]":"The government’s revenue comes mainly from direct taxes.","collocation[7]":"an indirect tax","example[12]":"The effect of indirect taxes is to raise the prices of goods.","collocation[8]":"a flat (rate) tax","example[13]":"Corporate taxes are to be abolished and replaced by a flat rate tax.","form[1]":"tax + NOUN","collocation[9]":"the tax rate/the rate of tax","example[14]":"The government reduced the basic rate of tax to 25p in the pound.","collocation[10]":"tax cuts","example[15]":"He believes that big tax cuts will encourage economic growth.","collocation[11]":"tax increases","example[16]":"He accused the president of planning the biggest tax increases in US history.","collocation[12]":"tax incentives","example[17]":"We have introduced new tax incentives for savings.","collocation[13]":"a tax allowance","example[18]":"Cutting personal tax allowances penalizes the poor.","collocation[14]":"the tax burden","example[19]":"The total tax burden has risen only slightly.","definition[1]":"money that you must pay to the government, especially from the money you earn, or as an additional payment when you buy something","example[20]":"How much income tax do you pay each month?","example[21]":"The Republicans promised to reduce taxes before the last election.","example[22]":"Consumers are angry that the tax on petrol has gone up yet again.","display[0]":"duty","definition[2]":"a tax you pay on something you buy","example[23]":"The budget also sharply raised the duty on alcohol and tobacco.","example[24]":"customs duty (=tax you pay on goods you buy and bring into the country)","display[1]":"tariff","definition[3]":"a tax on goods coming into a country or going out of a country, especially to protect a country’s industry from cheap goods from other countries","example[25]":"the import tariffs on hi-tech equipment","example[26]":"The government’s tariff and trade policies came under fierce attack.","display[2]":"levy","definition[4]":"an extra amount of money that you have to pay the government, usually as a tax, often in order to encourage people not to use or do something","example[27]":"A new levy on fuel inefficient vehicles has been proposed.","display[3]":"surcharge","definition[5]":"an amount of money that you have to pay in addition to the agreed or stated price of something","example[28]":"British Airways will increase its fuel surcharge on all airline tickets from June 3.","example[29]":"When you get cash at some machines, you have to pay an ATM surcharge.","definition[6]":"to charge a tax on something","example[30]":"Cigarettes are heavily taxed in Britain.","example[31]":"They may be taxed at a higher rate.","note[2]":"tax something at 10%/a higher rate etc","example[32]":"The individual is taxed on the amount of dividend received.","note[3]":"tax somebody on something","definition[7]":"to pay the sum of money charged each year for using a vehicle on British roads","definition[8]":"to make someone have to work hard or make an effort","example[33]":"It shouldn’t tax your brain too much.","example[34]":"The kids are really taxing my patience today.","note[4]":"tax somebody’s patience/strength etc","definition[9]":"an amount of money that you must pay to the government according to your income, property, goods etc, that is used to pay for public services","example[35]":"The President said he would cut taxes for middle-income America.","example[36]":"a government plan to raise taxes in order to reduce the budget deficit","example[37]":"Consumer spending declined 0.3% in October, and after-tax income rose 0.2%.","example[38]":"a tax on sales of cigarettes","definition[10]":"to make a person or organization pay tax","example[39]":"Traditionally, state authorities have taxed the rich far more lightly than the federal government.","example[40]":"Shareholders get taxed on the dividends they receive.","note[5]":"get/be taxed on"}