{"word[0]":"catch","past_tense[0]":"caught","signpost[0]":"take and hold","definition[0]":"to get hold of and stop an object such as a ball that is moving through the air","example[0]":"Stephen leapt up and caught the ball in one hand.","example[1]":"‘Pass me that pen, would you?’ ‘Here you are. Catch!’","example[2]":"The kids were throwing and catching a Frisbee down on the beach.","definition[1]":"to suddenly take hold of someone or something with your hand","example[3]":"He caught her elbow to steady her.","example[4]":"Miss Perry caught hold of my sleeve and pulled me back.","signpost[1]":"find/stop somebody","definition[2]":"to stop someone after you have been chasing them and not let them get away","example[5]":"‘You can’t catch me!’ she yelled, running away.","definition[3]":"to find a criminal or enemy and stop them from escaping","example[6]":"State police have launched a massive operation to catch the murderer.","example[7]":"If you go back to the city, you’re bound to get caught.","signpost[2]":"see somebody doing something","definition[4]":"to see someone doing something that they did not want you to know they were doing","example[8]":"He was caught red-handed (=as he was doing something wrong) taking money from the cash register.","example[9]":"The gang was caught in the act of unloading the cigarettes.","note[0]":"catch somebody in the act (of doing something)","example[10]":"I caught him reading my private letters.","note[1]":"catch somebody doing something","example[11]":"Gemma turned around and caught the stranger looking at her intently.","example[12]":"We knew he’d been cheating, but we’d never caught him at it before.","note[2]":"catch somebody at it","definition[5]":"to get an infectious disease","example[13]":"Anton caught malaria in Mali, and nearly died.","example[14]":"Many young people are still ignorant about how HIV is caught.","example[15]":"Don’t stand out in the rain. You’ll catch your death.","note[3]":"catch your death (of cold)","example[16]":"Typhoid and cholera are often caught from contaminated water supplies.","note[4]":"catch something from/off somebody/something","example[17]":"I caught chicken pox off my friend at school.","signpost[3]":"animal/fish","definition[6]":"to trap an animal or fish by using a trap, net, or hook, or by hunting it","example[18]":"Did you catch any fish?","example[19]":"Early settlers caught rabbits and squirrels and even rats in order to survive.","signpost[4]":"not miss somebody/something","definition[7]":"to not be too late to do something, see something, talk to someone etc","opposite[0]":"miss","note[5]":"catch the post British English (=post letters in time for them to be collected that day)","example[20]":"I managed to catch her just as she was leaving.","example[21]":"I just caught the last few minutes of the documentary.","example[22]":"Tumours like these can be treated quite easily if they’re caught early enough.","signpost[5]":"get stuck","definition[8]":"if your hand, finger, clothing etc catches or is caught in something, it gets stuck in it accidentally","example[23]":"His overalls caught in the engine.","example[24]":"Her microphone was forever getting caught on her clothes.","signpost[6]":"hear","definition[9]":"to manage to hear a sound","example[25]":"I caught the muffled thud of a car door slamming in the street.","signpost[7]":"do/see something","definition[10]":"to go somewhere in order to do or see something","example[26]":"We could catch a movie (=go to a movie).","example[27]":"M Records caught his act and signed him immediately.","signpost[8]":"describe well","definition[11]":"to show or describe the character or quality of something well in a picture, piece of writing etc","synonym[0]":"capture","example[28]":"a novel that catches the mood of post-war Britain","signpost[9]":"burn","definition[12]":"if something catches fire, it starts to burn accidentally","example[29]":"Two farm workers died when a barn caught fire.","definition[13]":"if a fire catches, it starts to burn","example[30]":"For some reason the charcoal wasn’t catching.","definition[14]":"to hit someone in or on a particular part of their body","example[31]":"The punch caught him right in the face.","definition[15]":"if a container catches liquid, it is in a position where the liquid falls into it","example[32]":"Place the baking sheet under the muffin pan to catch the drips.","signpost[10]":"shine","definition[16]":"if the light catches something or if something catches the light, the light shines on it","example[33]":"The sunlight caught her hair and turned it to gold.","definition[17]":"if something catches the wind or the wind catches something, it blows on it","example[34]":"Gary swung the sail round to catch the light wind.","definition[18]":"to end a player’s innings in cricket by catching the ball that is hit off their bat before it touches the ground","definition[19]":"to be the catcher in a game of baseball","definition[20]":"to stop someone who is trying to escape, especially by running after them and then holding them","example[35]":"He raced after her, but he couldn’t catch her.","example[36]":"The police caught the bank robbers after a car chase through the city.","display[0]":"arrest","definition[21]":"if the police arrest someone, they take him or her to a police station because they think that person has done something illegal","example[37]":"Wayne was arrested for dangerous driving.","example[38]":"The police arrested him and charged him with murder.","display[1]":"apprehend","definition[22]":"if the police apprehend someone they think has done something illegal, they catch him or her","example[39]":"The two men were later apprehended after they robbed another store.","example[40]":"The killers were never apprehended.","example[41]":"All of the kidnappers were apprehended and convicted.","definition[23]":"to catch an enemy or a criminal in order to keep them as a prisoner","example[42]":"The French king was captured by the English at the Battle of Poitiers in 1356.","example[43]":"The gunmen were finally captured after a shoot-out with the police.","display[2]":"take somebody prisoner","definition[24]":"to catch someone, especially in a war, in order to keep them as a prisoner","example[44]":"350 soldiers were killed and another 300 taken prisoner.","example[45]":"Ellison was taken prisoner by the Germans during the retreat to Dunkirk.","display[3]":"trap","definition[25]":"to make someone go to a place from which they cannot escape, especially by using your skill and intelligence","example[46]":"Police trapped the man inside a bar on the city’s southside.","display[4]":"corner","definition[26]":"to force someone into a place from which they cannot escape","example[47]":"He was cornered outside the school by three gang members.","definition[27]":"an act of catching a ball that has been thrown or hit","example[48]":"Hey! Nice catch!","definition[28]":"a hidden problem or difficulty","example[49]":"This deal looks too good to be true – there must be a catch somewhere.","example[50]":"The catch is that you can’t enter the competition unless you’ve spent $100 in the store.","note[6]":"the catch is (that)","definition[29]":"a hook or something similar for fastening a door or lid and keeping it shut","definition[30]":"a quantity of fish that has been caught at one time","definition[31]":"a simple game in which two or more people throw a ball to each other","example[51]":"Let’s go outside and play catch.","definition[32]":"to be in a situation that is difficult to escape from","example[52]":"The government is caught in the middle of the dispute.","example[53]":"The yen was caught in a downward spiral.","definition[33]":"to happen when you are not expecting it or not ready to deal with it","example[54]":"The sharp turn in share prices caught many investors by surprise.","example[55]":"Many oil companies were caught flatfooted when oil prices fell sharply with the start of the Gulf War.","definition[34]":"if a business catches a cold, it begins to have financial problems","example[56]":"With the economic downturn, the recruitment industry will catch a cold."}