{"word[0]":"decline","definition[0]":"a decrease in the quality, quantity, or importance of something","example[0]":"the economic decline faced by many cities","example[1]":"a rapid decline in unemployment","note[0]":"rapid/sharp/steep/dramatic decline","example[2]":"The island’s population initially numbered 180, but there was a gradual decline until only 40 people were left.","note[1]":"steady/gradual/long-term decline","example[3]":"The port fell into decline in the 1950s.","note[2]":"fall/go etc into decline","example[4]":"There has been a decline in the size of families.","note[3]":"decline in","example[5]":"the decline of manufacturing","note[4]":"decline of","example[6]":"the widely held belief that educational standards are in decline ","note[5]":"in decline/on the decline","collocation[0]":"sharp/steep","example[7]":"The higher prices caused a sharp decline in sales.","example[8]":"We noticed a rapid decline in his health.","collocation[1]":"dramatic","example[9]":"The last three years have seen a dramatic decline in the number of tigers in the area.","collocation[2]":"marked","example[10]":"Hunting led to a marked decline in bird numbers.","collocation[3]":"gradual","example[11]":"After 1870, there was a gradual decline of the disease.","collocation[4]":"steady/progressive","example[12]":"There has been a steady decline in club membership.","collocation[5]":"a long-term decline","example[13]":"The long-term decline in the manufacturing industry is still continuing.","collocation[6]":"economic/industrial etc decline","example[14]":"This area has been severely affected by long-term industrial decline.","collocation[7]":"cause/lead to a decline","example[15]":"The use of agricultural chemicals has led to a decline in water quality.","collocation[8]":"go/fall into decline","example[16]":"At the beginning of the century the cloth trade was going into decline.","collocation[9]":"suffer a decline","example[17]":"The firm suffered a sharp decline in its profits.","collocation[10]":"stop/halt a decline","example[18]":"These measures are intended to halt the decline in fish populations.","collocation[11]":"reverse a decline","example[19]":"The main aim is to reverse the decline of the world’s environment.","collocation[12]":"see a decline","example[20]":"The 20th century saw a steady decline in the rural population.","definition[1]":"to decrease in quantity or importance","example[21]":"Spending on information technology has declined.","example[22]":"Car sales have declined by a quarter.","example[23]":"After the war, the city declined in importance.","signpost[0]":"say no","definition[2]":"to say no politely when someone invites you somewhere, offers you something, or wants you to do something","example[24]":"Offered the position of chairman, Smith declined, preferring to keep his current job.","example[25]":"Mary declined a hot drink and went to her room.","example[26]":"Mary declined Jay’s invitation to dinner.","note[6]":"decline an offer/invitation etc","example[27]":"The court declined to review her case.","note[7]":"decline to do something","example[28]":"The minister declined to comment (=refused to speak to people who report the news) about the progress of the peace talks.","signpost[1]":"become worse","definition[3]":"to become gradually worse in quality","synonym[0]":"deteriorate","example[29]":"Her health has been declining progressively for several months.","example[30]":"Qualified staff are leaving and standards are declining.","definition[4]":"if a noun, pronoun, or adjective declines, its form changes according to whether it is the subject, object etc of a sentence","definition[5]":"if you decline a noun, pronoun, or adjective, you show the various forms that it can take","definition[6]":"if an industry or country declines, it becomes less profitable, productive, wealthy etc","example[31]":"This type of business is a declining sector of the UK.","definition[7]":"if sales, profits, production etc decline, they become less","example[32]":"As profitability declines, people have started to leave farming.","definition[8]":"when sales, profits, production etc become less","example[33]":"Exports had collapsed, causing a sharp decline in national income.","example[34]":"The increase in profit came despite a decline in sales.","definition[9]":"when an industry or country becomes less profitable, productive, wealthy etc","example[35]":"The decline in the province’s manufacturing sector is worrying.","example[36]":"a false and damaging picture of a nation in decline"}