{"word[0]":"grace","signpost[0]":"way of moving","definition[0]":"a smooth way of moving that looks natural, relaxed, and attractive","synonym[0]":"gracefulness","example[0]":"Lena moved with the grace of a dancer.","definition[1]":"polite and pleasant behaviour","example[1]":"The hotel maintains traditional standards of elegance, style, and grace.","example[2]":"He didn’t even have the grace to apologize  (=he was not polite enough to apologize).","note[0]":"have the grace to do something","definition[2]":"the skills needed to behave in a way that is considered polite and socially acceptable","example[3]":"Max definitely lacked social graces.","signpost[1]":"more time","definition[3]":"more time that is allowed to someone to finish a piece of work, pay a debt etc","example[4]":"I got a few days’ grace to finish my essay.","note[1]":"a day’s/week’s etc grace","signpost[2]":"god’s kindness","definition[4]":"God’s kindness that is shown to people","example[5]":"We are saved by God’s grace.","signpost[3]":"prayer","definition[5]":"a prayer thanking God, said before a meal","example[6]":"My father said grace.","signpost[4]":"soul","definition[6]":"the state of someone’s soul when it is free from evil, according to Christian belief","example[7]":"He died in a state of grace (=when God has forgiven you for the wrong things you have done).","definition[7]":"to make a place or an object look more attractive","example[8]":"His portrait graces the wall of the drawing room.","definition[8]":"additional time that is allowed before a payment must be made","example[9]":"Paraguay was granted a new period of 20 years, with eight years’ grace, for the payment of its $436 million debt to Brazil.","example[10]":"They have a grace period of ten years on the payment.","definition[9]":"when someone or something suddenly becomes much less successful or much less popular","example[11]":"Philadelphia’s economy has escaped the fall from grace seen in other Northeastern cities.","definition[10]":"to become suddenly much less successful or much less popular","example[12]":"As drug stocks fell from grace, prices of oil stocks rose."}