{"word[0]":"tide","definition[0]":"a current of water caused by the tide","example[0]":"Strong tides make swimming dangerous.","definition[1]":"the way in which events or people’s opinions are developing","note[0]":"swim with/against the tide (=support or oppose what most people think)","example[1]":"It was their first major victory. The tide had turned (=changed).","example[2]":"The tide of battle turned against the Mexican army.","example[3]":"With the tide of public opinion against him, the president may lose.","note[1]":"tide of","definition[2]":"a large amount of something that is increasing and is difficult to control","example[4]":"She swallowed back a tide of emotion.","example[5]":"efforts to stem the tide of hysteria caused by the shootings  (=prevent it from getting worse)","example[6]":"The crisis prompted a rising tide of protest.","note[2]":"tide of violence/crime etc","definition[3]":"a large number of people or things moving along together","example[7]":"the tide of refugees flowing over the border","collocation[0]":"the tide is in","example[8]":"You can’t walk on the beach when the tide is in.","collocation[1]":"the tide is out","example[9]":"Let’s go for a walk along the beach while the tide is out.","collocation[2]":"high tide","example[10]":"At high tide the island is completely cut off.","collocation[3]":"low tide","example[11]":"The sands are exposed at low tide.","collocation[4]":"the incoming tide","example[12]":"The box was carried upstream on the incoming tide.","collocation[5]":"the rising tide","example[13]":"The rising tide had begun to fill up the channel.","collocation[6]":"an ebb tide","example[14]":"We sailed out to sea on the ebb tide.","collocation[7]":"a flood tide","example[15]":"The wind drove the yacht inland on the flood tide.","collocation[8]":"a spring tide","example[16]":"It must be a spring tide.","collocation[9]":"a neap tide","example[17]":"Spring tides alternate with neap tides.","collocation[10]":"the tide comes in","example[18]":"Once the tide comes in, the cove is cut off.","collocation[11]":"the tide goes out","example[19]":"They sat on the beach watching the tide going out.","collocation[12]":"the tide turns","example[20]":"Soon, the tide would turn and the waves would begin to creep inshore again.","collocation[13]":"be cut off by the tide","example[21]":"Two anglers had to be rescued after getting cut off by the tide.","definition[4]":"a type of detergent for washing clothes, sold especially in the US"}