{"comparative[0]":"shorter","superlative[0]":"shortest","definition[0]":"happening or continuing for only a little time or for less time than usual","example[0]":"a short meeting","example[1]":"Morris gave a short laugh.","example[2]":"a short course on business English","example[3]":"Winter is coming and the days are getting shorter.","example[4]":"I’ve only been in Brisbane a short time.","example[5]":"For a short while (=a short time), the city functioned as the region’s capital.","example[6]":"I learned a lot during my short period as a junior reporter.","example[7]":"Germany achieved spectacular economic success in a relatively short period of time.","example[8]":"They met and married within a short space of time.","example[9]":"I promise to keep the meeting short and sweet (=short in a way that is good, especially not talking for a long time).","example[10]":"For a few short weeks  (=they seemed to pass very quickly), the sun shone and the fields turned gold.","signpost[0]":"length/distance","definition[1]":"measuring a small amount in length or distance","example[11]":"a short skirt","example[12]":"Anita had her hair cut short.","example[13]":"They went by the shortest route, across the fields.","example[14]":"Carol’s office was only a short distance away, and she decided that she would walk there.","example[15]":"It’s a short drive to the airport.","note[0]":"a short walk/flight/drive","example[16]":"The hotel is only a short walk from the beach.","signpost[1]":"not tall","definition[2]":"someone who is short is not as tall as most people","opposite[0]":"tall","example[17]":"a short plump woman","example[18]":"Chris was short and stocky, with broad shoulders.","example[19]":"He’s a bit shorter than me.","signpost[2]":"book/letter","definition[3]":"a book, letter etc that is short does not have many words or pages","example[20]":"a short novel","example[21]":"I wrote a short note to explain.","signpost[3]":"not enough","definition[4]":"if you are short of something, you do not have enough of it","note[1]":"I’m a bit short British English spoken (=I haven’t got much money at the moment)","example[22]":"Our libraries are short of funds.","note[2]":"be short of money/cash/funds","example[23]":"Have you all paid me? I’m about £9 short.","note[3]":"be 5p/$10 etc short","example[24]":"Your little girl’s not short of confidence, is she?","note[4]":"somebody is not short of something","example[25]":"They’re not short of a few bob (=they are rich).","example[26]":"Can you lend me a couple of dollars? I’m a little short.","note[5]":"be short (of something)","definition[5]":"if something is short, there is not enough of it","example[27]":"Money was short in those days.","example[28]":"It’s going to be difficult – time is short.","example[29]":"Gasoline was in short supply (=not enough of it was available) after the war.","signpost[4]":"less than","definition[6]":"a little less than a number","example[30]":"She was just short of six feet tall.","note[6]":"just/a little short of something","example[31]":"Her time was only two seconds short of the world record.","note[7]":"short of","definition[7]":"a short vowel is pronounced quickly without being emphasized, for example the sound of a in ‘cat’, e in ‘bet’, and i in ‘bit’","example[32]":"I bought a beautiful short dress","bad_example[0]":"I bought a short beautiful dress","example[33]":"She has short black hair","bad_example[1]":"She has black short hair","definition[8]":"not long","example[34]":"I lived in Tokyo for a short time.","example[35]":"Smokers have a shorter life expectancy than non-smokers.","definition[9]":"lasting only for a short time. Brief is more formal than short, and is used especially in written English","example[36]":"The president will make a brief visit to Seattle today.","example[37]":"He coached Hingis for a brief period in the 1990s.","definition[10]":"taking a short time to do something","example[38]":"I had a quick look at the map.","example[39]":"He had a quick shower and then went out.","display[0]":"short-lived","definition[11]":"lasting only for a short time – used especially when someone wishes that a good situation had been able to last for longer","example[40]":"short-lived success","example[41]":"The ceasefire was short-lived.","example[42]":"a short-lived romance","example[43]":"short-lived optimism about the economy","display[1]":"fleeting","definition[12]":"lasting only for an extremely short time – used especially when someone wishes that something had been able to last for longer","example[44]":"a fleeting visit","example[45]":"a fleeting smile","example[46]":"She caught a fleeting glimpse of him.","example[47]":"a fleeting moment of happiness","example[48]":"a fleeting thought","display[2]":"momentary","definition[13]":"lasting for a very short time – used especially about feelings or pauses","example[49]":"There was a momentary pause in the conversation.","example[50]":"The momentary panic ended when he found his two-year-old son waiting happily outside the store.","display[3]":"passing","definition[14]":"lasting only for a short time – used especially when people are only interested in something or mention something for a short time","example[51]":"passing fashions","example[52]":"He made only a passing reference to war.","example[53]":"It’s just a passing phase (=it will end soon).","display[4]":"ephemeral","definition[15]":"lasting only for a short time, and ending quickly like everything else in this world","example[54]":"Beauty is ephemeral.","example[55]":"the ephemeral nature of our existence","example[56]":"His wealth proved to be ephemeral.","example[57]":"He was a short fat man.","display[5]":"not very tall","definition[16]":"quite short. This phrase sounds more gentle than saying that someone is short","example[58]":"She wasn’t very tall – maybe about 1.60 m.","definition[17]":"short and with a small body","example[59]":"My mother was a small woman.","example[60]":"The girl was quite small for her age  (=smaller than other girls of the same age).","display[6]":"petite","definition[18]":"used about a woman who is attractively short and thin","example[61]":"She was a petite woman with blonde hair.","display[7]":"stocky","definition[19]":"used about a boy or man who is short, heavy, and strong","example[62]":"Harry was stocky and middle-aged.","display[8]":"dumpy","definition[20]":"short and fat","example[63]":"a dumpy girl with red hair","display[9]":"diminutive","definition[21]":"very short or small – used especially in descriptions in novels","example[64]":"a diminutive figure dressed in black","display[10]":"stubby","definition[22]":"stubby fingers or toes are short and thick","example[65]":"the baby’s stubby little fingers","definition[23]":"a short film shown in the cinema","definition[24]":"a strong alcoholic drink that is not beer or wine, drunk in a small glass","example[66]":"Do you fancy a short?","definition[25]":"a short circuit","example[67]":"a short in the system","definition[26]":"to short-circuit, or make something do this","example[68]":"The toaster shorted and caused a fire.","definition[27]":"not having as much of something as there should be or as much as you need","example[69]":"Have you all paid me? I’m still about £9 short.","example[70]":"The insurance fund was running short of cash.","definition[28]":"if someone is short of stock, they have sold shares that they do not yet own, believing that the price will fall before the shares have to be delivered","definition[29]":"if someone sells bonds, shares, currencies etc short, they sell bonds etc that they do not yet own believing that the price will fall so that they can be bought more cheaply before they have to be delivered","example[71]":"traders who sell short","definition[30]":"to sell bonds, shares, currencies etc that you do not own, believing that their value will fall and that you will be able to buy them more cheaply before they have to be delivered","example[72]":"These money managers go short, making bets that certain stocks will decline.","definition[31]":"to sell shares that you do not yet own, believing that the price will fall so that the shares can be bought more cheaply before they have to be delivered","example[73]":"Many were actually shorting the market, betting prices would fall."}