{"word[0]":"understanding","definition[0]":"knowledge about something, based on learning or experience","example[0]":"If you know the neighbourhood, you have an understanding of what the children are like.","example[1]":"Linguists currently have little understanding of the exact cause of language change.","example[2]":"How can we gain an understanding of other cultures?","example[3]":"Over time, you will get a far better understanding of the job.","example[4]":"Success depends on a clear understanding of the problem.","example[5]":"a basic understanding of AIDS prevention","example[6]":"How does this add to our understanding of the problem?","note[0]":"understanding of","definition[1]":"an unofficial or informal agreement","example[7]":"We had an understanding that Jean-Claude should never be mentioned.","example[8]":"My father was furious at first, but eventually we came to an understanding.","note[1]":"come to/reach an understanding","definition[2]":"the ability to understand people’s behaviour and to forgive them when they do something wrong","example[9]":"The principal listened to the boy’s story with sympathy and understanding.","collocation[0]":"have an understanding","example[10]":"The authorities don’t seem to have a clear understanding of the problem.","collocation[1]":"gain/get/develop an understanding","example[11]":"Scientists continued to gain a greater understanding of the effects of radiation.","collocation[2]":"deepen/broaden an understanding","example[12]":"It is hoped that the research will broaden our understanding of the disease.","collocation[3]":"increase/improve/enhance somebody’s understanding","example[13]":"The classes really helped to increase our understanding of the subject.","collocation[4]":"a better/greater/deeper understanding","example[14]":"All of this will lead to a better understanding of the overseas market.","collocation[5]":"a clear understanding","example[15]":"Before you begin, it is vital that you have a clear understanding of what you want to achieve.","collocation[6]":"a complete/thorough/full understanding","example[16]":"The degree gives students a thorough understanding of issues relating to housing.","collocation[7]":"a proper/real understanding","example[17]":"They lacked any real understanding of the subject.","collocation[8]":"a good understanding","example[18]":"The sales force has a good understanding of the market.","collocation[9]":"a basic understanding","example[19]":"The aim of the examination is to test basic understanding of the written language.","collocation[10]":"a limited understanding","example[20]":"We have only a limited understanding of how the brain processes this information.","definition[3]":"sympathetic and kind about other people’s problems","example[21]":"Luckily, I have a very understanding boss."}