{"word[0]":"actor","definition[0]":"someone who performs in a play or film","note[0]":"character actor (=an actor who takes unusual or interesting roles)","example[0]":"She has starred with many leading actors.","note[1]":"leading/principal actor","collocation[0]":"a good/fine/great actor","example[1]":"He had a reputation as a fine actor.","collocation[1]":"a well-known/famous actor","example[2]":"I’d really like to be a famous actor.","collocation[2]":"a professional/amateur actor","example[3]":"It isn’t easy to become a successful professional actor.","collocation[3]":"the leading/principal actor","example[4]":"Schwarzenegger was one of Hollywood’s leading actors.","collocation[4]":"a supporting actor","example[5]":"She was awarded an Oscar for Best Supporting Actor.","collocation[5]":"a talented/accomplished actor","example[6]":"Jacobsen was one of the most accomplished actors of his generation.","collocation[6]":"a comic actor","example[7]":"He was a comic actor and he always got a laugh.","collocation[7]":"a classical actor","example[8]":"a drama school that trains classical actors","form[0]":"NOUN + actor","collocation[8]":"a movie/film/screen/Hollywood actor","example[9]":"the movie actor Brad Pitt","collocation[9]":"a stage actor","example[10]":"Most stage actors are very badly paid.","collocation[10]":"a television/TV actor","example[11]":"For several years he had small parts as a television actor.","collocation[11]":"a comedy actor","example[12]":"Jason was voted top TV comedy actor.","collocation[12]":"a character actor","example[13]":"As a character actor you get interesting parts.","example[14]":"Her son wants to be an actor.","example[15]":"Both my parents are actors.","display[0]":"actress","definition[1]":"a woman who performs in a play or film. Many women prefer to be called actors rather than actresses","example[16]":"Who was the actress who played Jane Eyre?","example[17]":"She’s one of my favourite actresses.","display[1]":"star","definition[2]":"a famous actor","example[18]":"Julia Roberts is a famous Hollywood star.","example[19]":"The hotel is popular with movie stars.","display[2]":"the star","definition[3]":"someone who plays the most important part in a play or film","example[20]":"Daniel Radcliffe is the star of the ‘Harry Potter’ films.","display[3]":"co-star","definition[4]":"one of two or more famous actors who have important parts in a play or film","example[21]":"Her co-star Jodie Foster won the Best Actress Award.","display[4]":"the lead","definition[5]":"the main acting part in a play or film","example[22]":"He will play the lead in a new version of ‘Dracula’.","display[5]":"extra","definition[6]":"an actor in a film who does not say anything but is part of a crowd","example[23]":"She started her career as an extra in TV soap operas.","display[6]":"understudy","definition[7]":"an actor who learns a part in a play so that they can act the part if the usual actor is ill","example[24]":"Vanessa had flu, and her place was taken by her understudy, Miss Lisa Fennell.","heading[0]":"a group of actors","display[7]":"the cast","definition[8]":"all the actors in a play or film","example[25]":"Other members of the cast include Johnny Depp and Danny DeVito.","example[26]":"She will head the cast  (=she will have the most important part).","display[8]":"company","definition[9]":"a group of actors who perform plays together","example[27]":"In 2006, he joined the Royal Shakespeare Company.","example[28]":"The play will be performed by an all-female company."}