{"word[0]":"allowance","definition[0]":"an amount of money that you are given regularly or for a special purpose","example[0]":"Sales staff get a generous mileage allowance or a company car.","example[1]":"If you are entitled to sickness allowance, you must claim it from your employer.","example[2]":"His father gives him a monthly allowance of £200.","note[0]":"a monthly/annual etc allowance","example[3]":"Do you get an allowance for clothes?","note[1]":"allowance for","definition[1]":"an amount of something that is acceptable or safe","example[4]":"the recommended daily allowance of Vitamin C","example[5]":"Passengers’ baggage allowance is 75 pounds per person.","definition[2]":"an amount of money that you can earn without paying tax on it","example[6]":"a new tax allowance","definition[3]":"a small amount of money that a parent regularly gives to a child","definition[4]":"something that you consider when deciding what is likely to happen, what you should expect etc","example[7]":"The budget makes allowances for extra staff when needed.","note[2]":"make (an) allowance/make allowances (for something)","example[8]":"There is always an allowance in insurance premiums for whether someone smokes or not.","definition[5]":"an amount of money that someone is given regularly or for a special reason","example[9]":"She earns a package worth $1 million, including a $15,000 clothing allowance.","definition[6]":"an amount that a company thinks it may lose in the future, and includes in its accounts as a PROVISION","example[10]":"The company has made an increase in its allowance for bad debt.","definition[7]":"an amount of money that a person can earn without paying tax on it","definition[8]":"a maximum amount of goods that you can buy without paying tax on them when taking them into another country","example[11]":"They may introduce higher sales taxes on purchases above the duty-free allowance.","definition[9]":"an amount that can be taken off a business’s profit figure when calculating tax. Allowances are often used to encourage particular business decisions, such as spending on new machinery","definition[10]":"a reduction in price given to retailers by manufacturers or WHOLESALERs","example[12]":"The company had to give retailers special allowances so they could lower the price."}