{"word[0]":"all","definition[0]":"the whole of an amount, thing, or type of thing","example[0]":"Have you done all your homework?","example[1]":"They were quarrelling all the time (=very often or continuously).","example[2]":"Hannah didn’t say a single word all the way back home  (=during the whole of the journey).","example[3]":"I’ve heard it all before.","example[4]":"She’d given up all hope of having a child.","example[5]":"He had worked all his life in the mine.","note[0]":"all your life/all day/all year etc","example[6]":"The boys played video games all day.","example[7]":"Almost all of the music was from Italian operas.","note[1]":"all of","definition[1]":"every one of a number of people or things, or every thing or person of a particular type","example[8]":"Someone’s taken all my books!","example[9]":"Will all the girls please stand over here.","example[10]":"All children should be taught to swim.","example[11]":"Sixteen per cent of all new cars sold in Western Europe these days are diesel-engined.","example[12]":"They all speak excellent English.","example[13]":"important changes that will affect all of us","definition[2]":"the only thing or things","example[14]":"All you need is a hammer and some nails.","example[15]":"All I’m asking for is a little respect.","definition[3]":"everything","example[16]":"I’m doing all I can to help her.","example[17]":"I hope all is well with you.","example[18]":"All was dark and silent down by the harbour wall.","definition[4]":"used to emphasize that you mean the greatest possible amount of the quality you are mentioning","example[19]":"Can any of us say in all honesty that we did everything we could?","heading[0]":"GRAMMAR: Patterns with all","explanation[0]":"You use all the or all of the when talking about every one of a particular group of people or things","example[20]":"All the students have gone home","example[21]":"All of the students have gone home","explanation[1]":"You use all directly before a plural noun to mean every person or thing of a particular type","example[22]":"All men are created equal","example[23]":"All children like chocolate","heading[1]":"USAGE: All, everyone","example[24]":"Everyone liked the film","example[25]":"They all liked the film","bad_example[0]":"All people liked the film","explanation[2]":"You use everyone when talking about all of the members of a group of people  they all or we all when this group is the subject of the sentence","example[26]":"They want to protect the rights of all people","explanation[3]":"You use all people when talking about every person in the world","example[27]":"All people who take part in sport should have regular check-ups","example[28]":"Almost all people with the disease have smoked at some time in their lives","explanation[4]":"You use all people with a relative clause or that clause, which shows which group of people you are talking about","type[0]":"always + adj/adverb/preposition","example[29]":"You shouldn’t be sitting here by yourself, all alone.","example[30]":"a strange woman, dressed all in black","example[31]":"If people want more freedom of choice, then I’m all for it  (=I strongly support it).","example[32]":"‘It was a dreadful experience.’ ‘Never mind, it’s all over (=completely finished) now.’","example[33]":"You’re getting me all confused.","definition[5]":"consisting of or made of only one kind of thing","example[34]":"an all-male club","example[35]":"an all-wool coat"}