{"signpost[0]":"flames that destroy things","definition[0]":"uncontrolled flames, light, and heat that destroy and damage things","example[0]":"The warehouse was completely destroyed by fire.","example[1]":"Thirty people died in a fire in downtown Chicago.","example[2]":"Police think that the fire was started deliberately.","example[3]":"Rioters set fire to a whole row of stores  (=made them start burning).","example[4]":"Within minutes, the entire building was on fire.","note[0]":"on fire","bad_example[0]":"in fire","signpost[1]":"flames for heating/cooking etc","definition[1]":"burning material used to heat a room, cook food etc, or get rid of things you do not want","example[5]":"You put up the tent and I’ll make a fire.","example[6]":"Can you help me light the fire?","example[7]":"The fire has almost gone out  (=stopped burning).","example[8]":"They all sat around the camp fire, singing songs.","example[9]":"The fire was still smouldering in the grate  (=there was a little smoke and it had almost stopped burning).","example[10]":"Come and sit by the fire.","note[1]":"by the fire/in front of the fire","example[11]":"They dried their clothes in front of an open fire.","signpost[2]":"heating equipment","definition[2]":"a machine that produces heat to warm a room, using gas or electricity as power","note[2]":"turn the fire up/down (=make it hotter or colder)","example[12]":"a gas fire","example[13]":"an electric fire","example[14]":"Turn on the fire, I’m cold.","note[3]":"turn the fire on/off","signpost[3]":"shooting","definition[3]":"shots fired from a gun, especially many guns at the same time","example[15]":"Troops opened fire on (=started shooting at) the demonstrators.","example[16]":"These women did vital work, often under enemy fire.","example[17]":"The rebels agreed to hold their fire (=not shoot).","definition[4]":"a very strong emotion that makes you want to think about nothing else","example[18]":"the fire of religious fanaticism","note[4]":"fire of","heading[0]":"– Meaning 1: uncontrolled flames, light, and heat that destroy and damage things","collocation[0]":"start a fire","example[19]":"The fire may have been started by a cigarette.","collocation[1]":"set fire to something/set something on fire","example[20]":"A candle fell over, setting fire to the curtains.","collocation[2]":"something catches fire","example[21]":"The boat caught fire and sank.","collocation[3]":"put out a fire","example[22]":"Firemen successfully extinguished the fire.","collocation[4]":"fight a fire","example[23]":"Further attempts to fight the fire were abandoned.","collocation[5]":"a fire burns","example[24]":"The fire was burning more strongly every minute.","collocation[6]":"a fire breaks out","example[25]":"A fire broke out in the engine room.","collocation[7]":"a fire goes out","example[26]":"After several hours, the fire eventually went out.","collocation[8]":"a fire rages/blazes","example[27]":"Fires were raging in the forest near Magleby.","collocation[9]":"a fire spreads","example[28]":"The fire spread to the house next door.","collocation[10]":"something is damaged/destroyed by fire","example[29]":"The school was badly damaged by fire.","collocation[11]":"be on fire","example[30]":"The whole house was on fire within minutes.","collocation[12]":"bring a fire under control","example[31]":"Firefighters took more than an hour to bring the fire under control.","form[0]":"ADJECTIVES/NOUN + fire","collocation[13]":"a big/major fire","example[32]":"A big fire was raging at the fuel depot.","collocation[14]":"a forest fire","example[33]":"Greece has suffered many forest fires this year.","collocation[15]":"a brush fire","example[34]":"There were frequent brush fires during the hot dry summers.","collocation[16]":"a house fire","example[35]":"Faulty electrical wiring is being blamed for a house fire.","heading[1]":"– Meaning 2: burning material used to heat a room, cook food etc, or get rid of things you do not want","collocation[17]":"make/build a fire","example[36]":"He found wood to make a fire.","collocation[18]":"start/light a fire","example[37]":"It was too damp to light a fire.","collocation[19]":"put something on the fire","example[38]":"Put another log on the fire.","collocation[20]":"cook something over a fire","example[39]":"They cooked strips of meat over a wood fire.","collocation[21]":"a fire smoulders","example[40]":"The fire was smouldering in the grate.","collocation[22]":"a fire dies down","example[41]":"The fire slowly died down.","collocation[23]":"an open fire","example[42]":"Sophie warmed herself by the open fire.","collocation[24]":"a roaring fire","example[43]":"I sat by the roaring fire and dried off.","collocation[25]":"a camp fire","example[44]":"In the evening we sat around the camp fire.","collocation[26]":"a coal/wood/log fire","example[45]":"There was a coal fire in the sitting room.","example[46]":"She lit the gas fire and settled in front of the TV.","collocation[27]":"a real fire","example[47]":"There was a real fire blazing in the fireplace.","collocation[28]":"the embers of a fire","example[48]":"He stared at the glowing embers of the fire.","definition[5]":"flames that burn in an uncontrolled way and destroy or damage things","example[49]":"In April, a fire at the school destroyed the science block.","display[0]":"flames","definition[6]":"the bright parts of a fire that you see burning in the air","example[50]":"The flames from the burning building were lighting up the night sky.","display[1]":"blaze","definition[7]":"a large and dangerous fire – used especially in news reports","example[51]":"Firemen fought to keep the blaze under control.","display[2]":"inferno","definition[8]":"an extremely large and dangerous fire which is out of control – used especially in news reports","example[52]":"The entire building was on fire and hundreds of people were trapped in the inferno.","display[3]":"conflagration","definition[9]":"a very large fire that destroys a lot of buildings, trees etc","example[53]":"The conflagration spread rapidly through the old town.","signpost[4]":"shoot","definition[10]":"to shoot bullets or bombs","example[54]":"the sound of a gun being fired","note[5]":"fire a gun/weapon/rifle etc","example[55]":"Guerrillas fired five rockets at the capital yesterday, killing 23 people.","note[6]":"fire bullets/missiles/rockets etc","example[56]":"Soldiers fired on the crowd.","note[7]":"fire at/on/into","example[57]":"The police fired two shots at the suspects before they surrendered.","note[8]":"fire something at somebody","definition[11]":"to force someone to leave their job","example[58]":"She didn’t want to get fired.","note[9]":"be/get fired","example[59]":"I’ve just been fired from my job, and I don’t know what to do.","note[10]":"fire somebody from something","example[60]":"The airline fired him for being drunk.","note[11]":"fire somebody for something","signpost[5]":"excite","definition[12]":"to make someone feel interested in something and excited about it","synonym[0]":"inspire","example[61]":"I was fired with enthusiasm to go traveling in Asia.","note[12]":"be fired with enthusiasm","example[62]":"stories of magic and adventure that fire children’s imaginations","note[13]":"fire somebody’s enthusiasm/imagination","signpost[6]":"clay","definition[13]":"to bake bricks, clay pots etc in a kiln","example[63]":"fired earthenware","signpost[7]":"engine","definition[14]":"if a vehicle’s engine fires, the petrol is lit to make the engine work","definition[15]":"to make someone leave their job, especially because they have done something wrong","example[64]":"He was fired for surfing the Internet during work time.","example[65]":"Harris was caught stealing, and was dismissed from his job.","display[4]":"sack/give somebody the sack","definition[16]":"to make someone leave their job, especially because they are not good at it, or because they have done something wrong","example[66]":"Bates was sacked from his job after the team failed to win any games.","example[67]":"His boss gave him the sack for taking too much time off work.","display[5]":"lay somebody off","definition[17]":"to make a lot of workers, especially workers in a large factory or organization, leave their jobs, because there is not enough work for them to do, or not enough money to pay their wages","example[68]":"3000 car workers have been laid off at the factory in Cleveland.","display[6]":"make somebody redundant","definition[18]":"to make someone leave their job because they are no longer needed","example[69]":"5 staff will be made redundant at the end of this month.","display[7]":"let somebody go","definition[19]":"to make someone leave their job, Used by employers to avoid saying directly that they are getting rid of people","example[70]":"We’ve had to let two members of staff go.","display[8]":"discharge","definition[20]":"to make someone leave their job in the army, air force etc","example[71]":"Grant had been discharged from the navy for threatening an officer.","display[9]":"ease somebody out","definition[21]":"to make someone leave their job in a way that makes it seem as if they have chosen to leave","example[72]":"He had been eased out of office in an attempt to prevent a political crisis.","display[10]":"relieve somebody of their post/position","definition[22]":"to make someone leave their job because they have done something wrong – used especially to avoid saying this directly, and also when the job is a powerful one","example[73]":"The colonel and two other senior officers were relieved of their posts.","definition[23]":"to dismiss someone from their job","synonym[1]":"SACK","example[74]":"Lee Iacocca worked his way up to the presidency of Ford Motor Company, from which he was abruptly fired by Henry Ford II.","example[75]":"The government aimed to sell off state assets and fire about 80,000 workers."}