{"signpost[0]":"touch somebody/something hard","definition[0]":"to touch someone or something quickly and hard with your hand, a stick etc","example[0]":"He raised the hammer and hit the bell.","example[1]":"The robbers hit him over the head with a baseball bat.","note[0]":"hit somebody/something with something","signpost[1]":"crash into something","definition[1]":"to move into something or someone quickly and with force","example[2]":"The tanks exploded as the plane hit the ground.","example[3]":"He was hit by a car.","signpost[2]":"hurt yourself","definition[2]":"to move a part of your body quickly against something accidentally, causing pain","synonym[0]":"bang","example[4]":"The ceiling’s low, so be careful you don’t hit your head.","example[5]":"She slipped and hit her head on the sidewalk.","note[1]":"hit something on/against something","definition[3]":"if you hit a ball or other object, you make it move forward quickly by hitting it with a bat, stick etc","example[6]":"Hit the ball as hard as you can.","definition[4]":"to get points by hitting a ball in a game such as baseball or cricket","example[7]":"Last year, Griffey hit 49 home runs.","definition[5]":"to press a part in a machine, car, etc to make it work","example[8]":"Maria hit the brakes just in time.","definition[6]":"to attack something or wound someone with a bomb, bullet etc","example[9]":"Our ship was badly hit and sank within minutes.","example[10]":"A second shot hit her in the back.","example[11]":"The bomb failed to hit its target.","signpost[3]":"affect badly","definition[7]":"if something bad hits a place or a person, it suddenly happens and affects people badly","example[12]":"The village has been hit by a devastating drought.","example[13]":"Hurricane Louis is expected to hit at the weekend.","example[14]":"The south of the country is the worst hit by the recession.","example[15]":"The company has been hard hit by the drop in consumer confidence.","note[2]":"be badly/severely/hard hit","signpost[4]":"have problems","definition[8]":"to experience trouble, problems etc","example[16]":"My father hit a bad patch, and had to sell the house.","note[3]":"hit a snag/problems/a bad patch etc","signpost[5]":"reach a level/number","definition[9]":"to reach a particular level or number","example[17]":"Sales have hit the 1 million mark.","example[18]":"Earnings hit a peak in the early 1980s.","note[4]":"hit a peak/an all-time high etc","example[19]":"Oil prices have hit rock-bottom.","note[5]":"hit rock-bottom/an all-time low etc","signpost[6]":"realize","definition[10]":"if a fact hits you, you suddenly realize its importance and feel surprised or shocked","example[20]":"It’s impossible to pinpoint a moment when it hit me that I was ‘a success’.","example[21]":"He was gone before they knew what had hit them  (=realized what had happened).","signpost[7]":"smell/sight etc","definition[11]":"if a smell or sight hits you, you suddenly smell or see it","example[22]":"The smell of stale smoke hit him as he entered.","definition[12]":"to arrive at a place","example[23]":"They hit the main road two kilometres further on.","example[24]":"I’ll look for work as soon as I hit town.","note[6]":"hit town","heading[0]":"to hit someone","definition[13]":"to hit someone quickly and hard with your hand, a stick etc","example[25]":"He hit him hard in the stomach.","example[26]":"I don’t like to see people hitting a dog.","display[0]":"beat","definition[14]":"to hit someone deliberately many times, especially very hard","example[27]":"The girl had been beaten to death.","example[28]":"He was beating the donkey with a stick.","display[1]":"strike","definition[15]":"to hit someone with your hand or a weapon. Strike  is more formal than hit and is mainly used in written English","example[29]":"Her husband struck her twice across the face.","example[30]":"Police say that the man had been struck on the head.","display[2]":"punch","definition[16]":"to hit someone hard with your closed hand, especially in a fight","example[31]":"I punched him on the nose.","example[32]":"She was screaming and punching him with her fists.","display[3]":"thump","definition[17]":"to punch someone very hard","example[33]":"Sometimes I just want to thump him.","display[4]":"beat somebody up","definition[18]":"to hurt someone badly in a violent attack, by hitting them many times","example[34]":"If I tell the police, they'll beat me up.","example[35]":"He had been beaten up and tortured with lighted cigarettes.","display[5]":"slap","definition[19]":"to hit someone with your open hand, especially because you are angry with them","example[36]":"They had a big row and she ended up slapping him.","display[6]":"spank","definition[20]":"to hit someone, especially a child, with your open hand in order to punish them","example[37]":"Should a parent ever smack a child?","example[38]":"I don’t agree with smacking.","example[39]":"In those days, children were spanked if they behaved badly.","heading[1]":"to hit something","example[40]":"Jack hit the ball and it flew over the fence.","display[7]":"knock","definition[21]":"to hit a door or window with your closed hand in order to attract the attention of the people inside","example[41]":"Someone was knocking on the door.","example[42]":"I knocked loudly but no one came.","definition[22]":"to hit a surface. Strike is more formal than hit and is mainly used in written English","example[43]":"The ball struck the side of the goal.","display[8]":"whack","definition[23]":"to hit something very hard","example[44]":"Edmonds whacked the ball into the air.","display[9]":"bash","definition[24]":"to hit something hard, especially in a way that causes damage","example[45]":"The police had to bash the door down to get in.","display[10]":"tap","definition[25]":"to gently hit something with your fingers, often in order to attract someone’s attention","example[46]":"I tapped him on the shoulder.","example[47]":"I heard someone tapping on the window.","display[11]":"rap","definition[26]":"to knock quickly or hit something several times","example[48]":"He rapped the table with his pen to bring the meeting to order.","example[49]":"Two police officers rapped on the door at 7 o'clock in the morning.","definition[27]":"to suddenly hit something hard, in a way that makes a loud noise","example[50]":"Her father banged his fist down on the table angrily.","example[51]":"The door suddenly banged shut.","display[12]":"pound","definition[28]":"to hit something many times with a lot of force","example[52]":"I could hear the sea pounding on the rocks.","example[53]":"She pounded on the door and shouted wildly.","display[13]":"hammer","definition[29]":"to hit something quickly many times making a loud continuous noise","example[54]":"The rain was hammering on the roof.","example[55]":"A crowd of people were outside hammering on the door angrily.","heading[2]":"to hit something accidentally","example[56]":"I’ve got a bad bruise where I hit my leg against the table.","example[57]":"The car hit a tree.","display[14]":"bump","definition[30]":"to hit a part of your body against something, especially because you do not see or notice it","example[58]":"Careful you don’t bump your head – the ceiling’s very low.","display[15]":"bang/bash","definition[31]":"to hit something hard, so that you hurt yourself or damage something","example[59]":"He banged into the car in front.","example[60]":"I bashed my knee climbing over a gate.","example[61]":"She fell and bashed her chin on the ground.","display[16]":"stub","definition[32]":"to hit your toe against something and hurt it","example[62]":"I stubbed my toe on the piano leg.","definition[33]":"something such as a film, play, song etc that is very popular and successful","example[63]":"the hit musical ‘The Phantom of the Opera’","note[7]":"a hit single/show/record etc","example[64]":"The Beatles’ greatest hits.","note[8]":"a big/smash/number 1 etc hit","example[65]":"Which band had a hit with ‘Bohemian Rhapsody’?","example[66]":"It’s hoped the new museum will be a big hit with families.","note[9]":"be a hit with somebody","signpost[8]":"hit something","definition[34]":"an occasion when something that is aimed at something else touches it, reaches it, or damages it","example[67]":"Our ship took a direct hit and sank.","definition[35]":"an occasion when someone visits a website","example[68]":"The site had 2,000 hits in the first week.","definition[36]":"a result of a computer search, especially on the Internet","example[69]":"thousands of irrelevant hits","definition[37]":"a feeling of pleasure obtained from taking an illegal drug","definition[38]":"a murder that has been arranged to happen","example[70]":"Profits should hit $23 million this year.","example[71]":"The company’s shares hit a 52-week high of $34 last Friday.","definition[39]":"to have a bad effect on something","example[72]":"Strikes hit several ports in Australia last month.","example[73]":"The industry has beenbadly hit by the rise in oil prices.","example[74]":"A number of computer retail chains have beenhit hard by the recession.","definition[40]":"when a RECESSION hits, it begins","example[75]":"A final blow to the company came when the recession hit in 1990.","definition[41]":"to become available for people to buy","example[76]":"This new generation of computers is expected to hit the market some time next year.","definition[42]":"to be very successful and make a lot of money","example[77]":"The company hit the jackpot with its New Kids range of clothing.","definition[43]":"something that is extremely popular and successful","example[78]":"Their latest computer game has been abig hit with customers.","example[79]":"The group is currently on tour promoting its latesthit single.","definition[44]":"if a person or organization takes a hit, they suffer from a problem","example[80]":"The construction industry took a serious hit as jobs declined by 37,000 during the first 10 months of the year.","definition[45]":"if a company takes a hit in its financial results, it pays a CHARGE (=a cost related to a particular event, usually one that is not repeated in later periods of time)","example[81]":"The bank took a huge hit in charges to clean up the mess in its African subsidiaries.","definition[46]":"an occasion when someone looks at a particular WEBSITE on the Internet","example[82]":"The Winter Olympics website had over 600 million hits in 16 days."}