{"word[0]":"appear","signpost[0]":"seem","definition[0]":"used when saying how someone or something seems. Appear is more formal than seem","example[0]":"Police have found what appear to be human remains.","example[1]":"He tried to make it appear that she had committed suicide.","example[2]":"It may be less useful than it first appears.","example[3]":"‘Have they gone?’ ‘So it would appear.’","note[0]":"so it would appear","example[4]":"The diamonds appeared to be genuine.","note[1]":"appear to be something","example[5]":"The research appears to show that the drug is effective in most cases.","note[2]":"appear to do something","example[6]":"He didn't appear to me to be a violent man.","note[3]":"appear to somebody","example[7]":"It appears that all the files have been deleted.","note[4]":"it appears (that)","example[8]":"There appears to be some kind of problem.","note[5]":"there appear(s) to be something","example[9]":"During the interview she appeared calm and relaxed.","note[6]":"appear + adj","example[10]":"I don’t want to appear rude.","explanation[0]":"Appear is a linking verb This type of verb links the subject of the sentence with an adjective or noun","explanation[1]":"Appear is not used in the progressive in this meaning You say","example[11]":"He appears to be unhappy","bad_example[0]":"He is appearing to be unhappy","signpost[1]":"start to be seen","definition[1]":"to start to be seen, to arrive, or to exist in a place, especially suddenly","example[12]":"Two faces appeared at our window.","example[13]":"A man suddenly appeared from behind a tree.","example[14]":"Small cracks appeared in the wall.","example[15]":"It was nearly an hour before Sweeney appeared in the pub.","example[16]":"The car seemed to appear from nowhere.","note[7]":"appear from nowhere/out of nowhere","signpost[2]":"film/tv programme etc","definition[2]":"to take part in a film, play, concert, television programme etc","note[8]":"appear at a theatre etc","example[17]":"She has already appeared in a number of films.","note[9]":"appear in a film/play","example[18]":"He appeared on national television to deny the claims.","note[10]":"appear on television/stage","signpost[3]":"book/newspaper etc","definition[3]":"to be written or shown on a list, in a book or newspaper, in a document etc","example[19]":"The story appeared in all the national newspapers.","example[20]":"Some of the material used has appeared in print before  (=has been published).","signpost[4]":"available/known","definition[4]":"to become widely available or known about","example[21]":"The new range will be appearing in shops in the autumn.","example[22]":"New courses are appearing every year.","signpost[5]":"law court/meeting","definition[5]":"to go to a law court or other official meeting to give information, answer questions etc","example[23]":"The three men are due to appear in court tomorrow.","example[24]":"She appeared before Colchester magistrates charged with attempted murder.","note[11]":"appear before a court/judge/committee etc","example[25]":"Sir Nicholas Gammon QC appeared on behalf of the defendant.","note[12]":"appear for somebody/on behalf of somebody","definition[6]":"to start to be seen, especially suddenly","example[26]":"A few small white clouds appeared on the horizon.","display[0]":"pop up","definition[7]":"to appear very suddenly","example[27]":"A woman’s face popped up from the other side of the fence.","display[1]":"become visible","definition[8]":"to gradually start to be able to be seen","example[28]":"The shape of the baby’s head gradually became visible on the screen.","display[2]":"come into view","definition[9]":"if something comes into view, you start to see it as you move closer to it, or it gets closer to you","example[29]":"The white cliffs of Dover came into view.","display[3]":"come out","definition[10]":"if the sun, moon, or the stars come out, they suddenly appear","example[30]":"The sun came out from behind a cloud.","display[4]":"loom/loom up","definition[11]":"if a large frightening object or person looms, they appear suddenly","example[31]":"The dark shape of the castle loomed up out of the mist.","example[32]":"The man’s face suddenly loomed over him.","display[5]":"resurface","definition[12]":"to appear again after being lost or missing","example[33]":"The girl’s father has resurfaced after six years of no contact."}