{"word[0]":"field","signpost[0]":"farm","definition[0]":"an area of land in the country, especially one where crops are grown or animals feed on grass","example[0]":"a view of green fields and rolling hills","example[1]":"working in the cotton fields","note[0]":"corn/rice/wheat etc field","example[2]":"a field of wheat","note[1]":"field of","signpost[1]":"subject","definition[1]":"a subject that people study or an area of activity that they are involved in as part of their work","example[3]":"Peter’s an expert in his field.","example[4]":"He’s the best-known American outside the field of (=not connected with) politics.","example[5]":"her work in the field of human rights","definition[2]":"an area of ground where sports are played","example[6]":"the local soccer field","note[2]":"a baseball/football/cricket etc field","example[7]":"The team have had a bad year, both on and off the field.","note[3]":"on/off the field","example[8]":"Fans cheered as the players took the field (=went onto the field).","signpost[2]":"practical work","definition[3]":"work or study that is done in the field is done in the real world rather than in a class or laboratory","note[4]":"field trials/testing/research etc","example[9]":"His theories have not yet been tested in the field.","note[5]":"in the field","signpost[3]":"competitors","definition[4]":"all the people, companies, products etc that are competing against each other","example[10]":"the field of candidates for the election","example[11]":"Germany was leading the field with a figure of 53%.","note[6]":"be ahead of/lead the field","definition[5]":"all the horses or runners in a race","example[12]":"Prince led the field (=was ahead of the others) as they came around the final bend.","definition[6]":"in a computer document, an amount of space made available for a particular type of information","example[13]":"an empty field  (=not yet written in)","form[0]":"ADJECTIVES/NOUN + field","collocation[0]":"a corn/wheat/rice etc field","example[14]":"In summer the rice fields were lush and green.","collocation[1]":"an open field","example[15]":"I saw a fox run across the open field.","collocation[2]":"a green field","example[16]":"All around the house were green fields and rolling hills.","collocation[3]":"an arable field","example[17]":"Barley was growing in the arable fields surrounding the castle.","collocation[4]":"a cultivated field","example[18]":"The valley is an area of lush greenery and cultivated fields.","collocation[5]":"a ploughed field","example[19]":"It was difficult walking across the ploughed field.","collocation[6]":"a field of corn/wheat/rice etc","example[20]":"The road was surrounded by fields of corn.","collocation[7]":"plough a field","example[21]":"The farmer was using a tractor to plough the field.","collocation[8]":"work in the fields","example[22]":"Most villagers work in the fields during the day.","collocation[9]":"cross a field","example[23]":"We crossed the field and came to the barn.","collocation[10]":"walk across a field","example[24]":"I walked across the field to the gate.","collocation[11]":"cows/horses etc graze in a field","example[25]":"Cattle were grazing in the field below.","example[26]":"a wheat field","example[27]":"Cows were grazing in the field.","display[0]":"meadow","definition[7]":"a field with wild grass and flowers","example[28]":"alpine meadows","display[1]":"paddock","definition[8]":"a small field in which horses are kept","example[29]":"Horses are much happier in a big paddock with several other horses.","display[2]":"pasture","definition[9]":"land or a field that is covered with grass and is used for cattle, sheep etc to feed on","example[30]":"large areas of rough upland pasture","example[31]":"cow pastures","definition[10]":"if you field a team, an army etc, they represent you or fight for you in a competition, election, or war","example[32]":"The Ecology Party fielded 109 candidates.","example[33]":"We fielded a team of highly talented basketball players.","definition[11]":"to answer questions, telephone calls etc, especially when there are a lot of them or the questions are difficult","example[34]":"The Minister fielded questions on the Middle East.","example[35]":"The press office fielded numerous calls from the media.","definition[12]":"if you field the ball in a game of cricket or baseball, you stop it after it has been hit","definition[13]":"a British magazine which has articles about the countryside, farming, and sports such as polo and cricket. Most people in the UK think The Field is read by rich people who live in the country or own a lot of land there.","definition[14]":"a subject that people study or are involved in as part of their work","example[36]":"We are looking for graduates with degrees in artificial intelligence, languages and related fields.","example[37]":"Until recently, NEC was alone in the field of wireless communication.","definition[15]":"studies, testing etc that are done in the field are done in the real world rather than in a LABORATORY, factory etc","example[38]":"We need someone who can test the drilling machinery in the field.","definition[16]":"a large area where coal, oil etc is found","example[39]":"Even the largest oil corporations have to rely on external finance to develop new oil fields.","definition[17]":"a space made available for a particular kind of information","example[40]":"The database contains 10 free-text fields.","definition[18]":"to deal with a question, enquiry, telephone call etc, usually successfully","example[41]":"He fielded several angry calls from franchisees asking for their money back."}