{"word[0]":"conscience","definition[0]":"the part of your mind that tells you whether what you are doing is morally right or wrong","note[0]":"prisoner of conscience (=someone in prison because of their beliefs)","example[0]":"Well, at least I can face them all with a clear conscience (=the knowledge that you have done nothing wrong).","example[1]":"I can’t tell you what to do – it’s a matter of conscience (=something you must make a moral judgement about).","example[2]":"a crisis of conscience among medical staff  (=a situation in which it is very difficult to decide what is the right thing to do)","example[3]":"It was his guilty conscience that made him offer to help.","note[1]":"a guilty/troubled conscience","definition[1]":"a guilty feeling that you have about something bad you have done","example[4]":"Ian felt a pang of conscience at having misjudged her.","note[2]":"twinge/pang of conscience","example[5]":"They’ve no conscience at all about cheating.","note[3]":"have no conscience (about something)","collocation[0]":"a clear conscience","example[6]":"I was able to answer his questions with a clear conscience.","example[7]":"His guilty conscience kept him awake at night.","collocation[1]":"a social conscience","example[8]":"The writer’s strong social conscience is obvious in all his novels.","collocation[2]":"a moral conscience","example[9]":"At what age do children develop a moral conscience?","collocation[3]":"the public conscience","example[10]":"This scandal shocked the public conscience.","collocation[4]":"the individual conscience","example[11]":"Decisions like this are a matter for the individual conscience.","collocation[5]":"the human conscience","example[12]":"The human conscience is a product of civilization.","collocation[6]":"have a clear/guilty etc conscience","example[13]":"Does he have a guilty conscience about his role in the crime?","collocation[7]":"wrestle/struggle with your conscience","example[14]":"She wrestled with her conscience for weeks before deciding not to leave him.","collocation[8]":"prick somebody’s conscience","example[15]":"Some of the things he’d done still pricked his conscience.","collocation[9]":"be a matter of conscience","example[16]":"Whether you vote or not is a matter of conscience.","collocation[10]":"a crisis of conscience","example[17]":"He had a crisis of conscience about whether to take on the legal case.","collocation[11]":"the voice of conscience","example[18]":"Other leaders urged him to listen to the voice of conscience and hold free elections.","collocation[12]":"a prisoner of conscience","example[19]":"Vaclav Havel was a prisoner of conscience who later became president of Czechoslovakia."}