{"word[0]":"subject","signpost[0]":"thing talked about","definition[0]":"the thing you are talking about or considering in a conversation, discussion, book, film etc","example[0]":"Paul has strong opinions on most subjects.","example[1]":"The subjects covered in this chapter are exercise and nutrition.","example[2]":"While we’re on the subject of money, do you have the $10 you owe me?","example[3]":"Truffaut’s childhood memories were the subject of his first film.","note[0]":"subject of","signpost[1]":"at school","definition[1]":"an area of knowledge that you study at a school or university","example[4]":"My favorite subject is math.","signpost[2]":"in art","definition[2]":"the thing or person that you show when you paint a picture, take a photograph etc","example[5]":"Monet loved to use gardens as his subjects.","signpost[3]":"in a test","definition[3]":"a person or animal that is used in a test or experiment","example[6]":"The subjects of this experiment were all men aged 18–35.","definition[4]":"a noun, noun phrase, or pronoun that usually comes before a main verb and represents the person or thing that performs the action of the verb, or about which something is stated, for example ‘she’ in ‘She hit John’ or ‘elephants’ in ‘Elephants are big’","signpost[4]":"citizen","definition[5]":"someone who was born in a country that has a king or queen, or someone who has a right to live there","example[7]":"a British subject","collocation[0]":"discuss/talk about a subject","example[8]":"Have you discussed the subject with your husband?","collocation[1]":"change the subject","example[9]":"She tried to change the subject.","collocation[2]":"mention a subject","example[10]":"The subject was not mentioned again.","collocation[3]":"deal with/cover a subject","example[11]":"The subject is dealt with in great detail in his previous book.","collocation[4]":"touch on a subject","example[12]":"In his speech, he touched on the subject of death.","collocation[5]":"bring up/raise a subject","example[13]":"You brought the subject up, not me.","collocation[6]":"get onto a subject","example[14]":"We somehow got onto the subject of detective stories.","collocation[7]":"broach a subject","example[15]":"She hesitated, wondering exactly how to broach the subject of their sleeping arrangements.","collocation[8]":"get back to a subject","example[16]":"Somehow I just knew in the end we would get back to the subject of money.","collocation[9]":"drop a subject","example[17]":"To her relief, Julius dropped the subject.","collocation[10]":"avoid/keep off/stay off a subject","example[18]":"I knew he was trying to avoid the subject of drugs.","example[19]":"She hoped that Anna would keep off the subject of Luke for the next few hours.","collocation[11]":"get somebody off a subject","example[20]":"It was difficult to get him off the subject of cars.","collocation[12]":"a subject comes up","example[21]":"The subject of payment never came up.","collocation[13]":"an interesting/fascinating subject","example[22]":"Fame is a fascinating subject.","collocation[14]":"a difficult/complex subject","example[23]":"Immigration is a complex subject.","collocation[15]":"a controversial subject","example[24]":"The content of the curriculum has become a controversial subject.","collocation[16]":"a sensitive/touchy subject","example[25]":"Steer clear of complicated issues or sensitive subjects.","collocation[17]":"a delicate subject","example[26]":"She carefully avoided discussing the delicate subject of money.","collocation[18]":"a taboo subject","example[27]":"For them, death was not a taboo subject.","collocation[19]":"a subject of/for discussion","example[28]":"TV is a favourite subject for discussion.","collocation[20]":"a subject of conversation","example[29]":"She searched for a new subject of conversation.","collocation[21]":"a subject of/for debate","example[30]":"The reason for the increased risk of cancer is still a subject of debate.","collocation[22]":"a subject of controversy","example[31]":"Nuclear power is still the subject of considerable controversy.","collocation[23]":"a subject area","example[32]":"He has written a lot in this subject area.","definition[6]":"a subject country, state, people etc are strictly governed by another country","example[33]":"subject peoples","definition[7]":"to force a country or group of people to be ruled by you, and control them very strictly","definition[8]":"used to say that something is affected, or can be affected, by something","example[34]":"Withdrawals are subject to a withholding tax of between 10% and 30%.","example[35]":"Dealers convicted of felony charges will be subject to suspension.","definition[9]":"dependent on something else","example[36]":"The proposed transaction is subject to shareholder approval.","example[37]":"A deal has been struck, subject to contract (=it is not final until the contract has been signed).","definition[10]":"used in insurance contracts to describe a situation in which a property has been insured for less than its real value, and the insured person has to pay for part of any loss","example[38]":"In the event of under-insurance, the settlement would be subject to average."}