{"word[0]":"inquiry","plural[0]":"inquiries","definition[0]":"a question you ask in order to get information","note[0]":"help the police with their inquiries British English (=to answer questions about a crime)","example[0]":"I don’t know who sent the gift, but I’ll make some inquiries.","example[1]":"We’re getting a lot of inquiries about our new London–Rio service.","note[1]":"inquiry about","example[2]":"inquiries from potential applicants","note[2]":"inquiry from","definition[1]":"the act or process of asking questions in order to get information","note[3]":"scientific/intellectual inquiry","example[3]":"On further inquiry, it emerged that Malcolm had not been involved in the incident.","example[4]":"The local council set up a committee of inquiry to look into policing arrangements.","definition[2]":"an official process to find out about something","example[5]":"The Civil Aviation Authority has agreed to hold an inquiry into the accident.","note[4]":"launch/set up/hold an inquiry (into something)","example[6]":"The police have launched a murder inquiry.","example[7]":"Parents have called for an independent inquiry into the accident.","example[8]":"a judicial inquiry into the deaths","note[5]":"inquiry into","heading[0]":"– Meaning 1: a question you ask in order to get information","collocation[0]":"make an inquiry","example[9]":"The police are making inquiries to discover the cause of the accident.","collocation[1]":"get/have an inquiry","example[10]":"We’ve already had a lot of inquiries about membership of the new sports centre.","collocation[2]":"receive an inquiry","example[11]":"The television station has received several inquiries from viewers requesting a repeat of the programme.","collocation[3]":"handle/deal with an inquiry","example[12]":"Staff will be available to deal with inquiries.","collocation[4]":"answer an inquiry","example[13]":"The government has not yet answered our inquiry.","collocation[5]":"a general inquiry","example[14]":"There is a need for a general inquiry into the train company’s safety standards.","collocation[6]":"a specific inquiry","example[15]":"His job is to answer specific inquiries by individuals or groups.","collocation[7]":"a written inquiry","example[16]":"I submitted a written inquiry to the local council.","collocation[8]":"a flood/stream of inquiries","example[17]":"The special offer has produced a flood of inquiries from interested customers.","heading[1]":"– Meaning 3: an official process to find out about something","collocation[9]":"hold an inquiry","example[18]":"The government has refused to hold an inquiry into the incident.","collocation[10]":"launch/set up an inquiry","example[19]":"Police launched an inquiry yesterday after a man was killed by a patrol car.","form[0]":"ADJECTIVES/NOUN + inquiry","collocation[11]":"an official inquiry","example[20]":"The outcome of the official inquiry will be eagerly awaited.","collocation[12]":"a public inquiry","example[21]":"MPs are demanding a public inquiry into the explosion at the nuclear power station.","collocation[13]":"an independent inquiry","example[22]":"The Labour Party is calling for an independent inquiry into the conduct of the police.","collocation[14]":"a police inquiry","example[23]":"The case has been reopened with a police inquiry.","collocation[15]":"a judicial inquiry","example[24]":"Calls for a judicial inquiry into the affair are growing louder.","collocation[16]":"a government inquiry","example[25]":"A government inquiry was set up into discipline in schools.","collocation[17]":"a murder inquiry","example[26]":"Police say they haven’t launched a murder inquiry at this stage.","collocation[18]":"an accident inquiry","example[27]":"The accident inquiry revealed that the accident had been caused by human error.","collocation[19]":"a parliamentary/congressional inquiry","example[28]":"The report of a parliamentary inquiry into the drugs trade is published today.","example[29]":"He has received a flood of telephone inquiries from small investors.","example[30]":"customers who call in just to make inquiries","definition[3]":"when you ask questions in order to get information","example[31]":"Mr. Gilberd agreed to this transaction without further inquiry.","definition[4]":"an official process, in the form of a series of meetings, intended to find out why something happened","example[32]":"The Commission conducted an inquiry into allegations of unfair business practices."}