{"word[0]":"burden","definition[0]":"something difficult or worrying that you are responsible for","note[0]":"the tax/financial/debt burden","example[0]":"His family responsibilities had started to become a burden.","example[1]":"If things go wrong he will bear the burden of guilt.","note[1]":"bear/carry the burden","example[2]":"The burden of taxation has risen considerably.","note[2]":"burden of","example[3]":"I don’t like being a burden on other people.","note[3]":"burden on","definition[1]":"something that is carried","synonym[0]":"load","collocation[0]":"bear/carry/shoulder the burden","example[4]":"At the age of 16, Suzy bore the burden of providing for her family.","collocation[1]":"place/put a burden on somebody","example[5]":"This situation places the main burden of family care on women.","collocation[2]":"share the burden","example[6]":"I was glad my brother was there to share the burden.","collocation[3]":"ease/reduce/lighten the burden","example[7]":"Smaller classes would ease the burden for teachers.","collocation[4]":"shift the burden","example[8]":"The tax shifts the burden towards the rich.","collocation[5]":"a burden falls on somebody","example[9]":"The tax burden falls most heavily upon the poorest people.","collocation[6]":"lift the burden from somebody's shoulders","example[10]":"If I deal with the all the practical problems, that will lift the burden from your shoulders.","form[0]":"ADJECTIVES/NOUN + burden","collocation[7]":"a heavy/great burden","example[11]":"Caring for elderly relatives can be a heavy burden.","collocation[8]":"a financial burden","example[12]":"the financial burden of a large mortgage","collocation[9]":"a tax burden","example[13]":"These changes will ease the tax burden for small businesses.","collocation[10]":"a debt burden","example[14]":"He made a serious attempt ease the country's debt burden.","collocation[11]":"an intolerable burden","example[15]":"Too many exams can place an intolerable burden on young people.","collocation[12]":"an unfair/undue burden","example[16]":"The new legislation put an unfair burden on employers.","collocation[13]":"the burden of responsibility","example[17]":"He felt unable to cope with the burden of responsibility.","collocation[14]":"the burden of taxation","example[18]":"The burden of taxation falls more heavily on the poor.","definition[2]":"something that causes people a lot of difficulty or worry","example[19]":"In less prosperous areas the taxes were, for many, such a burden that they lived in poverty.","definition[3]":"particular costs such as taxes or interest payments seen as a problem, especially when they are high","example[20]":"the burden of local rates that each company located in the area must pay","example[21]":"New regulations can put a heavy cost burden on small businesses.","example[22]":"The rise in the US tax burden (=the amount of tax that people and companies have to pay) has not been due to military spending, but to welfare.","example[23]":"They want a $10,000 limit on deductions for state and local income taxes as a way to increase the tax burden on the rich.","definition[4]":"a duty that someone has legally or officially promised to do","example[24]":"The holder of the bill of lading would assume the burden (=take the responsibility) of becoming subject to contractual liabilities."}