{"past_tense[0]":"held","signpost[0]":"in your hand/arms","definition[0]":"to have something in your hand, hands, or arms","example[0]":"Could you hold my bag for me?","example[1]":"He was holding a knife in one hand.","note[0]":"hold something in your hand/arms","example[2]":"I held the baby in my arms.","example[3]":"They sat holding hands under a tree.","note[1]":"hold hands","example[4]":"Max held her close and wiped away her tears.","note[2]":"hold somebody close/tightly","definition[1]":"to move your hand or something in your hand in a particular direction","example[5]":"He held out his hand to help her to her feet.","note[3]":"hold something out/up etc","example[6]":"Hold the picture up so we can see it.","definition[2]":"to have a meeting, party, election etc in a particular place or at a particular time","example[7]":"This year’s conference will be held at the Hilton Hotel.","example[8]":"A thanksgiving ceremony was held to mark the occasion.","example[9]":"The funeral was held on a grey day in November.","example[10]":"In April, the president held talks with Chinese leaders.","signpost[1]":"keep something in position","definition[3]":"to make something stay in a particular position","example[11]":"Lift your head off the floor and hold this position for five seconds.","example[12]":"A couple of screws should hold it in place.","note[4]":"hold something in place/position","example[13]":"We used rolled-up newspapers to hold the windows open.","note[5]":"hold something open/up etc","example[14]":"Remember to hold your head up and keep your back straight.","signpost[2]":"job/title","definition[4]":"to have a particular job or position, especially an important one","example[15]":"Do you really think he’s capable of holding such a responsible position?","example[16]":"Whoever is elected will hold office (=have an important political position) for four years.","example[17]":"She was the first woman to hold the office of Australian state premier.","note[6]":"hold the post/position/office etc (of something)","example[18]":"The governor had held the post since 1989.","definition[5]":"to have a particular title or record, because you have won a competition, are the best at something etc","example[19]":"The programme still holds the record for the longest running TV series.","example[20]":"The last Briton to hold the title was Bert Nicholson.","signpost[3]":"keep/store","definition[6]":"to keep something to be used when it is needed","example[21]":"Further copies of the book are held in the library.","example[22]":"Weapons were held at various sites.","signpost[4]":"keep something available for somebody","definition[7]":"to agree not to give something such as a ticket, a place at a restaurant, a job etc to anyone except a particular person","example[23]":"We can hold the reservation for you until next Friday.","example[24]":"You can’t expect them to hold the job open for much longer – you’ll have to decide whether you want it or not.","note[7]":"hold something open","signpost[5]":"keep somebody somewhere","definition[8]":"to keep someone somewhere, and not allow them to leave","note[8]":"hold somebody incommunicado (=keep someone somewhere and not allow them to communicate with anyone)","example[25]":"Police are holding two men in connection with the robbery.","example[26]":"A senior army officer was held hostage for four months.","note[9]":"hold somebody prisoner/hostage/captive","definition[9]":"to have a particular opinion or belief","example[27]":"Experts hold varying opinions as to the causes of the disease.","example[28]":"This view is not widely held.","note[10]":"be widely/generally/commonly held","example[29]":"She was held to be one of the most talented actors of her time.","note[11]":"be held to be something","example[30]":"The judge held that the child’s interests in this case must come first.","note[12]":"hold that","signpost[6]":"own something","definition[10]":"to officially own or possess money, a document, a company etc","example[31]":"He holds shares in ICI.","example[32]":"Do you hold a valid passport?","example[33]":"a privately-held company","signpost[7]":"contain a particular amount","definition[11]":"to have the space to contain a particular amount of something","example[34]":"The movie theater holds 500 people.","example[35]":"The tank should hold enough to last us a few days.","definition[12]":"to be strong enough to support the weight of something or someone","example[36]":"Careful! I’m not sure that branch will hold you.","example[37]":"The bridge didn’t look as though it would hold.","signpost[8]":"stay at same level","definition[13]":"to stay at a particular amount, level, or rate, or to make something do this","example[38]":"The bank is holding interest rates at 4%.","example[39]":"Since then, the pound has held steady against the dollar.","example[40]":"Colourful pictures help hold the students’ interest.","note[13]":"hold somebody’s interest/attention","signpost[9]":"not change","definition[14]":"to continue to be true, good, available etc","example[41]":"What I said yesterday holds.","example[42]":"Does your invitation still hold?","example[43]":"Twenty years on, his advice still holds good.","note[14]":"hold true/good","example[44]":"If our luck holds, we could reach the final.","note[15]":"weather/luck holds (out)","signpost[10]":"stop/delay","definition[15]":"used in particular phrases to tell someone to wait or not to do something","note[16]":"hold your horses! (=used to tell someone to do something more slowly or carefully)","example[45]":"I’ll have a tuna fish sandwich please – and hold the mayo (=do not give me any).","example[46]":"Hold it! We’re not quite ready.","note[17]":"hold it!","definition[16]":"to wait until the person you have telephoned is ready to answer","example[47]":"Mr Stevens is busy at the moment – would you like to hold?","example[48]":"Please hold the line while I transfer you.","definition[17]":"if an army holds a place, it controls it or defends it from attack","example[49]":"The French army held the town for three days.","signpost[11]":"musical note","definition[18]":"to make a musical note continue for a particular length of time","signpost[12]":"future","definition[19]":"if the future holds something, that is what may happen","example[50]":"Thousands of workers are waiting to see what the future holds.","signpost[13]":"have a quality","definition[20]":"to have a particular quality","example[51]":"Many church services hold little appeal for modern tastes.","note[18]":"hold (little) interest/appeal/promise etc","example[52]":"Maria came in holding a letter.","example[53]":"Can I hold the baby?","definition[21]":"to hold something very tightly and not let it go","example[54]":"He gripped her arm so she couldn’t walk away.","example[55]":"Jenny gripped the side of the boat to steady herself.","display[0]":"clutch","definition[22]":"to hold something tightly, especially because you do not want to drop or lose it","example[56]":"A businessman hurried past, clutching his briefcase.","example[57]":"The little girl clutched onto his hand.","display[1]":"clasp","definition[23]":"to hold someone or something tightly, closing your fingers or arms around them","example[58]":"She was clasping a bunch of small summer flowers.","example[59]":"He clasped her in his arms and kissed her.","display[2]":"get/take hold of something","definition[24]":"to take something in your hand or hands and hold it","example[60]":"I took hold of the handle and pulled as hard as I could.","example[61]":"Quickly – try and get hold of that frog!","display[3]":"grasp","definition[25]":"to take hold of something firmly, especially in a determined way","example[62]":"She grasped the lowest branch and pulled herself up into the tree.","display[4]":"grab","definition[26]":"to take hold of something suddenly and often violently","example[63]":"He grabbed my bag and ran off with it.","example[64]":"The other man grabbed hold of (=suddenly took hold of ) my arms and threatened me with a knife.","display[5]":"seize","example[65]":"A police officer ran after him and seized the gun.","display[6]":"hang on (to something)","definition[27]":"to hold on to something or someone tightly to support yourself","example[66]":"He hung on to the rail at the back of the motorbike.","example[67]":"Hang on tight!","display[7]":"keep hold of something","definition[28]":"to continue to hold something","example[68]":"Greg was struggling to keep hold of the dog.","example[69]":"She tried to take her hand away but he kept hold of it.","signpost[14]":"holding something","definition[29]":"the action of holding something with your hands","example[70]":"He tightened his hold, refusing to let her go.","example[71]":"Make sure you keep hold of my hand when we cross the road.","example[72]":"I took hold of her hand and gently led her away.","example[73]":"Grab hold of the rope and pull yourself up.","example[74]":"She released her tight hold on the dog.","note[19]":"hold on","signpost[15]":"control/power","definition[30]":"control, power, or influence over something or someone","example[75]":"I’ve always kept a tight hold on our finances.","example[76]":"I realized that the woman had a hold over my father.","example[77]":"He struggled to get a hold of his emotions.","note[20]":"get/keep a hold on/of something","signpost[16]":"fight","definition[31]":"a particular position that you hold an opponent in, in a fight or a sport such as wrestling","signpost[17]":"climbing","definition[32]":"somewhere you can put your hands or feet to help you climb something","example[78]":"The cliff was steep and it was difficult to find a hold.","definition[33]":"the part of a ship below the deck1(1) where goods are stored","collocation[0]":"a tight/firm hold","example[79]":"Rose had a tight hold of her hand.","collocation[1]":"tighten your hold","example[80]":"Maria winced as Luke tightened his hold on her fingers.","collocation[2]":"loosen/relax your hold","example[81]":"Laughing, he loosened his hold until she could pull her arms free.","collocation[3]":"release your hold","example[82]":"As soon as his fingers released their hold, Robyn turned and ran.","example[83]":"I had to run to keep hold of the leather strap.","example[84]":"Wallace took hold of Fred’s jacket and pulled him roughly backwards.","collocation[4]":"catch/grab/seize etc hold of something","example[85]":"She grabbed hold of the letter and tore it open.","collocation[5]":"have hold of something","example[86]":"Nathan had hold of her hand again.","definition[34]":"if you hold an investment, you own it","example[87]":"The group holds billions of dollars of junk bonds.","definition[35]":"to keep an investment, rather than sell it","example[88]":"I don’t sell anything. I buy stocks to hold.","definition[36]":"to own part of company, asset etc","example[89]":"The company also holds a 25 percent interest in a German refinery.","definition[37]":"to own a PATENT (=the right to profits from a product based on a new idea)","example[90]":"Inventor Charles Fritz holds the patent to the Tripledge windshield wiper.","definition[38]":"to have a meeting","example[91]":"This year’s conference will be held in Brighton.","definition[39]":"to keep supplies in a particular place","example[92]":"The steel company holds stocks at the terminals in order to make just-in-time deliveries to local customers.","definition[40]":"to keep a price or other amount at a particular level","definition[41]":"to remain at the same level","definition[42]":"if something holds value or holds its value, it does not lose its value, or it loses value more slowly than you might expect","example[93]":"The works of Magritte and Miro continue to hold their value at auctions despite the art-market slump.","example[94]":"In an increasingly disposable society, luxury cars are one of the few items that hold value.","definition[43]":"if a political party holds office, it governs a country","definition[44]":"to have an important job in the government or in a company","example[95]":"The original directors of the company would hold office only for the first year of privatization.","definition[45]":"to have a particular job","example[96]":"She has held the position of Chief Financial Officer for five years.","definition[46]":"the part of a ship or plane where goods are stored for transport","example[97]":"The Mega Borg had 38 million gallons of crude in its hold.","definition[47]":"if a company has a hold on a market or a large part of a market, it makes it difficult for others to compete","example[98]":"They thought they had a pretty good hold on the computer market.","definition[48]":"if someone says that an investment is a hold, they mean that people who have it should keep it and not sell it, but that they should not buy any more of it","example[99]":"He rates the stock a hold, but figures it ‘might go down before it goes up.’"}