{"word[0]":"pay","past_tense[0]":"paid","signpost[0]":"give money","definition[0]":"to give someone money for something you buy or for a service","example[0]":"How would you like to pay?","example[1]":"You’d get a discount for paying cash.","note[0]":"pay (in) cash","example[2]":"Can I pay by credit card?","note[1]":"pay by cheque/credit card","example[3]":"He wanted to be paid in dollars.","note[2]":"pay (somebody) in dollars/euros etc","example[4]":"Mum paid for my driving lessons.","note[3]":"pay for","example[5]":"He didn’t even offer to pay me for the ticket.","note[4]":"pay somebody for something","example[6]":"Ray paid some kids to wash the car.","note[5]":"pay somebody to do something","example[7]":"I paid him $5 to cut the grass.","note[6]":"pay somebody something","heading[0]":"GRAMMAR: Patterns with pay","explanation[0]":"You pay an amount or you pay a person","example[8]":"We paid $700","example[9]":"Pay the delivery man","explanation[1]":"You pay for something that you buy","example[10]":"I’ll pay for the tickets","bad_example[0]":"I’ll pay the tickets","explanation[2]":"You pay an amount or a person for something that you buy","example[11]":"I paid £100 for this jacket","example[12]":"She paid me for the drinks","explanation[3]":"You pay someone an amount","example[13]":"They paid the owner €3,000","explanation[4]":"You pay in a type of money","example[14]":"Can I pay in euros?","explanation[5]":"You pay by a particular method","example[15]":"You can pay by credit card","signpost[1]":"bill/tax/rent","definition[1]":"to pay money that you owe to a person, company etc","example[16]":"I forgot to pay the gas bill!","example[17]":"You pay tax at the basic rate.","example[18]":"Is it okay if I pay you what I owe you next week?","signpost[2]":"wage/salary","definition[2]":"to give someone money for the job they do","note[7]":"paid holiday/leave (=time when you are not working but are still paid)","example[19]":"How much do they pay you?","example[20]":"Some lawyers get paid over $400 an hour.","example[21]":"They’re only paid about £4 an hour.","note[8]":"pay somebody $100 a day/£200 a week etc","example[22]":"We get paid weekly on Fridays.","note[9]":"be paid weekly/monthly","example[23]":"Many of the workers are very badly paid.","note[10]":"well/badly/poorly paid","signpost[3]":"legal cost","definition[3]":"to give money to someone because you are ordered to by a court as part of a legal case","example[24]":"She had to pay a £35 fine for speeding.","example[25]":"Martins was ordered to pay court costs of £1,500.","example[26]":"The company were forced to pay £5,000 in compensation.","note[11]":"pay (something in) compensation/damages","signpost[4]":"say something good","definition[4]":"to say something good or polite about or to someone","example[27]":"The minister paid tribute to the work of the emergency services.","example[28]":"I came by to pay my respects (=visit or send a polite greeting to someone) to Mrs Owens.","example[29]":"I was just trying to pay her a compliment.","signpost[5]":"good result","definition[5]":"if a particular action pays, it brings a good result or advantage for you","example[30]":"Crime doesn’t pay.","example[31]":"It pays to get some professional advice before you make a decision.","example[32]":"It would pay you to ask if there are any jobs going at the London office.","example[33]":"Getting some qualifications now will pay dividends (=bring a lot of advantages) in the long term.","signpost[6]":"profit","definition[6]":"if a shop or business pays, it makes a profit","example[34]":"If the pub doesn’t start to pay, we’ll have to sell it.","example[35]":"The farm just manages to pay its way (=make as much profit as it costs to run).","signpost[7]":"be punished","definition[7]":"to suffer or be punished for something you have done wrong","example[36]":"I’ll make him pay!","example[37]":"They paid dearly for their mistakes.","heading[1]":"– Meaning 1: to give someone money for something you buy or for a service","collocation[0]":"pay £10/$50 etc","example[38]":"I only paid ten pounds for it.","example[39]":"You have to pay in cash for the tickets.","collocation[1]":"pay by cheque","example[40]":"I filled up with petrol and then paid by cheque.","collocation[2]":"pay by credit card","example[41]":"The hotel does not charge more if you pay by credit card.","collocation[3]":"pay in dollars/euros etc","example[42]":"American exporters want to be paid in dollars.","collocation[4]":"pay handsomely","example[43]":"Customers are willing to pay handsomely for anti-ageing cosmetic products.","heading[2]":"– Meaning 3: to give someone money for the job they do","collocation[5]":"pay somebody £200 a week/$100 a day etc","example[44]":"The cleaners are paid £5 an hour.","collocation[6]":"be paid by the hour/day/week","example[45]":"I was working on a building site, being paid by the hour.","example[46]":"Most of us get paid weekly or monthly.","collocation[7]":"well-paid","example[47]":"Teachers here are well-paid.","collocation[8]":"highly-paid","example[48]":"a highly-paid football player","collocation[9]":"badly-paid/poorly-paid","example[49]":"For a long time I didn’t realise how badly-paid and overworked I was.","definition[8]":"to give someone money for something you are buying from them, or a service they are providing","example[50]":"I paid a lot of money for that computer.","example[51]":"You have to pay to park your car.","display[0]":"meet the cost of something","definition[9]":"to pay for something for someone else, or to provide the money needed to do something","example[52]":"We will meet the cost of your travelling expenses.","example[53]":"The cost will be met from public donations.","display[1]":"foot the bill","definition[10]":"to pay for something for someone else, especially when you do not want to, or do not think that you should","example[54]":"As usual, the taxpayer will have to foot the bill.","display[2]":"pick up the tab","definition[11]":"to pay for something","example[55]":"My company will pick up the tab for all moving costs.","display[3]":"fork out/shell out","definition[12]":"to pay a lot of money for something because you have to and not because you want to","example[56]":"He had to fork out £500 to get his car fixed.","example[57]":"Fans are having to shell out roughly $65 per seat for football games.","display[4]":"settle the bill","definition[13]":"to pay the bill after eating a meal, staying in a hotel etc","example[58]":"She went down to the hotel lobby to settle the bill.","definition[14]":"to pay a particular amount of money for something – used especially when saying how much you are willing to pay","example[59]":"How much will you give me for the car?","example[60]":"I’ll give you $50 for the lot  (=for everything).","display[5]":"something is on somebody","definition[15]":"used when saying that someone else will pay for your meal, drinks etc","example[61]":"Order whatever you like – this is on me!","example[62]":"The drinks are on the house (=the bar, restaurant etc will let you have them for free).","example[63]":"Put your money away – the drinks are on us.","definition[16]":"money that you are given for doing your job","example[64]":"Staff have been working without pay for the last month.","example[65]":"The tax is deducted from your pay every week.","example[66]":"He was suspended on full pay until the hearing.","form[0]":"ADJECTIVES/NOUN + pay","example[67]":"Nurses often work long hours for relatively low pay.","example[68]":"The work was steady and the pay was pretty good.","collocation[10]":"higher/better","example[69]":"Workers demanded higher pay.","collocation[11]":"equal pay","example[70]":"The women at the factory went on strike for equal pay.","collocation[12]":"basic pay","example[71]":"The basic pay is so low you end up doing lots of overtime.","collocation[13]":"take-home pay","example[72]":"Their average take-home pay is just £120.","collocation[14]":"overtime pay","example[73]":"Their bosses had to approve any overtime pay.","collocation[15]":"holiday pay","example[74]":"Servicemen and women get no holiday pay, no overtime, no weekends off.","collocation[16]":"sick pay","example[75]":"As a self-employed person, you get no sick pay or benefits.","collocation[17]":"maternity pay","example[76]":"If you have worked here a year, you are entitled to 3 month’s maternity pay.","collocation[18]":"redundancy pay","example[77]":"We invested our redundancy pay in a new business venture.","collocation[19]":"full pay","example[78]":"They were immediately suspended on full pay pending a full inquiry.","collocation[20]":"half pay","example[79]":"In 1822 he retired from the army as captain on half pay.","form[1]":"pay + NOUN","collocation[21]":"a pay increase","example[80]":"Teachers will be awarded a 6% pay increase this year.","collocation[22]":"a pay rise","example[81]":"If you get promoted, will you get a pay rise?","collocation[23]":"a pay cut","example[82]":"Staff were asked to take a 10% pay cut.","collocation[24]":"a rate of pay","example[83]":"Many workers in the catering industry are on low rates of pay.","collocation[25]":"a pay cheque","example[84]":"Stretching your money until the next pay cheque arrives often becomes difficult.","collocation[26]":"a pay freeze","example[85]":"Ministers have approved a public sector pay freeze.","collocation[27]":"a pay claim","example[86]":"The miners voted for strike action in support of their pay claim.","collocation[28]":"a pay dispute","example[87]":"Many flights were cancelled because of a pilots’ pay dispute.","collocation[29]":"pay and conditions","example[88]":"The unions are demanding better pay and conditions.","display[6]":"income","definition[17]":"money that you receive from working, investments etc","example[89]":"families on a low income","display[7]":"salary","definition[18]":"the pay that professional people such as teachers or lawyers earn every year","example[90]":"a salary of $65,000 a year","display[8]":"wages","definition[19]":"the pay that someone earns every hour or every week","example[91]":"Her wages barely cover the rent.","display[9]":"bonus","definition[20]":"money added to someone’s pay, as a reward for good work or as a reward when the company does well","example[92]":"The company pays an attendance bonus – if you go 30 days without being late or absent, you get the bonus.","display[10]":"earnings","definition[21]":"all the money that you earn by working","example[93]":"In a good year, a bonus can double an executive’s earnings.","definition[22]":"the money someone receives for the job they do","example[94]":"She got the job, but it meant a big pay cut.","example[95]":"an increase in hourly pay","example[96]":"All I want is a full day’s work for a full day’s pay.","example[97]":"Thebasic pay (=the usual amount, without any extra) is so low you end up putting in overtime.","definition[23]":"to give a person or company money for a product or service they have supplied","example[98]":"How much can you afford to pay?","example[99]":"GM won’t pay a Christmas bonus to salaried employees next year.","example[100]":"Farmers desperately need hard credit to pay for seed and fertilizer.","example[101]":"The proportion of shoppers willing to pay more for special brands has fallen sharply.","example[102]":"United has agreed to pay Pan Am $290 million for its London routes.","definition[24]":"if something you buy pays for itself, the money it saves over a period of time is as much as it cost","example[103]":"Investment in energy efficiency will pay for itself in two years due to the amount of fuel saved.","definition[25]":"if a machine or business activity pays its way, it makes more money than it costs to run","example[104]":"The SBS television channel is permitted to run limited advertising to help pay its way.","definition[26]":"to pay much more for something than it is really worth","example[105]":"Finance people have paid through the nose for consultants in recent years.","definition[27]":"to give a person or company money you owe them","example[106]":"Celutel has been trying to raise cash topay debt.","example[107]":"The association has set up the loan fund to help its members pay fines.","example[108]":"Shoppers in Newfoundlandpay 19%tax on purchases of goods and services.","example[109]":"Cane cutters here are paid about $1.50 per ton.","example[110]":"attempts by management not to pay employees overtime","definition[28]":"if investments pay a particular amount of money or rate of interest, the investors who own them will receive that amount of profit","example[111]":"Our Gold Account is currently paying a 5.3%interest rate.","example[112]":"All the current junk bonds pay cash interest.","example[113]":"Under the current deal, BBDO stock is paying about 10 times last year’s earnings.","example[114]":"If the Chinese can ship this equipment 12,000 miles, how is it that British industry cannot make it pay?"}