{"word[0]":"lodge","signpost[0]":"become stuck","definition[0]":"to become firmly stuck somewhere, or to make something become stuck","opposite[0]":"dislodge","example[0]":"The fishbone lodged in her throat.","note[0]":"lodge in","example[1]":"The bullet was lodged in his spine.","note[1]":"be lodged in/between/behind etc something","explanation[0]":"Lodge is usually passive when used as a transitive verb","signpost[1]":"put somebody somewhere","definition[1]":"to provide someone with a place to stay for a short time","example[2]":"a building used to lodge prisoners of war","example[3]":"The refugees were lodged in old army barracks.","note[2]":"lodge somebody in/at something","signpost[2]":"put something somewhere","definition[2]":"to put something important in an official place so that it is safe","example[4]":"Be sure to lodge a copy of the contract with your solicitor.","note[3]":"lodge something with somebody","example[5]":"The money was lodged in a Swiss bank account.","note[4]":"lodge something in something","signpost[3]":"stay somewhere","definition[3]":"to pay to live in a room in someone’s house","example[6]":"John lodged with a family in Bristol when he first started work.","note[5]":"lodge at/with etc","definition[4]":"a small house on the land of a large country house, usually at the main entrance gate","definition[5]":"a room or small building at the entrance to a college, institution etc for someone whose job is to watch who enters and leaves","example[7]":"the porter’s lodge","definition[6]":"a house or hotel in the country or mountains where people can stay when they want to go hunting, shooting etc","definition[7]":"a local meeting place for some organizations, or the group of people who belong to one of these organizations","example[8]":"He was a member of a Masonic lodge.","definition[8]":"a beaver’s home","definition[9]":"a traditional home of Native Americans, or the group of people that live in it","definition[10]":"to make a formal or official complaint, protest etc","example[9]":"An appeal must be lodged within 28 days.","definition[11]":"to formally give information or documents which have to be given by law to an official authority","synonym[0]":"file","example[10]":"Two companies failed to lodge printed copies of their annual reports by the opening of trading yesterday.","example[11]":"Opening bids will have to be lodged by December 11.","example[12]":"To retain copyright you’ll have to lodge a patent application.","definition[12]":"to put money or something valuable in an official place so that it is safe","example[13]":"The money was lodged in an account in Hamburg."}