{"word[0]":"spoil","past_tense[0]":"spoiled","definition[0]":"to have a bad effect on something so that it is no longer attractive, enjoyable, useful etc","synonym[0]":"ruin","example[0]":"The whole park is spoiled by litter.","example[1]":"We didn’t let the incident spoil our day.","example[2]":"I don’t want to spoil your fun.","example[3]":"Why do you always have to spoil everything?","signpost[0]":"treat too kindly","definition[1]":"to give a child everything they want, or let them do whatever they want, often with the result that they behave badly","example[4]":"She’s an only child, but they didn’t really spoil her.","example[5]":"His mother and sisters spoil him rotten (=spoil him very much).","signpost[1]":"treat kindly","definition[2]":"to look after someone in a way that is very kind or too kind","example[6]":"You’ll have to let me spoil you on your birthday.","example[7]":"Go on, spoil yourself. Have another piece of cake.","note[0]":"spoil yourself","signpost[2]":"decay","definition[3]":"to start to decay","example[8]":"Food will spoil if the temperature in your freezer rises above 8°C.","signpost[3]":"voting","definition[4]":"to mark a ballot paper wrongly so that your vote is not included","definition[5]":"to have a bad effect on something so that it is much less attractive, enjoyable etc","example[9]":"New housing developments are spoiling the countryside.","example[10]":"The bad weather completely spoiled our holiday.","definition[6]":"to spoil something completely and permanently","example[11]":"Using harsh soap to wash your face can ruin your skin.","example[12]":"The argument ruined the evening for me.","display[0]":"mar","definition[7]":"to spoil something by making it less attractive or enjoyable","example[13]":"His handsome Arab features were marred by a long scar across his face.","example[14]":"Outbreaks of fighting marred the New Year celebrations.","display[1]":"detract from something","definition[8]":"to slightly spoil something that is generally very good, beautiful, or impressive","example[15]":"The huge number of tourists rather detracts from the city’s appeal.","example[16]":"There were a few minor irritations, but this did not detract from our enjoyment of the holiday.","display[2]":"undermine","definition[9]":"to spoil something that you have been trying to achieve","example[17]":"The bombings undermined several months of careful negotiations.","display[3]":"sour","definition[10]":"to spoil a friendly relationship between people or countries","example[18]":"The affair has soured relations between the UK and Russia.","display[4]":"poison","definition[11]":"to spoil a close relationship completely, so that people can no longer trust each other","example[19]":"Their marriage was poisoned by a terrible dark secret.","display[5]":"mess something up","definition[12]":"to spoil something important or something that has been carefully planned","example[20]":"If there’s any delay, it will mess up our whole schedule.","definition[13]":"waste material such as earth and stones from a mine or hole in the ground","example[21]":"spoil heaps"}