{"word[0]":"harm","definition[0]":"damage, injury, or trouble caused by someone’s actions or by an event","example[0]":"The scandal did his career a lot of harm.","example[1]":"Our children deserve protection from harm.","collocation[0]":"do (something) harm","example[2]":"Try to choose products that do the least harm to the environment.","collocation[1]":"cause (somebody/something) harm","example[3]":"Very small amounts of the chemical cause no lasting harm.","collocation[2]":"inflict harm","example[4]":"None of us wants to inflict harm on another human being.","collocation[3]":"suffer harm","example[5]":"A child can be taken into care if he is or is likely to suffer significant harm.","collocation[4]":"prevent harm","example[6]":"He was put in a mental hospital to prevent harm to others.","collocation[5]":"great/serious/significant harm","example[7]":"If you drink too much alcohol, you can do yourself serious harm.","collocation[6]":"physical harm","example[8]":"They were afraid that he would do them some actual physical harm.","collocation[7]":"psychological/emotional harm","example[9]":"Depriving a child of love does irreparable emotional harm.","collocation[8]":"environmental harm","example[10]":"The report highlights the environmental harm caused by transporting goods around the world.","collocation[9]":"irreparable harm","example[11]":"The scandal has caused irreparable harm to his career.","collocation[10]":"lasting/permanent harm","example[12]":"The injury caused him discomfort but no lasting harm.","collocation[11]":"untold harm","example[13]":"This type of abuse can cause a child untold harm.","collocation[12]":"potential harm","example[14]":"People need to be more aware of the potential harm of being overweight.","collocation[13]":"do more harm than good","example[15]":"If you don’t warm up properly, exercise may do more harm than good.","collocation[14]":"no harm done","example[16]":"‘I’m sorry, I didn’t mean to push you.’ ‘Don’t worry, no harm done.’","collocation[15]":"where’s the harm in that?","example[17]":"Sure, he gets attention when he performs at a charity event, but where’s the harm in that?","definition[1]":"to have a bad effect on something","example[18]":"chemicals that harm the environment","explanation[0]":"In everyday English, people usually say that something is bad for something rather than that it harms something:","example[19]":"chemicals that are bad for the environment","definition[2]":"to physically hurt a person or animal","example[20]":"The kidnappers didn’t harm him, thank God.","definition[3]":"to have a bad effect on someone or something","example[21]":"Many working mothers said having children harmed their careers.","example[22]":"A little hard work never harmed anyone.","definition[4]":"to harm something badly. Damage is more serious than harm","example[23]":"His reputation was damaged and his career was in ruins.","example[24]":"The affair has damaged people’s confidence in the government.","display[0]":"be bad for somebody/something","definition[5]":"to be likely to harm someone or something","example[25]":"Too much fatty food is bad for you.","example[26]":"All this rain is bad for business.","display[1]":"be detrimental to something","definition[6]":"to be bad for something","example[27]":"The new housing development will be detrimental to the character of this small town.","display[2]":"impair","definition[7]":"to harm something, especially someone’s ability to do something or the correct working of a system","example[28]":"Any amount of alcohol that you drink will impair your ability to drive.","example[29]":"His vision was impaired.","display[3]":"prejudice","definition[8]":"to have a bad effect on the future success of something","example[30]":"Don’t do anything to prejudice our chances of winning."}