{"definition[0]":"an important event, decision, problem etc has a big effect or influence on people’s lives or on events in the future","example[0]":"a very important meeting","example[1]":"The accident taught him an important lesson.","example[2]":"Happiness is more important than money.","example[3]":"‘What did you say?’ ‘Oh, nothing important.’","example[4]":"It’s vitally important that you understand the danger.","example[5]":"It’s important to explain the procedure to the patient.","note[0]":"it is important (to do something)","example[6]":"It was important for the president to continue his schedule, regardless of the bomb threat.","note[1]":"important for","example[7]":"Nothing could be more important to me than my family.","note[2]":"important to","definition[1]":"people who are important have a lot of power or influence","example[8]":"a very important customer","example[9]":"They carry guns because it makes them feel important.","definition[2]":"having a big effect on people’s lives or on events in the future","example[10]":"an important decision","example[11]":"Good qualifications are increasingly important.","display[0]":"big","definition[3]":"important or serious","example[12]":"It’s a big decision.","example[13]":"a big problem","definition[4]":"important enough to be noticeable or have a big effect","example[14]":"There is no significant difference between the performance of male and female students.","example[15]":"The Internet has brought about significant changes in people’s lives.","display[1]":"noteworthy","definition[5]":"important or interesting enough to deserve your attention","example[16]":"The castle is the island’s most noteworthy feature.","example[17]":"The jury’s verdict was noteworthy for a number of reasons.","heading[0]":"very important","display[2]":"essential","definition[6]":"very important, especially for the success, health, or safety of someone or something","example[18]":"It is essential to speak the local language.","example[19]":"essential supplies of food and clothing","display[3]":"vital/crucial","definition[7]":"extremely important, because without it there could be serious problems","example[20]":"His evidence was vital to the case.","example[21]":"The US plays a crucial role in the region.","example[22]":"The media are a vital part of the political system.","display[4]":"key","definition[8]":"extremely important and having a big effect","example[23]":"Wheeler had a key role in the development of the atom bomb.","example[24]":"Timing is key.","display[5]":"of great/considerable importance","example[25]":"In the construction industry, health and safety are of considerable importance.","display[6]":"momentous","definition[9]":"very important because it has a very great effect on the future","example[26]":"Momentous events were taking place in Russia.","example[27]":"a momentous decision","heading[1]":"most important","display[7]":"main/chief/principal","example[28]":"What was your main aim?","example[29]":"the principal reason for their decision","example[30]":"the chief cause of the recession","display[8]":"major","definition[10]":"one of the most important or serious things","example[31]":"Smoking is a major cause of heart disease.","example[32]":"Street crime is a major problem.","display[9]":"central/primary","definition[11]":"most important – used especially when talking about the main thing that people are discussing, worried about, or trying to do","example[33]":"Education will be the central issue in the election.","example[34]":"Our primary concern is passenger safety.","display[10]":"paramount","definition[12]":"more important than anything else, so that you must consider it when deciding what to do","example[35]":"Airport security is of paramount importance.","example[36]":"The needs of the students are paramount."}