{"word[0]":"special","definition[0]":"not ordinary or usual, but different in some way and often better or more important","example[0]":"a special place in the classroom for reading","example[1]":"No one receives special treatment.","example[2]":"Maria’s special recipe for apple pie","example[3]":"The good china was used only on special occasions.","example[4]":"Each village has its own special charm.","example[5]":"Are you doing anything special for Christmas?","note[0]":"anything/something/nothing special","definition[1]":"particularly important to someone and deserving attention, love etc","example[6]":"a party with a few special friends","example[7]":"a teacher who made every child feel special","example[8]":"Her second son had a special place in her heart.","definition[2]":"a special position or job has a particular purpose or aim, and continues only until that purpose or aim is achieved","example[9]":"Mitchell acted as a special envoy in the Northern Ireland peace talks.","definition[3]":"more than usual","synonym[0]":"particular","example[10]":"Pay special attention to how you clean the wound.","definition[4]":"something that is not usual or ordinary, and is made or done for a special purpose","example[11]":"a TV special on the election","definition[5]":"a lower price than usual for a particular product for a short period of time","synonym[1]":"special offer","example[12]":"a lunch special for $4.99","example[13]":"Breyer’s ice cream is on special this week.","note[1]":"be on special","definition[6]":"not ordinary or usual but different in some way and often better or more important","example[14]":"They’re doing a special promotion on digital cameras.","example[15]":"Special bonuses were paid to top executives.","definition[7]":"used to describe someone who has had a position specially created for them","example[16]":"He accepted the appointment as special adviser on National Security Affairs.","example[17]":"a special assistant to the director","example[18]":"This month, the bar will have a special on wine by the glass.","note[2]":"special on","example[19]":"Breyer’s ice-cream is on special this week."}