{"word[0]":"nature","signpost[0]":"plants/animals etc","definition[0]":"everything in the physical world that is not controlled by humans, such as wild plants and animals, earth and rocks, and the weather","example[0]":"We grew up in the countryside, surrounded by the beauties of nature.","example[1]":"nature conservation","example[2]":"Disease is nature’s way of keeping the population down.","example[3]":"The inhabitants of the island fight a constant battle against the forces of nature.","note[0]":"the laws/forces of nature","example[4]":"All these materials are found in nature.","note[1]":"in nature","explanation[0]":"‘the nature’ in this meaning You say","example[5]":"the power of nature","bad_example[0]":"the power of the nature","signpost[1]":"somebody’s character","definition[1]":"someone’s character","example[6]":"a child with a happy, easy-going nature","example[7]":"I tried appealing to his better nature (=his feelings of kindness) but he wouldn’t agree to help us.","example[8]":"Of course she’s jealous – it’s only human nature (=the feelings and ways of behaving that all people have).","example[9]":"It’s just not in Jane’s nature to lie.","note[2]":"somebody’s nature","example[10]":"She was by nature a very affectionate person.","note[3]":"by nature","signpost[2]":"qualities of something","definition[2]":"the qualities or features that something has","example[11]":"Capitalist society is by its very nature unstable.","example[12]":"The exact nature of the problem is not well understood.","note[4]":"exact/precise/true nature","example[13]":"Any government funding would be temporary in nature.","note[5]":"different/political/temporary etc in nature","example[14]":"They asked a lot of questions about the nature of our democracy.","note[6]":"nature of","example[15]":"He examined the nature of the relationship between the two communities.","signpost[3]":"type","definition[3]":"a particular kind of thing","example[16]":"The support being given is of a practical nature.","note[7]":"of a personal/political/difficult etc nature","example[17]":"I never trouble myself with questions of that nature.","note[8]":"of this/that nature","definition[4]":"a British weekly journal (=serious magazine) which deals with all areas of science. It is a very respected journal, and many important new discoveries are first reported in articles in Nature."}