{"word[0]":"retire","definition[0]":"to stop working, usually because you have reached a certain age","example[0]":"Most people retire at 65.","example[1]":"He was forced to retire early because of poor health.","example[2]":"I retired from teaching three years ago.","note[0]":"retire from","example[3]":"her decision to retire from her position as librarian of the law society","example[4]":"Her drink problem has forced her to retire from public life.","example[5]":"He retired as a GP last year.","note[1]":"retire as","definition[1]":"to ask someone to stop doing their job, usually because of ill health","example[6]":"He became ill and was retired early.","signpost[0]":"quiet place","definition[2]":"to go away to a quiet place","example[7]":"I retired to my room to think.","note[2]":"retire to","signpost[1]":"jury","definition[3]":"when a jury in a law court retires, they go away to consider whether someone is guilty or not","signpost[2]":"game/race","definition[4]":"to stop competing in a game or race because you are losing or injured","example[8]":"He had to retire with a neck injury in the second half.","signpost[3]":"bed","definition[5]":"to go to bed","definition[6]":"to move back from a battle after being defeated","definition[7]":"to stop work at the end of your working life","example[9]":"He wanted to retire at 50.","example[10]":"The company plans to eliminate 1,000 jobs by offering workers money to quit or retire early (=before the usual age).","example[11]":"The company’s No. 3 executive abruptly retired as a general partner, citing personal reasons.","example[12]":"He will retire from his post on the management board in April.","definition[8]":"to dismiss someone who is near the end of their working life","example[13]":"I took over the office when Mr Hargreaves was retired due to ill health.","definition[9]":"if a company retires bonds, shares etc, it buys them back from investors and takes them off the market","synonym[0]":"RETRACT","example[14]":"The group has purchased and retired $5.1 million of its Series B shares.","definition[10]":"to pay off a loan completely","example[15]":"The loan terms state that he may retire the debt at any time.","definition[11]":"if the jury in a court case retires, it goes to a separate room to decide its VERDICT (=whether someone is guilty or not)"}