{"word[0]":"wonder","definition[0]":"to think about something that you are not sure about and try to guess what is true, what will happen etc","example[0]":"He’s been leaving work early a lot – it makes you wonder, doesn’t it?","example[1]":"I wonder how James is getting on.","note[0]":"wonder who/what/how etc","example[2]":"What are they going to do now, I wonder?","example[3]":"I wonder if I’ll recognize Philip after all these years.","note[1]":"wonder if/whether","definition[1]":"to feel surprised and unable to believe something","example[4]":"I don’t wonder you’re tired.","note[2]":"I don’t wonder","example[5]":"He’ll come back soon enough, I shouldn’t wonder.","note[3]":"I shouldn’t wonder","example[6]":"Sometimes I wonder about his behaviour.","note[4]":"wonder about/at","example[7]":"I wonder how he dares to show his face!","note[5]":"wonder how","definition[2]":"to doubt or question whether something is true","example[8]":"‘Is she serious?’ ‘I wonder.’","example[9]":"Sometimes I wonder if he’s got any sense at all!","heading[0]":"GRAMMAR: Patterns with wonder","explanation[0]":"You wonder  what will happen","example[10]":"I wonder what she’ll say when she finds out","explanation[1]":"You wonder  what would happen if something else happened (when talking about imaginary situations)","example[11]":" I wonder what would happen if I said that I was leaving","explanation[2]":"You wonder if you should do something","example[12]":"I wonder if we should tell her","signpost[0]":"admiration","definition[3]":"a feeling of surprise and admiration for something very beautiful or new to you","example[13]":"The sight of the Taj Mahal filled us with wonder.","definition[4]":"something that makes you feel surprise and admiration","example[14]":"technological wonders","example[15]":"the Seven Wonders of the World","signpost[1]":"clever person","definition[5]":"someone who is good at doing difficult things","definition[6]":"very good and effective","example[16]":"a new wonder drug"}