{"word[0]":"settle","signpost[0]":"end argument","definition[0]":"to end an argument or solve a disagreement","example[0]":"We hope the factions will be able to settle their differences (=agree to stop arguing) by peaceful means.","example[1]":"Forensic tests should settle the question of whether Bates was actually present at the scene of the crime.","example[2]":"They might be willing to settle out of court (=come to an agreement without going to a court of law).","example[3]":"Rodman met with Kreeger to try and settle the dispute over his contract.","note[0]":"settle a dispute/lawsuit/conflict/argument etc","example[4]":"She finally settled with her former employers for an undisclosed sum.","note[1]":"settle with","type[0]":"transitive usually passive","signpost[1]":"decide","definition[1]":"to decide what you are going to do, especially so that you can make definite arrangements","example[5]":"Nothing’s settled yet.","example[6]":"It’s settled then. I’ll go back to the States in June.","example[7]":"‘She’s only 15.’ ‘That settles it (=that is enough information for a definite decision to be made)! We’re not taking her with us!’","signpost[2]":"start living in a place","definition[2]":"to go to a place where no people have lived permanently before and start to live there","example[8]":"This territory was settled in the mid-1850s by German immigrants.","definition[3]":"to go to live in a new place, and stay there for a long time","example[9]":"Many Jewish people settled in the Lower East Side.","note[2]":"settle in","signpost[3]":"comfortable","definition[4]":"to put yourself or someone else in a comfortable position","example[10]":"The dog settled on the grass to enjoy its bone.","example[11]":"A nurse settled the old man into a chair.","example[12]":"Donna did not dare settle herself too comfortably into her seat, in case she fell asleep.","note[3]":"settle yourself in/on etc something","signpost[4]":"quiet/calm","definition[5]":"to become quiet and calm, or to make someone quiet and calm","example[13]":"When the children had settled, Miss Brown gave out the new reading books.","example[14]":"She breathed deeply to settle her nerves (=stop herself from feeling worried or frightened).","signpost[5]":"move down","definition[6]":"if dust, snow etc settles, it comes down and stays in one place","example[15]":"Snow settled on the roofs.","note[4]":"settle on","definition[7]":"if a bird, insect etc settles, it flies down and rests on something","example[16]":"A fly kept trying to settle on his face.","definition[8]":"if something such as a building or the ground settles, it sinks slowly to a lower level","example[17]":"The crack in the wall is caused by the ground settling.","signpost[6]":"pay money","definition[9]":"to pay money that is owed","example[18]":"I always settle my account in full each month.","note[5]":"settle a bill/account/claim","example[19]":"These insurance companies take forever to settle a claim.","example[20]":"He was able to settle with his creditors, and avoid going to jail.","signpost[7]":"organize business/money","definition[10]":"to deal with all the details of a business or of someone’s money or property, so that nothing further needs to be done","example[21]":"When it is finally settled, the Marshall estate may be worth no more than $100,000.","example[22]":"After her husband’s death, Jackie went to the city to settle his affairs.","signpost[8]":"feeling/quality","definition[11]":"if a quality or feeling settles over a place or person, it begins and has a strong effect","example[23]":"An uneasy silence settled over the room.","note[6]":"settle over/on","example[24]":"Depression settled over her like a heavy black cloud.","definition[12]":"if a particular expression settles on your face, it stays there","example[25]":"A disapproving frown settled on her face.","signpost[9]":"stomach","definition[13]":"if your stomach settles, or if something settles it, it stops feeling uncomfortable or making you sick","example[26]":"Georgia had taken pills to settle her stomach, but she was still throwing up every hour.","collocation[0]":"settle a dispute/argument/conflict","example[27]":"Every effort was made to settle the dispute, without success.","collocation[1]":"settle a lawsuit/case","example[28]":"The city will pay $875,000 to settle the lawsuit.","collocation[2]":"settle a question/matter","example[29]":"It is the area of pricing which may settle the question of which to buy.","collocation[3]":"settle your differences","example[30]":"The two recently met to settle their differences.","collocation[4]":"settle something finally/eventually","example[31]":"The case was finally settled by the Appeal Court.","collocation[5]":"settle something amicably","example[32]":"The dispute was settled amicably.","collocation[6]":"settle out of court","example[33]":"She talked to a lawyer and settled out of court with her former employer.","definition[14]":"to end an argument by agreeing to do something","example[34]":"The two companies signed a pact that settled the patent suit.","example[35]":"Before the second phase of the trial, the company settled out of court (=ended the argument without having to go to court).","example[36]":"The bankruptcy trustee ultimatelysettled thedispute with shareholders.","note[7]":"settle something with somebody","definition[15]":"if prices on a market settle, they stop rising or falling and stay at a particular level for a period of time","example[37]":"Crude oil futures prices settled lower in light trading.","example[38]":"Proceeds from the sale will be used to settle debt to other creditors.","example[39]":"Credit cards are one of the best ways of settling bills when you travel abroad."}