{"word[0]":"come out","definition[0]":"if something comes out, it is removed from a place","example[0]":"These stains will never come out!","definition[1]":"if information comes out, people learn about it, especially after it has been kept secret","example[1]":"No doubt the truth will come out one day.","example[2]":"It’s come out that several ministers received payments from the company.","definition[2]":"if a photograph comes out, it shows a clear picture","example[3]":"I took some photographs, but they didn’t come out.","example[4]":"The wedding photos have come out really well.","definition[3]":"if a book, record etc comes out, it becomes publicly available","example[5]":"When is the new edition coming out?","definition[4]":"if something comes out in a particular way, that is what it is like after it has been made or produced","example[6]":"I’ve made a cake, but it hasn’t come out very well.","example[7]":"The cover has come out a bit too big.","definition[5]":"if something you say comes out in a particular way, that is how it sounds or how it is understood","example[8]":"His words came out as little more than a whisper.","example[9]":"That didn’t come out the way I meant it to.","example[10]":"I tried to explain everything to her, but it came out all wrong (=not in the way I intended).","definition[6]":"if someone comes out in a particular way, that is the situation they are in at the end of an event or series of events","example[11]":"The more experienced team came out on top.","example[12]":"She came out of the divorce quite well.","definition[7]":"to be easy to notice","example[13]":"His right-wing opinions come out quite strongly in his later writings.","definition[8]":"to say publicly that you strongly support or oppose a plan, belief etc","example[14]":"At least he’s got the courage to come out and say what he thinks.","example[15]":"The board of directors has come out in favour of a merger.","note[0]":" in favour of","example[16]":"Teachers have come out against the proposed changes.","note[1]":" against","definition[9]":"if the sun, moon, or stars come out, they appear in the sky","example[17]":"The sky cleared and the sun came out.","definition[10]":"if a flower comes out, it opens","example[18]":"The snowdrops were just starting to come out.","definition[11]":"if someone comes out, they say that they are gay when this was a secret before","example[19]":"That summer, I decided to come out to my parents.","definition[12]":"to refuse to work, as a protest","example[20]":"Nurses have threatened to come out in support of their pay claim.","example[21]":"We decided to come out on strike.","definition[13]":"if a young woman came out in the past, she was formally introduced into upper-class society at a large formal dance"}