{"word[0]":"model","signpost[0]":"small copy","definition[0]":"a small copy of a building, vehicle, machine etc, especially one that can be put together from separate parts","example[0]":"a working model  (=one with parts which move) of a steam engine","example[1]":"They showed us a model of the building.","note[0]":"model of","signpost[1]":"fashion","definition[1]":"someone whose job is to show clothes, hairstyles etc by wearing them at fashion shows or for photographs","example[2]":"a top fashion model","example[3]":"a male model","signpost[2]":"type of car etc","definition[2]":"a particular type or design of a vehicle or machine","example[4]":"Renault are introducing three new models at the show.","example[5]":"Our dishwasher is the latest model  (=newest design).","example[6]":"the 2.8 litre V6 model","signpost[3]":"description","definition[3]":"a computer representation or scientific description of something","example[7]":"Scientists are building computer models of the ocean currents.","signpost[4]":"somebody/something to copy","definition[4]":"someone or something which people want to copy because they are successful or have good qualities","example[8]":"He used English medieval architecture as his model.","example[9]":"Good teachers can act as positive role models.","note[1]":"role model","example[10]":"It served as a model for other cities.","note[2]":"model for","signpost[5]":"art","definition[5]":"someone who is employed by an artist or photographer to be painted or photographed","definition[6]":"to wear clothes at a fashion show or in magazine photographs in order to show them to people","example[11]":"She’s modeling Donna Karan’s fall collection.","example[12]":"Claire modelled for a few years when she was in her twenties.","definition[7]":"to do a computer representation or scientific description of a situation or event","example[13]":"They used a computer to model the possible effects of global warming.","definition[8]":"to make something by shaping clay, wood etc","example[14]":"the cheapest model in the Volkswagen range","example[15]":"Our photocopier is the latest model.","definition[9]":"a simple description or structure that is used to help people understand similar systems or structures","example[16]":"a theoretical model","example[17]":"a computer model of the main factors determining a company’s market share","definition[10]":"the way in which something is done by a particular country, person etc that can be copied by others who want similar results","example[18]":"the American model of airline deregulation"}