{"word[0]":"program","definition[0]":"a set of instructions given to a computer to make it perform an operation","example[0]":"a word-processing program","definition[1]":"the American spelling of programme","form[0]":"ADJECTIVES/NOUN + program","collocation[0]":"a computer program","example[1]":"The pictures were generated by a computer program.","collocation[1]":"a software program","example[2]":"a software program that aids in website design","collocation[2]":"a spreadsheet program","example[3]":"A spreadsheet program doesn't replace the traditional accounts package.","collocation[3]":"a word processing program","example[4]":"All word processing programs can check your spelling.","collocation[4]":"an anti-virus program","example[5]":"You should update your anti-virus program regularly.","collocation[5]":"write a program","example[6]":"They learned how to write their own programs.","collocation[6]":"run a program","example[7]":"You have to input this information every time you run the program.","collocation[7]":"use a program","example[8]":"The documentation explains how to use the program.","collocation[8]":"load/install a program","example[9]":"Is that program installed on your computer?","collocation[9]":"download a program","example[10]":"You can download the program and use it free of charge for 90 days.","definition[2]":"to give a computer a set of instructions that it can use to perform a particular operation","example[11]":"Any large high-speed computer can be programmed to learn.","example[12]":"attempts to program computers to produce and understand speech","note[0]":"program something to do something","definition[3]":"a set of instructions used to make a computer perform a particular task","synonym[0]":"SOFTWARE","example[13]":"a maker of database programs","example[14]":"You can download the program from their website.","definition[4]":"an important plan that will be continued over a period of time","example[15]":"The commission is in favour of the auto investment programs.","definition[5]":"to put a set of instructions into a computer or other machine to make it perform a particular task","example[16]":"The computer is programmed to calculate the likely loss of revenue in various imaginary situations.","definition[6]":"the American spelling of PROGRAMME"}