{"word[0]":"confidence","signpost[0]":"feeling somebody/something is good","definition[0]":"the feeling that you can trust someone or something to be good, work well, or produce good results","example[0]":"She had complete confidence in the doctors.","example[1]":"Opinion polls show that voters have lost confidence in the administration.","example[2]":"Public confidence in the government is at an all-time low.","note[0]":"confidence in","signpost[1]":"belief in yourself","definition[1]":"the belief that you have the ability to do things well or deal with situations successfully","example[3]":"I felt I was doing well and my confidence began to grow.","example[4]":"I didn’t have any confidence in myself.","example[5]":"Good training will give a beginner the confidence to enjoy skiing.","note[1]":"confidence to do something","example[6]":"Our goal is to prepare students to go into the business world with confidence.","note[2]":"with confidence","signpost[2]":"feeling something is true","definition[2]":"the feeling that something is definite or true","example[7]":"How can anyone say with confidence that the recession is over?","note[3]":"say/speak/predict etc with confidence","example[8]":"I have complete confidence in Mr Wright’s analysis of the situation.","example[9]":"I have every confidence that the job will be completed satisfactorily on time.","note[4]":"have confidence (that)","signpost[3]":"keep information secret","definition[3]":"if you tell someone something in confidence, you tell them something on the understanding that they will not tell anyone else","example[10]":"Any information given during the interview will be treated in the strictest confidence.","note[5]":"in strict/the strictest confidence","example[11]":"Lawyers are satisfied that no breach of confidence took place.","note[6]":"breach of confidence","example[12]":"I’ll tell you about Moira – in confidence, of course.","note[7]":"in confidence","signpost[4]":"a secret","definition[4]":"a secret or a piece of information that is private or personal","example[13]":"I have never betrayed a confidence.","example[14]":"They spent their evenings drinking wine and sharing confidences.","note[8]":"share/exchange confidences","heading[0]":"– Meaning 1: the feeling that you can trust someone or something to be good, work well, or produce good results","collocation[0]":"have confidence in somebody/something","example[15]":"The people no longer have any confidence in their government.","collocation[1]":"lose confidence in somebody/something","example[16]":"Employees are losing confidence in the company.","collocation[2]":"gain/win somebody’s confidence","example[17]":"As team captain, he soon won the confidence of the players.","collocation[3]":"inspire confidence","example[18]":"Our education system should inspire public confidence.","collocation[4]":"restore confidence","example[19]":"Interest rate reductions would restore business confidence.","collocation[5]":"boost confidence","example[20]":"The government is keen to boost consumer confidence and spending.","collocation[6]":"shake somebody’s confidence","example[21]":"The stock market fall has shaken the confidence of investors.","collocation[7]":"undermine/damage/weaken somebody’s confidence","example[22]":"The situation in the US was undermining foreign confidence in the dollar.","collocation[8]":"destroy/shatter confidence in somebody/something","example[23]":"A further crisis has destroyed public confidence in the bank.","collocation[9]":"have every/complete/absolute confidence in somebody/something","example[24]":"A manager must be able to have complete confidence in his staff.","collocation[10]":"a lack of confidence","example[25]":"the public’s lack of confidence in the National Health Service","collocation[11]":"a crisis of confidence","example[26]":"the crisis of confidence over food safety","form[0]":"ADJECTIVES/NOUN + confidence","collocation[12]":"public confidence","example[27]":"The changes should improve public confidence in the system.","collocation[13]":"consumer confidence","example[28]":"Consumer confidence has fallen to its lowest for two years.","collocation[14]":"business confidence","example[29]":"The region has gained 46,000 jobs and business confidence is high.","collocation[15]":"investor confidence","example[30]":"A fall in the value of shares damages investor confidence.","heading[1]":"– Meaning 2: the belief that you have the ability to do things well or deal with situations successfully","collocation[16]":"have confidence","example[31]":"Young teenagers often don’t have a lot of confidence.","collocation[17]":"be full of confidence","example[32]":"The team are full of confidence.","collocation[18]":"brim with confidence","example[33]":"Clive walked into the room, brimming with confidence as usual.","collocation[19]":"exude/radiate confidence","example[34]":"As the leader, you have to exude confidence and authority.","collocation[20]":"lack/be lacking in confidence","example[35]":"She lacked the confidence to talk to people.","collocation[21]":"lose (your) confidence","example[36]":"He’d been out of work for six months and had lost all his confidence.","collocation[22]":"give somebody confidence","example[37]":"I had really good teachers who gave me a lot of confidence in myself.","collocation[23]":"gain confidence","example[38]":"Paul did well in the job and gained a lot of confidence.","collocation[24]":"boost/increase somebody’s confidence","example[39]":"One of my stories was published, which really boosted my confidence.","collocation[25]":"build up somebody’s confidence","example[40]":"When you’ve had an accident, it takes a while to build up your confidence again.","collocation[26]":"undermine somebody’s confidence","example[41]":"His constant criticism was undermining my confidence.","collocation[27]":"dent/shake somebody’s confidence","example[42]":"A bad experience like that can dent your confidence.","collocation[28]":"destroy/shatter somebody’s confidence","example[43]":"When she failed her degree, it shattered her confidence.","collocation[29]":"somebody’s confidence grows/increases","example[44]":"Since she started her new school, her confidence has grown a lot.","collocation[30]":"a confidence boost","example[45]":"They offered me the job immediately, which was a real confidence boost.","collocation[31]":"confidence building","example[46]":"Training for a big match is all about confidence building.","example[47]":"She had always suffered from insecurity and a lack of confidence.","collocation[32]":"a loss of confidence","example[48]":"As people age, they may suffer from a loss of confidence.","definition[5]":"the feeling that you have the ability to do things well, and to not make mistakes or be nervous in new situations","example[49]":"You need patience and confidence to be a good teacher.","example[50]":"‘We have the confidence to beat Brazil, ’ said Sampson.","example[51]":"After the accident it took a long time before she had the confidence to get back in a car again.","example[52]":"I went into the test full of confidence, but it was more difficult than I had imagined.","display[0]":"self-confidence","definition[6]":"a strong belief that you can do things well and that other people will like you, which means you behave confidently in most situations","example[53]":"He’s new in the job but he has plenty of self-confidence.","example[54]":"Studies show that girls tend to lose some of their self-confidence in their teenage years.","example[55]":"Students who get some kind of work experience develop greater self-confidence and better communication skills.","display[1]":"morale","definition[7]":"the level of confidence, satisfaction, and hope that people feel, especially a group of people who work together","example[56]":"Morale among the soldiers has been low.","example[57]":"They sang songs to keep up their morale until the rescuers arrived.","display[2]":"assurance/self-assurance","definition[8]":"a feeling of calm confidence in your own abilities, especially because you have a lot of experience","example[58]":"She envied the older woman’s assurance.","example[59]":"Danby spoke to the committee with the self-assurance of an expert.","display[3]":"self-esteem","definition[9]":"the feeling that you are someone who deserves to be liked and respected","example[60]":"Getting a job did a lot for her self-esteem.","example[61]":"Sports should build a child’s self-esteem, not damage it.","definition[10]":"the feeling that you can trust someone or something to do what they say, work properly etc","example[62]":"We have every confidence in the sales and marketing team.","example[63]":"Our top priority is to maintain customer confidence in our product.","definition[11]":"the feeling felt by businesses and investors that the economic situation will not become very bad","example[64]":"Economic confidence was raised further by trade deregulation and lower interest rates.","example[65]":"Confidence in the housing market stands at a 15-month high.","example[66]":"A report by the Confederation of British Industry says Britain is enjoying the biggest increase in business confidence for ten years."}