{"comparative[0]":"longer","superlative[0]":"longest","signpost[0]":"great length","definition[0]":"measuring a great length from one end to the other","example[0]":"a long table","example[1]":"long hair","example[2]":"the longest tunnel in the world","example[3]":"He stretched out his long legs.","example[4]":"a long line of people","signpost[1]":"great distance","definition[1]":"continuing or travelling a great distance from one place to another","example[5]":"a long distance","example[6]":"Springfield is a long way from Chicago.","example[7]":"Liz lives in Cheltenham, which is a long way away.","example[8]":"It’s a long walk to the shops from here.","note[0]":"long journey/walk/flight/drive etc","signpost[2]":"large amount of time","definition[2]":"continuing for a large amount of time, or for a larger amount of time than usual","example[9]":"a long period of time","example[10]":"a long history of success","example[11]":"He has a long memory.","example[12]":"She’s recovering from a long illness.","example[13]":"Doctors often work long hours (=work for more time than is usual).","example[14]":"There was a long silence before anybody spoke.","note[1]":"long silence/pause/delay etc","example[15]":"It took me the longest time to figure out how to open the windows.","note[2]":"the longest time","example[16]":"He’s been gone a long time.","note[3]":"(for) a long time/while","example[17]":"I haven’t been there for a long while.","example[18]":"It took a long time to get everything ready.","example[19]":"She died a long time ago.","signpost[3]":"particular length/distance/time","definition[3]":"used to talk or ask about a particular length, distance, or time","example[20]":"How long is your garden?","example[21]":"How long is the film?","example[22]":"The cable is not quite long enough.","example[23]":"The bridge is 140 feet long.","note[4]":"two metres/three miles etc long","example[24]":"The speech was twenty minutes long.","note[5]":"two hours/three days etc long","signpost[4]":"writing","definition[4]":"containing a lot of words, letters, names, or pages","example[25]":"a long novel","example[26]":"a long list","example[27]":"He has a very long name.","example[28]":"He owes money to a list of people as long as your arm (=a very long list).","definition[5]":"covering all of your arms or legs","example[29]":"a long dress","example[30]":"a long-sleeved shirt","signpost[5]":"tiring/boring","definition[6]":"making you feel tired or bored","example[31]":"It’s been a long day.","signpost[6]":"vowel","definition[7]":"a long vowel in a word is pronounced for a longer time than a short vowel with the same sound","example[32]":"I had a nice long bath","bad_example[0]":"I had a long nice bath","example[33]":"She wore a long black coat","bad_example[1]":"She wore a black long coat","definition[8]":"continuing for a long time","example[34]":"The film was very long.","example[35]":"There has been a long period without rain.","display[0]":"lengthy","definition[9]":"continuing for a long time, especially longer than you want or expect","example[36]":"Drivers face lengthy delays on all roads out of the city.","example[37]":"Police are going through the lengthy process of re-examining all the evidence.","example[38]":"He faces a lengthy prison sentence.","display[1]":"long-running","definition[10]":"continuing for a long time – used especially about disputes, campaigns, or shows","example[39]":"He has been involved in a long-running dispute with his neighbour.","example[40]":"The programme is one of the longest-running series on television.","example[41]":"a long-running campaign to prevent the airport from being built","display[2]":"long-lasting","definition[11]":"continuing for a long time – used especially about effects or relationships","example[42]":"Stress can have long-lasting effects.","example[43]":"While at the school, she made many long-lasting friendships.","display[3]":"protracted","definition[12]":"continuing for a long time, especially an unusually long time","example[44]":"Despite protracted negotiations, they were unable to reach an agreement.","example[45]":"The couple have been involved in a protracted battle for custody of their children.","display[4]":"prolonged","definition[13]":"continuing for a long time, especially longer than expected, or longer in a way that makes a situation worse","example[46]":"He returned to work after a prolonged absence.","example[47]":"Studies have linked prolonged use of the drug to cancer.","example[48]":"a prolonged period of economic decline","display[5]":"extended","definition[14]":"continuing for a long time – used especially about visits, trips, breaks etc that last longer than was planned","example[49]":"an extended stay in hospital","example[50]":"He took an extended break from work after his father died.","example[51]":"She didn’t like being away from home for extended periods.","display[6]":"lasting","definition[15]":"strong enough or great enough to continue for a long time","example[52]":"The negotiations were aimed at achieving a lasting peace.","example[53]":"This affair has done lasting damage to the president’s credibility.","example[54]":"The book left a lasting impression on me.","display[7]":"enduring","definition[16]":"continuing for a long time – used especially about memories, influences, or feelings of liking someone or something","example[55]":"One of my most enduring memories is of going on holiday to France with my parents.","example[56]":"the enduring appeal of Conan Doyle’s stories","example[57]":"his enduring love for Ireland","display[8]":"marathon","definition[17]":"continuing for a very long time and needing a lot of energy, patience, or determination","example[58]":"It was a marathon session of talks which continued until 3 am.","example[59]":"He arrived after a marathon journey across Europe.","heading[0]":"too long","display[9]":"long-winded","definition[18]":"continuing for too long – used about speeches, answers, explanations etc","example[60]":"a very long-winded answer to a simple question","example[61]":"He gave a long-winded speech about the company’s vision for the future.","display[10]":"interminable","definition[19]":"very long and boring","example[62]":"They faced an interminable wait in the departure lounge of the airport.","example[63]":"The journey seemed interminable.","display[11]":"long-drawn-out","definition[20]":"used about a process that continues for much too long","example[64]":"The news heightened expectations that the long-drawn-out investigation might be coming to a close.","definition[21]":"for a long time","example[65]":"Have you been waiting long?","example[66]":"Reform of the law is long overdue.","example[67]":"long established traditions","definition[22]":"used to ask and talk about particular amounts of time","example[68]":"How long will it take to get there?","example[69]":"Try to keep going for as long as possible.","example[70]":"It took me longer than I thought it would.","definition[23]":"at a time that is a long time before or after a particular time","example[71]":"It wasn’t long before (=soon) Lisa arrived.","example[72]":"This all happened long before you were born.","note[6]":"long before/after something","example[73]":"He should have left her long ago.","note[7]":"long ago/since","definition[24]":"to want something very much, especially when it seems unlikely to happen soon","example[74]":"He longed to see her again.","note[8]":"long to do something","example[75]":"She longed for the chance to speak to him in private.","note[9]":"long for","example[76]":"She longed for him to return.","note[10]":"long for somebody to do something","definition[25]":"possessing shares, bonds, currencies etc because you believe that their value is going to increase","example[77]":"Those who were long on dollars rushed to sell them.","note[11]":"long on","definition[26]":"if you work long hours or a long day, you work for more time than is usual","example[78]":"Tax specialists often work long hours during assessment time.","definition[27]":"to buy or keep bonds, shares, currencies etc because you believe that their value will rise","example[79]":"He reversed short positions and went long on Hong Kong stocks.","example[80]":"Dealers are going long on dollars in expectation of today’s release of strong US trade figures."}