{"word[0]":"patience","definition[0]":"the ability to continue waiting or doing something for a long time without becoming angry or anxious","opposite[0]":"impatience","example[0]":"I wouldn’t have the patience to sit sewing all day.","example[1]":"a good listener who has infinite patience","note[0]":"infinite/unlimited/endless patience","definition[1]":"the ability to accept trouble and other people’s annoying behaviour without complaining or becoming angry","note[1]":"the patience of Job/the patience of a saint (=very great patience when someone is annoying you)","example[2]":"You’ll need patience and understanding if you’re going to be a teacher.","example[3]":"It will take time and patience to get these changes accepted.","example[4]":"Celia’s patience suddenly snapped and she told them to shut up.","example[5]":"Henry’s negative attitude is beginning to try my patience  (=make me lose my patience).","example[6]":"She has no patience with time-wasters.","note[2]":"have little/no patience with somebody","example[7]":"I’m beginning to lose patience with you people.","note[3]":"lose/run out of patience (with somebody)","definition[2]":"a card game for one player","collocation[0]":"have the patience to do something","example[8]":"He didn't have the patience to listen to another point of view.","example[9]":"I'm afraid I have little patience with bureaucrats and their official rules.","collocation[1]":"lose patience (with somebody)","example[10]":"Eventually his family lost patience with him and his irresponsible behaviour.","collocation[2]":"run out of patience (with somebody)","example[11]":"She was wonderful with the children, and never ran out of patience.","collocation[3]":"try/test/tax somebody's patience","example[12]":"The guy at the desk was beginning to try my patience.","collocation[4]":"exhaust somebody's patience","example[13]":"He turned away from me, as if I had exhausted his patience.","collocation[5]":"somebody's patience is wearing thin","example[14]":"People's patience is wearing thin as the queues for visas get longer.","collocation[6]":"somebody's patience snaps","example[15]":"Celia's patience snapped when he dropped a second glass of wine on the carpet.","collocation[7]":"somebody's patience is rewarded","example[16]":"After two hours, their patience was rewarded and they saw the bird.","collocation[8]":"great patience","example[17]":"Painting by this method requires great patience.","collocation[9]":"infinite/endless/unlimited patience","example[18]":"She was lucky to have a maths teacher with infinite patience.","collocation[10]":"the patience of Job/a saint","example[19]":"Those children would try the patience of a saint."}