{"word[0]":"risk","definition[0]":"the possibility that something bad, unpleasant, or dangerous may happen","synonym[0]":"danger","example[0]":"Skiers always face the risk of serious injury.","note[0]":"risk of","example[1]":"There is a risk that the disease may spread further.","note[1]":"risk (that)","example[2]":"There is no risk to public health.","note[2]":"risk to","definition[1]":"an action that might have bad results","note[3]":"calculated risk (=a risk you take because you think a good result is quite likely)","example[3]":"It was a risk, sending a letter to my house.","example[4]":"Isn’t he taking a bit of a risk in coming here?","note[4]":"take a risk","example[5]":"I couldn’t take the risk of leaving him alone even for a short time.","note[5]":"take the risk of doing something","definition[2]":"something or someone that is likely to cause harm or danger","example[6]":"Meat from the infected animals is regarded as a serious health risk (=something likely to harm people’s health).","example[7]":"The tyre dump is a major fire risk (=something that could cause a dangerous fire).","example[8]":"She’s becoming a security risk (=someone who may tell important secrets to an enemy).","example[9]":"Polluted water supplies are a risk to public health.","definition[3]":"a person or business judged according to the danger involved in giving them insurance or lending them money","example[10]":"Drivers under 21 are regarded as poor risks by insurance companies.","note[6]":"good/bad/poor risk","example[11]":"Professional sport involves a relatively high risk of injury.","example[12]":"The risks of failure are quite low.","collocation[0]":"considerable","example[13]":"Starting up your own business involves considerable risks.","collocation[1]":"a big/great/huge risk","example[14]":"There is a great risk that the wound will become infected.","collocation[2]":"an increased/reduced risk","example[15]":"Those who smoke have an increased risk of heart disease.","collocation[3]":"a real risk","example[16]":"There is a real risk that there could be another war.","collocation[4]":"a serious/grave risk","example[17]":"The most serious risk of flooding this evening is on the River Wye.","collocation[5]":"a potential risk","example[18]":"The potential risks associated with this operation should not be ignored.","collocation[6]":"a financial risk","example[19]":"There is relatively little financial risk for the company.","collocation[7]":"a political risk","example[20]":"The political risks for the president are minimal.","collocation[8]":"attendant risks","example[21]":"Those who deal with firearms are generally aware of the attendant risks.","collocation[9]":"carry a risk","example[22]":"Most medical operations carry some risk.","collocation[10]":"pose a risk","example[23]":"Climate change poses serious risks to the environment.","collocation[11]":"involve/entail risk","example[24]":"Investments that provide a high return generally entail more risk.","collocation[12]":"reduce/minimize a risk","example[25]":"This diet could reduce your risk of certain cancers.","collocation[13]":"increase a risk","example[26]":"Smoking increases the risk of heart disease.","collocation[14]":"eliminate risk","example[27]":"You can’t eliminate risk in your life completely.","collocation[15]":"avoid a risk","example[28]":"They are anxious to avoid any risk of criticism.","collocation[16]":"face a risk","example[29]":"The dominant male faces the risk that adult males from the group will attack him.","form[0]":"risk + NOUN","collocation[17]":"a risk factor","example[30]":"High cholesterol is one of the risk factors associated with heart disease.","collocation[18]":"risk assessment","example[31]":"Engineering risk assessment is based on objective scientific criteria.","collocation[19]":"there is a risk","example[32]":"There is always a risk that mistakes will be made.","collocation[20]":"an element/degree of risk","example[33]":"There is always an element of risk in flying.","collocation[21]":"be worth the risk","example[34]":"Don’t walk home alone at night – it’s not worth the risk.","collocation[22]":"the risks involved/the risks associated with something","example[35]":"The soldiers were well aware of the risks involved.","example[36]":"The public are unwilling to accept the risks associated with nuclear energy.","collocation[23]":"the benefits outweigh the risks","example[37]":"The benefits to patients who are taking the drug far outweigh the risks.","definition[4]":"to put something in a situation in which it could be lost, destroyed, or harmed","example[38]":"When children start smoking, they don’t realize that they’re risking their health.","example[39]":"He risked his life helping others to escape.","example[40]":"I’m not going to risk my neck (=risk my life) just to save a common criminal.","example[41]":"Why risk life and limb (=risk your life and health) jumping out of a plane just to raise money for charity?","example[42]":"He’s prepared to risk everything to avoid this war.","note[7]":"risk something to do something","example[43]":"You’d be crazy to risk your money on an investment like that!","note[8]":"risk something on something","definition[5]":"to get into a situation where something unpleasant may happen to you","example[44]":"He would prefer not to risk another embarrassing defeat.","note[9]":"risk defeat/death etc","example[45]":"Some people are prepared to risk imprisonment for what they believe.","example[46]":"Workers who broke the strike risked being attacked when they left the factory.","note[10]":"risk being seen/caught/arrested etc","example[47]":"They may even risk losing their homes.","note[11]":"risk doing something","definition[6]":"to do something that you know may have dangerous or unpleasant results","example[48]":"She risked a glance back over her shoulder.","example[49]":"You could slip out of school between classes, but I wouldn’t risk it.","example[50]":"Are you prepared to risk traveling without an armed guard?","explanation[0]":"Risk is followed by an -ing form, not an infinitive You say","example[51]":"They risk being shot if they are caught","bad_example[0]":"They risk to be shot","definition[7]":"the possibility that something may be lost, harmed, or damaged, or that something bad, unpleasant, or dangerous may happen","example[52]":"If you’re considering starting a business, think carefully about the risks involved.","example[53]":"If your cheque book is lost or stolen, let your bank know immediately in order to reduce the risk of fraud on your account.","example[54]":"This is one high-technology venture that is fairly low in financial risk.","example[55]":"There is always a risk that the supplier will go out of business before the order is delivered.","note[12]":"risk that","definition[8]":"the possibility that the value of an asset may go up or down on the stockmarket","example[56]":"There is always some risk with any kind of investment.","example[57]":"Fund managers have the resources and time to make judgments on which non-rated bonds are worth the risk.","definition[9]":"the possibility that a person or business will not pay back a loan","example[58]":"Many banks will not lend to high-risk borrowers.","definition[10]":"the possibility of a particular type of damage against which you are insured","example[59]":"Check in detail the risks that are covered by your policy.","definition[11]":"a person or business judged according to the risk involved in providing them with insurance or lending them money","example[60]":"People with previous heart attacks are considered to be higher insurance risks.","definition[12]":"to be in a situation where there is a risk of something bad happening to you","example[61]":"If you fail to pay your bill, you run the risk of having your electricity supply cut off.","definition[13]":"to decide to do something even though you know it may have bad results","example[62]":"The choice facing the Government is whether or not to take a risk with inflation by reducing interest rates.","definition[14]":"if something is at risk, it is in a situation where it may be damaged or lost","example[63]":"We have to stop these rumours; the firm’s reputation is at risk.","example[64]":"Older workers are most at risk of experiencing long-term unemployment.","example[65]":"Your home is at risk  (=you might lose it) if you do not keep up repayments on the loan.","definition[15]":"if you do something at your own risk, you do it when you understand the possible dangers and have been warned about them","example[66]":"All tours are undertaken at the visitor’s own risk.","example[67]":"You’d have to be crazy to risk your money on an investment like that!","example[68]":"They risked their financial future on a brand-new business venture.","example[69]":"The workers risked dismissal without compensation if the strike continued.","example[70]":"No bank would risk giving them a loan."}