{"word[0]":"appreciate","definition[0]":"to understand how serious or important a situation or problem is or what someone’s feelings are","synonym[0]":"realize","example[0]":"He did not fully appreciate the significance of signing the contract.","note[0]":"appreciate the significance/importance/value of something","example[1]":"We appreciate that caring for children is an important job.","note[1]":"appreciate that","example[2]":"It is difficult to appreciate how bad the situation had become.","note[2]":"appreciate what/how/why","definition[1]":"used to thank someone in a polite way or to say that you are grateful for something they have done","example[3]":"Thanks ever so much for your help, I really appreciate it.","example[4]":"I appreciate your concern, but honestly, I’m fine.","example[5]":"I’d appreciate it if you let me get on with my job.","definition[2]":"to understand how good or useful someone or something is","example[6]":"Her abilities are not fully appreciated by her employer.","example[7]":"I’m not an expert, but I appreciate fine works of art.","definition[3]":"to gradually become more valuable over a period of time","opposite[0]":"depreciate","example[8]":"Most investments are expected to appreciate at a steady rate.","example[9]":"I appreciate your advice","example[10]":"I appreciate having your advice","bad_example[0]":"I appreciate to have your advice","explanation[0]":"Appreciate is not used in the progressive in meanings 1,2, and 3 You say","example[11]":"I appreciate what you are saying","bad_example[1]":"I am appreciating what you are saying","explanation[1]":"Appreciate is used in the progressive in meaning 4","example[12]":"The value of his work is still appreciating","definition[4]":"to increase in value","example[13]":"Their art collection has appreciated substantially, almost doubling in value.","definition[5]":"when a currency appreciates, it increases in value compared to other currencies","example[14]":"The Egyptian pound has appreciated against other currencies, and this is not good for Egyptian exporters.","note[3]":"appreciate against"}