{"past_tense[0]":"took","past_participle[0]":"taken","definition[0]":"to move or go with someone or something from one place to another","opposite[0]":"bring","example[0]":"Barney took us to the airport.","note[0]":"take somebody/something to/into etc something","example[1]":"Would you mind taking Susie home?","example[2]":"When he refused to give his name, he was taken into custody.","example[3]":"My job has taken me all over the world.","example[4]":"His wife went to Australia, taking the children with her.","note[1]":"take somebody/something with you","example[5]":"I have to take Steve the money tonight.","note[2]":"take somebody something","example[6]":"He took me to meet his parents.","note[3]":"take somebody to do something","signpost[0]":"action","definition[1]":"used with a noun instead of using a verb to describe an action. For example, if you take a walk, you walk somewhere","example[7]":"Would you like to take a look?","example[8]":"Mike’s just taking a shower.","example[9]":"Sara took a deep breath.","example[10]":"I waved, but he didn’t take any notice (=pretended not to notice). British English","example[11]":"Please take a seat (=sit down).","example[12]":"Would you mind taking a photo of us together?","note[4]":"take a picture/photograph/photo","signpost[1]":"remove","definition[2]":"to remove something from a place","example[13]":"Police say money and jewellery were taken in the raid.","example[14]":"Take your feet off the seats.","note[5]":"take something off/from etc something","example[15]":"Someone’s taken a pen from my desk.","signpost[2]":"time/money/effort etc","definition[3]":"if something takes a particular amount of time, money, effort etc, that amount of time etc is needed for it to happen or succeed","example[16]":"How long is this going to take?","example[17]":"Organizing a successful street party takes a lot of energy.","example[18]":"It took me ages to find a present for Dad.","note[6]":"take (somebody) ages/forever","example[19]":"Catching up four goals will take some doing.","note[7]":"take some doing","example[20]":"It takes courage to admit you are wrong.","note[8]":"take courage/guts","example[21]":"Neil’s got what it takes to be a great footballer.","note[9]":"have what it takes","example[22]":"Repairs take time to carry out.","note[10]":"take (somebody) something (to do something)","example[23]":"It took a few minutes for his eyes to adjust to the dark.","signpost[3]":"accept","definition[4]":"to accept or choose something that is offered, suggested, or given to you","note[11]":"I take your point/point taken (=used to say that you accept someone’s opinion)","example[24]":"Will you take the job?","example[25]":"Do you take American Express?","example[26]":"If you take my advice, you’ll see a doctor.","example[27]":"Our helpline takes 3.5 million calls (=telephone calls) a year.","example[28]":"Some doctors are unwilling to take new patients without a referral.","example[29]":"Liz found his criticisms hard to take.","example[30]":"I just can’t take any more (=can’t deal with a bad situation any longer).","example[31]":"Staff have agreed to take a 2% pay cut.","example[32]":"Small businesses took a hammering in the last recession.","note[12]":"take a hammering/beating","example[33]":"That’s the truth – take it from me.","note[13]":"take somebody’s word for it/take it from somebody","example[34]":"He’s the kind of man who makes things happen but lets others take the credit.","note[14]":"take the credit/blame/responsibility","example[35]":"It isn’t official yet, but you can take it as read that you’ve got the contract.","note[15]":"take it as read/given","signpost[4]":"hold something","definition[5]":"to get hold of something in your hands","example[36]":"Let me take your coat.","example[37]":"Can you take this package while I get my wallet?","example[38]":"I just wanted to take him in my arms.","note[16]":"take somebody/something in/by something","definition[6]":"to use a particular form of transport or a particular road in order to go somewhere","example[39]":"Let’s take a cab.","example[40]":"I took the first plane out.","example[41]":"Take the M6 to Junction 19.","signpost[5]":"study","definition[7]":"to study a particular subject in school or college for an examination","example[42]":"Are you taking French next year?","definition[8]":"to do an examination or test","example[43]":"Applicants are asked to take a written test.","definition[9]":"to be the correct or suitable size, type etc for a particular person or thing","example[44]":"a car that takes low sulphur fuel","example[45]":"What size shoe do you take?","example[46]":"The elevator takes a maximum of 32 people.","explanation[0]":"In this meaning, take is not used in the progressive You say","example[47]":"I take size 12","bad_example[0]":"I’m taking size 12","signpost[6]":"collect","definition[10]":"to collect or gather something for a particular purpose","example[48]":"Investigators will take samples of the wreckage to identify the cause.","example[49]":"The police took a statement from both witnesses.","note[17]":"take something from something","definition[11]":"to react to someone or something or consider them in a particular way","example[50]":"She does not take kindly to criticism  (=reacts badly to criticism).","example[51]":"I take it (=I assume) you’ve heard that Rick’s resigned.","example[52]":"I was joking, but he took me seriously.","note[18]":"take somebody/something seriously/badly/personally etc","example[53]":"Ben took the news very badly.","example[54]":"The presence of dust clouds has been taken as evidence of recent star formation.","note[19]":"take something as evidence/proof (of something)","example[55]":"I’ll take that remark as a compliment.","note[20]":"take something as something","example[56]":"I took her to be his daughter.","note[21]":"take somebody/something to be something","example[57]":"Of course I won’t tell anyone! What do you take me for? (=what sort of person do you think I am?)","note[22]":"take somebody/something for something","type[0]":"transitive usually + adverb","definition[12]":"to have or experience a particular feeling","example[58]":"You should take pride in your work.","note[23]":"take delight/pleasure/pride etc in (doing) something","example[59]":"At first, he took no interest in the baby.","example[60]":"She stood feeling lost until an elderly man took pity on her.","note[24]":"take pity on somebody","example[61]":"Don’t take offence. Roger says things like that to everybody.","note[25]":"take offence","example[62]":"Investors can take comfort from the fact that the World Bank is underwriting the shares.","note[26]":"take comfort from/in (doing) something","definition[13]":"to get possession or control of something","note[27]":"take the lead (=in a race, competition etc)","example[63]":"Enemy forces have taken the airport.","example[64]":"Both boys were taken prisoner.","example[65]":"The communists took power in 1948.","note[28]":"take control/charge/power","example[66]":"Youngsters need to take control of their own lives.","signpost[7]":"medicine/drugs","definition[14]":"to swallow, breathe in, inject etc a drug or medicine","example[67]":"The doctor will ask whether you are taking any medication.","example[68]":"Take two tablets before bedtime.","example[69]":"She took an overdose after a row with her boyfriend.","example[70]":"Most teenagers start taking drugs through boredom.","note[29]":"take drugs","signpost[8]":"level","definition[15]":"to make someone or something go to a higher level or position","example[71]":"Even if you have the talent to take you to the top, there’s no guarantee you’ll get there.","example[72]":"If you want to take it further, you should consult an attorney.","example[73]":"The latest raise takes his salary into six figures.","note[30]":"take something to/into something","signpost[9]":"measure","definition[16]":"to measure the amount, level, rate etc of something","example[74]":"Take the patient’s pulse first.","signpost[10]":"numbers","definition[17]":"to make a number smaller by a particular amount","synonym[0]":"subtract","example[75]":"‘Take four from nine and what do you get?’ ‘Five.’","note[31]":"take something away/take something (away) from something","example[76]":"Ten take away nine equals one.","definition[18]":"if a shop, business etc takes a particular amount of money, it receives that amount of money from its customers","example[77]":"The stall took £25 on Saturday.","signpost[11]":"teach","definition[19]":"to teach a particular group of students in a school or college","example[78]":"Who takes you for English?","note[32]":"take somebody for something","signpost[12]":"write","definition[20]":"to write down information","example[79]":"Let me take your email address.","example[80]":"Sue offered to take notes.","definition[21]":"if a man takes someone, he has sex with them","signpost[13]":"have an effect","definition[22]":"if a treatment, dye, drug etc takes, it begins to work successfully","example[81]":"Don’t forget to take your keys.","example[82]":"Shall I take you home?","example[83]":"I took Alice a cup of tea.","definition[23]":"to take someone or something to the place where you are now","example[84]":"We’ve brought someone to see you!","example[85]":"Will you bring your photos with you when you come?","display[0]":"transport","definition[24]":"to take large quantities of goods from one place to another in a plane, train, ship etc","example[86]":"The plane is used for transporting military equipment.","example[87]":"The coal was transported by rail.","display[1]":"deliver","definition[25]":"to take goods, letters, newspapers etc to someone’s home or office","example[88]":"Unfortunately, the package was delivered to the wrong address.","display[2]":"fly","definition[26]":"to take someone or something somewhere by plane","example[89]":"The bread is specially flown in from Paris.","definition[27]":"to take goods from one place to another – this can be by ship, truck, plane, or train","example[90]":"Half the whisky is shipped to Japan and the US.","display[3]":"carry","definition[28]":"to take people or goods somewhere – used especially when saying how many people or things, or what kind","example[91]":"The new plane can carry up to 600 passengers.","example[92]":"The ship was carrying a full cargo of oil.","display[4]":"lead","definition[29]":"to take someone to a place by going in front of them","example[93]":"He led Julia through the house to his study.","example[94]":"Roland led the way back to the car in silence.","display[5]":"guide","definition[30]":"to take someone to a place and show them the way","example[95]":"Emily guided him through a side gate into a large garden.","display[6]":"escort","definition[31]":"to take someone to a place and protect or guard them","example[96]":"The prisoner was escorted into the room by two police officers.","example[97]":"The singer was escorted by her assistant and her bodyguard.","display[7]":"usher","definition[32]":"to politely lead someone somewhere and show them where to go, especially because it is your job to do this","example[98]":"We were ushered into the lift by a man in uniform.","definition[33]":"an occasion when a film scene, song, action etc is recorded","example[99]":"We had to do six takes for this particular scene.","definition[34]":"the amount of money earned by a shop or business in a particular period of time","definition[35]":"the amount of money earned by a business in a particular period of time","example[100]":"About 80% of the band’s take is from merchandise.","definition[36]":"to be willing to do something wrong or illegal in return for money","example[101]":"I knew he was on the take, but I never had enough evidence to prove it.","definition[37]":"to subtract one number from another number","example[102]":"Take three from nine and what do you get?","definition[38]":"if a business takes or takes in a particular amount of money, it earns that money from selling its goods and services","example[103]":"We usually take around £2000 on a Saturday."}