{"word[0]":"reaction","signpost[0]":"to a situation/event","definition[0]":"something that you feel or do because of something that has happened or been said","example[0]":"What was Jeff’s reaction when you told him about the job?","example[1]":"the government’s reaction to the fuel crisis","note[0]":"reaction to","example[2]":"An emergency fund was set up in reaction to the famine.","note[1]":"in reaction to something","signpost[1]":"to food/drugs","definition[1]":"if you have a reaction to a drug or to something you have eaten, it makes you ill","example[3]":"She had a severe allergic reaction to the drug.","note[2]":"have/suffer a reaction","example[4]":"Certain foods are more likely than others to cause allergic reactions.","note[3]":"cause/bring on/trigger a reaction","example[5]":"a reaction to the immunization","signpost[2]":"science","definition[2]":"a chemical change that happens when two or more substances are mixed together","example[6]":"a chemical reaction in the soil","definition[3]":"a physical force that is the result of an equally strong physical force in the opposite direction","definition[4]":"a change in people’s attitudes, behaviour, fashions etc that happens because they disapprove of the way in which things were done in the past","example[7]":"a reaction against the traditional values of the nineteenth century","note[4]":"reaction against","signpost[3]":"against change","definition[5]":"strong and unreasonable opposition to all social and political changes","example[8]":"The revolutionary movement was crushed by the forces of reaction.","heading[0]":"– Meaning 1: something that you feel or do because of something that has happened or been said","form[0]":"ADJECTIVES/NOUN + reaction","collocation[0]":"somebody’s first/initial/immediate reaction","example[9]":"His first reaction was to laugh.","collocation[1]":"somebody’s gut reaction","example[10]":"You must trust your gut reactions.","collocation[2]":"somebody’s instinctive reaction","example[11]":"Often your instinctive reaction is to blame someone else.","collocation[3]":"a natural reaction","example[12]":"Anger is a natural reaction if you feel undervalued.","collocation[4]":"a knee-jerk reaction","example[13]":"Environmentalists have a knee-jerk reaction against any development.","collocation[5]":"an emotional reaction","example[14]":"I was surprised by her emotional reaction to the news.","collocation[6]":"a positive/favourable reaction","example[15]":"There has been a positive reaction to the campaign.","collocation[7]":"a negative reaction","example[16]":"We are concerned about the negative reaction of some of our customers.","collocation[8]":"mixed reactions","example[17]":"The book met with mixed reactions.","collocation[9]":"a violent/angry reaction","example[18]":"The artists were surprised by the violent reactions to their work.","collocation[10]":"a delayed reaction","example[19]":"You’re suffering a delayed reaction to the accident.","collocation[11]":"the public reaction","example[20]":"The public reaction was less than encouraging.","collocation[12]":"provoke/produce/bring a reaction","example[21]":"The decision provoked an angry reaction from the local tourist industry.","collocation[13]":"get a reaction","example[22]":"We didn’t know what kind of reaction we would get.","collocation[14]":"gauge somebody’s reaction","example[23]":"He watched Jane’s face, trying to gauge her reaction.","collocation[15]":"judging by somebody’s reactions","example[24]":"Judging by the audience’s reactions, the show will be a great success.","heading[1]":"– Meaning 3: if you have a reaction to a drug or to something you have eaten, it makes you ill","collocation[16]":"an allergic reaction","example[25]":"If you develop an allergic reaction to your sunscreen, change it.","collocation[17]":"a bad reaction","example[26]":"She had a bad reaction to the medicine.","collocation[18]":"an adverse reaction","example[27]":"The patient died after having an adverse reaction to the drug.","collocation[19]":"a severe reaction","example[28]":"A severe allergic reaction to the drug has killed five Americans.","collocation[20]":"a slight/mild reaction","example[29]":"A spider’s venom usually causes only a slight reaction.","example[30]":"People who eat these products could have an allergic reaction.","example[31]":"Wheat is one of the foods that are most likely to cause a reaction.","definition[6]":"someone’s feelings, and how they behave, because of something that has happened or been said","example[32]":"I was stunned by the news, and my initial reaction was anger.","example[33]":"What was her reaction, when you told her that you were leaving?","display[0]":"response","definition[7]":"what you say or do when someone says or does something to you","example[34]":"The government’s immediate response was to reject the proposal.","example[35]":"The decision was made in response to requests from local residents.","example[36]":"We are still waiting to see if there is any response.","display[1]":"reception","definition[8]":"a particular type of reaction to someone’s ideas, work etc – used especially in the following phrases","example[37]":"The plan received warm reception from conference delegates  (=they liked it).","example[38]":"The film received a mixed reception and commercially it was not successful  (=many people did not like it).","example[39]":"The Association of Chief Police Officers gave the idea a cool reception  (=they did not like it very much).","example[40]":"Alford’s views met with a hostile reception  (=people were very disapproving).","display[2]":"feedback","definition[9]":"advice, criticism, praise etc that you give to someone, telling them how well they are working","example[41]":"Our English teacher gave us some feedback on our essays.","example[42]":"The feedback we have had from our customers has all been positive.","example[43]":"negative feedback","display[3]":"backlash","definition[10]":"an angry or violent reaction by a group of people to the actions or decisions of others","example[44]":"There has been a growing backlash against the government from angry voters.","example[45]":"fears of a right-wing backlash"}