{"signpost[0]":"area/space/building etc","definition[0]":"a space or area, for example a particular point on a surface or in a room, building, town, city etc","example[0]":"Make sure you keep the key in a safe place.","example[1]":"I’ve spent the day dashing about from place to place.","example[2]":"The place was full of screaming children.","example[3]":"He was threatening to burn the place down.","example[4]":"She had never been back to the place where the accident happened.","example[5]":"The theatre bar was our usual meeting place.","example[6]":"We were living then in a place called Alberiga.","example[7]":"The wall was quite damp in places (=in some places).","example[8]":"Did the accident happen at your place of work (=the place where you work)?","example[9]":"The Great Mosque has been a place of worship for Muslims for centuries.","example[10]":"This is a great place for a holiday.","note[0]":"place for","example[11]":"I couldn’t find a place to park.","note[1]":"a place to do something","signpost[1]":"home","definition[1]":"a house or apartment where someone lives","example[12]":"They’ve got quite a big place on the outskirts of Leeds.","example[13]":"It took us ages to find a place to live.","example[14]":"He’s staying with us until he can find a place of his own.","example[15]":"Do you want to come back to my place for coffee?","note[2]":"somebody’s place","signpost[2]":"space to sit or put something","definition[2]":"a space where someone can sit, or a space where you can put something","example[16]":"I might arrive a bit late, so could you save me a place?","example[17]":"There are still a few places left on the coach.","example[18]":"Make sure you put everything back in its proper place.","example[19]":"Can you find a good place for this vase?","signpost[3]":"point in book/speech","definition[3]":"a point that you have reached in a book or a speech","example[20]":"This would be a good place to stop and answer any questions that people have.","example[21]":"I used a bookmark so that I wouldn’t lose my place (=forget the point that I had reached).","signpost[4]":"opportunity to do something","definition[4]":"if someone has a place somewhere, they have the opportunity to go there or join in an activity","example[22]":"If you don’t come to training you might lose your place in the team.","note[3]":"place in","example[23]":"We’ve been trying to find her a place in a residential home.","example[24]":"He was offered a place on the management committee.","note[4]":"place on","example[25]":"There are still a couple of places left on the course.","example[26]":"I’ve been offered a place at York University.","note[5]":"place at","signpost[5]":"role/position","definition[5]":"the role or important position that someone or something has in a situation or in society","example[27]":"the old idea that a woman’s place is in the home","example[28]":"He finally reached the summit of Everest and secured his place in history.","example[29]":"Working has a very important place in all our lives.","collocation[0]":"a meeting place","example[30]":"The club was a meeting place for musicians.","collocation[1]":"a hiding place","example[31]":"He had watched the farm workers from his hiding place.","collocation[2]":"a resting place","example[32]":"This tomb is the last resting place of the Davison family.","collocation[3]":"somebody’s place of birth","example[33]":"I need to know his date of birth, and his place of birth.","collocation[4]":"somebody’s place of work/employment","example[34]":"Please give the address of your place of work.","collocation[5]":"somebody’s place of residence","example[35]":"By law, you must inform us if you change your place of residence.","collocation[6]":"somebody’s/something’s place of origin","example[36]":"I believe my mother's place of origin was Sierra Leone.","collocation[7]":"a place of safety","example[37]":"His young son had been sent away to a place of safety.","collocation[8]":"a place of refuge","example[38]":"If ever you need a place of refuge, come to us.","collocation[9]":"a place of worship","example[39]":"The church is much more than a place of worship.","collocation[10]":"a place of pilgrimage","example[40]":"Her grave became a place of pilgrimage.","definition[6]":"a point or area, especially one that you visit or use for a particular purpose","example[41]":"He’s been to lots of places.","example[42]":"a good meeting place","definition[7]":"the exact place where someone or something is, in relation to other things","example[43]":"She showed me the position of the village on the map.","example[44]":"I changed the position of the mirror slightly.","example[45]":"Jessica moved to a position where she could see the stage better.","definition[8]":"a particular place on a line or surface","example[46]":"At this point the path gets narrower.","example[47]":"No cars are allowed beyond this point.","display[0]":"spot","definition[9]":"a place, especially a particular kind of place, or a place where something happens. Spot sounds rather informal","example[48]":"She chose a sunny spot.","example[49]":"The area is a favourite spot for windsurfers.","example[50]":"This is the exact spot where I asked her to marry me.","display[1]":"location","definition[10]":"a place where someone or something is, or where something happens. Location  sounds more formal than place","example[51]":"your exact location","example[52]":"The prisoners were taken to an undisclosed location.","example[53]":"an ideal location for a winter break","display[2]":"site","definition[11]":"a place, especially one that will be used for a particular purpose, or where something important happened","example[54]":"the site of a great battle","example[55]":"There are plans to develop the site for housing.","example[56]":"The area has become a dumping site for nuclear waste.","display[3]":"venue","definition[12]":"a place where something such as a meeting, concert, game etc takes place","example[57]":"the venue for the next Olympic Games","example[58]":"The hotel is a popular wedding venue.","display[4]":"scene","definition[13]":"the place where something bad such as an accident or crime happened","example[59]":"the scene of the crime","example[60]":"Ambulance crews were at the scene within minutes.","display[5]":"setting","definition[14]":"the place and the area around it, where something is or where something happens","example[61]":"The hotel is in a beautiful setting.","example[62]":"the setting for the film ‘A Room With a View’","example[63]":"Beautiful gardens provide the perfect setting for outdoor dining.","display[6]":"somewhere","definition[15]":"used for talking about a place when you are not sure exactly which place","example[64]":"She came from somewhere in London.","display[7]":"whereabouts","definition[16]":"the place where someone or something is – used especially when you do not know this or do not want to tell people","example[65]":"The whereabouts of the painting is unknown.","example[66]":"He refused to disclose his whereabouts.","example[67]":"I’m not sure about her whereabouts.","heading[0]":"USAGE: Place, space","explanation[0]":"You use place when talking about a particular position or location Place is always countable","example[68]":"We visited some beautiful places","example[69]":"I found a place to put my boots","bad_example[0]":"I found some place to put my boots","explanation[1]":"You use space about the area that is available for doing something In this meaning, space is uncountable","example[70]":"We don't have enough space for a washing machine","bad_example[1]":"We don't have enough place for a washing machine","example[71]":"The children need more space to play","bad_example[2]":"The children need more place to play","explanation[2]":"You also use space about an area that you can use for doing something In this meaning, space is countable","example[72]":"There are very few parking spaces left","example[73]":"I found a space at the back of the bus","explanation[3]":"Someplace means ‘somewhere’ and is used especially in American English","example[74]":"I can't find my keys - I must have left them someplace","definition[17]":"to put something somewhere, especially with care","example[75]":"She poured the doctor a cup of tea and placed it on the table.","example[76]":"He carefully placed the folder back in his desk drawer.","signpost[6]":"situation","definition[18]":"to put someone or something in a particular situation","example[77]":"The government is being placed under pressure to give financial help to farmers.","example[78]":"Children must not be placed at risk.","example[79]":"Some areas of the city have been placed under curfew.","example[80]":"This places me in a very difficult position.","signpost[7]":"in a job/home","definition[19]":"to find a suitable job or home for someone","example[81]":"Some unemployed people can be very difficult to place.","example[82]":"He was later placed with a foster family.","signpost[8]":"arrange something","definition[20]":"to arrange for something to be done","example[83]":"He placed an advertisement in the local paper.","example[84]":"You can place orders by telephone.","example[85]":"I had no idea which horse I should place a bet on.","signpost[9]":"how good/important","definition[21]":"to say how good or important you think someone or something is","example[86]":"I would place health quite high on my list of priorities.","example[87]":"Some museums seem to place profit above education.","note[6]":"place somebody/something above/before somebody/something","definition[22]":"to ask a shop or business to provide goods","example[88]":"The airline has placed a large order for jets with Boeing.","definition[23]":"to ask a BROKER to buy shares, bonds etc for you","example[89]":"A speculator placed a large order for stock but couldn’t afford to pay for it.","definition[24]":"if a financial institution acting for a company places its shares, bonds etc, they manage to sell them to investors","example[90]":"It easily placed the 16 million shares in the bank.","example[91]":"25% of the firm’s shares will be placed with institutional investors.","note[7]":"place with","definition[25]":"if an organization such as an EMPLOYMENT AGENCY places someone in a job, they find a job for them","example[92]":"The agency is not paid until the individual is placed in a job and holds it for a set amount of time.","definition[26]":"to arrange for an advertisement to appear in a newspaper","example[93]":"He wanted to sell his car, so he placed an ad in the ‘Auto Trader’.","definition[27]":"to give a telephone OPERATOR the number of a person you want to speak to, so that they can connect you","example[94]":"He went to the hotel to place two telephone calls, one local and one to London.","definition[28]":"to ask a court of law to officially say that a company cannot continue to operate normally because of its financial difficulties","example[95]":"Creditor banks are considering cutting off assistance and forcing the company to be placed under receivership.","definition[29]":"the office, factory etc where you work","example[96]":"Our place of work provides us with a base for social interaction.","definition[30]":"to happen, especially after being planned or arranged","example[97]":"The meeting took place on 5th May.","definition[31]":"if you do something in someone’s place, you do it instead of them because they cannot do it","example[98]":"John Hudson is away that week, so I will be attending the course in his place.","definition[32]":"to start becoming successful","example[99]":"The market had just started to look as if it was going places when the crash came along.","definition[33]":"in positions of power or authority","example[100]":"corruption in high places"}