{"word[0]":"bounce","signpost[0]":"ball/object","definition[0]":"if a ball or other object bounces, or you bounce it, it immediately moves up or away from a surface after hitting it","example[0]":"The ball bounced off the post and into the goal.","note[0]":"bounce off","example[1]":"The kids were bouncing a ball against the wall.","note[1]":"bounce something on/against etc something","signpost[1]":"jump up and down","definition[1]":"to move up and down, especially because you are hitting a surface that is made of rubber, has springs etc","example[2]":"Stop bouncing up and down on the sofa.","example[3]":"Lyn was bouncing on the trampoline.","note[2]":"bounce on","signpost[2]":"cheque","definition[2]":"if a cheque bounces, or if a bank bounces a cheque, the bank will not pay any money because there is not enough money in the account of the person who wrote it","signpost[3]":"walk","definition[3]":"to walk quickly and with a lot of energy","example[4]":"Olivia came bouncing into the room.","signpost[4]":"something moves up and down","definition[4]":"if something bounces, it moves quickly up and down as you move","example[5]":"Her hair bounced when she walked.","signpost[5]":"light/sound","definition[5]":"if light or sound bounces, it hits a surface and then moves quickly away from it","example[6]":"The radio signals are bounced off a satellite.","note[3]":"bounce (something) off something","signpost[6]":"email","definition[6]":"if an email that you send bounces or is bounced, it is returned to you and the other person does not receive it because of a technical problem","signpost[7]":"force somebody to leave","definition[7]":"to force someone to leave a place, job, or organization, especially because they have done something wrong","example[7]":"Taylor was bounced from the team for assaulting another player.","note[4]":"bounce somebody from something","definition[8]":"the action of moving up and down on a surface","example[8]":"Try to catch the ball on the second bounce.","definition[9]":"the ability to move up and down on a surface, or that surface’s ability to make something move up and down","example[9]":"The ball had completely lost its bounce.","example[10]":"a basketball court with good bounce","definition[10]":"a lot of energy that someone has","example[11]":"Exercise is great. I feel like there’s a new bounce in my step.","definition[11]":"hair that has bounce is in very good condition and goes back to its shape if you press it","example[12]":"a brand-new styling spray that gives your hair body and bounce","definition[12]":"a sudden increase in something such as how popular a leader is","example[13]":"the bounce in the property market","note[5]":"bounce in","definition[13]":"if a cheque bounces or a bank bounces it, the bank will not pay any money because there is not enough money in the account of the person who wrote the cheque","example[14]":"Every time a cheque bounces it costs us £25 in bank charges.","example[15]":"His bank bounced the cheque and cancelled his overdraft.","definition[14]":"to quickly increase in price or amount, especially after having fallen","example[16]":"The airline’s shares bounced to 617p before settling back to 604p.","definition[15]":"if a stockmarket bounces, it suddenly becomes very active and share prices rise","example[17]":"Tokyo’s beleaguered stock market bounced dramatically to erase some of its recent losses.","definition[16]":"if an email that you send bounces or is bounced back, it is returned to you and the other person does not receive it because of a technical problem","definition[17]":"a sudden rise in something such as prices, sales, or share prices","example[18]":"Economists agree that there could be a bounce in prices next year."}