{"word[0]":"recognize","definition[0]":"to know who someone is or what something is, because you have seen, heard, experienced, or learned about them in the past","example[0]":"I didn’t recognize you in your uniform.","example[1]":"It was malaria, but Dr Lee hadn’t recognized the symptoms.","explanation[0]":"In everyday English, people often say that they know (that) it is someone or something rather than say they recognize them: ","example[2]":"I knew it was her by the hat she was wearing.","definition[1]":"to officially accept that an organization, government, document etc has legal or official authority","example[3]":"British medical qualifications are recognized in Canada.","example[4]":"The World Health Organization has recognized alcoholism as a disease since 1951.","note[0]":"recognize something as something","definition[2]":"to accept or admit that something is true","example[5]":"One must recognise that homesickness is natural.","note[1]":"recognize (that)","example[6]":"It is important to recognize how little we know about this disease.","note[2]":"recognize what/how/who etc","definition[3]":"if something is recognized by people, they realize that it is important or very good","example[7]":"Alexander tried to get his work recognized by the medical profession.","example[8]":"a recognized authority on Roman pottery","example[9]":"Lawrence’s novel was eventually recognized as a work of genius.","note[3]":"be recognized as something","explanation[1]":"Recognize is usually passive in this meaning","definition[4]":"to officially and publicly thank someone for something they have done, by giving them a special honour","example[10]":"He was recognized for having saved many lives.","explanation[2]":"Recognize is not used in the progressive You say","example[11]":"I recognize that woman","bad_example[0]":"I am recognizing that woman","definition[5]":"to know who someone is or what something is, especially because you have seen or heard them before","example[12]":"I hadn’t seen her for ten years, but I recognized her immediately.","example[13]":"Do you recognize this song?","display[0]":"identify","definition[6]":"to recognize someone or something and say who or what they are","example[14]":"As they came closer, I was able to identify two of the group.","example[15]":"It’s delicious but I can’t quite identify the taste.","display[1]":"distinguish","definition[7]":"to recognize and understand the difference between two or more things or people","example[16]":"By this age, kids can usually distinguish between right and wrong.","example[17]":"It’s often difficult to distinguish identical twins from each other.","display[2]":"make something/somebody out","definition[8]":"to be able to see or hear something or someone – used when it is very difficult to do this","example[18]":"In the distance, I could just make out the outline of an island.","example[19]":"He whispered something but I couldn’t make out what it was.","display[3]":"discern","definition[9]":"to notice or understand something by looking carefully or thinking about it carefully","example[20]":"I thought I discerned a faint gleam of hope in his eyes.","example[21]":"A number of differences can be discerned in the data for the three countries.","display[4]":"know","definition[10]":"to recognize someone or something. Know is often used in everyday English instead of recognize","example[22]":"How do you know that it is real gold?","example[23]":"I know him from somewhere.","example[24]":"I can’t remember his name, but I know his face.","display[5]":"can tell","definition[11]":"to be able to recognize someone or something","example[25]":"I could tell that it was him by his voice.","example[26]":"Can you tell that it’s not real leather?","example[27]":"It’s difficult to be able to tell them apart (=to recognize that they are different).","definition[12]":"to know who a person is or what something is, or to know something about them as soon as you see them or hear their name","example[28]":"How will investors recognize the bottom of the market when it comes?","definition[13]":"to accept officially that an organization, government etc has legal or official authority","example[29]":"The US refuses to recognize the country’s military government.","definition[14]":"to accept and admit that something is true","example[30]":"The plan simply fails to recognize the difficulty and the time required to increase production.","definition[15]":"to show something at a particular amount, in a particular way etc in a company’s accounts","example[31]":"The company said it will recognize a pretax gain of about $23 million from the sale of the subsidiary."}