{"word[0]":"magic","definition[0]":"the power to make impossible things happen by saying special words or doing special actions","example[0]":"Do you believe in magic?","definition[1]":"a special, attractive, or exciting quality","example[1]":"Paris has lost some of its magic for me over the years.","example[2]":"the magic of Christmas","note[0]":"magic of","definition[2]":"the skill of doing tricks that look like magic in order to entertain people, or the tricks that are done","synonym[0]":"conjuring","collocation[0]":"do magic","example[3]":"In the story, the children are not allowed to do magic out of school.","collocation[1]":"work magic","example[4]":"What do you expect me to do? I can’t work magic!","collocation[2]":"use magic","example[5]":"By using magic, he can order the ghost of any dead person to be his servant.","collocation[3]":"black magic","example[6]":"The candles had been used for black magic.","collocation[4]":"ancient magic","example[7]":"The place seemed full of shadows and ancient magic.","collocation[5]":"strong/powerful magic","example[8]":"Her fingers moved to make the sign that protected against strong magic.","definition[3]":"the power to make impossible things happen, by saying special words or doing special actions","example[9]":"In the story, she uses magic to turn him into a frog.","example[10]":"Local people believe that he can heal wounds and illnesses using magic.","display[0]":"witchcraft","definition[4]":"the use of magic, usually to do bad things","example[11]":"Hundreds of women were accused of witchcraft in the 1600s.","display[1]":"spell","definition[5]":"a special set of words or actions that are used to make something happen by magic","example[12]":"a magic spell","example[13]":"An evil witch cast a spell on him  (=said a special set of words or did a special series of actions, in order to make something happen to someone by magic), turning him into a beast.","display[2]":"curse","definition[6]":"something that makes someone or something have bad luck","example[14]":"The house seemed to have a curse on it.","example[15]":"People believed the pharaoh would put a curse on  (=use magic to make them have bad luck)anyone who broke into the tomb.","example[16]":"She believed her former husband had put a hex on her.","display[3]":"the occult","definition[7]":"mysterious powers and events that involve magic and spirits","example[17]":"He was very interested in the occult.","display[4]":"voodoo","definition[8]":"magical beliefs and practices used as a form of religion","example[18]":"a voodoo curse","example[19]":"In Haiti, the people still practice voodoo.","definition[9]":"in stories, a magic word or object has special powers that make the person using it able to do impossible things","example[20]":"a book of magic spells","example[21]":"a magic sword","definition[10]":"relating to the skill of doing tricks to entertain people","example[22]":"His best magic trick is sawing a lady in half.","definition[11]":"very good or very enjoyable","example[23]":"‘Did you have a good time?’ ‘Yeah, it was magic!’"}