{"word[0]":"often","definition[0]":"if something happens often, it happens regularly or many times","synonym[0]":"frequently","example[0]":"She often works at the weekend.","example[1]":"If you wash your hair too often, it can get too dry.","example[2]":"How often do you see your parents?","example[3]":"Robin is a difficult child; you’ve said so yourself often enough (=a lot of times).","example[4]":"I quite often go to Paris on business.","note[0]":"quite/very often","example[5]":"It’s not often that a government minister will admit to being wrong.","note[1]":"it is not often (that)","definition[1]":"if something happens often, it happens in many situations or cases","example[6]":"It’s often difficult to translate poetry.","example[7]":"Very often children who behave badly at school have problems at home.","note[2]":"very/quite often","explanation[0]":"Often usually comes before a verb","example[8]":" I often go to bed late","explanation[1]":"Often usually comes after the verb ‘be’","example[9]":" She is often late","explanation[2]":"Often usually comes after an auxiliary verb such as ‘do’ or ‘have’","example[10]":"I have often wondered what happened to him","explanation[3]":"Often is used at the beginning of a sentence, especially when something seems surprising","example[11]":"Often I don’t go to bed until 2 am","explanation[4]":"Often is also used at the end of a sentence","example[12]":"Do you go to bed late often?","definition[2]":"used when saying that something happens many times","example[13]":"Gary was often bad-tempered in the morning.","example[14]":"We often meet up for a drink after work.","display[0]":"a lot","example[15]":"I think she likes him – she talks about him a lot.","example[16]":"His wife goes abroad on business a lot.","definition[3]":"often – used especially in writing or more formal English","example[17]":"Passengers complain that trains are frequently late.","example[18]":"Older patients frequently forget to take their medicine.","display[1]":"regularly","definition[4]":"often, especially at regular intervals","example[19]":"Buses run regularly every ten minutes.","display[2]":"again and again","definition[5]":"used to emphasize that someone does something many times, or the same thing happens many times","example[20]":"She told herself again and again that everything would be all right.","example[21]":"Gunfire rang out across the city again and again.","display[3]":"repeatedly","definition[6]":"used to emphasize that someone does something many times","example[22]":"His doctor had repeatedly warned him not to work so hard.","display[4]":"constantly/continually","definition[7]":"often over a long period of time – used especially about something that is annoying or causes problems","example[23]":"They seem to be continually arguing.","example[24]":"It’s hard to keep up with technology when it’s constantly changing.","display[5]":"time and time again","definition[8]":"many times – used when this is annoying or does not have any effect","example[25]":"He forgets his keys time and time again.","example[26]":"I tell students time and time again to keep careful notes.","heading[0]":"to often happen or do something","display[6]":"tend to do something","definition[9]":"to often do a particular thing and be likely to do it","example[27]":"Dave tends to arrive late so don’t worry.","example[28]":"Girls tend to be better at languages than boys.","display[7]":"have a tendency to do something","definition[10]":"to often do something, especially something that is not good, and be more likely to do it than other people or things","example[29]":"Some people have a tendency to put on weight.","example[30]":"This type of cloth has a tendency to shrink.","display[8]":"be inclined to do something","definition[11]":"to do something fairly often or be fairly likely to do it, especially because this is part of your character","example[31]":"Teenage boys are inclined to take risks.","example[32]":"She was inclined to giggle in class.","display[9]":"have a habit of doing something","definition[12]":"used when saying that something has happened many times before and is likely to happen again","example[33]":"Ben had a habit of coming home drunk.","example[34]":"Life has a habit of surprising people.","display[10]":"be prone to something","definition[13]":"to be more likely to have problems","example[35]":"Some older computer systems were prone to go wrong.","example[36]":"The fitter you are, the less you are prone to injury.","example[37]":"plants that are prone to disease"}