{"word[0]":"top","signpost[0]":"highest part","definition[0]":"the highest part of something","example[0]":"The book I wanted was at the very top of the pile.","example[1]":"We could just see the white cliff tops in the distance.","note[0]":"cliff top/mountaintop/hilltop/treetop","example[2]":"The tops of the mountains were still covered with snow.","note[1]":"top of","example[3]":"She could only just see over the tops of their heads.","example[4]":"He was standing at the top of the stairs.","note[2]":"at the top (of something)","example[5]":"We’ll sit down once we’re at the top.","example[6]":"Write your name at the top of the page.","example[7]":"Stop and wait for us when you get to the top of the slope.","note[3]":"to the top (of something)","example[8]":"I filled the glass right to the top.","signpost[1]":"upper surface","definition[1]":"the flat upper surface of an object","example[9]":"a low wooden table with a glass top","example[10]":"Her fingers drummed on the table top.","example[11]":"We walked along the top of the ancient city walls.","example[12]":"She put the papers down on the top of the piano.","note[4]":"on (the) top of something","signpost[2]":"cover","definition[2]":"something that you put on or over an object to cover it, protect it, or prevent liquid coming out of it","example[13]":"I can’t get the top off the jar.","example[14]":"You’ve left the top off the toothpaste again!","example[15]":"Can you put the top back on the bottle when you’ve finished with it?","example[16]":"Has anyone seen my pen top?","note[5]":"bottle top/pen top etc","definition[3]":"a piece of clothing that you wear on the upper part of your body","example[17]":"She was wearing a stripy knitted top.","example[18]":"a skirt with a matching top","example[19]":"a bikini top","example[20]":"I can’t find my pyjama top.","definition[4]":"the part of a fruit or vegetable where it was attached to the plant, or the leaves of a plant whose root you can eat","example[21]":"Cut the tops off the tomatoes.","example[22]":"I’ve found a recipe for beetroot tops.","signpost[3]":"street/field etc","definition[5]":"the part of the street or of a piece of land that is the furthest away from you","example[23]":"I waited at the top of East Street.","signpost[4]":"toy","definition[6]":"a child’s toy that spins around on its point when you twist it","signpost[5]":"highest","definition[7]":"nearest to the top of something","example[24]":"We have a flat on the top floor of the building.","example[25]":"the top button of his shirt","example[26]":"I managed to scrape off the top layer of paint.","example[27]":"I found the letter in the top drawer of his desk.","signpost[6]":"best","definition[8]":"best or most successful","example[28]":"our top tennis players","example[29]":"a top New York salon","example[30]":"one of the world’s top engineering companies","example[31]":"people in top jobs","example[32]":"She got top marks.","example[33]":"The top score was 72.","signpost[7]":"winning","definition[9]":"winning in a game or competition","example[34]":"Despite losing last night, Manchester United are still top  (=the highest in a list of clubs in a competition).","example[35]":"Barcelona remain top of the league after beating Real Madrid.","example[36]":"Clive’s a top bloke.","signpost[8]":"be higher","definition[10]":"to be higher than a particular amount","example[37]":"Their profits have reportedly topped £1,000,000 this year.","signpost[9]":"be most successful","definition[11]":"to be in the highest position in a list because you are the most successful","example[38]":"The Tower of London tops the list of London’s most popular tourist attractions.","example[39]":"the team that has topped the Premiership for the last three seasons","example[40]":"In 1998 the group topped the charts with the song ‘Don’t Stop Loving Me’.","signpost[10]":"do better","definition[12]":"if you top something, you do something that is better than it","example[41]":"He topped his previous best performance, coming second in the 100 metres.","signpost[11]":"reach the top","definition[13]":"if you top a hill, you reach the top of it","example[42]":"We topped the hill and looked down towards the valley below us.","definition[14]":"at the highest level","example[43]":"The top rate of income tax has been cut sharply.","example[44]":"the pay of top executives","example[45]":"She spent five years in the top job.","example[46]":"He is among the top 5% of earners in this country.","definition[15]":"biggest or most successful","example[47]":"the top 100 companies in the UK","example[48]":"We sell only top-quality goods.","example[49]":"Profits this year should top £1.2 billion.","example[50]":"Last year bilateral trade topped $1 billion.","definition[16]":"to offer more money than someone else","example[51]":"A rival company has topped our offer by $5 million.","definition[17]":"the most important or most successful position in an organization, company, group etc","example[52]":"He started life at the bottom and worked his way up to the top.","example[53]":"This decision has come from the top (=was made by the most important managers)."}