{"definition[0]":"concerning or relating to a particular subject","example[0]":"a book about politics","example[1]":"She said something about leaving town.","example[2]":"He lied about his age.","example[3]":"About that car of yours. How much are you selling it for?","example[4]":"What’s he on about  (=talking about)?","example[5]":"It’s about Tommy, doctor. He’s been sick again.","example[6]":"Naturally, my mother wanted to know all about it  (=all the details relating to it).","definition[1]":"used to show why someone is angry, happy, upset etc","example[7]":"I’m really worried about Jack.","example[8]":"She’s upset about missing the party.","definition[2]":"in many different directions within a particular place, or in different parts of a place","synonym[0]":"around","example[9]":"We spent the whole afternoon walking about town.","example[10]":"Books were scattered about the room.","definition[3]":"in the nature or character of a person or thing","example[11]":"There’s something really strange about Liza.","example[12]":"What I like about the job is that it’s never boring.","definition[4]":"if an organization, a job, an activity etc is about something, that is its basic purpose","example[13]":"Leadership is all about getting your team to co-operate.","definition[5]":"surrounding a person or thing","example[14]":"Jo sensed fear and jealousy all about her.","definition[6]":"used when saying what the subject of something is","example[15]":"She’s always talking about you.","example[16]":"In her novels she writes about life in South Africa.","example[17]":"There’s something I wanted to ask you about.","definition[7]":"about a particular subject","example[18]":"a book on English grammar","example[19]":"a report on poverty in rural areas","display[0]":"concerning/regarding","example[20]":"Prince Saiid answered questions concerning Kuwait’s future.","example[21]":"The report raises a number of questions regarding food safety.","display[1]":"with regard to","definition[8]":"about – used especially when you want to start talking or writing about something","example[22]":"Dear Sir, I’m writing with regard to your advertisement in The Times.","display[2]":"re","definition[9]":"used in business letters and in emails to introduce the subject that you are going to write about","example[23]":"Re: Friday’s meeting","definition[10]":"a little more or less than a particular number, amount, or size","synonym[1]":"roughly","example[24]":"I live about 10 miles away.","example[25]":"a tiny computer about as big as a postcard","example[26]":"We left the restaurant at round about 10.30.","explanation[0]":"In written English, people usually prefer to use approximately, as it sounds more technical:","example[27]":"The cost to taxpayers is approximately $200 billion.","definition[11]":"in many different directions within a place or in different parts of a place","example[28]":"People were rushing about, trying to find the driver.","example[29]":"Cushions were scattered about on the chairs.","definition[12]":"near to you or in the same place as you","example[30]":"Is Derek about? There’s a phone call for him.","example[31]":"Quick! Let’s go while there’s no-one about.","definition[13]":"existing or available now","example[32]":"I hope she hasn’t caught flu. There’s a lot of it about.","example[33]":"She might get temporary work, but there’s not much about.","definition[14]":"almost or probably","example[34]":"I was about ready to leave when somebody rang the doorbell.","example[35]":"‘Have you finished?’ ‘Just about.’","example[36]":"It’s just about the worst mistake anyone could make.","definition[15]":"so as to face in the opposite direction","example[37]":"He quickly turned about and walked away."}