{"word[0]":"edition","definition[0]":"the form that a book, newspaper, magazine etc is produced in","example[0]":"a paperback edition","example[1]":"the US edition of Marie Claire magazine","definition[1]":"the copies of a book, newspaper etc that are produced and printed at the same time","note[0]":"first edition (=the first copies of a particular book, that are often valuable)","example[2]":"The textbook was first published in 1858 and is now in its 39th edition.","example[3]":"A limited edition of 2,000 copies has been published.","definition[2]":"a newspaper, magazine etc","example[4]":"Martin was reading the early edition of the Evening News.","definition[3]":"a television or radio programme that is broadcast regularly or is part of a series","example[5]":"the early evening edition of Scotland Today","form[0]":"ADJECTIVES/NOUN + edition","collocation[0]":"a first/second/third etc edition","example[6]":"The first edition was published in 1986.","collocation[1]":"a hardback/paperback edition","example[7]":"The paperback edition costs £7.99.","collocation[2]":"a new edition","example[8]":"The new edition of the dictionary includes a CD-ROM.","collocation[3]":"a revised edition","example[9]":"The revised edition includes a chapter on Gordon Brown.","collocation[4]":"a limited/special edition","example[10]":"They have produced a new limited edition CD.","collocation[5]":"produce/bring out an edition","example[11]":"This special edition of the VW Beetle was produced in the 1970s.","collocation[6]":"publish an edition","example[12]":"The first edition of the book was published in 1982.","definition[4]":"a copy of a book that is printed at one particular time. Second, third etc editions of a book may contain changes to the previous book","example[13]":"These chapters did not appear in the first edition.","example[14]":"A new edition is due out next month.","example[15]":"A paperback edition of the book is now available.","definition[5]":"a copy of a newspaper or magazine that is produced on a particular day or at a particular time","example[16]":"The story made it into later editions of the Times and Telegraph."}