{"word[0]":"background","definition[0]":"someone’s family, education, previous work etc","example[0]":"Students with a background in chemistry will probably find the course easier.","example[1]":"It’s important to understand other people, people from different backgrounds.","example[2]":"Do you know anything about his background?","definition[1]":"the situation or past events that explain why something happens in the way that it does","example[3]":"The author included a new chapter of background material for the second edition of the book.","note[0]":"background information/details/data etc","example[4]":"Without knowing the background to the case, I couldn’t possibly comment.","note[1]":"background to","example[5]":"The peace talks are being held against a background of increasing violence.","note[2]":"against a background of something","definition[2]":"the area that is behind the main thing that you are looking at, especially in a picture","example[6]":"The background looks out of focus.","example[7]":"In the background, you can see my college friends.","note[3]":"in the background","definition[3]":"the pattern or colour on top of which something has been drawn, printed etc","example[8]":"red lettering on a white background","definition[4]":"the sounds that you can hear apart from the main thing that you are listening to","example[9]":"All of the background noise made it difficult to have a phone conversation.","example[10]":"In the background, I could hear the sound of traffic.","collocation[0]":"family background","example[11]":"Many kids lack a stable family background.","collocation[1]":"social background","example[12]":"Universities aim to attract students from varied social backgrounds.","collocation[2]":"cultural background","example[13]":"Some of his attitudes were due to his cultural background.","collocation[3]":"ethnic background","example[14]":"We do not discriminate against people because of their ethnic background or gender.","collocation[4]":"class background","example[15]":"Class background is an important factor in the level of schooling achieved.","collocation[5]":"socio-economic background","example[16]":"Smokers often come from poorer socio-economic backgrounds.","collocation[6]":"educational/academic background","example[17]":"The interviewer will ask you about your educational background and work experience.","example[18]":"Postgraduate students come from a wide range of academic backgrounds.","collocation[7]":"professional background","example[19]":"Managers can come from a wide range of professional backgrounds.","collocation[8]":"a working-class/middle-class background","example[20]":"I came from a very poor working-class background.","collocation[9]":"a deprived/disadvantaged background","example[21]":"The school has a high percentage of pupils from disadvantaged backgrounds.","collocation[10]":"a poor background","example[22]":"His poor background prevented him from going to medical college.","collocation[11]":"a privileged/wealthy background","example[23]":"All the top jobs were taken by people from privileged backgrounds.","collocation[12]":"have a background (in something)","example[24]":"We are looking for someone who has a background in science.","collocation[13]":"come from a background","example[25]":"Mark and I came from very similar backgrounds.","collocation[14]":"a range of backgrounds","example[26]":"People from a wide range of backgrounds go to watch football.","definition[5]":"someone’s past, for example their education, qualifications, and the jobs they have had","example[27]":"We are looking for someone with a background in tourism.","definition[6]":"a computer program working in the background continues to function and do calculations while the user is working with another program"}