{"word[0]":"consist of something","definition[0]":"to be formed from two or more things or people","example[0]":"The buffet consisted of several different Indian dishes.","example[1]":"The audience consisted mainly of teenagers.","note[0]":"consist mainly/largely/primarily of somebody/something","example[2]":"The area does not consist entirely of rich people, despite popular belief.","note[1]":"consist entirely/solely of somebody/something","display[0]":"consist of ","example[3]":"My family consists of four people","bad_example[0]":"My family consists in four people","explanation[0]":"Consist is not used in the passive","bad_example[1]":"My family is consisted of four people","display[1]":"be made up of","example[4]":"My family is made up of four people","display[2]":"be composed of ","example[5]":"My family is composed of four people","display[3]":"consist of/be made up of","example[6]":"Lunch consisted of sandwiches and fruit.","example[7]":"The apartment consisted of three rooms.","example[8]":"The audience was largely made up of families.","display[4]":"be composed of","definition[1]":"to consist of something – used especially when saying which natural substances something contains, or what kind of people are in a group","example[9]":"Every chemical element is composed of atoms.","example[10]":"Venus’ atmosphere is mainly composed of carbon dioxide.","example[11]":"The team was composed of leading scientists from around the world.","display[5]":"comprise","definition[2]":"to consist of the things mentioned. Comprise can also be used to talk about the people or things which form something","example[12]":"The event comprises a champagne reception, two-course lunch, and a fashion show.","example[13]":"Men still comprise the majority of people who have the disease.","display[6]":"make up","definition[3]":"to be the things or people that form something","example[14]":"Women constitute a significant part of the workforce.","example[15]":"Toys make up about 10% of the company’s sales."}