{"word[0]":"love","signpost[0]":"romantic attraction","definition[0]":"to have a strong feeling of affection for someone, combined with sexual attraction","example[0]":"I love you, Tracy.","example[1]":"He was the only man she had ever loved.","signpost[1]":"care about","definition[1]":"to care very much about someone, especially a member of your family or a close friend","example[2]":"I love my grandad so much.","example[3]":"I’ve always loved children.","example[4]":"Many people feel guilty after the death of a loved one.","example[5]":"In 1941, her much-loved sister was killed in an accident.","note[0]":"much-loved/well-loved","signpost[2]":"like/enjoy","definition[2]":"to like something very much or enjoy doing something very much","example[6]":"I love carrots.","example[7]":"Jeff loves his work.","example[8]":"I love the way she sings that song.","example[9]":"Amy had always loved New York.","example[10]":"‘Would you like to come swimming with us?’ ‘I’d love to.’","note[1]":"I’d love to (do something)","example[11]":"I’d have loved to have stayed till the end.","example[12]":"I’d love to know just why they did that.","example[13]":"I love going out to restaurants.","note[2]":"love doing something","example[14]":"We all love to talk about ourselves.","note[3]":"love to do something","signpost[3]":"loyalty","definition[3]":"to have a strong feeling of loyalty to your country, an institution etc","example[15]":"Dad’s always loved the navy.","explanation[0]":"You love someone or something","example[16]":"I love my children","example[17]":"She loves jazz","explanation[1]":"You love doing something","example[18]":"She loves listening to jazz","explanation[2]":"You love to do something","example[19]":"She loves to listen to jazz in her spare time","bad_example[0]":"She loves listen to jazz","explanation[3]":"Love doing something and love to do something both mean the same thing You use love to do especially when saying that someone does something regularly or often","explanation[4]":"The usual rule is that love is not used in the progressive","bad_example[1]":"I am loving my children","bad_example[2]":"She is loving jazz","explanation[5]":"In spoken English, people sometimes say I’m loving something they have just seen or heard","example[20]":"I’m loving his new show  (=I like it a lot)","definition[4]":"to like someone very much and care a lot about them – used especially about people in your family or someone who you are sexually attracted to","example[21]":"I love my wife and children very much.","example[22]":"Have you ever said ‘I love you’ and not really meant it?","display[0]":"adore","definition[5]":"to love and admire someone very much","example[23]":"When she was a child she adored her father.","display[1]":"be in love (with somebody)","definition[6]":"to feel that you love someone and want to have a romantic relationship with them","example[24]":"We were both young and very much in love.","example[25]":"Karen was in love with a man who was much older than her.","display[2]":"be infatuated with somebody","definition[7]":"to love someone a lot and keep thinking about them, in a way that seems silly because you do not know them very well","example[26]":"He became infatuated with a woman he met at a conference.","display[3]":"have a crush on somebody","definition[8]":"to love and be sexually attracted to someone you are not having a relationship with, usually someone older","example[27]":"Jane had a crush on the German teacher.","display[4]":"be crazy about somebody","definition[9]":"to love someone very much – used for emphasis","example[28]":"She’s crazy about you.","display[5]":"be devoted to somebody","definition[10]":"to love someone very much and give them a lot of attention","example[29]":"He was devoted to his wife and his children.","display[6]":"dote on somebody","definition[11]":"to love someone very much, especially a much younger family member, and behave very kindly to them","example[30]":"He dotes on his grandchildren.","signpost[4]":"for family/friends","definition[12]":"a strong feeling of caring about someone, especially a member of your family or a close friend","opposite[0]":"hate","example[31]":"What these kids need is love and support.","example[32]":"a mother’s love for her child","note[4]":"love for","signpost[5]":"romantic","definition[13]":"a strong feeling of liking someone a lot combined with sexual attraction","example[33]":"Tara is madly in love with you.","example[34]":"Their love for each other grew deeper every day.","signpost[6]":"person you love","definition[14]":"someone that you feel a strong romantic and sexual attraction to","note[5]":"the love of your life (=the person that you feel or felt the most love for)","example[35]":"He was her first love.","signpost[7]":"pleasure/enjoyment","definition[15]":"a strong feeling of pleasure and enjoyment that something gives you","example[36]":"I fell in love with Amsterdam the very first time I visited the city.","example[37]":"my love of nature","note[6]":"love of/for","example[38]":"He had a great love of music.","definition[16]":"something that gives you a lot of pleasure and enjoyment","example[39]":"Sailing was her great love.","signpost[8]":"tennis","definition[17]":"an expression meaning ‘no points’, used in the game of tennis","heading[0]":"– Meaning 2: a strong feeling of liking someone a lot combined with sexual attraction","collocation[0]":"be in love","example[40]":"Are you in love with her?","collocation[1]":"fall in love","example[41]":"I fell in love with her the minute I saw her.","collocation[2]":"find love","example[42]":"I never thought I would find love.","collocation[3]":"return somebody’s love","example[43]":"Estella does not return Pip’s love.","collocation[4]":"love at first sight","example[44]":"For Marion and Ron it was love at first sight.","collocation[5]":"very much in love","example[45]":"They were obviously very much in love.","collocation[6]":"madly/deeply in love","example[46]":"I married Dan because I was madly in love.","collocation[7]":"head over heels in love","example[47]":"The two of them fell head over heels in love.","collocation[8]":"love is blind","example[48]":"Love is blind, I guess. How else could he stand to be with her?","collocation[9]":"true love","example[49]":"She felt that she had finally found true love.","collocation[10]":"real love","example[50]":"You could see real love in their eyes.","collocation[11]":"romantic love","example[51]":"Romantic love was not always the reason for marriage.","collocation[12]":"sexual love","example[52]":"Venus was the Roman goddess of sexual love.","collocation[13]":"unrequited love","example[53]":"She had a secret, unrequited love for Harrison.","collocation[14]":"undying love","example[54]":"She and I swore undying love.","collocation[15]":"passionate love","example[55]":"He wrote about his passionate love for her.","form[0]":"love + NOUN","collocation[16]":"a love song/story","example[56]":"a tragic love story","collocation[17]":"a love letter","example[57]":"She found a love letter from another woman in his wallet.","definition[18]":"a feeling of liking someone very much and caring a lot about them – used about people in your family, or someone you feel sexually attracted to","example[58]":"All children need love, attention, and encouragement.","example[59]":"We don’t need words to express our love for each other.","display[7]":"affection","definition[19]":"a gentle feeling of love which makes you want to be kind to someone and show them that you love them – used especially about friends and members of your family","example[60]":"My mother never showed us us any affection.","example[61]":"Alison and I had been at school together, and I felt great affection for her.","display[8]":"devotion","definition[20]":"very strong love for someone in which you want to give them a lot of attention and look after them – used especially about strong feelings of love for your wife, husband, children etc","example[62]":"His recovery is largely due to the devotion of his wife and family","display[9]":"passion","definition[21]":"a strong and exciting feeling of love for someone you are extremely sexually attracted to","example[63]":"He loved her still, with just the same passion as he always had.","example[64]":"There was no passion in their relationship.","display[10]":"infatuation","definition[22]":"a strong feeling of love for someone, in which you cannot stop thinking about them, and which seems silly because you do not know them very well","example[65]":"She hoped that his ridiculous infatuation would soon wear off.","example[66]":"His infatuation with Diane seemed to be growing.","example[67]":"a childhood infatuation","display[11]":"romance","definition[23]":"the feeling of loving someone and the nice things you do to show this – used about someone you are sexually attracted to","example[68]":"The romance had gone out of their relationship.","example[69]":"In the UK, one in ten people have found romance over the Internet.","display[12]":"crush","definition[24]":"a very strong feeling of love and sexual attraction for someone such as a teacher or a famous person, especially when there is no chance of you having a relationship with that person because you are much younger than them","example[70]":"She had a teenage crush on one of her teachers.","example[71]":"I had a big crush on Tom Cruise when I was growing up.","example[72]":"a schoolgirl crush"}