{"word[0]":"lawyer","definition[0]":"someone whose job is to advise people about laws, write formal agreements, or represent people in court","collocation[0]":"get a lawyer","example[0]":"If you are charged with breaking the law, you will need to get a lawyer.","collocation[1]":"hire/engage a lawyer","example[1]":"He’s rich enough to hire a good lawyer.","collocation[2]":"see/consult a lawyer","example[2]":"She has consulted a lawyer and is considering whether to sue Bailey.","collocation[3]":"talk to/speak to a lawyer","example[3]":"Have you spoken to a lawyer?","collocation[4]":"a lawyer acts for/defends/represents somebody","example[4]":"a group of lawyers who represent the airline","collocation[5]":"a lawyer argues something","example[5]":"His lawyers argued that the charges against him were baseless.","collocation[6]":"a lawyer advises something","example[6]":"His lawyers advised him not to comment.","form[0]":"ADJECTIVES/NOUN + lawyer","collocation[7]":"a defence lawyer","example[7]":"This evidence was given to the defence lawyer.","collocation[8]":"a prosecution lawyer","example[8]":"The prosecution lawyer asked his witness a question.","collocation[9]":"a civil rights lawyer","example[9]":"He has worked as a civil rights lawyer for over twenty years.","collocation[10]":"a criminal lawyer","example[10]":"She is one of the country’s leading criminal lawyers.","collocation[11]":"a libel lawyer","example[11]":"The actress is unhappy about the magazine article and has consulted a libel lawyer.","collocation[12]":"a clever lawyer","example[12]":"A clever lawyer may get a case against his client dropped because of a technicality.","collocation[13]":"a hotshot lawyer","example[13]":"He’s a hotshot lawyer with a growing reputation.","example[14]":"His lawyer told him to plead guilty.","display[0]":"attorney","definition[1]":"a lawyer. Attorney sounds more formal than lawyer","example[15]":"‘The United States sees intellectual property rights as sacred, ’ said Thomas Klitgaard, an attorney specializing in international law.","example[16]":"Acting on the advice of his attorney, he remained silent throughout the questioning.","display[1]":"solicitor","definition[2]":"a type of lawyer in Britain who gives legal advice, prepares the documents when property is bought or sold, and defends people, especially in the lower courts of law","example[17]":"She works as a commercial property solicitor at Nabarro Nathanson in London.","example[18]":"He went to the family solicitor to make a will.","display[2]":"barrister","definition[3]":"a lawyer in Britain who can argue cases in the higher law courts","example[19]":"McWalter's barrister, Hugh Vass, stressed his client’s previous good character.","display[3]":"advocate","definition[4]":"a formal word for a lawyer in American English, or a barrister in Scotland","example[20]":"The committee can put questions to the defendant or his advocate.","definition[5]":"the lawyer who represents someone in a court case","example[21]":"His brief asked for a fine rather than a prison sentence.","display[4]":"counsel","definition[6]":"the lawyer or group of lawyers who are representing someone in court","example[22]":"counsel for the defence/prosecution","definition[7]":"someone whose job is to give legal advice, write formal agreements, and represent people in courts"}