{"word[0]":"link","signpost[0]":"make connection","definition[0]":"to make a connection between two or more things or people","example[0]":"A love of nature links the two poets.","example[1]":"Exactly how do we link words to objects?","note[0]":"link something/somebody to/with something","example[2]":"Strong family ties still linked them together.","note[1]":"link somebody/something together","signpost[1]":"join","definition[1]":"to physically join two or more things, people, or places","example[3]":"He walked with her, linking arms (=putting his arm around her arm).","example[4]":"The pipe must be linked to the cold water supply.","example[5]":"The climbers were linked together by ropes.","example[6]":"A long bridge links Venice and the mainland.","note[2]":"link something and something","signpost[2]":"show connection","definition[2]":"to show or say that there is a connection between two people, situations, or things","example[7]":"He denied reports linking him to Colombian drug dealers.","signpost[3]":"make something depend on something","definition[3]":"to make one thing or situation depend on another thing or situation","example[8]":"Pay increases will now be linked to performance.","note[3]":"link something to something","signpost[4]":"connect equipment","definition[4]":"to connect computers, broadcast systems etc, so that electronic messages can be sent between them","example[9]":"Local terminals are linked to the central computer.","note[4]":"link something to/with something","signpost[5]":"Internet","definition[5]":"to set up a link to a website or webpage","example[10]":"How can I find out who has linked to my blog?","definition[6]":"a way in which two things or ideas are related to each other","example[11]":"the link between drug use and crime","note[5]":"link between something (and something)","example[12]":"There are a number of links between the two theories.","definition[7]":"a relationship or connection between two or more people, countries, organizations etc","example[13]":"Organizers of the project hope that international links will be forged.","note[6]":"forge/establish links","example[14]":"the close link between teacher and student","note[7]":"link between","example[15]":"The company has strong links with big investors.","note[8]":"link with","definition[8]":"a person or thing that makes possible a relationship or connection with someone or something else","example[16]":"For elderly people, TV is a vital link with the outside world.","definition[9]":"one of the rings in a chain","definition[10]":"a special word or picture in an Internet document that you click on to move quickly to another part of the same document or to another document","example[17]":"Send an email to the above address to report a broken link  (=a link that is not working properly).","definition[11]":"in the UK, a system by which people can get money from their bank or building society accounts by using a special plastic card (a Link card) in a cash machine","definition[12]":"something that joins two places and allows easy travel or communication between them","example[18]":"Mongolia has plans to extend itsroad, air andrail links with China and Russia.","example[19]":"We can set up a video link between here and the office in New York.","definition[13]":"an agreement between two companies, countries etc to work together on a particular project","example[20]":"The store has a link with a co-operative that produces coffee in Jamaica.","note[9]":"link with/between","example[21]":"links between firms and research establishments in the area","definition[14]":"a system which connects computers, telephone NETWORKs etc","example[22]":"Every organisation with computer links to the internet must employ its own monitors.","note[10]":"link with/to","definition[15]":"a word or picture in a website or computer document that will take you to another page or document if you click on it","synonym[0]":"hyperlink","example[23]":"The page includes links to other sites for more information.","definition[16]":"to put something such as a road between two places, joining them together and making travel and communication easier between them","example[24]":"a train line linking Dallas, Houston and San Antonio","example[25]":"the English Channel tunnel project linking Britain with France","note[11]":"link something with something","definition[17]":"if two or more companies or countries are linked, they agree to work together","example[26]":"The two countries are linked by a monetary and currency pact.","definition[18]":"if investments, exchange rates etc are linked, they change at the same rate","example[27]":"the system ofinflation-linked pay raises","example[28]":"The 90,000 term-life policies were sold to many borrowers, but weren’t specifically linked to their loans.","note[12]":"be linked to something","definition[19]":"to connect computers, telephone NETWORKs etc","example[29]":"a network that currently links 14 business centers","example[30]":"Anyone linked to the system could access the information.","note[13]":"be linked to/with something"}