{"signpost[0]":"reply","definition[0]":"something you say when you reply to a question that someone has asked you","synonym[0]":"response","example[0]":"You don’t have to give them an answer now.","example[1]":"Every time I ask him about it, I get a different answer.","example[2]":"She’s still waiting for an answer from the school.","example[3]":"The honest answer was that I didn’t know.","example[4]":"He was never able to get a straight answer about why it happened.","example[5]":"It’s impossible for me to give you a definite answer at this time.","example[6]":"The short answer is that it can’t be done.","example[7]":"In answer to your question, yes, you can go.","example[8]":"If it’s money you want, the answer is no!","example[9]":"These are important questions, and we want answers to them.","note[0]":"answer to","signpost[1]":"test/competition etc","definition[1]":"something that you write or say in reply to a question in a test or competition","example[10]":"Score two points for each correct answer.","note[1]":"the right/wrong/correct/incorrect answer","example[11]":"What was the answer to question 4?","signpost[2]":"invitation/letter etc","definition[2]":"a written reply to a letter, invitation, advertisement etc","example[12]":"Did you ever get an answer to your letter?","signpost[3]":"problem","definition[3]":"a way of dealing with a problem","synonym[1]":"solution","example[13]":"Some people think cars should be banned from the city, but I don’t think that’s the answer.","example[14]":"There is no simple answer.","note[2]":"simple/easy/obvious answer","example[15]":"If he could get a job, it’d be the answer to all his worries.","note[3]":"be the answer to somebody’s problems/worries etc","example[16]":"The police do not have an answer to rising crime.","type[0]":"singular, uncountable usually in negative","signpost[4]":"on the phone","definition[4]":"if you get an answer when you call someone on the phone, they pick up the phone and talk to you","example[17]":"I tried calling him all day but couldn’t get an answer.","signpost[5]":"at the door","definition[5]":"if you get an answer when you knock on a door, someone opens it and talks to you","example[18]":"I tried knocking on her door, but there was no answer.","heading[0]":"– Meaning 1: something you say when you reply to a question that someone has asked you","collocation[0]":"an honest/straight answer","example[19]":"The honest answer is that I don’t know.","collocation[1]":"a definite answer","example[20]":"Can you give me a definite answer tomorrow?","collocation[2]":"a satisfactory answer","example[21]":"I didn’t get a satisfactory answer from the company.","collocation[3]":"give somebody an answer","example[22]":"I’ll give you an answer tomorrow.","collocation[4]":"get/receive an answer","example[23]":"She wrote to him but she never got an answer.","collocation[5]":"wait for an answer","example[24]":"Kate was looking at me, waiting for an answer.","collocation[6]":"think of an answer","example[25]":"She couldn’t think of a suitable answer to his question.","collocation[7]":"the short answer is ...","example[26]":"‘How does homeopathy work?’ ‘The short answer to this question is that we do not know how homeopathic remedies work.’","heading[1]":"– Meaning 2: something that you write or say in reply to a question in a test or competition","collocation[8]":"the right/wrong answer","example[27]":"Do you know the right answer to this question?","collocation[9]":"the correct/incorrect answer","example[28]":"You get 5 points for each correct answer.","collocation[10]":"know the answer","example[29]":"Put up your hand if you know the answer.","collocation[11]":"guess the answer","example[30]":"If you don’t know the answer, try guessing it.","collocation[12]":"write the answer","example[31]":"Do we write the answers in the exercise book, Sir?","heading[2]":"– Meaning 3: a written reply to a letter, invitation, advertisement etc","collocation[13]":"the simple/easy answer","example[32]":"There are a lot of problems and no simple answers.","collocation[14]":"the obvious answer","example[33]":"The obvious answer is to raise taxes, but that would be unpopular.","collocation[15]":"the perfect answer","example[34]":"I think I have the perfect answer to the problem.","collocation[16]":"the complete answer","example[35]":"A loan, however, is not the complete answer to the company’s problems.","collocation[17]":"the long-term answer","example[36]":"He believes hydrogen is the long-term answer to our growing energy crisis.","collocation[18]":"a short-term answer","example[37]":"Employing overseas nurses is only a short-term answer to the shortage.","collocation[19]":"have an answer","example[38]":"Doctors are supposed to have all the answers.","collocation[20]":"find an answer","example[39]":"The aim is to find a long-term answer to poverty.","collocation[21]":"come up with an answer","example[40]":"The government is struggling to come up with answers to our economic problems.","definition[6]":"something you say when someone asks you a question or speaks to you","example[41]":"I asked if he wanted to come, but I didn’t get an answer.","example[42]":"If you’re asking me for money, the answer’s no!","definition[7]":"an answer – used especially in written English to report what someone said","example[43]":"She asked how he felt, and received the reply, ‘Awful!’","example[44]":"‘Finished now?’ ‘No, ' came the reply.","definition[8]":"an answer that clearly shows your reaction to a question, suggestion etc","example[45]":"Wagner’s responses showed that he had thought carefully about the issues.","example[46]":"‘Sure. Why not?’ was his response to most of Billie’s suggestions.","display[0]":"retort","definition[9]":"an angry answer given when someone has annoyed you or criticized you","example[47]":"Isabelle began an angry retort and then stopped herself.","display[1]":"comeback","definition[10]":"a quick answer that is clever, funny, or rude","example[48]":"He walked out before I could think of a snappy comeback.","display[2]":"riposte","definition[11]":"a quick and clever answer","example[49]":"Anna produced the perfect riposte.","display[3]":"rejoinder","definition[12]":"a quick answer, especially a clever or rude one","example[50]":"If he confronts them, he’ll run the risk of a sharp rejoinder.","definition[13]":"to say something to someone as a reply when they have asked you a question, made a suggestion etc","example[51]":"She thought for a moment before answering.","example[52]":"He still hadn’t answered my question.","example[53]":"‘Why don’t you just leave?’ ‘I’d like to, ’ she answered, ‘but I have nowhere else to go.’","example[54]":"How much was it? Come on, answer me.","example[55]":"When questioned, Hughes answered that he knew nothing about the robbery.","note[4]":"answer (that)","definition[14]":"to write or say the answer to a question in a test or competition","example[56]":"Answer as many questions as possible in the time provided.","definition[15]":"if you answer a letter or advertisement, you write a letter to the person who has written it","example[57]":"Simon got the job by answering an advert in the paper.","signpost[6]":"react to something","definition[16]":"to do something as a reaction to criticism or an attack","synonym[2]":"respond","example[58]":"The army answered by firing into the crowd.","signpost[7]":"deal with a problem","definition[17]":"to be a way of dealing with or solving a problem","example[59]":"‘You can borrow my car if you like.’ ‘Well, that answers one problem.’","explanation[0]":"You answer someone    in this meaning","example[60]":"Why won’t you answer me?","bad_example[0]":"answer to someone","explanation[1]":"You answer someone’s question","example[61]":"You still have not answered my question","explanation[2]":"You can use  answer with speech marks (‘’) when quoting someone’s exact words","example[62]":"‘I’m fine, thank you, ’ she answered ","explanation[3]":"You can use answer that to report what someone says After answered, the verb in the other clause is usually also in the past tense","example[63]":"She answered that she was fine","explanation[4]":"You reply to someone’s question","example[64]":"You still have not replied to my question","explanation[5]":"You can use  reply with speech marks (‘’) when quoting someone’s exact words","example[65]":"‘I’m fine, thank you, ’ she replied ","explanation[6]":"You can use reply that to report what someone says After replied, the verb in the other clause is usually also in the past tense","example[66]":"She replied that she was fine","definition[18]":"to say something to someone when they have asked you a question or spoken to you","example[67]":"You don’t have to answer the question if you don’t want to.","example[68]":"I said hello to her, but she didn’t answer.","definition[19]":"to answer someone – used especially in written English to report what someone said","example[69]":"‘I’m so sorry, ’ he replied.","example[70]":"We asked Jane to help, but she replied that she was too busy.","definition[20]":"to answer someone","example[71]":"How do you respond to the allegation that you deliberately deceived your employers?","definition[21]":"to answer someone by telling them what you have decided or giving them a piece of information they asked for","example[72]":"He asked me to marry him, but I didn’t give him an answer straight away.","display[4]":"get back to somebody","definition[22]":"to answer someone at a later time especially by telephoning them, usually because you need to think about their question or find out more information","example[73]":"She’s promised to get back to me as soon as she hears any more news from the hospital.","definition[23]":"to answer someone angrily, especially because they have annoyed you or criticized you","example[74]":"‘You’re not afraid?’ Brenda asked. ‘Of course not, ’ he retorted angrily."}