{"word[0]":"deal with somebody/something","definition[0]":"to take the necessary action, especially in order to solve a problem","synonym[0]":"handle","example[0]":"a strategy for dealing with disruptive pupils","example[1]":"Don’t worry, I’ll deal with this.","example[2]":"The council has failed to deal with the problem of homelessness in the city.","note[0]":"deal with a problem/issue/matter etc","example[3]":"They should deal properly and fairly with any complaint.","note[1]":"deal effectively/adequately etc with something","definition[1]":"if a book, speech etc deals with a particular subject, it is about that subject","example[4]":"These ideas are dealt with more fully in Chapter Four.","definition[2]":"to do business with someone or have a business connection with someone","example[5]":"Most travel agents do not deal directly with these companies.","definition[3]":"to succeed in controlling your feelings about an emotional problem so that it does not affect your life","synonym[1]":"cope with","example[6]":"How’s he dealing with the whole thing?","heading[0]":"– Meanings 1,2, 3 & 4","collocation[0]":"deal with a problem","example[7]":"Both countries are having to deal with the problem of violence in urban areas.","collocation[1]":"deal with an issue/matter/question","example[8]":"New laws were introduced to deal with the issue.","collocation[2]":"deal with a situation","example[9]":"For a while I had no idea how to deal with the situation.","collocation[3]":"deal with a crisis","example[10]":"The president has flown home to deal with the crisis.","collocation[4]":"deal with a complaint","example[11]":"Working in the Customer Service Department, you become an expert in dealing with complaints.","collocation[5]":"deal with an enquiry","example[12]":"Our staff will be able to deal with any enquiries.","collocation[6]":"deal with an emergency","example[13]":"All our ambulance drivers are trained to deal with emergencies.","collocation[7]":"deal with a challenge","example[14]":"I chose this job because I like having to deal with new challenges every day.","collocation[8]":"deal with something effectively","example[15]":"Most schools don't deal with the problem of bullying very effectively.","collocation[9]":"deal with something successfully","example[16]":"Most of these issues have now been successfully dealt with.","collocation[10]":"deal with something adequately","example[17]":"Our National Health Service does not deal adequately with the question of old age.","display[0]":"deal with something","example[18]":"We need to deal with problems like pollution and climate change.","example[19]":"I spend most of my day dealing with customer enquiries.","definition[4]":"to deal with a problem or difficult situation by making particular decisions – used especially when talking about how well or badly someone does this","example[20]":"He handled the situation very well.","example[21]":"Most customers were happy with the way their complaints had been handled.","display[1]":"tackle","definition[5]":"to start to deal with a problem, especially one that is complicated","example[22]":"We need to tackle the issue of drugs in schools.","example[23]":"The government is introducing new measures to tackle online crime.","display[2]":"see to/attend to somebody/something","definition[6]":"to deal with all the practical details of something that needs to be done or organized. Attend to is more formal than see to","example[24]":"My son saw to all the funeral arrangements.","example[25]":"I have some business to attend to.","display[3]":"take care of something","definition[7]":"to do the work or make the arrangements that are necessary for something to happen – used especially when you do this for someone else so that they do not have to worry about it","example[26]":"My secretary takes care of all the paperwork.","display[4]":"process","definition[8]":"if a company or organization processes a letter, form etc, they do the things that are usually done as part of their official system, in order to deal with it","example[27]":"It will take a minimum of 14 days to process your passport application.","example[28]":"I called their office, and they said that my request was still being processed.","definition[9]":"to do business with a person or company or to have a business connection with them","example[29]":"I’ve dealt with their company for a long time.","definition[10]":"to have a particular job or function in an organization","example[30]":"The banking department deals with all the other banking business.","example[31]":"The insurance assessors who deal with accident claims will inspect the damaged building."}