{"definition[0]":"something that is grown or made in a factory in large quantities, usually in order to be sold","example[0]":"The London factory assembles the finished product.","example[1]":"He works in marketing and product development.","example[2]":"consumer products such as VCRs","note[0]":"agricultural/dairy/software etc products","definition[1]":"the number you get by multiplying two or more numbers in mathematics","definition[2]":"something that is produced through a natural or chemical process","example[3]":"Hemoglobin is a product of red blood cells.","form[0]":"ADJECTIVES/NOUN + product","collocation[0]":"a commercial product","example[4]":"They help firms turn good ideas into commercial products.","collocation[1]":"a consumer product","example[5]":"Demand for consumer products has increased.","collocation[2]":"household products","example[6]":"Do you know what chemicals are in household products such as washing powder and paint?","collocation[3]":"beauty/hair products","example[7]":"She doesn’t buy beauty products that have been tested on animals.","collocation[4]":"dairy/milk products","example[8]":"Some people are allergic to dairy products.","collocation[5]":"meat products","example[9]":"meat products like sausages, pies and burgers","collocation[6]":"the finished product","example[10]":"The quality of the finished product is all-important.","form[1]":"product + NOUN","collocation[7]":"product development","example[11]":"The money will be used to fund product development.","collocation[8]":"a product range/line","example[12]":"We want to broaden the company’s product line.","definition[3]":"something that is made or produced in large quantities, usually in order to be sold","example[13]":"consumer products such as mobile phones","example[14]":"dairy products","display[0]":"goods","definition[4]":"things that are produced in order to be sold, especially for use in the home","example[15]":"They sell furniture and other household goods.","example[16]":"electrical goods","example[17]":"white goods (=large electrical goods used in the home such as washing machines and refrigerators)","display[1]":"commodity","definition[5]":"a type of product or raw material that can be bought and sold – used especially about basic food products, metals, and fuels","example[18]":"The decline in prices for agricultural commodities made the economic situation worse.","example[19]":"All metal was a valuable commodity and was rarely wasted.","display[2]":"merchandise","definition[6]":"things that are being sold, especially in shops","example[20]":"Customers are not allowed to handle the merchandise.","example[21]":"Sales of books, videos, and other merchandise have increased.","display[3]":"wares","definition[7]":"things that are offered for sale, especially in a market or on the street","example[22]":"In the market, the traders began selling their wares.","example[23]":"Merchants brought their wares from all over the world.","display[4]":"export","definition[8]":"a product that is sent to a foreign country in order to be sold","example[24]":"US exports rose to $11.935 billion.","example[25]":"At the moment, oil is their biggest export.","display[5]":"import","definition[9]":"goods that are brought from one country into another to be sold there","example[26]":"The UK clothing industry cannot compete with foreign imports on price.","definition[10]":"something useful and intended to be sold that comes from nature or is made in a factory","example[27]":"Distributors for Amway sell numerous products, including cleaning and personal-care products.","example[28]":"Companies must be able to launch new products (=introduce them) quickly and alter existing ones.","example[29]":"SL Industries designs, manufactures and distributes engineered products.","example[30]":"There were thought to be no safety problems, but the company decided to withdraw the product (=no longer make it available) so the incidents could be investigated.","definition[11]":"products made from milk etc","example[31]":"Corning produces glass fiber and other specialty glass products.","example[32]":"petroleum products","definition[12]":"a service","example[33]":"The bank offers products such as cash management and short-term loans.","definition[13]":"products in general","example[34]":"He needed $6,000 more a month to invest in inventory, but didn’t have it. As a result he couldn’t keep enough product on the shelf."}