{"word[0]":"bite","past_tense[0]":"bit","past_participle[0]":"bitten","signpost[0]":"teeth","definition[0]":"to use your teeth to cut, crush, or chew something","example[0]":"The dog bit him and made his hand bleed.","example[1]":"I wish I could stop biting my nails.","note[0]":"bite your nails","example[2]":"She paused uncertainly, biting her lip.","note[1]":"bite your lip","example[3]":"She bit into a croissant and took a sip of coffee.","note[2]":"bite into/through/at/down","example[4]":"An adult conger eel can easily bite through a man’s leg.","example[5]":"Nina pushed her fist into her mouth and bit down hard.","example[6]":"a man whose arm was bitten off by an alligator","note[3]":"bite something off","signpost[1]":"insect/snake","definition[1]":"to injure someone by making a hole in their skin","example[7]":"I think I’ve been bitten.","example[8]":"The dog’s been badly bitten by fleas.","signpost[2]":"press hard","definition[2]":"if an object bites into a surface, it presses firmly into it and does not move or slip","example[9]":"The hooves of the galloping horses had bitten deep into the soft earth.","note[4]":"bite into","example[10]":"He wore boots that bit into the ice.","signpost[3]":"effect","definition[3]":"to start to have an unpleasant effect","example[11]":"The new tobacco taxes have begun to bite.","example[12]":"The recession is biting into the music industry.","signpost[4]":"accept","definition[4]":"to believe what someone tells you, or to buy something they are selling, especially when they have persuaded you to do this","example[13]":"The new camcorders were withdrawn after consumers failed to bite.","signpost[5]":"fish","definition[5]":"if a fish bites, it takes food from a hook and so gets caught","example[14]":"The fish just aren’t biting today.","example[15]":"The dog bit me!","example[16]":"I sometimes bite my fingernails when I’m nervous.","example[17]":"He bit into the apple.","display[0]":"chew","definition[6]":"to keep biting something that is in your mouth","example[18]":"Helen was chewing a piece of gum.","example[19]":"He was chewing on a cigar.","display[1]":"gnaw","definition[7]":"if an animal gnaws something, it bites it repeatedly","example[20]":"The dog was in the yard gnawing on a bone.","display[2]":"nip somebody/give somebody a nip","definition[8]":"to give someone or something a small sharp bite","example[21]":"When I took the hamster out of his cage, he nipped me.","display[3]":"nibble","definition[9]":"to take a lot of small bites from something","example[22]":"A fish nibbled at the bait.","example[23]":"She sat at her desk, nibbling her sandwich.","display[4]":"sink your teeth into somebody/something","definition[10]":"to bite someone or something with a lot of force, so that your teeth go right into them","example[24]":"The dog sank its teeth into my leg.","example[25]":"He sank his teeth into the steak.","display[5]":"chomp on something","definition[11]":"to bite something and chew it in a noisy way","example[26]":"The donkey was chomping on a carrot.","example[27]":"He was chomping away on big slice of toast.","display[6]":"sting","definition[12]":"if an insect stings you, it makes a very small hole in your skin. You use sting about bees, wasps, and scorpions, and bite about mosquitoes, ants, spiders, and snakes","example[28]":"She stepped on a wasps’ nest and must have been stung at least 20 times.","signpost[6]":"using teeth","definition[13]":"the act of cutting or crushing something with your teeth","example[29]":"Antonio devoured half his burger in one bite.","example[30]":"Her body was covered in bite marks.","example[31]":"She picked up the sandwich and took a bite.","note[5]":"take/have a bite (of something/out of something)","example[32]":"Can I have a bite of your apple?","example[33]":"Some fish can give you a nasty bite.","note[6]":"give somebody a bite","definition[14]":"a small hole made where an animal or insect has bitten you","note[7]":"snake/ant etc bite","example[34]":"The infection is passed by the bite of a mosquito.","note[8]":"bite of","definition[15]":"a pleasantly sharp taste","example[35]":"Goat’s cheese adds extra bite to any pasta dish.","definition[16]":"a feeling of coldness","example[36]":"There was no mistaking the approach of winter; he could feel its bite.","signpost[7]":"strong effect","definition[17]":"a special quality in a performance, piece of writing etc that makes its arguments very effective and likely to persuade people","example[37]":"The film gains incisive bite from Sellers’ performance as the union chief.","definition[18]":"when a fish takes the food from a hook","example[38]":"Sometimes I sit for hours and never get a bite.","signpost[8]":"jaw","definition[19]":"the way that a person or animal’s top and bottom teeth touch when their mouth is closed","example[39]":"Our dentist said that Emmy should wear a brace to improve her bite.","definition[20]":"another spelling of BYTE"}