{"word[0]":"draw","past_tense[0]":"drew","past_participle[0]":"drawn","definition[0]":"to produce a picture of something using a pencil, pen etc","example[0]":"Katie had drawn a cottage with a little stream running next to it.","example[1]":"She asked the little girl to draw a picture of the man she’d spoken to.","example[2]":"Keith was drawing a complicated-looking graph.","example[3]":"I’ve never been able to draw very well.","example[4]":"Can you draw me a map of how to get there?","note[0]":"draw somebody something","signpost[0]":"get a reaction","definition[1]":"to get a particular kind of reaction from someone","example[5]":"The movie drew praise from critics.","note[1]":"draw praise/criticism","example[6]":"His remarks drew an angry response from Democrats.","note[2]":"draw something from somebody","signpost[1]":"attract","definition[2]":"to attract someone or make them want to do something","example[7]":"Beth felt strangely drawn to this gentle stranger.","example[8]":"The festival is likely to draw huge crowds.","example[9]":"What first drew you to teaching?","note[3]":"draw somebody to something","signpost[2]":"get something you need","definition[3]":"to get something that you need or want from someone or something","example[10]":"I drew a lot of comfort from her kind words.","note[4]":"draw something from something","example[11]":"Plants draw nourishment from the soil.","definition[4]":"to move in a particular direction","example[12]":"She drew away, but he pulled her close again.","example[13]":"The boat drew alongside us and a man appeared on the deck.","example[14]":"I arrived just as the train was drawing into the station.","explanation[0]":"In everyday English, people usually use pull rather than draw:","example[15]":"The train was pulling into the station.","signpost[3]":"pull somebody/something","definition[5]":"to move someone or something in a particular direction by pulling them gently","note[5]":"draw the curtains/a blind etc (=close them by pulling them gently)","example[16]":"Bobby drew a chair up to the table.","note[6]":"draw somebody/something aside/up/across etc","example[17]":"Hussain drew me aside to whisper in my ear.","signpost[4]":"pull a vehicle","definition[6]":"if an animal draws a vehicle, it pulls it along","example[18]":"a carriage drawn by six horses","example[19]":"an ox-drawn cart","signpost[5]":"take something out","definition[7]":"to take something out of a container, pocket etc","example[20]":"Maria drew her gun nervously and peered out into the gloom.","note[7]":"draw a gun/sword/weapon etc","example[21]":"Ali reached into his pocket and drew out a piece of paper.","note[8]":"draw something out/from something","explanation[1]":"In everyday English, people usually use pull something out or take something out rather than draw something out:","example[22]":"Ali reached into his pocket and pulled out a piece of paper.","signpost[6]":"from a bank","definition[8]":"to take money from your bank account","synonym[0]":"withdraw","example[23]":"Hughes had drawn $8,000 in cash from a bank in Toronto.","signpost[7]":"receive money","definition[9]":"to receive an amount of money regularly from a government or financial institution","example[24]":"How long have you been drawing unemployment benefit?","example[25]":"I’ll be drawing my pension before he’ll ever get around to asking me to marry him!","signpost[8]":"breathe","definition[10]":"to take air or smoke into your lungs","example[26]":"She drew a deep breath.","example[27]":"Ruth paused to draw breath, her voice barely hiding her excitement.","example[28]":"He lit his pipe and drew deeply.","signpost[9]":"take liquid from something","definition[11]":"to take a liquid from something such as a barrel or tap","definition[12]":"to take water from a well","definition[13]":"if a fire or chimney draws, it lets the air flow through to make the fire burn well","signpost[10]":"choose","definition[14]":"to choose by chance a ticket etc that will win a prize","example[29]":"The winning ticket will be drawn at the Christmas Party.","definition[15]":"to finish without either side winning in a game such as football","synonym[1]":"tie","example[30]":"They drew 3–3.","example[31]":"Liverpool drew with Juventus.","note[9]":"draw with","definition[16]":"if a ship draws a particular depth, it needs that depth of water to float in","definition[17]":"to make a picture, pattern etc using a pen or pencil","example[32]":"The children were asked to draw a picture of their families.","example[33]":"I’m going to art classes to learn how to draw.","display[0]":"sketch","definition[18]":"to draw a picture of something or someone quickly and without a lot of detail","example[34]":"Roy took a pencil and sketched the bird quickly, before it moved.","display[1]":"illustrate","definition[19]":"to draw the pictures in a book","example[35]":"It’s a beautiful book, illustrated by Arthur Rackham.","display[2]":"doodle","definition[20]":"to draw shapes or patterns without really thinking about what you are doing","example[36]":"He was on the phone, doodling on his notepad as he spoke.","display[3]":"scribble","definition[21]":"to draw shapes or lines without making a definite picture or pattern. Small children do this before they have learned to draw or write","example[37]":"At the age of two, she loved scribbling with crayons and coloured pencils.","display[4]":"trace","definition[22]":"to copy a picture by putting a piece of thin paper over it and drawing the lines that you can see through the paper","example[38]":"First trace the map, and then copy it into your workbooks.","definition[23]":"the final result of a game or competition in which both teams or players have the same number of points","example[39]":"The match ended in a draw.","definition[24]":"an occasion when someone or something is chosen by chance, especially the winning ticket in a lottery, or the teams who will play against each other in a competition","example[40]":"England has been selected to play Germany in the draw for the first round of the World Cup.","definition[25]":"a competition in which people whose names or tickets are chosen by chance win money or prizes","example[41]":"Congratulations! You have been entered into our £100,000 prize draw!","definition[26]":"a performer, place, event etc that a lot of people come to see","example[42]":"It is hoped that the new art gallery will be a big draw for visitors.","definition[27]":"when you breathe in smoke from a cigarette","synonym[2]":"drag","example[43]":"Maltravers took a long draw on his cigarette.","example[44]":"Many credit cards can now be used to draw cash from ATMs around the world.","example[45]":"All the money in his account has been drawn out.","definition[28]":"to receive an amount of money regularly from your employer or from the government","example[46]":"In the first year of the partnership, Jenny drew a salary of £30,000.","example[47]":"You are entitled to draw unemployment benefit.","definition[29]":"to write out and sign a cheque or BANK ORDER","example[48]":"I’ll draw a cheque on the company account.","definition[30]":"to write a BILL OF EXCHANGE","example[49]":"Bills are drawn by the exporter on the issuing or confirming bank."}