{"word[0]":"polite","definition[0]":"behaving or speaking in a way that is correct for the social situation you are in, and showing that you are careful to consider other people’s needs and feelings","opposite[0]":"rude","example[0]":"She’s always very polite.","example[1]":"polite, well-behaved children","example[2]":"a clear but polite request","example[3]":"We left the party as soon as it was polite to do so.","note[0]":"it is polite (of somebody) to do something","example[4]":"It’s not polite to talk with your mouth full.","definition[1]":"you make polite conversation, remarks etc because it is considered socially correct to do this, but not necessarily because you believe what you are saying","example[5]":"I know Ian said he liked her singing, but he was only being polite.","example[6]":"While they ate, they made polite conversation about the weather.","note[1]":"polite remarks/conversation/interest etc","example[7]":"Jan expressed polite interest in Edward’s stamp collection.","example[8]":"He was too polite to ask how old she was.","example[9]":"‘Excuse me, sir, ’ she said in a polite voice.","display[0]":"well-mannered","definition[2]":"having good manners and knowing the correct way to behave in social situations","example[10]":"She was beautifully dressed and very well-mannered.","display[1]":"well-behaved","definition[3]":"polite and not causing any trouble – used about children or animals","example[11]":"The children were very well-behaved.","example[12]":"Well-behaved dogs are welcome at the hotel.","display[2]":"courteous","definition[4]":"polite and respectful, and behaving rather formally","example[13]":"The hotel staff were very courteous and helpful.","example[14]":"a courteous reply","display[3]":"respectful","definition[5]":"polite and treating someone with respect","example[15]":"He was very respectful towards all my relatives.","example[16]":"‘Thank you, ’ he said with a respectful bow.","display[4]":"civil","definition[6]":"polite in a formal way, especially when you do not feel very friendly towards someone","example[17]":"She’d never liked her father-in-law, but she forced herself to be civil to him.","example[18]":"When you’ve stopped arguing, you might be able to have a civil conversation.","display[5]":"deferential","definition[7]":"polite towards someone, especially because they are in a more important social position","example[19]":"In those days women were expected to be deferential to men."}