{"word[0]":"bar","signpost[0]":"place to drink in","definition[0]":"a place where alcoholic drinks are served","example[0]":"The hotel has a licensed bar.","example[1]":"a cocktail bar","definition[1]":"one of the rooms inside a pub","example[2]":"The public bar was crowded.","signpost[1]":"place to buy drink","definition[2]":"a counter where alcoholic drinks are served","example[3]":"They stood at the bar.","signpost[2]":"block shape","definition[3]":"a small block of solid material that is longer than it is wide","example[4]":"a chocolate bar","example[5]":"a candy bar","example[6]":"a bar of soap","note[0]":"bar of","signpost[3]":"piece of metal/wood","definition[4]":"a length of metal or wood put across a door, window etc to keep it shut or to prevent people going in or out","example[7]":"houses with bars across the windows","definition[5]":"a group of notes and rests, separated from other groups by vertical lines, into which a line of written music is divided","example[8]":"a few bars of the song","signpost[4]":"on computer screen ","definition[6]":"a long narrow shape along the sides or at the top of a computer screen, usually containing signs that you can click on","example[9]":"the main menu bar at the top of the screen","example[10]":"the toolbar","signpost[5]":"in sports ","definition[7]":"the long piece of wood or metal across the top of the goal in sports such as football","example[11]":"The ball hit the bar.","signpost[6]":"pile of sand/stones","definition[8]":"a long pile of sand or stones under the water at the entrance to a harbour","signpost[7]":"colour/light","definition[9]":"a narrow band of colour or light","signpost[8]":"uniforms","definition[10]":"a narrow band of metal or cloth worn on a military uniform to show rank","signpost[9]":"heater","definition[11]":"the part of an electric heater that provides heat and has a red light","heading[0]":"– Meaning 3:","form[0]":"types of bar","collocation[0]":"a wine bar","example[12]":"He asked her to meet him in a trendy wine bar.","collocation[1]":"a coffee bar","example[13]":"We met up in the student coffee bar.","collocation[2]":"a sandwich/snack bar","example[14]":"I usually get some lunch from the sandwich bar.","collocation[3]":"a burger bar","example[15]":"The kids all hang out at the local burger bar.","collocation[4]":"a juice bar","example[16]":"The leisure centre also has a restaurant and a juice bar.","collocation[5]":"a sushi bar","example[17]":"Have you tried that new sushi bar in town?","collocation[6]":"a tapas bar","example[18]":"Madrid is full of great tapas bars.","collocation[7]":"a salad bar","example[19]":"When you’ve chosen your pizza, please help yourself from the salad bar.","definition[12]":"a place where people go to buy and drink alcoholic drinks","example[20]":"A man went into a bar and ordered a drink.","example[21]":"Let’s meet up in the hotel bar.","example[22]":"The city centre is full of wine bars and restaurants.","example[23]":"The club has a restaurant and a cocktail bar.","display[0]":"pub","definition[13]":"a building in Britain where alcohol can be bought and drunk, and where meals are often served","example[24]":"Do you fancy going to the pub?","example[25]":"a country pub","display[1]":"public house","definition[14]":"a pub","example[26]":"The fight took place outside a public house in the city centre.","display[2]":"somebody’s local","definition[15]":"a pub near where you live, especially one you often go to","example[27]":"The Red Lion’s my local.","display[3]":"inn","definition[16]":"a small hotel or pub, especially an old one in the countryside – often used in the name of the hotel or pub","example[28]":"The Bull Inn dates back to the 15th century.","example[29]":"The hotel was once a 17th century coaching inn  (=used by people travelling by coach and horses).","display[4]":"gastropub","definition[17]":"a pub that is known to serve very good food","example[30]":"a gastropub with a riverside restaurant","example[31]":"the Windmill Gastropub","display[5]":"tavern","definition[18]":"a pub in the past where you could also stay the night – used nowadays in the names of some pubs","example[32]":"the Turf Tavern","example[33]":"Marlowe was killed in a fight in a tavern.","display[6]":"watering hole","definition[19]":"a bar, pub etc where people drink alcohol – often used humorously. A watering hole is also the name for a place where wild animals go to drink","example[34]":"The bar became a popular watering hole for journalists.","example[35]":"What’s your favorite watering hole?","display[7]":"dive","definition[20]":"a bar, club etc that is cheap and dirty","example[36]":"The place is a bit of dive.","display[8]":"honky-tonk","definition[21]":"a cheap bar where country music is played","example[37]":"They played in every honky-tonk in Tennessee.","display[9]":"saloon","definition[22]":"a bar in the western United States. Also used in Britain about the part of a pub which has comfortable chairs where you can sit and relax","example[38]":"I felt like a cowboy walking into a saloon in the Wild West.","example[39]":"Do you want to stay in the saloon, or would rather go into the other bar?","heading[1]":"people who work in a bar","display[10]":"barman","definition[23]":"a man who serves drinks in a bar","example[40]":"A big Irish barman pulled me a pint of beer.","display[11]":"barmaid","definition[24]":"a woman who serves drinks in a bar","example[41]":"I was working in the evenings as a barmaid.","display[12]":"bartender","definition[25]":"someone who makes, pours, and serves drinks in a bar or restaurant","example[42]":"The bartender gave him his change.","display[13]":"bar staff","definition[26]":"the people serving drinks or food in a bar or pub","example[43]":"The local pub is advertising for bar staff.","display[14]":"landlord","definition[27]":"a man who owns or manages a pub","example[44]":"He became violent and the landlord asked him to leave.","definition[28]":"to officially prevent someone from entering a place or from doing something","example[45]":"They seized his passport and barred him from leaving the country.","note[1]":"bar somebody from (doing) something","definition[29]":"to prevent people from going somewhere by placing something in their way","example[46]":"She ran back, but Francis barred her way.","example[47]":"A locked gate barred my entrance to the wood.","definition[30]":"to shut a door or window using a bar or piece of wood so that people cannot get in or out","definition[31]":"except","example[48]":"We had recorded the whole album, bar one track.","definition[32]":"the profession of being a barrister, or the members of this profession","example[49]":"He retired after 25 years at the Bar.","definition[33]":"the profession of being a lawyer, or the members of this profession","example[50]":"the State Bar of California","definition[34]":"the exam that you must take to become a lawyer","definition[35]":"to officially stop someone from doing something or from entering a place","example[51]":"He has been barred from the securities and investment advisory business.","example[52]":"Foreign investors would be barred from buying majority stakes.","definition[36]":"the profession of a BARRISTER, or barristers in general","example[53]":"In 1988, she was called to the bar (=became a barrister) and she now practises in London, specialising in criminal and family law.","example[54]":"He has now passed his Bar Examination (=the examination you must pass in order to become a barrister).","definition[37]":"a word for the legal profession, used in the names of professional associations of lawyers","example[55]":"the New Jersey State Bar Association"}