{"word[0]":"chat","definition[0]":"to talk in a friendly informal way, especially about things that are not important","example[0]":"John and I sat up until the early hours chatting.","example[1]":"Mary was there, chatting to her mother.","note[0]":"chat with/to","example[2]":"Susie chatted away about her social life.","note[1]":"chat about","definition[1]":"to communicate with several people in a chat room on the Internet","explanation[0]":"Chat is a reciprocal verb This type of verb is used when saying that two or more people or things do something that involves both or all of them","example[3]":"The boys were chatting","example[4]":"The boys were chatting with each other","example[5]":"He was chatting with the boys","definition[2]":"an informal friendly conversation","example[6]":"She was enjoying their friendly little chat.","example[7]":"She used to drop in for a chat quite often.","example[8]":"I’ve had a long chat with Vinnie.","note[2]":"chat with","example[9]":"a chat about the weather","collocation[0]":"have a chat","example[10]":"We were just having a chat.","collocation[1]":"call in/round for a chat","example[11]":"Are you free later if I call in for a chat?","collocation[2]":"meet up for a chat","example[12]":"Sometimes we go to the cinema or just meet up for a chat.","collocation[3]":"enjoy a chat","example[13]":"Most people enjoy a good chat.","collocation[4]":"a little chat","example[14]":"Why don’t you call her and have a little chat.","collocation[5]":"a brief chat","example[15]":"My manager said he wanted to have a brief chat with me.","collocation[6]":"a bit of a chat","example[16]":"Perhaps I could have a bit of a chat with him.","collocation[7]":"a long chat","example[17]":"We sat down and had a long chat.","collocation[8]":"a friendly chat","example[18]":"New students sometimes just need to have a friendly chat with someone.","collocation[9]":"a cosy chat","example[19]":"I made some coffee and we had a cosy chat.","collocation[10]":"an informal chat","example[20]":"Come and see me any time if you want an informal chat about jobs.","collocation[11]":"a private/confidential chat","example[21]":"Have a confidential chat with the school nurse.","collocation[12]":"a quiet chat","example[22]":"Let’s go and have a quiet chat over lunch.","collocation[13]":"an online chat","example[23]":"With MSN you can have an online chat with your friends.","definition[3]":"to have a conversation with other people on the Internet by typing in your words","example[24]":"Chatting is one of the most popular activities on the Internet."}