{"word[0]":"community","plural[0]":"communities","definition[0]":"the people who live in the same area, town etc","note[0]":"community spirit (=the desire to be friendly with and help other people who live in the same community)","example[0]":"The new arts centre will serve the whole community.","example[1]":"community education programmes","example[2]":"We meet once a month to discuss community problems.","note[1]":"community relations/affairs/needs etc","example[3]":"Community leaders met to discuss the proposed golf course.","note[2]":"community groups/leaders etc","definition[1]":"a group of people who have the same interests, religion, race etc","note[3]":"the business/academic/scientific etc community","example[4]":"different ethnic communities","example[5]":"the gay community in San Francisco","note[4]":"the gay/black/Asian etc community","definition[2]":"a group of plants or animals that live in the same environment","example[6]":"Communities of otters are slowly returning to British rivers.","heading[0]":"– Meaning 1: the people who live in the same area, town etc","collocation[0]":"the local community","example[7]":"Our school is the centre of the local community.","collocation[1]":"the whole community","example[8]":"The committee meets to discuss issues that affect the whole community.","collocation[2]":"a small/large community","example[9]":"75% of the population live in small communities of fewer than 450 people.","collocation[3]":"the wider community","example[10]":"The sports centre is available to both the university and the wider community.","collocation[4]":"a rural community","example[11]":"There is a need for better public transport for people in rural communities.","collocation[5]":"a village community","example[12]":"Outside the capital, most people live in village communities.","collocation[6]":"a farming community","example[13]":"a small farming community of about 1,000 inhabitants","collocation[7]":"a mining community","example[14]":"She was brought up in a small mining community in North Wales.","collocation[8]":"a close/close-knit/tight-knit community","example[15]":"I live in a close-knit community where there's lots of support.","collocation[9]":"a thriving community","example[16]":"In the past the village was a thriving community with a number of shops.","form[0]":"community + NOUN","collocation[10]":"a community centre","example[17]":"A community centre is the ideal place for local residents to get together to discuss crime prevention.","collocation[11]":"a community group","example[18]":"Community groups do not have enough say over what is built in their neighbourhoods.","collocation[12]":"a community leader","example[19]":"Community leaders meet regularly to discuss local problems.","collocation[13]":"community services","example[20]":"Some tax goes towards paying for your community services.","collocation[14]":"community relations","example[21]":"Poor community relations are more common in urban areas than in the rest of the country.","collocation[15]":"community spirit","example[22]":"There is great community spirit in the village where I live.","collocation[16]":"community care","example[23]":"Several voluntary organizations are involved in providing community care.","collocation[17]":"community education","example[24]":"Community education includes classes, workshops, and summer schools.","collocation[18]":"a member of a community","example[25]":"It's good to feel that you are a member of a community.","collocation[19]":"a pillar of the community","example[26]":"The doctor was regarded as a pillar of the local community.","heading[1]":"– Meaning 2: a group of people who have the same interests, religion, race etc","form[1]":"ADJECTIVES/NOUN + community","collocation[20]":"the business/scientific/academic etc community","example[27]":"The idea has received intense interest from the business community.","collocation[21]":"the Jewish/Christian/Muslim etc community","example[28]":"The mosque serves the local Muslim community.","collocation[22]":"a religious community","example[29]":"The buildings belong to a strict religious community.","collocation[23]":"the black/white/Asian etc community","example[30]":"The city has a large Asian community.","collocation[24]":"an ethnic community","example[31]":"Most members of ethnic communities in Britain were born here.","collocation[25]":"the gay community","example[32]":"This part of the city has a large gay community.","collocation[26]":"a minority community","example[33]":"There should be better provision for the needs of minority communities.","explanation[0]":"Community is usually followed by a singular verb","example[34]":"The whole community gets involved in planning the festival","example[35]":"The whole community get involved in planning the festival","definition[3]":"all the people who live in the same area, city etc","definition[4]":"a group of people who all share the same nationality, religion, or interests","example[36]":"Miami’s black community","definition[5]":"the companies, businesses, and businesspeople operating in an area","example[37]":"Edinburgh’s business community","definition[6]":"businesspeople acting as a group in order to influence government or public opinion","example[38]":"The business community isn’t happy with some of the Democratic Party’s proposals.","definition[7]":"all the countries of the world","example[39]":"The international community agreed that industrialised countries should allocate 4% of overall foreign aid to population programmes."}