{"word[0]":"absence","definition[0]":"when you are not in the place where people expect you to be, or the time that you are away","example[0]":"Ms Leighton will be in charge during my absence  (=while I am away).","note[0]":"in/during somebody’s absence","example[1]":"Her work involved repeated absences from home.","note[1]":"absence from","definition[1]":"the lack of something or the fact that it does not exist","opposite[0]":"presence","example[2]":"In the absence of any evidence, the police had to let Myers go.","example[3]":"a complete absence of any kind of planning","note[2]":"absence of","collocation[0]":"a long absence","example[4]":"She was apprehensive about studying again after such a long absence.","collocation[1]":"a prolonged absence","example[5]":"Requests for prolonged absence during term time are strongly discouraged.","collocation[2]":"a lengthy absence","example[6]":"The injury may mean a lengthy absence from the team.","collocation[3]":"a brief absence","example[7]":"Everything seemed to have changed during his brief absence.","collocation[4]":"frequent absences","example[8]":"She disliked Stephen's frequent absences on business.","collocation[5]":"repeated absences","example[9]":"Repeated absences from school can lead to children falling behind.","collocation[6]":"a temporary absence","example[10]":"No one noticed her temporary absence.","collocation[7]":"a sudden absence","example[11]":"It wasn't easy to deal with Hugh's sudden absence.","collocation[8]":"an unexplained absence","example[12]":"Did he give a reason for his unexplained absence?","collocation[9]":"unauthorized absence","example[13]":"With the older pupils, unauthorized absence increased.","collocation[10]":"somebody's absence from work/school","example[14]":"You will be entitled to sick pay in respect of any absence from work through sickness.","collocation[11]":"a period of absence","example[15]":"You must submit a doctor's statement to cover the period of absence beyond the seventh day.","definition[2]":"when a person is not at work, for example because they are ill","example[16]":"Evelyn took charge in his absence.","example[17]":"The work of the department suffered because of her frequent absences."}