{"word[0]":"vote","signpost[0]":"in election/to support","definition[0]":"to show which person or party you want, or whether you support a plan, by marking a piece of paper, raising your hand etc","example[0]":"In 1918 British women got the right to vote.","example[1]":"I’ve voted Democrat all my life.","note[0]":"vote Democrat/Republican/Labour/Conservative etc","example[2]":"I voted for the Labour candidate in the last election.","note[1]":"vote for/against/in favour of","example[3]":"53% of Danes voted in favour of the Maastricht treaty.","example[4]":"The people of Ulster had finally been given a chance to vote on the issue.","note[2]":"vote on","example[5]":"Congress voted to increase foreign aid by 10%.","note[3]":"vote to do something","example[6]":"Shareholders voted to reject the offer.","signpost[1]":"choose for prize","definition[1]":"to choose someone or something for a particular prize by voting for them","example[7]":"In 1981 Henry Fonda was voted Best Actor for ‘On Golden Pond’.","note[4]":"vote somebody/something sth","definition[2]":"if a parliament, committee etc votes a sum of money for something, they decide by voting to provide money for that particular purpose","example[8]":"Parliament has voted £20 million extra funding for road improvements.","note[5]":"vote something for something","form[0]":"adverbs/NOUNS","collocation[0]":"vote yes/no","example[9]":"How many people voted Yes in the referendum?","collocation[1]":"vote Conservative/Democrat etc","example[10]":"Cubans in the city of Miami have traditionally voted Republican.","collocation[2]":"unanimously","example[11]":"The committee voted unanimously in favour of the proposition.","collocation[3]":"overwhelmingly","example[12]":"On Dec. 7 delegates voted overwhelmingly to strike.","collocation[4]":"narrowly","example[13]":"The Senate voted narrowly to continue funding the controversial project.","collocation[5]":"tactically","example[14]":"People appear to have voted tactically in order to prevent the Conservative candidate from gaining a seat.","collocation[6]":"be eligible/entitled to vote","example[15]":"All those aged 18 or over are eligible to vote.","collocation[7]":"register to vote","example[16]":"We must encourage people to register to vote.","explanation[0]":"You vote for someone or something","example[17]":"Who are you going to vote for at the next election?","example[18]":"Most MPs voted for the bill","explanation[1]":"You vote against someone or something","example[19]":"The committee voted against the decision","explanation[2]":"You vote to do something","example[20]":"Congress voted to change the law","explanation[3]":"Parliament, Congress etc passes a bill or law","example[21]":"Parliament passed a law against drug smuggling","explanation[4]":"Pass is often used in the passive in this meaning","example[22]":"The law was passed by a big majority","display[0]":"elect ","explanation[5]":"Elect is often used in the passive","explanation[6]":"You elect someone as something","example[23]":"She was elected as MP for Corby","explanation[7]":"You elect someone something","example[24]":"Obama was elected president in 2008","explanation[8]":"You elect someone to Parliament, Congress etc","example[25]":"She was elected to the Senate","example[26]":"You can vote for your favourite singer.","example[27]":"A majority of the people voted for independence.","example[28]":"In tomorrow’s election, many young people will be voting for the first time.","display[1]":"elect","definition[3]":"to choose a leader, representative, or government by voting, so that they become the new leader, representative etc","example[29]":"He was elected mayor of London.","example[30]":"the newly-elected government","example[31]":"I think we should start by electing a new chairman.","display[2]":"go to the polls","definition[4]":"if a country or voters go to the polls, they vote in an election – used especially in news reports","example[32]":"The US goes to the polls in November.","example[33]":"The economic crisis could well be a decisive factor when voters go to the polls this autumn.","display[3]":"take a vote","definition[5]":"if a group of people at a meeting take a vote, they vote about something","example[34]":"We should take a vote on whether or not to accept their offer.","example[35]":"They took a vote and picked Bernard.","display[4]":"cast your vote","definition[6]":"to mark a piece of paper, call a telephone number etc in order to vote","example[36]":"The first votes have been cast in the country’s general election.","example[37]":"Click here to cast your vote.","display[5]":"ballot","definition[7]":"to ask the members of an organization to vote on something in order to decide what to do","example[38]":"The union will ballot its members on whether to go ahead with the strike action.","display[6]":"veto","definition[8]":"to vote against something that other people have agreed on, so that it cannot happen","example[39]":"The president has the right to veto any piece of legislation.","signpost[2]":"choice by voting","definition[9]":"an act of voting in an election or meeting, or the choice that you make when you vote","example[40]":"A vote for us is not a wasted vote.","example[41]":"The proposal was rejected by 19 votes to 7.","example[42]":"policies designed to win votes in the South","example[43]":"It’s the club secretary that counts the votes.","example[44]":"Harkin won 74 percent of the votes cast.","example[45]":"The House of Representatives approved the budget, with 52 votes in favor, 16 against and 12 abstentions.","note[6]":"vote for/in favour (of)/against","signpost[3]":"occasion of voting","definition[10]":"an occasion when a group of people vote in order to decide something or choose a representative","example[46]":"The results of the vote were surprising – 80% of workers favoured strike action.","example[47]":"Unless anyone has anything to add, we’ll take a vote.","note[7]":"take/have a vote (on something)","example[48]":"Let’s have a vote on it.","example[49]":"Let’s put it to the vote. All those in favor raise your hands.","note[8]":"put something to the/a vote","example[50]":"There will be a citywide vote  (=all the voters in a particular city) on the matter.","signpost[4]":"result of voting","definition[11]":"the result of a vote","example[51]":"A close vote is expected.","example[52]":"The motion was passed by a vote of 215 to 84.","definition[12]":"to show by marking a paper, raising your hand etc which person you want to elect or whether you support a particular plan","example[53]":"23% of shareholders voted for him as a new director.","note[9]":"vote for/against","example[54]":"The board voted against filing a suit to recover the money.","example[55]":"Committee members voted 9-2 to raise interest rates.","example[56]":"The settlement offer collapsed after the House of Representatives voted it down  (=rejected it).","note[10]":"vote something down","example[57]":"The chairman was voted in  (=elected) by a 12-1 majority.","note[11]":"vote somebody in","definition[13]":"when a group of people vote in order to decide or choose something","example[58]":"The results of the vote were surprising — 80% of workers favoured strike action.","example[59]":"Creditors will take a vote on the reorganization plan later this year.","definition[14]":"a choice or decision that someone makes by voting in an election or meeting","example[60]":"The union was only 23 votes short of the majority it needed.","definition[15]":"the right to vote","example[61]":"Each share carries a vote.","definition[16]":"the total number of votes made in an election or the total number of people who vote","example[62]":"Their proposal to oust the board got 78% of the vote."}