{"word[0]":"theory","plural[0]":"theories","definition[0]":"an idea or set of ideas that is intended to explain something about life or the world, especially an idea that has not yet been proved to be true","example[0]":"different theories about how the brain works","note[0]":"theory about/on","example[1]":"Darwin’s theory of evolution","note[1]":"theory of","example[2]":"the theory that light is made up of waves","note[2]":"theory that","definition[1]":"general principles and ideas about a subject","example[3]":"Freudian theory has had a great influence on psychology.","example[4]":"I’m taking a course on political theory.","note[3]":"political/economic/literary etc theory","definition[2]":"an idea or opinion that someone thinks is true but for which they have no proof","example[5]":"Detectives are working on a theory that he knew his murderer.","collocation[0]":"come up with/develop a theory","example[6]":"These birds helped Darwin develop his theory of natural selection.","collocation[1]":"test a theory","example[7]":"Researchers gave workers a questionnaire to test that theory.","collocation[2]":"prove a theory","example[8]":"No evidence emerged to prove either theory.","collocation[3]":"support a theory","example[9]":"Modern research strongly supports this theory.","collocation[4]":"disprove a theory","example[10]":"Later experiments seemed to disprove the theory.","collocation[5]":"discredit a theory","example[11]":"These latest findings discredit his entire theory.","form[0]":"ADJECTIVES/NOUN + theory","collocation[6]":"a scientific theory","example[12]":"Scientific theories can be tested experimentally.","collocation[7]":"an economic theory","example[13]":"His economic theory assumes that both labour and capital are perfectly mobile.","collocation[8]":"a conspiracy theory","example[14]":"A variety of conspiracy theories question the official account of President Kennedy’s assassination.","collocation[9]":"a pet theory","example[15]":"Each of them had his pet theory on what had caused the uprising.","collocation[10]":"the theory of evolution/relativity etc","example[16]":"According to the theory of relativity, nothing can travel faster than light.","definition[3]":"an idea or set of ideas that is intended to explain why something happens or how it works","example[17]":"The book is called ‘An Evolutionary Theory of Economic Change’.","example[18]":"The theory is that a healthy employee is cheaper and more productive.","definition[4]":"the general principles or ideas of a subject","example[19]":"They found that theory and practice are two different things  (=things do not always happen according to the theory)."}