{"word[0]":"table","signpost[0]":"furniture","definition[0]":"a piece of furniture with a flat top supported by legs","example[0]":"The food was served on long tables.","signpost[1]":"restaurant","definition[1]":"a table for people to eat at in a restaurant","example[1]":"I've booked a table for two.","signpost[2]":"list","definition[2]":"a list of numbers, facts, or information arranged in rows across and down a page","example[2]":"a table of results","note[0]":"table of","example[3]":"the table of contents","signpost[3]":"group","definition[3]":"the group of people sitting around a table","example[4]":"His stories kept the whole table amused.","collocation[0]":"set/lay the table","example[5]":"The table was set for fourteen.","collocation[1]":"clear the table","example[6]":"Do you want me to clear the table?","collocation[2]":"sit at a table","example[7]":"He was sitting at a corner table.","collocation[3]":"sit around a table","example[8]":"We sat around the table and talked.","collocation[4]":"get up from/leave the table","example[9]":"She stood up from her chair and left the table.","collocation[5]":"book/reserve a table","example[10]":"I've booked a table for four at a local restaurant.","form[0]":"NOUN + table","collocation[6]":"dinner/breakfast table","example[11]":"Will you clear the breakfast table?","collocation[7]":"bedside/kitchen/dining-room table","example[12]":"They were chatting around the kitchen table.","definition[4]":"used to refer to a place where people come together to discuss important matters","example[13]":"The union has threatened to walk away from the bargaining table if a settlement isn’t made soon.","example[14]":"The government agreed to return to the negotiating table on May 6.","example[15]":"Distribution tables should show taxes actually paid.","example[16]":"a book’s table of contents","definition[5]":"an offer, idea etc that is on the table has been officially suggested and you are considering it","example[17]":"The offer on the table at the moment is a 10% wage increase.","definition[6]":"an offer, idea etc that is on the table is no longer being considered at the moment but will be dealt with in the future","definition[7]":"money that is paid under the table is paid secretly and illegally to someone in order to get what you want","example[18]":"Payments were made under the table to local officials.","definition[8]":"to suggest something for other people to consider","example[19]":"Two separate proposals were tabled.","definition[9]":"to leave something to be dealt with in the future","example[20]":"He tabled the bills to break up the state monopolies in insurance and telecommunications."}