{"word[0]":"breath","definition[0]":"the air that you send out of your lungs when you breathe","example[0]":"Leo could smell the wine on her breath.","example[1]":"Let your breath out slowly.","definition[1]":"air that you take into your lungs","example[2]":"When he reached the top of the stairs, his heart was pounding and he was gasping for breath.","definition[2]":"an amount of air that you take into your lungs","example[3]":"Shaun took a deep breath and dived in.","definition[3]":"a very small amount or a sign of something","example[4]":"They did everything they could to avoid the slightest breath of scandal.","note[0]":"breath of","collocation[0]":"take a breath","example[5]":"Alex took a deep breath, then jumped into the pool.","collocation[1]":"let your breath out","example[6]":"Let your breath out slowly and relax.","collocation[2]":"hold your breath","example[7]":"How long can you hold your breath underwater?","collocation[3]":"be out of breath","example[8]":"Andrew hurried in, slightly out of breath.","collocation[4]":"be short of breath","example[9]":"Near the top of the mountain I started to feel short of breath.","collocation[5]":"gasp/fight for breath","example[10]":"He was lying on the floor gasping for breath.","collocation[6]":"get your breath back","example[11]":"He leant against a tree until he had got his breath back.","collocation[7]":"pause for breath","example[12]":"She talked solidly for five minutes, hardly pausing for breath.","collocation[8]":"draw breath","example[13]":"I hid behind the door, hardly daring to draw breath.","collocation[9]":"bad breath","example[14]":"Smoking gives you bad breath.","collocation[10]":"a deep/long breath","example[15]":"She took a deep breath and knocked on the door.","collocation[11]":"a shallow breath","example[16]":"Shallow breaths are often a sign of nervousness.","collocation[12]":"shortness of breath","example[17]":"Symptoms include dizziness and shortness of breath.","collocation[13]":"an intake of breath","example[18]":"He gave a sharp intake of breath.","example[19]":"His first response was a sharp intake of breath."}