{"word[0]":"such","definition[0]":"of the same kind as the thing or person which has already been mentioned","example[0]":"Such behavior is just not acceptable in this school.","example[1]":"The rules make it quite clear what should be done in such a situation.","example[2]":"A victory for Brazil had been predicted, and such indeed was the result.","example[3]":"She needs to see a psychiatrist or some such person.","example[4]":"‘You said you’d be finished by today.’ ‘I said no such thing!’","example[5]":"There is now a greater awareness of problems such as these.","note[0]":"such as this/these","example[6]":"Birth is a natural process, and should be treated as such.","note[1]":"treated/recognized/accepted etc as such","definition[1]":"used to emphasize your description of something or someone","example[7]":"They’re such nice people.","example[8]":"It’s such a long way from here.","example[9]":"I felt such an idiot.","definition[2]":"used to mention the result of a quality that something or someone has","example[10]":"It’s such a tiny kitchen that I don’t have to do much to keep it clean.","example[11]":"He came to such a sudden stop that we almost hit him.","definition[3]":"used to say that something is so great, so bad etc that something else happens","example[12]":"He lectured in such a way that many in the audience found him impossible to understand.","note[2]":"in such a way/manner that/as to do something","example[13]":"Her condition deteriorated to such an extent that a blood transfusion was considered necessary.","note[3]":"to such an extent/degree that","example[14]":"The force of the explosion was such that windows were blown out.","note[4]":"be such that/as to do something","example[15]":"His manner was such as to offend nearly everyone he met.","definition[4]":"used to show that you think that something is not good enough or that there is not enough of it","example[16]":"We will look at the evidence, such as it is, for each of these theories.","note[5]":"such as it is/such as they are etc","example[17]":"Such food as they gave us was scarcely fit to eat.","note[6]":"such ... as","definition[5]":"used to refer only to people or things of a particular group or kind","example[18]":"Such individuals who take up this role often find life frustrating.","note[7]":"such ... as/who/that","example[19]":"Such of you as wish to leave may do so now.","note[8]":"such of somebody/something as","explanation[0]":"You use such a before an adjective and a noun, or before a singular noun","example[20]":"I’m lucky to have such a wonderful teacher","example[21]":"He gave me such a fright","bad_example[0]":"a such wonderful teacher","bad_example[1]":"a such fright"}