{"word[0]":"put down","definition[0]":"to put something or someone that you are holding or carrying onto a surface","example[0]":"Put those heavy bags down for a minute.","definition[1]":"to criticize someone and make them feel silly or stupid","synonym[0]":"belittle","example[1]":"I hate the way Dave puts me down the whole time.","example[2]":"Stop putting yourself down.","note[0]":"put yourself down","signpost[0]":"write","definition[2]":"to write something, especially a name or number, on a piece of paper or on a list","synonym[1]":"write down","example[3]":"Put down your name and address.","definition[3]":"to stop a revolution etc by using force","example[4]":"The uprising was put down by the police and the army.","signpost[1]":"pay","definition[4]":"to pay part of the total cost of something, so that you can pay the rest later","example[5]":"They put down a deposit on the goods until Christmas.","note[1]":"put something ↔ down on","definition[5]":"to put a baby in its bed","example[6]":"We try to put Amy down at six every evening.","definition[6]":"to put the receiver back onto the telephone when you have finished speaking to someone","synonym[2]":"hang up","example[7]":"She put the phone down on me  (=suddenly ended the conversation).","note[2]":"put the phone down on","signpost[2]":"kill","definition[7]":"to kill an animal without causing it pain, usually because it is old or sick","synonym[3]":"put something to sleep","example[8]":"We had to have the dog put down.","definition[8]":"used to say that you found a book, game etc extremely interesting","example[9]":"Once I’d started reading it I just couldn’t put it down.","definition[9]":"if an aircraft puts down or if a pilot puts it down, it lands, especially because of an emergency","example[10]":"The engine failed and the plane put down in the sea.","definition[10]":"to suggest a subject, plan, change in the law etc for a parliament or committee to consider","signpost[3]":"leave passenger","definition[11]":"to stop a vehicle so that passengers can get off at a particular place","example[11]":"He asked the taxi to put him down at the end of the road.","definition[12]":"something you say that is intended to make someone feel stupid or unimportant","synonym[4]":"snub","example[12]":"She was tired of his put-downs.","definition[13]":"to pay part of the total cost of something as a deposit","example[13]":"You will be required to put down a 25% deposit.","example[14]":"How much could you afford to put down on a house?"}