{"word[0]":"even","definition[0]":"used to emphasize something that is unexpected or surprising in what you are saying","example[0]":"Most companies have suffered a drop in their profits, even very large companies.","example[1]":"It was quite difficult to see, even with the light on.","example[2]":"He became quite successful and even appeared on a television show once.","example[3]":"She did not even bother to phone us.","example[4]":"He never even acknowledged my letter.","definition[1]":"used to add a stronger, more exact word to what you are saying","example[5]":"Some patients become depressed, even suicidal.","explanation[0]":"You use even before a person, thing, or phrase, when you want to emphasize what you are saying","example[6]":"Even young children know the difference between right and wrong","example[7]":"Poverty exists even in rich countries","explanation[1]":"You use even before a verb","example[8]":"He even offered to buy me a drink","explanation[2]":"You use even after an auxiliary verb","example[9]":"He has even offered to buy me a drink ","example[10]":"You can even see tigers","explanation[3]":"You use even though and even if when saying that something happens or is true in spite of another thing","example[11]":"Even though she was tired, she carried on walking","example[12]":"We’re still going to the concert, even if it rains","bad_example[0]":"even she was tired","bad_example[1]":"even it rains","explanation[4]":"You can use even though and even if with still","example[13]":"Even though we’re completely different, we’re still friends","bad_example[2]":"Even though we’re completely different, yet we’re friends","bad_example[3]":"Even though we’re completely different, but we’re friends","signpost[0]":"level","definition[2]":"flat and level, with no parts that are higher than other parts","opposite[0]":"uneven","example[14]":"The floor must be completely even before we lay the tiles.","example[15]":"You need a flat, even surface to work on.","example[16]":"He had lovely white, even teeth.","signpost[1]":"not changing","definition[3]":"an even rate, speed, or temperature is steady and does not change","example[17]":"The room is kept at an even temperature.","example[18]":"Wood burns at a fairly even rate.","signpost[2]":"divided equally","definition[4]":"divided equally, so that there is the same amount of something in each place, for each person etc","example[19]":"Divide the dough into three even amounts.","example[20]":"an even distribution of wealth","definition[5]":"an even number can be divided exactly by two","opposite[1]":"odd","example[21]":"2,4, 6 and 8 are even numbers.","definition[6]":"having teams or competitors that are equally good so that everyone has a chance of winning","example[22]":"The first half was very even, and neither side scored.","example[23]":"an even contest","signpost[3]":"scores","definition[7]":"if the score in a game is even, two teams or players have the same number of points","example[24]":"At the end of the first half the score is even.","definition[8]":"calm and controlled, and not extreme","example[25]":"He read most of the speech in an even tone.","definition[9]":"staying at the same level, rather than frequently changing from one level to the other","example[26]":"Strong trade will encourage more even selling.","definition[10]":"giving two sides, things, ideas etc equal or fair treatment","example[27]":"We should try to create a more even balance between work and recreation.","definition[11]":"in whole numbers, to the nearest ten, hundred etc","definition[12]":"an even account is the same on each side, so that there is neither a credit nor a debit balance"}