{"word[0]":"worker","definition[0]":"someone who does a job, especially a particular type of job","example[0]":"workers in the tourist industry","example[1]":"reports from local aid workers","definition[1]":"someone who works in an organization and who is not a manager","example[2]":"conflicts between workers and management","example[3]":"attacks on workers’ rights","form[0]":"ADJECTIVES/NOUN + worker","collocation[0]":"a skilled worker","example[4]":"There is a shortage of skilled workers.","collocation[1]":"an unskilled worker","example[5]":"Some ex-miners now had jobs as unskilled workers in factories.","collocation[2]":"a part-time worker","example[6]":"A high percentage of the female staff were part-time workers.","collocation[3]":"a full-time worker","example[7]":"The bureau has only two full-time workers.","collocation[4]":"a temporary/casual worker","example[8]":"Employees were fired and replaced with temporary workers.","collocation[5]":"a manual/blue-collar worker","example[9]":"Manual workers often live close to their workplace.","collocation[6]":"a white-collar worker","example[10]":"In the past, white-collar workers tended to work for one company for a long time, rather than changing jobs.","collocation[7]":"a low-paid worker","example[11]":"As part-time, low-paid workers, many women earned very little.","collocation[8]":"a factory/farm/office worker","example[12]":"Factory workers threatened strikes.","collocation[9]":"a research/rescue/health etc worker","example[13]":"Rescue workers searched the rubble all night looking for survivors.","collocation[10]":"a construction worker","definition[2]":"someone who does a particular type of job, or someone who works for an organization but is not a manager","example[14]":"a post-office worker","example[15]":"The workers are threatening to go on strike.","example[16]":"The report shows that male manual workers earn twice as much as female workers.","display[0]":"employee","definition[3]":"someone who has a job, especially a permanent job, with a particular company or organization","example[17]":"Employees of the airline get generous reductions on the cost of flights.","display[1]":"member of staff/staff member","definition[4]":"one of the people who work for a company, organization, school etc – used especially in official contexts","example[18]":"Training opportunities are available to all members of staff.","example[19]":"Several staff members complained about his increasing strange behaviour.","display[2]":"colleague","definition[5]":"someone you work with – use this especially about people who do professional jobs in offices, schools etc","example[20]":"I’d like you to meet a colleague of mine, Jean-Michel Blanc.","example[21]":"What should you do if a co-worker is injured?","display[3]":"workforce","definition[6]":"all the people that work in a country, industry, or large organization","example[22]":"Women make up 41% of the workforce.","display[4]":"staff","definition[7]":"all the people who work in a company, organization, school etc","example[23]":"The staff were clearly worried about rumours of job losses.","example[24]":"sales staff","definition[8]":"one of the people who work for an organization or business, and are below the level of manager","example[25]":"There are new health and safety regulations for factory workers.","example[26]":"Many office workers suffer from eyestrain."}