{"word[0]":"neutral","signpost[0]":"in an argument etc","definition[0]":"not supporting any of the people or groups involved in an argument or disagreement","example[0]":"I always tried to remain neutral when they started arguing.","example[1]":"Clive decided to adopt a neutral position.","example[2]":"The British government acted as a neutral observer during the talks.","signpost[1]":"in a war","definition[1]":"a country that is neutral does not support any of the countries involved in a war","note[0]":"neutral territory/waters (=land or sea that is not controlled by any of the countries involved in a war)","example[3]":"During World War II, Sweden was neutral.","definition[2]":"language, words etc that are neutral are deliberately chosen to avoid expressing any strong opinion or feeling","example[4]":"the neutral language of an official news report","signpost[2]":"voice/expression","definition[3]":"if someone says something in a neutral voice, or if they have a neutral expression on their face, they do not show how they are feeling","example[5]":"Bragg said in a neutral voice, ‘The investigation has been closed down.’","definition[4]":"a neutral colour is a colour such as grey, light brown, or cream","example[6]":"Neutral tones give the room a feeling of space.","signpost[3]":"wire","definition[5]":"a neutral wire, for example in a plug, has no electrical charge1(7)","signpost[4]":"chemical","definition[6]":"a neutral substance is neither acid nor alkaline","example[7]":"The plant prefers a neutral or slightly acidic soil.","example[8]":"a neutral pH of 7.0","definition[7]":"the position of the gears of a car or machine when no power is being sent from the engine to the wheels or other moving parts","example[9]":"When you start the engine, make sure the car’s in neutral.","note[1]":"in/into neutral","example[10]":"Put the car into neutral.","definition[8]":"a country, person, or group that is not involved in an argument or disagreement","definition[9]":"a neutral colour"}