{"word[0]":"conspiracy","plural[0]":"conspiracies","definition[0]":"a secret plan made by two or more people to do something that is harmful or illegal","example[0]":"There were many conspiracy theories (=beliefs that something is the result of a conspiracy) surrounding Princess Diana’s death.","example[1]":"He was charged with conspiracy to commit criminal damage.","note[0]":"conspiracy to do something","example[2]":"a conspiracy against the government","note[1]":"conspiracy against","collocation[0]":"an international/worldwide/global conspiracy","example[3]":"Hitler believed there was a worldwide conspiracy to enslave Germany.","collocation[1]":"a criminal conspiracy","example[4]":"His crimes were illegal possession of arms and criminal conspiracy.","collocation[2]":"a political conspiracy","example[5]":"Were the killings part of a political conspiracy?","collocation[3]":"an alleged conspiracy","example[6]":"The charges against him relate to an alleged conspiracy.","collocation[4]":"be part of a conspiracy","example[7]":"The jury found that Poindexter was part of a conspiracy to ship arms to Iran.","collocation[5]":"be involved in a conspiracy","example[8]":"Apparently the commander of the army had also been involved in the conspiracy.","collocation[6]":"be charged with conspiracy","example[9]":"The women were charged with conspiracy to supply heroin.","collocation[7]":"be convicted of conspiracy","example[10]":"He was convicted of conspiracy to carry out terrorist acts.","form[0]":"conspiracy + NOUN","collocation[8]":"a conspiracy theory","example[11]":"President Kennedy’s assassination inspired a lot of conspiracy theories.","collocation[9]":"a conspiracy theorist","example[12]":"Conspiracy theorists believe that Princess Diana’s death was not an accident.","collocation[10]":"a conspiracy charge/charge of conspiracy","example[13]":"Three men have been convicted on fraud and conspiracy charges.","definition[1]":"a secret plan that is made by two or more people to do something harmful or illegal","example[14]":"All three men were charged with conspiracy to defraud.","example[15]":"The company appears to be looking for proof of an industry-wide conspiracy against it.","note[2]":"a conspiracy against something/somebody"}