{"word[0]":"tape","signpost[0]":"for recording","definition[0]":"narrow plastic material covered with a special magnetic substance, on which you can record sounds, pictures, or computer information","example[0]":"We’ve got the film on tape.","note[0]":"on tape","example[1]":"I hate hearing my voice on tape.","definition[1]":"a special plastic box containing a length of tape that you can record sound on","example[2]":"I’ll listen to the tape tomorrow.","example[3]":"William lent me some of his Beatles tapes.","example[4]":"Bring me a blank tape and I’ll record it for you.","example[5]":"We played a tape of African music and began dancing.","note[1]":"tape of","definition[2]":"a special plastic box containing a length of tape that you can record sound and pictures on","signpost[1]":"sticky material","definition[3]":"a narrow length of plastic that is sticky on one side and is used to stick things together","example[6]":"a photo stuck to the wall with tape","signpost[2]":"thin piece of material","definition[4]":"a long thin piece of plastic or cloth used for purposes such as marking out an area of ground or tying things together","example[7]":"Crime-scene tape marked out the position of the murdered man.","signpost[3]":"for measuring","definition[5]":"a tape measure","signpost[4]":"record something","definition[6]":"to record sound or pictures onto a tape","example[8]":"Would you mind if I taped this conversation?","example[9]":"Quiet – the machine’s still taping.","signpost[5]":"stick something","definition[7]":"to stick something onto something else using tape","example[10]":"There were two pictures taped to the side of the fridge.","note[2]":"tape something to something","signpost[6]":"fasten something","definition[8]":"to fasten a package, box etc with sticky tape","signpost[7]":"injury","definition[9]":"to tie a bandage firmly around an injured part of someone’s body","example[11]":"His ankle had been taped.","explanation[0]":"Tape is often passive in this meaning","definition[10]":"narrow plastic material, usually inside a plastic box, used for storing computer information, sounds, or pictures","example[12]":"These tapes are held centrally and are accessible to many users.","example[13]":"Court proceedings are usually recorded on tape."}