{"word[0]":"grievance","definition[0]":"a belief that you have been treated unfairly, or an unfair situation or event that affects and upsets you","example[0]":"anyone who has a legitimate grievance against the company","example[1]":"a means of overcoming genuine grievances","example[2]":"There must be an opportunity for both sides to air their grievances.","example[3]":"The teachers’ contract established a grievance procedure.","example[4]":"the sense of grievance which characterized him as a young man","collocation[0]":"a genuine grievance","example[5]":"He felt that he had a genuine grievance and was prepared to take the company to court over the matter.","collocation[1]":"a legitimate grievance","example[6]":"Many people feel that the rebels have a legitimate grievance.","collocation[2]":"an old grievance","example[7]":"Years later, we became friends again and sorted out our old grievances.","collocation[3]":"a personal grievance","example[8]":"He has no personal grievance against Frank.","collocation[4]":"have a grievance (against somebody)","example[9]":"I had no grievance against him.","collocation[5]":"air your grievances","example[10]":"These committees act as a forum for various groups to air their grievances.","collocation[6]":"nurse a grievance","example[11]":"He was nursing a grievance about not being picked for the team.","collocation[7]":"file a grievance","example[12]":"She filed a grievance after failing to get a promotion.","collocation[8]":"settle a grievance","example[13]":"The union decided to settle its grievance in the law courts.","collocation[9]":"redress/remedy a grievance","example[14]":"Governments which have not redressed genuine grievances often pay a heavy price later on.","form[0]":"grievance + NOUN","collocation[10]":"a grievance procedure","example[15]":"You should pursue your complaint through the company's grievance procedure.","collocation[11]":"a sense of grievance","example[16]":"Anti-Americanism in these countries comes from a deep sense of grievance against the United States.","collocation[12]":"a source of grievance","example[17]":"Salaries are a traditional source of grievance in industry.","definition[1]":"a complaint made by a worker to an employer, usually because they feel they have been treated unfairly","example[18]":"All shopfloor grievances will be passed on to management.","example[19]":"You must pursue your complaint through the grievance procedure (=the system that a company has to examine and discuss workers’ complaints).","definition[2]":"the feeling that you have been treated unfairly by someone","example[20]":"Although she had been effectively demoted, she felt no grounds for grievance.","example[21]":"The fire may have been started by someone with a grievance against the oil industry.","note[0]":"grievance against"}