{"word[0]":"smart","comparative[0]":"smarter","superlative[0]":"smartest","signpost[0]":"intelligent","definition[0]":"intelligent or sensible","synonym[0]":"clever","example[0]":"The smart kids get good grades and go off to college.","example[1]":"I was smart enough to wait for a week.","example[2]":"His decision to become a director was a smart move (=sensible thing to do).","signpost[1]":"disrespectful","definition[1]":"trying to seem clever in a disrespectful way","example[3]":"Don’t get smart with me, young man.","example[4]":"He made some smart remark.","signpost[2]":"neat","definition[2]":"a smart person is wearing neat attractive clothes and has a generally tidy appearance","example[5]":"You’re looking very smart.","definition[3]":"smart clothes, buildings etc are clean, tidy, and attractive","example[6]":"a smart black suit","example[7]":"smart new offices","signpost[3]":"fashionable","definition[4]":"fashionable or used by fashionable people","example[8]":"one of Bonn’s smartest restaurants","signpost[4]":"technology","definition[5]":"smart machines, weapons, materials etc are controlled by computers and are designed to react in a suitable way depending on the situation","example[9]":"smart weapons","definition[6]":"a smart movement is done quickly, especially with force","example[10]":"a smart blow on the head","example[11]":"She set off at a smart pace (=fairly fast).","definition[7]":"to be upset because someone has hurt your feelings or offended you","example[12]":"She was still smarting from the insult.","note[0]":"smart from","definition[8]":"if a part of your body smarts, it hurts with a stinging pain","example[13]":"My eyes were smarting with the smoke.","definition[9]":"smart design, technology etc is very advanced, in a way that copies human intelligence","example[14]":"We specialize in creating smart websites that allow our clients to be in total control.","example[15]":"Built-in smart chips constantly monitor ink cartridge levels.","definition[10]":"very intelligent in business matters","example[16]":"This 40-page bonus booklet has smart ideas for increasing your revenue."}