{"word[0]":"break down","definition[0]":"if a car or machine breaks down, it stops working","example[0]":"The car broke down just north of Paris.","example[1]":"The printing machines are always breaking down.","definition[1]":"to fail or stop working in a successful way","example[2]":"Negotiations broke down after only two days.","example[3]":"I left London when my marriage broke down.","definition[2]":"if you break down a door, you hit it so hard that it breaks and falls to the ground","example[4]":"Police had to break down the door to get into the flat.","definition[3]":"to change or remove something that prevents people from working together and having a successful relationship with each other","example[5]":"Getting young people together will help to break down the barriers between them.","example[6]":"It takes a long time to break down prejudices.","definition[4]":"if a substance breaks down, or something breaks it down, it changes as a result of a chemical process","example[7]":"Food is broken down in the stomach.","note[0]":"break something ↔ down","example[8]":"Bacteria are added to help break down the sewage.","definition[5]":"to be unable to stop yourself crying, especially in public","example[9]":"He broke down and cried.","example[10]":"She broke down in tears when she heard the news.","definition[6]":"to separate something into smaller parts so that it is easier to do or understand","example[11]":"He showed us the whole dance, then broke it down so that we could learn it more easily.","example[12]":"The question can be broken down into two parts.","definition[7]":"to separate information or a total amount into parts, especially so that it is easier to understand","example[13]":"Once the statistics are broken down, some clear patterns of employment begin to emerge.","definition[8]":"if talks break down, they fail and come to an end because the people involved cannot agree","example[14]":"The meeting between management and unions broke down and no progress was made."}