{"signpost[0]":"situation/problem","definition[0]":"a serious situation, problem, accident etc is extremely bad or dangerous","example[0]":"the serious problem of unemployment","example[1]":"Luckily, the damage was not serious.","example[2]":"Serious crimes have increased dramatically.","example[3]":"Oil spills pose a serious threat to marine life.","example[4]":"The president was in serious trouble.","example[5]":"a serious accident on the freeway","note[0]":"serious injury/illness/accident etc","definition[1]":"important and needing a lot of thought or attention","example[6]":"This is a very serious matter.","example[7]":"the serious business of earning a living","example[8]":"Be quiet, Jim. This is serious.","signpost[1]":"not joking or pretending","definition[2]":"if someone is serious about something they say or plan to do, they really mean it and are not joking or pretending","example[9]":"His voice suddenly became more serious.","example[10]":"a serious article","example[11]":"Marry Frank?  You can’t be serious!","example[12]":"She sounded dead serious.","note[1]":"deadly/dead serious","example[13]":"Is she serious about giving up her job?","note[2]":"serious about","signpost[2]":"quiet/sensible","definition[3]":"someone who is serious is very quiet and sensible, and does not laugh and joke much","example[14]":"a serious student","signpost[3]":"worried/unhappy","definition[4]":"slightly worried or unhappy","example[15]":"You look serious. What’s wrong?","signpost[4]":"romantic relationship","definition[5]":"a serious romantic relationship is likely to continue for a long time","note[3]":"serious boyfriend/girlfriend","example[16]":"It’s serious – they’ve been seeing each other for six months.","example[17]":"Are you really serious about her?","signpost[5]":"sport/activity","definition[6]":"very interested in an activity or subject, and spending a lot of time doing it","example[18]":"He’s become a serious golfer since he retired.","example[19]":"Chris is a serious photographer.","definition[7]":"very good and often expensive","example[20]":"He’s got a serious car!","signpost[6]":"large amount","definition[8]":"used to emphasize that you are talking about a large amount of something","example[21]":"In industry, you can earn serious money.","collocation[0]":"a serious problem","example[22]":"Vandalism is a serious problem in the area.","collocation[1]":"a serious injury/illness","example[23]":"The driver was taken to hospital with serious injuries.","collocation[2]":"a serious accident","example[24]":"He is recovering from a serious accident.","collocation[3]":"serious damage","example[25]":"The explosion sparked a fire which caused serious damage to their flat.","collocation[4]":"a serious threat","example[26]":"In the developed world, over-consumption is now a serious threat to health.","collocation[5]":"a serious crime/offence","example[27]":"Kidnapping is a serious crime.","collocation[6]":"serious trouble","example[28]":"The economy was in serious trouble.","collocation[7]":"serious consequences","example[29]":"Neglecting to make a proper will can have serious consequences.","definition[9]":"very bad – used about problems, accidents, illnesses, or crimes","example[30]":"Violent crime is a serious problem in and around the capital.","example[31]":"The boy was taken to hospital with serious head injuries.","example[32]":"Fortunately, the damage to the car was not serious.","display[0]":"severe","definition[10]":"very serious – used about problems, injuries, and illnesses","example[33]":"He suffered severe injuries in a car crash.","example[34]":"The problem became so severe that they had to bring water in from other countries.","example[35]":"severe epilepsy","display[1]":"grave","definition[11]":"used about a situation that is very serious and worrying, especially because it is dangerous or seems likely to get worse","example[36]":"A thick fog descended and I knew that we were in grave danger.","example[37]":"The situation is grave – war now seems inevitable.","display[2]":"acute","definition[12]":"used about an illness, problem, or situation that has become very serious or dangerous, and needs to be dealt with quickly","example[38]":"She was taken to the hospital suffering from acute appendicitis.","example[39]":"In San Diego, the shortage of skilled workers is acute.","display[3]":"desperate","definition[13]":"used about a situation or problem that is very serious or dangerous, especially because a lot of people need urgent help","example[40]":"The situation is desperate – people here need aid before the harsh winter sets in.","example[41]":"The hospital is full of people in desperate need of medical attention.","display[4]":"critical","definition[14]":"used about a situation that is very serious and dangerous and might get worse suddenly","example[42]":"In 1991, the food supply situation became critical.","example[43]":"Eight people were killed and four are still in a critical condition.","display[5]":"life-threatening","definition[15]":"used about a situation, illness, or condition in which someone could die","example[44]":"Her child had a potentially life-threatening illness.","example[45]":"The situation was not life-threatening, but it was very worrying.","display[6]":"be a matter of life and death","definition[16]":"to be extremely serious – used when a situation is very urgent or important","example[46]":"For people living with HIV, getting the right treatment is literally a matter of life and death.","heading[0]":"not joking","definition[17]":"not joking or laughing, or not pretending","example[47]":"His voice sounded serious.","example[48]":"They seem to be serious about their relationship.","display[7]":"solemn","definition[18]":"very serious because of an important or sad occasion or ceremony","example[49]":"My father looked solemn, the way grown-ups look at funerals.","example[50]":"The judge read the verdict in a solemn voice.","definition[19]":"quiet and very serious – used especially about the way people look when something important or worrying happens","example[51]":"She consulted Doctor Staples and returned looking grave.","example[52]":"He listened with a grave expression on his face.","display[8]":"sombre","definition[20]":"sad, quiet, or serious because something unpleasant or worrying has happened or is going to happen","example[53]":"They sat in sombre silence.","example[54]":"The meeting began in a sombre mood.","display[9]":"earnest","definition[21]":"very serious and sincere – often used about someone who is young and not very experienced","example[55]":"He was a rather earnest-looking young man.","example[56]":"‘That’s wrong, ’ she said, her voice sounding very earnest."}