{"word[0]":"restore","signpost[0]":"former situation","definition[0]":"to make something return to its former state or condition","note[0]":"restore somebody’s sight/hearing (=make someone who cannot hear or who is blind, hear or see again)","example[0]":"She was hoping that the Mediterranean climate would restore her to full health.","example[1]":"The National Guard was called in to restore order (=make people stop fighting and breaking the law) when riots broke out.","example[2]":"initiatives to restore peace in the Middle East","example[3]":"Vietnam restored diplomatic relations with South Korea on December 22.","note[1]":"restore (diplomatic) relations with somebody","example[4]":"The government promises to restore the economy to full strength.","note[2]":"restore something to something","signpost[1]":"positive feeling","definition[1]":"to bring back a positive feeling that a person or a group of people felt before","example[5]":"measures aimed at restoring public confidence in the education system","example[6]":"a man whose kindness and sincerity really restored my faith in human nature  (=helped me to believe that people can be good)","signpost[2]":"repair","definition[2]":"to repair an old building, piece of furniture, or painting etc so that it is in its original condition","example[7]":"The church was carefully restored after the war.","example[8]":"a Victorian fireplace restored to its former glory","signpost[3]":"give something back","definition[3]":"to give back to someone something that was lost or taken from them","example[9]":"The treaty restored Okinawa to Japan.","note[3]":"restore something to somebody","explanation[0]":"In everyday English, people usually say that someone gives something back to its former owner, rather than restores it:","example[10]":"The treaty gave Okinawa back to Japan.","signpost[4]":"bring back a law","definition[4]":"to bring back a law, tax, right etc","example[11]":"a campaign to restore the death penalty","definition[5]":"to make something return to its former level or condition","example[12]":"The government’s first task will be to restore the economy.","example[13]":"a bid to restore the company to profitability","definition[6]":"to make a situation or feeling exist again","example[14]":"Without fundamental reforms, the profitability of the banking system will not be restored.","example[15]":"Hoping to restore investor confidence, the company replaced the head of its credit unit.","definition[7]":"to give something back, especially money that is owed","example[16]":"The government agreed to restore an estimated $120 million that had been cut from the Energy Department budget."}