{"word[0]":"selection","definition[0]":"the careful choice of a particular person or thing from a group of similar people or things","example[0]":"The judges have made their final selection.","example[1]":"the selection of a new leader","note[0]":"selection of","example[2]":"He had narrowly missed selection for the team.","note[1]":"selection for","example[3]":"Perlman’s selection as the party’s candidate","note[2]":"selection as","definition[1]":"something that has been chosen from among a group of things","synonym[0]":"choice","example[4]":"To order, just write your selections on the form.","example[5]":"These drawings represent a selection from a larger exhibition.","note[3]":"selection from","definition[2]":"a group of things of a particular type, often of things that are for sale","synonym[1]":"range","example[6]":"There's a big selection to choose from.","example[7]":"a wide selection of shellfish","example[8]":"They only have a limited selection of his books.","heading[0]":"– Meaning 1: the careful choice of a particular person or thing from a group of similar people or things","collocation[0]":"make a selection","example[9]":"Students should be able to make a selection from a range of reference materials.","collocation[1]":"careful selection","example[10]":"Adair emphasises the importance of careful selection of team members.","collocation[2]":"random selection","example[11]":"the random selection of genes","collocation[3]":"the final selection","example[12]":"The final selection will be based on local requirements.","form[0]":"selection + NOUN","collocation[4]":"the selection process/procedure","example[13]":"Before the selection process begins, candidates need to be clear about what the job entails.","collocation[5]":"the selection criteria","example[14]":"What are your selection criteria?","collocation[6]":"a selection committee","example[15]":"All the exhibitors have been carefully chosen by a very experienced selection committee.","heading[1]":"– Meaning 3: a group of things of a particular type, often of things that are for sale","collocation[7]":"a wide/large/big selection","example[16]":"The museum shop offers a wide selection of items.","collocation[8]":"a good selection","example[17]":"There is a good selection of bars and cafés nearby.","collocation[9]":"a varied selection","example[18]":"The supermarket has a varied selection of fruit juice drinks especially for children.","collocation[10]":"a small/limited selection","example[19]":"We also have a small selection of offices for daily hire.","definition[3]":"the careful choice of a particular person or thing from a group","example[20]":"The Health Authority is not involved in staff selection and recruitment.","example[21]":"Our deputy manager can supply details of the job, including ourselection criteria (=things considered when choosing someone for a job).","definition[4]":"something that has been chosen from a group of similar things","example[22]":"Over the next year, you make four more selections from over 300 book titles.","definition[5]":"a collection of goods of a particular type that are offered for sale","example[23]":"The company has carried out a major overhaul of its product selection based on consumer research."}