{"word[0]":"survive","definition[0]":"to continue to live after an accident, war, or illness","example[0]":"Only 12 of the 140 passengers survived.","example[1]":"She survived the attack.","example[2]":"people who survive cancer","definition[1]":"to continue to live normally in spite of many problems","example[3]":"I’m sure she will survive this crisis.","example[4]":"I’ve had a tough few months, but I’ll survive.","definition[2]":"to manage to live a normal life even though you have very little money","example[5]":"the amount that a family needs each week just to survive","example[6]":"I don’t know how you all manage to survive on Jeremy’s salary.","note[0]":"survive on","definition[3]":"to continue to exist after a long time","example[7]":"A few pages of the original manuscript still survive.","example[8]":"Several buildings in the town have survived from medieval times.","note[1]":"survive from","example[9]":"an old custom which has survived into the twenty-first century","note[2]":"survive into","example[10]":"The main building was demolished, but the library still survives as a museum.","note[3]":"survive as","definition[4]":"to continue to be successful","example[11]":"The car industry cannot survive without government help.","example[12]":"A lot of smaller firms did not survive the recession.","definition[5]":"to live longer than someone else, usually someone closely related to you","example[13]":"He is survived by his wife Sue.","definition[6]":"if a business survives, it manages to continue operating, even though it is in a very difficult situation","example[14]":"To survive, companies will have to focus on staff development.","example[15]":"The retailing company is cutting the number of its stores in an effort tosurvive its severe recessionaryproblems.","definition[7]":"if you survive, you continue to live. If you survive someone, you continue to live after they have died","example[16]":"Provided her husband survived her by 30 days, he would receive the income from her father’s estate."}