{"word[0]":"package","definition[0]":"something wrapped in paper, packed in a box, and then sent by mail or delivered","example[0]":"There’s a package here for a Miami Lakes address.","definition[1]":"the paper or plastic container that food or other goods are sold in","example[1]":"a package of meat","note[0]":"package of","definition[2]":"a set of ideas or services that are suggested or offered all together as a group","example[2]":"The government has announced a package of measures to assist affected areas.","note[1]":"package of measures/proposals/incentives etc","example[3]":"Many banks are offering financial packages for students.","note[2]":"aid/financial/benefits etc package","definition[3]":"a set of related programs sold together for use on a computer","note[3]":"software/word-processing/graphics etc package","definition[4]":"to put food or other goods into a bag, box etc ready to be sold or sent","example[4]":"The code informs us where and when a product was packaged.","example[5]":"The videos were packaged up, ready for distribution.","explanation[0]":"Package is usually passive in this meaning","definition[5]":"to prepare something for sale, especially by making it attractive or interesting to a particular group of people","example[6]":"They try to package their product to give it mass appeal.","definition[6]":"an amount of something or a number of things, packed together and wrapped up ready to be sent somewhere","synonym[0]":"PARCEL","example[7]":"The company delivers 300,000 packages overnight.","definition[7]":"a small container with a set of things in it","synonym[1]":"PACKET","example[8]":"Each package contains 4 AAA batteries.","definition[8]":"a set of related things, services, or proposals that are sold or presented together","example[9]":"the best-sellingdesktop publishing package on the market","example[10]":"Interco is urging bondholders to accept a package of new securities.","example[11]":"The company announced a package of cost-cutting measures.","definition[9]":"the pay and things such as holidays, pensions etc that you get with a particular job","example[12]":"an attractive financial package","definition[10]":"a package holiday","definition[11]":"to wrap or pack something so that it is ready to be sent somewhere","example[13]":"Many firms send components overseas to be packaged.","example[14]":"materials for packaging food and consumer products","definition[12]":"to put goods or services together and sell them as a set","example[15]":"The company packaged the software with other IBM products.","definition[13]":"to prepare something for sale, especially by adding something to it or by making it more attractive to buyers","example[16]":"She built a video empire by packaging her own fitness routines and selling them to millions of Americans.","definition[14]":"if a financial institution packages loans, it buys the loans from lenders such as banks and uses the loans as BACKING for bonds. The financial institution uses the repayments on these loans to make payments to investors who buy the bonds. Money that the lenders get from the financial institution when it sells the bonds is used to make more loans to customers","example[17]":"As seller of the mortgages, American Mortage forwarded repayments to the Federal Home Loan Mortgage Corporation, which had bought the loans and packaged them into securities."}