{"word[0]":"recovery","definition[0]":"the process of getting better after an illness, injury etc","example[0]":"Doctors expect him to make a full recovery.","note[0]":"make a full/good/remarkable etc recovery","example[1]":"Ann made a quick recovery from her operation.","note[1]":"recovery from","definition[1]":"the process of returning to a normal condition after a period of trouble or difficulty","example[2]":"Hopes of economic recovery are fading.","definition[2]":"when you get something back that has been taken or lost","example[3]":"the recovery of the stolen money","note[2]":"recovery of","heading[0]":"– Meaning 1: the process of getting better after an illness, injury etc","collocation[0]":"make a recovery","example[4]":"She has since made a complete recovery.","collocation[1]":"speed (up) somebody’s recovery","example[5]":"She believes that a holiday would speed my recovery.","collocation[2]":"aid somebody’s recovery","example[6]":"Although it is not a cure, the drug can aid recovery.","collocation[3]":"a full/complete recovery","example[7]":"She was severely injured but made a full recovery.","collocation[4]":"a good/satisfactory recovery","example[8]":"He is making a good recovery from a knee injury.","collocation[5]":"a remarkable/amazing/miraculous recovery","example[9]":"Doctors have every confidence that Laura will continue her remarkable recovery.","collocation[6]":"a speedy/quick/swift recovery","example[10]":"We wish him a speedy recovery.","heading[1]":"– Meaning 2: the process of returning to a normal condition after a period of trouble or difficulty","collocation[7]":"an economic recovery","example[11]":"The U.S. is showing solid signs of an economic recovery.","collocation[8]":"a sustained recovery","example[12]":"Will these policies provide a basis for sustained recovery and sustained growth?","collocation[9]":"a modest recovery","example[13]":"On the foreign exchanges the pound managed a modest recovery from Thursday’s slump.","collocation[10]":"a slow recovery","example[14]":"A slow recovery in the hotel market is likely to hold back the company’s profits.","plural[0]":"recoveries","definition[3]":"when prices increase or the economy grows again after a difficult period of time","example[15]":"Share prices staged a slight recovery yesterday.","example[16]":"Hopes for an economic recovery evaporated.","definition[4]":"when you get something back, such as money that you are owed","example[17]":"The company said it will pursue recovery of its investment.","definition[5]":"when you gradually get back an amount of money that you have spent on an asset by paying less tax. This reduction in tax is allowed to make up for DEPRECIATION (=the asset’s loss of value over time)","definition[6]":"anything that an insurance company is able to get back that reduces the total amount of a loss, such as damaged property, stolen goods that are found by the police etc"}