{"word[0]":"succeed","definition[0]":"to do what you tried or wanted to do","example[0]":"She wanted to be the first woman to climb Mount Everest, and she almost succeeded.","example[1]":"Scientists claim they have succeeded in finding a cure for cancer.","note[0]":"succeed in doing something","example[2]":"Very few people succeed in losing weight and keeping it off.","explanation[0]":"You succeed in doing something","example[3]":"She succeeded in persuading him","bad_example[0]":"She succeeded to persuade him","explanation[1]":"You can also use succeed on its own","example[4]":"I hope you succeed","explanation[2]":"Succeed is not used transitively in this meaning","bad_example[1]":"I hope you succeed it","definition[1]":"to have the result or effect something was intended to have","example[5]":"Unfortunately his plan did not succeed.","explanation[3]":"In everyday English, people often say that a method or treatment works rather than succeeds:","example[6]":"We tried rebooting the computer, but that didn’t work.","definition[2]":"to do well in your job, especially because you have worked hard at it for a long time","example[7]":"I’m not sure he has the determination to succeed as an actor.","note[1]":"succeed as","example[8]":"a woman who succeeded in politics","note[2]":"succeed in","definition[3]":"to be the next person to take a position or job after someone else","example[9]":"Who will succeed him to the throne?","note[3]":"succeed somebody to the throne","example[10]":"Reeves will succeed Segal as Speaker of the House.","note[4]":"succeed somebody as something","definition[4]":"to come after or replace something else, especially another product","example[11]":"This car is intended to succeed the popular Fiesta.","definition[5]":"to do something you tried or wanted to do","example[12]":"Will they succeed in winning the election?","example[13]":"He wanted to make her jealous, and he succeeded.","display[0]":"manage","definition[6]":"to succeed in doing something difficult, after trying hard. Manage to do something is very commonly used instead of succeed in doing something in everyday English","example[14]":"He finally managed to find an apartment near his office.","example[15]":"Don’t worry – I’m sure we’ll manage somehow.","display[1]":"achieve","definition[7]":"to succeed in doing something good or important","example[16]":"She’s achieved a lot in the short time she’s been with the company.","example[17]":"If we are to achieve our goals, we have to plan properly.","display[2]":"accomplish","definition[8]":"to achieve something","example[18]":"The government accomplished its objective of reducing violent crime.","example[19]":"What do you hope to accomplish this year?","display[3]":"make it","definition[9]":"to be successful in your career, or to succeed in reaching a place or part of a competition","example[20]":"Only a few people make it to the top and become professional singers.","example[21]":"We finally made it to Chicago.","example[22]":"Which two teams will make it to the final?","display[4]":"pull off","definition[10]":"to succeed in doing something, especially when you could easily have not succeeded. Pull off sounds rather informal","example[23]":"Italy pulled off a great victory over Germany.","example[24]":"I’d never performed on my own before, and wasn’t sure if I could pull it off."}