{"word[0]":"label","definition[0]":"a piece of paper or another material that is attached to something and gives information about it","example[0]":"a luggage label","example[1]":"It says ‘Dry clean’ on the label.","note[0]":"on the label","definition[1]":"a word or phrase which is used to describe a person, group, or thing, but which is unfair or not correct","example[2]":"Men these days have to avoid attracting the ‘sexist’ label.","definition[2]":"a record company","example[3]":"their new release on the Ace Sounds label","definition[3]":"to attach a label onto something or write information on something","example[4]":"Label the diagram clearly.","example[5]":"The file was labelled ‘Top Secret’.","note[1]":"label something sth","example[6]":"Each bag of seeds is labelled with the grower’s name.","note[2]":"label something with something","definition[4]":"to use a word or phrase to describe someone or something, but often unfairly or incorrectly","example[7]":"The newspapers had unjustly labelled him a troublemaker.","note[3]":"label somebody/something (as) something","example[8]":"The regime was inevitably labelled as ‘communist’.","definition[5]":"a piece of paper or cloth that is attached to something and gives information about it","example[9]":"price labels on goods in a supermarket","example[10]":"Read the label carefully and follow the instructions exactly.","definition[6]":"the company or brand name on a product","example[11]":"Some retailers market some goods under their own branding and some under the manufacturer’s label.","definition[7]":"the name of a record company","example[12]":"Phillips’ Polygram record company bought the Island label.","definition[8]":"the name of a wine-making company","example[13]":"This wine from the Napa Ridge label is one of the great bargains of all time.","definition[9]":"to fix a label onto something or write a description on something","example[14]":"Beef producers must obey certain rules in labeling their new low-fat products.","example[15]":"All charts, diagrams and tables should be labelled.","example[16]":"The government forced six companies to stop labeling their processed pastas, juices and pickles as ‘fresh.’","definition[10]":"to use a word or phrase to describe someone or something, often unfairly or incorrectly","example[17]":"One of the things we tend to do in organizations, unfortunately, is label people.","example[18]":"Plastics aren’t perceived as recyclable and so are labelled as environmentally unfriendly."}