{"word[0]":"stamp","definition[0]":"a small piece of paper that you buy and stick onto an envelope or package before posting it","example[0]":"a 29-cent stamp","example[1]":"Richard collects stamps.","example[2]":"a second-class stamp","signpost[0]":"printed mark","definition[1]":"a tool for pressing or printing a mark or pattern onto a surface, or the mark made by this tool","example[3]":"a date stamp","example[4]":"a passport stamp","signpost[1]":"payment","definition[2]":"a small piece of paper that is worth a particular amount of money and is bought and collected for something over a period of time","example[5]":"television licence stamps","signpost[2]":"tax","definition[3]":"a piece of paper for sticking to some official papers to show that British tax has been paid","signpost[3]":"with foot","definition[4]":"an act of stamping, especially with your foot","example[6]":"an angry stamp","signpost[4]":"put foot down","definition[5]":"to put your foot down onto the ground loudly and with a lot of force","example[7]":"The audience stamped and shouted.","example[8]":"‘I will not!’ Bert yelled and stamped his foot  (=because he was angry).","example[9]":"She stood at the bus stop stamping her feet  (=because she was cold).","example[10]":"Marta shrieked and started stamping on the cockroach.","note[0]":"stamp on somebody/something","signpost[5]":"walk noisily","definition[6]":"to walk somewhere in a noisy way by putting your feet down hard onto the ground because you are angry","synonym[0]":"stomp","example[11]":"My mother stamped off down the stairs.","note[1]":"stamp around/out of/off etc","signpost[6]":"make a mark","definition[7]":"to put a pattern, sign, or letters on something, using a special tool","example[12]":"The woman at the desk stamped my passport.","example[13]":"Among the papers was a brown folder stamped ‘SECRET’.","example[14]":"Stamp the date on all the letters.","note[2]":"stamp something on something","signpost[7]":"affect somebody/something","definition[8]":"to have an important or permanent effect on someone or something","example[15]":"The experience remained stamped on her memory for many years.","example[16]":"His army years had stamped him with an air of brisk authority.","note[3]":"stamp somebody with something","definition[9]":"to stick a stamp onto a letter, parcel etc","example[17]":"Care must be taken that the correct postage stamps for overseas post are used.","definition[10]":"a small piece of paper that is worth a particular amount of money and bought and collected towards paying for something over a period of time","example[18]":"Your passport must be stamped with your entry date.","note[4]":"stamp something with something","definition[11]":"to stick a stamp on a letter, parcel etc"}