{"word[0]":"exclude","definition[0]":"to deliberately not include something","opposite[0]":"include","example[0]":"a special diet that excludes dairy products","example[1]":"The judges decided to exclude evidence which had been unfairly obtained.","example[2]":"Some of the data was specifically excluded from the report.","note[0]":"exclude something from something","explanation[0]":"In everyday English, people usually say leave something or someone out rather than exclude something or someone:","example[3]":"Some information was left out of the report.","example[4]":"We didn’t mean to leave you out.","definition[1]":"to not allow someone to take part in something or not allow them to enter a place, especially in a way that seems wrong or unfair","example[5]":"a mainstream exhibition that excluded women artists","example[6]":"Sarah heard the other girls talking and laughing and felt excluded.","example[7]":"The press had been deliberately excluded from the event.","note[1]":"exclude somebody from (doing) something","definition[2]":"to officially make a child leave their school because of their bad behaviour","definition[3]":"to decide that something is not a possibility","synonym[0]":"rule out","example[8]":"Social workers have excluded sexual abuse as a reason for the child’s disappearance.","example[9]":"At this stage we cannot entirely exclude the possibility of staff cuts.","definition[4]":"to deliberately not include someone or something, especially in a way that seems wrong or unfair","example[10]":"The new law protects most workers, but excludes those on part-time contracts.","display[0]":"omit","definition[5]":"to not include something, especially a piece of information, either deliberately or because you forget","example[11]":"Sara’s name had been omitted from the list of employees.","display[1]":"leave out","definition[6]":"to not include someone or something, either deliberately or accidentally. Leave out is more common in everyday English than exclude or omit","example[12]":"Fans were shocked that Giggs had been left out of the team.","example[13]":"You must have left out one of the numbers.","display[2]":"miss out","definition[7]":"to not include someone or something that should be included, often by mistake","example[14]":"You missed out several important facts.","example[15]":"They’ve missed out the last letter of his name.","display[3]":"drop","definition[8]":"to decide not to include someone or something – used especially about not including someone in a team","example[16]":"He was dropped from the team because of injury.","example[17]":"The company decided to drop the word ‘healthy’ from its advertising.","display[4]":"be exempt(ed) from something","definition[9]":"used when saying that a rule, law, agreement etc does not affect someone or something","example[18]":"People with bad eyesight were exempt from military service.","example[19]":"High technology equipment would be exempted from any trade agreement.","example[20]":"The judge has decided to exclude her evidence.","example[21]":"One study did not use a double-blind design and was therefore excluded from the analysis.","note[2]":"exclude somebody/something from something","definition[10]":"to not allow someone to take part in something or not allow them to enter a place","example[22]":"He plans to challenge the commission’s decision to exclude him from the exchange.","note[3]":"exclude somebody from something"}