{"word[0]":"connection","definition[0]":"the way in which two facts, ideas, events etc are related to each other, and one is affected or caused by the other","synonym[0]":"link","example[0]":"Police have so far failed to establish a connection between the two murders.","example[1]":"The evidence was there in the file but no one made the connection.","example[2]":"Students often see little connection between school and the rest of their lives.","example[3]":"He demonstrated the close connection between social conditions and health.","example[4]":"the causal connection between smoking and cancer","note[0]":"connection between","example[5]":"There is a connection between pollution and the death of trees.","example[6]":"Mr O'Hara had no known connection with terrorist activity.","note[1]":"connection with","example[7]":"Williams apparently has no connection to the case.","note[2]":"connection to","signpost[0]":"joining","definition[1]":"when two or more things are joined together or when something is joined to a larger system or network","example[8]":"a digital telephone connection via satellite","example[9]":"They’re offering free Internet connection.","example[10]":"There’s a £25 connection charge  (=money you pay to be connected to a service such as telephones, electricity etc).","example[11]":"The socket allows connection to a PC.","signpost[1]":"electrical wire","definition[2]":"a wire or piece of metal joining two parts of a machine or electrical system","example[12]":"an electrical connection","example[13]":"There’s a loose connection  (=wires which are not joined correctly).","signpost[2]":"train/flight etc","definition[3]":"a train, bus, or plane which is arranged to leave at a time that allows passengers from an earlier train, bus, or plane to use it to continue their journey","example[14]":"If this train gets delayed we’ll miss our connection to Paris.","signpost[3]":"road/railway etc","definition[4]":"a road, railway etc that joins two places and allows people to travel between them","example[15]":"Cheshunt has good rail connections to London.","collocation[0]":"have a connection (with/to something)","example[16]":"A lot of social problems have a direct connection to alcohol or drug use.","collocation[1]":"see a connection","example[17]":"It's easy to see a connection between stress and illness.","collocation[2]":"make a connection","example[18]":"In learning to read, children make a connection between a written sign and a known sound or word.","collocation[3]":"establish a connection","example[19]":"Scientists have attempted to establish a connection between these two theories.","collocation[4]":"discover/find a connection","example[20]":"This is the first official investigation to find a connection.","collocation[5]":"something suggests a connection","example[21]":"There is nothing to suggest a connection between the hospital food and the illness.","collocation[6]":"break a connection","example[22]":"We must break the connection between money and politics.","collocation[7]":"sever a connection","example[23]":"We cannot sever our connection with the past.","collocation[8]":"a direct connection","example[24]":"Many people see a direct connection between these events.","collocation[9]":"a close/strong connection","example[25]":"the close connection between maths and physics","collocation[10]":"an intimate connection","example[26]":"There is an intimate connection between political liberty and economic freedom.","collocation[11]":"a causal connection","example[27]":"Psychologists have established a causal connection between behaviour and rewards.","collocation[12]":"a clear/obvious connection","example[28]":"There is an obvious connection between this painting and his earlier works.","collocation[13]":"a loose connection","example[29]":"There seemed to be only a loose connection between the questions and the answers.","definition[5]":"something that joins you to a system, for example the telephone network or the Internet","example[30]":"Do you have a broadband connection?","example[31]":"I keep getting an error message saying that someone has unplugged the phone connection.","definition[6]":"someone you know who can help you or be useful to you in business or in your career","example[32]":"She has a lot of business connections in the advertising industry.","definition[7]":"a train, bus, plane etc that you need to catch after getting off another one, in order to continue your journey","example[33]":"I missed my connection and had to wait three hours for the next plane.","definition[8]":"roads, railways etc that people can use to go from a place to other places","example[34]":"The city has good road and rail connections with other parts of Europe.","definition[9]":"concerning something or someone","example[35]":"Several people were arrested in connection with the affair."}