{"word[0]":"habitat","definition[0]":"the natural home of a plant or animal","example[0]":"watching monkeys in their natural habitat","example[1]":"The grassland is an important habitat for many wild flowers.","form[0]":"ADJECTIVES/NOUN + habitat","collocation[0]":"something’s natural habitat","example[2]":"She studies gorillas in their natural habitat.","collocation[1]":"something’s native habitat","example[3]":"Even in its native habitat, the plant is very rare.","collocation[2]":"a wildlife habitat","example[4]":"The land next to the harbour is perhaps the most threatened wildlife habitat in Britain.","collocation[3]":"a woodland/wetland/grassland/marshland habitat","example[5]":"The owl inhabits woodland habitats from Scotland to southern Spain.","collocation[4]":"a coastal habitat","example[6]":"Dolphins are vulnerable to these poisons because of their coastal habitat.","collocation[5]":"a marine habitat","example[7]":"Cuttlefish are found in marine habitats worldwide.","collocation[6]":"an important habitat","example[8]":"The island is an important habitat for exotic animals.","collocation[7]":"damage/destroy a habitat","example[9]":"Widening the road will uproot trees and damage wildlife habitat.","collocation[8]":"provide a habitat","example[10]":"Marshes provide the habitat of many species of wading birds.","collocation[9]":"conserve/protect a habitat","example[11]":"These measures will protect the habitat of endangered species such as wolves.","collocation[10]":"create a habitat","example[12]":"The aim is to create a suitable breeding habitat for rare birds.","collocation[11]":"loss of habitat","example[13]":"Elephants are menaced by poaching and loss of habitat.","collocation[12]":"the destruction of a habitat","example[14]":"It is in south Texas that the destruction of the bird’s habitat has been most alarming.","definition[1]":"a store that sells furniture and other things for the home. The stores are sometimes inside other, larger stores. Habitat products are known for being attractively designed and practical, and they are popular especially with middle-class people."}