{"definition[0]":"to carefully put something down somewhere","example[0]":"She set the tray down on a table next to his bed.","note[0]":"set something (down) on something","example[1]":"Mark filled the pan and set it on the stove.","example[2]":"The workmen set the box down carefully on the floor.","note[1]":"set something down/aside","example[3]":"Remove the mushrooms and set them aside.","signpost[0]":"put into surface","definition[1]":"to put something into a surface","example[4]":"an alarm button set into the wall beside the door","note[2]":"be set into the wall/floor/ceiling etc","example[5]":"Gates should be hung on sturdy posts set well into the ground.","note[3]":"be set into something","explanation[0]":"Set is usually passive in this meaning","signpost[1]":"story","definition[2]":"if a film, play, story etc is set in a particular place or period, the action takes place there or then","example[6]":"The novel is set in France.","note[4]":"be set in something","example[7]":"All this romance is set against a backdrop of rural Irish life.","note[5]":"be set against something","definition[3]":"to consider something in relation to other things","example[8]":"This debate should be set in an international context.","example[9]":"These casualty totals have to be set against the continuing growth in traffic.","note[6]":"set something against/beside something","signpost[2]":"establish something","definition[4]":"to establish a way of doing something that is then copied or regarded as good","example[10]":"It is important that parents set an example (=behave well).","example[11]":"The outcome of the case will set a legal precedent.","example[12]":"His photographs set the standard for landscapes.","example[13]":"Freud’s views on sexuality set the agenda for much of the century  (=people paid attention to the subjects he dealt with).","example[14]":"Art and literature flourished and this set the pattern for the whole of Europe.","note[7]":"set the pattern/tone/trend etc (for something)","example[15]":"The prime minister’s fierce speech set the tone for the rest of the conference.","signpost[3]":"start something happening","definition[5]":"to make something start happening or to make someone start doing something","example[16]":"A study by military experts was immediately set in motion.","note[8]":"set something in motion/progress/train","example[17]":"The chief executive will set in train the process of finding a successor.","example[18]":"Protesters set fire to two buses.","note[9]":"set something on fire/alight/ablaze","example[19]":"Her last remark has set me thinking.","note[10]":"set somebody/something doing something","example[20]":"The wind set the trees rustling.","signpost[4]":"decide something","definition[6]":"to decide and state when something will happen, how much something should cost, what should be done etc","example[21]":"International companies set the price of oil.","example[22]":"The government has still not set a date for the election.","note[11]":"set a date/time (for something)","example[23]":"high standards of hygiene set by the Department of Health","note[12]":"set standards/limits/guidelines etc","signpost[5]":"start working","definition[7]":"to start doing something in a determined way, or to tell someone to start doing something","example[24]":"They set to work to paint the outside of the building.","note[13]":"set to work to do something","example[25]":"He’s about to set to work on a second book.","note[14]":"set (somebody) to work on something","example[26]":"The boys were set to work collecting firewood.","note[15]":"set (somebody) to work doing something","example[27]":"Rocard set himself to reform public sector industry.","note[16]":"set somebody to do something","signpost[6]":"machine/clock etc","definition[8]":"to move a switch on a machine, clock etc so that it will start or stop working at the time you want, or in the way you want","example[28]":"Did you set the alarm?","example[29]":"I set the oven to come on at 12.","example[30]":"Usually, the heating is set on ‘low’.","note[17]":"set something to/at/on something","signpost[7]":"liquid/glue/cement etc","definition[9]":"to become hard and solid","example[31]":"How long does it take for the glue to set?","signpost[8]":"sun","definition[10]":"when the sun sets, it moves down in the sky and disappears","signpost[9]":"face","definition[11]":"if your face or mouth sets into a particular expression, you start to have an angry, sad, unfriendly etc expression","example[32]":"His mouth set into a rather grim line.","note[18]":"set into","signpost[10]":"bone","definition[12]":"if a doctor sets a broken bone, he or she moves it into position so that the bone can grow together again","definition[13]":"if a broken bone sets, it joins together again","signpost[11]":"class work","definition[14]":"to give a student in your class a piece of work to do","example[33]":"Mr Biggs has set us a 2,000-word essay.","note[19]":"set somebody something","signpost[12]":"examination","definition[15]":"to write the questions for an examination","example[34]":"The head teacher sets the questions for the English exam.","signpost[13]":"printing","definition[16]":"to arrange the words and letters of a book, newspaper etc so it is ready to be printed","example[35]":"In those days, books had to be set by hand.","definition[17]":"to arrange someone’s hair while it is wet so that it has a particular style when it dries","heading[0]":"– Meaning 5: to establish a way of doing something that is then copied or regarded as good","collocation[0]":"set an example","example[36]":"Parents should try to set a good example to their teenagers.","collocation[1]":"set a precedent","example[37]":"This legislation would set a most dangerous precedent.","collocation[2]":"set the pattern/trend","example[38]":"That first day seemed to set the pattern for the following weeks.","collocation[3]":"set the tone","example[39]":"The gloomy first chapter sets the tone for the rest of the novel.","collocation[4]":"set the standard","example[40]":"They wanted to set the standard for software.","collocation[5]":"set the agenda","example[41]":"We are not attempting to set the agenda for other women’s groups.","collocation[6]":"set the pace","example[42]":"With regard to industrialization, Britain set the pace in the first half of the nineteenth century.","heading[1]":"– Meaning 7: to decide and state when something will happen, how much something should cost, what should be done etc","collocation[7]":"set a date/time","example[43]":"No date has been set for the election.","collocation[8]":"set a price","example[44]":"We set the price at £30.","collocation[9]":"set standards/guidelines","example[45]":"The government has set new food quality standards for all school canteens.","collocation[10]":"set limits","example[46]":"Set strict limits on your spending.","signpost[14]":"group of things","definition[18]":"a group of similar things that belong together or are related in some way","example[47]":"a chess set","example[48]":"a set of tools","note[20]":"set of","example[49]":"We face a new set of problems.","example[50]":"The older generation have a different set of values.","signpost[15]":"television/radio","definition[19]":"a television, or a piece of equipment for receiving radio signals","example[51]":"a colour television set","definition[20]":"a place where a film or television programme is filmed","example[52]":"Cruise met Kidman on the set of ‘Days of Thunder’.","note[21]":"on set/on the set","signpost[16]":"stage","definition[21]":"the scenery, furniture etc used on a stage in a play or in the place where a film or television show is being made","definition[22]":"one part of a game such as tennis or volleyball","example[53]":"Nadal won the second set 6–4.","definition[23]":"a group of people who are similar in some way and spend time together socially","example[54]":"a favourite meeting place of the smart set  (=rich and fashionable people)","example[55]":"Val got in with a wild set at college.","definition[24]":"a performance by a singer, band, or disc jockey","example[56]":"Sasha performed a three-hour set.","signpost[17]":"maths","definition[25]":"a group of numbers, shapes etc in mathematics","example[57]":"The set (x, y) has two members.","signpost[18]":"students","definition[26]":"a group of children who are taught a particular school subject together because they have the same level of ability in that subject","synonym[0]":"stream","example[58]":"Adam’s in the top set for maths.","note[22]":"top/bottom etc set","signpost[19]":"onion","definition[27]":"a small onion that you plant in order to grow bigger ones","example[59]":"onion sets","signpost[20]":"placed","definition[28]":"being in the position that is mentioned","example[60]":"a medieval village set high on a hill","note[23]":"set in/on/back etc","example[61]":"a big house set back from the road","signpost[21]":"background","definition[29]":"used to say that something is in front of a particular background, especially in a way that is attractive","example[62]":"a small town of white buildings, set against a background of hills","note[24]":"set against","example[63]":"pink petals set against dark green foliage","signpost[22]":"fixed","definition[30]":"a set amount, time etc is fixed and is never changed","example[64]":"We were paid a set amount each week.","example[65]":"The evening meal is served at a set time.","example[66]":"Small children like a set routine.","signpost[23]":"ready","definition[31]":"someone who is set for something is ready for it","example[67]":"Get set (=get ready) for a night of excitement.","example[68]":"On your marks, get set, go (=said to start a race).","example[69]":"Are you all set for the trip?","note[25]":"set for","example[70]":"I was just set to go when the phone rang.","note[26]":"set to do something","signpost[24]":"opinions/habits etc","definition[32]":"not likely to change","example[71]":"People had very set ideas about how to bring up children.","example[72]":"Mark was 65 and rather set in his ways (=habits).","signpost[25]":"meal","definition[33]":"a set meal in a restaurant has a fixed price and a more limited choice than usual","example[73]":"The hotel does a very good set menu.","note[27]":"set lunch/dinner/menu","signpost[26]":"fixed expression","definition[34]":"if your face is set, it has a fixed expression on it, especially one that is angry, worried etc","example[74]":"He stared at her, his face set.","example[75]":"Kate’s face was set in a grim expression.","example[76]":"‘Damn you, ’ he said through set teeth.","note[28]":"set smile/teeth/jaw","definition[35]":"a way of buying and paying for goods on the Internet that allows the safe exchange of personal and financial information","definition[36]":"to decide that something should happen on a particular date, cost a particular amount, be done in a particular way etc","example[77]":"We haveset a deadline of 31 December for the receipt of bids.","example[78]":"The initialprice is set at $6 a share.","example[79]":"The OPEC agreementset aproduction ceiling (=limit) of 22.5 million barrels of oil a day.","definition[37]":"to establish standards, aims etc for doing something","example[80]":"The new Chief Executive will be under pressure to maintain the growth targets set by his predecessor.","example[81]":"Twenty-one computer companies met to set a standard for advanced computers.","definition[38]":"to decide that someone should try to achieve something, especially something that needs a lot of effort","example[82]":"The sales force was set a challenge — to find three good ideas for improving profit levels.","definition[39]":"an amount, date etc that is fixed and cannot be changed","example[83]":"These bonds pay investors a set sum on a set date in the future.","example[84]":"The subcontractor employs the workforce for aset wage."}