{"word[0]":"mysterious","definition[0]":"mysterious events or situations are difficult to explain or understand","example[0]":"The police are investigating the mysterious deaths of children at the hospital.","example[1]":"Benson later disappeared in mysterious circumstances.","example[2]":"There’s something mysterious going on.","definition[1]":"a mysterious person is someone who you know very little about and who seems strange or interesting","synonym[0]":"enigmatic","example[3]":"I decided to find out more about my mysterious new neighbour.","example[4]":"a mysterious stranger","definition[2]":"someone who behaves in a mysterious way says very little about what they are doing","synonym[1]":"secretive","example[5]":"She hid her thoughts behind a mysterious smile.","example[6]":"Helen’s being very mysterious about her plans.","note[0]":"mysterious about","definition[3]":"difficult to explain or understand, and often strange or slightly frightening","example[7]":"the mysterious disappearance of ships in the waters of the Bermuda Triangle","example[8]":"What’s that mysterious noise?","display[0]":"puzzling","definition[4]":"difficult to explain or understand","example[9]":"At first this must seem a puzzling question.","example[10]":"I found her attitude deeply puzzling.","display[1]":"baffling","definition[5]":"impossible to understand, so that you feel very confused","example[11]":"It was a baffling case.","example[12]":"Like many people, I find theoretical physics baffling.","display[2]":"inexplicable","definition[6]":"impossible to explain","example[13]":"For some inexplicable reason her mind went completely blank.","example[14]":"Some things in life are inexplicable.","definition[7]":"mysterious and difficult to understand, but also often attractive or interesting – used especially about people, their expressions, or things they say","example[15]":"She gave him an enigmatic smile.","example[16]":"an enigmatic remark","display[3]":"cryptic","definition[8]":"having a meaning that is difficult to understand, and is not expressed in a clear direct way – used especially about things that people say or write","example[17]":"I got a rather cryptic message from him.","example[18]":"cryptic comments","display[4]":"be a mystery","definition[9]":"if something is a mystery, you cannot understand how or why it happens","example[19]":"Four years later, his death remains a complete mystery.","example[20]":"It’s all a mystery to me.","display[5]":"be shrouded/veiled in mystery","definition[10]":"if an event or a situation, especially one that happened a long time ago, is shrouded in mystery, it is mysterious because no one knows exactly what happened","example[21]":"Stone age civilization, veiled in mystery as it is, has provided the greatest challenge to historians."}