{"word[0]":"favour","definition[0]":"something that you do for someone in order to help them or be kind to them","example[0]":"Could you do me a favour and tell Kelly I can’t make it?","example[1]":"He hired John as a favour to his father.","example[2]":"Paul, can I ask you a favor?","example[3]":"I owed him a favour so I couldn’t say no.","example[4]":"She helps me out when I have too much to do, and I return the favour when I can.","example[5]":"Do yourself a favour and make sure you get some time to yourself.","signpost[0]":"support/approval","definition[1]":"support, approval, or agreement for something such as a plan, idea, or system","note[0]":"find/rule in favour of somebody formal (=make a legal decision that supports someone)","example[6]":"I talked to Susie about it, and she’s all in favor (=completely approves) of going.","example[7]":"In Sweden and other countries, nuclear power has lost favor.","example[8]":"All in favour (=used when asking people to vote on something by raising a hand)?","example[9]":"The idea may find favor with older people.","note[1]":"find/gain/win favour","example[10]":"Employers are more likely to look with favour on experienced candidates.","note[2]":"look on/view/regard something with favour","example[11]":"288 members voted in favor of the ban.","note[3]":"vote/decide in favour of something","example[12]":"Senior ministers spoke in favour of the proposal.","note[4]":"in favour of something","example[13]":"The vote was 60–59 in the government’s favor.","note[5]":"in somebody/something’s favour","signpost[1]":"popular/unpopular","definition[2]":"when someone or something is liked or approved of by people, or not liked or approved of","example[14]":"Radcliffe’s books began to find favour with the reading public.","example[15]":"Fountain pens have come back in favour.","note[6]":"come/be back in favour","example[16]":"Grammar-based teaching methods went out of favour in the 60s and 70s.","note[7]":"fall/go out of favour","example[17]":"The island is very much in favour as a holiday destination.","note[8]":"be in favour (with somebody)","example[18]":"The stock is currently out of favor with investors.","note[9]":"be out of favour (with somebody)","signpost[2]":"unfair support","definition[3]":"support that is given to one person or group and not to others, in a way that does not seem fair","example[19]":"Teachers should not show favour to any pupil.","signpost[3]":"gift","definition[4]":"a party favor","collocation[0]":"do somebody a favour","example[20]":"Could you do me a favour and lend me £5?","collocation[1]":"ask somebody a favour","example[21]":"I felt nervous about asking Stephen a favour.","collocation[2]":"owe somebody a favour","example[22]":"I owe you a favour for all the help you’ve given me.","collocation[3]":"return a favour","example[23]":"He helped me in the past and now he wanted me to return the favour.","collocation[4]":"a big favour","example[24]":"I’ve got a big favour to ask of you.","collocation[5]":"a great favour","example[25]":"He acted as though he’d done us a great favour by coming.","collocation[6]":"a small/little favour","example[26]":"Can you do me a small favour?","collocation[7]":"a special favour","example[27]":"I agreed to deliver the parcel as a special favour to Paul.","collocation[8]":"a personal favour","example[28]":"As a personal favour, he let us use the hall to rehearse.","collocation[9]":"a political favour","example[29]":"He was accused of granting political favours in return for illegal payments.","collocation[10]":"as a favour to somebody","example[30]":"She delivered the parcel as a favour to her sister.","collocation[11]":"do yourself a favour","example[31]":"Do yourself a favour and read as many books on the subject as possible.","signpost[4]":"prefer","definition[5]":"to prefer someone or something to other things or people, especially when there are several to choose from","example[32]":"Both countries seem to favour the agreement.","example[33]":"loose clothing of the type favoured in Arab countries","example[34]":"Florida voters favored Bush over Gore by a very small margin.","note[10]":"favour somebody/something over somebody/something","signpost[5]":"give an advantage","definition[6]":"to treat someone much better than someone else, in a way that is not fair","example[35]":"a tax cut that favours rich people","example[36]":"a judicial system that favours men over women","note[11]":"favour somebody over somebody","definition[7]":"to provide suitable conditions for something to happen","example[37]":"The current economy does not favour the development of small businesses.","signpost[6]":"look like","definition[8]":"to look like one of your parents or grandparents"}