{"word[0]":"flush","signpost[0]":"become red","definition[0]":"to become red in the face, for example when you are angry or embarrassed","synonym[0]":"blush","example[0]":"Susan flushed deeply and looked away.","example[1]":"He flushed angrily.","example[2]":"Robyn felt her cheeks flush scarlet.","note[0]":"flush red/crimson/scarlet","example[3]":"Mrs Cooper flushed with indignation.","note[1]":"flush with","definition[1]":"if you flush a toilet, or if it flushes, you make water go through it to clean it","example[4]":"Why do children never remember to flush the loo?","example[5]":"She flushed the rest of her drink down the toilet.","signpost[1]":"clean something","definition[2]":"to force water through a pipe in order to clean it","example[6]":"They flush clean water through the pipes once a day.","note[2]":"flush something through something","signpost[2]":"redness on face","definition[3]":"a red colour that appears on your face when you are angry or embarrassed","example[7]":"His words brought a warm flush to her face.","definition[4]":"the part of a toilet that cleans it with a sudden flow of water","example[8]":"The flush isn’t working properly.","definition[5]":"the act of cleaning a toilet by forcing water through it","definition[6]":"a set of cards that someone has in a card game that are all of the same suit","definition[7]":"if two surfaces are flush, they are at exactly the same level, so that the place where they meet is flat","example[9]":"Make sure that the cupboard is flush with the wall.","definition[8]":"if someone is flush, they have plenty of money to spend","example[10]":"I’m feeling flush at the moment.","definition[9]":"to have a lot of money at a particular time","example[11]":"Singapore’s savings rate is so high that the banks are flush with funds.","example[12]":"The group is flush and has been making more acquisitions.","definition[10]":"to be very successful, and keen to achieve more success","example[13]":"Flushed by success in selling homes in the slump, developers now plan to do the same in the commercial property sector.","definition[11]":"a complete failure","example[14]":"You can get a dealer who is a busted flush at 30."}