{"word[0]":"contract","definition[0]":"an official agreement between two or more people, stating what each will do","example[0]":"Employees who refuse to relocate are in breach of contract (=have done something not allowed by their contracts).","example[1]":"Tyler has agreed a seven-year contract with a Hollywood studio.","note[0]":"contract with/between","example[2]":"a three-year contract to provide pay telephones at local restaurants","note[1]":"contract to do something","example[3]":"The firm operates schools under contract to state education authorities.","note[2]":"on a contract/under contract","definition[1]":"an agreement to kill a person for money","example[4]":"They put a contract out on him and he’s in hiding.","collocation[0]":"have a contract","example[5]":"The company had a contract to build a new hotel there.","collocation[1]":"sign a contract","example[6]":"He signed a contract to become vice president of the football club.","collocation[2]":"enter (into) a contract","example[7]":"You will enter a two-year training contract with your chosen employer.","collocation[3]":"agree to a contract","example[8]":"Keane was reported to have agreed a contract for a further three years.","collocation[4]":"make a contract","example[9]":"Did he know this when he made the contract?","collocation[5]":"negotiate a contract","example[10]":"Your lawyer will assist you in negotiating a contract.","collocation[6]":"break a contract","example[11]":"She broke her contract and left the job after only six months.","collocation[7]":"fulfil/honour a contract","example[12]":"If you have signed a contract, you have to fulfil it.","collocation[8]":"draw up a contract","example[13]":"The two sides drew up a contract.","collocation[9]":"win/get a contract","example[14]":"They won a contract to supply 37 passenger trains to Regional Railways.","collocation[10]":"give somebody a contract","example[15]":"He was given a new two-year contract in March.","collocation[11]":"award a company a contract","example[16]":"The state of Kentucky has awarded the firm a $10m contract.","collocation[12]":"cancel/end/terminate a contract","example[17]":"The buyer has three days in which to cancel the contract.","collocation[13]":"renew somebody’s contract","example[18]":"I hope they will renew my contract at the end of the year.","collocation[14]":"a one-year/two-year etc contract","example[19]":"He signed a five-year contract worth $2 million.","collocation[15]":"a recording/building etc contract","example[20]":"The band was soon offered a recording contract with Columbia Records.","collocation[16]":"a written contract","example[21]":"All employees should have a written contract.","collocation[17]":"a contract of employment","example[22]":"Make sure you fully understand your contract of employment.","collocation[18]":"the terms of a contract","example[23]":"He explained the terms of the contract.","collocation[19]":"breach of contract","example[24]":"They are suing the building company for breach of contract.","collocation[20]":"be in breach of contract","definition[2]":"to become smaller or narrower","opposite[0]":"expand","example[25]":"Metal contracts as it cools.","example[26]":"The economy has contracted by 2.5% since last year.","definition[3]":"to get an illness","synonym[0]":"catch","example[27]":"Two-thirds of the adult population there have contracted AIDS.","definition[4]":"to sign a contract in which you agree formally that you will do something or someone will do something for you","example[28]":"Most of the marriages were contracted when the brides were very young.","note[3]":"contract a marriage/alliance etc","example[29]":"They are contracted to work 35 hours a week.","note[4]":"contract (somebody) to do something","example[30]":"the company that had been contracted to build the models","example[31]":"Doctors control their budgets and contract with hospitals for services.","note[5]":"contract (with) somebody for something","definition[5]":"a formal written agreement between two or more people or groups which says what each must do for the other, or must not do","example[32]":"Informix signed a contract to provide software for Wal-Mart Stores’ distribution and systems.","example[33]":"Lawyers are still drawing up the recording contract.","example[34]":"Gazprom has entered into a contract with NIOC to develop the South Pars gas field.","example[35]":"He wasn’t fired and he is still under contract to OGE.","example[36]":"All cargo-handling services are now put out to contract (=companies compete to win the work).","definition[6]":"an agreement to deliver a type of basic goods or material at a particular price and time in the future","example[37]":"The wheat contract for March delivery rose 8.5 cents a bushel.","definition[7]":"contract builders, electricians etc do work for companies rather than for the general public","definition[8]":"if an economy, industry, or business activity contracts, it gets smaller or less successful","example[38]":"European scheduled air traffic grew 1.1%, but domestic traffic contracted by 1.6%.","definition[9]":"to formally agree to do something, for example by signing a contract","example[39]":"Last month, the shipbuilding industry contracted to export 16 vessels."}