{"word[0]":"implication","definition[0]":"a possible future effect or result of an action, event, decision etc","note[0]":"practical/financial/political etc implications","example[0]":"This election has profound implications for the future of U.S. democracy.","example[1]":"His talk will examine the wider implications of the Internet revolution.","note[1]":"consider/discuss/examine the implications","example[2]":"What are the implications of these proposals?","note[2]":"implication of","definition[1]":"a situation in which it is shown or suggested that someone or something is involved in a crime or a dishonest act","example[3]":"the implication of the former Chief of Staff in a major scandal","note[3]":"the implication of somebody (in something)","definition[2]":"a suggestion that is not made directly but that people are expected to understand or accept","example[4]":"They are called ‘Supertrams’, the implication being that (=which is meant to suggest that) they are more advanced than earlier models.","example[5]":"The law bans organized protests and, by implication, any form of opposition.","note[4]":"by implication","collocation[0]":"important/serious implications","example[6]":"The results of the experiment could have important implications for scientists.","collocation[1]":"major implications","example[7]":"The lack of affordable housing has major implications for families living in rural areas.","collocation[2]":"profound implications","example[8]":"The transformation of Europe has profound implications for the defence industries.","collocation[3]":"far-reaching implications","example[9]":"The cuts in social security benefits had far-reaching implications for ethnic minorities.","collocation[4]":"the wider implications","example[10]":"What are the wider implications of this change in the law?","collocation[5]":"the full implications","example[11]":"The full implications of the decision will become clear over the next few weeks.","collocation[6]":"possible implications","example[12]":"We discussed the possible implications of oil price rises.","collocation[7]":"practical implications","example[13]":"Academic research often has practical implications.","collocation[8]":"financial implications","example[14]":"Managers must be aware of the financial implications of their decisions.","collocation[9]":"political implications","example[15]":"The court’s decision could have far-reaching political implications.","collocation[10]":"legal implications","example[16]":"We have taken advice on the legal implications of our activities.","collocation[11]":"social implications","example[17]":"She’s studying the social implications of different patterns of work.","collocation[12]":"have implications","example[18]":"This is an environmental disaster which will have implications for more than one country.","collocation[13]":"consider the implications","example[19]":"Have you considered the implications of your choice?","collocation[14]":"discuss the implications","example[20]":"The paper discusses the implications of the agreement.","collocation[15]":"study/examine the implications","example[21]":"He has studied the implications of recent technical innovations.","collocation[16]":"realize/grasp the implications","example[22]":"The government has been slow to grasp the implications of the current teacher shortage."}