{"word[0]":"private","signpost[0]":"not for the public","definition[0]":"for use by one person or group, not for everyone","opposite[0]":"public","example[0]":"Morris has a private jet.","example[1]":"He made some notes for his private use.","example[2]":"Many communists objected to any form of private property.","signpost[1]":"not government","definition[1]":"not related to, owned by, or paid for by the government","note[0]":"go private British English (=pay for medical treatment instead of getting it free at a public hospital)","example[3]":"a private hospital","example[4]":"There is private ownership of property in a market economy.","example[5]":"private education","signpost[2]":"for only a few","definition[2]":"a private meeting, conversation etc involves only two people or a small number of people, and is not for other people to know about","example[6]":"I need to have a private discussion with you.","example[7]":"Are you alone? I just wanted a private word.","signpost[3]":"secret","definition[3]":"private feelings, information, or opinions are personal or secret and not for other people to know about","example[8]":"Jack’s private opinion was that she was selfish.","example[9]":"Don’t read that – it’s private.","signpost[4]":"not publicly known","definition[4]":"used about someone who is not known to the public or not working for the government or another organization","example[10]":"a private citizen","example[11]":"The painting was sold to a private collector.","example[12]":"Seven police and three private individuals needed medical attention.","signpost[5]":"not work","definition[5]":"separate from and not related to your work or your official position","example[13]":"The president is paying a private visit to Europe.","example[14]":"He enjoys everything he does in both his professional and his private life.","signpost[6]":"quiet place","definition[6]":"quiet and without a lot of people","example[15]":"Why don’t we go upstairs where it’s more private?","definition[7]":"a private person is one who likes being alone, and does not talk much about their thoughts or feelings","example[16]":"He’s a very private man.","definition[8]":"if something is private, you do not want most people to know about it because it concerns your feelings, your relationships etc","example[17]":"He didn’t want to discuss his private life.","example[18]":"What happens in the bedroom is strictly private.","display[0]":"personal","definition[9]":"relating to your private life – used especially about problems, feelings, and questions","example[19]":"They asked a lot of personal questions.","example[20]":"She talked about her own personal feelings.","example[21]":"I’d rather not talk about it – it’s personal.","example[22]":"The singer has had a lot of problems in her personal life.","definition[10]":"used about feelings and thoughts that you do not tell anyone about","example[23]":"Barclay had a secret desire to become an actor.","example[24]":"His secret fear was that Jenny would leave him.","display[1]":"intimate","definition[11]":"very private – used about things relating to your relationships and sexual feelings","example[25]":"an intimate conversation","example[26]":"Many people share intimate details of their lives on the Internet.","example[27]":"their intimate moments together","display[2]":"innermost","definition[12]":"your innermost feelings, thoughts etc are your most private ones","example[28]":"Counselling often encourages you to reveal your innermost thoughts.","display[3]":"be none of somebody’s business","definition[13]":"if something is none of your business, it is private and you should not ask about it","example[29]":"It’s none of your business how much I earn.","example[30]":"‘Are you married?’ ‘That’s none of your business.’","definition[14]":"a soldier of the lowest rank","definition[15]":"private property, businesses, activities etc are owned or paid for by people and companies, rather than the government","example[31]":"They transferred ownership of thousands of companies from the state to the private sector (=the part of the economy not owned by the government).","example[32]":"Investment bankers say that private money should be used for new municipal projects.","example[33]":"private property","example[34]":"private pensions","definition[16]":"involving something that is sold directly to people or organizations, without being offered openly for anyone to buy","example[35]":"The company has raised $50 million in a private placement arranged by Kemper Financial Services.","example[36]":"Goldman will seek new sources of capital through a private investment offering.","example[37]":"a private sale of 70 million shares, to be offered to investment institutions at A$2.55 each","definition[17]":"not belonging to the government","example[38]":"Slovak officials approved proposals to put 200 companies in private hands.","definition[18]":"belonging to a member of the public rather than to an organization","example[39]":"There are more than 100 million handguns in private hands in the US.","definition[19]":"if a government-owned organization goes or turns private, it is sold to investors","example[40]":"Iberia Airlines will be ready to go private next year.","example[41]":"Poland’s remaining state enterprises have put forward plans to turn private.","definition[20]":"to pay for medical treatment instead of getting it free at a public hospital","definition[21]":"a private company does not make its shares available for anyone to buy on a stockmarket","example[42]":"Cargill, the largest private company in the US, wants to stay that way. Says Mr West, a vice president: ‘We’ll go public  (=sell shares on the stockmarket) the week after snowballs form in hell.’","definition[22]":"if a company with shares on the stockmarket goes private, its owners buy back those shares from existing shareholders so that it becomes privately owned","example[43]":"The majority of companies that went private in the last few years will become public again by reselling stock.","definition[23]":"if a company’s owners take it private, they buy back all shares from existing shareholders","example[44]":"The company’s chairman plans to take the company private through a buy-out of the 74% of shares he doesn’t already own.","definition[24]":"only for use by one particular person or group, not for everyone","example[45]":"a private road","example[46]":"private accommodation","definition[25]":"a private meeting, agreement, conversation etc involves only a small number of people and is kept secret","example[47]":"Mr. Miscio rose to protest, saying ‘This is a private meeting’.","example[48]":"The visit was preceded by a private audience  (=a meeting with someone important) for the chairmen."}