{"word[0]":"tendency","plural[0]":"tendencies","definition[0]":"if someone or something has a tendency to do or become a particular thing, they are likely to do or become it","example[0]":"The drug is effective but has a tendency to cause headaches.","example[1]":"Greg’s tendency to be critical made him unpopular with his co-workers.","note[0]":"a tendency to do something","example[2]":"Some people may inherit a tendency to alcoholism.","note[1]":"tendency to/towards","example[3]":"Researchers believe that the tendency for diabetes is present at birth.","note[2]":"tendency for","definition[1]":"a general change or development in a particular direction","example[4]":"There is an increasing tendency for women to have children later in life.","note[3]":"there is a tendency (for somebody) to do something","example[5]":"a general tendency towards conservation and recycling","example[6]":"a tendency among Americans to get married at a later age","note[4]":"tendency among","definition[2]":"a group within a larger political group that supports ideas that are usually more extreme than those of the main group","example[7]":"the growing fascist tendency","explanation[0]":"In this meaning, tendency is usually followed by a singular verb","example[8]":"The extremist tendency is becoming more powerful","example[9]":"The extremist tendency are becoming more powerful","heading[0]":"– Meanings 1 & 3","collocation[0]":"a natural tendency","example[10]":"His recent experiences had reinforced a strong natural tendency towards caution.","collocation[1]":"an inherent/innate tendency","example[11]":"When attacked, some people have an inherent tendency to fight back.","collocation[2]":"a strong tendency","example[12]":"There is a strong tendency to give dying patients far more drugs than are necessary.","collocation[3]":"a marked tendency","example[13]":"There is a marked tendency for Hollywood marriages to end in divorce.","collocation[4]":"aggressive/violent tendencies","example[14]":"Some breeds of dog have aggressive tendencies.","collocation[5]":"suicidal tendencies","example[15]":"They failed to inform the prison authorities of the man's suicidal tendencies.","collocation[6]":"criminal tendencies","example[16]":"How should we deal with young people who have criminal tendencies?","collocation[7]":"artistic tendencies","example[17]":"As he grew up, he displayed artistic tendencies."}