{"definition[0]":"a quantity of something such as time, money, or a substance","example[0]":"Please pay the full amount (=of money) by the end of the month.","example[1]":"a considerable amount of money","note[0]":"a considerable/large/enormous etc amount","example[2]":"a tiny amount of dirt","note[1]":"a small/tiny etc amount","example[3]":"They spend equal amounts of time in California and New York.","note[2]":"amount of","definition[1]":"used to talk about how much there is of a feeling or quality","example[4]":"Her case has attracted an enormous amount of public sympathy.","note[3]":"a large/considerable etc amount of something","example[5]":"Dina encountered a fair amount of envy among her colleagues.","note[4]":"a certain/fair amount of something","definition[2]":"how much of something there is","example[6]":"Try to reduce the amount of fat in your diet.","example[7]":"a tiny amount of poison","display[0]":"quantity","definition[3]":"a particular amount of food, liquid, or another substance that can be measured – used especially in written descriptions and instructions","example[8]":"Make sure that you add the right quantity of milk.","example[9]":"They buy the wood in large quantities.","display[1]":"volume","definition[4]":"the amount of something such as business activity or traffic, especially when this is large or increasing","example[10]":"The volume of traffic on our roads has risen sharply.","example[11]":"the huge volume of trade with China","display[2]":"level","definition[5]":"the exact amount of something at one time, which can go up or down at other times","example[12]":"They measured the level of alcohol in his blood.","example[13]":"There is a high level of unemployment.","display[3]":"proportion","definition[6]":"the amount of something, compared with the whole amount that exists","example[14]":"the proportion of road accidents caused by drunk drivers","example[15]":"A high proportion of the students were from poor families.","display[4]":"quota","definition[7]":"a maximum amount of something that can be produced, sold, brought into a country etc","example[16]":"import quotas on Japanese cars","display[5]":"yield","definition[8]":"the amount of something that is produced, especially crops","example[17]":"this year’s cotton yield","definition[9]":"a quantity of something","example[18]":"debts that vary in amount","example[19]":"Figures show a big rise in the amount of money in the economy.","example[20]":"You must pay the full amount in advance.","example[21]":"a cheque in settlement of the amount owing"}