{"word[0]":"screen","signpost[0]":"television/computer","definition[0]":"the part of a television or computer where the picture or information appears","example[0]":"a computer with an 18-inch colour screen","example[1]":"He went on staring at the TV screen.","example[2]":"Her picture appeared on the screen.","note[0]":"on (a) screen","example[3]":"It’s easy to change the text on screen before printing it.","definition[1]":"the large white surface that pictures are shown on in a cinema","example[4]":"He was horrified at some of the images he saw on the screen.","definition[2]":"films in general","example[5]":"This is the first time the play has been adapted for the big screen  (=films).","example[6]":"a star of stage and screen  (=the theatre and films)","example[7]":"a well-known screen actor","example[8]":"his first appearance on screen","note[1]":"on screen","signpost[1]":"movable wall","definition[3]":"a piece of furniture like a thin wall that can be moved around and is used to divide one part of a room from another","example[9]":"There was a screen around his bed.","signpost[2]":"something that hides","definition[4]":"something tall and wide that hides a place or thing","example[10]":"The house was hidden behind a screen of bushes.","note[2]":"screen of","definition[5]":"something that hides what someone is doing","example[11]":"The business was just a screen for his drug-dealing activities.","note[3]":"screen for","signpost[3]":"test for illness","definition[6]":"a medical test to see whether someone has an illness","example[12]":"The company is offering a free health screen to all employees.","signpost[4]":"door/window","definition[7]":"a wire net fastened inside a frame in front of a window or door to keep insects out","signpost[5]":"church","definition[8]":"a decorative wall in some churches","definition[9]":"a player in a game such as basketball who protects the player who has the ball","definition[10]":"to do tests on a lot of people to find out whether they have a particular illness","example[13]":"All women over 50 will be regularly screened.","example[14]":"It is now possible to screen babies for diabetes.","note[4]":"screen somebody for something","signpost[6]":"hide something","definition[11]":"if something screens something else, it is in front of it and hides it","example[15]":"A line of trees screened the house from the road.","note[5]":"screen something from something","signpost[7]":"film/television","definition[12]":"to show a film or television programme","example[16]":"The film is being screened around the country.","example[17]":"The match will be screened live on television.","signpost[8]":"test employees etc","definition[13]":"to find out information about people in order to decide whether you can trust them","example[18]":"Police are very careful when screening politicians’ bodyguards.","example[19]":"Applicants are screened for security.","signpost[9]":"check things","definition[14]":"to check things to see whether they are acceptable or suitable","example[20]":"You can use an answerphone to screen your phone calls before you answer them.","definition[15]":"to test people or examine their past history to make sure that they are suitable for something, for example to work for a particular organization","example[21]":"Applicants for teaching posts must be carefully screened.","example[22]":"All employees are screened for drugs.","definition[16]":"to test or check something to make sure that it is suitable, does not break the law etc","example[23]":"Imported fish should be screened for disease.","example[24]":"The ad was screened late at night on Channel 4.","definition[17]":"the flat glass part of a computer or television","example[25]":"The customer’s account details are displayed on the screen.","example[26]":"Of the two flat-screen models, the more expensive one was clearly better.","definition[18]":"on a computer screen"}