{"signpost[0]":"greatest/least allowed","definition[0]":"the greatest or least amount, number, speed etc that is allowed","example[0]":"a 55 mph speed limit","example[1]":"There’s no age limit for applicants.","note[0]":"limit for","example[2]":"My wife and I set a limit on how much we spend on clothes.","note[1]":"limit to/on","example[3]":"Pesticide levels in drinking water are already above legal limits in many areas.","note[2]":"above/over/below a limit","signpost[1]":"greatest amount possible","definition[1]":"the greatest possible amount of something that can exist or be obtained","example[4]":"Our finances are already stretched to the limit (=we do not have any extra money).","example[5]":"There’s no limit to what you can do if you try.","example[6]":"the limits of human knowledge","note[3]":"limit of","example[7]":"He’d reached the limit of his patience.","definition[2]":"the furthest point or edge of a place, often one that must not be passed","example[8]":"He had not been outside the limits of the prison walls for 20 years.","example[9]":"The public is not allowed within a 2-mile limit of the missile site.","example[10]":"Los Angeles city limits","collocation[0]":"set a limit","example[11]":"Set a time limit for the completion of the task.","collocation[1]":"put a limit on something","example[12]":"We have to put a limit on the number of participants.","collocation[2]":"exceed a limit","example[13]":"He reported a driver for exceeding the speed limit.","collocation[3]":"go over a limit","example[14]":"Borrowers who go over the spending limit set by the credit card company are penalised.","form[0]":"ADJECTIVES/NOUN + limit","collocation[4]":"an upper/lower limit","example[15]":"There is no upper limit on the amount you can borrow.","example[16]":"Ensure the temperature in the aquarium does not fall below the lower limit.","collocation[5]":"a strict limit","example[17]":"There are strict limits on spending.","collocation[6]":"a legal limit","example[18]":"The alcohol in his blood was four times more than the legal limit.","collocation[7]":"the speed limit","example[19]":"Too many people go over the speed limit in residential areas.","collocation[8]":"a time limit","example[20]":"The time limit for making a claim is three months.","collocation[9]":"an age limit","example[21]":"The lower age limit for entering the Royal Marines is sixteen.","collocation[10]":"a weight/height limit","example[22]":"The weight limit per bag is 20 kilos.","collocation[11]":"spending limits","example[23]":"There are strict spending limits imposed by law on all candidates.","collocation[12]":"term limits","example[24]":"Should Senators be subject to term limits?","definition[3]":"the highest number, speed, temperature etc that is allowed by a law or rule","example[25]":"He borrowed money up to the limit that the bank allowed.","example[26]":"The speed limit is 65 m.p.h.","example[27]":"There’s no limit on the amount of money that may be brought into the US.","example[28]":"Pollution levels are over the official limit.","example[29]":"Some families set limits on how much they spend on each other’s Christmas present.","display[0]":"restrictions","definition[4]":"rules or laws that strictly control what you are allowed to do","example[30]":"Travel restrictions might reduce the spread of the disease.","example[31]":"Unions are pressing for restrictions on steel imports from Japan.","example[32]":"Because of restrictions on reporting, newspapers were not allowed to cover the story.","example[33]":"New restrictions have been imposed on immigration.","display[1]":"limitations","definition[5]":"limits on what a person or thing is able to do – used especially when you would like to be able to do more","example[34]":"The president was unwilling to accept limitations on his power.","example[35]":"the limitations of the computer system","example[36]":"Hikers should know their physical limitations and not take unnecessary risks.","display[2]":"constraints","definition[6]":"facts or conditions that limit what you can do, for example not having enough time, money etc","example[37]":"Financial constraints are forcing many people in their twenties to live with their parents.","example[38]":"The last part of the show had to be cut because of time constraints.","example[39]":"The constraints of prison life are sometimes too much for people to bear.","display[3]":"maximum","definition[7]":"the largest number or amount that is possible, normal, or allowed","example[40]":"Classes have a maximum of twenty students.","example[41]":"What’s the maximum you can earn before you have to pay tax?","display[4]":"minimum","definition[8]":"the smallest number or amount that is possible or allowed","example[42]":"He was sentenced to a minimum of 25 years in prison.","example[43]":"Our aim is to reduce the number of accidents to an absolute minimum.","display[5]":"ceiling","definition[9]":"the largest number or amount of something that is officially allowed","example[44]":"There is a ceiling on the amount of foreign investment.","example[45]":"Import quotas may rise from the present ceiling of 18.5 million to 20 million.","example[46]":"Congress was once again considering raising the federal debt ceiling.","definition[10]":"to stop an amount or number from increasing beyond a particular point","example[47]":"a decision to limit imports of foreign cars","example[48]":"Seating is limited to 500.","note[4]":"limit something to something","definition[11]":"to stop someone from doing what they want or from developing and improving beyond a particular point","example[49]":"A lack of formal education will limit your job opportunities.","example[50]":"I limit myself to two cups of coffee a day.","note[5]":"limit yourself to something","definition[12]":"the greatest amount, size, number etc that is possible or allowed","example[51]":"The contract specifies various time limits and penalty clauses.","example[52]":"Insurance cover for deep-freeze goods is free of charge up to a limit of £500.","definition[13]":"to stop something going beyond a particular point","example[53]":"The costs of limiting air pollution are difficult to determine.","example[54]":"The law limits political donations to $500 from each voter.","definition[14]":"to reduce the amount, number etc of something a person or organization may have","example[55]":"Subscribers were limited to twenty shares each.","note[6]":"limit somebody/something to something"}