{"word[0]":"anxiety","plural[0]":"anxieties","definition[0]":"the feeling of being very worried about something","synonym[0]":"concern","example[0]":"his feelings of anxiety","example[1]":"A high level of anxiety was created by the introduction of cameras into the factory.","example[2]":"It can help if you discuss your anxieties with someone.","example[3]":"The fear of unemployment can be a source of deep anxiety to people.","note[0]":"deep/acute/great anxiety","example[4]":"There is considerable anxiety among staff about job losses.","note[1]":"anxiety about/over","example[5]":"There is growing public anxiety over levels of air pollution in our cities.","definition[1]":"a feeling of wanting to do something very much","example[6]":"I nearly fell in my anxiety to get downstairs quickly.","note[2]":"anxiety to do something","collocation[0]":"great/considerable anxiety","example[7]":"Then began a day of great anxiety.","collocation[1]":"acute/deep/high anxiety","example[8]":"The patient's panic attacks are caused by acute anxiety.","collocation[2]":"constant anxiety","example[9]":"She lives a life of constant anxiety over money and job security.","collocation[3]":"increasing/mounting anxiety","example[10]":"There is mounting anxiety about the rise in violent crime.","collocation[4]":"public anxiety","example[11]":"the wave of public anxiety about food safety","collocation[5]":"cause/create/lead to anxiety","example[12]":"Their nuclear programme is causing mounting anxiety among other nations, especially Israel.","collocation[6]":"arouse/provoke anxiety","example[13]":"The presence of Indian troops near the border has aroused considerable anxiety in neighbouring Pakistan.","collocation[7]":"feel/suffer from anxiety","example[14]":"The child may feel anxiety about being away from home.","collocation[8]":"reduce/relieve anxiety","example[15]":"The drug helps to reduce anxiety, allowing you to feel relaxed.","collocation[9]":"a source of anxiety","example[16]":"For many people, the primary source of anxiety is work.","collocation[10]":"somebody's  level of anxiety","example[17]":"Patients experience high levels of anxiety at time of admission to hospital.","collocation[11]":"feelings of anxiety","example[18]":"Having an operation naturally entails feelings of anxiety."}