{"word[0]":"compulsory","definition[0]":"something that is compulsory must be done because it is the law or because someone in authority orders you to","example[0]":"the threat of compulsory redundancies","example[1]":"Car insurance is compulsory.","example[2]":"11 years of compulsory education","note[0]":"compulsory schooling/education","definition[1]":"if something is compulsory, you must do it because of a rule or law","example[3]":"Maths and English are compulsory for all students.","example[4]":"Compulsory education was introduced in 1870.","example[5]":"Wearing a seat belt is compulsory.","example[6]":"It is now compulsory for anyone claiming state benefit to register with a job centre.","display[0]":"obligatory","definition[2]":"if something is obligatory, you must do it because of a rule or law. Obligatory is more formal than compulsory","example[7]":"It is now obligatory for all competitors to wear face protectors.","example[8]":"Evening dress is usual, but not obligatory.","example[9]":"Military service is obligatory for all men between 18 and 27.","display[1]":"mandatory","definition[3]":"if something is mandatory, you must do it because it is the law. Mandatory is more formal than compulsory and sounds stronger","example[10]":"Drug smuggling carries a mandatory death sentence.","example[11]":"In some countries, wearing helmets is mandatory for all cyclists.","heading[0]":"not compulsory","display[2]":"optional","definition[4]":"if something is optional, you can choose whether to do it or not","example[12]":"You don’t have to do French – it’s optional.","example[13]":"The holiday price includes optional excursions such as an evening cruise on the lake.","example[14]":"General Studies is optional for sixth-form students.","display[3]":"voluntary","definition[5]":"done because you want to do it and not because you have to – used especially about things that you do because you think they will help other people or be useful","example[15]":"The programme is entirely voluntary, and no one will be forced to join.","example[16]":"The charity is funded by voluntary donations.","definition[6]":"something that is compulsory must be done according to a law or rule","example[17]":"The company has introduced compulsory overtime for all its workers."}