{"word[0]":"network","definition[0]":"a system of lines, tubes, wires, roads etc that cross each other and are connected to each other","example[0]":"Hungary’s telephone network","example[1]":"a high-speed European rail network","example[2]":"an elaborate network of canals","note[0]":"network of","example[3]":"the network of blood vessels in the body","definition[1]":"a group of radio or television stations, which broadcast many of the same programmes, but in different parts of the same country","example[4]":"the four biggest TV networks","example[5]":"You’re listening to the American Armed Forces Network.","definition[2]":"a set of computers that are connected to each other so that they can share information","definition[3]":"a group of people, organizations etc that are connected or that work together","example[6]":"It’s important to build up a network of professional contacts.","definition[4]":"to connect several computers together so that they can share information","definition[5]":"to meet and talk with people who have similar jobs to yours, especially because they may be useful for your work","definition[6]":"to broadcast a radio or television programme on several different channels at the same time","definition[7]":"a group of people or organizations that are connected or that work together","example[7]":"The gadget is available from the manufacturer and its network of stockists.","definition[8]":"a set of computers which are connected to each other and operate as part of the same system, able to exchange information and messages","example[8]":"network software","example[9]":"The vendor automatically orders new deliveries from the retailer through its computer network.","definition[9]":"a group of radio or television stations that broadcast many of the same programmes, but at different times in different places","example[10]":"the Fox Television Network","definition[10]":"the system of roads, railways, or communication systems such as telephones used in a country","example[11]":"a cellular phone network","example[12]":"Britain’s network of motorways","definition[11]":"to make use of meetings with people involved in the same kind of work, in order to share information, help each other etc","example[13]":"He spent a couple of evenings a month networking at business functions.","definition[12]":"to connect several computers together so that they operate as part of the same system, able to exchange information and messages","example[14]":"This software will allow us to network our computers."}