{"comparative[0]":"smoother","superlative[0]":"smoothest","signpost[0]":"surface","definition[0]":"a smooth surface has no rough parts, lumps, or holes, especially in a way that is pleasant and attractive to touch","example[0]":"Her skin felt smooth and cool.","example[1]":"a smooth pebble","example[2]":"The stone steps had been worn smooth.","signpost[1]":"happening without problems","definition[1]":"happening or operating successfully, without any problems","example[3]":"The new government has promised a smooth transition of power.","example[4]":"Sarah is responsible for the smooth running of the sales department.","note[0]":"smooth running/operation","definition[2]":"with no sudden movements or changes of direction, especially in a way that is graceful or comfortable","example[5]":"Swing the tennis racket in one smooth motion.","example[6]":"The jet made a smooth landing.","example[7]":"It wasn’t a very smooth ride.","note[1]":"smooth flight/ride","definition[3]":"someone who is smooth is polite, confident, and relaxed, but is often not sincere","example[8]":"a smooth salesman","example[9]":"He was a smooth talker.","example[10]":"George is a smooth operator (=someone who does things in a smooth way).","signpost[2]":"liquid mixture","definition[4]":"a liquid mixture that is smooth has no big pieces in it","opposite[0]":"lumpy","example[11]":"Beat the eggs and flour until they are smooth.","definition[5]":"a voice or music that is smooth is soft and pleasant to listen to","example[12]":"smooth jazz","example[13]":"He has one of those silky smooth (=very smooth) voices.","definition[6]":"a drink such as wine, coffee, whisky, or beer that is smooth is not bitter but tastes pleasant","example[14]":"a smooth full-bodied wine","definition[7]":"to make something such as cloth or hair flat by moving your hands across it","example[15]":"Liz smoothed her skirt and sat down.","example[16]":"She smoothed back her hair.","note[2]":"smooth something back/down","definition[8]":"to make a rough surface flat and even","example[17]":"The wood was smoothed and trimmed to size.","example[18]":"Smooth down all the surfaces before you start painting.","definition[9]":"to rub a liquid, cream etc gently over a surface or into a surface","example[19]":"She smoothed suntan lotion over her legs.","note[3]":"smooth something into/over something"}