{"word[0]":"gather","signpost[0]":"come together","definition[0]":"to come together and form a group, or to make people do this","example[0]":"A crowd gathered to watch the fight.","example[1]":"Thousands of people gathered outside the embassy.","example[2]":"Gather round, everyone, so that you can see the screen.","note[0]":"gather around/round","example[3]":"During the air raids, we gathered the children around us and sang songs.","example[4]":"Could the bride’s family all gather together for a photo?","note[1]":"gather together","example[5]":"Dozens of photographers were gathered outside Jagger’s villa.","note[2]":"be gathered","type[0]":"intransitive, transitive not in progressive","signpost[1]":"know/think","definition[1]":"to believe that something is true because of what you have seen or heard","example[6]":"You two know each other, I gather.","example[7]":"She’s his niece, from what I can gather.","note[3]":"from what I can gather/as far as I can gather","example[8]":"I gather you’ve had some problems with our sales department.","note[4]":"gather (that)","signpost[2]":"collect","definition[2]":"to get things from different places and put them together in one place","example[9]":"The researcher’s job is to gather information about people.","example[10]":"They had gathered 440,000 signatures to support their demand.","example[11]":"Debbie gathered up the clothes.","note[5]":"gather up/together","definition[3]":"to pull material into small folds","example[12]":"The skirt is gathered at the waist.","definition[4]":"to pull material or a piece of clothing closer to you","example[13]":"Moira gathered her skirts round her and climbed the steps.","signpost[3]":"clouds/darkness","definition[5]":"to gradually become more cloudy or get darker","example[14]":"Storm clouds were gathering so we hurried home.","example[15]":"the evening’s gathering shadows","note[6]":"the gathering darkness/dusk/shadows etc","definition[6]":"a small fold produced by pulling cloth together"}