{"word[0]":"deficit","definition[0]":"the difference between the amount of something that you have and the higher amount that you need","example[0]":"the country’s widening budget deficit","example[1]":"the US’s foreign trade deficit","example[2]":"a deficit of £2.5 million","note[0]":"deficit of","example[3]":"Many countries have a big deficit in food supply.","note[1]":"deficit in","example[4]":"The US balance of payments was in deficit.","note[2]":"in deficit","form[0]":"ADJECTIVES/NOUN + deficit","collocation[0]":"huge/massive","example[5]":"The recession left the Government with a massive deficit.","collocation[1]":"a growing deficit","example[6]":"Congress must slash federal spending to curb a growing deficit.","collocation[2]":"a budget deficit","example[7]":"Last year there was a budget deficit of US $70,000,000.","collocation[3]":"a trade deficit","example[8]":"Last year the country had its largest trade deficit in recent history.","collocation[4]":"have a deficit","example[9]":"We had a trade deficit of more than $4 billion.","collocation[5]":"show a deficit","example[10]":"Friday's trade figures showed a £10 billion deficit.","collocation[6]":"face a deficit","example[11]":"The party is facing a deficit of £1.3million for this year, so it must find ways of cutting its costs.","collocation[7]":"reduce/cut a deficit","example[12]":"We must drastically cut our budget deficit to sustain economic growth.","collocation[8]":"eliminate a deficit","example[13]":"His proposals have so far failed to eliminate the deficit.","definition[1]":"an amount of money that a business has lost in a particular period of time","example[14]":"Last year the university ran up a deficit of £17 million, but this year it has nearly succeeded in balancing the books.","definition[2]":"an amount by which the money that a government spends is more than it receives in tax in a particular period","example[15]":"The budget did less to reduce public spending and the deficit than many bankers and businessmen would have liked.","example[16]":"The balance of payments was in deficit in 2000 and 2001, and in surplus in 2002 and 2003."}