{"word[0]":"strike","past_tense[0]":"struck","definition[0]":"to hit or fall against the surface of something","example[0]":"She fell heavily, striking her head against the side of the boat.","example[1]":"A snowball struck him on the back of the head.","example[2]":"Several cars were struck by falling trees.","example[3]":"The last rays of the setting sun struck the windows.","explanation[0]":"In everyday English, people usually say hit rather than strike:","example[4]":"I hit my head on the shelf.","example[5]":"He was hit by a rock.","signpost[0]":"hit with hand/weapon etc","definition[1]":"to deliberately hit someone or something with your hand or a weapon","example[6]":"She struck him hard across the face.","example[7]":"Paul struck him a blow to the head.","example[8]":"The assassin’s bullet struck home (=hit exactly where it should).","example[9]":"The victim had been struck with some kind of wooden implement.","note[0]":"strike something with something","signpost[1]":"thought/idea","definition[2]":"if something strikes you, you think of it, notice it, or realize that it is important, interesting, true etc","example[10]":"A rather worrying thought struck me.","example[11]":"The first thing that struck me was the fact that there were no other women present.","example[12]":"It struck her that losing the company might be the least of her worries.","note[1]":"it strikes somebody (that)","example[13]":"You can’t help being struck by her kindness.","note[2]":"be struck by something","explanation[1]":"Strike is not used in the progressive in this meaning You say","example[14]":"It strikes me that they are similar","bad_example[0]":"It is striking me that they are similar","signpost[2]":"stop work","definition[3]":"if a group of workers strike, they stop working as a protest against something relating to their work, for example how much they are paid, bad working conditions etc","example[15]":"In many countries, the police are forbidden to strike.","example[16]":"They’re striking for the right to have their trade union recognized in law.","note[3]":"strike for","definition[4]":"to attack someone, especially suddenly","example[17]":"The killer might strike again.","example[18]":"Guerrillas struck a UN camp, killing 75.","example[19]":"Opponents of the war say that civilian villages have been struck several times.","signpost[3]":"harm","definition[5]":"to damage or harm someone or something","example[20]":"Such prejudices strike right at the heart of any notions of a civilized society.","example[21]":"The scandal seemed to have struck a mortal blow to the government’s chances of re-election.","note[4]":"strike a blow at/against/to something","example[22]":"The law would strike at the most basic of civil rights.","note[5]":"strike at","signpost[4]":"something bad happens","definition[6]":"if something bad strikes, it suddenly happens or suddenly begins to affect someone","example[23]":"The plague struck again for the third time that century.","example[24]":"Everything seemed to be going fine when suddenly disaster struck.","signpost[5]":"lightning","definition[7]":"if lightning strikes something, it hits and damages it","example[25]":"The temple burned down after it was struck by lightning last year.","signpost[6]":"clock","definition[8]":"if a clock strikes one, two, six etc, its bell makes a sound once, twice, six etc times according to what time it is","note[6]":"strike the hour (=strike when it is exactly one o'clock, two o'clock etc)","example[26]":"The church clock began to strike twelve.","signpost[7]":"gain advantage","definition[9]":"to do something that gives you an advantage over your opponent in a fight, competition etc","example[27]":"Brazil struck first with a goal in the third minute.","signpost[8]":"not working","definition[10]":"a period of time when a group of workers deliberately stop working because of a disagreement about pay, working conditions etc","example[28]":"The government has promised that the army will be called in to help if there is a firemen’s strike.","example[29]":"a six-week strike by railway workers","note[7]":"strike by","example[30]":"a strike over pay cuts","note[8]":"strike over","example[31]":"a national strike against mine closures","note[9]":"strike against","definition[11]":"a military attack, especially by planes dropping bombs","example[32]":"American aircraft carriers have launched several strikes.","example[33]":"a surprise air strike on military targets","note[10]":"strike against/on","signpost[9]":"discovery","definition[12]":"the discovery of something valuable under the ground","example[34]":"an oil strike","signpost[10]":"baseball","definition[13]":"an attempt to hit the ball in baseball that fails, or a ball that is thrown to the batter in the correct area but is not hit","signpost[11]":"bowling","definition[14]":"a situation in bowling in which you knock down all the pins (=bottle-shaped objects) with a ball on your first attempt","collocation[0]":"be (out) on strike","example[35]":"Teachers are on strike again this week.","collocation[1]":"go on strike/come out on strike","example[36]":"An estimated 70,000 public sector workers went on strike.","collocation[2]":"begin a strike","example[37]":"Dock workers began a 24-hour strike last night.","collocation[3]":"call a strike","example[38]":"The union threatened to call a strike.","collocation[4]":"stage a strike","example[39]":"Health workers will stage a two-day strike next week.","collocation[5]":"end/call off a strike","example[40]":"The strike was called off two days later.","collocation[6]":"break a strike","example[41]":"Attempts to break the strike failed.","form[0]":"ADJECTIVES/NOUN + strike","collocation[7]":"a one-day/two-week etc strike","example[42]":"A three-day strike is planned for next week.","collocation[8]":"an indefinite strike","example[43]":"Workers at the processing plant have begun an indefinite strike.","collocation[9]":"a long strike","example[44]":"Most teachers wouldn’t be in favour of a long strike.","collocation[10]":"a general strike","example[45]":"They threatened to call a general strike.","collocation[11]":"a national/nationwide strike","example[46]":"In April 1984 the National Union of Mineworkers called a national strike.","collocation[12]":"an all-out strike","example[47]":"The dockers voted for an all-out strike.","collocation[13]":"a rail/coal/postal etc strike","example[48]":"A rail strike would cause enormous public inconvenience.","collocation[14]":"a miners’/teachers’/pilots’ etc strike","example[49]":"The transport workers’ strike inflicted serious damage on the economy.","collocation[15]":"an unofficial strike","example[50]":"Some workers had been sacked for taking part in unofficial strikes.","collocation[16]":"a wildcat strike","example[51]":"Legislation to curb wildcat strikes will be introduced during the coming parliamentary session.","example[52]":"The company faces an all-out strike next month.","collocation[17]":"a bitter strike","example[53]":"The miners finally returned to work at the end of a long, bitter strike.","collocation[18]":"a damaging/crippling strike","example[54]":"The company now faces the prospect of a crippling strike.","form[1]":"strike + NOUN","collocation[19]":"strike action","example[55]":"Hospital workers have voted in favour of strike action.","collocation[20]":"a strike call","example[56]":"The ANC estimated that more than 4,000,000 people heeded its strike call.","collocation[21]":"a strike ballot","example[57]":"The union is going to hold a strike ballot.","definition[15]":"a period of time when a group of workers stop working because of a disagreement about pay, working conditions etc","example[58]":"A teachers’ strike has been announced for next week.","example[59]":"The rail strike has resulted in major delays on roads across the country.","display[0]":"industrial action","definition[16]":"activities such as strikes, or doing less work than usual, as a way of trying to persuade an employer to improve pay, conditions etc","example[60]":"Lecturers voted to take industrial action over their workload.","example[61]":"Prison officers have threatened industrial action.","display[1]":"stoppage","definition[17]":"a short strike, especially one that lasts for one day","example[62]":"Customs officers will return to work today after a twenty-four hour stoppage.","display[2]":"go-slow","definition[18]":"a period of time when a group of workers deliberately work more slowly than usual as a way of protesting about pay, conditions etc","example[63]":"The hospital go-slow comes into effect tomorrow.","example[64]":"The union carried out strikes and go-slows in support of a wage claim.","definition[19]":"a period of time during which a group of workers deliberately stop working because of a disagreement about pay, working conditions etc (strike2)","example[65]":"a one-day postal strike","example[66]":"Female staff have gone on strike for equal pay.","example[67]":"Staff held a two-hour strike.","example[68]":"Lorry drivers have been on strike for three weeks.","definition[20]":"to deliberately stop working for a time because of a disagreement about pay, working conditions etc","example[69]":"In many countries, police officers are forbidden to strike.","example[70]":"Dock workers are striking for more pay.","definition[21]":"to make an agreement with someone","example[71]":"The US and China have recently struck a deal over trade.","example[72]":"He was trying to strike a deal with an American corporation to build a hotel in the mountains.","definition[22]":"to suddenly find gold, oil etc, especially after you have been looking for it for some time"}