{"word[0]":"odds","signpost[0]":"difficulties","definition[0]":"difficulties which make a good result seem very unlikely","example[0]":"The hospital’s director has been battling against the odds to improve patient care.","example[1]":"The soldiers’ job was to hold on despite impossible odds.","signpost[1]":"horse racing etc","definition[1]":"the numbers that show how much money you will win if you bet on the winner of a horse race or other competition","example[2]":"The odds are 6–1.","example[3]":"Everyone was surprised when Desert Zone won the race, at very long odds.","note[0]":"(at) long/short odds","example[4]":"They are laying odds of 8–1 that the Conservatives will win the next election.","note[1]":"lay/offer (somebody) odds","example[5]":"At odds of 10–1 he bet a hundred pounds.","note[2]":"odds of","heading[0]":"– Meaning 2: difficulties which make a good result seem very unlikely","collocation[0]":"enormous/considerable/incredible odds","example[6]":"He survived a night in the cold water against incredible odds.","collocation[1]":"great odds","example[7]":"We must hope that, despite great odds, we can achieve a peaceful settlement.","collocation[2]":"impossible/overwhelming odds","example[8]":"They face impossible odds simply trying to get an education.","example[9]":"They face overwhelming odds in their struggle to preserve the park.","collocation[3]":"beat/overcome/defy the odds","example[10]":"The baby, born sixteen weeks too early, defied the odds and is celebrating her first birthday.","collocation[4]":"battle/struggle against the odds","example[11]":"The Coastguard was battling against the odds to keep the oil spill from reaching the shore.","collocation[5]":"against all odds","example[12]":"Against all odds, he recovered from his illness.","collocation[6]":"the odds are stacked against somebody","example[13]":"They may be able to build a life for themselves, but the odds are stacked against them.","definition[2]":"how likely it is that something will happen","example[14]":"The odds of us achieving our sales targets are very poor.","example[15]":"The odds are  (=it is likely that) selling will continue.","definition[3]":"difficulties that make a good result seem very unlikely","example[16]":"The small company overcame enormous odds to become a success.","example[17]":"Successful entrepreneurs have a will to succeed against all odds (=even when there are great difficulties).","definition[4]":"if two people or groups are at odds, they disagree about something or they often disagree about things","example[18]":"The head cook and head porter are constantly at odds.","definition[5]":"if two statements, descriptions, actions etc are at odds with each other, they are different although they should be the same","example[19]":"Sometimes trade union negotiators set targets which are at odds with the targets set by management.","definition[6]":"to pay or charge a higher price than is usual or reasonable","example[20]":"Are supermarket customers paying over the odds for fruit and vegetables?"}