{"word[0]":"common","signpost[0]":"happening often","definition[0]":"happening often and to many people or in many places","example[0]":"Heart disease is one of the commonest causes of death.","example[1]":"It is common for children to be afraid (NOT It is common that children are afraid) of the dark.","example[2]":"Bad dreams are fairly common among children.","note[0]":"common among","example[3]":"It’s common for new fathers to feel jealous of the baby.","note[1]":"it’s common for somebody to do something","signpost[1]":"a lot","definition[1]":"existing in large numbers","example[4]":"Daisies are very common flowers.","type[0]":"usually before noun, no comparative","signpost[2]":"same/similar","definition[2]":"common aims, beliefs, ideas etc are shared by several people or groups","example[5]":"people working towards a common goal","example[6]":"countries that share a common language","example[7]":"a theme that is common to all her novels","note[2]":"common to","type[1]":"no comparative","signpost[3]":"shared by everyone","definition[3]":"belonging to or shared by everyone in a society","example[8]":"Joe was chosen as captain by common consent (=with everyone’s agreement).","example[9]":"These problems are common to all societies.","type[2]":"only before noun, no comparative","definition[4]":"ordinary and not special in any way","example[10]":"common salt","example[11]":"The 20th century was called the century of the common man (=ordinary people).","example[12]":"He insists that he is a revolutionary, not a common criminal.","signpost[4]":"social class","definition[5]":"an offensive word used for describing someone from a low social class","definition[6]":"if something is common, there are a lot of them","example[13]":"Jones is a very common name in Great Britain.","example[14]":"Foxes are common in the area.","example[15]":"Personal computers are nearly as common in American homes as televisions.","display[0]":"widespread","definition[7]":"happening in a lot of places or done by a lot of people","example[16]":"Racism is much more widespread than people imagine.","example[17]":"The report claimed that the problem of police brutality was widespread.","example[18]":"the widespread availability of antibiotics","display[1]":"commonplace","definition[8]":"common in a particular place or time – used especially when saying that this seems surprising or unusual","example[19]":"Crimes such as robbery are commonplace in big cities.","example[20]":"Expensive foreign cars are commonplace in this Chicago suburb.","display[2]":"prevalent","definition[9]":"common in a place or among a group of people – used especially about illnesses, problems, or ideas","example[21]":"Flu is most prevalent during the winter months.","example[22]":"Depression remains one of the most prevalent health disorders in the US.","example[23]":"This belief is more prevalent among men than women.","display[3]":"rife","definition[10]":"very common – used about illnesses or problems","example[24]":"AIDS is rife in some parts of the world.","display[4]":"ubiquitous","definition[11]":"very common and seen in many different places – often used humorously in written descriptions","example[25]":"He was carrying the ubiquitous MP3 player.","example[26]":"In Britain, CCTV cameras are ubiquitous.","display[5]":"something is everywhere","definition[12]":"used when saying that you can see something a lot in many different places","example[27]":"Images of the dictator were everywhere.","example[28]":"Microchips seem to be everywhere these days – even in washing machines.","example[29]":"One of the first things you notice in Amsterdam are the bicycles – they’re everywhere.","definition[13]":"a large area of open land in a town or village that people walk or play sport on","example[30]":"Boston Common"}