{"word[0]":"improvement","definition[0]":"the act of improving something, or the state of being improved","example[0]":"Our results have shown some improvement this month.","example[1]":"There’s been a big improvement in the children’s behaviour.","note[0]":"improvement in/on/to","example[2]":"an improvement on earlier models","example[3]":"We need to carry out some improvements to the system.","definition[1]":"a change or addition that improves something","example[4]":"Are you making some improvements to your home?","collocation[0]":"be an improvement (on something)","example[5]":"This version of the software is a clear improvement on its predecessor.","collocation[1]":"see/notice an improvement","example[6]":"After taking the tablets, he noticed some improvement in his energy levels.","collocation[2]":"show an improvement","example[7]":"The sales figures show a major improvement.","collocation[3]":"represent an improvement","example[8]":"A pre-tax profit of 4.3 million pounds represents a 5% improvement on last year.","collocation[4]":"a big improvement","example[9]":"The situation today is a big improvement on the 1980s.","collocation[5]":"a great/vast/major improvement","example[10]":"The new computer system was a vast improvement.","collocation[6]":"a dramatic improvement","example[11]":"With the new treatment we saw a dramatic improvement in his condition.","collocation[7]":"a significant/substantial/considerable improvement","example[12]":"There has been a considerable improvement in trading conditions.","collocation[8]":"a marked/noticeable improvement","example[13]":"Joanna's work showed a marked improvement.","collocation[9]":"a slight improvement","example[14]":"Sales figures have shown a slight improvement this month.","collocation[10]":"a gradual improvement","example[15]":"There has been a gradual improvement in educational standards.","collocation[11]":"a general improvement","example[16]":"There has been a general improvement in the standard of living.","collocation[12]":"a continuous/steady improvement","example[17]":"The following two seasons saw a steady improvement in the team's performance.","collocation[13]":"further improvement","example[18]":"We feel there is room for further improvement.","collocation[14]":"signs of improvement","example[19]":"The patient is showing signs of improvement.","collocation[15]":"room for improvement","example[20]":"There's room for improvement in the way the tickets are sold.","definition[2]":"the act or state of getting better","example[21]":"Canandaigua Wine Co reported a 70% improvement in net income for the third quarter.","note[1]":"improvement in","example[22]":"An economist said he was optimistic that September sales will show an improvement."}