{"definition[0]":"to get better after an illness, accident, shock etc","example[0]":"After a few days of fever, she began to recover.","example[1]":"He’s in hospital, recovering from a heart attack.","note[0]":"recover from","explanation[0]":"Recover is never transitive in this meaning You say","example[2]":"I’ve recovered from my cold","bad_example[0]":"I’ve recovered my cold","definition[1]":"to return to a normal condition after a period of trouble or difficulty","example[3]":"The tourist industry is recovering to pre-war levels.","example[4]":"Yesterday morning shares seemed to recover from Monday’s collapse.","definition[2]":"to get back something that was taken from you, lost, or almost destroyed","example[5]":"Four paintings stolen from the gallery have been recovered.","example[6]":"Two bodies were recovered from the wreckage.","note[1]":"recover something from something","definition[3]":"to get back an amount of money that you have spent or lost","synonym[0]":"recoup","example[7]":"He was entitled to recover damages from the defendants.","definition[4]":"to get back an ability, a sense, or control over your feelings, movements etc after a period without it","synonym[1]":"regain","example[8]":"It was some hours before she recovered consciousness.","example[9]":"Once she stumbled, but somehow she recovered her balance and carried on running.","example[10]":"He recovered himself enough to speak calmly.","note[2]":"recover yourself","definition[5]":"to become healthy again after you have been seriously ill or injured, or had a bad experience","example[11]":"My mother’s been very ill, and she’s still in hospital recovering.","example[12]":"She needed time to recover from the shock.","display[0]":"get better","definition[6]":"to recover from an injury or illness. In everyday English, people usually say get better rather than recover","example[13]":"I hope you get better soon.","example[14]":"My back’s been quite bad recently, but it’s getting better slowly.","display[1]":"get over something","definition[7]":"to recover from a bad experience, or a minor illness. In everyday English, people usually say get over rather than recover","example[15]":"She never got over his death.","example[16]":"I’m getting over my cold.","display[2]":"get well","definition[8]":"to recover from an illness or operation – used especially when you are writing to encourage someone to recover","example[17]":"Get well soon – we all miss you!","example[18]":"I hope you get well quickly.","display[3]":"be back on your feet","definition[9]":"to have recovered and be able to live life as usual again","example[19]":"It may take a week or two until you’re back on your feet.","example[20]":"It’s great to see you back on your feet!","display[4]":"be on the mend","definition[10]":"to be showing definite signs of recovering after an illness or injury","example[21]":"I’m glad to see you’re on the mend again.","example[22]":"Kathy’s been quite ill with flu, but she seems to be on the mend now.","display[5]":"recuperate","definition[11]":"to spend time resting and getting your health or energy back, after you have had an illness or had a difficult or tiring experience","example[23]":"It had been a hard year, and I needed a few weeks in the sun in order to recuperate.","example[24]":"He is recuperating from a heart attack.","display[6]":"convalesce","definition[12]":"to spend a long period of time recovering from a serious illness, especially by resting in a comfortable or warm place","example[25]":"She was at home convalescing after major surgery.","definition[13]":"to increase or improve after falling in value or getting worse","example[26]":"Its shares plunged at the start of trading, but recovered to close only slightly down.","definition[14]":"to get back money that you have spent or lost","example[27]":"The firm sued Mr Yasutomi and has recovered about one-third of its loss.","definition[15]":"to get back something that was stolen, lost, or almost destroyed","example[28]":"The FBI recovered over 100 stolen items from his apartment.","definition[16]":"to be paid money by order of a court of law","example[29]":"To recover damages against a teacher, a student must be able to show that it was the teacher’s negligence that caused the injury.","definition[17]":"if someone recovers oil, gold etc, they take it from under the ground or sea","example[30]":"They plan to recover 35 million barrels of oil from the two fields over six years."}