{"word[0]":"gear","signpost[0]":"in cars etc","definition[0]":"the machinery in a vehicle such as a car, truck, or bicycle that you use to go comfortably at different speeds","example[0]":"His mountain bike had 18 gears.","example[1]":"Andy drove cautiously along in third gear.","example[2]":"Does this thing have a reverse gear?","example[3]":"Any cyclist can climb a difficult hill; you just change gear.","example[4]":"Don’t turn off the engine while you’re still in gear.","example[5]":"It’s a good habit to take the car out of gear while you’re at a stoplight.","definition[1]":"used to talk about the amount of effort and energy that someone is using in a situation","example[6]":"During this period, Japan’s export industries were in top gear (=were as active as they could be).","example[7]":"The Republican’s propaganda machine moved into high gear.","example[8]":"United stepped up a gear in the second half.","note[0]":"step up a gear","signpost[1]":"equipment","definition[2]":"a set of equipment or tools you need for a particular activity","example[9]":"He’s crazy about photography – he’s got all the gear.","example[10]":"We’ll need some camping gear.","definition[3]":"a set of clothes that you wear for a particular occasion or activity","example[11]":"Bring your rain gear.","example[12]":"police in riot gear","signpost[2]":"machinery","definition[4]":"a piece of machinery that performs a particular job","example[13]":"the landing gear of a plane","example[14]":"heavy lifting gear","definition[5]":"a word meaning illegal drugs, used by people who take drugs","collocation[0]":"first/second/third etc gear","example[15]":"The heavy traffic meant that we seldom got out of second gear.","collocation[1]":"a low gear","example[16]":"You should use a low gear when going up a hill.","collocation[2]":"a high gear","example[17]":"Put the car into a higher gear.","collocation[3]":"top gear","example[18]":"Hamilton slipped effortlessly into top gear.","collocation[4]":"bottom gear","example[19]":"The car trundled slowly forward in bottom gear.","collocation[5]":"reverse gear","example[20]":"He put the truck into reverse gear.","collocation[6]":"change gear","example[21]":"It takes some time to learn when to change gear.","collocation[7]":"put the car etc into (first/second/third etc) gear","example[22]":"He put the car into gear, and they moved slowly forwards.","collocation[8]":"engage first/second etc gear","example[23]":"Nick struggled to engage first gear.","collocation[9]":"be in the wrong gear","example[24]":"The straining noises from the engine told him that he was in the wrong gear.","collocation[10]":"crunch/grind the gears","example[25]":"He crunched the gears into reverse.","definition[6]":"special equipment or clothing used for a particular purpose","example[26]":"We manufacture airplane landing gear and other aerospace parts.","example[27]":"Police in riot gear (=special clothing that protects them if they are attacked) stopped demonstrators getting anywhere near the G8 conference.","definition[7]":"if an activity moves into high gear, it becomes much more important, and people put more effort into making it succeed","example[28]":"The alliance with Mattel is part of Disney’s strategy to keep its merchandising efforts in top gear.","definition[8]":"if a financial or industrial activity is in low gear, it is not growing, or it is not at a high level","example[29]":"The country’s economy has been stuck in low gear since 1992.","example[30]":"Wall Street shifted into low gear (=started working more slowly than usual) ahead of the Memorial Day weekend.","definition[9]":"to be designed or organized in a way that is suitable for a particular purpose","example[31]":"Fiji’s policies are geared towards reducing reliance on sugar exports and tourism.","example[32]":"Honda’s latest advertisements are geared at consumers who normally prefer buying American trucks and cars.","definition[10]":"to be connected to something, so that if one thing changes, so does the other","example[33]":"They were borrowing large sums that weregeared to interest rates that might rise.","example[34]":"The minimum notice period is geared to the length of time you have been employed."}