{"word[0]":"scrutiny","definition[0]":"careful and thorough examination of someone or something","example[0]":"Their activities have come under police scrutiny.","example[1]":"Careful scrutiny of the company’s accounts revealed a whole series of errors.","note[0]":"careful/close scrutiny","collocation[0]":"come under scrutiny","example[2]":"The cost and efficiency of the health care system has come under increasing scrutiny.","collocation[1]":"be subjected to scrutiny","example[3]":"Each proposal was subjected to careful scrutiny.","collocation[2]":"be the subject of scrutiny","example[4]":"The way in which the courts handle such claims has been the subject of close scrutiny.","collocation[3]":"be subject to scrutiny","example[5]":"All the accounts are subject to scrutiny by auditors.","collocation[4]":"be open to scrutiny","example[6]":"Government actions should be more open to public scrutiny.","collocation[5]":"not stand up to scrutiny/not bear scrutiny","example[7]":"Such arguments do not stand up to careful scrutiny.","collocation[6]":"careful scrutiny","example[8]":"These figures need careful scrutiny.","collocation[7]":"close/intense scrutiny","example[9]":"Both these areas of law have come under close scrutiny by the courts.","collocation[8]":"rigorous/strict scrutiny","example[10]":"This system has been subject to rigorous scrutiny.","collocation[9]":"detailed scrutiny","example[11]":"MPs on these committees subject Government bills to detailed scrutiny.","collocation[10]":"critical scrutiny","example[12]":"Their work is in the public domain and open to critical scrutiny.","collocation[11]":"public scrutiny","example[13]":"Much of the work that we do is open to public scrutiny.","collocation[12]":"media scrutiny","example[14]":"How does he cope with the intense media scrutiny?","collocation[13]":"parliamentary scrutiny","example[15]":"The Labour Party expressed concern about the lack of parliamentary scrutiny of MI5.","collocation[14]":"judicial scrutiny","example[16]":"The new legislation will be the subject of close judicial scrutiny."}