{"word[0]":"lecture","definition[0]":"a long talk on a particular subject that someone gives to a group of people, especially to students in a university","example[0]":"He regularly gives lectures on modern French literature.","note[0]":"lecture on","definition[1]":"an act of criticizing someone or warning them about something in a long serious talk, in a way that they think is unfair or unnecessary","example[1]":"My father caught me and gave me a long lecture about the dangers of drink.","note[1]":"lecture on/about","collocation[0]":"give a lecture","example[2]":"She gave a fascinating lecture on crime in the 1800s.","example[3]":"He delivered the lecture at the London School of Economics.","collocation[1]":"do a lecture","example[4]":"He’s doing a lecture on modern poetry.","collocation[2]":"go to a lecture","example[5]":"Have you been to any of Professor MacPherson’s lectures?","example[6]":"I recently attended a lecture by a noted historian.","collocation[3]":"listen to a lecture","example[7]":"Most students spend about a quarter of their time listening to lectures.","form[0]":"lecture + NOUN","collocation[4]":"a lecture hall/room","example[8]":"The lecture hall was packed.","collocation[5]":"lecture notes","example[9]":"Can I borrow your lecture notes?","collocation[6]":"a lecture tour","example[10]":"He’s on a lecture tour of the US.","collocation[7]":"a series of lectures","example[11]":"a series of lectures on the history of art","collocation[8]":"a public lecture","example[12]":"He’s going to deliver a public lecture on politics in the Middle East.","collocation[9]":"an illustrated lecture","example[13]":"Mrs Robinson gave a fascinating illustrated lecture on Spanish history.","definition[2]":"to talk angrily or seriously to someone in order to criticize or warn them, in a way that they think is unfair or unnecessary","example[14]":"I wish you’d stop lecturing me!","example[15]":"He began to lecture us about making too much noise.","note[2]":"lecture somebody about/on something","definition[3]":"to talk to a group of people on a particular subject, especially to students in a university","example[16]":"He lectures on European art at Manchester University."}