{"word[0]":"tease","signpost[0]":"laugh","definition[0]":"to laugh at someone and make jokes in order to have fun by embarrassing them, either in a friendly way or in an unkind way","example[0]":"Don’t get upset. I was only teasing.","example[1]":"He used to tease her mercilessly.","example[2]":"She used to tease me about my hair.","note[0]":"tease somebody about something","explanation[0]":"In everyday English, people often say make fun of rather than tease:","example[3]":"Stop making fun of me!","signpost[1]":"annoy an animal","definition[1]":"to deliberately annoy an animal","example[4]":"Stop teasing the cat!","definition[2]":"to deliberately make someone sexually excited without intending to have sex with them, in a way that seems unkind","definition[3]":"to comb your hair in the opposite direction to which it grows, so that it looks thicker","definition[4]":"to laugh at someone and make jokes in order to have fun by embarrassing them, either in a friendly way or in an unkind way. In everyday English, people often say make fun of rather than tease","example[5]":"At work, we all tease her because she’s always late.","example[6]":"Sam’s sisters used to tease him because he was overweight.","display[0]":"make fun of somebody/something","definition[5]":"to tease someone, especially in an unkind way, by laughing at something they do and making them seem stupid","example[7]":"The boys at school used to make fun of me and call me names.","example[8]":"Everyone made fun of the way our Maths teacher walked.","display[1]":"taunt","definition[6]":"to tease someone in a very unpleasant way that shows you do not respect them, in order to make them angry or upset","example[9]":"In the end he hit the man for taunting him about his wife.","example[10]":"The other prisoners taunted him until he couldn’t bear it any more.","display[2]":"pull somebody’s leg","definition[7]":"to tease someone in a friendly way, by trying to make them think something is true when it is not","example[11]":"I’m not really 18. I was only pulling your leg.","example[12]":"I don’t believe you! You’re pulling my leg!","display[3]":"wind somebody up","definition[8]":"to deliberately say something to someone, in order to see if they become annoyed or worried","example[13]":"Are you trying to wind me up?","example[14]":"My friends are always winding me up about it.","display[4]":"take the mickey (out of somebody)","definition[9]":"to make someone look silly, often in a friendly way, for example by copying them or saying something that you do not really mean about them","example[15]":"I don’t speak like that – stop taking the mickey!","example[16]":"‘You’re a genius, we all know that!’ ‘Are you taking the mickey out of me?’","definition[10]":"someone who enjoys making jokes at people, and embarrassing them, especially in a friendly way","example[17]":"Don’t take any notice of Joe – he’s a big tease.","definition[11]":"something that you say or do as a joke, to tease someone","example[18]":"I’m sorry, it was only a tease.","definition[12]":"someone who deliberately makes you sexually excited, but has no intention of having sex with you"}