{"definition[0]":"to make it possible or easier for someone to do something by doing part of their work or by giving them something they need","example[0]":"If there’s anything I can do to help, just give me a call.","example[1]":"I helped her to carry her cases up the stairs.","note[0]":"help somebody (to) do something","example[2]":"She helped him choose some new clothes.","example[3]":"herbal products that help you to relax and sleep","example[4]":"She was coming to help clean the machines.","note[1]":"help (to) do something","example[5]":"Can I help you with the washing up?","note[2]":"help somebody with something","example[6]":"My father said he’s going to help me with the fees.","example[7]":"Here, let me help you on with your coat.","note[3]":"help somebody on/off with something","example[8]":"She helped the old man across the road.","note[4]":"help somebody somewhere","definition[1]":"to make a situation better, easier, or less painful","example[9]":"Crying won’t help.","example[10]":"If you get rid of your car you could be helping the environment.","example[11]":"It helps my concentration if I listen to music while I’m working.","example[12]":"It helped a lot to know that someone understood how I felt.","example[13]":"Eight hours of deep sleep helped enormously.","definition[2]":"to make it easier for someone to do something, by doing something for them or giving them something they need","example[14]":"Is there anything I can do to help?","example[15]":"Dad, I can’t do my homework. Will you help me?","display[0]":"assist","definition[3]":"to help someone","example[16]":"He was employed to assist the manager in his duties.","example[17]":"Some of the guests assisted with the preparation of the food.","display[1]":"aid","definition[4]":"to help someone to do something – used especially when saying that something helps your body to do something","example[18]":"Coffee can aid concentration.","example[19]":"Fennel aids the digestion.","example[20]":"There are plenty of materials to aid the teacher.","display[2]":"help out","definition[5]":"to help someone, especially because there are not enough people to do all the work, or they need someone to give them something","example[21]":"Organizing the school trip will be a lot of work, so I need some volunteers to help out.","example[22]":"My parents have helped us out on several occasions by sending us money.","display[3]":"give somebody a hand","definition[6]":"to help someone to do something, especially by carrying or lifting things","example[23]":"Can you give me a hand moving these boxes?","example[24]":"Dave wants to paint the kitchen and I promised I’d give him a hand.","display[4]":"lend a hand","definition[7]":"to help someone, especially when there are not enough people to do something","example[25]":"Scott is moving on Saturday and we promised to lend a hand.","example[26]":"I went over to see if I could lend a hand.","definition[8]":"used to call people and ask them to help you when you are in danger","definition[9]":"things you do to make it easier or possible for someone to do something","example[27]":"Thank you for all your help.","example[28]":"Do you want any help with the washing up?","note[5]":"help with something/with doing something","example[29]":"I could do with some help to bring the bags in from the car.","note[6]":"help to do something","example[30]":"He asked for my help in getting an interview with her.","note[7]":"help (in) doing something","example[31]":"We manage, with the help of a nurse who comes daily.","note[8]":"with the help of somebody/with somebody’s help","definition[10]":"if someone or something is a help to you, they are useful and make it easier for you to do something","example[32]":"That map isn’t much help.","example[33]":"Let me know if I can be of any help to you.","note[9]":"be of great/little/no/some etc help (to somebody)","example[34]":"Any information would be a great help.","note[10]":"be a (great/big/tremendous/real etc) help (to somebody)","example[35]":"You’ve been a real help to me, Carrie.","example[36]":"I managed to make myself understood with the help of a phrase book.","note[11]":"with the help of something","definition[11]":"advice, treatment, information, or money which is given to people who need it","example[37]":"A lot of these children need professional help.","example[38]":"We received no help from the police.","example[39]":"You may be able to ask for help with the rent.","note[12]":"help with","definition[12]":"a part of a computer program that helps someone using it by giving additional information","heading[0]":"– Meaning 1: things you do to make it easier or possible for someone to do something","collocation[0]":"give somebody help","example[40]":"Do you want me to give you some help?","collocation[1]":"ask (somebody) for help","example[41]":"He asked for help with the cleaning.","collocation[2]":"need help","example[42]":"Some of the older patients need help with walking.","collocation[3]":"get/receive help","example[43]":"She gets no help from her husband.","collocation[4]":"offer (your) help","example[44]":"The taxi driver offered his help and we accepted.","collocation[5]":"provide help","example[45]":"The government should do more to provide help for people who are looking for work.","collocation[6]":"appeal for help","example[46]":"The police are appealing for help to track down the killer.","collocation[7]":"enlist somebody’s help","example[47]":"She enlisted the help of a private investigator to find her missing son.","collocation[8]":"find help","example[48]":"To get it finished by tomorrow, we’ll need to find help from somewhere.","heading[1]":"– Meaning 3: advice, treatment, information, or money which is given to people who need it","collocation[9]":"financial help","example[49]":"We received a lot of financial help from my family.","collocation[10]":"professional help","example[50]":"You need to seek some professional help.","collocation[11]":"medical help","example[51]":"She needs urgent medical help.","collocation[12]":"legal help","example[52]":"You can find free legal help for your problem by logging onto our website.","collocation[13]":"technical help","example[53]":"I might need some technical help understanding the instructions.","collocation[14]":"practical help","example[54]":"The organization offers practical help with finding accommodation.","collocation[15]":"expert help","example[55]":"If the issues are complex, expert help can be sought from the adoption agency.","collocation[16]":"get/receive help from somebody","example[56]":"You will be able to get confidential help from your doctor.","collocation[17]":"give (somebody) help","example[57]":"The fund was set up to give financial help to war veterans.","example[58]":"If you have to move, we provide financial help towards the cost.","collocation[18]":"offer help","example[59]":"We offer free help for people with debts.","collocation[19]":"seek help","example[60]":"He decided to seek medical help for his drink problem.","definition[13]":"the things you do to make it easier or possible for someone to do something","example[61]":"Now that I’m working, the kids need to give me more help with the housework.","example[62]":"The book would never have been finished without his help.","display[5]":"assistance","definition[14]":"help. Assistance is more formal than help, and is used especially about people giving official help","example[63]":"The police are asking the public for their assistance.","example[64]":"The project received financial assistance from the government.","example[65]":"Thank you very much for your assistance, sir.","example[66]":"He set up the business with the assistance of his two sons.","definition[15]":"help. Aid is more formal than help, and is used especially about money, food, medicine etc. that is given to countries or people that are in a very bad situation","example[67]":"Aid is being sent to areas affected by the earthquake.","example[68]":"The US spends billions of dollars on aid to developing countries.","example[69]":"Another driver stopped and came to his aid.","definition[16]":"help and encouragement","example[70]":"Thanks to everyone who gave us their support.","example[71]":"We could not have won the case without your support.","display[6]":"cooperation","definition[17]":"help – used especially when people, organizations, or countries work together to get things done, and show that they are willing to do this","example[72]":"a spirit of international cooperation","example[73]":"The cooperation of landowners was needed for the plan to succeed.","display[7]":"backup","definition[18]":"extra people, equipment etc that can be used in case people need help","example[74]":"The officer waited for backup to arrive before making any arrests.","definition[19]":"people that organizations employ, especially for a short time","example[75]":"To meet increased demand, companies have hired temporary help."}