{"word[0]":"visit","definition[0]":"to go and spend time in a place or with someone, especially for pleasure or interest","example[0]":"Eric went to Seattle to visit his cousins.","example[1]":"I was really pleased that they came to visit me.","example[2]":"Which cities did you visit in Spain?","example[3]":"A recent trip to London gave me the opportunity to visit the Science Museum.","example[4]":"She doesn’t visit very often.","explanation[0]":"In everyday English, people often say that they come/go to see someone, rather than visit them:","example[5]":"He’s gone to Scotland to see his family.","definition[1]":"to go to a place as part of your official job, especially to examine it","example[6]":"The building inspector is visiting the new housing project.","example[7]":"The president’s first trip abroad will be to visit with troops in Bosnia.","note[0]":"visit with","definition[2]":"to go to see a doctor, lawyer etc in order to get treatment or advice","definition[3]":"to look at a website on the Internet","example[8]":"Over 1,000 people visit our site every week.","definition[4]":"to talk socially with someone","example[9]":"Why don’t you kids play outside while we visit with each other?","heading[0]":"a place","definition[5]":"to go and spend time in a place, for interest or pleasure","example[10]":"You must visit Kyoto.","example[11]":"They visited all the usual places.","display[0]":"go to","definition[6]":"to visit a place. Go to  is very commonly used in everyday English instead of visit","example[12]":"Have you ever been to England?","example[13]":"They went to the Eiffel Tower and the Flea Market.","display[1]":"go sightseeing","definition[7]":"to visit places of interest in a country","example[14]":"We went sightseeing in the old part of the city.","heading[1]":"a person","definition[8]":"to go and spend time with someone","example[15]":"How often do you visit your grandparents?","display[2]":"come around/by/over","definition[9]":"to visit someone informally in their home, especially when you live near them","example[16]":"A few friends came round last night.","display[3]":"drop in/by","definition[10]":"to visit someone in their home, especially on your way to another place","example[17]":"Kate said she’d drop by later to give you the forms.","display[4]":"look somebody up","definition[11]":"to visit someone who you do not see very often, when you are spending time in the area where they live","example[18]":"Look me up if you’re ever in Newark.","definition[12]":"an occasion when someone goes to spend time in a place or goes to see a person","example[19]":"We’re just here on a short visit.","example[20]":"Why don’t you come for a visit this summer?","example[21]":"I decided to pay him a visit at his office.","example[22]":"I’ve just had a visit from the police.","example[23]":"I’m only here for the weekend – just a flying visit this time.","example[24]":"his first official visit to Britain as Russian president","example[25]":"The town is well worth a visit.","example[26]":"a visit to Chicago","note[1]":"visit to","definition[13]":"an occasion when you see a doctor, lawyer etc for treatment or advice","definition[14]":"an occasion when you talk socially with someone","example[27]":"Barbara and I had a nice long visit.","collocation[0]":"pay somebody a visit","example[28]":"Perhaps she'll come up to town then and pay me a visit.","collocation[1]":"make/pay a visit","example[29]":"The king made an official visit to Poland last year.","collocation[2]":"have/receive a visit from somebody","example[30]":"I've just had a visit from Lou Stacey.","collocation[3]":"a brief/short visit","example[31]":"Miss Russell was only able to pay a brief visit.","collocation[4]":"a flying visit","example[32]":"Timpson was due to pay a flying visit to London.","collocation[5]":"a surprise visit","example[33]":"Naomi paid a surprise visit to an old school friend.","collocation[6]":"an unannounced visit","example[34]":"The social worker made an unannounced visit.","collocation[7]":"an official/state visit","example[35]":"The president made an official visit to France this week.","collocation[8]":"a return visit","example[36]":"George was already planning a return visit.","collocation[9]":"be worth a visit","example[37]":"Las Palmas, the lively capital, is well worth a visit."}