{"word[0]":"postpone","definition[0]":"to change the date or time of a planned event or action to a later one","synonym[0]":"put back","opposite[0]":"bring forward","example[0]":"The match had to be postponed until next week.","example[1]":"His trial has been postponed indefinitely (=no one knows when it will happen).","example[2]":"They’ve decided to postpone having a family for a while.","note[0]":"postpone doing something","example[3]":"The game was postponed because of heavy snow.","example[4]":"We had to postpone the trip because of my father’s illness.","example[5]":"The trial has been postponed until November.","display[0]":"put something off","definition[1]":"to decide to do something later than you planned to do it or later than you should do it, especially because there is a problem or because you do not want to do it now","example[6]":"I really should go to the dentist, but I keep putting it off.","example[7]":"The concert’s been put off till next week.","example[8]":"The committee decided to put off making any decision until the new year.","display[1]":"delay","definition[2]":"to not do something until something else has happened or until a more suitable time","example[9]":"He decided to delay his departure until after he’d seen the Director.","example[10]":"Police delayed making any announcement until the girl’s relatives had been contacted.","display[2]":"procrastinate","definition[3]":"to delay doing something that you ought to do, usually because you do not want to do it – used especially to show disapproval","example[11]":"Kerry procrastinated for as long as possible before firing anyone.","example[12]":"He had been procrastinating over starting the work.","display[3]":"be pushed/moved/put back","definition[4]":"if an event is pushed back, someone arranges for it to be held at a later time or date than originally planned","example[13]":"Their meeting has been put back to next Thursday.","example[14]":"The museum’s opening date was pushed back so that safety checks could be carried out.","example[15]":"The game on April 1 has been moved back to April 5.","display[4]":"shelve","definition[5]":"to decide not to continue with a plan, project etc now although it may be considered again at some time in the future","example[16]":"Plans for a new stadium have been shelved for now.","example[17]":"The city shelved the project due to lack of funding.","display[5]":"put something on ice/put something on the back burner","definition[6]":"to decide not to continue with a plan, project etc until a later time. These expressions are rather informal and are often used in business English","example[18]":"The project has had to be put on ice due to lack of funding.","example[19]":"Blears called for the discussions to be put on ice until after the elections.","example[20]":"The plan seems to have been put on the back burner.","definition[7]":"to change the date or time of a planned event to a later one","example[21]":"The meeting has been postponed until next Tuesday."}