{"word[0]":"production","definition[0]":"the process of making or growing things to be sold, especially in large quantities","example[0]":"agricultural production and distribution","note[0]":"food/oil/milk etc production","example[1]":"high-tech production methods","note[1]":"production costs/facilities/processes etc","example[2]":"the production of consumer goods","note[2]":"production of","example[3]":"By September, the new motors were in production.","note[3]":"be in production","example[4]":"The new model will go into production next year.","note[4]":"go into/out of production","definition[1]":"the amount of goods that are made or grown","note[5]":"production levels/targets etc","example[5]":"a drop in oil and gas production","note[6]":"increase/rise/fall etc in production","definition[2]":"when something is produced through a natural process","example[6]":"the skin’s natural production of oil","definition[3]":"a play, film, broadcast etc that is produced for the public, or the process of producing it","example[7]":"the new Shakespeare production at the Arts Theatre","example[8]":"In 1992, Green moved into video production.","definition[4]":"the process of making or growing things to be sold as products, usually in large quantities","example[9]":"Toshiba is increasing production of its popular line of laptop computers.","example[10]":"They have plans to design a smaller submarine that could go into production (=start being produced) by the end of the decade.","example[11]":"a new plant with an annual production capacity of (=the ability to produce) 500,000 disk drives","example[12]":"Germany’s high production costs","example[13]":"a magnesium metal production facility (=factory)","example[14]":"He was a production manager for Lockheed Corp.","example[15]":"By adjusting the production process, they were able to reduce the plant’s waste by two-thirds.","example[16]":"Bonuses were introduced for employees meeting production targets (=aims).","example[17]":"production workers assembling pianos","definition[5]":"an amount of something that is produced","example[18]":"In August, production of passenger cars climbed 12% from a year earlier.","definition[6]":"the process of making films, television, and radio broadcasts, or plays, or a particular film etc","example[19]":"a film production company","example[20]":"CBS has been discussing possible co-productions with the BBC."}