{"word[0]":"absorb","signpost[0]":"liquid/gas","definition[0]":"to take in liquid, gas, or another substance from the surface or space around something","example[0]":"Plants absorb nutrients from the soil.","example[1]":"Water and salts are absorbed into our bloodstream.","note[0]":"absorb something into something","definition[1]":"to read or hear a large amount of new information and understand it","example[2]":"Her capacity to absorb information is amazing.","signpost[1]":"interest","definition[2]":"to interest someone so much that they do not pay attention to other things","example[3]":"The movement and noise of the machines absorbed him completely.","example[4]":"Judith lay on the settee, absorbed in her book.","note[1]":"be absorbed in something","signpost[2]":"become part of something","definition[3]":"to become part of something larger","example[5]":"California absorbs many of the legal immigrants to the US.","example[6]":"We were soon absorbed into local village life.","note[2]":"be absorbed into something","signpost[3]":"light/heat/energy/noise","definition[4]":"if something absorbs light, heat, energy, or noise, it takes it in","example[7]":"Darker surfaces absorb heat.","signpost[4]":"deal with change/costs","definition[5]":"if something absorbs changes or costs, it accepts them and deals with them successfully","example[8]":"The beer industry had absorbed a doubling of federal tax in 1991.","signpost[5]":"money/time","definition[6]":"if something absorbs money, time etc, it uses a lot of it","example[9]":"Defence spending absorbs almost 20% of the country’s wealth.","definition[7]":"to reduce the effect of a sudden violent movement","example[10]":"A well-designed sports shoe should absorb the impact on your feet.","definition[8]":"if a large organization absorbs a smaller one, it takes control of it and makes it part of the organization","example[11]":"The company was absorbed by IBM in 1995.","example[12]":"Several smaller companies were absorbed into the group.","note[3]":"absorb into","definition[9]":"if a business absorbs costs, it is able to deal with them without any bad effects","example[13]":"Careful cost control has allowed the bank to absorb the costs of the merger.","definition[10]":"if a market absorbs a product, it accepts it and is able to sell it","example[14]":"Canada absorbs about 23% of US exports.","example[15]":"Trading was cautious and quiet as the market prepared to absorb £55 billion of government securities to be sold this week.","definition[11]":"if something absorbs money or time, it uses a lot of it"}