{"word[0]":"preference","definition[0]":"if you have a preference for something, you like it more than another thing and will choose it if you can","example[0]":"Do you have a colour preference?","example[1]":"Parents may be able to express a preference as to the school their child will attend.","example[2]":"The amount of sugar you add will depend on personal preference.","example[3]":"Many elderly people expressed a strong preference to live in their own homes.","example[4]":"a cultural preference for boy babies","note[0]":"preference for","example[5]":"Use clear English in preference to technical language.","note[1]":"in preference to something","definition[1]":"when someone is treated more favourably than other people, often when he or she has been treated unfairly in the past","example[6]":"Racial preferences are a way to make up for years of discrimination against minorities.","example[7]":"In allocating housing, preference is given to families with young children.","note[2]":"give/show preference (to somebody)","collocation[0]":"have a preference","example[8]":"Do you have a preference for red or white wine?","collocation[1]":"express a preference","example[9]":"He avoided expressing a preference for any of the remaining Democratic candidates.","collocation[2]":"show a preference","example[10]":"Females showed a preference for long-tailed males.","form[0]":"ADJECTIVES/NOUN + preference","collocation[3]":"a strong preference","example[11]":"In some countries, there is still a strong preference for sons.","collocation[4]":"a clear preference","example[12]":"There was a clear preference amongst the staff for this style of leadership.","collocation[5]":"a marked preference","example[13]":"The animals have a marked preference for woodland.","collocation[6]":"a personal preference","example[14]":"My personal preference is to eat meat only once or twice a week.","collocation[7]":"individual preferences","example[15]":"This partnership can take a variety of forms, depending on individual preferences.","collocation[8]":"consumer preferences","example[16]":"Information about local consumer preferences can be used by a manufacturer's sales force.","collocation[9]":"food preferences","example[17]":"Very young children may have clear food preferences.","collocation[10]":"in order of preference","example[18]":"Please list your choice of colleges in order of preference.","collocation[11]":"be a matter of personal preference","example[19]":"Which one you decide to buy is just a matter of personal preference.","definition[2]":"the state of liking something more than something else, or something you like more than another thing","example[20]":"People were twice as likely to change their brand preference if they liked an advertisement.","example[21]":"a change in consumer preference from adjustable-rate to fixed-rate mortgages","definition[3]":"when a country treats some countries more favourably than others in international trade, for example through lower import taxes","example[22]":"Britain must take a strong line with its trading partners, but without damaging Community preference (=treating goods from the European Union more favourably than others.)"}