{"word[0]":"report","definition[0]":"a written or spoken description of a situation or event, giving people the information they need","example[0]":"Colleges have to provide a written report on the progress of each student during the year.","note[0]":"report of/on/about","definition[1]":"a piece of writing in a newspaper about something that is happening, or part of a news programme","example[1]":"According to recent news reports, two of the victims are Americans.","example[2]":"media reports of the food shortages","note[1]":"report on/of","definition[2]":"an official document that carefully considers a particular subject","example[3]":"a recent report on child abuse","note[2]":"report on","definition[3]":"information that something has happened, which may or may not be true","example[4]":"Police received reports of a bomb threat at the airport at 11:28 p.m.","note[3]":"report of","example[5]":"Government officials have denied reports of rebel advances.","example[6]":"a report that he had been killed","note[4]":"report that","definition[4]":"a written statement by teachers about a child’s work at school, which is sent to his or her parents","definition[5]":"someone who works for a particular manager","example[7]":"Only Gordon’s direct reports are attending the course.","definition[6]":"the noise of an explosion or shot","example[8]":"a loud report","heading[0]":"– Meaning 1: a written or spoken description of a situation or event, giving people the information they need","collocation[0]":"write a report","example[9]":"Her social worker has written a report on the case.","collocation[1]":"make a report","example[10]":"We make regular progress reports to our manager.","collocation[2]":"give a report","example[11]":"He came to the office to give his report in person.","collocation[3]":"prepare a report","example[12]":"The surveyor will view the property and prepare a full report.","collocation[4]":"submit a report","example[13]":"Doctors will have to submit weekly reports.","collocation[5]":"a report says/states (that)","example[14]":"The report said that it would cost another £250 million to repair the damage.","collocation[6]":"a full/detailed report","example[15]":"A full report will be prepared for the next committee meeting.","collocation[7]":"an official/formal report","example[16]":"Black graduates still face discrimination from employers, according to an official report.","collocation[8]":"a written report","example[17]":"Mr Thomas asked me to send him a written report.","collocation[9]":"a confidential report","example[18]":"He made a confidential report to UN headquarters in New York.","collocation[10]":"an autopsy report","example[19]":"The autopsy report gave the cause of death as alcohol poisoning.","heading[1]":"– Meaning 4: information that something has happened, which may or may not be true","collocation[11]":"receive a report","example[20]":"Amnesty has received repeated reports of violation of detention procedures.","collocation[12]":"have a report","example[21]":"The police say they had reports of a gang shooting in East London.","collocation[13]":"confirm a report","example[22]":"A spokesman refused to confirm reports that the aircraft had previously suffered an engine fire.","collocation[14]":"deny a report","collocation[15]":"dismiss a report","example[23]":"A Treasury official yesterday dismissed the reports as ‘pure speculation’.","form[0]":"ADJECTIVES/NOUNS + report","collocation[16]":"an unconfirmed report","example[24]":"There are unconfirmed reports that up to 2,000 people have been killed.","collocation[17]":"an eyewitness/first-hand report","example[25]":"Some were beaten and tortured according to first-hand reports from former prisoners.","collocation[18]":"a reliable report","example[26]":"On Sunday there were reliable reports of a group of whales off the Devon coast.","collocation[19]":"an unofficial report","example[27]":"According to unofficial reports, the president had talks with Palestinian leaders.","collocation[20]":"conflicting reports","example[28]":"Conflicting reports continued to emerge from the area.","collocation[21]":"a misleading report","example[29]":"This isn’t the first time the industry has published misleading reports based on incomplete data.","definition[7]":"to give people information about recent events, especially in newspapers and on television and radio","example[30]":"This is Gavin Williams, reporting from the United Nations in New York.","example[31]":"We aim to report the news as fairly as possible.","example[32]":"The incident was widely reported in the national press.","example[33]":"The Times sent her to Bangladesh to report on the floods.","example[34]":"Journalists in Cairo reported that seven people had been shot.","example[35]":"Witnesses reported seeing three people flee the scene.","note[5]":"report doing something","explanation[0]":"In more formal English, you say it is reported that something is true","example[36]":"It is reported that there has been an explosion","signpost[0]":"job/work","definition[8]":"to tell someone about what has been happening, or what you are doing as part of your job","example[37]":"I’ve asked him to come back next week and report on his progress.","note[6]":"report (to somebody) on something","signpost[1]":"public statement","definition[9]":"to officially give information to the public","example[38]":"Doctors have reported a 13% increase in the number of people with heart disease.","signpost[2]":"crime/accident","definition[10]":"to tell the police or someone in authority that an accident or crime has happened","example[39]":"I’d like to report a theft.","example[40]":"The plane was reported missing.","note[7]":"report somebody/something missing/injured/killed","example[41]":"All accidents must be reported to the safety officer.","note[8]":"report something to somebody","signpost[3]":"complain","definition[11]":"to complain about someone to people in authority","example[42]":"Polish referee Ryszard Wojoik reported two Leeds United players for violent conduct.","note[9]":"report somebody for something","example[43]":"Hadley’s drinking problem led co-workers to report him to the supervisor.","note[10]":"report somebody to somebody","signpost[4]":"arrival","definition[12]":"to go somewhere and officially state that you have arrived","example[44]":"All soldiers were required to report for duty (=arrive and be ready for work) on Friday.","example[45]":"All visitors must report to the site office.","note[11]":"report to","definition[13]":"a written or spoken description of a situation or event","example[46]":"a favorable first quarter earnings report","example[47]":"an interim financialprogress report","definition[14]":"a report presented each year by the directors of a company to the members and shareholders, containing financial information about the company’s trading activities and the documents the company must produce by law, which are the BALANCE SHEET, the PROFIT AND LOSS ACCOUNT and the AUDITOR’s and DIRECTORS' REPORTs","example[48]":"The company’s annual report revealed a rise of 3.8% in overall passenger income to £7.2 million.","definition[15]":"an official document produced by a group of people, examining a particular subject. People often use the name of the committee producing the report to talk about it","example[49]":"the Cadbury report on the financial aspects of corporate governance","definition[16]":"a newspaper article or part of television or radio programme about a particular situation or event","example[50]":"According to a report in ‘The Financial Times’, several potential buyers are interested in the company.","definition[17]":"a manager’s reports are the people who work for him or her","example[51]":"Get feedback about your effectiveness from your boss, your peers, and your direct reports (=the people who are directly below you in your organization).","definition[18]":"if a company reports a profit, loss etc, it announces publicly how much profit etc it has made","example[52]":"The company reported second-quarter earnings of $25.1 million.","example[53]":"It is expected to report a 6% increase in sales.","definition[19]":"to give people information about an event, situation etc","example[54]":"His remarks were first reported in yesterday’s ‘Chicago Tribune’.","example[55]":"Head office will report on outgoings each month.","example[56]":"‘The New York Times’ reported that US business interests were lobbying the White House to lift the trade embargo.","definition[20]":"to officially state you have arrived in an office, factory etc, usually by signing your name","example[57]":"All delivery vehicles please report to the site office."}