{"word[0]":"mix somebody/something ↔ up","definition[0]":"to make the mistake of thinking that someone or something is another person or thing","synonym[0]":"confuse","example[0]":"I think you might be mixing up Wetherall and Newton.","example[1]":"I must have got the times mixed up.","example[2]":"I always mix him up with his brother. They look so much alike.","definition[1]":"to change the way things have been arranged, often by mistake, so that they are no longer in the same order","example[3]":"My papers got all mixed up.","example[4]":"Books on Scottish history were mixed up with books on volcanoes.","definition[2]":"to make someone feel confused","example[5]":"They kept trying to mix me up.","definition[3]":"to prepare something by mixing things together","example[6]":"It was hard work mixing up four tonnes of cement.","heading[0]":"to mix foods, liquids etc","display[0]":"mix","definition[4]":"to put different substances or liquids together so that they can no longer be separated","example[7]":"Mix yellow and blue paint to make green.","example[8]":"This cake is really easy – you just mix everything together in the bowl.","example[9]":"Concrete is made by mixing gravel with sand, cement, and water.","display[1]":"combine","definition[5]":"to mix things together so that they form a single substance. Combine is more formal than mix","example[10]":"Combine the flour and the eggs.","example[11]":"Steel is produced by combining iron with carbon.","display[2]":"stir","definition[6]":"to move a spoon or stick around in a liquid, a pan etc, especially when you are mixing things together","example[12]":"Keep stirring until the sauce becomes thicker.","example[13]":"Stir the sugar into the warm milk.","example[14]":"Stir the paint before you use it.","display[3]":"blend","definition[7]":"to mix together soft or liquid substances to form a single smooth substance","example[15]":"Blend the yogurt with fresh fruit for a great drink.","display[4]":"beat","definition[8]":"to mix food together quickly and thoroughly using a fork or kitchen tool – used especially about eggs","example[16]":"Beat the eggs and add them to the milk and flour.","display[5]":"whisk","definition[9]":"to mix foods that are soft or liquid very quickly so that air is mixed in, using a fork or special tool","example[17]":"Whisk the egg whites until they form soft peaks.","display[6]":"dilute","definition[10]":"to mix a liquid with water in order to make it weaker","example[18]":"Dilute the bleach with two parts water to one part bleach.","heading[1]":"to mix styles, ideas, or other things","definition[11]":"to put different styles, ideas, or other things together","example[19]":"His music mixes jazz and classical styles.","example[20]":"The different categories of books were all mixed together.","definition[12]":"to mix different styles, ideas, or other things, so that they work together or become a single thing","example[21]":"Diets are most effective when they are combined with exercise.","example[22]":"He combines Greek philosophy with Christian teachings.","definition[13]":"to combine parts of different things together, especially in a successful and effective way","example[23]":"The teaching course blends theory and practice in the classroom.","display[7]":"fuse","definition[14]":"to combine different styles in order to form a new style","example[24]":"The band fuses African rhythms with traditional Celtic music.","display[8]":"jumble","definition[15]":"to mix things together in an untidy way, so that they are not in any order","example[25]":"The jigsaw pieces were all jumbled together in the box.","definition[16]":"a mistake that causes confusion about details or arrangements","example[26]":"Geoffrey rushed in late pleading a mix-up in his diary.","note[0]":"mix-up in","example[27]":"A council official blamed a mix-up between departments.","note[1]":"mix-up between","example[28]":"There was a mix-up over the hotel booking.","note[2]":"mix-up over"}