{"signpost[0]":"for writing/wrapping","definition[0]":"material in the form of thin sheets that is used for writing on, wrapping things etc","example[0]":"I’ll get you a piece of paper so you can write the number down.","example[1]":"Do you have a pen and paper?","signpost[1]":"newspaper","definition[1]":"a newspaper","example[2]":"Have you seen today’s paper?","example[3]":"You’ll read about it in tomorrow’s papers.","example[4]":"the Sunday papers","signpost[2]":"examination","definition[2]":"a set of printed questions used as an examination in a particular subject, and the answers people write","example[5]":"an exam paper","example[6]":"I have a stack of papers to mark.","example[7]":"The geography paper was really easy.","note[0]":"history/French etc paper","signpost[3]":"speech/piece of writing","definition[3]":"a piece of writing or a talk on a particular subject by someone who has made a study of it","example[8]":"a scientific paper","example[9]":"Professor Usborne gave a paper on recent developments in his field.","example[10]":"a paper on psychology","note[1]":"paper on","signpost[4]":"piece of schoolwork","definition[4]":"a piece of writing that is done as part of a course at school or university","synonym[0]":"essay","example[11]":"a paper on the Civil War","signpost[5]":"official publication","definition[5]":"a report prepared by a government or committee on a question they have been considering or a proposal for changes in the law","example[12]":"We will publish a discussion paper on the future of the BBC.","example[13]":"a working paper (=a report that is not final) on funding the Health Service","example[14]":"the 1998 White Paper on political reform","signpost[6]":"for walls","definition[6]":"paper for covering and decorating the walls of a room","synonym[1]":"wallpaper","example[15]":"a floral paper","signpost[7]":"financial","definition[7]":"stocks and shares  that can be bought and sold on a financial market","definition[8]":"soft thin paper used for cleaning yourself after you have used the toilet","synonym[2]":"toilet paper","heading[0]":"– Meaning 1: material in the form of thin sheets that is used for writing on, wrapping things etc","collocation[0]":"a sheet of paper","example[16]":"Each recipe was written down on a separate sheet of paper.","collocation[1]":"a piece of paper","example[17]":"Can I have another piece of paper?","collocation[2]":"a scrap/slip of paper","example[18]":"He scribbled Pamela’s address on a scrap of paper.","collocation[3]":"a pad of paper","example[19]":"Chris took out a pad of paper and started writing.","form[0]":"ADJECTIVES/NOUN + paper","collocation[4]":"writing/note paper","example[20]":"Can you fetch me a piece of writing paper and a pen?","collocation[5]":"plain paper","example[21]":"The package was wrapped in plain brown paper.","collocation[6]":"lined paper","example[22]":"a note written on lined paper","collocation[7]":"wrapping paper","example[23]":"He carefully removed the wrapping paper so it wouldn’t tear.","collocation[8]":"tissue paper","example[24]":"All the clothes were wrapped in tissue paper.","collocation[9]":"recycled paper","example[25]":"The envelopes are made from 100 percent recycled paper.","heading[1]":"– Meaning 2: a newspaper","collocation[10]":"a local paper","example[26]":"You could try putting an advert in the local paper.","collocation[11]":"a national paper","example[27]":"The story had been in all the national papers.","collocation[12]":"a daily paper","example[28]":"Which of these daily papers do you usually read?","collocation[13]":"a Sunday paper","example[29]":"I only get a Sunday paper if I’ve got lots of spare time.","collocation[14]":"an evening paper","example[30]":"Ian usually buys an evening paper on his way home.","collocation[15]":"a tabloid paper","example[31]":"Don’t believe everything you read in the tabloid papers.","collocation[16]":"a broadsheet paper","example[32]":"Tabloid newspapers are usually about half the size of a broadsheet paper.","collocation[17]":"a quality paper","example[33]":"Readers of quality papers, such as the Telegraph and the Guardian, are mainly employed in professional jobs.","definition[9]":"made of paper","example[34]":"a paper bag","definition[10]":"written or printed on paper","example[35]":"The brochure is available in electronic and paper versions.","definition[11]":"existing only as an idea but not having any real value","example[36]":"paper profits  (=a record of the value of something, that is not real until the thing is sold)","example[37]":"paper promises","definition[12]":"to decorate the walls of a room by covering them with special paper","definition[13]":"material in the form of thin sheets used for writing things on, wrapping things etc","example[38]":"plants that make chemicals for the paper industry","example[39]":"Many daily papers have a financial section.","example[40]":"The Hollywood Reporter is a trade paper (=one that reports on a particular industry) for the film industry.","definition[14]":"if you put ideas or information on paper, you write them down","example[41]":"We need to get these ideas down on paper.","definition[15]":"if something seems to be true on paper, it seems to be true as an idea, but may not be true in a real situation","example[42]":"It’s a nice idea on paper, but you’ll never get it to work.","definition[16]":"SECURITIES (=bonds etc) that can be traded on financial markets, rather than cash, and the CERTIFICATEs (=documents) relating to them","example[43]":"Mitsubishi is to issue (=make available and sell) as much as 200 billion yen of paper.","example[44]":"There are times when people are doubtful of the viability of the financial paper they hold.","definition[17]":"documents used by a person or organization in their work","example[45]":"The hotel filed papers (=officially sent them to the authorities) three weeks ago, seeking various building permits.","example[46]":"According tocourt papers, the judge’s decision was based on the bank’s failure to comply with banking laws.","definition[18]":"an official document you need in order to do something","example[47]":"Once all the necessary papers have been signed, the house is yours."}