{"word[0]":"interfere","definition[0]":"to deliberately get involved in a situation where you are not wanted or needed","synonym[0]":"meddle","example[0]":"My daughter-in-law said that I was interfering, but I was only trying to help.","example[1]":"It’s not the church’s job to interfere in politics.","note[0]":"interfere in","definition[1]":"to try to get involved in a situation where you are not wanted or needed","example[2]":"She tried not to interfere in her children’s lives.","example[3]":"It’s not your problem, so don’t interfere.","definition[2]":"to interfere in someone else’s affairs in a way that is annoying for them. Meddle is more informal than interfere, and has more of a feeling of being annoyed","example[4]":"I did not want my parents meddling in my private affairs.","example[5]":"He warned diplomats against meddling in Indonesia’s affairs.","display[0]":"intrude","definition[3]":"to interfere by being somewhere where you are not wanted, or getting involved in a situation that is private – used especially when saying that you want to avoid doing this","example[6]":"Sorry, I didn’t mean to intrude while you were on the phone.","example[7]":"When someone dies, people are often worried about intruding.","display[1]":"butt in","definition[4]":"to interfere by trying to become involved in a private situation or conversation that does not concern you","example[8]":"Stop butting in, will you!","example[9]":"I didn’t want to give them any advice in case they thought I was butting in.","display[2]":"pry","definition[5]":"to try to find out what someone else is doing in their private life, by asking questions or secretly checking what they are doing, in a way that seems annoying or rude","example[10]":"Journalists like to pry into the lives of the rich and famous.","example[11]":"I didn’t mean to pry – I just wanted to know if I could help.","display[3]":"poke/stick your nose into something","definition[6]":"to ask questions about someone else’s private life or give them advice they do not want, in a way that annoys them","example[12]":"She’s one of those people who’s always poking her nose into other people’s business."}