{"word[0]":"fashion","definition[0]":"something that is popular or thought to be good at a particular time","example[0]":"His ideas are coming back into fashion (=they are becoming popular again).","example[1]":"Eastern religions used to be the fashion  in the 60s.","example[2]":"Self-help books are all the fashion (=they are very fashionable).","example[3]":"the fashion for ‘discovery methods’ of learning","note[0]":"fashion for","example[4]":"The emerging science of photography was already changing fashions in art.","note[1]":"fashion in","example[5]":"Bright colours are in fashion this summer.","note[2]":"in fashion","example[6]":"Their music will never go out of fashion.","note[3]":"out of fashion","bad_example[0]":"on fashion","definition[1]":"a style of clothes, hair etc that is popular at a particular time","example[7]":"Young people are very concerned with fashion.","example[8]":"The store has all the latest fashions.","definition[2]":"the business or study of making and selling clothes, shoes etc in new and changing styles","example[9]":"magazines about fashion and beauty","example[10]":"the London College of Fashion","collocation[0]":"be in fashion","example[11]":"Belted jackets are in fashion this winter.","collocation[1]":"be out of fashion","example[12]":"Flared trousers were out of fashion in the 1980s.","collocation[2]":"go out of fashion","example[13]":"Long evening dresses are going out of fashion.","collocation[3]":"come back into fashion","example[14]":"Short skirts are coming back into fashion this year.","collocation[4]":"be the height of fashion","example[15]":"With her short dress and high boots she was the height of fashion.","collocation[5]":"keep up with fashion","example[16]":"Lucy likes to keep up with the latest fashions.","collocation[6]":"fashion-conscious","example[17]":"Fashion-conscious people can’t get enough of these new designs.","collocation[7]":"the latest fashion","example[18]":"They sell all the latest fashions.","collocation[8]":"men’s/women’s fashions","example[19]":"Men’s fashions have not changed much in 50 years.","form[0]":"fashion + NOUN","collocation[9]":"the fashion industry","example[20]":"London is the centre of the British fashion industry.","collocation[10]":"the fashion world","example[21]":"Small women are often overlooked by the fashion world.","collocation[11]":"a fashion show","example[22]":"Calvin Klein’s fashion show featured suits and sportswear.","collocation[12]":"a fashion model","example[23]":"Fashion models are usually very tall.","collocation[13]":"a fashion designer","example[24]":"Her favourite fashion designers include Giorgio Armani and Gianfranco Ferre.","collocation[14]":"fashion design","example[25]":"He went to St Martin’s School of Art to study fashion design.","collocation[15]":"a fashion house","example[26]":"fashion houses such as Armani and Hugo Boss","collocation[16]":"a fashion magazine","example[27]":"She’s the editor of a leading fashion magazine.","collocation[17]":"fashion photography","example[28]":"a book of Lang’s fashion photography","collocation[18]":"a fashion photographer","example[29]":"Later he worked as a fashion photographer for Vogue.","collocation[19]":"a fashion shoot","example[30]":"She was asked to star with top model Naomi Campbell in a fashion shoot.","collocation[20]":"a fashion shop","example[31]":"We walked around Milan’s famous fashion shops.","definition[3]":"a style of clothes, hair, behaviour etc that is fashionable. Fashion is also used as an uncountable noun, when talking about all of these styles in general","example[32]":"the latest fashions from Donna Karan","example[33]":"changing fashions in popular music","example[34]":"I’m not interested in fashion.","display[0]":"vogue","definition[4]":"if there is a vogue for something, or it is in vogue, it is fashionable. Vogue sounds more formal and typical of the language that more educated speakers use than fashion","example[35]":"the current vogue for realistic animated films","example[36]":"There was a vogue for cream furniture in the 1920s.","example[37]":"His pictures are very much in vogue these days.","display[1]":"trend","definition[5]":"a way of doing something or a way of thinking that is becoming fashionable or popular","example[38]":"The magazine focuses on the latest trends in contemporary design.","example[39]":"The trend is for people to wait longer to marry and have children.","display[2]":"craze/fad","definition[6]":"a fashion, activity, type of music etc that suddenly becomes very popular, but only remains popular for a short time – often used about things that you think are rather silly","example[40]":"a new fitness craze","example[41]":"the current fad for bare white walls and uncomfortable-looking metal furniture","example[42]":"I’m sure it’s just a passing fad  (=something that will soon stop being fashionable).","example[43]":"fad diets","display[3]":"something is all the rage","definition[7]":"used when saying that something is very popular and fashionable for a short time","example[44]":"The game was all the rage at her school.","definition[8]":"to shape or make something, using your hands or only a few tools","example[45]":"He fashioned a box from a few old pieces of wood.","note[4]":"fashion something from something","example[46]":"Jamie could take a piece of wood and fashion it into a wonderful work of art.","note[5]":"fashion something into something","definition[9]":"to influence and form someone’s ideas and opinions","example[47]":"We are all unique human beings, fashioned by life experiences.","explanation[0]":"Fashion is usually passive in this meaning","definition[10]":"like something, or in the way that a particular group of people does something","example[48]":"They ate Indian-fashion, using their fingers.","definition[11]":"a way of doing something or behaving that is popular at a particular time","example[49]":"Good design will never go out of fashion (=become unfashionable).","example[50]":"Big companies seem to be in fashion (=acceptable and popular) again.","example[51]":"How do you explain the current fashion for takeovers?","definition[12]":"the business of making and selling clothes, shoes etc in new and changing styles","example[52]":"Emma wants to work in the fashion industry.","example[53]":"leading fashion designers","definition[13]":"a style of clothes or hair that is popular at a particular time","example[54]":"We sell only the latest fashions.","example[55]":"Long skirts are back in fashion.  (=are in fashion again after a period of time when they were not)","definition[14]":"to produce something","example[56]":"Houston has fashioned a substantial economic recovery.","example[57]":"The two sides have been unable to fashion a compromise."}