{"definition[0]":"the time when something or someone is best, greatest, highest, most successful etc","example[0]":"Sales this month have reached a new peak.","example[1]":"Most athletes reach their peak in their mid-20s.","example[2]":"He’s past his peak as a tennis player.","example[3]":"Oil production is down from its peak of two years ago.","example[4]":"the peaks and troughs of the US economy  (=high and low points)","example[5]":"The British Empire was at its peak in the mid 19th century.","note[0]":"at something’s peak","example[6]":"Hotel rooms are difficult to find at the peak of the holiday season.","note[1]":"at the peak of something","signpost[0]":"mountain","definition[1]":"the sharply pointed top of a mountain","example[7]":"snow-capped mountain peaks","example[8]":"jagged peaks","definition[2]":"a mountain","example[9]":"Mount McKinley is Alaska’s highest peak.","definition[3]":"a part that forms a point above a surface or at the top of something","example[10]":"Whisk the egg whites until they form stiff peaks.","signpost[1]":"hat","definition[4]":"the flat curved part of a cap that sticks out in front above your eyes","heading[0]":"– Meaning 1: the time when something or someone is best, greatest, highest, most successful etc","collocation[0]":"be at its peak","example[11]":"The strawberry season is now at its peak.","collocation[1]":"be past your peak","example[12]":"By the next Olympics, she will be past her peak.","collocation[2]":"reach a peak","example[13]":"The traffic reaches a peak between 5 and 6 pm.","example[14]":"The company’s stock hit a peak of about $23.","collocation[3]":"fall from a peak","example[15]":"Visitor numbers have fallen from a peak of 1.8 million per year to under 1 million.","collocation[4]":"peaks and troughs","example[16]":"Sales went through a number of peaks and troughs in the last fiscal year.","form[0]":"ADJECTIVES/NOUN + peak","collocation[5]":"a mountain peak","example[17]":"All around are the spectacular mountain peaks of the Jungfrau region.","collocation[6]":"the highest peak","collocation[7]":"a snowy/snow-capped peak","example[18]":"The snow-capped peaks of the Sorondo mountain range provide a dramatic backdrop.","collocation[8]":"a jagged peak","example[19]":"At first all I could see was the hazy black outline of a jagged peak.","collocation[9]":"a rocky peak","example[20]":"The Castle is situated on a rocky peak.","collocation[10]":"a distant peak","example[21]":"The mist cleared to reveal the distant peaks across the valley.","definition[5]":"to reach the highest point or level","example[22]":"Sales peaked in August, then fell sharply.","example[23]":"Wind speeds peaked at 105 mph yesterday.","note[2]":"peak at","definition[6]":"used to talk about the best, highest, or greatest level or amount of something","example[24]":"Gasoline prices are 14% below the peak level they hit in November.","example[25]":"a shampoo designed to keep your hair in peak condition","example[26]":"If you phone during the day you pay the peak rate for calls.","example[27]":"periods of peak demand for electricity","definition[7]":"the peak time or period is when the greatest number of people are doing the same thing, using the same service etc","example[28]":"Extra buses run at peak times.","example[29]":"Hotel prices rise during the peak season.","definition[8]":"the time when prices, shares etc have reached their highest point or level","example[30]":"The company’s share of overseas assets reached a peak two years ago.","example[31]":"It estimates that the value of its land is now 60 percent below its peak.","example[32]":"The number of cars produced fell from a peak of 800 in 2004 to 650 this year.","note[3]":"peak of","example[33]":"The FTSE 100 climbed to 2577.1, just below the intraday peak (=the highest point on a particular trading day) of 2580.1.","definition[9]":"the highest level etc something reaches","example[34]":"Many Japanese investors bought property at peak prices just before values began to slump.","example[35]":"The company expects to hit peak production in two years’ time.","definition[10]":"the time when the greatest number of people in a country are doing the same thing, using the same service etc","example[36]":"There are extra trains at peak times.","example[37]":"The Bundesbank president declined to say whether German interest rates had peaked.","example[38]":"European metal dealers have been buying copper only as needed while waiting for prices to peak out.","example[39]":"Sources estimate that output from the oilfield will peak at about 25,000 barrels a day.","example[40]":"The company’s stock peaked at $11.50."}