{"word[0]":"personal","definition[0]":"belonging or relating to one particular person, rather than to other people or to people in general","example[0]":"My personal view is that we shouldn’t offer him the job.","example[1]":"Style and colour are a matter of personal taste.","example[2]":"She took full personal responsibility for all the arrangements.","example[3]":"When I went to her room all her personal belongings had gone.","example[4]":"After Nelson’s death, his mother received his personal effects.","example[5]":"I know from personal experience that you can’t trust Trevor.","example[6]":"the personal qualities needed to be successful in business","example[7]":"The car is for personal use only.","example[8]":"On a personal level he felt sympathy for them, but he had a job to do.","example[9]":"celebrities with their own personal trainer","definition[1]":"relating to the private areas of your life","example[10]":"I don’t answer questions about my personal life.","example[11]":"May I ask you a personal question?","example[12]":"the records will include other personal details such as nationality, date of birth and address","example[13]":"He’s got a few personal problems at the moment.","example[14]":"The envelope was marked ‘Personal and Confidential’.","example[15]":"We’re not allowed to make personal phone calls at work.","definition[2]":"involving rude or upsetting criticism of someone","example[16]":"It’s unprofessional to make such personal remarks.","example[17]":"a bitter personal attack on the president","example[18]":"There’s no need to get personal!","example[19]":"It’s nothing personal, I just have to go home now.","note[0]":"(it’s) nothing personal","definition[3]":"if you give something your personal care or attention, you deal with it yourself instead of asking someone else to do it","example[20]":"Small companies can devote more personal attention to each project.","example[21]":"As you get promoted in a firm you lose that personal contact  (=meeting and dealing with people yourself).","definition[4]":"relating to your body or the way you look","example[22]":"Grant was always fussy about his personal appearance.","example[23]":"the importance of personal hygiene","heading[0]":"– Meaning 1: belonging or relating to one particular person, rather than to other people or to people in general","collocation[0]":"somebody’s personal view/opinion","example[24]":"My personal opinion is that the project was started too soon.","collocation[1]":"somebody’s personal possessions/belongings/property","example[25]":"All personal belongings should be clearly marked with the owner’s name.","collocation[2]":"somebody’s personal effects (formal)","example[26]":"After his suicide, his mother received his personal effects.","collocation[3]":"personal taste/preference","example[27]":"What you plant in your garden is ultimately a matter of personal preference.","collocation[4]":"personal qualities","example[28]":"They stress the importance of a teacher’s personal qualities.","collocation[5]":"personal experience","example[29]":"I have had personal experience of unemployment.","collocation[6]":"a personal relationship","example[30]":"It’s important to establish a good personal relationship with the voters.","collocation[7]":"a personal interest in something","example[31]":"He took a personal interest in the case.","collocation[8]":"for (your) personal use","example[32]":"He bought a computer for his personal use.","collocation[9]":"on a personal level","example[33]":"On a personal level, it’s been a very positive experience.","heading[1]":"– Meaning 2: relating to the private areas of your life","collocation[10]":"somebody’s personal life","example[34]":"I’ve got to maintain a balance between my personal life and my work.","collocation[11]":"personal details","example[35]":"Fill in your personal details.","collocation[12]":"personal problems","example[36]":"Counselors can give assistance to students with personal problems.","collocation[13]":"a personal question","example[37]":"That’s a rather personal question.","collocation[14]":"a personal call","example[38]":"Are you sure your boss doesn’t mind your using the telephone for personal calls?","collocation[15]":"for personal reasons","example[39]":"The company’s chief executive has resigned for personal reasons."}