{"word[0]":"related","definition[0]":"things that are related are connected in some way","example[0]":"Police now believe that the three crimes could be related.","example[1]":"the problem of drug abuse and other related issues","example[2]":"Education levels are strongly related to income.","note[0]":"closely/directly/strongly etc related","example[3]":"people suffering from tobacco-related illnesses","note[1]":"drug-/pollution-/stress-related etc","example[4]":"He suffers with memory loss related to his disease.","note[2]":"related to","definition[1]":"connected by a family relationship","example[5]":"Are you two related?","example[6]":"I might be related to him.","definition[2]":"animals, plants, languages etc that are related belong to the same group","example[7]":"Dolphins and porpoises are closely related.","collocation[0]":"closely related","example[8]":"I want to focus on a small number of closely related questions.","collocation[1]":"strongly related","example[9]":"People’s occupations are strongly related to their level of education.","collocation[2]":"intimately related","example[10]":"Learning to read and learning to write are intimately related.","collocation[3]":"directly/indirectly related","example[11]":"illnesses which are directly related to poverty","collocation[4]":"loosely related","example[12]":"a series of loosely related ideas","collocation[5]":"inversely related","example[13]":"The demand for bank lending is inversely related to the rate of interest charged.","display[0]":"related/connected","definition[3]":"used about things that have a connection with each other. Connected is not used before a noun","example[14]":"Physics and Maths are closely related.","example[15]":"The two problems are connected.","example[16]":"homelessness and other related issues","display[1]":"linked","definition[4]":"having a direct connection – often used when one thing is the cause of the other","example[17]":"Skin cancer is directly linked to sun exposure and damage.","example[18]":"Two closely linked factors produced this result.","display[2]":"interrelated/interconnected","definition[5]":"used about two or more things that are connected with each other and affect each other in a complicated series of ways","example[19]":"The various parts of society are closely interrelated.","example[20]":"The book consists of a series of interconnected essays.","display[3]":"interdependent","definition[6]":"used about two or more things, countries, people etc that depend on each other, and cannot exist or continue without each other","example[21]":"The two countries’ economies have become increasingly interdependent.","example[22]":"interdependent relationships between species","example[23]":"Darwin said that all life on Earth is interdependent.","display[4]":"relevant","definition[7]":"related to what is being discussed or to a particular area of activity","example[24]":"The exam tests the way you select and organize information relevant to the question.","example[25]":"Applicants should have several years’ relevant experience.","display[5]":"be bound up with something","definition[8]":"to be very closely connected – used about two things that need to be considered together","example[26]":"The history of the city has long been bound up with the sea.","example[27]":"Your professional development is closely bound up with personal growth.","definition[9]":"directly connected with or affected by something","example[28]":"The drop in sales was related to the end of a tax break on new cars.","example[29]":"The company agreed to sell its real estate business and other related assets.","example[30]":"Stocks were hit by earnings-related selling."}