{"word[0]":"option","signpost[0]":"choice","definition[0]":"a choice you can make in a particular situation","example[0]":"There are a number of options available.","example[1]":"He had two options.","example[2]":"This was not the only option open to him.","example[3]":"Teenage mothers often have no option but to (=have no other choice except to) live with their parents.","example[4]":"Another option is to rent somewhere for six months.","note[0]":"one/another option is to do something","example[5]":"a range of options for cutting costs","note[1]":"option for","example[6]":"She had the option of staying for an extra year.","note[2]":"option of doing something","definition[1]":"one of the possible choices you can make when using computer software","example[7]":"Select an option from the main menu.","example[8]":"a list of options","signpost[1]":"right to buy/sell","definition[2]":"the right to buy or sell something in the future","example[9]":"Connor now owns 302,000 shares and options.","example[10]":"The government has agreed to buy 20 planes, with an option on a further 10.","note[3]":"option on","signpost[2]":"at school/university","definition[3]":"one of the subjects that you can choose to study at school for an examination, or as part of a course at a college or university","example[11]":"advice on choosing your options","signpost[3]":"something additional","definition[4]":"something that is offered in addition to the standard equipment when you buy something new, especially a car","collocation[0]":"have an option","example[12]":"At the moment, children have the option of leaving school at 16.","example[13]":"In a situation like this, you have two options.","collocation[1]":"give/offer somebody an option","example[14]":"Some employees were given the option of retiring early.","example[15]":"Buyers will usually be offered the option of paying in instalments.","collocation[2]":"choose an option","example[16]":"Fewer women are choosing the option of motherhood.","collocation[3]":"go for an option","example[17]":"Which option do you think they'll go for?","collocation[4]":"take (up) an option","example[18]":"America was persuaded not to take up the option of military action.","collocation[5]":"look at an option","example[19]":"You have to look at every option as your business develops.","collocation[6]":"limit your options","example[20]":"If you don’t go to college, it may limit your options.","collocation[7]":"a good/better option","example[21]":"Renting a house may be a better option than buying.","collocation[8]":"an attractive option","example[22]":"If time is short, taking the car to northern France is an attractive option.","collocation[9]":"a realistic/real/serious option","example[23]":"I wanted to start my own business but financially it was never a realistic option.","collocation[10]":"a viable/practical option","example[24]":"Surgery may be a viable option when all else fails.","collocation[11]":"a popular option","example[25]":"Independent sixth-form colleges are becoming a popular option.","collocation[12]":"a cheap option","example[26]":"We urgently need to find a cheaper option than oil or gas.","collocation[13]":"a safe option","example[27]":"A special savings account can be a safe option.","collocation[14]":"somebody’s preferred option","example[28]":"The new scheme appears to be the airport management’s preferred option.","collocation[15]":"an easy option","example[29]":"For most people, divorce is never an easy option.","collocation[16]":"an option is open/available to somebody","example[30]":"Giving a prison sentence is only one of the options open to the judge.","collocation[17]":"keep/leave your options open","example[31]":"Studying a broad range of subjects helps to keep your options open.","collocation[18]":"have no/little option but to do something","example[32]":"I had no option but to fire him.","collocation[19]":"a range of options","example[33]":"The council is considering a range of options for improving the city’s transport system.","definition[5]":"a choice between two or more possible things, for example products","example[34]":"Choosing between the available options in mobile phones is very confusing.","definition[6]":"something that is offered in addition to the standard equipment when you buy something, especially a car","example[35]":"Passenger airbags are available as standard or as an option on all of its cars.","definition[7]":"one of the possible choices you can make when using a computer program","example[36]":"the split-screen option","definition[8]":"when an organization buys something, the possibility that it will buy more later","example[37]":"The Spanish air force is due to take 87 of the aircraft, with an option for a further 16.","note[4]":"option for/on","example[38]":"Shanghai Aviation agreed to buy 26 MD-80s and took options on 15 others.","definition[9]":"the right to buy or sell shares, bonds, currencies, or COMMODITIES (=oil, metals, farm products etc) at a particular price within a particular period of time or on a particular date in the future","example[39]":"Options allow an investor to bet on moves in large amounts of currencies using relatively small stakes.","example[40]":"Each crude-oil options contract entitles its holder to buy or sell the equivalent of 1,000 barrels of oil at a predetermined price.","example[41]":"The stock price fell and the option expired (=came to the end of the period of time when it could be used)."}