{"word[0]":"window","definition[0]":"a space or an area of glass in the wall of a building or vehicle that lets in light","note[0]":"bedroom/kitchen etc window","example[0]":"Do you mind if I open the window?","note[1]":"open/close/shut a window","example[1]":"She looked out of the window to see if it was raining.","note[2]":"out of/from/through the window","example[2]":"The sun was shining through the windows.","example[3]":"We were looking at the Christmas displays in the shop windows.","note[3]":"in the window","definition[1]":"one of the separate areas on a computer screen where different programs are operating","definition[2]":"a short period of time that is available for a particular activity","example[4]":"Delay might open a window of opportunity for their rivals.","definition[3]":"an area on an envelope with clear plastic in it which lets you see the address written on the letter inside the envelope","collocation[0]":"open a window","example[5]":"I opened the window and breathed in the fresh air.","collocation[1]":"close/shut a window","example[6]":"She shut the window firmly.","collocation[2]":"roll up/down a window","example[7]":"Lucy rolled the window down and waved to him.","collocation[3]":"look/gaze/stare out of the window","example[8]":"Mom stared out of the window at the road.","form[0]":"ADJECTIVES/NOUN + window","example[9]":"A breeze from the open window lifted her hair.","collocation[4]":"closed/shut","example[10]":"All the windows were closed.","collocation[5]":"a front window","example[11]":"I don't want people looking in my front window.","collocation[6]":"a back window","example[12]":"The burglar had got in through one of the back windows.","collocation[7]":"the rear window","example[13]":"The car's rear window had been bashed in.","collocation[8]":"a shop/store window","example[14]":"She looked in shop windows.","collocation[9]":"somebody's bedroom/office window","example[15]":"From his bedroom window he could see two men having an argument.","collocation[10]":"the kitchen/car etc window","example[16]":"She had left the kitchen window open.","collocation[11]":"a stained glass window","example[17]":"The church has fine medieval stained glass windows.","form[1]":"window + NOUN","collocation[12]":"the window frame","example[18]":"The window frame was rotten.","definition[4]":"one of the separate areas on a computer screen where different processes or programs are operating","example[19]":"You can make a window larger or smaller by dragging its corner with the mouse.","example[20]":"There is a 12- to 24-month buying window in the domestic real estate markets before prices start going up again.","definition[5]":"if a product is in the window, it is on display at the front of a shop to encourage customers to come in","example[21]":"A customer may ask to buy some goods displayed in the window."}