{"word[0]":"hack","definition[0]":"to cut something roughly or violently","example[0]":"Both men had been hacked to death  (=killed using large knives).","example[1]":"She hacked away at the ice, trying to make a hole.","note[0]":"hack (away) at something","example[2]":"Whole forests have been hacked down.","note[1]":"hack something off/down etc","example[3]":"He hacked his way through the undergrowth.","note[2]":"hack your way through/into something","definition[1]":"to secretly find a way of getting information from someone else’s computer or changing information on it","example[4]":"He managed to hack the code.","example[5]":"Somebody hacked into the company’s central database.","note[3]":"hack into","definition[2]":"to ride a horse along roads or through the country","definition[3]":"to cough in a loud unpleasant way","definition[4]":"a writer who does a lot of low-quality work, especially writing newspaper articles","example[6]":"A Sunday newspaper hack uncovered the story.","definition[5]":"an unimportant politician","example[7]":"The meeting was attended by the usual old party hacks.","definition[6]":"a way of using a computer to get into someone else’s computer system without their permission","definition[7]":"a taxi, or a taxi driver","definition[8]":"an act of hitting something roughly with a cutting tool","example[8]":"One more hack and the branch was off.","definition[9]":"an old tired horse","definition[10]":"a horse you can pay money to ride on","definition[11]":"a ride on a horse","example[9]":"a long hack across the fields","definition[12]":"to secretly reach information on someone else’s computer system so that you can look at, use, or change it","example[10]":"The police are investigating a series of computer crimes involving people thought to have hacked confidential databases.","example[11]":"He didn’t have to hack into my personal computer to get the information.","definition[13]":"a writer who does a lot of low quality work, especially writing newspaper articles","definition[14]":"a taxi, or someone whose job is to drive a taxi"}