{"word[0]":"decay","definition[0]":"to be slowly destroyed by a natural chemical process, or to make something do this","example[0]":"Her body was already starting to decay.","example[1]":"Most archaeological finds are broken, damaged, or decayed.","example[2]":"decaying organic matter","explanation[0]":"In everyday English, people usually say rot rather than decay when talking about food:","example[3]":"There was a smell of rotting vegetables.","definition[1]":"if buildings, structures, or areas decay, their condition gradually becomes worse","example[4]":"Hundreds of historic buildings are being allowed to decay.","example[5]":"Britain’s decaying inner cities","definition[2]":"if traditional beliefs, standards etc decay, people do not believe in them or support them anymore","synonym[0]":"decline","example[6]":"In Orthodox Europe, mass religion seems to have decayed less.","definition[3]":"to be slowly destroyed by a natural chemical process – use this especially about natural things such as wood or plants, or about teeth","example[7]":"The leaves decay and enrich the soil.","example[8]":"He had bad breath and decaying teeth.","example[9]":"The fabric slowly began to decay.","display[0]":"rot","definition[4]":"to decay. Rot is less formal than decay and is more common in everyday English","example[10]":"The fruit was left to rot on the ground.","example[11]":"rotting teeth","example[12]":"Most of the wood under the paint had rotted.","example[13]":"the smell of rotting vegetation  (=decaying leaves and plants)","display[1]":"go off","definition[5]":"if food goes off, it starts to smell bad and is no longer be safe to eat","example[14]":"I think the milk’s gone off.","example[15]":"The meat smells as if it's gone off.","display[2]":"spoil","definition[6]":"if food spoils, it starts to decay, so that it is no longer safe to eat. Spoil is more formal and is less common in everyday British English than go off","example[16]":"Food left in the sun will quickly start to spoil.","display[3]":"go mouldy","definition[7]":"to begin to have a soft green or black substance growing on the surface of the food, so that it is not good to eat anymore","example[17]":"Ugh, the cheese has gone mouldy!","display[4]":"decompose","definition[8]":"to decay – use this especially about dead plants or flesh","example[18]":"leaves decomposing on the forest floor","display[5]":"putrefy","definition[9]":"to decay and have a very bad smell – use this especially about flesh or plants","example[19]":"After two days, the body was already beginning to putrefy.","example[20]":"putrefying meat","display[6]":"biodegrade","definition[10]":"to decay naturally into substances that do not harm the environment – use this especially about man-made materials and chemicals","example[21]":"Unlike many other materials, plastic does not biodegrade.","definition[11]":"the natural chemical change that causes the slow destruction of something","example[22]":"old cars in various stages of decay","example[23]":"tooth decay","definition[12]":"the gradual destruction of buildings, structures etc because they have not been cared for","example[24]":"poverty and urban decay","example[25]":"During the war, the area fell into decay.","note[0]":"fall into (a state of) decay","definition[13]":"the gradual destruction of ideas, beliefs, social or political systems etc","example[26]":"moral decay","collocation[0]":"cause decay","example[27]":"Bacteria stick to food and cause decay.","collocation[1]":"prevent decay","example[28]":"You can use a preservative on the wood to prevent further decay.","form[0]":"ADJECTIVES/NOUN + decay","collocation[2]":"tooth/dental decay","example[29]":"Eating too much sugar causes tooth decay.","collocation[3]":"natural decay","example[30]":"Everything in our environment is subject to natural decay.","collocation[4]":"the process of decay","example[31]":"The natural processes of decay gradually destroys archaeological sites.","collocation[5]":"a sign of decay","example[32]":"I couldn't see any signs of decay on the fruit."}