{"definition[0]":"to make something smaller or less in size, amount, or price","example[0]":"The governor announced a new plan to reduce crime.","example[1]":"The helmet law should reduce injuries in motorcycle accidents.","example[2]":"Small businesses will need to reduce costs in order to survive.","example[3]":"The workforce has been reduced by half.","note[0]":"reduce something by something","example[4]":"All the shirts were reduced to £10.","note[1]":"reduce something (from something) to something","example[5]":"The new bridge should reduce travelling time from 50 minutes to 15 minutes.","definition[1]":"if you reduce a liquid, or if it reduces, you boil it so that there is less of it","definition[2]":"to become thinner by losing weight","collocation[0]":"greatly/substantially/considerably reduce","example[6]":"He has greatly reduced the political power of the armed forces.","collocation[1]":"significantly reduce","example[7]":"Their symptoms were significantly reduced.","collocation[2]":"dramatically/drastically reduce","example[8]":"They are committed to drastically reducing the size and cost of government.","collocation[3]":"sharply reduce","example[9]":"Medical progress has sharply reduced death rates.","collocation[4]":"gradually reduce","example[10]":"The aim is to gradually reduce the number of troops in the area.","heading[0]":"to reduce prices, numbers, or amounts","definition[3]":"to make the price, amount, or size of something less or smaller","example[11]":"The price was reduced by 50%.","example[12]":"We need to reduce the amount of salt in our diet.","definition[4]":"to reduce something, especially by a large amount – used about prices, costs, jobs, or the time needed to do something","example[13]":"Companies are always looking for ways to cut costs.","example[14]":"The journey time will be cut to under 2 hours.","example[15]":"Staff numbers have been cut by half to about 150.","definition[5]":"to reduce the level, limit, or amount of something. Lower sounds rather formal","example[16]":"The voting age was lowered to 18.","example[17]":"The government decided to lower interest rates by 0.5%.","example[18]":"After twenty minutes, lower the temperature to 150 degrees.","display[0]":"bring something down","definition[6]":"to reduce something such as prices or costs, or reduce the level of something. Bring something down is less formal than lower","example[19]":"The government wants to bring down the level of inflation.","example[20]":"The company is trying to bring its costs down.","display[1]":"slash","definition[7]":"to reduce an amount or price by a very large amount – used especially in newspapers and advertisements","example[21]":"Public spending has been slashed over the past two years.","example[22]":"Prices slashed for one week only!","display[2]":"cut something back","definition[8]":"to reduce the amount of something – used especially about people deciding to spend less, do less, or use less of something","example[23]":"The education budget has been cut back again.","example[24]":"I need to cut back on my workload.","display[3]":"downsize","definition[9]":"to reduce the number of people employed in order to reduce costs – used about a company or organization","example[25]":"The company is planning to downsize its European operations.","display[4]":"scale something down/back","definition[10]":"to reduce the size or the amount of money that is being spent on something","example[26]":"The research programme has been scaled down.","example[27]":"The navy is being scaled down.","display[5]":"relieve/ease","definition[11]":"to make pain or feelings less unpleasant","example[28]":"The drug is used to relieve pain.","example[29]":"A joke can help to ease the tension.","display[6]":"alleviate","definition[12]":"to reduce pain or suffering, or make a problem less serious","example[30]":"You can buy various medicines to alleviate the symptoms of flu.","example[31]":"The new road was supposed to alleviate the congestion problem.","definition[13]":"to make something less or smaller in price, amount, or size","example[32]":"Jobs have been cut in order to reduce costs.","example[33]":"Prices have been reduced by 20%.","example[34]":"The flight had been reduced to £99."}