{"word[0]":"pull","signpost[0]":"move something towards you","definition[0]":"to use your hands to make something or someone move towards you or in the direction that your hands are moving","example[0]":"Mom! Davey’s pulling my hair!","example[1]":"She pulled open the door and hurried inside.","note[0]":"pull something open/shut","example[2]":"He pulled her down into her seat.","note[1]":"pull somebody/something into/away from/over etc something","signpost[1]":"remove","definition[1]":"to use force to take something from the place where it is fixed or held","example[3]":"She has to have two teeth pulled.","example[4]":"Vicky had pulled the arm off her doll.","note[2]":"pull something out/off/away etc","signpost[2]":"make something follow you","definition[2]":"to be attached to something or hold something and make it move behind you in the direction you are going","example[5]":"a tractor pulling a trailer","signpost[3]":"take something out","definition[3]":"to take something out of a bag, pocket etc with your hand","note[3]":"pull a gun/knife (on somebody) (=take one out, ready to use it)","example[6]":"He pulled out his wallet and said ‘let me pay’.","example[7]":"Ben pulled a pen from his pocket.","definition[4]":"to put on or take off a piece of clothing, usually quickly","example[8]":"He pulled off his damp shirt.","note[4]":"pull on/off/up/down etc","signpost[4]":"move your body","definition[5]":"to move your body or part of your body away from someone or something","example[9]":"She tried to pull her hand free, but it was held fast.","note[5]":"pull something away/free","example[10]":"She struggled fiercely, trying to pull her arm out of his grasp.","note[6]":"pull something out of/from something","example[11]":"She pulled away from him.","note[7]":"pull away/back","definition[6]":"to hold onto something and use your strength to move your body towards it","example[12]":"Benny pulled himself up from the floor with difficulty.","signpost[5]":"muscle","definition[7]":"to injure one of your muscles by stretching it too much during physical activity","synonym[0]":"strain","example[13]":"Paul pulled a muscle trying to lift the freezer.","signpost[6]":"trick/crime","definition[8]":"to succeed in doing something illegal or dishonest or in playing a trick on someone","example[14]":"The gang have pulled another bank robbery.","example[15]":"He was trying to pull a fast one (=deceive you) when he told you he’d paid.","example[16]":"Don’t you ever pull a stunt like that again!","note[8]":"pull a stunt/trick/joke","signpost[7]":"switch","definition[9]":"to move a control such as a switch, lever, or trigger towards you to make a piece of equipment work","example[17]":"She raised the gun, and pulled the trigger.","signpost[8]":"crowd/votes etc","definition[10]":"if an event, performer etc pulls crowds or a politician pulls a lot of votes, a lot of people come to see them or vote for them","example[18]":"Muhammad Ali can still pull the crowds.","signpost[9]":"attract/influence","definition[11]":"to attract or influence someone or their thoughts or feelings","example[19]":"The city’s reputation for a clean environment has pulled new residents from other states.","signpost[10]":"sexually attract","definition[12]":"to attract someone in order to have sex with them or spend the evening with them","example[20]":"He knew he could pull any girl he wanted.","signpost[11]":"stop event","definition[13]":"to stop a planned event from taking place","example[21]":"They pulled the concert.","signpost[12]":"stop a vehicle","definition[14]":"to drive a vehicle somewhere and stop, or to make a vehicle gradually slow down and stop","example[22]":"The bus pulled to a halt.","example[23]":"She pulled the car into a side street.","note[9]":"pull something into/towards/down etc something","definition[15]":"if a car pulls to the left or right as you are driving, it moves in that direction because of a problem with its machinery","signpost[13]":"beer","definition[16]":"to get beer out of a barrel by pulling a handle","example[24]":"The barman laughed and began to pull a couple of pints.","signpost[14]":"cricket/golf/baseball","definition[17]":"to hit the ball in cricket, golf, or baseball so that it does not go straight but moves to one side","signpost[15]":"row a boat","definition[18]":"to make a boat move by using oars","definition[19]":"to make something or someone move in the direction that your hands are moving","example[25]":"He pulled her towards him and kissed her.","example[26]":"Sam was pulling on his socks.","display[0]":"tug","definition[20]":"to pull something suddenly with a short quick movement, often to get someone’s attention","example[27]":"‘Look, ’ he said, tugging at his brother’s sleeve.","example[28]":"I tugged at the drawer but it wouldn’t open.","display[1]":"drag","definition[21]":"to pull something along the ground, especially because it is heavy","example[29]":"If we can’t lift the piano, we’ll have to drag it.","display[2]":"haul","definition[22]":"to pull something big and heavy using a lot of effort, especially upwards and using a rope","example[30]":"They hauled their boats further up the beach.","example[31]":"fishermen hauling in their nets","display[3]":"heave","definition[23]":"to pull or lift something very heavy, especially with one movement","example[32]":"He heaved the sack of sand onto his shoulder.","display[4]":"draw","definition[24]":"to pull something or someone gently in a particular direction","example[33]":"Lisa reached for his hand but he drew it away.","definition[25]":"to be attached to a vehicle or piece of machinery and make it move behind you in the direction you are going","example[34]":"Ten dogs were pulling a sledge over the ice.","example[35]":"a tractor pulling a plough","display[5]":"tow","definition[26]":"to pull a vehicle behind – used about a vehicle, a boat, or a horse pulling something using a rope or chain","example[36]":"The car in front of us was towing a caravan.","example[37]":"Horses were used to tow the boats along the canals.","definition[27]":"to pull a vehicle such as a carriage – used especially about horses doing this","example[38]":"a carriage drawn by four horses","example[39]":"a horse-drawn cart","signpost[16]":"act of moving something","definition[28]":"an act of using force to move something towards you or in the same direction that you are moving","example[40]":"He gave her a sharp pull forward.","definition[29]":"a strong physical force that makes things move in a particular direction","example[41]":"the gravitational pull of the Moon","signpost[17]":"attraction","definition[30]":"the ability to attract someone or have a powerful effect on them","example[42]":"After about a year I gave in to the pull of fatherhood.","note[10]":"pull of","signpost[18]":"influence","definition[31]":"special influence or power over other people","example[43]":"His family’s name gives him a lot of pull in this town.","signpost[19]":"climb","definition[32]":"a difficult climb up a steep road","example[44]":"It was a long pull up the hill.","definition[33]":"an injury to one of your muscles, caused by stretching it too much during exercise","example[45]":"a groin pull","signpost[20]":"smoke/drink","definition[34]":"an act of taking the smoke from a cigarette, pipe etc into your lungs or of taking a long drink of something","example[46]":"She took a long pull on her cigarette.","note[11]":"pull on/at","signpost[21]":"handle","definition[35]":"a rope or handle that you use to pull something","example[47]":"He popped the ring pull on another can of lager.","definition[36]":"a way of hitting the ball in cricket, golf, or baseball so that it does not go straight, but moves to one side"}