{"definition[0]":"feeling angry, jealous, and upset because you think you have been treated unfairly","example[0]":"a bitter old man","example[1]":"I feel very bitter about it.","note[0]":"bitter about","definition[1]":"making you feel very unhappy and upset","example[2]":"His photo stirred up bitter memories.","example[3]":"If he failed, it would be a bitter disappointment to his parents.","note[1]":"a bitter disappointment/blow","example[4]":"She knew from bitter experience that it would be impossible to talk it over with Julian.","note[2]":"from bitter experience","definition[2]":"a bitter argument, battle etc is one in which people oppose or criticize each other with strong feelings of hate and anger","example[5]":"The couple are locked in a bitter battle for custody of the children.","note[3]":"bitter dispute/battle/struggle etc","example[6]":"The government faces bitter opposition to these policies.","example[7]":"The countries are still bitter enemies.","definition[3]":"having a strong sharp taste, like black coffee without sugar","example[8]":"Enjoy the beer’s bitter taste as you slowly drink it.","example[9]":"bitter chocolate","definition[4]":"unpleasantly cold","example[10]":"a bitter wind","example[11]":"the bitter cold of the Midwestern winters","heading[0]":"– Meaning 3: a bitter argument, battle etc is one in which people oppose or criticize each other with strong feelings of hate and anger","collocation[0]":"a bitter battle/dispute","example[12]":"There was a bitter battle over the building of the new airport.","collocation[1]":"a bitter fight/struggle","example[13]":"The law was passed after a bitter fight that lasted nearly a decade.","collocation[2]":"a bitter conflict","example[14]":"The stage is set for a bitter conflict with trade unions.","collocation[3]":"a bitter debate/argument","example[15]":"The country now faces a bitter debate over the issue.","collocation[4]":"bitter disagreement","example[16]":"There were reports of bitter disagreement between the European Communities.","collocation[5]":"bitter opposition","example[17]":"The new tax aroused bitter opposition.","collocation[6]":"a bitter rival/enemy","example[18]":"The two men are bitter rivals for the party leadership.","definition[5]":"having a strong sharp taste that is not sweet, like black coffee without sugar – used especially about chocolate, medicine etc","example[19]":"The dessert is made with a slightly bitter chocolate.","example[20]":"Hops give beer its distinctive bitter taste.","example[21]":"The medicine tasted bitter.","example[22]":"As the lettuce gets older, the leaves become more bitter.","definition[6]":"having a taste that makes your tongue sting slightly","example[23]":"Rhubarb has quite a sharp taste.","example[24]":"The cheese has a pleasing colour and a pleasantly sharp flavour.","display[0]":"sour","definition[7]":"having a usually unpleasant sharp acid taste, like the taste of a lemon, or a fruit that is not ready to be eaten – used especially about fruit, or about liquids that have gone bad","example[25]":"Some people say that the purpose of the lemon’s sour taste is to stop the fruit being eaten by animals.","example[26]":"Rachel sampled the wine. It was sour.","display[1]":"acidic","definition[8]":"very sour – used especially about liquids or things made with fruits such as oranges, lemons, or grapes","example[27]":"Some fruit juices taste a bit acidic.","display[2]":"tangy","definition[9]":"having a taste that is pleasantly strong or sharp, and that often tastes a little sweet as well","example[28]":"The ribs are cooked in a tangy barbecue sauce.","display[3]":"tart","definition[10]":"having a taste that lacks sweetness – used especially about fruit such as apples, which you need to add sugar to","example[29]":"The pudding had rather a tart flavour.","example[30]":"The trees were covered with tart wild plums.","definition[11]":"a type of dark beer that is popular in Britain, or a glass of this","example[31]":"A pint of bitter, please."}