{"word[0]":"swing","past_tense[0]":"swung","signpost[0]":"move from a fixed point","definition[0]":"to make regular movements forwards and backwards or from one side to another while hanging from a particular point, or to make something do this","example[0]":"Let your arms swing as you walk.","example[1]":"a sign swinging in the wind","example[2]":"He was swinging his bag back and forth.","example[3]":"She swung her legs from side to side.","example[4]":"He marched around, swinging the gun by its handle.","note[0]":"swing something by something","signpost[1]":"move in a curve","definition[1]":"to move quickly in a smooth curve in one direction, or to make something do this","example[5]":"A black car swung into the drive.","example[6]":"Kate swung her legs out of bed.","example[7]":"Swinging her bag over her shoulder, she hurried on.","example[8]":"The heavy door swung shut.","note[1]":"swing open/shut","definition[2]":"to move your arm or something you are holding to try and hit something","example[9]":"She swung her bag at him.","note[2]":"swing something at somebody/something","example[10]":"Garson swung at the ball and missed.","note[3]":"swing at somebody/something (with something)","example[11]":"He started swinging at me with his fists.","signpost[2]":"change opinions/emotions","definition[3]":"if emotions or opinions swing, or if something swings them, they change quickly to the opposite of what they were","note[4]":"swing to the Right/Left (=in politics)","example[12]":"Do campaign gifts swing votes?","example[13]":"The war had begun to swing in Britain’s favor.","example[14]":"His mood could swing from joy to despair.","note[5]":"swing from something to something","signpost[3]":"play","definition[4]":"to sit on a swing and make it move backwards and forwards by moving your legs","signpost[4]":"arrange something","definition[5]":"to arrange for something to happen, although it takes a lot of effort to do this","example[15]":"We managed to swing it so that they will travel together.","signpost[5]":"seat with ropes","definition[6]":"a seat hanging from ropes or chains, usually used by children to play on by moving it forwards and backwards using their legs","example[16]":"kids playing on the swings","example[17]":"a porch swing","definition[7]":"a curved movement made with your arm, leg etc","example[18]":"He took a swing at  (=tried to hit) my head and missed.","example[19]":"the swing of her hips as she walked","definition[8]":"a noticeable change in opinions or emotions","example[20]":"She suffers from mood swings.","example[21]":"a big swing towards right-wing ideology","note[6]":"swing to/towards/between etc","definition[9]":"the movement you make when you hit the ball in golf, baseball, or some other sports","example[22]":"I spent months correcting my swing.","definition[10]":"a type of dance music played by a big band in the 1930s and 1940s that is similar to jazz","definition[11]":"to change from one level, rate, or position to another so that a situation is the opposite of what it was before","example[23]":"If the economy swings from recession into recovery, the banks’ problems will ease significantly.","example[24]":"Prices swung over a wide range, dropping in early trading to $1,383 before recovering.","definition[12]":"a sudden and noticeable change in the level, rate, or position of something","example[25]":"Changes in revenue could produce largeearnings swings.","example[26]":"Investor uncertainty is likely to translate intoprice swings."}