{"word[0]":"site","definition[0]":"a place where something important or interesting happened","example[0]":"an archaeological site","example[1]":"The house is built on the site of a medieval prison.","note[0]":"site of","example[2]":"the site of the air crash","definition[1]":"an area of ground where something is being built or will be built","example[3]":"He managed to get himself a job on a building site.","note[1]":"building/construction site","example[4]":"the site of a proposed missile base","note[2]":"site of/for","example[5]":"a site for a new airport","definition[2]":"a place that is used for a particular purpose","example[6]":"a camping site","example[7]":"a nesting site for birds","definition[3]":"a website","form[0]":"ADJECTIVES/NOUN + site","example[8]":"Archaeological sites are often discovered by accident.","collocation[0]":"a historic site","example[9]":"There are numerous historic sites to visit.","collocation[1]":"an ancient site","example[10]":"The organization maintains and restores ancient sites, castles, monuments etc.","collocation[2]":"a sacred site","example[11]":"Ayers Rock is the most sacred site of the Aborigines.","collocation[3]":"a burial site","example[12]":"A Bronze Age burial site has been discovered.","collocation[4]":"the crash site","example[13]":"Wreckage was seen 200 metres away from the crash site.","collocation[5]":"a bomb site","example[14]":"the bomb sites of war-torn London","collocation[6]":"a building/construction site","example[15]":"He has worked on various building sites.","collocation[7]":"a greenfield site","example[16]":"We want to shift the balance of housing development from greenfield to brownfield sites.","collocation[8]":"a brownfield site","example[17]":"The majority of the houses will be built on brownfield sites.","collocation[9]":"a camp/camping site","example[18]":"First they had to look for a camp site.","collocation[10]":"a caravan site","example[19]":"A well-run caravan site near the river brings holidaymakers into the village.","collocation[11]":"a landfill site","example[20]":"Recycling reduces the volume of waste which goes into landfill sites.","collocation[12]":"an industrial site","example[21]":"The area is to be redeveloped as an industrial site.","collocation[13]":"a missile site","example[22]":"There were photos of a missile site under construction.","collocation[14]":"a nesting site","example[23]":"Normally the male swan won’t let other swans near his nesting site.","definition[4]":"to place or build something in a particular place","example[24]":"Some of this new housing has been sited in inner city areas.","note[3]":"be sited in/on/at/near etc something","explanation[0]":"Site is usually passive","definition[5]":"an area of ground that is used or is going to be used for a particular purpose","example[25]":"On any building site, falling is the most frequent type of accident.","example[26]":"The Sunnyvale City Council last week approved a 186-unit apartment complex on the 4.5 acre site.","example[27]":"Solectron employs 2,200 people at sites in San Jose and Milpitas.","definition[6]":"a WEBSITE (=place on the Internet where you can find information about something)","definition[7]":"be placed or built in a particular area","example[28]":"The new factory is to be sited in Fort Collins."}