{"word[0]":"journalist","definition[0]":"someone who writes news reports for newspapers, magazines, television, or radio","example[0]":"a well-known journalist and broadcaster","definition[1]":"someone who writes for a newspaper or magazine","example[1]":"She worked as a journalist on the New York Times.","example[2]":"I've always wanted to be a journalist.","display[0]":"reporter","definition[2]":"someone whose job is to find out about news stories and ask questions for a newspaper, television or radio company etc","example[3]":"A crowd of reporters were waiting outside the house all night.","example[4]":"He told reporters that he had no intention of resigning.","display[1]":"correspondent","definition[3]":"someone who writes news articles or does reports about a particular subject, especially a serious one, for a newspaper or news organization","example[5]":"our economics correspondent","example[6]":"a war correspondent","example[7]":"He was the BBC's correspondent in Moscow.","display[2]":"columnist","definition[4]":"someone who writes articles, especially about a particular subject, that appear regularly in a newspaper or magazine","example[8]":"an influential financial columnist","example[9]":"a gossip columnist","display[3]":"hack","definition[5]":"a disapproving word for a journalist, especially one whose work is of low quality","example[10]":"The editor sent one of his hacks to interview the murderer’s girlfriend.","display[4]":"newsman/woman","definition[6]":"a general word for someone who works for a newspaper, especially a reporter or editor","example[11]":"an experienced newspaperman","display[5]":"the press","definition[7]":"newspapers and journalists in general","example[12]":"The press always like a good story about the royal family.","example[13]":"the right-wing press","display[6]":"Fleet Street","definition[8]":"the British press. This phrase comes from the street in London, where many newspapers used to have their offices","example[14]":"Relations between the government and Fleet Street aren't as cosy as they once were."}