{"word[0]":"unfriendly","comparative[0]":"unfriendlier","superlative[0]":"unfriendliest","definition[0]":"not kind or friendly","example[0]":"The old man looked cross and unfriendly.","example[1]":"a lonely unfriendly place","example[2]":"The villagers were really quite unfriendly towards us.","note[0]":"unfriendly to/towards","definition[1]":"not helping or wanting a type of person or thing","example[3]":"We have created cities that are unfriendly to pedestrians.","note[1]":"unfriendly to","definition[2]":"an unfriendly government or nation is one that opposes yours","heading[0]":"person/voice/behaviour","display[0]":"unfriendly/not friendly","definition[3]":"behaving towards someone in a way that shows you are not interested in them or are not ready to talk to them or help them","example[4]":"The hotel staff were unfriendly and unhelpful.","example[5]":"an unfriendly tone of voice","example[6]":"They didn't seem very friendly to strangers.","example[7]":"She gave him an unfriendly glance.","display[1]":"hostile","definition[4]":"very unfriendly, and ready to argue or fight","example[8]":"He was openly hostile towards me when I arrived.","example[9]":"A hostile crowd gathered outside the US embassy.","definition[5]":"behaving towards other people as if you do not like them or care about them","example[10]":"He gave her a cold stare.","example[11]":"a cold voice","display[2]":"frosty","definition[6]":"unfriendly, especially because you are angry with someone","example[12]":"When she spoke, her tone was frosty.","example[13]":"He got a frosty reception from his wife when he finally returned home  (=she was not very friendly towards him).","display[3]":"aloof","definition[7]":"not wanting to talk to other people or spend time with them, especially because you think you are better than them","example[14]":"Some politicians are criticized for being too aloof.","display[4]":"antagonistic","definition[8]":"unfriendly and always trying to start arguments with someone","example[15]":"Why are Kate and John so antagonistic towards each other?","display[5]":"antisocial","definition[9]":"not interested in meeting other people or forming friendly relationships with them","example[16]":"Sorry if I'm being antisocial, but I need to get my work done.","example[17]":"He was an antisocial loner with no friends.","heading[1]":"place/organization","definition[10]":"making you feel as though you are not wanted","example[18]":"The report found that the church can seem unfriendly to outsiders.","display[6]":"unwelcoming","definition[11]":"unfriendly – used especially about the physical characteristics or appearance of something","example[19]":"The entrance to the factory is cold, bare, and unwelcoming.","example[20]":"The new fence is just one example of the city’s attempt to make public spaces unwelcoming to the homeless.","display[7]":"impersonal","definition[12]":"lacking the normal friendly relations between people who work or do business together","example[21]":"I had no desire to work for a large impersonal organization.","example[22]":"They just handed over the keys and walked out – it was all so impersonal.","display[8]":"forbidding","definition[13]":"unfriendly, uncomfortable, and a little frightening, so that you do not want to go there","example[23]":"The school was a rather forbidding building surrounded by a high steel fence."}