{"word[0]":"office","definition[0]":"a building that belongs to a company or an organization, with rooms where people can work at desks","example[0]":"The department occupies an office just a mile from the White House.","example[1]":"Did you go to the office  (=the office where you work) today?","example[2]":"The head office is in Edinburgh.","note[0]":"main/head office","example[3]":"The agency has a network of regional offices.","note[1]":"local/regional office","example[4]":"Office staff need well-designed desks and chairs.","note[2]":"office staff/workers/equipment etc","example[5]":"the increased demand for office space","example[6]":"Have a nice day at the office.","note[3]":"at the office","definition[1]":"a room where someone has a desk and works, on their own or with other people","example[7]":"the manager’s office","example[8]":"Sorry, Ann’s not in her office right now.","example[9]":"Dan shares an office with Lisa.","definition[2]":"an important job or position with power, especially in government","example[10]":"the office of president","example[11]":"A provisional military government took office  (=started in an important job or position).","example[12]":"a five-year term of office  (=period of time working in an important job)","example[13]":"Trujillo held office as finance minister.","note[4]":"hold office","example[14]":"She was celebrating ten years in office.","note[5]":"in office","signpost[0]":"place for information","definition[3]":"a room or building where people go to ask for information, buy tickets etc","example[15]":"the tourist office","note[6]":"information/ticket etc office","example[16]":"Is there a lost property office?","signpost[1]":"doctor","definition[4]":"the place where a doctor or dentist examines or treats people","definition[5]":"used in the names of some government departments","example[17]":"the Foreign Office","example[18]":"the Office of the District Attorney","definition[6]":"a British television comedy that was first broadcast in 2001 and has won Golden Globe and BAFTA awards. The programme is about the lives of workers in the Slough office of a fictional (=not real) paper company called Wernham Hogg, and is filmed in the style of a documentary. The Office was written and directed by Ricky Gervais and Stephen Merchant. Ricky Gervais plays the part of David Brent, the general manager, who thinks he is much more talented and entertaining than he really is. Other actors appearing in the programme include Martin Freeman, Mackenzie Crook, and Lucy Davis. Local versions of The Office have been in other countries including the US.","definition[7]":"a room or building where people work at desks","example[19]":"The agency recently closed its Houston office.","example[20]":"I’d like to see you in my office.","example[21]":"I applied for the job of office manager.","example[22]":"There is a shortage of low-cost office space.","example[23]":"I work in a large open-plan office (=an office without any walls dividing it into separate rooms).","definition[8]":"to do a lot of business and make a lot of money","example[24]":"The conference organizers did a land office business at first, but now watch people go to competitors’ events.","definition[9]":"a room or building where people can go to buy tickets or get information, or for some other service","example[25]":"Information leaflets are available from the enquiry office.","example[26]":"The woman in the ticket office said there would be a train in five minutes.","example[27]":"the Opera House booking office","definition[10]":"an important job or position, especially in a government","example[28]":"He is determined to stay in office until the end of the year.","example[29]":"When he took office, inflation was running at 84%.","definition[11]":"used in the names of some British government departments and organizations"}