{"word[0]":"let  somebody/something ↔ down","definition[0]":"to not do something that someone trusts or expects you to do","note[0]":"let the side down British English (=disappoint a group of people that you belong to)","example[0]":"She had been let down badly in the past.","example[1]":"The worst feeling is having let our fans down.","definition[1]":"to make someone or something less successful or effective","example[2]":"McKenzie’s judgement rarely lets him down.","definition[2]":"to move something or someone to a lower position","example[3]":"Let down a rope so that I can climb up.","example[4]":"Carefully, she let herself down into the water.","definition[3]":"to relax and enjoy yourself, especially after working hard","example[5]":"Visitors young and old let their hair down and enjoyed the show.","definition[4]":"to relax and stop worrying about what might happen or what someone might find out about you","example[6]":"Maggie never really lets her guard down, does she?","definition[5]":"to give someone bad news in a way that will not upset them too much","example[7]":"I get asked out on dates quite often, but I always try to let the guy down gently.","definition[6]":"to allow the air to escape from something so that it loses its shape and becomes flat","example[8]":"Someone’s let my tyres down!","definition[7]":"to make a piece of clothing longer by unfolding a folded edge","opposite[0]":"take up","explanation[0]":"You let someone do something","example[9]":"Her boss lets her work from home","bad_example[0]":"let someone to do something","explanation[1]":"Let is not used in the passive","explanation[2]":"You allow someone to do something","example[10]":"Her boss allows her to work from home","explanation[3]":"Something is allowed","example[11]":"Working from home is allowed","explanation[4]":"Allow is often used in the passive","explanation[5]":"Something  is permitted","example[12]":"Working from home is permitted","explanation[6]":"Someone is permitted to do something","example[13]":"Employees are permitted to work from home","explanation[7]":"Permit is usually used in the passive"}