{"word[0]":"further","signpost[0]":"more","definition[0]":"more, or to a greater degree","example[0]":"A spokesman declined to comment until the evidence could be studied further.","example[1]":"The flavour of the wine is further improved during the aging period.","example[2]":"Whaling in Australia was stopped. But the Australian government went further (=said or did something more extreme) and proposed a global ban.","example[3]":"Marcus sank further and further into debt.","note[0]":"further into/away etc","definition[1]":"a greater distance, or beyond a particular place","example[4]":"They walked a little further.","example[5]":"His farm is located further away from Riobamba than his brother’s.","note[1]":"further up/away/along etc","example[6]":"His hands moved further down her back.","example[7]":"They’ve never been further south than San Diego.","definition[2]":"into the past or the future","example[8]":"It might be a sign, much further down the road (=in the future), of a change in policy.","example[9]":"Five years further on, a cure has still not been found.","note[2]":"further back/on/ahead etc","example[10]":"The records don’t go any further back than 1960.","signpost[1]":"in addition","definition[3]":"used to introduce something additional that you want to talk about","synonym[0]":"furthermore","example[11]":"Butter sales have fallen because margarine has improved in flavor. Further, butter consumption has decreased because of links to heart disease.","definition[4]":"more or additional","example[12]":"Are there any further questions?","example[13]":"We have decided to take no further action.","example[14]":"Visit our website for further details.","note[3]":"further details/information etc","example[15]":"Cook gently for a further 10 minutes.","note[4]":"a further 10 miles/5 minutes etc","definition[5]":"to help something progress or be successful","example[16]":"He dedicated his life to furthering the cause of world peace.","example[17]":"Alan had been using her to further his career."}