{"word[0]":"kill","signpost[0]":"make somebody/something die","definition[0]":"to make a person or animal die","example[0]":"Why did she kill her husband?","example[1]":"Murray held a gun to his head and threatened to kill him.","example[2]":"Four people were killed when a train plunged into a flooded river.","example[3]":"Bleach kills household germs.","example[4]":"Smoking kills.","example[5]":"The driver was killed instantly.","note[0]":"be killed instantly/outright","signpost[1]":"make something stop/fail","definition[1]":"to make something stop operating or fail","note[1]":"kill your speed (=drive slowly)","example[6]":"Joe pulled in and killed the engine.","example[7]":"The out-of-town shopping centre will kill local trade.","signpost[2]":"be angry with somebody","definition[2]":"to be very angry with someone","example[8]":"Mom will kill me if I’m late.","signpost[3]":"annoyed/sad","definition[3]":"to make someone feel annoyed, sad, concerned etc","example[9]":"What happened next? The suspense is killing me.","example[10]":"It kills me to see him working so hard.","note[2]":"it kills somebody to do something","signpost[4]":"make somebody laugh","definition[4]":"to make someone laugh a lot","example[11]":"They weren’t bothered – in fact, they were killing themselves laughing.","note[3]":"kill yourself laughing","definition[5]":"to make someone die","example[12]":"The driver and his passenger were killed in the crash.","example[13]":"He was killed by rival gang members.","display[0]":"murder","definition[6]":"to deliberately kill someone – used when talking about this as a crime","example[14]":"He was convicted of murdering his wife.","display[1]":"commit manslaughter","definition[7]":"to kill someone without intending to – used when talking about this as a crime","example[15]":"The court ruled that the guard had committed manslaughter.","display[2]":"assassinate","definition[8]":"to deliberately kill an important person, especially a politician","example[16]":"He was part of a plot to assassinate Hitler.","display[3]":"slay","definition[9]":"to kill someone or something in a violent way – used in newspaper reports and also in old stories","example[17]":"Two teenagers were slain in the shootings.","example[18]":"St. George slew the dragon.","example[19]":"The king was slain at the battle of Hastings.","display[4]":"execute","definition[10]":"to kill someone as a punishment for a crime","example[20]":"McVeigh, who killed 168 people in a bombing attack, was executed by lethal injection.","display[5]":"eliminate","definition[11]":"to kill someone in order to prevent them from causing trouble","example[21]":"a ruthless dictator who eliminated all his rivals","display[6]":"take somebody out","definition[12]":"to kill someone in order to get rid of them, especially an enemy or someone who is causing trouble for you","example[22]":"US forces used air strikes to take out the enemy positions.","example[23]":"One of the other drug dealers may have decided to take him out.","display[7]":"bump somebody off","example[24]":"He was so irritating I felt like bumping him off myself.","display[8]":"do away with somebody","example[25]":"The settlers in Jamestown had been done away with, but no one knew how.","heading[0]":"to kill yourself","display[9]":"commit suicide","example[26]":"He committed suicide after the death of his girlfriend.","display[10]":"take your own life","example[27]":"He had taken his own life while he was severely depressed.","example[28]":"They believe that it is a sin to take your own life.","heading[1]":"to kill a large number of people","display[11]":"massacre","definition[13]":"to kill a large number of people in a violent way","example[29]":"Thousands of peaceful demonstrators were massacred by the soldiers.","display[12]":"slaughter","definition[14]":"to kill a large number of people in a violent way. Slaughter is also used about killing animals for food","example[30]":"The army slaughtered thousands of civilians in an effort to stop the revolt.","example[31]":"The pigs were slaughtered on the farm.","display[13]":"exterminate","definition[15]":"to kill large numbers of a particular group, so that they no longer exist","example[32]":"Hitler’s goal was to exterminate the Jews.","definition[16]":"the act of killing a hunted animal","example[33]":"He raised his knife for the kill.","definition[17]":"an animal that is killed by another animal","example[34]":"The cubs will share the remains of the kill.","definition[18]":"if someone kills an idea, product etc, they decide to stop developing it, selling it etc","example[35]":"They have killed plans for a weekly regional magazine in Los Angeles."}