{"word[0]":"comparison","signpost[0]":"comparing","definition[0]":"the process of comparing two or more people or things","example[0]":"Her paintings invite comparison with those of the early Impressionists  (=they remind you of them).","example[1]":"Irving’s work bears comparison with the best of the modern novelists.","note[0]":"stand/bear comparison","example[2]":"Comparison with his previous movies shows how Lee has developed as a director.","note[1]":"comparison with","example[3]":"In comparison to other recent video games, this one isn’t very exciting.","note[2]":"in comparison (with/to something)","example[4]":"He was a loud friendly man. In comparison, his brother was rather shy.","example[5]":"By comparison with other European countries, car prices in the UK are very high.","note[3]":"by comparison (with something)","example[6]":"After months of living in a tropical climate, Spain seemed cool by comparison.","example[7]":"These figures are provided for comparison with the results of previous studies.","note[4]":"for comparison (with something)","example[8]":"He showed us the original text for comparison.","example[9]":"On comparison, the Renault was the more reliable of the two cars.","note[5]":"on comparison","signpost[1]":"judgment","definition[1]":"a statement or examination of how similar or different two people or things are","example[10]":"a comparison of pollution levels in Chicago and Detroit","note[6]":"comparison of","example[11]":"The article makes a comparison between the two poems.","note[7]":"comparison between","explanation[0]":"In written English, people often use draw a comparison rather than make a comparison, as it sounds more formal:","example[12]":"The writer draws a comparison between the 1950s and the present day.","signpost[2]":"be like something","definition[2]":"a statement that someone or something is like someone or something else","example[13]":"The writer draws comparisons between the two presidents.","note[8]":"(make/draw) a comparison between somebody/something","example[14]":"You can’t make a comparison between American and Japanese schools – they’re too different.","definition[3]":"a word used in grammar meaning the way an adverb or adjective changes its form to show whether it is comparative or superlative","heading[0]":"– Meaning 2: a statement or examination of how similar or different two people or things are","collocation[0]":"make a comparison","example[15]":"Using the Internet is an easy way to make comparisons between prices.","collocation[1]":"draw a comparison","example[16]":"People have drawn comparisons between this movie and those of Quentin Tarantino.","collocation[2]":"provide a comparison","example[17]":"The test can be used to provide a comparison of a child's language development with that of other children.","form[0]":"ADJECTIVES/NOUN + comparison","collocation[3]":"a direct comparison","example[18]":"You can’t really make a direct comparison between the the two schools.","collocation[4]":"an interesting comparison","example[19]":"The exhibition provides an interesting comparison of the artists’ works.","collocation[5]":"a valid/useful/meaningful  comparison","example[20]":"There is not enough data for a valid comparison to be made.","collocation[6]":"a fair/unfair comparison","example[21]":"A fair comparison between the two firms is extremely difficult.","collocation[7]":"a favourable/unfavourable comparison","example[22]":"My family was always making unfavourable comparisons between me and my older brother.","collocation[8]":"a detailed comparison","example[23]":"Students had to write a detailed comparison of the two texts.","collocation[9]":"a price comparison","example[24]":"A price comparison shopping site was launched last month."}