{"word[0]":"substitute","definition[0]":"someone who does someone else’s job for a limited period of time, especially in a sports team or school","example[0]":"Germany brought on a substitute at half time.","example[1]":"substitute goalkeeper","example[2]":"The coach has to find a substitute for Tim.","note[0]":"substitute for","definition[1]":"a person or thing that you use instead of the one that you usually have, because the usual one is not available","example[3]":"a sugar substitute","example[4]":"a father substitute","definition[2]":"to use something new or different instead of something else","example[5]":"The recipe says you can substitute yoghurt for the sour cream.","note[1]":"substitute something for something","definition[3]":"to do someone’s job until the person who usually does it is able to do it again","synonym[0]":"stand in","example[6]":"Bill substituted for Larry, who was off sick.","definition[4]":"to replace someone with another person, especially another player","example[7]":"Michael Owen had to be substituted after 20 minutes on the field.","definition[5]":"something new or different that can be used instead of something else","example[8]":"Sugar substitutes are used by the soft drinks industry.","example[9]":"Training is important but it is no substitute for (=cannot take the place of) experience.","definition[6]":"someone who does someone else’s job for a limited period of time","example[10]":"We need to find a substitute while she is sick.","definition[7]":"to use or do something new or different instead of something else","example[11]":"Corporations have been able to avoid some tax by substituting debt for equity.","note[2]":"substitute something for/with something","example[12]":"Byproducts are reduced if a different bleaching agent is substituted for pure chlorine.","definition[8]":"to be used or done instead of something else","example[13]":"Synthetic fuels are liquids or gases which may be substituted for oil products or natural gas.","example[14]":"Bill substituted for Larry who was off sick."}