{"word[0]":"cross","signpost[0]":"go from one side to another","definition[0]":"to go or stretch from one side of something such as a road, river, room etc to the other","example[0]":"An old bridge crosses the river.","example[1]":"It’s easy to have an accident just crossing the road.","note[0]":"cross (over) the road/street/river etc","example[2]":"He was hit by a car when he tried to cross over the road near Euston station.","example[3]":"the first steamship to cross the Atlantic","note[1]":"cross the Atlantic/the Channel etc","example[4]":"He crossed to the window.","note[2]":"cross to","example[5]":"She crossed over to sit beside Dot.","note[3]":"cross over","signpost[1]":"cross a line etc","definition[1]":"if you cross a line, track etc, you go over and beyond it","example[6]":"He raised his arms in triumph as he crossed the line for his 100-metres win.","signpost[2]":"two roads/lines etc","definition[2]":"if two or more roads, lines, etc cross, or if one crosses another, they go across each other","example[7]":"The by-pass crosses Wilton Lane shortly after a roundabout.","signpost[3]":"legs/arms/ankles","definition[3]":"if you cross your legs, arms, or ankles, you put one on top of the other","example[8]":"She was sitting on the floor with her legs crossed.","signpost[4]":"breed of plant/animal","definition[4]":"to mix two or more different breeds of animal or plant to form a new breed","example[9]":"a flower produced by crossing several different varieties","example[10]":"These cattle were crossed with a breed from the highlands.","note[4]":"cross something with something","signpost[5]":"make somebody angry","definition[5]":"to make someone angry by opposing their plans or orders","example[11]":"He hated anyone who crossed him.","definition[6]":"to kick, throw, or hit the ball across the playing area in a sport such as football, hockey etc","signpost[6]":"cheque","definition[7]":"to draw two lines across a cheque to show that it must be paid into the bank account of the person whose name is on it","signpost[7]":"letters","definition[8]":"if two letters about the same subject cross in the post, each was sent before the other was received","signpost[8]":"mixture of things","definition[9]":"a mixture of two things, breeds, or qualities","example[12]":"The tour manager’s role is a cross between hostess and courier.","note[5]":"cross between","example[13]":"Their dog is a cross between two well-known breeds.","signpost[9]":"mark on paper","definition[10]":"a mark (x or +) used on paper, to represent where something is, or where something should be","example[14]":"I’ve put a cross on the map to mark where our street is.","example[15]":"Please sign your name by the cross.","definition[11]":"a mark (x) used on paper to show that something that has been written or printed is not correct","example[16]":"My homework got a lot more ticks than crosses.","definition[12]":"a mark (x or +) used by someone who cannot write, in order to sign their name","signpost[10]":"Christian sign","definition[13]":"the cross that Jesus Christ died on","example[17]":"Christians believe that Jesus died on the cross for our sins.","definition[14]":"an object, picture, or mark in the shape of a cross, used as a sign of the Christian faith or for decoration","example[18]":"Pauline wore a tiny gold cross.","signpost[11]":"punishment","definition[15]":"an upright post of wood with another crossing it near the top, that people in the past were fastened to with nails and left to die on as a punishment","signpost[12]":"military award","definition[16]":"a decoration in the shape of a cross that is given to someone as an honour, especially for military courage","example[19]":"He was awarded the George Cross.","definition[17]":"a kick or hit of the ball in a sport such as football, hockey etc, that goes across the field","definition[18]":"a way of hitting someone in the sport of boxing, in which your arm goes over theirs as they try to hit you","example[20]":"He caught his opponent with a right cross to the chin.","signpost[13]":"problem","definition[19]":"if you describe something as the cross that someone has to bear, you mean it is a problem that makes them very unhappy or worried, and that continues for a long time","example[21]":"I feel sorry for you, but we all have our crosses to bear.","definition[20]":"angry or annoyed","example[22]":"She gets cross when he goes out drinking.","note[6]":"get/be cross (with somebody)","example[23]":"Sometimes I get very cross with the children.","example[24]":"She was cross at being interrupted.","note[7]":"cross at/about","definition[21]":"going from one side to the other","example[25]":"a cross-Channel ferry  (=sailing from Britain to France)","definition[22]":"going between two things and joining them","example[26]":"cross-cultural influences","definition[23]":"to draw two lines and write the words ‘account payee’ on a cheque, showing that it can only be paid into a bank account of the person named on the cheque, and not exchanged for cash or paid into a different account","synonym[0]":"ENDORSE"}