{"word[0]":"issue","signpost[0]":"subject/problem","definition[0]":"a subject or problem that is often discussed or argued about, especially a social or political matter that affects the interests of a lot of people","example[0]":"Abortion is a highly controversial issue.","example[1]":"We should raise the issue of discrimination with the council.","example[2]":"The key issue is whether workers should be classified as ‘employees’.","signpost[1]":"magazine","definition[1]":"a magazine or newspaper printed for a particular day, week, or month","example[3]":"Have you seen the latest issue?","note[0]":"the current/latest issue","example[4]":"The article appeared in the January issue of ‘Nature’.","note[1]":"issue of","signpost[2]":"act of giving something","definition[2]":"the act of officially giving people something to use","example[5]":"the issue of identity cards to all non-residents","signpost[3]":"set of things for sale","definition[3]":"a new set of something such as shares or stamps, made available for people to buy","example[6]":"We launched the share issue on March 1.","example[7]":"a new issue of bonds","collocation[0]":"discuss/debate an issue","example[8]":"They met to discuss the issue of working conditions at the factory.","collocation[1]":"raise an issue/bring up an issue","example[9]":"Some important issues were raised at the meeting.","collocation[2]":"deal with/tackle an issue","example[10]":"The government must deal with the issue of gun crime.","example[11]":"The company said that it will address the issue at the next scheduled board meeting.","collocation[3]":"decide/settle/resolve an issue","example[12]":"The issue was settled after some tough negotiations.","example[13]":"No deadline has been set to resolve the issue.","collocation[4]":"face an issue","example[14]":"Politicians seem to be reluctant to face the issue.","collocation[5]":"avoid/evade an issue","example[15]":"There is no point in evading the issue any longer.","collocation[6]":"confuse/cloud/muddy the issue","example[16]":"You must not let your feelings cloud the issue.","collocation[7]":"highlight an issue","example[17]":"The minister used his speech to highlight the issue of global warming.","collocation[8]":"an issue comes up","example[18]":"The issue arose during a meeting of the Budget Committee.","collocation[9]":"the issues surrounding something","example[19]":"This chapter discusses the ethical issues surrounding genetically modified foods.","collocation[10]":"a political/social/economic etc issue","example[20]":"They discussed a number of political issues.","collocation[11]":"an important issue","example[21]":"The committee met several times to discuss this important issue.","collocation[12]":"a key/major/big issue","example[22]":"For me, the big issue is cost.","collocation[13]":"a difficult/complex issue","example[23]":"He was able to grasp complex issues quickly.","collocation[14]":"a controversial/sensitive issue","example[24]":"Abortion is a controversial issue.","collocation[15]":"a thorny issue","example[25]":"Illegal immigration is always a thorny issue.","collocation[16]":"a burning issue","example[26]":"For country-dwellers, transport is a burning issue.","collocation[17]":"wider issues","example[27]":"This is a question that raises much wider issues.","collocation[18]":"a topical issue","example[28]":"The magazine discusses topical issues in science.","collocation[19]":"the underlying issue","example[29]":"This research explores some of the underlying issues related to high unemployment.","collocation[20]":"a fundamental issue","example[30]":"Decisions still need to be made about some fundamental issues.","collocation[21]":"an unresolved issue","example[31]":"A number of unresolved issues remain before the treaty can be signed.","collocation[22]":"a range of issues","example[32]":"A range of issues were debated at the meeting.","collocation[23]":"something is not the issue","example[33]":"Price alone is not the issue.","definition[4]":"to officially make a statement, give an order, warning etc","example[34]":"Silva issued a statement denying all knowledge of the affair.","example[35]":"a warning issued by the Surgeon General","definition[5]":"if an organization or someone in an official position issues something such as documents or equipment, they give these things to people who need them","example[36]":"The US State Department issues millions of passports each year.","note[2]":"issue a passport/permit/visa etc","example[37]":"All the workers were issued with protective clothing.","note[3]":"issue somebody with something","example[38]":"The policy document will be issued to all employees.","note[4]":"issue something to somebody","definition[6]":"to officially produce something such as new stamps, coins, or shares and make them available to buy","definition[7]":"to officially give something such as a document to someone who needs or wants it","example[39]":"Northwest Airlines issued fliers with discount coupons.","example[40]":"Visa USA licenses US financial institutions to issue Visa cards.","definition[8]":"if an organization issues SECURITIES such as bonds and shares, it makes them available for people to buy","example[41]":"The company recently issued bonds with yields under 10%.","example[42]":"The company had been given permission to issue up to 35 million new shares to more than 100,000 employees in 29 countries.","definition[9]":"if a bank issues coins or BANKNOTEs, it makes them available and puts them into CIRCULATION","example[43]":"The Bank of England issues notes and acts a banker to the government.","definition[10]":"the act of making SECURITIES such as bonds, shares etc available for sale, and the securities themselves","example[44]":"The shareholders are expected to approve two issues of common stock.","example[45]":"Please confirm total number of shares in issue (=existing) at the end of the period in order for us to update our records.","definition[11]":"an occasion when a bank or government makes new paper money or coins available to be used","example[46]":"Before Christmas the issue of banknotes is increased to meet the extra demand."}