{"word[0]":"station","signpost[0]":"train/bus","definition[0]":"a place where trains or buses regularly stop so that passengers can get on and off, goods can be loaded etc, or the buildings at such a place","note[0]":"train station/railway station British English","example[0]":"I want to get off at the next station.","example[1]":"Grand Central Station","example[2]":"Is there a waiting room in the station?","example[3]":"the city bus station","signpost[1]":"centre for a service or activity","definition[1]":"a building or place that is a centre for a particular kind of service or activity","note[1]":"polling station (=where you vote in an election)","example[4]":"a police station","example[5]":"a fire station","example[6]":"an Antarctic research station","signpost[2]":"radio/tv","definition[2]":"an organization which makes television or radio broadcasts, or the building where this is done","example[7]":"New York jazz station WBGO","example[8]":"a local TV station","signpost[3]":"social rank","definition[3]":"your position in society","example[9]":"Karen was definitely getting ideas above her station (=higher than her social rank).","definition[4]":"a place where someone stands or sits in order to be ready to do something quickly if needed","example[10]":"You’re not to leave your station unless told.","signpost[4]":"farm","definition[5]":"a large sheep or cattle farm in Australia or New Zealand","signpost[5]":"army/navy","definition[6]":"a small military establishment","example[11]":"an isolated naval station","definition[7]":"a place where trains or buses regularly stop","example[12]":"The town has its own railway station.","example[13]":"Paddington Station in west London","example[14]":"the bus station","display[0]":"terminus","definition[8]":"the station or stop at the end of a railway or bus line","example[15]":"We’ve arranged to meet her at the Victoria bus terminus.","example[16]":"the railway terminus in central Calcutta","display[1]":"track","definition[9]":"the metal lines along which trains travel. This is sometimes used in American English to say which part of a station a train will leave from","example[17]":"The passenger train, traveling at 120 mph, careered off the tracks.","display[2]":"platform","definition[10]":"the raised place beside a railway track where you get on and off a train in a station – used especially to say which part of a station a train will leave from","example[18]":"Trains for Oxford leave from Platform 2.","display[3]":"ticket office","definition[11]":"the place at a station where tickets are sold","example[19]":"You can buy rail tickets online or at the ticket office.","display[4]":"departures board","definition[12]":"a board saying when and from which part of a station each train will leave","example[20]":"The departures board said that the train was ten minutes late.","definition[13]":"to send someone in the military to a particular place for a period of time as part of their military duty","synonym[0]":"post","example[21]":"I was stationed overseas at the time.","definition[14]":"to move to a particular place and stand or sit there, especially in order to be able to do something quickly, or to cause someone to do this","example[22]":"A security guard was stationed near the door.","explanation[0]":"Station is usually passive"}