{"word[0]":"performance","definition[0]":"when someone performs a play or a piece of music","example[0]":"This evening’s performance will begin at 8.00 pm.","example[1]":"Their performance of Mozart’s Concerto in E flat was finely controlled and dramatic.","note[0]":"performance of","definition[1]":"how well or badly a person, company etc does a particular job or activity","example[2]":"Sean’s performance at school has greatly improved.","example[3]":"I was impressed by the team’s performance.","example[4]":"The country’s economic performance so far this year has been good. ","example[5]":"Shareholders blamed him for the company’s poor performance. ","example[6]":"her disappointing performance in the Olympics","example[7]":"Exam results are used as performance indicators  (=things that show how well something is done) for schools.","definition[2]":"the act of doing a piece of work, duty etc","example[8]":"the performance of his official duties","definition[3]":"how well a car or other machine works","example[9]":"The car’s performance on mountain roads was impressive.","example[10]":"an imaging system using high-performance (=very effective) technology","collocation[0]":"give a performance","example[11]":"Samuel Jackson gives a terrific performance as Elijah.","collocation[1]":"turn in/deliver a performance","example[12]":"Both actors turn in great performances.","example[13]":"In the role of Carmen, Ms Leblanc delivered a quite exquisite performance.","collocation[2]":"go to a performance","example[14]":"We can go to the evening performance if you prefer.","example[15]":"The Princess attended a performance of The Magic Flute at the London Coliseum.","collocation[3]":"a fine/great performance","example[16]":"There are fine performances by Kathy Bates and Daryl Hannah.","collocation[4]":"a memorable performance","example[17]":"There were memorable performances from Madonna and U2.","collocation[5]":"a brilliant/magnificent/superb performance","example[18]":"Rogers gave a brilliant performance of Chopin’s Piano Concerto No. 1.","collocation[6]":"a virtuoso performance","example[19]":"He delivered a virtuoso performance as The Phantom Of The Opera.","collocation[7]":"a live performance","example[20]":"This is the band’s first live performance since last year.","collocation[8]":"a solo performance","example[21]":"Young’s solo performances are often his most effective.","heading[0]":"– Meaning 2: how well or badly a person, company etc does a particular job or activity","example[22]":"England needs to produce another good performance against France.","example[23]":"The performance of the retail sector continues to be strong.","example[24]":"Why is his performance in school so poor?","collocation[9]":"disappointing","example[25]":"The country’s recent economic performance has been disappointing.","collocation[10]":"lacklustre","example[26]":"The team must improve on Saturday’s lacklustre performance.","collocation[11]":"economic performance","example[27]":"Its economic performance has not matched that of other countries.","collocation[12]":"financial performance","example[28]":"Our overall financial performance has improved.","collocation[13]":"improve somebody’s performance","example[29]":"These changes significantly improve the performance of the engine.","collocation[14]":"produce a performance","example[30]":"Tiger Woods produced one of the best performances of his career.","collocation[15]":"put in/up a (good/bad etc) performance","example[31]":"Liverpool put in a marvellous performance in the second half.","collocation[16]":"assess somebody’s performance","example[32]":"Banks assess the performance and prospects of firms before lending.","collocation[17]":"monitor somebody’s performance","example[33]":"The children's performance at school is continually monitored.","form[0]":"performance + NOUN","collocation[18]":"performance indicators","example[34]":"We use a set of performance indicators to assess the level of progress.","collocation[19]":"performance targets","example[35]":"Several train operators failed to meet the performance targets.","definition[4]":"the degree to which a company, investment, financial market etc is profitable","example[36]":"The company is showing strong performance and doing considerably better than the retail industry as a whole.","example[37]":"They will report a $500 million loss, one of the worst performances ever by a US brokerage firm.","definition[5]":"how well a machine, vehicle etc works","example[38]":"Consumers believed the car’s price was relatively expensive for its performance.","definition[6]":"the way that someone does their job, and how well they do it","example[39]":"Some people were critical of her performance as a manager.","definition[7]":"the act of doing the things mentioned in a contract in the way that they should be done","example[40]":"the seller’s performance of his part of the contract"}