{"word[0]":"accept","signpost[0]":"gift/offer/invitation","definition[0]":"to take something that someone offers you, or to agree to do something that someone asks you to do","opposite[0]":"refuse","example[0]":"Rick accepted her offer of coffee.","example[1]":"He accepted the invitation to stay with us.","example[2]":"His school reports said that he is always ready to accept a challenge (=agree to do something difficult).","example[3]":"Please accept this small gift.","example[4]":"They offered me a job and I accepted.","example[5]":"He readily accepted her invitation  (=accepted it quickly).","example[6]":"He accepted a glass of water from Helen.","note[0]":"accept something from somebody","explanation[0]":"In everyday English, when talking about accepting a job, accepting responsibility or blame, or accepting a method of payment, people usually use take:","example[7]":"He decided to take her up on her offer.","explanation[1]":"When talking about accepting an offer, people often say take someone up on their offer:","signpost[1]":"situation/problem etc","definition[1]":"to decide that there is nothing you can do to change a difficult and unpleasant situation or fact and continue with your normal life","example[8]":"He’s not going to change, and you just have to accept it.","example[9]":"He can't accept the fact that his problems are his own fault.","example[10]":"We have to accept that this is not an ideal world.","note[1]":"accept that","signpost[2]":"think somebody/something is good enough","definition[2]":"to decide that someone has the necessary skill or intelligence for a particular job, course etc or that a piece of work is good enough","opposite[1]":"reject","example[11]":"Students accepted by Stanford Law School had very high scores on the LSAT.","example[12]":"They have accepted him as the representative of the company.","note[2]":"accept somebody/something as something","example[13]":"Random House accepted the book for publication.","note[3]":"accept somebody/something for something","signpost[3]":"become part of a group","definition[3]":"to allow someone to become part of a group, society, or organization, and to treat them in the same way as the other members","example[14]":"The children gradually began to accept her as one of the family.","note[4]":"accept somebody as something","example[15]":"It often takes years for immigrants to be accepted into the host community.","note[5]":"accept somebody into something","signpost[4]":"agree to take/deal with something","definition[4]":"to agree to take or deal with something that someone gives you, or to say that it is suitable or good enough","example[16]":"The government has accepted the resignation of a senior army commander.","example[17]":"Please accept my sincere apologies.","example[18]":"Sorry, we don’t accept traveller’s cheques.","signpost[5]":"suggestion/advice","definition[5]":"to decide to do what someone suggests or advises you should do","example[19]":"Be prepared to accept the advice of members of staff.","signpost[6]":"believe an explanation/statement","definition[6]":"to agree that what someone says is right or true","example[20]":"She has accepted your explanation as to why you didn’t attend the meeting.","explanation[2]":"In more formal English, you say it is accepted that when saying what people generally believe is true","example[21]":"It is accepted that he was sincere in his claim","collocation[0]":"accept an offer","example[22]":"In the end I had to accept his offer of £4,500.","collocation[1]":"accept an invitation","example[23]":"Are you going to accept their invitation to the wedding?","collocation[2]":"accept help","example[24]":"Don’t be afraid to accept help if you need it.","collocation[3]":"accept aid","example[25]":"Egypt gratefully accepted American economic aid.","collocation[4]":"accept assistance","example[26]":"They were ready to accept French military assistance.","collocation[5]":"accept a challenge","example[27]":"To protect the environment we must accept some difficult challenges.","collocation[6]":"accept an award","example[28]":"Miller accepted the award for best comedy show.","collocation[7]":"accept an opportunity","example[29]":"I wish that I’d accepted the opportunity to retire when it was offered.","collocation[8]":"accept a gift/present","example[30]":"Accepting presents from him made her feel uncomfortable.","collocation[9]":"accept a job","example[31]":"She was desperate for money so she accepted the job.","collocation[10]":"accept a lift","example[32]":"I had been taught not to accept lifts from strangers.","collocation[11]":"accept a bribe","example[33]":"The president’s family and friends accepted massive bribes in exchange for official favours.","collocation[12]":"gladly/willingly/readily accept","example[34]":"She invited him for a drink and he gladly accepted.","collocation[13]":"gratefully accept","example[35]":"He gratefully accepted Athena’s help.","collocation[14]":"graciously accept","example[36]":"She accepted her gift graciously.","explanation[3]":"You accept something","example[37]":"She decided to accept the offer","example[38]":"I accepted his invitation to have dinner with him","bad_example[0]":"I accepted to have dinner with him","explanation[4]":"You agree to something","example[39]":"Her parents would never agree to the marriage ","bad_example[1]":"Her parents would never agree the marriage","explanation[5]":"You agree to do something","example[40]":"I agreed to have dinner with him","definition[7]":"to take or agree to take something that has been offered","example[41]":"The steel workers have accepted a 3% wage offer.","example[42]":"Doctors should not accept expensive gifts from pharmaceutical companies.","definition[8]":"to agree to a plan, idea, agreement etc","example[43]":"The US is ready to accept the deal.","definition[9]":"to agree to take goods that have been ordered","example[44]":"The company has shipped three supercomputers, but only two have been accepted.","definition[10]":"when people accept a new product, they like it and are willing to buy it","example[45]":"The machine is too highly priced to be accepted by the mass of US consumers.","definition[11]":"to allow customers to pay using these forms of payment","example[46]":"Do you accept Visa?","definition[12]":"to agree to pay a BILL OF EXCHANGE","definition[13]":"to officially agree to insure something","example[47]":"The insurance company reserves the right to make medical checks prior to accepting a risk on health insurance."}