{"word[0]":"street","definition[0]":"a public road in a city or town that has houses, shops etc on one or both sides","example[0]":"We moved to Center Street when I was young.","example[1]":"She lives just a few streets away.","example[2]":"I walked on further down the street.","example[3]":"Someone just moved in across the street.","example[4]":"a car parked on the other side of the street","example[5]":"The house faces onto a busy street.","collocation[0]":"crowded","example[6]":"The streets get very crowded at weekends.","example[7]":"It was late and the streets were quiet.","collocation[1]":"empty/deserted","example[8]":"As he walked home, the street was deserted.","example[9]":"an old city with quaint narrow streets","collocation[2]":"the main street","example[10]":"They drove slowly along the main street.","collocation[3]":"the high street","example[11]":"I bought this coat at a shop on the high street.","collocation[4]":"a shopping street","example[12]":"This is one of Europe’s most elegant shopping streets.","collocation[5]":"a residential street","example[13]":"a quiet residential street","collocation[6]":"a one-way street","example[14]":"He was caught driving the wrong way down a one-way street.","collocation[7]":"a side/back street","example[15]":"The restaurant is tucked away in a side street.","collocation[8]":"winding streets","example[16]":"We spent hours exploring the town’s winding streets.","collocation[9]":"cobbled streets","example[17]":"The cobbled streets were closed to cars.","collocation[10]":"cross the street","example[18]":"She crossed the street and walked into the bank.","form[0]":"street + NOUN","collocation[11]":"a street corner","example[19]":"Youths were standing around on street corners.","collocation[12]":"a street light/lamp","example[20]":"It was getting dark, and the street lamps were already on.","collocation[13]":"street crime/violence","example[21]":"Young men are most likely to be victims of street crime.","collocation[14]":"street clothes","example[22]":"She changed into her street clothes and left the theatre.","definition[1]":"relating to or similar to fashions, types of music, or attitudes that are popular with young people in cities","example[23]":"Her style is very street."}