{"word[0]":"quantity","plural[0]":"quantities","definition[0]":"an amount of something that can be counted or measured","example[0]":"Your work has improved in quantity and quality this term.","example[1]":"He had consumed a large quantity of alcohol.","note[0]":"a large/small/vast etc quantity of something","example[2]":"Huge quantities of oil were spilling into the sea.","example[3]":"Buy vegetables in small quantities, for your immediate use.","note[1]":"in large/small/sufficient etc quantities","example[4]":"The police also found a quantity of ammunition in the flat.","note[2]":"quantity of","example[5]":"Add 50 grams of butter, and the same quantity of sugar.","definition[1]":"the large amount of something","example[6]":"The sheer quantity of text meant that people did not read the whole of their newspaper.","collocation[0]":"a large quantity","example[7]":"A large quantity of clothing was stolen from the shop.","collocation[1]":"a great quantity","example[8]":"The Romans imported a great quantity of sculpture from Greece.","collocation[2]":"a vast/huge/enormous quantity","example[9]":"Computers can handle vast quantities of data.","collocation[3]":"a considerable/substantial  quantity","example[10]":"Dolphins need to eat considerable quantities of food.","collocation[4]":"a sufficient quantity","example[11]":"How did they obtain sufficient quantities of food to survive?","collocation[5]":"a small quantity","example[12]":"Remove a small quantity of butter from the fridge.","collocation[6]":"a tiny quantity","example[13]":"This truly great wine is only made in tiny quantities.","collocation[7]":"a minute quantity","example[14]":"The rock contains minute quantities of copper.","example[15]":"A small quantity of our oil is sold to France.","example[16]":"Stock managers have raised huge quantities of cash.","example[17]":"Citrus fruits are grown but not in commercial quantities (=amounts large enough to be sold).","definition[2]":"used to talk about how much of something there is","example[18]":"The quantity and quality of personnel is inadequate.","definition[3]":"in large amounts","example[19]":"We offer special prices if you buy in quantity.","definition[4]":"someone or something that people know something about or know very little about","example[20]":"The new director is a known quantity, having served as finance administrator to the company from 1986 to 90.","example[21]":"The administration of an annuity is an unknown quantity and the charge may rise from the current 1%."}