{"word[0]":"give up","definition[0]":"to stop doing something, especially something that you do regularly","example[0]":"Darren has decided to give up football at the end of this season.","example[1]":"She gave up her job and started writing poetry.","example[2]":"I gave up going to the theatre when I moved out of London.","note[0]":"give up doing something","example[3]":"Why don’t you give up smoking?","definition[1]":"to stop trying to do something","example[4]":"We spent half an hour looking for the keys, but eventually gave up and went home.","example[5]":"I give up. What’s the answer?","example[6]":"You shouldn’t give up so easily.","example[7]":"The ground was too hard to dig so I gave it up as a bad job (=stopped trying because success seemed unlikely).","example[8]":"I gave up trying to persuade him to continue with his studies.","example[9]":"She has still not given up the search.","note[1]":"give something ↔ up","definition[2]":"to allow yourself or someone else to be caught by the police or enemy soldiers","example[10]":"The siege ended peacefully after the gunman gave himself up.","example[11]":"In the end, his family gave him up to the police.","note[2]":"give yourself/somebody up to","definition[3]":"to use some of your time to do a particular thing","example[12]":"I don’t mind giving up a couple of hours a week to deal with correspondence.","definition[4]":"to give something that is yours to someone else","example[13]":"The family refused to give up any of their land.","example[14]":"She was put under tremendous pressure to give the baby up.","example[15]":"I would always give my seat up to an elderly person on the bus.","note[3]":"give something/somebody ↔ up to","definition[5]":"to end a romantic relationship with someone, even though you do not really want to","example[16]":"I knew deep down that I should give him up.","definition[6]":"to believe that someone is dead and stop looking for them","example[17]":"The ship sank and the crew were given up for dead.","definition[7]":"used to ask people to applaud someone"}