{"word[0]":"suspicion","definition[0]":"a feeling you have that someone is probably guilty of doing something wrong or dishonest","example[0]":"I can’t say for definite who did it, but I certainly have my suspicions.","example[1]":"Police suspicions were confirmed when the stolen property was found in his flat.","example[2]":"I wondered how I could leave early without arousing anyone’s suspicions.","example[3]":"She was arrested on suspicion of murder.","note[0]":"on suspicion of (doing) something","example[4]":"He felt he was still under suspicion.","note[1]":"under suspicion","example[5]":"Mitchell later came under suspicion of assaulting two young girls.","example[6]":"She felt that she ought to be above suspicion  (=so honest that no one could think that she had done anything wrong).","note[2]":"above/beyond suspicion","definition[1]":"a feeling that you do not trust someone","example[7]":"She always treated us with suspicion.","example[8]":"People moving into the area are often regarded with suspicion.","definition[2]":"a feeling you have that something is true, especially something bad","example[9]":"She was left with a sneaking suspicion  (=a small suspicion) that Steven was not telling the truth.","example[10]":"I have a suspicion that the local authority may be planning to close the school.","note[3]":"suspicion (that)","heading[0]":"– Meaning 1: a feeling you have that someone is probably guilty of doing something wrong or dishonest","collocation[0]":"have your suspicions","example[11]":"Many of us had our suspicions, but we couldn't prove anything.","collocation[1]":"confirm somebody's suspicions","example[12]":"The letter confirmed my suspicions.","collocation[2]":"arouse suspicion","example[13]":"How was he able to kill his victims without arousing suspicion?","collocation[3]":"raise suspicions","example[14]":"That fact immediately raised suspicions of Johnson's involvement in the incident.","collocation[4]":"be/come under suspicion","example[15]":"He was still under suspicion of fraud.","collocation[5]":"allay suspicion","example[16]":"She had to allay their suspicions and stop them probing any further.","collocation[6]":"divert suspicion","example[17]":"He started the rumour to divert suspicion from himself.","collocation[7]":"suspicion falls on somebody","example[18]":"Suspicion fell on Jenkins who had been seen near the scene of the crime.","collocation[8]":"grounds for suspicion","example[19]":"Police can stop and search you if they have good grounds for suspicion.","collocation[9]":"be above/beyond suspicion","example[20]":"He regarded his friend Henry as being above suspicion.","heading[1]":"– Meaning 3: a feeling you have that something is true, especially something bad","collocation[10]":"have a suspicion","example[21]":"I have a suspicion that he forgot to post the letter.","collocation[11]":"suspicion grew","example[22]":"Suspicion grew that the business was about to collapse.","collocation[12]":"a strong suspicion","example[23]":"She had a strong suspicion he was laughing at her.","collocation[13]":"a sneaking suspicion","example[24]":"We have a sneaking suspicion they're trying to put together a deal.","collocation[14]":"a nasty/awful suspicion","example[25]":"Suddenly I had a nasty suspicion that the boss was going to make me redundant.","collocation[15]":"the slightest suspicion","example[26]":"Daniel never had the slightest suspicion of how she really felt.","collocation[16]":"a nagging suspicion","example[27]":"I had a nagging suspicion that Colin wasn't telling me the whole truth."}