{"word[0]":"humour","definition[0]":"the ability or tendency to think that things are funny, or funny things you say that show you have this ability","example[0]":"his humour and charm","example[1]":"Greg’s feeble attempt at humour","example[2]":"English humour","example[3]":"It’s vital to have a sense of humor in this job.","example[4]":"The host puts the contestants at ease with his own brand of humour.","example[5]":"He showed flashes of humor that delighted the audience.","definition[1]":"the quality in something that makes it funny and makes people laugh","example[6]":"He failed to see the humour of the situation.","collocation[0]":"a sense of humour","example[7]":"I'm afraid my dad doesn't have a very good sense of humour.","collocation[1]":"somebody's brand of humour","example[8]":"Their brand of humour isn't to everyone's taste.","collocation[2]":"a flash/trace/touch of humour","example[9]":"She replied with a rare flash of humour.","form[0]":"ADJECTIVES/NOUN + humour","collocation[3]":"black/dark humour","example[10]":"The tone of the film is light but there are moments of black humour.","collocation[4]":"gallows humour","example[11]":"It was the kind of gallows humor that medical students love.","collocation[5]":"schoolboy humour","example[12]":"The schoolboy humour appealed to him.","collocation[6]":"dry/deadpan humour","example[13]":"His serious demeanour lends itself to deadpan humour.","collocation[7]":"wry humour","example[14]":"He wrote with wry humour about his time in a Turkish prison.","collocation[8]":"gentle humour","example[15]":"The plays uses gentle humor to make a strong point.","collocation[9]":"self-deprecating humour","example[16]":"Her self-deprecating humour made the audience howl with laughter.","collocation[10]":"see/appreciate the humour","example[17]":"I may have been wet and covered in mud, but I could still see the humour in the situation.","definition[2]":"to do what someone wants or to pretend to agree with them so that they do not become upset","example[18]":"‘Of course, ’ he said, humouring her."}