{"word[0]":"read","signpost[0]":"words/books","definition[0]":"to look at written words and understand what they mean","example[0]":"I can’t read your writing.","example[1]":"She picked up the letter and read it.","example[2]":"Read the instructions carefully before you start.","example[3]":"children who are just learning to read and write","example[4]":"Her books are quite widely read (=read by a lot of people).","example[5]":"When I was young, I read every one of his books from cover to cover (=read all of something because you are very interested).","type[0]":"intransitive, transitive not in progressive","signpost[1]":"find information","definition[1]":"to find out information from books, newspapers etc","example[6]":"You can’t believe everything you read in the papers.","example[7]":"Did you read about what happened to that guy in Florida?","note[0]":"read about","example[8]":"I was shocked when I read of his death.","note[1]":"read of","example[9]":"I read last week that the disease is on the increase.","note[2]":"read (that)","signpost[2]":"read and speak","definition[2]":"to say the words in a book, newspaper etc so that people can hear them","example[10]":"He glanced at the letter and began to read it aloud.","example[11]":"Daddy, will you read me a story?","note[3]":"read somebody something","example[12]":"Our mother reads to us every evening.","note[4]":"read (something) to somebody","example[13]":"Teachers should read more poetry to children.","signpost[3]":"music/maps etc","definition[3]":"to look at signs or pictures and understand what they mean","example[14]":"He plays the violin very well but can’t actually read music.","example[15]":"Are you any good at map reading?","definition[4]":"if a computer can read a disk, it can take the information that is on the disk and put it into its memory","signpost[4]":"understand something in a particular way","definition[5]":"to understand a situation, remark etc in one of several possible ways","synonym[0]":"interpret","example[16]":"I wasn’t sure how to read his silence.","example[17]":"He had accurately read the mood of the nation.","note[5]":"read something well/accurately","example[18]":"She shook her head, and I read this as a refusal.","note[6]":"read something as something","example[19]":"The poem can be read as a protest against war.","signpost[5]":"have words on","definition[6]":"used to say what words are on a sign, in a letter etc","example[20]":"A sign on the outer door read: ‘No Entry’.","signpost[6]":"style of writing","definition[7]":"if something reads well, badly etc, it has been written well, badly etc","example[21]":"I think in general the report reads well.","signpost[7]":"measuring","definition[8]":"to look at the number or amount shown on a measuring instrument","example[22]":"Someone should be coming to read the gas meter.","definition[9]":"if a measuring instrument reads a particular number, it shows that number","example[23]":"The thermometer read 46 degrees.","signpost[8]":"at university","definition[10]":"to study a subject at a university","example[24]":"I read history at Cambridge.","example[25]":"He wants to read for a law degree.","note[7]":"read for","explanation[0]":"In everyday British English, people usually say that someone does a subject at university:","example[26]":"I did history at Cambridge.","example[27]":"He wants to do a law degree.","heading[0]":"GRAMMAR: Patterns with read","display[0]":"read something in something","explanation[1]":"You read something in a book, newspaper, magazine etc","example[28]":"I read the interview in the newspaper","bad_example[0]":"read something on a book, newspaper, magazine etc","explanation[2]":"You read something in  a particular chapter of a book, or in  the introduction","example[29]":"In this chapter you can read about different types of diet ","explanation[3]":"You read something in the instructions or in a recipe","example[30]":"I read in the instructions that you are supposed to boil the pasta for six minutes","display[1]":"read something on something","explanation[4]":"You read something on the Internet or on a website","example[31]":"She read the story on the Internet","explanation[5]":"You read something on a page","example[32]":"You can read about his life story on page 12","explanation[6]":"You read something on a train, bus, plane etc","example[33]":"I like reading on the train – it helps to pass the time","bad_example[1]":"read something in a train, bus, plane etc","definition[11]":"to look at and understand the words in a book, magazine, letter etc for interest, enjoyment, or study","example[34]":"What book are you reading at the moment?","example[35]":"I usually read the newspaper on the way to work.","display[2]":"flick/flip/leaf through something","definition[12]":"to turn the pages of a book, magazine etc quickly, looking for things that might interest you","example[36]":"While I was waiting, I flicked through a magazine.","example[37]":"She was flipping through the pages of an encyclopedia.","example[38]":"Cunningham was leafing through a copy of the Financial Times at his desk amidst a cloud of cigar-smoke.","display[3]":"browse through something","definition[13]":"to spend time looking through a book, magazine etc without any clear purpose, looking for things that might interest you","example[39]":"Would you like to browse through our holiday brochure?","display[4]":"skim/scan (through) something","definition[14]":"to read something quickly to get the main ideas or find a particular piece of information","example[40]":"I want you to skim through the article and write a short summary of it.","example[41]":"Tony scanned the menu for a vegetarian option.","display[5]":"pore over something","definition[15]":"to read something very carefully for a long time","example[42]":"They spent weeks poring over guidebooks and planning their holiday.","display[6]":"devour something","definition[16]":"to read something quickly and eagerly","example[43]":"Her young fans devour her books.","display[7]":"dip into something","definition[17]":"to read short parts of something","example[44]":"It’s a book you can dip into rather than read from cover to cover.","display[8]":"plough/wade through something","definition[18]":"to read something long and boring","example[45]":"He’s upstairs ploughing through financial reports.","example[46]":"I can’t possibly wade through all this.","display[9]":"surf the Net/Internet/Web","definition[19]":"to look quickly through information on the Internet, stopping to read what interests you","example[47]":"He surfed the Net, looking for jobs.","definition[20]":"if you have a read, you spend time reading","example[48]":"I sat down to have a nice quiet read.","example[49]":"I had a quick read of the report before I left."}