{"word[0]":"against","definition[0]":"used to say that someone opposes or disagrees with something","example[0]":"Every council member voted against the proposal.","example[1]":"those who are campaigning against the new road","example[2]":"He advised me against travelling.","example[3]":"Mr Howard has declared that he is against all forms of racism.","example[4]":"the fight against terrorism","definition[1]":"used to say that an action is not wanted or approved of by someone","example[5]":"They got married against her parents’ wishes (=although they knew her parents did not want them to).","example[6]":"She has been kept in the house against her will (=she does not want to stay in the house).","example[7]":"The use of certain drugs is against the law (=illegal).","example[8]":"It’s against my principles to borrow money  (=I do not believe it is right).","definition[2]":"used to say that something is not allowed by a law or rule","example[9]":"There ought to be a law against it.","definition[3]":"used to say who someone is competing with or trying to defeat in a game, battle etc","example[10]":"Gambotti was injured in last Saturday’s game against the Lions.","example[11]":"We’ll be competing against the best companies in Europe.","definition[4]":"used to say who is harmed, threatened, or given a disadvantage","example[12]":"violence against elderly people","example[13]":"crimes against humanity","example[14]":"discrimination against women","example[15]":"There had been death threats against prison staff.","example[16]":"Your lack of experience could count against you.","example[17]":"The regulations tend to work against smaller companies.","definition[5]":"used to say that something touches, hits, or rubs a surface","example[18]":"the sound of the rain drumming against my window","example[19]":"The car skidded and we could hear the crunch of metal against metal.","definition[6]":"next to and touching an upright surface, especially for support","example[20]":"There was a ladder propped up against the wall.","example[21]":"The younger policeman was leaning against the bureau with his arms folded.","definition[7]":"in the opposite direction to the movement or flow of something","example[22]":"sailing against the wind","example[23]":"She dived down and swam out strongly against the current.","definition[8]":"seen with something else behind or as a background","example[24]":"He could see a line of figures silhouetted against the sky.","example[25]":"It is important to know what colours look good against your skin.","definition[9]":"used to show that you are considering particular events in relation to other events that are happening at the same time","example[26]":"The reforms were introduced against a background of social unrest.","definition[10]":"used to say what you are comparing something with","example[27]":"The pound has fallen 10% against the dollar.","example[28]":"She checked the contents of the box against the list.","example[29]":"The cost of the proposed research needs to be balanced against its benefits.","definition[11]":"used to say who or what you are trying to protect someone or something from","example[30]":"insurance against accident and sickness","example[31]":"a cream to protect against sunburn","example[32]":"a vaccine which is effective against pneumonia","definition[12]":"used to say who is said or shown to have done something wrong","example[33]":"He has always emphatically denied the allegations against him.","example[34]":"The evidence against you is overwhelming."}