{"word[0]":"tag","signpost[0]":"small piece of paper etc","definition[0]":"a small piece of paper, plastic etc attached to something to show what it is, who owns it, what it costs etc","example[0]":"All the staff wore name tags.","note[0]":"name/identity/price tag","definition[1]":"a children’s game in which one player chases and tries to touch the others","signpost[1]":"electronic object","definition[2]":"a piece of equipment that you attach to an animal or person, especially someone who has just left prison, so that you always know where they are","definition[3]":"a computer code attached to a word or phrase in a computer document in order to arrange the data in a particular way","signpost[2]":"name","definition[4]":"a word or phrase which is used to describe a person, group, or thing, but which is often unfair or not correct","example[1]":"His speed earned him the tag of ‘the runner’.","definition[5]":"a tag question","signpost[3]":"name painted on wall","definition[6]":"someone’s name that they paint illegally on a wall, vehicle etc","definition[7]":"the license plates on a car","definition[8]":"a small piece of sticky plastic with a date on it that you put on your car’s license plate to show that the car is legally allowed on the road in that year","collocation[0]":"a price tag","example[2]":"Don’t forgot to remove the price tag.","collocation[1]":"a name/an identity tag","example[3]":"Every baby had a name tag on his or her wrist.","collocation[2]":"a security tag","example[4]":"Expensive items such as leather jackets have security tags which have to be removed at the till.","collocation[3]":"a gift tag","example[5]":"You can buy gift wrap with matching gift tags.","collocation[4]":"a luggage tag","example[6]":"Was there a luggage tag on your suitcase?","definition[9]":"to attach a tag to something","example[7]":"Each bird was tagged and released into the wild.","definition[10]":"to give someone or something a name or title, or describe them in a particular way","example[8]":"The country no longer wants to be tagged as a Third World nation.","note[1]":"be tagged (as) something","definition[11]":"to attach a tag in a computer program or document","example[9]":"All the words are tagged with their part of speech.","definition[12]":"to illegally paint your name on a wall, vehicle etc","definition[13]":"to touch someone you are chasing in a game, especially to touch someone with the ball in baseball","definition[14]":"a series of letters or words that are put before and after a piece of electronic text to show that it is to be treated in a particular way","example[10]":"a list of HTML tags"}