{"word[0]":"trust","signpost[0]":"belief","definition[0]":"a strong belief in the honesty, goodness etc of someone or something","example[0]":"At first there was a lack of trust between them.","example[1]":"an agreement made on the basis of mutual trust (=when people trust each other)","example[2]":"You betrayed your father’s trust (=did something bad even though he trusted you).","example[3]":"You shouldn’t put your trust in a man like that.","note[0]":"put/place your trust in somebody/something","definition[1]":"an organization or group that has control over money that will be used to help someone else","example[4]":"a charitable trust","signpost[1]":"financial arrangement","definition[2]":"an arrangement by which someone has legal control of your money or property, either until you are old enough to use it or to invest  it for you","example[5]":"The money your father left you will be held in trust until you are 21.","signpost[2]":"companies","definition[3]":"a group of companies that illegally work together to reduce competition and control prices","example[6]":"anti-trust laws","definition[4]":"to believe that someone is honest or will not do anything bad or wrong","opposite[0]":"distrust","note[1]":"not trust somebody an inch/not trust somebody as far as you can throw them (=not trust someone at all)","example[7]":"I just don’t trust him.","example[8]":"He was a good driver and I trusted him implicitly.","note[2]":"trust somebody completely/implicitly","example[9]":"Can they be trusted to look after the house?","note[3]":"trust somebody to do something","example[10]":"I didn’t trust myself not to say something rude, so I just kept quiet.","signpost[3]":"facts/judgment","definition[5]":"to be sure that something is correct or right","synonym[0]":"believe in","example[11]":"Can we trust these statistics?","example[12]":"I trust his judgement completely.","example[13]":"Trust your instincts (=do what you feel is the right thing)!","signpost[4]":"things","definition[6]":"to be sure that something will work properly","synonym[1]":"rely on","example[14]":"Not trusting her voice, she shook her head.","example[15]":"You can’t trust the trains to run on time.","note[4]":"trust something to do something","example[16]":"He sat down suddenly, as if he didn’t trust his legs to support him.","definition[7]":"a belief in the honesty or goodness of someone or something","example[17]":"The measures are necessary to restore public trust in the futures markets.","example[18]":"He abused his position of trust (=a job with responsibility for making important decisions) and defrauded the institution.","definition[8]":"to believe that something is true without having any proof","example[19]":"I just had to take it on trust that he would deliver the money.","definition[9]":"an arrangement by which someone has legal control over your money or property until you are old enough to use it","definition[10]":"an arrangement by which someone has legal control over your money and usually invests it for you, or an organization that does this","example[20]":"He put his assets in a variety of trusts.","example[21]":"a bank trust department"}