{"definition[0]":"the process of getting better at doing something, or getting closer to finishing or achieving something","example[0]":"The police are disappointed by the slow progress of the investigation.","note[0]":"progress of","example[1]":"There has been significant progress in controlling heart disease.","note[1]":"progress in","example[2]":"We are making steady progress towards a peaceful settlement.","note[2]":"progress towards","example[3]":"Little progress has been made on human rights issues.","note[3]":"progress on","definition[1]":"slow or steady movement somewhere","example[4]":"We made good progress despite the snow.","example[5]":"They watched the ship’s slow progress through the heavy seas.","note[4]":"progress through","definition[2]":"change which is thought to lead to a better society, because of developments in science or fairer methods of social organization","example[6]":"Mankind is destroying the planet, all in the name of progress (=because people want progress).","example[7]":"Under communism, nothing was allowed to get in the way of the great march of progress.","collocation[0]":"make progress","example[8]":"The country has made significant economic progress.","collocation[1]":"hinder somebody’s progress","example[9]":"Language problems might hinder a child’s progress at school.","collocation[2]":"achieve progress","example[10]":"The talks ended with no real progress having been achieved.","collocation[3]":"check (on) somebody’s progress","example[11]":"A social worker calls regularly to check on the children’s progress.","collocation[4]":"follow/monitor/chart somebody’s progress","example[12]":"Throughout the night, doctors charted his progress.","collocation[5]":"assess/evaluate/review somebody’s progress","example[13]":"We appraise the work and evaluate each student’s individual progress.","collocation[6]":"slow","example[14]":"The task remains difficult and progress has been slow.","collocation[7]":"steady","example[15]":"Steady progress has been made towards our objectives.","example[16]":"He is out of hospital and making good progress.","example[17]":"The investigation is making rapid progress.","collocation[8]":"significant/real progress","example[18]":"Significant progress has been made in reducing nuclear weapons.","collocation[9]":"great progress","example[19]":"Scientists have made great progress in the last four years.","collocation[10]":"substantial/considerable progress","example[20]":"2007 was a year of substantial progress for the company.","collocation[11]":"satisfactory progress","example[21]":"The two students who fell behind are now making satisfactory progress.","explanation[0]":"Progress is an uncountable noun","example[22]":"She is making good progress","bad_example[0]":"She is making a good progress","explanation[1]":"Progress is not used with ‘a’","example[23]":"a test of the students’ progress","example[24]":"We have made good progress towards meeting our objectives.","display[0]":"advance","definition[3]":"a discovery, invention, or change that brings progress","example[25]":"the technological advances of the twentieth century","example[26]":"advances in scientific knowledge","example[27]":"In recent years there have been enormous economic and social advances.","display[1]":"breakthrough","definition[4]":"an important discovery or achievement that makes progress possible, especially one that happens suddenly after a long period of trying","example[28]":"Scientists have described the discovery as a major breakthrough.","example[29]":"The breakthrough in the investigation came when police found a stolen car.","display[2]":"make headway","definition[5]":"to make progress towards achieving something – used especially when it is difficult to make progress","example[30]":"After several months of discussion, the committee had made little headway.","heading[0]":"no progress","display[3]":"stalemate/deadlock","definition[6]":"a situation in which no further progress can be made because two groups or organizations cannot find a way to end a disagreement","example[31]":"The negotiations ended in deadlock.","example[32]":"At that point the strike appeared to have reached a stalemate.","example[33]":"the year-long political deadlock between the two parties","display[4]":"impasse","definition[7]":"a situation in which progress has stopped completely, especially because people cannot agree on what to do next","example[34]":"The continuing impasse over the budget.","example[35]":"The situation seemed to have reached an impasse.","display[5]":"grind to a halt","definition[8]":"to slowly stop making any progress","example[36]":"The economy seems to be grinding to a halt.","example[37]":"It was clear that the peace talks had ground to a halt.","definition[9]":"to improve, develop, or achieve things so that you are then at a more advanced stage","opposite[0]":"regress","example[38]":"I asked the nurse how my son was progressing.","example[39]":"She started with a cleaning job, and progressed to running the company.","note[5]":"progress to","example[40]":"We must progress towards full integration of Catholic and Protestant pupils in Ireland.","example[41]":"Last year the team didn’t progress beyond the opening round.","note[6]":"progress beyond","definition[10]":"if an activity such as work or a project progresses, or you progress it, it continues","example[42]":"Work on the ship progressed quickly.","example[43]":"We’re hoping to progress the Lane project more quickly next week.","definition[11]":"if time or an event progresses, time passes","example[44]":"As the meeting progressed, Nina grew more and more bored.","example[45]":"Time is progressing, so I’ll be brief.","definition[12]":"to move forward","example[46]":"Our taxi seemed to be progressing very slowly.","definition[13]":"to develop over a period of time, becoming better or more complete","example[47]":"The joint venture is progressing faster than expected.","example[48]":"We haven’t yet progressed to the negotiating table with any US companies.","definition[14]":"if a situation progresses, it continues to happen","example[49]":"As the afternoon progressed, prices nosed upward in light trading.","definition[15]":"the process of improving something, or getting closer to finishing it","example[50]":"The company has made significant financial progress this year.","example[51]":"We’re pleased with the progress of the capital-raising effort.","example[52]":"There has been little progress toward an agreement.","note[7]":"progress toward(s)","example[53]":"He e-mails aprogress report back to head office each month.","definition[16]":"if a plan, project etc is in progress, it has started but is not finished yet","example[54]":"There are only faint signs that an economic recovery is in progress.","example[55]":"Gaston & Snow claims about $37 million in accounts receivable andwork in progress."}