{"word[0]":"cup","signpost[0]":"for drinking","definition[0]":"a small round container, usually with a handle, that you use to drink tea, coffee etc","example[0]":"Mathew picked up the cup and sipped his coffee.","example[1]":"She put her cup and saucer down on the table.","example[2]":"Helen took the coffee cups into the kitchen.","note[0]":"tea/coffee cup","example[3]":"They drank cheap wine from plastic cups.","note[1]":"paper/plastic/china etc cup","definition[1]":"the liquid contained inside a cup","example[4]":"Would you like another cup?","example[5]":"Let’s go and have a cup of coffee.","note[2]":"cup of","example[6]":"Will you stay for a cup of tea?","signpost[1]":"amount of liquid/food","definition[2]":"a unit used in the US for measuring food or liquid in cooking, equal to eight fluid ounces or 237 millilitres","example[7]":"Mix the butter with one cup of powdered sugar until light and fluffy.","definition[3]":"the amount of liquid or food that a cup can hold","example[8]":"Breakfast consisted of half a cup of milk and a dry biscuit.","signpost[2]":"sport competition","definition[4]":"a specially shaped silver container, often with two handles, that is given as a prize in a competition, especially a sports competition","example[9]":"The president of the club came to present the cup to the winners.","definition[5]":"a sports competition in which a cup is given as a prize","example[10]":"They’ve won the European Cup twice.","example[11]":"Germany’s World Cup team","signpost[3]":"round thing","definition[6]":"something round and hollow that is shaped like a cup","example[12]":"The flowers’ white petals contrast handsomely with their lemon-yellow cups.","example[13]":"acorn cups","example[14]":"She held it in the cup of her hand.","signpost[4]":"golf","definition[7]":"a hole in the ground that you have to try to hit the ball into in the game of golf","definition[8]":"the part of a bra that covers a woman’s breast","definition[9]":"a jockstrap","signpost[5]":"alcohol","definition[10]":"a mixed alcoholic drink","example[15]":"He’s gone to get me some fruit cup.","form[0]":"ADJECTIVES/NOUN + cup","collocation[0]":"full","example[16]":"The cup was full of hot tea.","collocation[1]":"empty","example[17]":"A girl was clearing away the empty cups.","collocation[2]":"a paper/plastic/china cup","example[18]":"All they had to drink was warm beer in plastic cups.","collocation[3]":"a coffee cup","example[19]":"He picked up the coffee cups and took them into the kitchen.","collocation[4]":"a tea cup","example[20]":"Mum put a tea cup and saucer on the table.","collocation[5]":"fill a cup","example[21]":"Angie filled the cup and handed it to him.","collocation[6]":"drain/empty a cup","example[22]":"He lifted his cup of coffee and drained it.","collocation[7]":"a cup and saucer","example[23]":"Do you prefer a mug or a cup and saucer?","collocation[8]":"a set of cups","example[24]":"a set of beautiful blue coffee cups","definition[11]":"to hold something in your hands, so that your hands form part of a circle around it","example[25]":"He cupped her face in his hands and kissed her.","example[26]":"Luke was sitting at his desk, one hand cupping his chin.","definition[12]":"an informal name for the FA Cup"}