{"word[0]":"find","past_tense[0]":"found","signpost[0]":"get by searching","definition[0]":"to discover, see, or get something that you have been searching for","example[0]":"I can’t find the car keys.","example[1]":"Hold on while I find a pen.","example[2]":"Her body was later found hidden in the bushes.","example[3]":"I have to find somewhere else to live.","example[4]":"She had almost given up hope of finding a husband.","example[5]":"Her mother went to the shops, and on her return, Kathleen was nowhere to be found (=could not be found).","example[6]":"Tony asked us to find him office facilities in New York.","note[0]":"find somebody something","signpost[1]":"see by chance","definition[1]":"to discover something by chance, especially something useful or interesting","example[7]":"I found a purse in the street.","example[8]":"We found a nice pub near the hotel.","signpost[2]":"discover state of somebody/something","definition[2]":"to discover that someone or something is in a particular condition or doing a particular thing when you see or touch them","example[9]":"I’m sure we’ll find her hard at work when we get home.","example[10]":"He tried the door and found it unlocked.","example[11]":"She woke to find a man by her bed.","example[12]":"Often he found her quietly weeping alone.","note[1]":"find somebody/something doing something","example[13]":"She looked at her glass and was amazed to find it was empty.","note[2]":"find (that)","signpost[3]":"do something without meaning to","definition[3]":"to be in a particular state or do a particular thing, or to realize that this is happening, especially when you did not expect or intend it","example[14]":"After wandering around, we found ourselves back at the hotel.","example[15]":"When he left, Karen found herself heaving a huge sigh of relief.","note[3]":"find yourself/your mind etc doing something","example[16]":"She tried to concentrate, but found her mind drifting back to Alex.","example[17]":"He found he was shivering.","signpost[4]":"learn something by study","definition[4]":"to discover or learn something by study, tests, sums etc","example[18]":"The federal government isn’t doing enough to find a cure.","example[19]":"How do you find the square root of 20?","example[20]":"The liquid was found to contain 7.4g of phenylamine.","note[4]":"be found to do something","example[21]":"His study found that married men and women had similar spending patterns.","note[5]":"find that","explanation[0]":"In more formal English, you say it was found that something was true","example[22]":"It was found that over 50% of children had seen the ad","signpost[5]":"think/feel","definition[5]":"to have a particular feeling or opinion, or to have a particular feeling or opinion about someone or something","example[23]":"Will Gary and Gail find happiness together?","example[24]":"She found the work very dull.","note[6]":"find something/somebody easy/useful/interesting etc","example[25]":"Lots of women I know find him attractive.","example[26]":"I found them quite easy to use.","example[27]":"Hyperactive children find it difficult to concentrate.","note[7]":"find it hard/easy/difficult etc (to do something)","definition[6]":"to have the experience of discovering that something happens or is true","example[28]":"You might find that his work improves now he’s at a new school.","example[29]":"I find people are often surprised at how little it costs.","example[30]":"I think you’ll find more women entering the film business now.","example[31]":"I found the people to be charming and very friendly.","note[8]":"find somebody/something to be something","signpost[6]":"get enough money/time etc","definition[7]":"to succeed in getting enough of something, especially money, time, or energy, to be able to do something","example[32]":"He’s struggling to find the money for the trip.","example[33]":"Where are we going to find the time, the support, and the resources to do all this?","signpost[7]":"in a court of law","definition[8]":"to make an official decision in a court of law","example[34]":"Both men were found guilty of illegally entering the country.","note[9]":"find somebody guilty/not guilty (of something)","example[35]":"The tribunal found in favour of the defendant.","note[10]":"find in somebody’s favour","definition[9]":"to get or see something that you have been searching for","example[36]":"Have you found your passport yet?","example[37]":"Police later found the car abandoned in a wood.","display[0]":"discover","definition[10]":"to find something that was hidden or that people did not know about before","example[38]":"A second bomb has been discovered in south London.","display[1]":"locate","definition[11]":"to find the exact position of something","example[39]":"The airline are still trying to locate my luggage.","example[40]":"Online maps make it easy to locate almost any place in the world.","display[2]":"come across something","definition[12]":"to find something unexpectedly when you are not looking for it","example[41]":"I came across some old letters from my father in my drawer.","display[3]":"stumble on/across something","definition[13]":"to find something unexpectedly, especially something very important","example[42]":"They may have stumbled across some vital evidence.","example[43]":"Completely by chance we had stumbled on the biggest hit of the year.","display[4]":"trace","definition[14]":"to find someone or something that has disappeared, especially by a careful process of collecting information","example[44]":"She had given up all hope of tracing her missing daughter.","display[5]":"track somebody/something down","definition[15]":"to find someone or something that is difficult to find by searching in different places","example[45]":"I’ve been trying to track down a book that’s out of print.","example[46]":"The police managed to track down the killer.","display[6]":"unearth","definition[16]":"to find something that has been hidden or lost for a long time, by digging or searching for it","example[47]":"In 1796, a carved stone was unearthed near the burial mound.","definition[17]":"something that someone finds, especially by digging or by searching under water","example[48]":"important archaeological finds","definition[18]":"if you find work or employment, you get a job or some work. If you find someone to do a job, you employ them to do that job","example[49]":"Karenfound a job with a major travel company after she completed her course.","example[50]":"an assignment tofind a chief executivefor the American Council of Life Insurance","definition[19]":"to discover or learn something by study or RESEARCH","example[51]":"We found 36% of customers interviewed said they had to wait between five and 10 minutes to be served.","example[52]":"The survey found that these drivers were more likely to drive badly and break the law.","definition[20]":"if someone ACCUSED of a crime is found guilty or innocent, a court of law decides that they are guilty or innocent of that crime","example[53]":"All the senior executives were found guilty of conspiring to mislead the markets during the £837 million Blue Arrow rights issue.","note[11]":"be found guilty/innocent of something","definition[21]":"to decide in a court of law whether someone is innocent or guilty of a crime","example[54]":"The Board of Review allowed the taxpayer’s appeal, but the High Court found for the Commissioner.","example[55]":"If the court finds against the bank, its bosses might be replaced with central-bank appointees.","definition[22]":"if you find a computer file, you bring it up on your screen so that you can read it or write in it","example[56]":"Windows lets you find a file without having to remember which program you were using when you created it.","definition[23]":"if you find an amount of money, you have enough money to allow you to do something","example[57]":"The first-time buyer has to find a deposit of 5% or more of the property price."}