{"word[0]":"record","definition[0]":"information about something that is written down or stored on computer, film etc so that it can be looked at in the future","example[0]":"According to official records, five people were killed last year near that road junction.","example[1]":" I try to keep a record of everything I spend.","note[0]":"record of","signpost[0]":"highest/best ever","definition[1]":"the fastest speed, longest distance, highest or lowest level etc that has ever been achieved or reached, especially in sport","example[2]":"The American team set a new world record in the sprint relay.","definition[2]":"a round flat piece of plastic with a hole in the middle that music and sound are stored on","example[3]":"I spent a lot of time listening to records.","example[4]":"My dad’s got a huge record collection.","example[5]":"a major British record company","signpost[1]":"past activities","definition[3]":"the facts about how successful, good, bad etc someone or something has been in the past","example[6]":"the company’s track record in improving conditions","example[7]":"Chemistry graduates have a good record in finding employment.","note[1]":"record of/in (doing) something","example[8]":"Mr Davis defended the government’s record on unemployment  (=what they have done about unemployment).","note[2]":"record on","definition[4]":"information kept by the police that shows someone has committed a crime","example[9]":"He’s only 18 and he already has a record.","example[10]":"They won’t employ anyone with a criminal record.","heading[0]":"– Meaning 1: information about something that is written down or stored on computer, film etc so that it can be looked at in the future","collocation[0]":"the records show something","example[11]":"Official records show that 44 businesses have stopped trading in the last 12 months.","collocation[1]":"keep a record","example[12]":"Teachers keep a record of students’ progress.","collocation[2]":"maintain a record","example[13]":"The directors are responsible for maintaining adequate accounting records.","collocation[3]":"place/put something on record","example[14]":"I wish to put on record my objection to the scheme.","collocation[4]":"access records","example[15]":"Every citizen has the right to access their medical records.","form[0]":"ADJECTIVES/NOUN + record","collocation[5]":"a written record","example[16]":"Where written records do survive, they are incomplete.","collocation[6]":"historical records","example[17]":"Using historical records, we have produced an image of the temple.","collocation[7]":"official records","example[18]":"This has been the wettest winter since official records began.","collocation[8]":"an accurate record","example[19]":"Many hospitals did not keep accurate records.","collocation[9]":"a detailed record","example[20]":"Edwardian travellers left detailed records of their journeys.","collocation[10]":"a proper record","example[21]":"Failure to maintain proper records would be a criminal offence.","collocation[11]":"confidential records","example[22]":"They were transferring confidential student records onto computer.","collocation[12]":"a permanent record","example[23]":"You will have a permanent record of your work.","collocation[13]":"medical/hospital/health etc records","example[24]":"The hospital could not find my mother’s medical records.","example[25]":"Patients’ hospital records are kept on a database.","collocation[14]":"financial records","example[26]":"The company’s financial records must be up-to-date.","collocation[15]":"public records","example[27]":"He found the information while examining public records.","collocation[16]":"police records","example[28]":"Violent assaults rose 39 percent, according to police records.","collocation[17]":"the biggest/highest etc on record","example[29]":"Last summer was one of the hottest on record.","collocation[18]":"a matter of public record","example[30]":"His salary is a matter of public record.","heading[1]":"– Meaning 2: the fastest speed, longest distance, highest or lowest level etc that has ever been achieved or reached, especially in sport","collocation[19]":"break/beat a record","example[31]":"He broke the world record twice.","collocation[20]":"smash/shatter a record","example[32]":"She smashed the record by a massive 28 seconds.","collocation[21]":"hold a record","example[33]":"Davies holds the record for most points in a season.","collocation[22]":"set a record","example[34]":"The twenty-year-old set a new British record of 44.47 secs.","collocation[23]":"equal a record","example[35]":"Woods equalled the course record and finished eleven under par.","example[36]":"Davis tied a team record by hitting six field goals.","collocation[24]":"a record stands","example[37]":"His record stood for 42 years.","collocation[25]":"a record falls","example[38]":"Another record will fall on the last day of the season, if Arsenal win their final game.","collocation[26]":"an all-time record","example[39]":"The price of oil has hit an all-time record.","collocation[27]":"a world record","example[40]":"Powell equalled the 100 metres world record with a time of 9.77 seconds.","collocation[28]":"an Olympic record","example[41]":"He won a gold medal and broke the Olympic record by 44 records.","collocation[29]":"a British/American/Italian etc record","example[42]":"Jones won in 10.93 seconds, a new British record.","collocation[30]":"a course/track record","example[43]":"Lewis set the fastest lap with a new track record.","collocation[31]":"a club/team record","example[44]":"Irvin holds a team record with 111 catches this season.","form[1]":"record + NOUN","collocation[32]":"a record number/level/time etc","example[45]":"Pollution in the lake has reached record levels.","collocation[33]":"a record high/low","example[46]":"The stock market reached a record high on August 21.","collocation[34]":"a record attempt","example[47]":"They will make another record attempt next year.","definition[5]":"information about something that is written down","example[48]":"your medical records","example[49]":"the public records office","example[50]":"I have to keep a record of all my spending when I’m travelling on business.","display[0]":"file","definition[6]":"a set of written records, or information stored on a computer under a particular name","example[51]":"He began reading the file on the case.","example[52]":"I think I may have accidentally deleted the file.","display[1]":"accounts","definition[7]":"an exact record of the money that a company has received and spent","example[53]":"Companies are required by law to publish their annual accounts.","example[54]":"Someone had been falsifying the accounts.","example[55]":"The company’s books all seemed to be in order.","display[2]":"ledger","definition[8]":"one of the official books in which a company’s financial records are kept, which show how much it has received and spent","example[56]":"The costs have been moved from one column of the ledger to another.","display[3]":"minutes","definition[9]":"an official written record of what is said and decided at a meeting","example[57]":"Both points are mentioned in the minutes of the last meeting on August 3rd.","display[4]":"diary","definition[10]":"a book in which you regularly write down the things that have happened to you","example[58]":"In his diary he wrote, ‘It s lovely having him here, we’ve had so many cosy talks.’","example[59]":"I’ll just check in my diary to see if I’m free.","display[5]":"blog","definition[11]":"a web page on the Internet on which someone regularly writes about their life, opinions, or a particular subject","example[60]":"I may not always agree with David, but I always read his blog.","display[6]":"register","definition[12]":"an official list of names of people, organizations etc","example[61]":"Guests must sign the hotel register.","example[62]":"the national register of births, deaths, and marriages","example[63]":"Lloyds Register of Shipping","display[7]":"roll","definition[13]":"an official list of names, especially of people who are allowed to do something such as vote or be in a class at school","example[64]":"the electoral roll  (=list of people who can vote in an area)","example[65]":"The teacher called the roll  (=read out the list of the names of the students, who then have to say if they are present).","display[8]":"log","definition[14]":"an official record that is kept on a ship or plane","example[66]":"Mr Appleby said he complained to a senior officer, who made a note in the ship’s log.","definition[15]":"to write information down or store it in a computer or on film so that it can be looked at in the future","example[67]":"Her husband made her record every penny she spent.","example[68]":"The coroner recorded a verdict of accidental death.","example[69]":"He recorded that the operation was successful.","note[3]":"record that","example[70]":"In 1892 it is recorded that the weather became so cold that the river froze over.","definition[16]":"to store music, sound, television programmes etc on a disc or tape so that people can listen to them or watch them again","example[71]":"The group has just recorded a new album.","example[72]":"Is the machine still recording?","example[73]":"I’ll record the film and we can all watch it later.","definition[17]":"if an instrument records the size, speed, temperature etc of something, it measures it and keeps that information","example[74]":"Wind speeds of up to 100 mph have been recorded.","definition[18]":"a piece of information that is written down or stored on computer, film etc so that it can be looked at in the future","example[75]":"The exchange checked its employment records but found no trace of the individual involved.","example[76]":"There’s no record of what was said at their private meetings.","definition[19]":"written down or stored in a record","example[77]":"The Italian market had one of its most depressing years on record  (=that has ever been recorded).","definition[20]":"the best or highest level that has ever been reached","example[78]":"The price surpassed the previous record of $165,000 for one of his paintings.","definition[21]":"the known facts about the past behaviour and success of a person or company","example[79]":"The company had a solid record of sales growth for several years.","example[80]":"He has an impressive track record (=record).","example[81]":"He strongly defended his record as chief executive.","note[4]":"record as","definition[22]":"highest, lowest etc ever","example[82]":"a record amount of debt","example[83]":"Corporations issued a record $200 billion in bonds.","definition[23]":"to write information down or store it in a computer etc so that it can be looked at in the future","example[84]":"We record the amount of time that people have off work because of sickness.","definition[24]":"if a company, share etc records gains, losses etc of a particular amount, it makes those gains, losses etc","example[85]":"Shares recorded sharp gains as market worries lessened."}