{"word[0]":"sacrifice","definition[0]":"when you decide not to have something valuable, in order to get something that is more important","example[0]":"The minister stressed the need for economic sacrifice.","example[1]":"The workforce were willing to make sacrifices in order to preserve jobs.","example[2]":"She brought three children up single-handedly, often at great personal sacrifice.","definition[1]":"the act of offering something to a god, especially in the past, by killing an animal or person in a religious ceremony","example[3]":"They made sacrifices to ensure a good harvest.","definition[2]":"an animal, person, or object offered to a god in sacrifice","example[4]":"a human sacrifice  (=a person killed as a sacrifice)","example[5]":"In those days, an animal was offered as a sacrifice to God.","note[0]":"sacrifice to","definition[3]":"to willingly stop having something you want or doing something you like in order to get something more important","example[6]":"A Labour government chose to sacrifice defence for welfare.","note[1]":"sacrifice something for something","example[7]":"He sacrificed a promising career to look after his kids.","note[2]":"sacrifice something to do something","example[8]":"mothers who sacrifice themselves for their children","note[3]":"sacrifice yourself (for something)","explanation[0]":"In everyday English, people often say give up rather than sacrifice:","example[9]":"He gave up a promising career to look after his kids.","definition[4]":"to kill an animal or person and offer them to a god in a religious ceremony","definition[5]":"something valuable that you decide not to have, in order to get something that is more important","example[10]":"The directors are willing to make certain sacrifices to make the company financially viable.","example[11]":"Lawyers who choose to work in smaller firms often make a substantial economic sacrifice.","example[12]":"The self-employed sacrifice security for the power to regulate their own careers.","note[4]":"sacrifice something for","example[13]":"In order to stay competitive, the company has had to sacrifice profit margins."}