{"word[0]":"index","plural[0]":"indexes","definition[0]":"an alphabetical list of names, subjects etc at the back of a book, with the numbers of the pages where they can be found","definition[1]":"a set of cards or a database containing information, usually arranged in alphabetical order and used especially in a library","definition[2]":"a standard by which the level of something can be judged or measured","example[0]":"The changing size of an infant’s head is considered an index of brain growth.","note[0]":"index of","definition[3]":"a system by which prices, costs etc can be compared to those of a previous date","definition[4]":"if documents, information etc are indexed, an index is made for them","example[1]":"The reports are indexed by subject and location.","definition[5]":"to arrange for the level of wages, pensions etc to increase or decrease according to the level of prices","example[2]":"demands that wages be indexed to the rise in prices","note[1]":"be indexed to something","example[3]":"an amount indexed for inflation","note[2]":"be indexed for something","explanation[0]":"Index is usually passive","definition[6]":"something such as a price, amount, level etc that shows the general level of related prices etc","example[4]":"The price of gold bullion on the exchange remains a sensitive index of confidence in the international market.","definition[7]":"a figure showing the level of something, for example prices, in relation to earlier levels. Indexes often use the figure 100 as the BASE in a particular year and figures for later years are given in relation to this base","definition[8]":"an official list of the average price of shares in a group of companies on a particular stockmarket","example[5]":"Milan’s Stock Index fell 2% in the year.","example[6]":"the Nikkei share index","definition[9]":"to arrange for the level of payments such as wages or PENSIONs to go up at the same rate as something else, usually prices","example[7]":"Tax exemptions should be indexed to the purchasing power of the pound.","note[3]":"index something to something","definition[10]":"if an investment is indexed to something, for example a currency or a STOCK INDEX,  its value rises and falls in relation to the currency etc","example[8]":"The yield of Ukrainian treasury bills is indexed to the value of the local currency, the hryvnia, in terms of the dollar."}