{"word[0]":"responsible","signpost[0]":"guilty","definition[0]":"if someone is responsible for an accident, mistake, crime etc, it is their fault or they can be blamed","example[0]":"If anything goes wrong, I will hold you personally responsible.","note[0]":"hold somebody responsible (for something)","example[1]":"We are determined to bring the people responsible to justice.","note[1]":"the person/people etc responsible","example[2]":"Police believe that the same man is responsible for three other murders in the area.","note[2]":"responsible for","signpost[1]":"in charge of","definition[1]":"having a duty to be in charge of or to look after someone or something","example[3]":"Mills is responsible for a budget of over $5 million.","example[4]":"The airline is legally responsible for the safety of its passengers.","example[5]":"He is responsible for recruiting and training new staff.","note[3]":"responsible for doing something","definition[2]":"if something is responsible for a change, problem, event etc, it causes it","example[6]":"The floods were responsible for over a hundred deaths.","signpost[2]":"sensible","definition[3]":"sensible and able to make good judgments, so that you can be trusted","opposite[0]":"irresponsible","example[7]":"You can leave the children with Billy – he’s very responsible.","example[8]":"It’s time you started acting like a responsible adult.","note[4]":"responsible adult/citizen","explanation[0]":"Responsible is always an adjective, never a noun","example[9]":"Who is responsible?","bad_example[0]":"Who is the responsible?","explanation[1]":"The person/man/woman etc responsible is the person who has done something, usually something bad","example[10]":"We will catch the person responsible","bad_example[1]":"We will catch the responsible","bad_example[2]":"We will catch the responsible person","explanation[2]":"You say that someone is responsible for something","example[11]":"Who is responsible for this mess?","example[12]":"Claire is responsible for marketing","bad_example[3]":"be responsible of something","definition[4]":"to be officially in charge of something as part of your job, meaning you must accept the blame if something goes wrong","example[13]":"Partners are officially responsible for all the firm’s financial obligations.","example[14]":"the City watchdog responsible for regulating fund managers","definition[5]":"if you are responsible to someone in your job, you have to report your actions, progress etc to them","example[15]":"The Computer Group Manager is responsible to the Head of Computer Development.","definition[6]":"a job, position etc in which the ability to make good judgements and decisions is important","example[16]":"As works manager, I had an interesting and responsible job."}