{"word[0]":"currency","plural[0]":"currencies","definition[0]":"the system or type of money that a country uses","example[0]":"The bank can supply you with foreign currency.","example[1]":"The euro is the single currency for 12 of the European Union’s 15 member states.","example[2]":"The local currency is the Swiss franc.","definition[1]":"the state of being accepted or used by a lot of people","example[3]":"The argument has received wide currency.","example[4]":"Marxism began to gain currency.","example[5]":"The idea was common currency in European political life.","form[0]":"ADJECTIVES/NOUN + currency","collocation[0]":"foreign currency","example[6]":"You can buy foreign currency at the post office.","collocation[1]":"the local/national currency","example[7]":"The local currency of Zambia is the 'kwacha'.","collocation[2]":"a single currency","example[8]":"Britain does not use the single currency.","collocation[3]":"a hard/strong currency","example[9]":"They accept American dollars and other hard currencies.","collocation[4]":"weak","example[10]":"The fund was set up to support weak currencies.","collocation[5]":"stable","example[11]":"The government want to maintain a stable currency.","collocation[6]":"change/convert currency","example[12]":"There’s usually a charge for converting currencies.","collocation[7]":"devalue the currency","example[13]":"The Finance Minister was forced to devalue the currency.","collocation[8]":"a currency rises/falls","example[14]":"The currency fell from 144 to the dollar twelve months ago to 812.","form[1]":"currency + NOUN","collocation[9]":"currency exchange","example[15]":"Banks make good profits on currency exchange.","collocation[10]":"the currency markets","example[16]":"the dollar’s recent rise on the currency markets","collocation[11]":"currency movements/fluctuations","example[17]":"Global trends such as oil prices influence currency movements.","definition[2]":"the system or type of money used in a particular country","example[18]":"The local currency is the rupee.","example[19]":"The dollar was lower against European currencies.","definition[3]":"in the US, banknotes and coins, especially when considered as part of the MONEY SUPPLY (=the amount of money in an economy at a particular time)","example[20]":"The money supply, essentially the sum of all currency and bank deposits, barely grew in the fourth quarter."}