{"word[0]":"thinking","definition[0]":"your opinion or ideas about something, or your attitude towards it","example[0]":"The Administration’s thinking changed as the war progressed.","example[1]":"Well, to my way of thinking (=in my opinion), they should have done that years ago.","example[2]":"He laughed and accused me of wishful thinking (=falsely believing that something will happen just because I want it to).","example[3]":"the rich countries’ current thinking on aid","example[4]":"the thinking behind the company’s new public relations campaign","note[0]":"thinking behind","definition[1]":"when you think about something","note[1]":"clear/critical/analytical etc thinking (=a particular way of thinking about things)","example[5]":"If it weren’t for Jeff’s quick thinking, Tillie could have been badly hurt.","example[6]":"I really needed to do some thinking.","heading[0]":"– Meaning 2: when you think about something","collocation[0]":"do some thinking","example[7]":"I’ve had a chance to do some thinking.","collocation[1]":"quick thinking","example[8]":"He was only saved by the quick thinking of two doctors.","collocation[2]":"hard thinking","example[9]":"Over the next two days a lot of hard thinking went into the campaign.","collocation[3]":"serious thinking","example[10]":"Your mother and I have been doing some serious thinking.","collocation[4]":"clear/logical thinking","example[11]":"Above 24,000 feet, the lack of oxygen makes clear thinking almost impossible.","collocation[5]":"critical thinking","example[12]":"Rudi wanted them to practice critical thinking by analysing the world they lived in.","collocation[6]":"creative thinking","example[13]":"Her solution to the problem was an example of good creative thinking.","collocation[7]":"joined-up thinking","example[14]":"The media has criticized the lack of joined-up thinking in the government’s plans for dealing with a terrorist attack.","collocation[8]":"good thinking","example[15]":"‘We’d better lock the door.’ ‘Good thinking.’","definition[2]":"a thinking person is intelligent and tries to think carefully about important subjects"}