{"word[0]":"coverage","definition[0]":"when a subject or event is reported on television or radio, or in newspapers","example[0]":"live coverage of the match  (=the match is broadcast at the same time that it is happening)","example[1]":"The allegations received widespread media coverage.","note[0]":"media/press etc coverage","definition[1]":"the protection an insurance company gives you, so that it pays you money if you are injured, something is stolen etc","example[2]":"health care coverage","definition[2]":"the range of subjects and facts included in a book, programme, class etc","example[3]":"Prestel’s website provides good coverage of the subject.","note[1]":"coverage of","definition[3]":"when something affects or covers a particular area or group of things","example[4]":"More satellites are needed to provide telephone coverage in remote areas.","form[0]":"ADJECTIVES/NOUN + coverage","collocation[0]":"media/press coverage","example[5]":"The case has received wide press coverage.","collocation[1]":"television/newspaper/radio coverage","example[6]":"The private lives of celebrities get a lot of newspaper coverage.","collocation[2]":"news coverage","example[7]":"The BBC won an award for its 24-hour news coverage.","collocation[3]":"election/sports/political etc coverage","example[8]":"He claims the election coverage has been biased against him.","collocation[4]":"live coverage","example[9]":"There will be live coverage of the concert.","collocation[5]":"full coverage","example[10]":"Both channels are giving the election full coverage.","collocation[6]":"local/national/international coverage","example[11]":"Bangladesh doesn't get much international coverage.","collocation[7]":"extensive/wide/widespread coverage","example[12]":"Newspapers and magazines have wide coverage of diet and health topics.","collocation[8]":"receive/get/have coverage","example[13]":"The exhibition has received extensive coverage in the press.","collocation[9]":"provide coverage","example[14]":"Satellite coverage of the Olympics was first provided in 1968.","collocation[10]":"give something coverage","example[15]":"In the west, the story wasn't given any media coverage.","definition[4]":"the area served by a broadcaster or MOBILE PHONE company","example[16]":"one-2-one now has nationwide coverage with its network.","definition[5]":"the amount of protection given to you by an insurance agreement","example[17]":"Make sure the policy gives adequate coverage against burglary."}