{"word[0]":"reply","definition[0]":"to answer someone by saying or writing something","example[0]":"I asked Clive where he was going, but he didn’t reply.","example[1]":"Sorry it took me so long to reply.","example[2]":"‘Did you see Simon today?’ ‘Of course, ’ Nathalie replied with a smile.","example[3]":"Has Ian replied to your letter yet?","note[0]":"reply to","example[4]":"Mills replied that he was staying at his parents’ flat.","note[1]":"reply that","explanation[0]":"Reply is used especially in written English. In everyday English, people usually say answer: ","definition[1]":"to react to an action by doing something else","example[5]":"The rebel troops replied to government threats with increased violence.","note[2]":"reply (to something) with something","plural[0]":"replies","definition[2]":"something that is said, written, or done as a way of replying","example[6]":"I tried calling, but there was no reply.","example[7]":"Stephen made no reply.","example[8]":"We still haven’t received a reply to our letter.","explanation[1]":"Reply is used especially in written English. In everyday English, people usually say answer:","example[9]":"I tried calling but there was no answer.","past_tense[0]":"replied","definition[3]":"to answer someone, in writing or in speech","example[10]":"Asked about the bank’s operations, the chairman replied that the record speaks for itself.","example[11]":"Our aim is to reply to all letters within 10 working days.","note[3]":"reply to somebody/something","definition[4]":"a written or spoken answer","example[12]":"The Exchange said it had received a satisfactory reply from the bank.","example[13]":"We await your reply.","definition[5]":"a letter answering one that has been received","example[14]":"I received the standard letter of reply in response to my complaints.","definition[6]":"a way of starting a letter that answers one that has been received","example[15]":"In reply to your letter of 24 Jan, I am sorry to hear our product has not met our usual high standards.","definition[7]":"an envelope for which the cost of posting has already been paid POSTAGE PAID ENVELOPE","example[16]":"Use the enclosed reply-paid envelope (no stamp needed)."}