{"word[0]":"punish","definition[0]":"to make someone suffer because they have done something wrong or broken the law","example[0]":"Smacking is not an acceptable way of punishing a child.","example[1]":"He promised to punish severely any officials found guilty of electoral fraud.","example[2]":"It’s unfair to punish a whole class for the actions of one or two students.","note[0]":"punish somebody for (doing) something","example[3]":"They deserve to be punished for putting passengers at risk.","example[4]":"I felt I was being punished for what my mother had done.","example[5]":"My parents decided to punish me by withdrawing financial support.","note[1]":"punish somebody by doing something","example[6]":"The House voted to punish the senator with a formal reprimand.","note[2]":"punish somebody with something","definition[1]":"if a crime is punished in a particular way, anyone who is guilty of it is made to suffer in that way","example[7]":"In some societies, theft is punished by death.","note[3]":"be punished by/with something","explanation[0]":"Punish is usually passive in this meaning","definition[2]":"to do something unpleasant to someone because they have done something wrong or broken the law","example[8]":"Drug smugglers are severely punished.","example[9]":"She wanted to punish him for deceiving her.","definition[3]":"to make someone pay money as a punishment","example[10]":"The company was fined for safety violations.","display[0]":"sentence","definition[4]":"if a judge sentences a criminal, he or she gives them an official punishment, usually sending them to prison for a period of time","example[11]":"The judge sentenced Margolis to a year in prison.","display[1]":"penalize","definition[5]":"to officially punish someone, especially by taking away their right to do something or by limiting their freedom in some way","example[12]":"New laws will penalize  firms that continue to pollute the environment.","display[2]":"discipline","definition[6]":"to punish someone who has broken the rules of an organization that they belong to or work for","example[13]":"Officers are expected to discipline soldiers who do not keep their uniforms in good condition.","display[3]":"come down hard on somebody","definition[7]":"to punish someone or criticize them severely","example[14]":"The judge came down hard on Harris, saying that his crime was ‘inexcusable’.","display[4]":"make an example of somebody","definition[8]":"to punish someone so that other people are afraid to do the same thing","example[15]":"Athletics officials felt they had to make an example of him for using banned drugs.","display[5]":"teach somebody a lesson","definition[9]":"to do something in order to show someone that they must not do something again, when they have behaved very badly","example[16]":"I didn't want to hurt him - I just wanted teach him a lesson.","example[17]":"Maybe a night in jail will teach him a lesson.","display[6]":"make somebody pay (for something)","definition[10]":"to make someone wish they had never done something, by making them suffer","example[18]":"We should make him pay for all the mischief he's caused!"}