{"word[0]":"replace","definition[0]":"to start doing something instead of another person, or start being used instead of another thing","example[0]":"I’m replacing Sue on the team.","example[1]":"Lectures have replaced the old tutorial system.","definition[1]":"to remove someone from their job or something from its place, and put a new person or thing there","example[2]":"Two of the tyres had to be replaced.","example[3]":"They replaced the permanent staff with part-timers.","note[0]":"replace something with something","definition[2]":"if you replace something that has been broken, stolen etc, you get a new one","example[4]":"I’ll replace the vase I broke as soon as possible.","definition[3]":"to put something back where it was before","example[5]":"He replaced the book on the shelf.","heading[0]":"a person","definition[4]":"if one person replaces another, they do a job or activity instead of the other person, usually permanently","example[6]":"The opposition leader Zhelyu Zhelev was elected to replace him.","example[7]":"How will we ever find anyone who can replace you?","example[8]":"The lead singer was replaced by Ray Willis back in 1992.","display[0]":"take somebody's place/take the place of somebody","definition[5]":"to do something instead of someone","example[9]":"It will be difficult to find someone to take her place.","example[10]":"Doctor Rice is on holiday. I'm taking his place.","example[11]":"The court may allow another relative to take the place of the parent.","display[1]":"take over","definition[6]":"to replace someone in a job or position, and continue their work","example[12]":"The new manager took over in July.","example[13]":"Sales are up  (=they have increased)since he took over the company.","display[2]":"stand in for somebody","definition[7]":"to replace someone at work on a particular occasion","example[14]":"She was filming in Australia, so she asked a friend to stand in for her at the awards ceremony.","example[15]":"During the dangerous scenes, stuntmen and women stand in for the actors.","display[3]":"fill in for somebody","definition[8]":"to replace someone in a job for a short time","example[16]":"Susan will fill in for me while I'm away.","heading[1]":"a thing","definition[9]":"if one thing replaces another, it is used instead of the other thing, usually permanently","example[17]":"The car was old and needed replacing.","example[18]":"Computers have replaced typewriters.","display[4]":"take something's place/take the place of something","definition[10]":"to be used instead of another thing","example[19]":"If any of the eight units fails, its place will be taken by the back-up unit.","example[20]":"MP3 players are taking the place of CDs.","example[21]":"Ugly concrete apartment buildings have taken the place of the old houses.","display[5]":"supersede","definition[11]":"to take the place of something – used especially about inventions, methods, organizations etc","example[22]":"The League of Nations was superseded by the United Nations in 1946.","example[23]":"Analysis by manual calculation has been superseded by more modern computer-based methods.","example[24]":"Goose used to be a traditional Christmas bird until turkey superseded it in popularity.","example[25]":"Iron began to supersede bronze for tool making about 3000 years ago.","display[6]":"substitute something for something","definition[12]":"to use something instead of the thing that you usually use, because the usual thing is not available – used especially about food","example[26]":"You can substitute margarine for butter in most recipes.","explanation[0]":"In everyday English, people usually say put something back rather than replace something: ","example[27]":"Don't forget to put the books back when you've finished.","definition[13]":"to start being used, doing a job etc instead of something or someone else","example[28]":"The tax replaces a levy of 13.5% on manufactured goods.","example[29]":"He will be replaced as chief executive by the current finance director.","definition[14]":"to start using something instead of something else","example[30]":"Annual wage increases will be replaced with a bonus system.","definition[15]":"to remove someone from their job, position etc and give the job to a different person","note[1]":"replace somebody with somebody","definition[16]":"to give someone a product instead of one that they bought which was damaged or not perfect","example[31]":"The shop offered to replace the television for me."}