{"word[0]":"bridge","signpost[0]":"over a river/road etc","definition[0]":"a structure built over a river, road etc that allows people or vehicles to cross from one side to the other","signpost[1]":"connection","definition[1]":"something that provides a connection between two things","synonym[0]":"link","example[0]":"The training programme is seen as a bridge between school and work.","note[0]":"bridge between/to","example[1]":"a scheme to build bridges  (=make a better relationship) between the police and the community","definition[2]":"the raised part of a ship from which the officers control it","signpost[2]":"card game","definition[3]":"a card game for four players, who play in pairs","signpost[3]":"pair of glasses","definition[4]":"the part of a pair of glasses that rests on your nose","definition[5]":"a small piece of wood under the strings of a violin or guitar, used to keep them in position","signpost[4]":"for teeth","definition[6]":"a small piece of metal that keeps false teeth in place by attaching them to your real teeth","collocation[0]":"build a bridge","example[2]":"Finally a new bridge was erected over the road.","collocation[1]":"cross a bridge","example[3]":"An estimated 150,000 cars cross the bridge each day.","collocation[2]":"a bridge crosses something","example[4]":"A pretty stone bridge crosses the little river.","collocation[3]":"a bridge spans something","example[5]":"By 1875 a railroad bridge spanned the Missouri.","collocation[4]":"a bridge links something to/with something","example[6]":"There's a road bridge linking the site with Stockton town centre.","form[0]":"types of bridge","collocation[5]":"a stone/wooden/iron bridge","example[7]":"The iron bridge was built in 1811.","collocation[6]":"a railway bridge","example[8]":"Go under the railway bridge and turn right.","collocation[7]":"a road bridge","example[9]":"The government plans to construct a new road bridge to the island.","collocation[8]":"a suspension bridge","example[10]":"A famous suspension bridge spans the estuary.","collocation[9]":"a swing bridge","collocation[10]":"a toll bridge","collocation[11]":"a humpback bridge","definition[7]":"to reduce or get rid of the difference between two things","example[11]":"The differences between our two cultures can be bridged if we continue to communicate.","example[12]":"Alvin managed to bridge the gap between ballet and modern dance.","definition[8]":"to build or form a bridge over something","example[13]":"a fallen tree bridging the stream","definition[9]":"an arrangement to borrow money for a short time until you can make more long term financial arrangements","example[14]":"The company would have collapsed without bridge finance."}