{"word[0]":"term","signpost[0]":"word","definition[0]":"a word or expression with a particular meaning, especially one that is used for a specific subject or type of language","example[0]":"Journalists were told in no uncertain terms that they were not welcome.","note[0]":"in no uncertain terms","example[1]":"‘Multimedia’ is the term for any technique combining sounds and images.","note[1]":"term for","signpost[1]":"period of time","definition[1]":"a fixed period of time during which someone does something or something happens","example[2]":"The mayor was coming to the end of his term in office.","note[2]":"term of/in office","example[3]":"The men each received a 30-year prison term.","note[3]":"prison/jail term","example[4]":"the maximum term of imprisonment","note[4]":"term of","example[5]":"The lease runs for a term of 99 years.","signpost[2]":"school/university","definition[2]":"one of the periods of time that the school or university year is divided into. In Britain, there are usually three terms in a year.","example[6]":"Teachers often feel overworked in term time (=during the term).","example[7]":"The exams are at the end of the summer term.","note[5]":"summer/autumn/spring term","example[8]":"that all-important first day of term","note[6]":"first/last day of term","definition[3]":"the end of a particular period of time","example[9]":"The agreement reaches its term next year.","example[10]":"a child born two months before full term (=of pregnancy)","example[11]":"We can prolong life beyond its natural term.","signpost[3]":"number/sign","definition[4]":"one of the numbers or signs used in a mathematical calculation","heading[0]":"– Meaning 3: a word or expression with a particular meaning, especially one that is used for a specific subject or type of language","form[0]":"ADJECTIVES/NOUN + term","collocation[0]":"a legal/medical term","example[12]":"The site provides a glossary of legal terms.","collocation[1]":"a technical term","example[13]":"‘Gender’ is a technical term in grammar.","collocation[2]":"a slang term","example[14]":"‘The Old Bill’ is a slang term for the police.","collocation[3]":"a derogatory/pejorative term","example[15]":"‘Pinko’ is a derogatory term for someone with socialist ideas.","collocation[4]":"use a term","example[16]":"a term used by psychiatrists","collocation[5]":"coin a term","example[17]":"Funk coined the term ‘vitamin’ in 1912.","collocation[6]":"a term of abuse","example[18]":"‘Geek’ is used as a term of abuse.","collocation[7]":"a term of endearment","example[19]":"terms of endearment like ‘love’, ‘dear’, and ‘honey’","collocation[8]":"in strong terms","example[20]":"The pope condemned both Nazism and Communism in strong terms.","collocation[9]":"in glowing terms","example[21]":"Friends and relatives speak of him in glowing terms.","collocation[10]":"in layman’s terms","example[22]":"Can you explain to me in layman’s terms how my computer works?","heading[1]":"– Meaning 4: a fixed period of time during which someone does something or something happens","collocation[11]":"a prison/jail term","example[23]":"He faced a maximum prison term of 25 years.","collocation[12]":"a five-year/ten-year term","example[24]":"The president is elected for a five-year term.","collocation[13]":"a fixed term","example[25]":"The contract was for a fixed term of five years.","collocation[14]":"a maximum/minimum term","example[26]":"The maximum term was life imprisonment.","collocation[15]":"a term of/in office","example[27]":"The governor ends his term of office in September.","collocation[16]":"a term of imprisonment/detention","example[28]":"She was sentenced to a long term of imprisonment.","collocation[17]":"serve a term","example[29]":"She served a term as chairwoman of the council.","heading[2]":"– Meaning 5: one of the periods of time that the school or university year is divided into. In Britain, there are usually three terms in a year.","collocation[18]":"the beginning/start of term","example[30]":"The beginning of term was only two days away.","collocation[19]":"the end of term","example[31]":"We had a party at the end of term.","collocation[20]":"the first/last day of term","example[32]":"On the last day of term we went home early.","collocation[21]":"a school/university term","example[33]":"The school term was about to start.","collocation[22]":"a new term","example[34]":"Are you looking forward to the new term?","collocation[23]":"the spring/summer/autumn term","example[35]":"Mrs Collins will be leaving us at the end of the summer term.","collocation[24]":"in/during term time","example[36]":"Parents need permission to take their children on holiday during term time.","definition[5]":"to use a particular word or expression to name or describe something","example[37]":"This condition is sometimes termed RSI, or repetitive strain injury.","note[7]":"be termed something","example[38]":"These developments are loosely termed ‘advanced manufacturing techniques’.","example[39]":"Roosevelt termed himself and his policies ‘liberal’.","note[8]":"term yourself something","explanation[0]":"Term is often used in the passive","definition[6]":"a word or expression that has a particular meaning, especially in a technical or scientific subject","example[40]":"a glossary of business terms","example[41]":"Multimedia is the industry term for any technique that uses computers to combine sound and images.","definition[7]":"a change of a price or cost in real terms has been calculated to include the effects of other changes such as INFLATION (=price rises over time)","example[42]":"Cocoa prices fell to their lowest in real terms for over 50 years.","definition[8]":"one of the conditions of an agreement, contract, or other legal document","example[43]":"Under the terms of the contract, the company was to deliver 1,000 megawatts of electricity to New York.","definition[9]":"the conditions under which you agree to buy or sell something","example[44]":"You may be able to find another policy offering the same cover on more favourable terms (=more cheaply, with easier ways to pay etc).","definition[10]":"having the same advantages, rights etc as anyone else","example[45]":"US companies want to be able to compete on equal terms with their overseas rivals.","definition[11]":"the agreed limits of what an official committee or report has been asked to study","example[46]":"The matter of compensation is not within the committee’s terms of reference.","definition[12]":"over a period of time from now until a long, short etc time into the future","example[47]":"The company’s prospects look good in the long term.","definition[13]":"a period of time for which someone has an important job or position, or that a government has power","example[48]":"The chairman’s term is six years.","example[49]":"The President hopes to be elected to a second term of office.","definition[14]":"the period of time that a legal right or agreement continues for","example[50]":"New legislation would lengthen the term of patent protection to 20 years.","example[51]":"Expenses are refundable over the term of the contract (=during the time that it continues).","definition[15]":"the period of time before something has to be paid or repaid","example[52]":"We’re trying to extend the term on our mortgage.","example[53]":"a promissory note with a term of 6 months","definition[16]":"the end of the period of a business agreement","example[54]":"The policy reaches its term next year.","definition[17]":"the period of time that an insurance contract lasts for, especially when this is less than one year","example[55]":"He discussed the formation of what he termed ‘strategic alliances’.","definition[18]":"money that is put in a bank or a loan that is given for a particular length of time","example[56]":"US dollar term deposits can be an excellent investment choice for you.","example[57]":"Its credit line was converted to a term loan that matures Oct. 31."}