{"definition[0]":"hard to do, understand, or deal with","opposite[0]":"easy","example[0]":"a difficult question","example[1]":"an immensely difficult task","example[2]":"Was the exam very difficult?","example[3]":"It’s difficult to see how more savings can be made.","example[4]":"That’s rather difficult for me to explain.","note[0]":"difficult (for somebody) to understand/find/obtain etc","example[5]":"He’s finding it difficult to get a job.","definition[1]":"involving a lot of problems and causing a lot of trouble or worry","example[6]":"a difficult situation","example[7]":"Things are a bit difficult at home at the moment.","example[8]":"There could be difficult times ahead.","example[9]":"She’s doing everything she can to make life difficult for him.","note[1]":"make life/things difficult for somebody","definition[2]":"someone who is difficult never seems pleased or satisfied","synonym[0]":"awkward","example[10]":"Don’t be so difficult!","example[11]":"a difficult customer","definition[3]":"not easy to do, understand, or deal with","example[12]":"The homework was really difficult.","example[13]":"It is difficult to see how peace can be achieved in the region.","definition[4]":"difficult. Hard is less formal than difficult and is very common in spoken English","example[14]":"The test was really hard.","example[15]":"a hard decision","example[16]":"It was hard to forgive him.","definition[5]":"very difficult, because you have to use a lot of effort, or because it affects you emotionally","example[17]":"a tough race","example[18]":"Doctors have to make tough decisions about who to treat first.","example[19]":"The team faces some tough competition.","example[20]":"Life is tough sometimes.","display[0]":"tricky","definition[6]":"difficult because it is complicated and full of problems","example[21]":"She had helped him out of a tricky situation.","example[22]":"Merging the two companies was bound to be tricky.","definition[7]":"rather difficult to deal with – used especially when something could be embarrassing","example[23]":"You’ve put me in a very awkward position.","example[24]":"It was getting dark and foggy, which made the rescue even more awkward.","display[1]":"challenging","definition[8]":"difficult in an interesting or enjoyable way","example[25]":"I wanted a job that was more challenging.","example[26]":"a challenging piece of music","display[2]":"demanding","definition[9]":"difficult and tiring, because it takes a lot of effort","example[27]":"Being a nurse in a busy hospital is a demanding job.","example[28]":"it can be very demanding bringing up young children.","display[3]":"daunting","definition[10]":"if something seems daunting, you think that it will be difficult and you do not feel confident about being able to do it","example[29]":"a daunting challenge","example[30]":"The task seemed a little daunting at first.","definition[11]":"needing to be dealt with carefully or sensitively, especially in order to avoid offending people or causing problems","example[31]":"This is a very delicate subject, and it can be difficult to talk about it with your parents.","example[32]":"He thanked me for the way in which this delicate matter had been handled."}