{"word[0]":"slip","signpost[0]":"fall or slide","definition[0]":"to slide a short distance accidentally, and fall or lose your balance slightly","example[0]":"Wright slipped but managed to keep hold of the ball.","example[1]":"He slipped on the ice.","note[0]":"slip on","signpost[1]":"go somewhere","definition[1]":"to go somewhere, without attracting other people’s attention","synonym[0]":"slide","example[2]":"Ben slipped quietly out of the room.","example[3]":"One man managed to slip from the club as police arrived.","signpost[2]":"put something somewhere","definition[2]":"to put something somewhere quietly or smoothly","example[4]":"Ann slipped the book into her bag.","example[5]":"A letter had been slipped under his door.","example[6]":"Carrie slipped her arm through her brother’s.","signpost[3]":"give something to somebody","definition[3]":"to give someone something secretly or without attracting much attention","example[7]":"I slipped him a ten-dollar bill to keep quiet.","note[1]":"slip somebody something","example[8]":"Carr slips the ball to King who scores easily.","note[2]":"slip something to somebody","definition[4]":"to move smoothly, especially off or from something","example[9]":"As he bent over, the towel round his waist slipped.","example[10]":"Cally slipped from his grasp and fled.","example[11]":"He watched the sun slip down behind the mountains.","note[3]":"slip off/down/from etc","example[12]":"The ring had slipped off Julia’s finger.","signpost[4]":"knife","definition[5]":"if a knife or other tool slips, it moves so that it accidentally cuts the wrong thing","example[13]":"The knife slipped and cut his finger.","signpost[5]":"get worse","definition[6]":"to become worse or lower than before","example[14]":"Standards have slipped in many parts of the industry.","example[15]":"His popularity slipped further after a series of scandals.","example[16]":"You’re slipping, Doyle! You need a holiday.","signpost[6]":"change condition","definition[7]":"to gradually start being in a particular condition","example[17]":"The project has slipped behind schedule.","example[18]":"He had begun to slip into debt.","note[4]":"slip into","example[19]":"She slipped into unconsciousness and died the next day.","definition[8]":"to put a piece of clothing on your body, or take it off your body, quickly and smoothly","example[20]":"Peter was already at the door slipping on his shoes.","note[5]":"slip something off/on","example[21]":"She slipped out of her clothes and stepped into the shower.","note[6]":"slip into/out of","definition[9]":"if time slips away, past etc, it passes quickly","example[22]":"The search for the missing child continued, but time was slipping away.","note[7]":"slip away/past/by","example[23]":"The hours slipped past almost unnoticed.","signpost[7]":"get free","definition[10]":"to get free from something that was holding you","example[24]":"The dog slipped his collar and ran away.","definition[11]":"a small or narrow piece of paper","example[25]":"a slip of paper","example[26]":"an order slip","example[27]":"a betting slip","signpost[8]":"mistake","definition[12]":"a small mistake","example[28]":"Molly knew she could not afford to make a single slip.","definition[13]":"a piece of underwear, similar to a thin dress or skirt, that a woman wears under a dress or skirt","example[29]":"a white silk slip","signpost[9]":"getting worse","definition[14]":"an occasion when something becomes worse or lower","synonym[1]":"drop","example[30]":"a slip in house prices","note[8]":"slip in","definition[15]":"an act of sliding a short distance or of falling by sliding","signpost[10]":"cricket","definition[16]":"a part of the field where players stand, trying to catch the ball in cricket","signpost[11]":"clay","definition[17]":"a mixture of clay and water that is used for decorating pots","definition[18]":"to become worse or less or fall to a lower amount, standard etc than before","example[31]":"There are fears that consumer confidence may be slipping.","example[32]":"Earnings per share slipped 2% to 9.9 pence.","definition[19]":"an occasion when something becomes worse or becomes less or lower","example[33]":"The slip in demand is seen in other markets besides the U.S.","definition[20]":"a small narrow piece of paper","example[34]":"Always keep your credit card slips.","example[35]":"Have you received a confirmation slip?"}