{"word[0]":"mean","past_tense[0]":"meant","signpost[0]":"have a particular meaning","definition[0]":"to have or represent a particular meaning","example[0]":"What does ‘patronizing’ mean?","example[1]":"The red light means ‘Stop’.","example[2]":"The report fails to define what is meant by the term ‘key issues’.","example[3]":"This light means you’re running low on fuel.","note[0]":"mean (that)","explanation[0]":"In written English, people often prefer to say that something indicates something is the case, rather than using mean:","example[4]":"The light indicates that fuel supplies are low.","signpost[1]":"intend to say something","definition[1]":"to intend a particular meaning when you say something","example[5]":"It’s pretty obvious what she means.","example[6]":"Oh yeah! I see what you mean (=I understand what you are trying to say).","example[7]":"What I mean is, I don’t feel alone anymore (=used to explain more about what you have said).","example[8]":"‘I didn’t really like him.’ 'I know what you mean, I didn’t get on with him either  (=used to say you understand and have had the same experience).","example[9]":"‘In three hours’ time, I’ll be a free man.‘ ’How do you mean (=used to ask someone to explain what they have just said)?'","example[10]":"Do you mean you’ve changed or Chris has changed?","note[1]":"(do) you mean","example[11]":"I want to buy her something really special, if you know what I mean.","note[2]":"do/if you know/see what I mean?","example[12]":"We’re still married but living apart in the same house, if you see what I mean.","example[13]":"I meant we’d have to leave early – that’s all.","signpost[2]":"intend to do something","definition[2]":"to intend to do something or intend that someone else should do something","example[14]":"I’m sure she didn’t mean it (=she did not intend to upset or hurt someone).","example[15]":"He may sound a bit rude at times, but he means well (=intends to be helpful or kind, even if it does not seem like that).","example[16]":"I wasn’t criticizing you, I really meant it for the best (=wanted to be helpful, although my actions had the wrong effect).","example[17]":"I’m sure he didn’t mean any harm.","note[3]":"mean no harm/offence/disrespect","example[18]":"I’ve been meaning to ask you if you want to come for a meal next week.","note[4]":"mean to do something","example[19]":"I didn’t mean to upset you.","example[20]":"I didn’t mean this to happen at all.","note[5]":"mean somebody/something to do something","example[21]":"I never meant you to find out.","example[22]":"I didn’t mean for her to get hurt.","note[6]":"mean for somebody to do something","signpost[3]":"result in something","definition[3]":"to have a particular result or involve something","example[23]":"The merger will mean the closure of the company’s Sydney office.","example[24]":"Don’t let him see you. It will only mean trouble.","example[25]":"Dieting also means being careful about which foods you buy.","example[26]":"The high cost of housing means that many young people can’t afford to buy a house.","example[27]":"My new job will mean travelling all over the world.","note[7]":"mean doing something","signpost[4]":"be familiar","definition[4]":"if a name, word etc means something to you, you are familiar with it or you understand it","example[28]":"He said his name was ‘Randall’ but it meant nothing to me  (=I was not familiar with it).","example[29]":"Does the name Bryce mean anything to you?","example[30]":"You need to use analogies which will mean something to the reader.","signpost[5]":"say something seriously","definition[5]":"to be serious about what you are saying or writing","example[31]":"With children, if you say ‘no’, you have to mean it.","example[32]":"I meant what I said earlier.","example[33]":"You don’t really mean that, do you?","signpost[6]":"how important somebody/something is","definition[6]":"used for saying how important someone or something is to you","example[34]":"The medal meant a lot to him.","example[35]":"Time meant nothing (=it was not important) to me while I was travelling.","example[36]":"Of course the relationship meant something to me.","example[37]":"He meant the world to her.","note[8]":"mean the world to somebody/mean everything to somebody","example[38]":"I know how much your work means to you.","note[9]":"mean something to somebody","signpost[7]":"show something is true/will happen","definition[7]":"to be a sign that something is true or will happen","example[39]":"Finding a lump does not necessarily mean you have cancer.","example[40]":"Clear skies mean that it will be a cold night.","example[41]":"Just because he’s been in prison, it doesn’t mean that he’s violent.","signpost[8]":"say which person/thing","definition[8]":"used to say that a particular person or thing is the one that you are talking about, pointing to etc","example[42]":"‘Hey you!’ ‘Do you mean me?’","example[43]":"I meant the pink dress, not the red one.","explanation[1]":"Mean is not used in the progressive in any of its senses, except for sense 3 You say","example[44]":"What does this word mean?","example[45]":"This means trouble","bad_example[0]":"What is this word meaning?","bad_example[1]":"This is meaning trouble","comparative[0]":"meaner","superlative[0]":"meanest","signpost[9]":"cruel","definition[9]":"cruel or not kind","example[46]":"That was a mean thing to do.","example[47]":"I felt a bit mean asking him to help.","example[48]":"It’s a mean trick to play on someone.","example[49]":"It was mean of him not to invite her.","example[50]":"Don’t be so mean to her!","note[10]":"mean to","signpost[10]":"not generous","definition[10]":"not wanting to spend money, or not wanting to use much of something","synonym[0]":"stingy","example[51]":"He’s too mean to buy a present for his wife.","example[52]":"He’s always been mean with his money.","note[11]":"mean with","example[53]":"It was supposed to be garlic bread, but they’d been a bit mean with the garlic.","example[54]":"The study involved 60 patients with a mean age of 58.2 years.","example[55]":"The mean annual rainfall was 852 mm.","definition[11]":"poor or looking poor","example[56]":"She walked briskly through the mean and dirty streets.","example[57]":"Analysts’ mean estimate is for earnings of 33 cents a share.","definition[12]":"the average","example[58]":"The GDP of this state was 32% below the mean for the country as a whole."}