{"word[0]":"reverse","signpost[0]":"opposite","definition[0]":"to change something, such as a decision, judgment, or process so that it is the opposite of what it was before","example[0]":"The decision was reversed on appeal.","note[0]":"reverse a decision/verdict/policy etc","example[1]":"More changes are required to reverse the trend towards centralised power.","note[1]":"reverse a trend/process/decline etc","definition[1]":"if a vehicle or its driver reverses, they go backwards","example[2]":"Bob reversed into a parking space.","note[2]":"reverse out of/into etc","example[3]":"I reversed the car into a side road.","note[3]":"reverse something into/out of something","signpost[1]":"change position/purpose","definition[2]":"to change around the usual order of the parts of something, or the usual things two people do","synonym[0]":"swap","example[4]":"Our roles as child and guardian had now been reversed.","note[4]":"reverse roles/positions","signpost[2]":"turn something over","definition[3]":"to turn something over or around, in order to show the back of it","example[5]":"Reverse the paper in the printer.","collocation[0]":"reverse a decision/ruling","example[6]":"The Supreme Court reversed the decision.","collocation[1]":"reverse your position","example[7]":"He spoke in favor of the bill, reversing his previous position.","collocation[2]":"reverse a policy","example[8]":"She is pressing the government to reverse its policy.","collocation[3]":"reverse a trend","example[9]":"Immigration has increased sharply and reversing this trend will be extremely difficult.","collocation[4]":"reverse a decline","example[10]":"His policies had reversed the decline in the economy.","collocation[5]":"reverse a process","example[11]":"We cannot reverse the ageing process.","collocation[6]":"reverse the effects of something","example[12]":"Hair conditioner can’t reverse the damaging effects of colouring and perming.","definition[4]":"the position of the gears in a vehicle that makes it go backwards","example[13]":"Put the car into reverse.","note[5]":"into/in reverse","definition[5]":"a defeat or a problem that delays your plans","synonym[1]":"setback","example[14]":"Losing the Senate vote was a serious reverse for the president.","signpost[3]":"other side","definition[6]":"the less important side or the back of an object that has two sides","example[15]":"The British ten-pence coin has a lion on the reverse.","note[6]":"on the reverse","definition[7]":"to change something such as a decision, judgement, or process so that it is the opposite of what it was before","example[16]":"Will the government reverse its decision to lower oil prices?","example[17]":"The California Supreme Court reversed a lower court ruling that blocked a resort hotel from being built.","example[18]":"The company had been struggling to reverse huge losses.","definition[8]":"to develop or do something in the opposite way to before","example[19]":"Bond prices abruptly reversed direction and fell.","example[20]":"The President reversed course and cut a deal with Congress.","definition[9]":"to make a telephone call which is paid for by the person you are telephoning","definition[10]":"the exact opposite of something","example[21]":"U.S. law on this matter is virtually the reverse of British law.","definition[11]":"a defeat or problem that delays your plans","example[22]":"Losing the Senate vote was a serious reverse for the President.","definition[12]":"used to describe something that is the opposite of something else","example[23]":"Last year, we had a lot of supply and not much demand. But this year we had the reverse situation."}