{"word[0]":"pension","definition[0]":"an amount of money paid regularly by the government or company to someone who does not work anymore, for example because they have reached the age when people stop working or because they are ill","example[0]":"At what age can you start drawing your pension?","example[1]":"If you are self-employed, you should think about taking out a private pension.","example[2]":"Many people find it hard to live on a basic state pension.","example[3]":"She pays a quarter of her salary into a pension plan.","collocation[0]":"get/receive a pension","example[4]":"They receive the basic state pension.","collocation[1]":"draw your pension","example[5]":"He's got another ten years before he draws his pension.","collocation[2]":"collect your pension","example[6]":"She went to the post office every week to collect her pension.","collocation[3]":"pay into a pension","example[7]":"They have been unable to pay into a pension.","collocation[4]":"take out a pension","example[8]":"People were encouraged to take out private pensions.","form[0]":"ADJECTIVES/NOUN + pension","collocation[5]":"an old age pension","example[9]":"State old age pensions were introduced in 1908.","collocation[6]":"a retirement pension","example[10]":"Many workers lost their retirement pensions when the fund collapsed.","collocation[7]":"a state pension","example[11]":"They argued that the state pension should rise in line with average earnings.","collocation[8]":"a company/occupational pension","example[12]":"I've been paying into the company pension scheme for 20 years.","collocation[9]":"a private/personal pension","example[13]":"The percentage of the workforce with a private pension has declined.","form[1]":"pension + NOUN","collocation[10]":"pension contributions","example[14]":"You can make additional pension contributions.","collocation[11]":"pension provision","example[15]":"They can't afford to make adequate pension provision for themselves.","collocation[12]":"pension age","example[16]":"Most men stayed in their jobs until pension age.","definition[1]":"a small cheap hotel in France and some other European countries","definition[2]":"an amount of money paid regularly by a government, company, or financial institution to someone who is officially considered to be too old or too ill to earn money by working","example[17]":"If you retire at 55 you can expect your pension to be half the size it would be at age 65.","example[18]":"He lives in a modest house on a small pension.","example[19]":"Pension contributions (=money that you give or an employer gives to pay for the pension that you will get) attract no tax."}