{"signpost[0]":"no cost","definition[0]":"something that is free does not cost you any money","example[0]":"Admission is free for children under 9.","example[1]":"All students are offered free accommodation.","example[2]":"Send for our free information pack for more details.","example[3]":"There’s a special free gift with this month’s magazine.","signpost[1]":"not a prisoner","definition[1]":"not held, tied up, or kept somewhere as a prisoner","example[4]":"He knew he could be free in as little as three years.","example[5]":"With one leap he was free!","example[6]":"He walked out of the courtroom a free man.","example[7]":"They have called on the government to set all political prisoners free.","example[8]":"He was found not guilty and walked free from the court.","example[9]":"The animals are allowed to run free in the park.","example[10]":"Hundreds of dogs roam free on the streets.","example[11]":"She broke free from her attacker.","note[0]":"break/pull/struggle free","signpost[2]":"not controlled","definition[2]":"allowed to do or say whatever you want, or allowed to happen, without being controlled or restricted by anyone or anything","example[12]":"We had a free and open discussion about religion.","example[13]":"He became president following the country’s first free elections last year.","example[14]":"We would all support the principle of free speech.","example[15]":"For the first time in its history, the country has a free press.","example[16]":"Patients are now allowed free access to their medical records.","example[17]":"The legislation will allow the free movement of goods through all the countries in Europe.","example[18]":"Remember, you are free to say no.","note[1]":"free to do something","example[19]":"Newspapers today are entirely free from government control.","note[2]":"free from","example[20]":"Women are struggling to break free from tradition.","example[21]":"I longed to be free of my family.","note[3]":"free of","signpost[3]":"not busy","definition[3]":"if you are free, or have some free time, you have no work, and nothing else that you must do","example[22]":"I’m free next weekend.","example[23]":"Children these days have very little free time.","example[24]":"I haven’t got a free day this week.","note[4]":"a free day/morning/half-hour etc","example[25]":"Are you free for lunch tomorrow?","note[5]":"free for","example[26]":"At last I was free to concentrate on my own research.","signpost[4]":"not being used","definition[4]":"something that is free is available to use because it is not already being used","example[27]":"Is this seat free?","example[28]":"I’m afraid we don’t have any free tables this evening.","example[29]":"He used his free hand to open the door.","signpost[5]":"not suffering","definition[5]":"not suffering from something","example[30]":"a stress-free life","note[6]":"pain-free/trouble-free etc","example[31]":"At last she was free of pain.","example[32]":"A lot of the patients are now free from symptoms.","signpost[6]":"not containing something","example[33]":"a fat-free yoghurt","note[7]":"fat-free/dairy-free etc","example[34]":"All our drinks are free from artificial colourings.","note[8]":"free from/of","signpost[7]":"tax","definition[6]":"if something is free of tax, you do not have to pay tax on it","example[35]":"tax-free earnings","note[9]":"tax-free/duty-free etc","example[36]":"an opportunity to buy duty-free goods","example[37]":"This income should be free of tax.","signpost[8]":"not restricted","definition[7]":"something that is free is not held, blocked, or restricted","example[38]":"We opened both doors to allow a free flow of air through the building.","signpost[9]":"chemicals","definition[8]":"a free chemical substance is not combined with any other substance","example[39]":"the amount of free oxygen in the atmosphere","example[40]":"Parking is free after 6 pm.","example[41]":"‘How much is it to get into the concert?’ ‘Oh, I think it’s free.’","example[42]":"They were giving away free tickets for the concert.","example[43]":"I’m saving these tokens to get a free poster.","display[0]":"for nothing/for free","definition[9]":"without having to pay for something that you would normally have to pay for","example[44]":"He offered to fix the car for nothing.","example[45]":"Fans were allowed into the stadium for nothing as a way of celebrating.","example[46]":"Children under five can see the show for free.","display[1]":"at no extra cost","definition[10]":"if a shop or company provides an additional service at no extra cost, they do it without asking you for any more money","example[47]":"The shop will install the cooker for you at no extra cost.","example[48]":"Tours of the city are available from the hotel at no extra cost.","display[2]":"complimentary","definition[11]":"free – use this about things that a company, theatre, hotel etc gives people","example[49]":"Karen’s sister works at the New York Ballet and she’s managed to get us some complimentary tickets.","example[50]":"Honeymooners receive a complimentary bottle of champagne  in their hotel room.","display[3]":"be on the house","definition[12]":"if food or drinks are on the house, the owner of a bar or restaurant says you do not have to pay for them","example[51]":"These drinks are on the house.","display[4]":"gratis","definition[13]":"without having to pay for something","example[52]":"Users will be able to listen to tracks  (=songs)gratis.","signpost[10]":"release","definition[14]":"to allow someone to leave prison or somewhere they have been kept as a prisoner","example[53]":"He expects to be freed quite soon.","example[54]":"The terrorists have at last agreed to free the hostages.","example[55]":"She was freed from prison last week.","note[10]":"free somebody from something","signpost[11]":"not control","definition[15]":"to allow someone to say and do what they want, after controlling or restricting them in the past","example[56]":"Art frees the imagination.","example[57]":"The press has now been freed from political control.","note[11]":"free somebody from/of something","example[58]":"She longed to be freed of her responsibilities.","signpost[12]":"allow somebody/something to move","definition[16]":"to move someone or something so that they are no longer held, fixed, or trapped","example[59]":"He struggled to free himself, but the ropes were too tight.","example[60]":"I couldn’t free the safety catch.","example[61]":"All the victims have now been freed from the wreckage.","note[12]":"free somebody/something from something","signpost[13]":"stop somebody suffering","definition[17]":"to stop someone suffering from something by removing it","example[62]":"new drugs that can free people from pain","example[63]":"At last the country has been freed from its enormous debts.","signpost[14]":"make available","definition[18]":"to make something available so that it can be used","example[64]":"I need to free up some of the disk space on my computer.","example[65]":"This should free some money for investment.","signpost[15]":"give somebody more time","definition[19]":"to give someone time to do something by taking away other jobs that they have to do","example[66]":"Taking away the burden of administration will free teachers to concentrate on teaching.","note[13]":"free somebody (up) to do something","example[67]":"We have freed up some staff to deal with the backlog of work.","definition[20]":"without payment","example[68]":"Children under four can travel free.","example[69]":"You can get advice free from your local library.","example[70]":"All these services are available to the public free of charge.","example[71]":"He offered to do the work for free.","note[14]":"for free","definition[21]":"not fixed or held in a particular place or position","example[72]":"The ropes were now hanging free.","example[73]":"A gold chain swung free around his neck.","definition[22]":"a free transfer; the process by which a player moves from one football club to another, but the new club does not pay any money for him","example[74]":"We got Kevin on a free from Manchester United.","definition[23]":"without something that you do not want","example[75]":"a trouble-free journey","example[76]":"duty-free cigarettes","example[77]":"a salt-free diet","example[78]":"They live in the house rent-free.","definition[24]":"without something, often something that you do not want","example[79]":"Earnings will be tax-free if the money remains on deposit for seven years.","example[80]":"Heathrow Airport gets more money from duty-free sales than from landing fees.","example[81]":"The casino will generate $10 million a year in risk-free income for the consortium.","definition[25]":"costing nothing","example[82]":"First-class passengers will have four films to choose from, all of them free.","example[83]":"Like pizza, Chinese food is more expensive than hamburgers and can bear the cost of free delivery.","example[84]":"In order to attract new members, the gym decided to offer a week’s free trial.","definition[26]":"used to say that something may seem to be free, but that in fact somebody must pay for it","example[85]":"The economic principle of ‘no free lunch’ applies — people get the services they pay for.","example[86]":"There’s no such thing as a free lunch. If you receive ‘free’ shares, you’re bound to pay for them in other ways.","definition[27]":"without something, usually something that you do not want","example[87]":"The economy remains slow but relatively free of inflation.","example[88]":"The interest on savings bonds is free from state and local tax.","example[89]":"Personal Equity Plans, which have a £6,000 investment limit each financial year, arefree of income tax and capital gains tax.","definition[28]":"not restricted, limited, or controlled","example[90]":"Privatization is important, but the main condition for a market economy is free prices.","example[91]":"The company is free to impose whatever work rules and pay it chooses.","note[15]":"free to","definition[29]":"to remove laws, rules etc","example[92]":"More prices, including that of milk, will be freed from state control.","example[93]":"Ford said the sale of its heavy truck unit will free resources to concentrate on its light and medium truck business.","example[94]":"The government have freed up several million dollars of federal money that was reserved for development but never spent.","example[95]":"Senior citizens can travel free at off-peak times.","example[96]":"This service is available to the public free of charge.","example[97]":"The downloads are available for free from their website."}