{"word[0]":"official","definition[0]":"someone who is in a position of authority in an organization","example[0]":"a government official","example[1]":"senior administration officials","definition[1]":"approved of or done by someone in authority, especially the government","example[2]":"an official investigation into the causes of the explosion","example[3]":"the official policy on education","example[4]":"official statistics about illegal drug use","example[5]":"You will have to get official permission first.","example[6]":"Finally the letter of appointment came, making it all official.","definition[2]":"relating to or done as part of an important job or position","example[7]":"the Queen’s performance of official duties","example[8]":"They dined in an official capacity with other European leaders.","example[9]":"the Lord Mayor’s official residence","example[10]":"The president was leaving for a four-day official tour of Mexico.","note[0]":"an official visit/engagement etc","definition[3]":"an official explanation, account etc is one that is given formally and publicly, but may not be true","example[11]":"Many doubted the official version of events.","example[12]":"The official line  (=what is said publicly by people in authority) was that the troops were there to protect the King.","definition[4]":"chosen to represent someone or an organization, or do something for them","example[13]":"the company’s official logo","example[14]":"the official representative from the American administration","definition[5]":"an official event is a formal public event","example[15]":"The official opening of the institute was in May.","heading[0]":"– Meaning 2: relating to or done as part of an important job or position","example[16]":"The prime minister was on an official visit to China.","collocation[0]":"somebody's official duties","example[17]":"the royal family's official duties.","collocation[1]":"an official residence","example[18]":"the ambassador's official residence in London","collocation[2]":"somebody's official capacity","example[19]":"He spent Wednesday in Washington acting in his official capacity as Senate majority leader.","example[20]":"You have to get official permission to build a new house.","example[21]":"Have you signed the necessary official documents?","example[22]":"the official inquiry into the scandal","definition[6]":"done as part of your job and not for your own private purposes","example[23]":"Are you here in your official capacity?","example[24]":"If you have to go away from the office on official business, the company will pay for the cost of travel.","example[25]":"The agreement was signed during an official visit to France by the Prime Minister.","example[26]":"The role of trade unions as workers’ official representatives comes into play during strikes and other kinds of industrial action.","definition[7]":"someone who has a responsible position in an organization","example[27]":"trade union officials"}