{"word[0]":"example","definition[0]":"a specific fact, idea, person, or thing that is used to explain or support a general idea, or to show what is typical of a larger group","example[0]":"Can anyone give me an example of a transitive verb?","note[0]":"example of","definition[1]":"someone whose behaviour is very good and should be copied by others, or this type of behaviour","example[1]":"Parents should set an example for their children.","example[2]":"I suggest you follow Rosie’s example (=copy her behaviour) and start doing regular exercise.","example[3]":"The team captain leads by example.","example[4]":"She’s a shining example (=a very good example) of what a mother should be.","example[5]":"Her courage is an example to us all.","note[1]":"example to","heading[0]":"– Meaning 1: a specific fact, idea, person, or thing that is used to explain or support a general idea, or to show what is typical of a larger group","collocation[0]":"a good/typical example","example[6]":"This painting is a good example of his early work.","collocation[1]":"a fine/excellent example","example[7]":"The house is a fine example of a medieval building.","collocation[2]":"an outstanding example","example[8]":"The garden is one of the most outstanding examples of traditional Japanese garden design.","collocation[3]":"a classic/perfect/prime example","example[9]":"This is a classic example of how not to run a business.","example[10]":"The pot is a perfect example of the Marine Style.","example[11]":"This is a prime example of government incompetence.","collocation[4]":"an obvious example","example[12]":"Our climate is changing at an alarming rate. The melting of the polar ice caps is an obvious example of this.","collocation[5]":"a blatant/glaring example","example[13]":"His case is a blatant example of the unfairness of the current system.","collocation[6]":"an extreme example","example[14]":"To give you an extreme example, one lady called the police fifteen times in a single evening.","collocation[7]":"a notable example","example[15]":"Some places contain a huge variety of animal and plant life. The two most notable examples are tropical forests and coral reefs.","collocation[8]":"a graphic example","example[16]":"The film is full of graphic examples of what can go wrong if the proper safety procedures are not followed.","collocation[9]":"give (somebody) an example","example[17]":"Let me give you an example of how this might happen.","collocation[10]":"provide an example","example[18]":"Our brochure provides examples of the different villas on offer.","collocation[11]":"take an example","example[19]":"Let’s take the example of a family with two school-age children.","collocation[12]":"use an example","example[20]":"He used several examples to illustrate his point.","collocation[13]":"cite an example","example[21]":"The report cites the example of Sweden, where there is a complete ban on advertising on children's television.","collocation[14]":"find an example","example[22]":"We found examples of people being overcharged by as much as 50%.","collocation[15]":"contain/include an example","example[23]":"The exhibition also contains some examples of his book illustrations.","collocation[16]":"an example shows/illustrates something","example[24]":"These examples show how the disease can be passed on to humans.","heading[1]":"– Meaning 3: someone whose behaviour is very good and should be copied by others, or this type of behaviour","collocation[17]":"set an example","example[25]":"You should be setting an example for your little brother.","collocation[18]":"follow somebody’s example","example[26]":"I tried to follow my parent’s example with my own kids.","collocation[19]":"lead by example","example[27]":"The captain of the team should lead by example.","collocation[20]":"hold somebody up as an example","example[28]":"He was held up as an example to the younger athletes.","collocation[21]":"a good/positive example","example[29]":"The older boys should set a positive example for the rest of the school.","collocation[22]":"a shining example","example[30]":"Professor Squires was a shining example of what a good teacher should be.","collocation[23]":"an inspiring example","example[31]":"Jenny’s story is an inspiring example of courage in the face of adversity.","definition[2]":"something that you mention because it is typical of the kind of thing that you are talking about","example[32]":"The hall is a perfect example of medieval architecture.","example[33]":"There are many ways in which technology has changed our lives. The car is an obvious example.","example[34]":"This painting is a typical example of Picasso’s work in his Blue Period.","display[0]":"case","definition[3]":"an example of something that happens, especially something bad","example[35]":"There have been some cases of women employees being fired because they are pregnant.","example[36]":"In one case a man was charged $2,000 for a simple medical check-up.","example[37]":"Recent government spending on schools is a classic case of too little, too late.","display[1]":"instance","definition[4]":"an example of a particular kind of situation or event, especially something bad. Instance is more formal than case","example[38]":"Some users of Ecstasy have actually died, but such instances are very rare.","example[39]":"The report describes instances of discrimination.","example[40]":"In a few rare instances, the disease can cause death.","display[2]":"illustration","definition[5]":"something, especially a story or situation, that you use as an example","example[41]":"As an illustration of this, consider the following example.","example[42]":"He mentioned the recent events in the Middle East by way of illustration (=as an example).","heading[2]":"what you say when giving examples","display[3]":"for example","definition[6]":"used when giving an example","example[43]":"Prices have risen sharply. The price of gasoline, for example, has risen by over 50%.","example[44]":"Nepal has many attractions for visitors. For example, you can go trekking in the Himalayas, or see tigers in Chitwan National Park.","display[4]":"for instance","definition[7]":"used when giving an example. For instance is slightly less formal than for example and is used more in spoken English","example[45]":"There were many unanswered questions. For instance, where was the money going to come from?","example[46]":"Some people are really good at languages. Take Katie, for instance.","display[5]":"eg/e.g.","definition[8]":"used when giving an example or a list of examples. Don’t use eg in formal writing – use the full phrase for example","example[47]":"Make sure you eat foods that contain protein, e.g. meat, fish, eggs, milk, or cheese.","display[6]":"such as","definition[9]":"used when giving one or two typical examples when there are many others","example[48]":"It is difficult to get even basic foods such as bread and sugar.","definition[10]":"used when giving a particular example as a way of proving that what you are saying is correct","example[49]":"Take John – he has a good job but he didn’t go to university.","example[50]":"It is possible to recover from some types of cancer. Take skin cancer, for example.","display[7]":"be a case in point","definition[11]":"used when emphasizing that someone or something is a good or typical example of what you have just mentioned","example[51]":"Some birds have returned to Britain after once being extinct here. The return of the osprey is a case in point."}