{"signpost[0]":"do a job for money","definition[0]":"to do a job that you are paid for","example[0]":"Where do you work?","example[1]":"Many young people in the area have never worked.","example[2]":"The injury means he’ll probably never work again.","example[3]":"The studies were undertaken by people working in education.","note[0]":"work in industry/education/publishing etc","example[4]":"I work part-time in a library.","note[1]":"work part-time/full-time","example[5]":"He works for a law firm.","note[2]":"work for","example[6]":"I work at the university.","note[3]":"work at/in","example[7]":"She works as a consultant for a design company.","note[4]":"work as","heading[0]":"GRAMMAR: Prepositions with work","explanation[0]":"You work in a city or area","example[8]":"He works in Manhattan","explanation[1]":"You work in a type of place such as a bank, shop, or factory","example[9]":"She works in a library","explanation[2]":"You work at a particular place or organization","example[10]":"She works at the Library of Congress","explanation[3]":"You work for a person, company, or organization that employs you","example[11]":"He works for his father","example[12]":"We both work for the same company","explanation[4]":"You work in an industry or a type of job, for example education, advertising, or IT","example[13]":"He works in advertising","explanation[5]":"You work as a waiter, cashier, accountant etc","example[14]":"She works as a cook","bad_example[0]":"She works as cook","explanation[6]":"You work on a project or task","example[15]":"Several people worked on the report","signpost[1]":"do your job","definition[1]":"to do the activities and duties that are part of your job","example[16]":"Sally isn’t working tomorrow.","example[17]":"Staff will have to get used to a new way of working.","example[18]":"Are you working late (=working after the time you usually finish) again tonight?","example[19]":"Forty police officers are working round the clock (=working day and night without stopping) to find Murray’s killer.","example[20]":"Nowadays, many people are able to work from home.","example[21]":"I get paid more if I work nights.","note[5]":"work days/nights/weekends etc","example[22]":"We’re sometimes expected to work twelve-hour days.","example[23]":"One of the women I work with is getting married this weekend.","note[6]":"work with","example[24]":"Each site has a fully trained team who work under a site manager.","note[7]":"work under somebody","definition[2]":"if you work with someone or a group of people, your job involves trying to help them","example[25]":"She’s just retired after 38 years working with children.","note[8]":"work with/among","example[26]":"He has worked among some of the world’s poorest people.","signpost[2]":"do an activity","definition[3]":"to spend time and effort doing something","example[27]":"I’ve been working in the garden all afternoon.","example[28]":"I’m going to have to work really hard to pass these exams.","example[29]":"We’re working together to develop a new system.","signpost[3]":"try to achieve something","definition[4]":"to try continuously to achieve a particular thing","example[30]":"The company is working hard to improve its image.","example[31]":"He worked tirelessly (=worked very hard in a determined way) for the charity throughout his life.","example[32]":"They are working towards a solution to their problems.","note[9]":"work towards","example[33]":"We will work for the release of the hostages.","example[34]":"The police are working to provide more help for victims of crime.","note[10]":"work to do something","signpost[4]":"machine/equipment","definition[5]":"if a machine or piece of equipment works, it does what it is supposed to do","example[35]":"You should check that the smoke alarm is working properly.","example[36]":"The delete key doesn’t work.","example[37]":"I can’t get the heater to work.","note[11]":"get something to work","definition[6]":"to make a machine or piece of equipment do what it is supposed to do","example[38]":"My parents can’t even work the video.","signpost[5]":"be effective/successful","definition[7]":"to be effective or successful","example[39]":"Making a marriage work can take a lot of effort.","example[40]":"I’ve never found a diet that works.","example[41]":"The recipe works just as well if you use margarine instead of butter.","example[42]":"The cream works immediately to relieve sore skin.","example[43]":"You need to find which method works best for you.","example[44]":"a drug that works against some types of cancer","note[12]":"work against","signpost[6]":"have an effect","definition[8]":"if something such as a fact, situation, or system works in a particular way, it has a particular effect on someone or something","example[45]":"The arrangement works well for everyone involved.","example[46]":"The French team are the heavier crew, which should work in their favour (=help them).","example[47]":"Sexism still works against (=harms or causes problems for) women in many professions.","example[48]":"Loyalty works both ways (=involves two opposite or matching effects): we are loyal to our employees and, in turn, they are loyal to us.","signpost[7]":"art/style/literature","definition[9]":"if a painting, design, piece of writing etc works, it is successful because it has the effect on you that the painter, writer etc intended","example[49]":"I don’t think the scene with the horses really works, do you?","example[50]":"The colour combination just doesn’t work for me.","signpost[8]":"shape/cut something","definition[10]":"if you work a material such as metal, leather, or clay, you cut, sew, or shape it in order to make something","signpost[9]":"use a substance","definition[11]":"to use a particular material or substance in order to make something such as a picture, design, jewellery etc","example[51]":"a sculptor who works in steel","note[13]":"work in/with","example[52]":"a jeweller who works with silver","signpost[10]":"move gradually","definition[12]":"to move into a particular state or position very gradually, either in a series of small movements or after a long time","example[53]":"Slowly he worked the screwdriver into the crack.","example[54]":"One of the screws must have worked loose.","note[14]":"work (its way) loose","signpost[11]":"exercise","definition[13]":"to use and exercise a muscle or part of your body","example[55]":"Swimming is a form of exercise that works every muscle in your body.","definition[14]":"if a part of your body works or you work it, it moves","example[56]":"She was trembling and her mouth was working.","signpost[12]":"work in an area","definition[15]":"if you work a particular area or type of place, you travel around the area for your job, or work in that type of place","example[57]":"Markowitz works the Tri-State area.","signpost[13]":"entertain a crowd","definition[16]":"if an entertainer or politician works a crowd of people, they entertain them and get their interest or support","example[58]":"She really knew how to work a crowd.","signpost[14]":"land/soil","definition[17]":"if you work the land, soil etc, you do all the work necessary to grow crops on it","example[59]":"He was left to work the farm alone.","signpost[15]":"mine","definition[18]":"to remove a substance such as coal, gold, or oil from under the ground","signpost[16]":"mind/brain","definition[19]":"if your mind or brain is working, you are thinking or trying to solve a problem","signpost[17]":"calculate","definition[20]":"to calculate the answer to a mathematical problem","definition[21]":"a job or activity that you do regularly, especially in order to earn money","example[60]":"There isn’t a lot of work at this time of the year.","example[61]":"He’s been out of work (=without a job) for two years.","example[62]":"More people are in work (=have a job) than ten years ago.","example[63]":"Do you want to go for a drink after work?","note[15]":"before/after work","explanation[7]":"In this meaning, work is always an uncountable noun","example[64]":"It may be hard for older people to find work","bad_example[1]":"find a work","explanation[8]":"Job is a countable noun","example[65]":"I applied for a job as a reporter","bad_example[2]":"I applied for a work","example[66]":"Her first job was in London","bad_example[3]":"Her first work was in London","definition[22]":"a place where you do your job, which is not your home","example[67]":"I had an accident on the way to work.","example[68]":"He left work at the usual time.","example[69]":"I went out with the girls from work last night.","example[70]":"Dad’s at work right now.","note[16]":"at work","signpost[18]":"duties","definition[23]":"the duties and activities that are part of your job","example[71]":"A large part of the work we do involves using computers.","example[72]":"He starts work at 4 am.","example[73]":"He’s started a business doing gardening and roofing work.","definition[24]":"something that you produce as a result of doing your job or doing an activity","example[74]":"Send a résumé and examples of your work.","example[75]":"The building is the work of architect Rafael Moneo.","example[76]":"The teacher should make sure that each child has a piece of work displayed on the wall.","example[77]":"The standard of work has declined.","signpost[19]":"papers etc","definition[25]":"the papers and other materials you need for doing work","example[78]":"Can you move some of your work off the kitchen table?","example[79]":"I often have to take work home with me.","signpost[20]":"book/painting/music","definition[26]":"something such as a painting, play, piece of music etc that is produced by a painter, writer, or musician","example[80]":"the Collected Works of Shakespeare","example[81]":"It is another accomplished work by the artist.","signpost[21]":"activity","definition[27]":"when you use physical or mental effort in order to achieve something","example[82]":"Looking after children can be hard work.","example[83]":"You should not allow unqualified people to carry out work on your house.","note[17]":"carry out/do work","example[84]":"He set to work immediately.","note[18]":"set to work/get down to work","example[85]":"Work will start next month on a new swimming pool in the centre of the city.","note[19]":"work on","signpost[22]":"study","definition[28]":"study or research, especially for a particular purpose","example[86]":"The centre carries out work to monitor trends in housing management.","example[87]":"He did his postgraduate work in Sociology.","signpost[23]":"operation","definition[29]":"an operation to make you look younger or more attractive","synonym[0]":"cosmetic surgery","example[88]":"All these celebrities have had work done.","definition[30]":"force multiplied by distance","heading[1]":"– Meanings 1 & 3","collocation[0]":"start work","example[89]":"He started work as a trainee accountant.","collocation[1]":"look for work","example[90]":"Young people come to town looking for work.","collocation[2]":"find work","example[91]":"It was difficult for them to find work.","collocation[3]":"return to work/go back to work","example[92]":"His doctor agreed he was fit enough to return to work.","form[0]":"ADJECTIVES/NOUN + work","collocation[4]":"part-time work","example[93]":"In recent years part-time work has become more popular.","collocation[5]":"full-time work","example[94]":"Are you available for full-time work?","collocation[6]":"paid work","example[95]":"She hasn’t done any paid work since she had children.","collocation[7]":"secretarial/clerical/office work","example[96]":"I have a background in secretarial work.","example[97]":"She had done clerical work before she married.","collocation[8]":"legal work","example[98]":"He will handle all the legal work.","collocation[9]":"manual work","example[99]":"Most of them were employed in manual work.","collocation[10]":"voluntary work","example[100]":"She also did voluntary work in a girls’ club.","collocation[11]":"somebody’s daily work","example[101]":"When they finished their daily work they would be too tired for much except rest.","collocation[12]":"somebody’s line of work","example[102]":"I meet lots of interesting people in my line of work.","collocation[13]":"the work environment","example[103]":"It is important to have a pleasant work environment.","collocation[14]":"work practices","example[104]":"She supported me enthusiastically in bringing in new work practices.","heading[2]":"– Meaning 7: when you use physical or mental effort in order to achieve something","collocation[15]":"carry out work","example[105]":"The work should be carried out without further delay.","collocation[16]":"do work","example[106]":"He was doing some work on his father’s car.","collocation[17]":"set to/get to/get down to work","example[107]":"They set to work cutting down trees and brushwood.","collocation[18]":"undertake work","example[108]":"About a three adults in ten undertake voluntary work.","collocation[19]":"work starts/begins","example[109]":"Work had already started on the bridge when the error was spotted.","collocation[20]":"work continues","example[110]":"Work is continuing on three major building projects.","example[111]":"It’s been very hard work, but I’ve loved every moment of it.","collocation[21]":"backbreaking","example[112]":"Clearing the garden was slow, backbreaking work.","collocation[22]":"arduous","example[113]":"This was physically arduous work.","collocation[23]":"heavy work","example[114]":"The heavy work is done by the gardener.","collocation[24]":"light work","example[115]":"He had been ill, but she found him some light work to do.","example[116]":"Harry is 78 and still working.","example[117]":"Most of the people I went to school with work in factories.","example[118]":"David works for a broadcasting company.","example[119]":"She works as a financial consultant.","definition[31]":"to do the activities or duties that are part of your job","example[120]":"I’m tired of working ten-hour days.","definition[32]":"to travel around a particular area as part of your job, especially in order to sell something","example[121]":"Markovitz works the Tri-State area.","definition[33]":"to do an activity which needs time and effort","example[122]":"We had to work non-stop to get the book finished on time.","definition[34]":"to make someone use a lot of time and effort in a job or activity","example[123]":"The company is famous for working its employees hard.","definition[35]":"if you work a particular material such as metal, leather etc, you cut or shape it in order to make something","definition[36]":"to do all the work necessary to grow crops on a piece of land","example[124]":"Our family has worked this land for generations.","definition[37]":"to remove a substance such as coal, gold, or oil from a mine","example[125]":"Is the photocopier working now?","definition[38]":"to operate a machine or piece of equipment","example[126]":"The check-out is slow, because only two clerks work the cash registers.","definition[39]":"if a method, plan, or system works, it produces the results you want","example[127]":"The article gives a good understanding of how the pharmaceutical research process works.","definition[40]":"if something such as a fact, situation, or system works in a particular way, it has a particular effect on somebody or something","example[128]":"The tax laws tend to work against small companies.","definition[41]":"to know how to influence an organization etc in order to achieve something","example[129]":"Those who advance in this environment are people with an instinct for securing supplies, cultivating connections and working the system.","definition[42]":"if you work your way up, or work your way up in an organization, your jobs in it become more and more important","example[130]":"They have spent their entire careers at the firm and worked their way up the ranks.","definition[43]":"to protest about a situation at work by doing your job less quickly or effectively than usual, but without breaking your employer’s rules or the terms of your contract","example[131]":"The staff are not on strike but are working to rule.","definition[44]":"the job you are paid to do or an activity that you do regularly to earn money","example[132]":"My father started work when he was 14.","example[133]":"The work was interesting and well paid.","example[134]":"He eventually found work on a construction site.","example[135]":"She’s been out of work (=not had a job) for almost a year now.","example[136]":"He has been off work (=not working because of illness) for four weeks because of his wrist condition.","example[137]":"Many women take part-time work while they are raising children.","example[138]":"6.3 million people are working part time but would prefer full-time work.","example[139]":"Jo’s still at work.","example[140]":"What kind of work are you looking for?","example[141]":"I wouldn’t be very good at manual work (=hard physical work).","definition[45]":"work or products that are in the process of being done or made, but are not yet finished","example[142]":"Some journals expect editors to retain responsibility for work in progress when they leave."}