{"word[0]":"physical","signpost[0]":"body not mind","definition[0]":"related to someone’s body rather than their mind or emotions","example[0]":"She was in constant physical pain.","example[1]":"the physical and emotional needs of young adults","example[2]":"people with severe physical disabilities","example[3]":"Don’t be put off by his physical appearance.","example[4]":"He was obsessed with physical fitness.","definition[1]":"a physical relationship involves sex rather than just friendship","example[5]":"My attraction to him was totally physical.","example[6]":"Their physical relationship had never been very good.","definition[2]":"someone who is physical likes touching people a lot","example[7]":"She’s a very physical person.","signpost[1]":"violent","definition[3]":"involving touching someone in a rough or violent way","example[8]":"Football can be a very physical game.","example[9]":"I was a bit worried that the argument might become physical.","signpost[2]":"real/solid","definition[4]":"relating to real objects that you can touch, see, or feel","example[10]":"the physical world around us","example[11]":"the physical environment","example[12]":"They were kept in appalling physical conditions.","signpost[3]":"natural","definition[5]":"relating to or following natural laws","example[13]":"a physical explanation for this phenomenon","signpost[4]":"science","definition[6]":"a physical science is an area of scientific study that is related to physics","example[14]":"physical chemistry","collocation[0]":"physical activity","example[15]":"We all know about the health benefits of physical activity.","collocation[1]":"physical contact","example[16]":"There shall be no intentional physical contact between teams.","collocation[2]":"physical abuse/violence","example[17]":"He had suffered physical abuse at the hands of his parents.","collocation[3]":"somebody’s physical appearance","example[18]":"Describe his physical appearance.","collocation[4]":"physical pain","example[19]":"She bravely endured great physical pain.","collocation[5]":"physical strength","example[20]":"The murder could have been committed only by a man of enormous physical strength.","collocation[6]":"physical fitness","example[21]":"You need to work on your physical fitness.","collocation[7]":"a physical disability","example[22]":"From birth he has suffered from severe physical disabilities.","collocation[8]":"a physical defect","example[23]":"Most babies are born without physical defects.","definition[7]":"a thorough examination of someone’s body by a doctor, in order to discover whether they are healthy or have any illnesses or medical problems","definition[8]":"real and actual","example[24]":"the physical counting of goods in stock","definition[9]":"related to assets that can be seen and touched, such as machines and buildings","synonym[0]":"TANGIBLE","example[25]":"They had a physical plant valued at $3,455,050 and cash reserves of $729,886.","definition[10]":"involving shares, bonds etc where there are CERTIFICATEs (=documents showing ownership), rather than shares etc where ownership is recorded on a computer","example[26]":"It’s hard to imagine that many investors would prefer having physical certificates when a computer entry seems at least as reliable.","definition[11]":"involving COMMODITIES (=oil, metals, farm products etc) for actual or immediate delivery, rather than FUTURES (=contracts for delivery at a later date)","example[27]":"Traders of agricultural futures contracts usually don’t take physical delivery of the underlying commodity."}