{"word[0]":"believe","definition[0]":"to be sure that something is true or that someone is telling the truth","example[0]":"You shouldn’t believe everything you read.","example[1]":"I believed him, even though his story sounded unlikely.","example[2]":"I don’t believe a word of it (=I think it is completely untrue).","example[3]":"I don’t believe he’s only 25.","note[0]":"believe (that)","definition[1]":"to think that something is true or possible, although you are not completely sure","example[4]":"The four men are widely believed (=believed by a lot of people) to have been killed by their captors.","example[5]":"Did you honestly believe that I’d be stupid enough to do that?","example[6]":"I firmly believe that the business will be a success.","example[7]":"‘Have they arrived yet?’ ‘Yes, I believe so.’","note[1]":"believe so","example[8]":"Detectives believe that the victim knew his killer.","example[9]":"It is believed that the house was built in 1735.","note[2]":"it is believed (that)","example[10]":"At 115, Mrs Jackson is believed to be the oldest person in the country.","note[3]":"be believed to be something","definition[2]":"to have a religious faith","example[11]":"She says those who believe will go to heaven.","explanation[0]":"You believe that something is true","example[12]":"We believe that all men are equal","explanation[1]":"You believe that something should happen","example[13]":"We believe all men should be treated equally","explanation[2]":"You believe that someone can do something","example[14]":"I still believe that we can win ","explanation[3]":"You believe that something might or could happen","example[15]":"Do you believe that things might change?","explanation[4]":"In more formal English, you can say it is believed that","example[16]":"It was believed that the King’s touch could cure diseases","explanation[5]":"In all the above patterns with that, ‘that’ can be omitted","example[17]":"We believe all men are equal","heading[0]":"to believe something","example[18]":"I believed her when she said that she loved me.","example[19]":"Don’t believe anything he tells you.","display[0]":"accept","definition[3]":"to believe that something is true, especially because someone has persuaded you to believe it","example[20]":"His wife accepted his explanation for why he was late.","example[21]":"Leah had slowly come to accept her brother’s version of events.","display[1]":"take somebody’s word for it","definition[4]":"to believe what someone says is true, even though you have no proof or experience of it","example[22]":"I don’t know anything about him, so I’ll just have to take your word for it.","example[23]":"You don’t have to take my word for it – go and see for yourself.","example[24]":"‘Cakes are very easy to make.’ ‘I’ll take your word for it.’","display[2]":"give somebody the benefit of the doubt","definition[5]":"to believe what someone says, even though you think it might not be true","example[25]":"Unless you have proof, you should give him the benefit of the doubt.","heading[1]":"to believe something that is untrue","display[3]":"be taken in","definition[6]":"to be tricked into believing something that is not true","example[26]":"A lot of people were taken in by these claims.","example[27]":"I can’t believe she fell for that old excuse!","display[4]":"swallow","definition[7]":"to believe a story or explanation that is not true, especially when this makes you seem silly","example[28]":"His aunt had swallowed his story unquestioningly.","example[29]":"Police refused to swallow his story, and put him in a cell."}