{"word[0]":"valuable","definition[0]":"worth a lot of money","opposite[0]":"worthless","example[0]":"a valuable painting","example[1]":"Their most valuable belongings were locked in a safe in the bedroom.","definition[1]":"valuable help, advice, information etc is very useful because it helps you to do something","example[2]":"Muriel has made a valuable contribution to our company’s success.","example[3]":"a job that gave him valuable experience","definition[2]":"important because there is only a limited amount available","synonym[0]":"precious","example[4]":"I won’t waste any more of your valuable time.","heading[0]":"– Meaning 2: valuable help, advice, information etc is very useful because it helps you to do something","example[5]":"There can be no doubt that this sort of help is valuable for teachers.","example[6]":"The booklet contains valuable advice for new mothers.","example[7]":"The police were contacted by a number of people who had valuable information about the bombings.","example[8]":"The experience you can gain in a small advertising agency will be very valuable.","collocation[0]":"contribution","example[9]":"He made a valuable contribution to our work.","collocation[1]":"asset","example[10]":"If you have a good network of contacts, you have a valuable asset.","collocation[2]":"source","example[11]":"Fish are a valuable source of protein.","example[12]":"Exercise is a valuable tool in treating depression.","collocation[3]":"prove valuable","example[13]":"This advice was to prove valuable.","definition[3]":"worth a lot of money and expensive to buy","example[14]":"a valuable piece of jewellery","example[15]":"The carpet is extremely valuable.","display[0]":"priceless","definition[4]":"so valuable that it is impossible to calculate a price","example[16]":"a priceless painting by Rembrandt","example[17]":"The statue is priceless.","display[1]":"precious metal/stone","definition[5]":"precious metals such as gold, or stones such as diamonds are very rare and expensive","example[18]":"Back in ancient times, coins contained precious metals.","example[19]":"The ring was set with dozens of precious stones.","display[2]":"worth a lot/a fortune","definition[6]":"to be worth a very large amount of money","example[20]":"Some rare baseball cards are worth a fortune.","heading[1]":"very special and important","definition[7]":"very special and important to someone – used about people or things","example[21]":"My family have always been precious to me.","example[22]":"His free time was very precious to him.","example[23]":"the place where I kept my most precious things","display[3]":"prized","definition[8]":"very special and important to someone, so that they want very much to keep it or obtain it","example[24]":"The book was one of his most prized possessions.","example[25]":"The shells are prized for their beauty  (=are considered to be very special).","display[4]":"treasured","definition[9]":"very special and important to someone, especially because it is connected with someone they love","example[26]":"the case in which she kept her most treasured possessions","example[27]":"The holiday was now a treasured memory.","example[28]":"a treasured gift from her grandmother","display[5]":"irreplaceable","definition[10]":"extremely special and important, especially because it is the only one of its kind","example[29]":"The manuscripts are said to be irreplaceable.","example[30]":"The falling dollar makes US company profits less valuable.","example[31]":"The fuel oil will be converted into more valuable products, such as gasoline."}