{"word[0]":"temporary","definition[0]":"continuing for only a limited period of time","opposite[0]":"permanent","example[0]":"temporary pain relief","example[1]":"I’m living with my parents, but it’s only temporary.","example[2]":"You might want to consider temporary work until you decide what you want to do.","example[3]":"She was employed on a temporary basis.","definition[1]":"intended to be used for only a limited period of time","example[4]":"temporary accommodation","example[5]":"The bridge was erected as a temporary measure.","example[6]":"I’ve got a temporary office job, but I hope I’ll find something more permanent soon.","example[7]":"I’m sure the problem is only temporary.","example[8]":"temporary staff","example[9]":"a temporary visa","display[0]":"provisional","definition[2]":"temporary – used especially about arrangements or information that people may decide to change in the future. Also used about licences or governments which are only arranged to last for a short time","example[10]":"Does the hotel accept provisional bookings?","example[11]":"They have set a provisional date for the next meeting.","example[12]":"a provisional driving licence","example[13]":"In June, the rebels claimed to have formed a provisional government.","example[14]":"Provisional figures yesterday from the Department of Transport showed that 4,274 people were killed last year — 6 percent fewer than the previous year.","display[1]":"stopgap","definition[3]":"temporary – used about something that you use for a short time until you can replace it with something better","example[15]":"The Republicans will approve the one-month budget as a stopgap measure to keep the state operating.","example[16]":"This is only a stopgap solution to the country’s debt problem.","display[2]":"passing","definition[4]":"temporary – used about an interest, thought, or feeling that is short and not very serious","example[17]":"Tonight’s game will be exciting, even to those with only a passing interest in the sport.","example[18]":"As a student, I didn’t give working in finance even a passing thought.","display[3]":"ephemeral","definition[5]":"existing or popular for only a short time","example[19]":"the ephemeral beauty of white snow on green trees and bare branches","example[20]":"Many new words, particularly slang, are fleeting and ephemeral.","display[4]":"transient","definition[6]":"continuing for only a limited time, or staying somewhere for only a short time – used especially to say that something is always changing, or people only stay somewhere for a short time","example[21]":"the transient nature of life","example[22]":"transient changes in the electrical properties of the neurons","example[23]":"Arizona has a highly transient population.","definition[7]":"a contract, job etc that is only intended to continue for a short time, for example until a particular piece of work is finished","definition[8]":"an employee who is only employed for a short time, for example to do a particular piece of work"}