{"word[0]":"compete","definition[0]":"if one company or country competes with another, it tries to get people to buy its goods or services rather than those available from another company or country","example[0]":"Small independent bookstores simply can’t compete with the big national chains.","note[0]":"can’t compete (with something)","example[1]":"They found themselves competing with foreign companies for a share of the market.","note[1]":"compete with/against","example[2]":"The Renault Clio competes against such cars as the Peugeot 206.","example[3]":"The stores have to compete for customers in the Christmas season.","note[2]":"compete for","example[4]":"The company must be able to compete in the international marketplace.","note[3]":"compete in","example[5]":"Several advertising agencies are competing to get the contract.","note[4]":"compete to do something","definition[1]":"to try to gain something and stop someone else from having it or having as much of it","example[6]":"She and her sister are always competing for attention.","example[7]":"I had to compete against 19 other people for the job.","note[5]":"compete against","example[8]":"As a stepmother, don’t even try to compete with the children’s mother for their love.","note[6]":"compete with","signpost[0]":"in a competition","definition[2]":"to take part in a competition or sports event","example[9]":"How many runners will be competing in the marathon?","note[7]":"compete in/at","example[10]":"Professional athletes may now compete at the Olympics.","example[11]":"He’ll be competing against the world’s best.","explanation[0]":"Compete is a reciprocal verb This type of verb is used when saying that two or more people or groups do something that involves both or all of them","example[12]":"We were competing for her attention","example[13]":"We were competing with each other for her attention","example[14]":"I was competing with them for her attention","definition[3]":"when one company or country competes with another, it tries to get people to buy its goods or services rather than those available from another company or country","example[15]":"measures to enable Irish industries to compete effectively in Europe","example[16]":"It has to keep its own prices down so that it can compete with other major electricity suppliers.","example[17]":"If the pound continues at this level our exporters can’t compete for sales across the Atlantic."}