{"word[0]":"expertise","definition[0]":"special skills or knowledge in a particular subject, that you learn by experience or training","example[0]":"What he’s bringing to the company is financial expertise.","note[0]":"technical/financial/medical etc expertise","example[1]":"trainee engineers with varying degrees of computer expertise","example[2]":"expertise in the management of hotels","note[1]":"expertise in","collocation[0]":"have expertise","example[3]":"Each scientist had expertise in either mammals, insects, birds, or plants.","collocation[1]":"need/require expertise","example[4]":"It’s a specialist job that requires expertise.","collocation[2]":"lack expertise","example[5]":"The country lacks the expertise, equipment and finance to deal with the disaster.","collocation[3]":"considerable expertise","example[6]":"The Marine Pollution Control Unit has considerable expertise in dealing with oil spills.","collocation[4]":"medical/scientific/technical expertise","example[7]":"How can an individual without medical expertise make such a decision?","collocation[5]":"professional expertise","example[8]":"A health and safety inspector will be glad to give you the benefit of his professional expertise.","collocation[6]":"managerial/management expertise","example[9]":"Does he have the management expertise required to make the department more productive?","collocation[7]":"business expertise","example[10]":"The company took him on for his business expertise.","collocation[8]":"legal expertise","example[11]":"His father, also a lawyer, used his legal expertise to help civil rights groups.","collocation[9]":"special/specialist expertise","example[12]":"Our haulage company has specialist expertise in transporting hi-tech products.","collocation[10]":"relevant expertise","example[13]":"All the applicants for the post had the relevant expertise to do the job.","collocation[11]":"somebody’s area/field of expertise","example[14]":"a historian whose area of expertise is the Roman Empire","collocation[12]":"degree/level of expertise","example[15]":"Different financial advisers will have different levels of expertise.","collocation[13]":"range of expertise","example[16]":"The committee hopes to draw on a wide range of expertise from different institutions.","collocation[14]":"a lack of expertise","example[17]":"His lack of expertise in running such a large factory led to serious production problems.","definition[1]":"special skills or knowledge in an area of work or study","example[18]":"the broker’s international tax and accounting expertise","example[19]":"An independent financial adviser’s area of expertise includes products such as pension plans and insurance policies.","example[20]":"Renault’s expertise in corrosion protection is confirmed by the new eight-year anti-corrosion warranty covering all models of the Clio."}