{"word[0]":"remember","signpost[0]":"the past","definition[0]":"to have a picture or idea in your mind of people, events, places etc from the past","example[0]":"Do you remember Rosa Davies?","example[1]":"I can’t remember her exact words.","example[2]":"I remember it well; I’d never seen my mother so angry.","example[3]":"She clearly remembers the excitement as they boarded the train.","example[4]":"I vaguely remember reading something about it in the paper.","example[5]":"They had three children, if I remember rightly.","example[6]":"They’ve lived here for as long as I can remember.","example[7]":"No one got drunk as far as I can remember.","example[8]":"I remember you two couldn’t stand each other at first!","note[0]":"remember (that)","example[9]":"I remember meeting her at a party once.","note[1]":"remember (somebody) doing something","example[10]":"I remember my father bringing home a huge Christmas tree.","explanation[0]":"The verb remember is not usually used in the progressive in this meaning You say","example[11]":"Yes, I remember him","bad_example[0]":"Yes, I am remembering him","explanation[1]":"You often say someone can remember something when describing what they remember","example[12]":"Yes, I can remember him","explanation[2]":"Do not use ‘remember about’ in this meaning You say","example[13]":"Do you remember that day?","bad_example[1]":"Do you remember about that day?","signpost[1]":"information/facts","definition[1]":"to bring information or facts that you know into your mind","example[14]":"You left your keys on the table, remember?","example[15]":"I can’t remember her phone number.","example[16]":"I suddenly remembered that I’d left the stove on.","example[17]":"I called the office, but I don’t remember who I spoke to.","note[2]":"remember what/how/why etc","signpost[2]":"to do/get something","definition[2]":"to not forget something that you must do, get, or bring","example[18]":"I hope he remembers the wine.","example[19]":"Remember to take your P.E. clothes to school.","note[3]":"remember to do something","signpost[3]":"keep something in mind","definition[3]":"to keep a particular fact about a situation in your mind","example[20]":"Remember, processed food is usually full of salt and sugar.","example[21]":"Remember that not everyone has as much money as you.","note[4]":"remember that","example[22]":"It should be remembered that a lot of work went into this event.","note[5]":"it should/must be remembered (that)","signpost[4]":"honour the dead","definition[4]":"to think with respect about someone who has died, often in a ceremony","example[23]":"On this day we remember the dead of two world wars.","signpost[5]":"give somebody a present","definition[5]":"to give someone a present on a particular occasion","note[6]":"remember somebody in your will (=arrange for someone to have something of yours after you die)","example[24]":"Lilian always remembers me at Christmas.","collocation[0]":"remember well","example[25]":"I remember so well my first day there.","collocation[1]":"remember clearly/vividly/distinctly","example[26]":"I remember clearly how I used to feel as a child in church on Sundays.","collocation[2]":"remember vaguely/dimly","example[27]":"He could vaguely remember his mother’s face.","collocation[3]":"remember fondly","example[28]":"The restaurant is fondly remembered by many.","collocation[4]":"remember rightly/correctly","example[29]":"You were still at school, if I remember rightly.","collocation[5]":"hardly/barely remember","example[30]":"I can hardly remember him.","definition[6]":"to form an idea in your mind of people, events, places etc from the past","example[31]":"I remember Janine – she lived in that house on the corner.","example[32]":"I can’t remember how the film ends.","example[33]":"He remembered meeting her at a party once.","display[0]":"recall","definition[7]":"to remember a particular fact, event, or situation, especially in order to tell someone about it","example[34]":"Can you recall where your husband was that night?","example[35]":"She recalled that he had seemed a strange, lonely man.","display[1]":"recollect","definition[8]":"to remember an event or situation","example[36]":"Harry smiled as he recollected the scene.","example[37]":"She tried to recollect what had happened next in her dream.","display[2]":"memorize","definition[9]":"to learn facts, a piece of writing or music etc, so that you can remember them later","example[38]":"He’s trying to memorize his speech.","example[39]":"Don’t write down your PIN number, memorize it.","display[3]":"think back/look back","definition[10]":"to think about something that happened in the past","example[40]":"I thought back to when I was his age.","example[41]":"Looking back, I should have been more patient with her.","example[42]":"We need to stop looking back and start thinking about the future.","display[4]":"reminisce","definition[11]":"to talk about pleasant events, people, experiences etc from the past, because you want to remember them or enjoy talking about them","example[43]":"They were reminiscing about old times.","example[44]":"I used to spend hours listening to my grandfather reminisce.","display[5]":"bear something in mind","definition[12]":"to remember something important when you are doing something, because it could affect what you do","example[45]":"Bear in mind that this is the first time he’s done this.","display[6]":"something is on the tip of your tongue","definition[13]":"used to say that you know a word or a name but that you have difficulty remembering it at this exact moment","example[46]":"His name’s on the tip of my tongue. I’ll think of it in a minute.","display[7]":"remind somebody of something","definition[14]":"to make you think of another person, thing, or time, because they are similar","example[47]":"It reminds me of the time when I first started teaching.","example[48]":"The taste reminded him of school dinners."}