{"word[0]":"import","definition[0]":"a product that is brought from one country into another so that it can be sold there, or the business of doing this","opposite[0]":"export","example[0]":"a ban on beef imports","example[1]":"the abolition of import duties (=taxes)","example[2]":"American demand for Japanese imports  (=goods from Japan)","example[3]":"the import of electrical goods","example[4]":"cheap imports from Asia","note[0]":"import from","definition[1]":"something new or different that is brought to a place where it did not previously exist","example[5]":"The beetle is thought to be a European import.","definition[2]":"importance or meaning","example[6]":"a matter of no great import","form[0]":"ADJECTIVES/NOUN + imports","collocation[0]":"foreign imports","example[7]":"Foreign imports into Britain continued to grow in the 1970s.","collocation[1]":"cheap imports","example[8]":"Farmers are complaining about cheap imports flooding the market.","collocation[2]":"Japanese/French etc imports","example[9]":"Japanese imports rose by 5% last year.","collocation[3]":"oil/coal/food imports","example[10]":"The country is dependent on oil imports for almost all its basic energy needs.","collocation[4]":"rice/sugar etc imports","example[11]":"There is pressure on the country to reduce its rice imports.","collocation[5]":"agricultural imports","example[12]":"Restrictions on agricultural imports remain in place.","collocation[6]":"essential imports","example[13]":"The country had problems paying for its essential imports.","collocation[7]":"luxury imports","example[14]":"Higher duties were placed on luxury imports.","collocation[8]":"increase imports","example[15]":"The company increased imports in order to cut domestic production costs.","collocation[9]":"reduce/cut imports","example[16]":"New investment will reduce imports and save jobs.","collocation[10]":"control/restrict imports","example[17]":"The scheme aims to control imports of cheap goods.","collocation[11]":"ban imports","example[18]":"The organization wants the government to ban imports of exotic birds.","collocation[12]":"imports increase/rise/grow","example[19]":"Imports increased by 13 percent last year.","collocation[13]":"imports fall/drop","example[20]":"Imports of consumer goods fell sharply in December.","form[1]":"import + NOUN","collocation[14]":"an import ban","example[21]":"The US imposed an import ban on several types of fish.","collocation[15]":"import restrictions/controls","example[22]":"Severe import controls were introduced.","collocation[16]":"import quotas","example[23]":"Each country introduced its own import quotas.","collocation[17]":"import taxes/duties/tariffs","example[24]":"The US imposed huge import duties on products from Europe.","definition[3]":"to bring a product from one country into another so that it can be sold there","example[25]":"In 2001, Britain exported more cars than it imported.","example[26]":"All the meat is imported from France.","note[1]":"import something from something","definition[4]":"to introduce something new or different in a place where it did not previously exist","example[27]":"The unusual designs were probably imported from Iran.","example[28]":"The US comedy format was gradually imported to UK screens.","note[2]":"import something to/into something","definition[5]":"to move information from one computer to another","example[29]":"You can now import graphics from other applications.","note[3]":"import something from/into something","definition[6]":"something that is made in one country and brought into another, usually in order to be sold there","example[30]":"The shops are full of cheap imports.","definition[7]":"the activity of bringing goods into a country","synonym[0]":"IMPORTATION","example[31]":"US regulations on the import of four-wheel drive vehicles","note[4]":"import of","example[32]":"a ban on imports of exotic birds","example[33]":"A slowdown in Japan’s domestic economy led to a sharp decline in imports of luxury cars.","definition[8]":"the amount or value of the goods brought into a country over a particular period of time","example[34]":"With a strong dollar, US exports will continue to decline and imports will rise.","definition[9]":"to bring something into a country from abroad, usually in order to sell it","example[35]":"We must reduce the country’s dependence on imported oil.","example[36]":"Bees were imported from Africa in an effort to improve honey production.","example[37]":"These raw materials are all imported into Korea, as there are no local producers.","note[5]":"import something into something","definition[10]":"to move information from one computer or software program into another","example[38]":"You can either type your data into this form or you can import data from a spreadsheet."}