{"word[0]":"basis","plural[0]":"bases","definition[0]":"the facts, ideas, or things from which something can be developed","example[0]":"Their claim had no basis in fact  (=it was not true).","example[1]":"Bread forms the basis of their daily diet.","note[0]":"basis of","example[2]":"The video will provide a basis for class discussion.","note[1]":"basis for","definition[1]":"the way that something happens, or the way that something is organized or done","example[3]":"I’m saving money on a regular basis.","note[2]":"on a regular/daily/weekly etc basis","example[4]":"Board meetings are held on a weekly basis. ","example[5]":"Nurses are employed on a full-time basis.","note[3]":" on a voluntary/part-time/temporary etc basis","collocation[0]":"form the basis of something","example[6]":"This research will form the basis of a book.","collocation[1]":"provide a basis for something","example[7]":"The poem provided the basis for an interesting class discussion.","collocation[2]":"become the basis of/for something","example[8]":"Some of these ideas became the basis for the Parents’ Educational Union.","collocation[3]":"serve as a basis for something","example[9]":"The document will serve as a basis for negotiations.","collocation[4]":"establish a basis","example[10]":"The agreement established a sound basis for international commerce.","collocation[5]":"have a basis","example[11]":"Our constitution has a democratic basis.","collocation[6]":"have no basis in fact","example[12]":"Many of these rumours have no basis in fact.","collocation[7]":"a good basis","example[13]":"Love and trust form a good basis for marriage.","collocation[8]":"a sound/firm/solid basis","example[14]":"Drama school may provide a sound basis for an acting career.","definition[2]":"the facts, ideas, things etc from which something can be developed","example[15]":"His work will be used as a basis for future research.","display[0]":"foundation","definition[3]":"the thing on which something is based, especially something important that continues for a long time","example[16]":"Their ideas were the foundation for the political system that exists in the UK today.","example[17]":"How can we provide a solid foundation for world peace?","display[1]":"bedrock","definition[4]":"the most important thing that something depends on in order to be successful","example[18]":"Honesty is the bedrock of any healthy relationship.","example[19]":"Labour’s traditional bedrock of support is among the working classes.","display[2]":"cornerstone","definition[5]":"the most important thing that something depends on in order to be successful, especially in business and politics","example[20]":"Confidence is the cornerstone of our business.","example[21]":"NATO remains a cornerstone of defence policy for Europe.","definition[6]":"the facts or ideas from which something can be developed","example[22]":"If talks restart, this package is likely to be a basis for negotiation.","definition[7]":"the original figures from which something can be calculated or valued","example[23]":"These figures will be the basis for future price calculations.","note[4]":"basis for/of"}