{"word[0]":"appeal","signpost[0]":"request","definition[0]":"an urgent request for something important","example[0]":"The girl’s family have made a public appeal for help to try and catch her killer.","example[1]":"The police have issued a new appeal for information.","note[0]":"appeal for","example[2]":"All the organizations involved have sent urgent appeals to the government, asking for extra funding.","note[1]":"appeal to","example[3]":"an appeal to the army to not use too much force","note[2]":"appeal to somebody to do something","signpost[1]":"request for money","definition[1]":"an attempt to persuade people to give money in order to help people who need something","example[4]":"The appeal has nearly reached its target of £100,000.","signpost[2]":"request to change decision","definition[2]":"a formal request to a court or to someone in authority asking for a decision to be changed","example[5]":"an appeal to the European Court of Human Rights","example[6]":"The sentence was reduced to three years on appeal.","note[3]":"on appeal","signpost[3]":"being attractive","definition[3]":"a quality that makes people like something or someone","example[7]":"What is the particular appeal of this island?","example[8]":"The programme has a very wide appeal.","example[9]":"She’s definitely got sex appeal  (=she is sexually attractive).","example[10]":"The film has great appeal for young audiences.","collocation[0]":"make/issue/launch an appeal","example[11]":"Detectives are making an urgent appeal for information.","example[12]":"The hospital has launched an appeal to raise money for new equipment.","collocation[1]":"renew an appeal","example[13]":"Detectives renewed their appeal for help from the public.","collocation[2]":"an urgent appeal","example[14]":"The fire service has made an urgent appeal for more part-time firefighters.","collocation[3]":"a desperate appeal","example[15]":"The family made a desperate appeal to their daughter to come home.","example[16]":"The London-based relief agency issued a desperate appeal for aid.","collocation[4]":"a direct appeal","example[17]":"The police have issued a direct appeal to the witness to come forward with information.","collocation[5]":"a personal appeal","example[18]":"Muslim leaders made a personal appeal for the hostage's freedom.","collocation[6]":"a public appeal","example[19]":"She made a public appeal for the return of the ring.","collocation[7]":"a fresh appeal","example[20]":"The growing instability in the country has led to fresh appeals for calm.","collocation[8]":"a nationwide appeal","example[21]":"The missing 15-year-old was found yesterday after a nationwide appeal for help.","collocation[9]":"an international appeal","example[22]":"The organization has now launched an international appeal for volunteers.","collocation[10]":"a television appeal","example[23]":"Following a national television appeal, several callers have phoned the police with information.","heading[0]":"– Meaning 3: a formal request to a court or to someone in authority asking for a decision to be changed","collocation[11]":"make an appeal","example[24]":"My client is planning to make an appeal.","collocation[12]":"lodge/file/bring an appeal","example[25]":"Mr Sarhadi, who has lived here for three years, has lodged an appeal against extradition.","collocation[13]":"consider an appeal","example[26]":"The US Supreme Court could refuse to consider the appeal.","collocation[14]":"hear an appeal","example[27]":"The FA will hear Chelsea's appeal against the fine next week.","collocation[15]":"win/lose an appeal","example[28]":"Unless she wins her appeal she will be imprisoned.","collocation[16]":"uphold/allow an appeal","example[29]":"Judge Gabriel Hutton upheld Smith's appeal against a £250 fine.","collocation[17]":"dismiss/throw out/turn down an appeal","example[30]":"The taxpayer's appeal was dismissed and the penalty upheld.","collocation[18]":"an appeal fails/succeeds","example[31]":"If the appeal fails, he will serve his full sentence.","form[0]":"appeal + NOUN","collocation[19]":"the appeal court","example[32]":"The ruling was reversed in the appeal court.","collocation[20]":"the appeal process","example[33]":"The appeal process could take as long as three years.","collocation[21]":"a formal appeal","example[34]":"She decided to make a formal appeal through her lawyer.","collocation[22]":"the Court of Appeal","example[35]":"The Court of Appeal quashed the conviction.","collocation[23]":"grounds for an appeal","example[36]":"You need to have reasonable grounds for your appeal.","collocation[24]":"a right of appeal","example[37]":"The taxpayer has no statutory right of appeal against the demand.","collocation[25]":"pending appeal","example[38]":"Both men were under house arrest, pending appeal of their convictions.","signpost[4]":"ask","definition[4]":"to make a serious public request for help, money, information etc","example[39]":"Church and community leaders have appealed for calm.","example[40]":"Farmers have appealed to the government for help.","example[41]":"The police have appealed to anyone with information to come forward and talk to them.","signpost[5]":"ask to change decision","definition[5]":"to make a formal request to a court or someone in authority asking for a decision to be changed","example[42]":"She is not happy with the decision and plans to appeal.","example[43]":"Both men intend to appeal against their convictions.","note[4]":"appeal against","example[44]":"Appealing to the referee does not often result in a decision being changed.","signpost[6]":"be attractive","definition[6]":"if someone or something appeals to you, they seem attractive and interesting","example[45]":"The idea of working abroad really appeals to me.","example[46]":"The programme appeals to young children.","definition[7]":"an official request to a higher authority for a decision made by a court, committee etc to be changed","example[47]":"The company’s appeal against the assessment will be determined at the tribunal.","example[48]":"the accused’s rights of appeal","definition[8]":"an urgent request for something such as money or help","example[49]":"a United Nations appeal for aid","definition[9]":"a quality that makes people like something or want to buy it","example[50]":"The company has a reputation for identifying products with wide popular appeal.","example[51]":"the mass appeal of the Internet","definition[10]":"to make a formal request to a higher authority for a decision made by a court, committee etc to be changed","example[52]":"The accused applied for leave to appeal against the conviction.","note[5]":"appeal against something","example[53]":"Applicants refused planning permission can appeal to the ministry.","note[6]":"appeal to somebody/something","definition[11]":"to ask for money, help, or information from someone","example[54]":"We appeal to our sisters all over the world to stand by us.","note[7]":"appeal to somebody","example[55]":"The President went on nationwide television and radio to appeal for a yes vote.","note[8]":"appeal for something","definition[12]":"if a product appeals to a particular type of person, that type of person likes it and is likely to buy it","example[56]":"A lot of their products appeal to the older consumer."}