{"word[0]":"similarity","plural[0]":"similarities","definition[0]":"if there is a similarity between two things or people, they are similar in some way","opposite[0]":"difference","example[0]":"There are similarities with German, though Yiddish is a distinct language.","example[1]":"They are both blonde, but there the similarity ends.","example[2]":"There are some striking similarities between the two plays.","note[0]":"similarity between","example[3]":"the song’s close similarity to traditional Jewish music","note[1]":"similarity to","example[4]":"The present crisis bears some similarity to the oil crisis of the 1970s.","example[5]":"the similarity of their names","note[2]":"similarity of","example[6]":"I was struck by the similarities in their early lives.","note[3]":"similarity in","example[7]":"The police are checking for similarities with other recent attacks in the area.","note[4]":"similarity with","collocation[0]":"a remarkable/striking/marked similarity","example[8]":"This ape's facial expressions show remarkable similarities to ours.","collocation[1]":"a close/great/strong similarity","example[9]":"There was a close similarity between his and Smith's views on education.","collocation[2]":"a certain similarity","example[10]":"There are certain similarities between the two theories.","collocation[3]":"a superficial similarity","example[11]":"the superficial similarities between animal behaviour and human behaviour","collocation[4]":"an apparent similarity","example[12]":"Many apparent similarities became less convincing on closer examination.","collocation[5]":"there is a similarity between things","example[13]":"There are lots of similarities between the two bikes.","collocation[6]":"bear a/some similarity to something","example[14]":"The murder bore a striking similarity to another shooting 25 miles away.","collocation[7]":"have similarities","example[15]":"The two towns have many similarities.","collocation[8]":"show similarities","example[16]":"Twins who are raised apart still show similarities in their behaviour.","collocation[9]":"the similarity ends","example[17]":"Both artists work on a small scale, but there the similarity ends."}