{"word[0]":"frightened","definition[0]":"feeling afraid","synonym[0]":"scared","example[0]":"Don’t be frightened. We’re not going to hurt you.","example[1]":"To tell the truth, I was frightened to death (=very frightened).","example[2]":"a frightened horse","example[3]":"I was frightened of being left by myself in the house.","note[0]":"frightened of","example[4]":"Her father had an awful temper and she was always frightened of him.","example[5]":"The boy was frightened to speak.","note[1]":"frightened to do something","example[6]":"She’s frightened that her ex-husband will find her.","note[2]":"frightened that","definition[1]":"feeling worried because you might get hurt or because something bad might happen","example[7]":"I was too frightened to say anything.","example[8]":"Many animals are frightened of fireworks.","example[9]":"Frightened residents called the police as the gang started throwing bricks.","definition[2]":"frightened. Scared is less formal than frightened and is the usual word to use in everyday English","example[10]":"I’m scared of dogs.","example[11]":"Old people are too scared to go out of their homes.","display[0]":"afraid","definition[3]":"frightened. Afraid sounds more formal than frightened or scared","example[12]":"Children are often afraid of the dark.","example[13]":"I was afraid that I might say the wrong thing.","display[1]":"alarmed","definition[4]":"frightened and worried that something bad might happen","example[14]":"She was alarmed at the thought of performing in front of an audience.","example[15]":"Alarmed passengers spotted fuel leaking from the plane.","display[2]":"fearful","definition[5]":"frightened that something bad might happen","example[16]":"They are fearful of another terrorist attack.","example[17]":"He was fearful that he might make another mistake.","example[18]":"a fearful panic","heading[0]":"very frightened","display[3]":"terrified","example[19]":"He looked terrified as the plane took off.","example[20]":"James was absolutely terrified of losing his only child.","example[21]":"He dragged the terrified woman into his car.","display[4]":"petrified","definition[6]":"very frightened – used especially when you are so frightened that you cannot think or move","example[22]":"She’s absolutely petrified of spiders.","display[5]":"scared stiff/scared to death","example[23]":"I had to make a speech, and I was scared stiff.","example[24]":"She was scared to death of her father.","display[6]":"in terror","definition[7]":"if you do something in terror, you do it because you are very frightened","example[25]":"People fled in terror as the building went up in flames."}