{"word[0]":"lifestyle","definition[0]":"the way a person or group of people live, including the place they live in, the things they own, the kind of job they do, and the activities they enjoy","example[0]":"Regular exercise is part of a healthy lifestyle.","example[1]":"They lead an extremely lavish lifestyle.","note[0]":"lavish/comfortable/simple etc lifestyle","collocation[0]":"a healthy lifestyle","example[2]":"A healthy lifestyle includes taking exercise and not smoking.","collocation[1]":"an active lifestyle","example[3]":"An active lifestyle has many health benefits.","collocation[2]":"a sedentary lifestyle","example[4]":"A sedentary lifestyle can cause certain health problems.","collocation[3]":"a lavish/extravagant lifestyle","example[5]":"How can he afford such a lavish lifestyle?","collocation[4]":"a comfortable lifestyle","example[6]":"He enjoyed a comfortable lifestyle in his retirement.","collocation[5]":"a simple lifestyle","example[7]":"He admired the simple lifestyle of the islanders.","collocation[6]":"an alternative lifestyle","example[8]":"Is choosing to be green really an alternative lifestyle?","collocation[7]":"a busy/hectic lifestyle","example[9]":"Many people these days have a busy lifestyle.","collocation[8]":"a stressful lifestyle","example[10]":"A stressful lifestyle may lead to a number of medical problems.","collocation[9]":"have a healthy/simple etc lifestyle","example[11]":"We had very different lifestyles.","collocation[10]":"change your lifestyle","example[12]":"You can help prevent heart disease by changing your lifestyle.","collocation[11]":"maintain your lifestyle","example[13]":"You cannot maintain this lifestyle on your income.","collocation[12]":"lead a healthy/simple etc lifestyle","example[14]":"You can change your eating habits and lead a healthier lifestyle.","collocation[13]":"live a healthy/simple etc lifestyle","example[15]":"I had enough money to live a lavish lifestyle.","form[0]":"lifestyle + NOUN","collocation[14]":"a lifestyle change","example[16]":"There are many ways in which we can save energy without making dramatic lifestyle changes.","collocation[15]":"a lifestyle choice","example[17]":"We can significantly reduce our risks of getting certain diseases through lifestyle choices.","definition[1]":"the way someone lives, including where they live, their job and the sort of things they spend money on","example[18]":"Market segmentation looks at how people differ in their lifestyles and attitudes towards products and purchases.","example[19]":"the ultimate product range for the modern lifestyle"}