{"word[0]":"excess","definition[0]":"a larger amount of something than is allowed or needed","example[0]":"After you apply the oil, wait 20 minutes before wiping off any excess.","example[1]":"It was an excess of enthusiasm that caused the problem.","note[0]":"excess of","definition[1]":"behaviour which is not acceptable because it is too extreme","example[2]":"a long sermon against the dangers of excess","heading[0]":"– Meaning 4:","collocation[0]":"worst excesses","example[3]":"He lived through some of the worst excesses of apartheid in South Africa.","collocation[1]":"wild excesses","example[4]":"The Press Complaints Commission criticized the wilder excesses of tabloid journalism.","collocation[2]":"curb the excesses of something","example[5]":"A strong press can help to curb the excesses of government.","collocation[3]":"commit excesses","example[6]":"The excesses committed by a small number of soldiers have ruined the regiment's good name.","collocation[4]":"perpetrate excesses","example[7]":"Government forces used the situation as an excuse to perpetrate excesses against suspected rebels.","definition[2]":"additional and not needed because there is already enough of something","example[8]":"Cut any excess fat from the meat.","example[9]":"He told the Federal Assembly that the devaluation would compensate for an excess in public spending during the past nine months.","definition[3]":"more than a particular amount","example[10]":"ships carrying in excess of 20,000 tonnes of cargo","definition[4]":"a condition in an insurance policy that states that the insured person will pay a particular amount towards any damage and the insurance company will pay the rest. This condition makes people less likely to claim for small amounts","example[11]":"The insurance company will pay the insured value less the policy excess.","definition[5]":"additional and not wanted or needed because there is already enough of something","example[12]":"An excess supply of goods and services on the market will exert downward pressure on prices.","definition[6]":"bags or cases that weigh more than the limit the airline allows you to take on a plane","example[13]":"As I checked in at Baghdad airport, I found that I had 100kg of excess baggage.","example[14]":"an excess baggage charge"}