{"signpost[0]":"system of rules","definition[0]":"the whole system of rules that people in a particular country or area must obey","example[0]":"Elected officials ought to obey the law.","example[1]":"By law, seat belts must be worn by all passengers.","note[0]":"by law","example[2]":"This is illegal under English law.","note[1]":"under English/international etc law","signpost[1]":"a rule","definition[1]":"a rule that people in a particular country or area must obey","example[3]":"laws passed by Parliament","example[4]":"Five people arrested under anti-terrorism laws were released without charge.","note[2]":"under a law","example[5]":"European laws on equal opportunities","note[3]":"law on","example[6]":"The laws against drug use were very strict.","note[4]":"law against","signpost[2]":"what always happens","definition[2]":"something that always happens in nature or society, or a statement that describes this","example[7]":"the law of supply and demand","note[5]":"law of","example[8]":"the laws of nature","example[9]":"the law of gravity","signpost[3]":"study/profession","definition[3]":"law as a subject of study, or the profession of being a lawyer","example[10]":"She’s studying law in London.","signpost[4]":"sport/activity","definition[4]":"one of the rules which controls a sport or activity","example[11]":"the laws of football","collocation[0]":"obey the law","example[12]":"Citizens have a duty to obey the law.","collocation[1]":"break the law","example[13]":"Is the company breaking the law?","collocation[2]":"pass a law","example[14]":"New Jersey passed a law requiring helmets for scooter riders.","collocation[3]":"become law","example[15]":"For a bill to become law, it must be approved by both Houses of Parliament.","collocation[4]":"make laws","example[16]":"Part of the function of Parliament is to make laws.","collocation[5]":"introduce a law","example[17]":"In 1989, a new law was introduced to protect the Polish language.","collocation[6]":"enforce a law","example[18]":"It is the job of the police to enforce the law.","collocation[7]":"flout a law","example[19]":"Employers who flout the law should be properly punished.","collocation[8]":"repeal a law","example[20]":"Many people want the law to be repealed.","collocation[9]":"a law prohibits something","example[21]":"The law prohibits possession of these animals.","collocation[10]":"something is against the law","example[22]":"The children knew that shoplifting was against the law.","collocation[11]":"stay/act within the law","example[23]":"The security forces must act within the law.","form[0]":"ADJECTIVES/NOUN + law","collocation[12]":"strict/tough","example[24]":"the country’s strict anti-tobacco laws","collocation[13]":"tax/copyright/divorce etc law(s)","example[25]":"an accountant who knows about tax law","collocation[14]":"criminal law","example[26]":"Criminal law contains definitions of such crimes as murder, rape, and robbery.","collocation[15]":"civil law","example[27]":"The punishment for breaking civil law is usually a fine.","collocation[16]":"international law","example[28]":"Under international law, the countries must respect the treaty.","collocation[17]":"English/German etc law","example[29]":"This is not an offence under English law.","collocation[18]":"federal law","example[30]":"Under federal law, it is illegal to discriminate against employees because of race or sex.","collocation[19]":"state law","example[31]":"Under state law it was illegal for any public official to receive gifts worth more than $100.","collocation[20]":"common law","example[32]":"In common law, if a house is rented out, it is expected that the house is safe to live in.","collocation[21]":"case law","example[33]":"There is little case law covering this issue.","definition[5]":"the whole system of rules that citizens of a country must obey","example[34]":"It is against the law (=illegal) for children to work before they are fifteen.","example[35]":"There were easy profits for businessmen who were prepared to break the law (=do something illegal).","example[36]":"The inheritance tax changes announced in the Budget became law (=were officially made a law).","example[37]":"By law (=according to the law) a company like British Gas has to hold a meeting of its shareholders once a year.","example[38]":"They make tough business deals, but are always careful to operate within the law (=do only legal things).","definition[6]":"a rule that people in a particular country, city, or local area must obey","example[39]":"a new state law, limiting insurance companies’ junk-bond holdings to 20% of assets","example[40]":"laws on the distribution of tobacco products","definition[7]":"when the people in a country obey the laws","example[41]":"The state was too weak to impose the rule of law.","definition[8]":"the study of laws, or the profession of being a lawyer","example[42]":"Peter is a law student.","example[43]":"Jackson studied law at Oxford University.","example[44]":"She’s a partner in a major New York law firm.","definition[9]":"a way in which things happen in an activity such as business, which is thought of as a rule because it seems impossible to change"}