{"word[0]":"territory","plural[0]":"territories","signpost[0]":"government/military","definition[0]":"land that is owned or controlled by a particular country, ruler, or military force","example[0]":"Hong Kong became Chinese territory in 1997.","example[1]":"The plane was flying over enemy territory.","note[0]":"occupied/enemy/disputed/hostile territory","signpost[1]":"type of land","definition[1]":"land of a particular type","example[2]":"an expedition through previously unexplored territory","note[1]":"uncharted/unexplored territory","definition[2]":"the area that an animal, bird etc regards as its own and will defend against other animals","example[3]":"A tiger has a large territory to defend.","example[4]":"A dog uses urine to mark its territory.","signpost[2]":"new or familiar experience","definition[3]":"a particular area of experience or knowledge","example[5]":"Actor Patrick Bergin returns to more familiar territory to play a menacing killer.","example[6]":"The company is moving into unfamiliar territory with this new software.","note[2]":"new/unfamiliar/uncharted territory","definition[4]":"an area in a town, country etc that someone is responsible for as part of their job, especially someone whose job is to sell products","example[7]":"a sales territory","signpost[3]":"land that is not a state","definition[5]":"land that belongs to the United States, Canada etc but that is not a state","example[8]":"the US territory of Guam","form[0]":"ADJECTIVES/NOUN + enemy","collocation[0]":"enemy/hostile territory","example[9]":"Patterson had never flown so deep into enemy territory before.","collocation[1]":"occupied territory","example[10]":"America has always wanted Israel to give up some of the occupied territory.","collocation[2]":"disputed territory","example[11]":"The latest round of talks over the disputed territory begins next week.","collocation[3]":"neutral territory","example[12]":"After crossing the frontier post, he would be safe in neutral territory.","collocation[4]":"Chinese/German etc territory","example[13]":"The Russians handed over to Poland a large slice of German territory.","definition[6]":"an area which is the responsibility of a particular salesperson","example[14]":"His sales force’s territory comprises Minnesota, the Dakotas, Iowa and Wisconsin.","definition[7]":"land that is owned or controlled by a particular government, ruler, or military force","example[15]":"The parliament has jurisdiction over minerals mined on its territory.","example[16]":"Until 1997 Hong Kong was a British territory.","definition[8]":"an area of experience or knowledge","example[17]":"Statistical analysis is not the exclusive territory of a handful of specialists.","example[18]":"The very competitive market is pushing firms into unfamiliar territory.","definition[9]":"a situation in which financial investments fall or rise in value, or in which shares etc are higher in value or price than ever before","example[19]":"On the world’s major exchanges, stocks ended in negative territory.","example[20]":"A late spurt of buying pulled the Dow Jones into positive territory."}