{"word[0]":"man","plural[0]":"men","signpost[0]":"male person","definition[0]":"an adult male human","example[0]":"There were two men and a woman in the car.","example[1]":"He’s a very kind man.","example[2]":"a man’s watch","example[3]":"Don’t keep Hansen waiting – he’s a busy man.","signpost[1]":"strong/brave","definition[1]":"a man who has the qualities that people think a man should have, such as being brave, strong etc","example[4]":"Come on, be a man now. No more crying.","example[5]":"He wasn’t man enough (=strong or brave enough) to face up to his responsibilities.","example[6]":"Running his own business has really made a man out of Terry.","note[0]":"make a man (out) of somebody","definition[2]":"a person, either male or female – used especially in formal situations or in the past","example[7]":"All men are equal in the eyes of the law.","example[8]":"a man’s right to work","definition[3]":"people as a group","note[1]":"prehistoric/Stone Age/modern man (=people who lived at a particular stage of human development)","example[9]":"This is one of the worst diseases known to man.","example[10]":"the evolution of man","signpost[2]":"worker","definition[4]":"a man who works for an employer","example[11]":"Why were there no protests from the men at the factory?","definition[5]":"a man who does a job for you, especially repairing something","example[12]":"Has the man been to fix the TV?","example[13]":"I waited all day for the gas man.","note[2]":"gas man/rent man etc","definition[6]":"a man who works for a particular company or organization","example[14]":"Was that the man from the PR agency?","signpost[3]":"particular kind of man","definition[7]":"a man who comes from a particular place, does a particular kind of work, or is connected with a particular organization, especially a university or company","example[15]":"I think she married a Belfast man.","example[16]":"I’ve been a military man all my life.","example[17]":"Even a Harvard man has a lot to learn about politics.","definition[8]":"a man who likes, or likes doing, a particular thing","example[18]":"I’m more of a jazz man myself.","example[19]":"Are you a betting man?","signpost[4]":"soldier","definition[9]":"a soldier or sailor who is under the authority of an officer","example[20]":"The captain ordered his men to fire.","signpost[5]":"husband","definition[10]":"a woman’s husband or boyfriend","example[21]":"She spent five years waiting for her man to come out of prison.","note[3]":"somebody’s man","signpost[6]":"servant","definition[11]":"a male servant","example[22]":"My man will drive you to the station.","definition[12]":"one of the pieces you use in a game such as chess","example[23]":"a young man","example[24]":"Sir Edmund Hillary was the first man to climb Mount Everest.","display[0]":"guy","example[25]":"She’d arranged to meet a guy in the bar.","example[26]":"Alex is a really nice bloke.","display[1]":"gentleman","definition[13]":"a man – used as a very polite way of talking about a man","example[27]":"an elderly gentleman","example[28]":"Please could you serve this gentleman?","display[2]":"boy","definition[14]":"a young male person, usually a child or a teenager","example[29]":"a teenage boy","display[3]":"lad","definition[15]":"a boy or young man","example[30]":"When I was a young lad, I wanted to join the army.","display[4]":"youth","definition[16]":"a teenage boy or young man – used especially in news reports to show disapproval","example[31]":"Gangs of youths roam the streets.","definition[17]":"a man – used especially by the police or in science and research contexts. The adjective male  is much more common than the noun","example[32]":"We are investigating the death of an unidentified male.","example[33]":"The condition is usually found only in males.","display[5]":"dude","definition[18]":"a man – a very informal use","example[34]":"You could tell there was something creepy going on with that dude.","heading[0]":"relating to men","definition[19]":"a male teacher, singer etc is a man. Male jobs are the kind of jobs that men typically do","example[35]":"Most science teachers are male.","example[36]":"a male nurse","example[37]":"We are trying to recruit more women to do traditionally male jobs such as engineering.","display[6]":"masculine","definition[20]":"considered to be more typical of a man than of a woman","example[38]":"He had a very masculine face.","example[39]":"masculine aggression","display[7]":"manly","definition[21]":"having the qualities that people expect and admire in a man, such as being brave and strong","example[40]":"He took off his shirt, revealing his manly chest.","example[41]":"It isn’t considered manly to cry.","example[42]":"In the portrait, the King looked manly and in control.","example[43]":"He was bronzed and athletic, with manly features and a steady gaze.","display[8]":"macho","definition[22]":"behaving in a way that is traditionally typical of men, for example by being strong and tough and not showing your feelings – used especially either humorously or to show disapproval","example[44]":"On the outside he may seem to be very macho but inside he’s very sensitive.","example[45]":"Stallone always plays macho men.","example[46]":"He’s far too macho to drink mineral water.","definition[23]":"used when speaking to an adult male, especially when you are excited, angry etc","example[47]":"Stop talking nonsense, man!","definition[24]":"used when speaking to someone, especially an adult male","example[48]":"You look great, man!","definition[25]":"to work at, use, or operate a system, piece of equipment etc","example[49]":"A team of volunteers are manning the phones.","example[50]":"the first manned spacecraft","definition[26]":"used to emphasize what you are saying, especially when you are angry, surprised, disappointed etc","example[51]":"Man, that was a lucky escape!","example[52]":"Oh, man! I can hear the bullets.","definition[27]":"if a person or group mans a vehicle, place, or system, they work there or operate the system","example[53]":"He has opened an office manned by two of his sons.","example[54]":"Can you man the phones  (=answer any telephone calls) for an hour?"}