{"word[0]":"revolt","definition[0]":"a refusal to accept someone’s authority or obey rules or laws","synonym[0]":"rebellion","example[0]":"The prime minister is now facing a revolt by members of his own party.","example[1]":"a revolt against authority","note[0]":"revolt against","example[2]":"a revolt over the proposed spending cuts","note[1]":"revolt over","example[3]":"French farmers are in revolt over cheap imports.","note[2]":"in revolt","definition[1]":"strong and often violent action by a lot of people against their ruler or government","example[4]":"the Polish revolt of 1863","example[5]":"Troops loyal to the president crushed the revolt.","note[3]":"put down/crush a revolt","example[6]":"a revolt against the central government","example[7]":"the successful revolt of the American colonies","note[4]":"revolt of","heading[0]":"– Meaning 2: strong and often violent action by a lot of people against their ruler or government","collocation[0]":"a revolt breaks out","example[8]":"In 1821 revolts broke out in Moldavia and Wallachia.","collocation[1]":"people rise in revolt","example[9]":"At a word from Gandhi, India would have risen in revolt.","collocation[2]":"lead a revolt","example[10]":"He led a revolt against Constantine and acclaimed Maximus as emperor.","collocation[3]":"suppress/crush/put down a revolt","example[11]":"The Russians speedily crushed the revolt.","form[0]":"ADJECTIVES/NOUN + revolt","collocation[4]":"a peasant revolt","example[12]":"This was the best-known peasant revolt in Soviet history.","collocation[5]":"a popular revolt","example[13]":"Opposition groups had called for a popular revolt against the president.","collocation[6]":"open revolt","example[14]":"She faced open revolt from her Cabinet colleagues.","collocation[7]":"armed revolt","example[15]":"Somalis living just across the Ethiopian border rose up in armed revolt.","definition[2]":"if people revolt, they take strong and often violent action against the government, usually with the aim of taking power away from them","synonym[1]":"rebel","example[16]":"It was feared that the army would revolt against the government.","definition[3]":"to refuse to accept someone’s authority or obey rules or laws","example[17]":"Some members of the government may revolt against this proposed legislation.","definition[4]":"if something revolts you, it is so unpleasant that it makes you feel sick and shocked","example[18]":"He was revolted by the smell.","explanation[0]":"Revolt is usually passive in this meaning"}