{"word[0]":"challenge","signpost[0]":"something difficult","definition[0]":"something that tests strength, skill, or ability, especially in a way that is interesting","example[0]":"Martins now faces the biggest challenge of his career.","note[0]":"face/take on/accept etc a challenge","example[1]":"a new and vibrant initiative to meet the challenge of the 21st century","note[1]":"meet a challenge/rise to a challenge","example[2]":"the intellectual challenge of postgraduate research","note[2]":"intellectual/physical challenge","example[3]":"The company is ready to meet the challenges of the next few years.","note[3]":"challenge of","example[4]":"I relish the challenge of rebuilding the club.","note[4]":"the challenge of doing something","signpost[1]":"question something","definition[1]":"when someone refuses to accept that someone or something is right and legal","example[5]":"The strike represented a serious challenge to the government.","note[5]":"pose/represent/present a challenge (to somebody)","example[6]":"They decided to mount a legal challenge to the decision.","note[6]":"mount/launch a challenge","example[7]":"a direct challenge to the Governor’s authority","note[7]":"challenge to","example[8]":"The president faces a strong challenge from nationalists.","note[8]":"challenge from","definition[2]":"when someone tries to win something or invites someone to try to beat them in a fight, competition etc","example[9]":"They threw down the challenge that he couldn’t wash 40 cars in one hour  (=invited him to try to do it).","example[10]":"The prime minister narrowly avoided a leadership challenge last year.","example[11]":"They are ready to mount a challenge for the championship.","note[9]":"challenge for","definition[3]":"a demand from someone such as a guard to stop and give proof of who you are, and an explanation of what you are doing","signpost[2]":"in law","definition[4]":"a statement made before the start of a court case that a juror is not acceptable","collocation[0]":"meet a challenge","example[12]":"Here are a few tips to help you meet the challenges of university life.","collocation[1]":"face a challenge","example[13]":"The company still faces some challenges.","collocation[2]":"accept a challenge","example[14]":"He was ready to accept new challenges.","collocation[3]":"take on a challenge","example[15]":"The new headteacher has taken on the challenge of improving the school.","collocation[4]":"present/pose a challenge","example[16]":"These changes pose a real challenge to farmers.","collocation[5]":"provide a challenge","example[17]":"Her new job provided a real challenge.","collocation[6]":"rise to a challenge","example[18]":"It was a difficult project but we rose to the challenge.","collocation[7]":"love/enjoy/relish a challenge","example[19]":"Children enjoy a challenge so the work should not be too easy.","collocation[8]":"a big/major/huge/tremendous challenge","example[20]":"Building the tunnel presented a major challenge to engineers.","collocation[9]":"a serious challenge","example[21]":"At the moment we are facing a serious environmental challenge.","collocation[10]":"a real challenge","example[22]":"On Monday, Sharapova faced her first real challenge of the tournament.","collocation[11]":"a formidable/daunting/tough challenge","example[23]":"How to deal with waste is a daunting challenge for the west.","collocation[12]":"the biggest challenge of something","example[24]":"This could be the biggest challenge of his career.","collocation[13]":"an intellectual/physical/technical etc challenge","example[25]":"I love the physical challenge of climbing.","definition[5]":"to refuse to accept that something is right, fair, or legal","example[26]":"a boy with a reputation for challenging the authority of his teachers","example[27]":"They went to the High Court to challenge the decision.","example[28]":"Viewpoints such as these are strongly challenged by environmentalists.","note[10]":"challenge a view/an idea/an assumption etc","example[29]":"I challenge Dr. Carver to deny his involvement!","note[11]":"challenge somebody to do something","definition[6]":"to invite someone to compete or fight against you, or to try to win something","example[30]":"After lunch, Carey challenged me to a game of tennis.","note[12]":"challenge somebody to something","example[31]":"Liverpool are challenging for the title  (=in a position where they could win).","definition[7]":"to test the skills or abilities of someone or something","synonym[0]":"stimulate","example[32]":"I’m really at my best when I’m challenged.","example[33]":"Every teacher ought to be challenging kids to think about current issues.","signpost[3]":"stop somebody","definition[8]":"to stop someone and demand proof of who they are, and an explanation of what they are doing","example[34]":"We were challenged by the security guard at the gate.","definition[9]":"to state before the start of a court case that a juror is not acceptable","definition[10]":"a careful check of the cash and shares etc held by the employees of a company, as part of an official check to discover if there has been any dishonesty","definition[11]":"something difficult that you feel determined to solve or achieve","example[35]":"Now the company’s challenge is to work out a plan to settle its $1.5 billion in debts.","example[36]":"Population growth is the most formidable challenge facing the nation.","definition[12]":"a refusal to accept that something is right and legal","example[37]":"The suit is a major challenge to Georgia’s election laws."}