{"word[0]":"outline","definition[0]":"the main ideas or facts about something, without the details","example[0]":"a research proposal outline","example[1]":"a broad outline of the committee’s plans","note[0]":"broad/rough/general outline","example[2]":"an outline of world history","note[1]":"outline of","example[3]":"A debt reduction scheme was agreed in outline  (=people agreed on its main points).","note[2]":"in outline","definition[1]":"a line around the edge of something which shows its shape","example[4]":"an outline map of Europe","example[5]":"The outlines of animals were cut into the rock.","example[6]":"figures drawn in outline","definition[2]":"a plan for a piece of writing in which each new idea or fact is separately written down","example[7]":"Always write an outline for your essays.","heading[0]":"– Meaning 1: the main ideas or facts about something, without the details","collocation[0]":"a broad/general outline","example[8]":"The report gives only a broad outline of the company's performance.","collocation[1]":"a brief outline","example[9]":"Each chapter begins with a brief outline of the topics covered in the chapter.","collocation[2]":"a basic outline","example[10]":"I remembered the basic outline of the story, but not how it ended.","collocation[3]":"a rough outline","example[11]":"Thompson gave me a rough outline of what had happened at the previous meeting.","collocation[4]":"the bare outline","example[12]":"The paragraph gives readers only the bare outline of Milton's life.","collocation[5]":"give somebody an outline","example[13]":"The leaflet gives you an outline of the Party's main policies.","collocation[6]":"provide an outline","example[14]":"The first chapter provides an outline of the theory of evolution.","heading[1]":"– Meaning 2: a line around the edge of something which shows its shape","collocation[7]":"a vague/dim outline","example[15]":"I could just make out a vague outline of a barn.","collocation[8]":"a blurred outline","example[16]":"Through the spaces between the bars he saw the blurred outline of the oil derrick high in the sky.","collocation[9]":"a clear/sharp outline","example[17]":"Peeling off the tape after the paint has dried leaves a clear outline to the shapes.","collocation[10]":"draw an outline","example[18]":"First, I draw out the outline of the leaf onto paper, and start adding areas of colour.","collocation[11]":"trace an outline","example[19]":"She traced the outline of his lips with her fingers.","form[0]":"outline + NOUN","collocation[12]":"an outline map","example[20]":"an outline map of the island","collocation[13]":"an outline drawing/sketch","example[21]":"Once I am happy with the outline sketch, I start painting.","definition[3]":"to describe something in a general way, giving the main points but not the details","example[22]":"The new president outlined plans to deal with crime, drugs, and education.","definition[4]":"to show the edge of something, or draw around its edge, so that its shape is clear","example[23]":"a map with our property outlined in red","example[24]":"trees outlined against the sky","explanation[0]":"Outline is usually passive in this meaning"}