{"word[0]":"board","definition[0]":"a flat wide piece of wood, plastic etc that you can use to show information","example[0]":"I’ll check the departure board for train times.","example[1]":"The plan of the new building is displayed on a board at the back of the room.","note[0]":"on a board","example[2]":"I’ve put a list of names up on the board.","signpost[0]":"for putting things on","definition[1]":"a flat piece of wood, plastic, card etc that you use for a particular purpose such as cutting things on, or for playing indoor games","example[3]":"Martha was chopping vegetables on a wooden board.","example[4]":"a chess board","definition[2]":"a group of people in a company or other organization who make the rules and important decisions","example[5]":"a board meeting","example[6]":"a board member","example[7]":"He gave up his seat on the board after 40 years.","note[1]":"sit on a board/have a seat on a board","example[8]":"The Board of Directors met yesterday.","note[2]":"board of","example[9]":"There was disagreement among the agency's board of governors.","explanation[0]":"Board is usually followed by a singular verb in this meaning","example[10]":"The board meets once a month","example[11]":"The board meet once a month","signpost[1]":"in building","definition[3]":"a long thin flat piece of wood used for making floors, walls, fences etc","example[12]":"We’ll have to take the boards up to check the wiring.","signpost[2]":"meals","definition[4]":"the meals that are provided for you when you pay to stay somewhere","example[13]":"In the nursing home she will have to pay for room and board.","example[14]":"The landlord provides board and lodging  (=meals and a place to stay).","signpost[3]":"in water sports","definition[5]":"a surfboard or sailboard","definition[6]":"a circuit board","heading[0]":"– Meaning 3: a group of people in a company or other organization who make the rules and important decisions","collocation[0]":"a board of directors/trustees","example[15]":"The board of directors met yesterday.","collocation[1]":"a board of governors","example[16]":"She sits on the board of governors.","collocation[2]":"the school board","example[17]":"The school board voted on the appointment.","collocation[3]":"the chairman of the board","example[18]":"James Clark has been named chairman of the board.","form[0]":"board + NOUN","example[19]":"Two board members resigned earlier this year.","example[20]":"An emergency board meeting will have to be held.","collocation[4]":"at board level","example[21]":"The policy was approved at board level.","collocation[5]":"be on the board","example[22]":"He's on the board of trustees.","collocation[6]":"be appointed to the board","example[23]":"They agreed that an independent chairman should be appointed to the board.","collocation[7]":"sit/serve on the board","example[24]":"She had served on the board of governors of the BBC.","collocation[8]":"have a seat on the board","example[25]":"He gave up his seat on the board after 40 years' service.","collocation[9]":"put something to the board","example[26]":"Their proposals were put to the board.","definition[7]":"used in the name of some organizations","example[27]":"the New York State Board of Elections","example[28]":"the British Boxing Board of Control","definition[8]":"to get on a bus, plane, train etc in order to travel somewhere","example[29]":"The couple boarded the train for New York.","example[30]":"Passengers were standing on the dock, waiting to board.","explanation[1]":"In everyday English, people usually say get on a bus, plane etc rather than board: ","example[31]":"When she heard the news, she got on the next plane for Chicago.","definition[9]":"to stay in a room in someone’s house that you pay for","example[32]":"Several students boarded with Mrs. Smith.","definition[10]":"to stay at a school at night as well as during the day","example[33]":"Dickie was sent away to school as soon as he was old enough to board.","definition[11]":"the group of people who have been elected to manage a company by those holding shares in the company","example[34]":"These accounts were approved by the Board of Directors on 15th July last year.","example[35]":"The executive committee effectively runs the company between monthly board meetings.","definition[12]":"a group of people who make important decisions or rules about how an institution operates and make sure that these rules are obeyed","example[36]":"The city’s licensing board voted yesterday for restrictions on opening hours.","example[37]":"the board of examiners","definition[13]":"the part of a computer containing the CHIPs that govern a particular function","example[38]":"A good sound board will really liven up your games and multimedia applications.","definition[14]":"the meals and the room provided for you when you stay or live somewhere","definition[15]":"on a ship, plane, or train","example[39]":"All the crew must be on board by four o'clock this afternoon.","definition[16]":"to listen to or accept a suggestion","example[40]":"He was not able to comment, but he took on board the strength of feeling against the proposal.","definition[17]":"to join an organization or agree with someone’s plans, ideas etc, or to make someone do this","example[41]":"The response was to look for a way to accommodate the Danish Government, to bring the Danes back on board.","definition[18]":"to get on a bus, plane, train, or ship","example[42]":"Flight TA134 for Boston is now boarding at Gate 16.","example[43]":"I boarded a bus and headed off out of Lesotho."}