{"word[0]":"satisfaction","definition[0]":"a feeling of happiness or pleasure because you have achieved something or got what you wanted","opposite[0]":"dissatisfaction","example[0]":"She got great satisfaction from helping people to learn.","example[1]":"‘I’ve passed all my exams, ’ he announced with satisfaction.","example[2]":"Finance officials expressed satisfaction with the recovery of the dollar.","note[0]":"satisfaction with","example[3]":"I didn't want to give him the satisfaction of knowing that I was jealous. ","note[1]":"the satisfaction of knowing/seeing/having etc","example[4]":"For her own satisfaction, she checked through the figures again.","note[2]":"for your own satisfaction","definition[1]":"when you get money or an apology from someone who has treated you badly or unfairly","example[5]":"I got no satisfaction from the customer complaints department.","definition[2]":"when someone gets something that they want, need, or have demanded","example[6]":"sexual satisfaction","example[7]":"the satisfaction of basic human needs","note[3]":"satisfaction of","form[0]":"ADJECTIVES/NOUN + satisfaction","collocation[0]":"great/deep satisfaction","example[8]":"It was hard work, but it gave her great satisfaction.","collocation[1]":"immense/enormous satisfaction","example[9]":"The victory gave him immense satisfaction.","collocation[2]":"real satisfaction","example[10]":"There is real satisfaction in helping other people to overcome their problems.","collocation[3]":"complete satisfaction","example[11]":"They expressed complete satisfaction with the agreement.","collocation[4]":"personal satisfaction","example[12]":"The job offered William little personal satisfaction.","collocation[5]":"quiet satisfaction","example[13]":"He announced with quiet satisfaction that they had achieved their target.","collocation[6]":"grim satisfaction","example[14]":"‘That’s exactly what I expected, ’ he said with grim satisfaction.","collocation[7]":"job satisfaction","example[15]":"In general, job satisfaction among farm workers is extraordinarily high.","collocation[8]":"customer/patient/voter etc satisfaction","example[16]":"Staff work as a team to achieve customer satisfaction.","collocation[9]":"get satisfaction from something","example[17]":"I get a lot of satisfaction from teaching.","example[18]":"He derived great satisfaction from knowing his son had followed in his footsteps.","collocation[10]":"find satisfaction in something","example[19]":"They found satisfaction in helping others achieve their goals.","collocation[11]":"take satisfaction in/from something","example[20]":"He took great satisfaction in doing his job well.","collocation[12]":"have the satisfaction of doing something","example[21]":"They have the satisfaction of knowing that the company needs them.","collocation[13]":"something gives/brings somebody satisfaction","example[22]":"To have won both awards in the same year gives us great satisfaction.","example[23]":"Yet children also bring immense rewards and satisfaction.","collocation[14]":"feel satisfaction","example[24]":"As she looked at what she had created, she felt a quiet satisfaction.","collocation[15]":"express satisfaction","example[25]":"Those taking part expressed their satisfaction with the outcome of the talks.","collocation[16]":"a sense/feeling of satisfaction","example[26]":"Performing such a difficult piece gave her a deep sense of satisfaction.","collocation[17]":"a smile/sigh/look of satisfaction","example[27]":"He allowed himself a little smile of satisfaction.","collocation[18]":"the level of satisfaction","example[28]":"Research shows a high level of satisfaction with the system.","collocation[19]":"a source of satisfaction","example[29]":"It is a source of deep satisfaction to him that he was eventually proved to be right.","definition[3]":"a feeling of happiness or pleasure, especially because you have achieved something good or useful","example[30]":"Most teachers take great pride and satisfaction in their work.","display[0]":"pride","definition[4]":"a feeling of pleasure and satisfaction that you get when you or someone connected with you has achieved something good","example[31]":"Her father’s pride in her accomplishments was clear.","example[32]":"I was blushing with pride because I had been chosen to be on the team.","display[1]":"contentment","definition[5]":"the feeling of being happy and satisfied because you have what you want or need. Contentment is rather a formal use","example[33]":"Only when you truly know yourself can you find contentment.","example[34]":"He sat back with a look of deep contentment on his face.","display[2]":"fulfilment","definition[6]":"a feeling of being satisfied and happy with your life. Fulfilment is rather a formal use","example[35]":"Some women find fulfillment in being a mother, but this is not true for all women.","definition[7]":"the feeling that you are pleased with something you have done, bought, achieved etc","example[36]":"Our staff work as a team to achieve customer satisfaction.","example[37]":"Financial rewards are important, but so is job satisfaction.","definition[8]":"the act of providing what is needed, demanded, or desired","example[38]":"A society should be based on the satisfaction of the needs of everyone."}