{"comparative[0]":"simpler","superlative[0]":"simplest","signpost[0]":"easy","definition[0]":"not difficult or complicated to do or understand","example[0]":"a simple but effective solution to the problem","example[1]":"There is no simple answer to this question.","example[2]":"I’m sure there’s a perfectly simple explanation.","example[3]":"We want to keep the costumes as simple as possible.","example[4]":"We can’t pay people any more money until the company is more profitable. I’m afraid it’s as simple as that.","example[5]":"Modern cameras are very simple to use.","note[0]":"simple to use/make/operate etc","example[6]":"There are relatively simple exercises to build strength.","note[1]":"relatively/fairly/quite etc simple","signpost[1]":"plain","definition[1]":"made in a plain style, without a lot of decoration or unnecessary things added","example[7]":"She dressed with simple elegance.","example[8]":"simple but delicious food","example[9]":"a building constructed in a simple classic style","definition[2]":"used to emphasize that only one thing is involved","example[10]":"Completing the race is not just a simple matter of physical fitness.","example[11]":"The simple fact is, he’s not very good at his job.","example[12]":"Their motive was greed, pure and simple.","signpost[2]":"not having many parts","definition[3]":"made or built of only a few parts, and not having a complicated structure","example[13]":"It’s a very simple machine.","example[14]":"They evolved from simple life forms that existed millions of years ago.","definition[4]":"honest and ordinary and not special in any way","example[15]":"Joe was just a simple farmer.","definition[5]":"simple tenses are not formed with an auxiliary such as ‘have’ or ‘be’","definition[6]":"someone who is simple is not very intelligent","example[16]":"I’m afraid Luke’s a bit simple.","collocation[0]":"very/extremely/incredibly simple","example[17]":"I came up with a very simple answer to this problem.","collocation[1]":"relatively/fairly/quite simple","example[18]":"The rules are quite simple.","collocation[2]":"deceptively simple","example[19]":"It’s a deceptively simple idea, but it’s very difficult to put into practice.","collocation[3]":"perfectly simple","example[20]":"Well? It’s a perfectly simple question.","example[21]":"The machine is very simple to use.","collocation[4]":"simple but effective","example[22]":"Any child’s behaviour can be improved by this simple but effective technique.","collocation[5]":"keep something simple","example[23]":"Keep your explanation as simple as possible."}