{"definition[0]":"a picture obtained by using a camera and film that is sensitive to light","example[0]":"a colour photograph","example[1]":"a black and white photograph","example[2]":"He took a photograph of the hotel.","example[3]":"Tim was looking through an old photograph album (=book in which you put photographs).","example[4]":"Did you see Leo’s photograph  (=a photograph of Leo) in the newspaper?","example[5]":"I wish I had a photograph of Thomas.","note[0]":"photograph of","collocation[0]":"take a photograph","example[6]":"He wanted to take a photograph of me.","collocation[1]":"get a photograph","example[7]":"I got some brilliant photographs of the desert.","form[0]":"ADJECTIVES/NOUN + photograph","example[8]":"The book is fully illustrated with colour photographs.","collocation[2]":"a black-and-white photograph","collocation[3]":"a digital photograph","collocation[4]":"a framed photograph","example[9]":"On the desk was a framed photograph of a woman.","collocation[5]":"a signed photograph","example[10]":"He keeps a signed photograph of Bill Clinton in his office.","collocation[6]":"a wedding photograph","example[11]":"Your wedding photographs will keep the memories of the big day alive for you.","collocation[7]":"an aerial photograph","example[12]":"Aerial photographs can be used to locate archaeological sites.","collocation[8]":"faded","example[13]":"All her life she kept a faded photograph of him in his army uniform.","collocation[9]":"blurred","example[14]":"He was shown a blurred photograph, taken from a moving car.","collocation[10]":"grainy","example[15]":"I stared at the grainy newspaper photograph, searching for my mother.","collocation[11]":"sepia","example[16]":"an 1854 sepia photograph of Jonathan Pickering, the company founder","form[1]":"photograph + NOUN","collocation[12]":"a photograph album","example[17]":"Mama kept a photograph album full of pictures of her family.","definition[1]":"a picture taken using a camera","example[18]":"Visitors are not allowed to take photographs inside the museum.","example[19]":"our wedding photographs","display[0]":"photo","definition[2]":"a photograph","example[20]":"a way of displaying your digital photos","example[21]":"Do you want me to take your photo?","definition[3]":"a photograph of someone or something","example[22]":"I saw her picture in the paper the other day.","example[23]":"This is a really good picture of Sarah.","example[24]":"Can I take your picture?","display[1]":"snap","definition[4]":"a photograph that you take quickly and without thinking carefully about how it will look, for example when you are on holiday","example[25]":"Patrick showed me his holiday snaps.","example[26]":"She showed me a snapshot of her three children.","display[2]":"shot","definition[5]":"a photograph – used especially by people who often take photographs","example[27]":"I got some great shots of Mount Fuji.","example[28]":"It's a lovely shot.","display[3]":"print","definition[6]":"a photograph that has been printed on photographic paper","example[29]":"a set of 4 by 6 inch prints","explanation[0]":"In everyday English, people usually say photo or picture rather than photograph:","example[30]":"This is my dad in this photo.","example[31]":"Who took the picture?","definition[7]":"to take a photograph of someone or something","example[32]":"Kate agreed to let me photograph her.","example[33]":"He stood by the tree to be photographed.","explanation[1]":"In everyday English, people usually say take a photo or take a picture of someone or something rather than photograph someone or something:","example[34]":"She agreed to let me take her photo.","example[35]":"He stood there waiting to have his picture taken."}