{"word[0]":"easy","comparative[0]":"easier","superlative[0]":"easiest","signpost[0]":"not difficult","definition[0]":"not difficult to do, and not needing much effort","note[0]":"as easy as pie/ABC/falling off a log (=very easy)","example[0]":"The test was easy.","example[1]":"Finishing the task will not be easy.","example[2]":"There must be an easier way to do that.","example[3]":"Having you here does make things a lot easier  for me.","example[4]":"The station is within easy reach of  (=close to) the town centre.","example[5]":"The park is within easy walking distance (=close enough to walk to).","example[6]":"The software makes it easier to download music.","note[1]":"make it easier (to do something)","example[7]":"It’s a great car, and very easy to drive.","note[2]":"easy to do something","example[8]":"instructions that are easy to follow","example[9]":"It would have been easy for the team to lose the game.","signpost[1]":"comfortable","definition[1]":"comfortable or relaxed, and without problems","example[10]":"On the whole, Dad has had an easy life.","example[11]":"You can have an easy time of it now that the kids have all left home.","example[12]":"Why don’t we make life easy for ourselves and finish it tomorrow?","example[13]":"She had a nice easy day at home.","note[3]":"easy day/week etc","signpost[2]":"not worried","definition[2]":"not feeling worried or anxious","opposite[0]":"uneasy","example[14]":"We talk more openly when we feel easy and relaxed.","example[15]":"I can leave the children with my mother with an easy mind.","signpost[3]":"friendly","definition[3]":"friendly and pleasant with other people","example[16]":"She is gentle and easy to be with.","signpost[4]":"easily attacked","definition[4]":"able to be hunted or attacked without difficulty","example[17]":"The soldiers on the streets are an easy target for terrorists.","example[18]":"Tourists are easy prey for thieves.","definition[5]":"someone, especially a woman, who is easy has a lot of sexual partners","example[19]":"an easy task","example[20]":"The house was easy to find.","definition[6]":"easy and not complicated – used about things such as instructions and explanations, or about machines and systems","example[21]":"The system is relatively simple to operate.","example[22]":"a simple recipe for chocolate cake","display[0]":"straightforward","definition[7]":"easy to understand or do, and unlikely to cause you any problems","example[23]":"a straightforward explanation","example[24]":"The calculation is fairly straightforward.","display[1]":"user-friendly","definition[8]":"easy to use – used especially about computers or written information about how to do something","example[25]":"Their website is very user-friendly.","example[26]":"a user-friendly guide to owning a dog","display[2]":"undemanding","definition[9]":"easy because it does not take a lot of effort","example[27]":"It was an undemanding role for someone of his experience.","display[3]":"cushy","definition[10]":"a cushy job is easy to do and needs very little effort – often used when you are envious of the person who has it","example[28]":"It’s a pretty cushy job – all she has to do is drive a nice car around.","example[29]":"a cushy number (=a very easy job)","display[4]":"mindless","definition[11]":"so easy that you can do it without thinking – used especially when it makes you feel bored","example[30]":"mindless tasks","display[5]":"painless","definition[12]":"without any difficulties or problems – used especially when you expected something to be much worse","example[31]":"Finding the carhire place at the airport was relatively painless.","example[32]":"Thankfully, there's a wide selection of search tools to make the task relatively painless.","display[6]":"be plain sailing","definition[13]":"to be easy and with no problems that you have to deal with","example[33]":"Things should be plain sailing from now on.","heading[0]":"informal phrases meaning very easy","display[7]":"be a piece of cake","definition[14]":"to be very easy to do, especially compared to doing something else","example[34]":"This test was a piece of cake compared to the last one.","display[8]":"be child’s play","definition[15]":"to be surprisingly easy, or much easier than something else which is very difficult or dangerous","example[35]":"Getting people’s credit card details is child’s play when you know how to do it.","example[36]":"Climbing in England is child’s play compared to climbing in the Himalayas.","display[9]":"be a breeze","definition[16]":"to be very easy to do","example[37]":"The software is a doddle to use.","example[38]":"The check-in process was a breeze.","display[10]":"it’s not rocket science","definition[17]":"used when saying that something is very easy to do or understand, and you do not need to be intelligent to do it","example[39]":"Making your PC run faster isn’t exactly rocket science.","definition[18]":"if you buy something on easy terms, you pay for it with several small payments, rather than paying the whole amount at once","example[40]":"Farmers can obtain credit on very easy terms from government sources.","definition[19]":"when prices are easier, they are slightly lower","example[41]":"Gold was slightly easier yesterday, ending in London at $362.50 an ounce.","definition[20]":"having all the money you need","example[42]":"The $2 million he has to invest will produce enough money to keep him on easy street for the rest of his life."}