{"word[0]":"surface","signpost[0]":"water/land","definition[0]":"the top layer of an area of water or land","example[0]":"Nearly 10% of the Earth’s surface is covered by ice.","example[1]":"Gas bubbles in any liquid tend to rise to the surface.","example[2]":"Dead leaves floated on the surface of the water.","note[0]":"surface of","example[3]":"The tunnel was some 300 feet below the surface.","note[1]":"beneath/under/below the surface","signpost[1]":"outside/top layer","definition[1]":"the outside or top layer of something","example[4]":"The road surfaces tend to be worse in the towns than in the country.","example[5]":"a frying pan with a non-stick surface","example[6]":"the surface of the vase","example[7]":"mold growing on the cheese’s surface","note[2]":"on something’s surface","signpost[2]":"for working on","definition[2]":"a flat area on the top of a cupboard, table, desk etc, that you use for cooking or working on","example[8]":"Work on a clean, flat surface.","example[9]":"Keep kitchen surfaces clean and tidy.","note[3]":"work/kitchen surface","signpost[3]":"side of an object","definition[3]":"one of the sides of an object","example[10]":"How many surfaces does a cube have?","heading[0]":"– Meaning 2: the outside or top layer of something","collocation[0]":"the upper/top surface","example[11]":"The upper surface of the leaf is dull green.","collocation[1]":"the outer/inner surface","example[12]":"The outer surface of the shell is ridged.","example[13]":"Marble provides a cool smooth surface.","example[14]":"I reached out and touched the rough surface of the stone wall.","collocation[2]":"textured","example[15]":"Many floor tiles have textured surfaces to make them less slippery underfoot.","example[16]":"The path has a hard surface suitable for wheelchairs and pushchairs.","collocation[3]":"shiny","example[17]":"This type of cloth has a shiny surface on one side.","collocation[4]":"polished","example[18]":"I didn't want to spill anything on the polished surface of the table.","collocation[5]":"slippery","example[19]":"The sign read: ‘Beware: slippery surface.’","collocation[6]":"flat","example[20]":"Put the compass on a flat surface.","definition[4]":"if information, feelings, or problems surface, they become known about or easy to notice","example[21]":"the jealousy that had surfaced in her","example[22]":"Rumors about the killings have begun to surface in the press.","note[4]":"surface in","definition[5]":"if someone or something surfaces, they suddenly appear somewhere, especially after being gone or hidden for a long time","synonym[0]":"pop up","example[23]":"Last year Toole surfaced again in Cuba.","definition[6]":"to rise to the surface of water","example[24]":"divers surfacing near the boat","definition[7]":"to get out of bed, especially late","example[25]":"Joe never surfaces before midday on Sunday.","definition[8]":"to put a surface on a road","definition[9]":"relating to the part of the army, navy etc that travels by land or on the sea, rather than by air or under the sea","example[26]":"the Navy’s surface forces","definition[10]":"appearing to be true or real, but not representing what someone really feels or what something is really like","synonym[1]":"superficial","example[27]":"Beneath the surface calm, she felt very insecure."}