{"definition[0]":"to express your disapproval of someone or something, or to talk about their faults","opposite[0]":"praise","example[0]":"Ron does nothing but criticize and complain all the time.","example[1]":"The new law has been widely criticized.","example[2]":"The decision has been strongly criticized by teachers.","note[0]":"be strongly/sharply/heavily criticized","example[3]":"He has been criticized for incompetence.","note[1]":"criticize somebody/something for (doing) something","example[4]":"Doctors have criticized the government for failing to invest enough in the health service.","example[5]":"The report has been criticized as inaccurate and incomplete.","note[2]":"criticize somebody/something as something","definition[1]":"to express judgments about the good and bad qualities of something","example[6]":"We look at each other’s work and criticize it.","collocation[0]":"strongly/severely/heavily criticize somebody/something","example[7]":"Public transport has been severely criticized in the report.","collocation[1]":"sharply/harshly/fiercely criticize somebody/something","example[8]":"His attorney sharply criticized the police yesterday.","collocation[2]":"be widely criticized","example[9]":"The proposal was widely criticized.","collocation[3]":"publicly criticize somebody/something","example[10]":"The head coach publicly criticized the referee’s decision.","collocation[4]":"roundly criticize somebody/something","example[11]":"Their research has been roundly criticized.","collocation[5]":"openly criticize somebody/something","example[12]":"They openly criticized the government’s handling of the crisis.","collocation[6]":"repeatedly/frequently/constantly criticize","example[13]":"The fashion industry is frequently criticized for presenting extremely thin models as beautiful.","collocation[7]":"be quick to criticize somebody/something","example[14]":"Some groups were quick to criticize the president.","collocation[8]":"criticize somebody/something on the grounds that","example[15]":"The survey was criticized on the grounds that the sample was too small.","definition[2]":"to say what you think is bad about someone or something","example[16]":"He was criticized for not being tough enough with the terrorists.","example[17]":"Stop criticizing my friends!","example[18]":"It’s easy to criticize, but not so easy to offer helpful solutions.","display[0]":"be critical of somebody/something","definition[3]":"to criticize someone or something, especially by giving detailed reasons for this","example[19]":"The report was highly critical of the police investigation.","example[20]":"The press have been critical of his leadership style.","definition[4]":"to criticize someone or something very strongly, especially publicly in the newspapers, on TV etc","example[21]":"They attacked the government’s decision to undertake nuclear weapons tests.","display[1]":"lay into somebody/tear into somebody","definition[5]":"to criticize someone very strongly for something they have done, especially by shouting at them","example[22]":"He started laying into one of his staff for being late.","display[2]":"tear somebody/something to shreds","definition[6]":"to find a lot of things wrong with someone’s arguments or ideas and make them seem very weak","example[23]":"The prosecution will tear him to shreds.","display[3]":"pan","definition[7]":"to strongly criticize a film, play etc in the newspapers, on TV etc","example[24]":"Her first movie was panned by the critics.","display[4]":"be pilloried","definition[8]":"to be strongly criticized by a lot of people in the newspapers, on TV etc","example[25]":"He was pilloried in the right-wing press.","display[5]":"condemn","definition[9]":"to say very strongly in public that you do not approve of something or someone, especially because you think they are morally wrong","example[26]":"Politicians were quick to condemn the bombing.","heading[0]":"to criticize unfairly","display[6]":"find fault with somebody/something","definition[10]":"to criticize things that you think are wrong with something, especially small and unimportant things","example[27]":"He’s quick to find fault with other people’s work.","display[7]":"pick holes in something","definition[11]":"to criticize something by finding many small faults in it, in a way that seems unreasonable and unfair","example[28]":"Why are you always picking holes in my work?","display[8]":"knock","definition[12]":"to criticize someone or something, in an unfair and unreasonable way","example[29]":"I know it’s fashionable to knock Tony Blair, but I think he did a good job.","display[9]":"slag off","definition[13]":"to criticize someone in an unfair and unpleasant way","example[30]":"He’s always slagging you off behind your back."}