{"word[0]":"transfer","signpost[0]":"move to different place etc","definition[0]":"to move from one place, school, job etc to another, or to make someone do this, especially within the same organization","example[0]":"Swod transferred from MI6 to the Security Service.","note[0]":"transfer (from something) to something","example[1]":"They’re transferring him to a special unit at Great Ormond Street Hospital.","note[1]":"transfer somebody (from something) to something","example[2]":"You’ll be transferred to the Birmingham office.","signpost[1]":"put something in different place","definition[1]":"to move from one place to another, or to move something from one place to another","example[3]":"The exhibition transfers to York City Art Gallery on 23rd January.","example[4]":"Transfer the meat to warm plates.","note[2]":"transfer something (from something) to something","signpost[2]":"sports person","definition[2]":"to sell a sports player to another team","example[5]":"He was transferred for a fee of £8 million.","definition[3]":"to move money from one account or institution to another","example[6]":"I’d like to transfer $500 to my checking account.","signpost[3]":"skill/idea/quality","definition[4]":"if a skill, idea, or quality transfers from one situation to another, or if you transfer it, it can be used in the new situation","example[7]":"Ideas that work well in one school often don’t transfer well to another.","definition[5]":"to connect the call of someone who has telephoned you to someone else’s telephone so that that person can speak to them","example[8]":"Hold on one moment while I transfer your call.","signpost[4]":"property","definition[6]":"to officially give property or land to someone else","definition[7]":"to change from one bus, plane etc to another while you are travelling, or arrange for someone to do this","example[9]":"You will be met on arrival at the airport and transferred to your hotel.","signpost[5]":"information/music","definition[8]":"to copy recorded information, music etc from one system to another","example[10]":"Transfer the files onto a memory stick.","signpost[6]":"disease","definition[9]":"if a disease is transferred from one person or animal to another, the second person or animal begins to have the disease","example[11]":"It is unlikely that the disease will be transferred from animals to humans.","note[3]":"transfer something (from somebody/something) to somebody/something","definition[10]":"the process by which someone or something moves or is moved from one place, job etc to another","example[12]":"electronic data transfer","example[13]":"the transfer of assets within a group of companies","note[4]":"transfer of","example[14]":"Penny’s applied for a transfer to head office.","note[5]":"transfer to","definition[11]":"someone or something that has been moved in this way","definition[12]":"the act of changing from one bus, aircraft etc to another while travelling","example[15]":"Getting there often means a couple of transfers on a bus line.","definition[13]":"a drawing, pattern etc that can be stuck or printed onto a surface","definition[14]":"a ticket that allows a passenger to change from one bus, train etc to another without paying more money","definition[15]":"to move money or investments from one account or institution to another","example[16]":"Customers cantransfer money instantly, using the bank’s automated machines.","example[17]":"One reason investors transfer annuities is to get a higher level of benefit.","definition[16]":"to move something from one place or position to another","example[18]":"Production from both units will be transferred to other centres.","example[19]":"Brazil is in the process of transferring its state-owned mills to private ownership.","definition[17]":"to move from one place or job to another, or to arrange for someone to do this","example[20]":"The company transferred hundreds of jobs to Mexico.","example[21]":"Ms. Martin transferred from Houston to her current job in Los Angeles after being promised promotion.","definition[18]":"to pass a telephone call from one telephone to another, or computer files from one computer to another","example[22]":"Hold on, let me transfer you.","example[23]":"The technology will be very useful to companies that routinelytransfer documents electronically.","definition[19]":"the process by which someone or something is moved from one place or position to another","example[24]":"The cuts will be achieved through a combination of layoffs, retirements andjob transfers.","definition[20]":"a change in the ownership of money, property etc from one person or organization to another, or the arrangements for doing this","example[25]":"The legal environment forshare transfers in Russia is still unclear.","example[26]":"The Land Registry records everyproperty transfer."}