{"word[0]":"forecast","definition[0]":"a description of what is likely to happen in the future, based on the information that you have now","example[0]":"The weather forecast is good for tomorrow.","example[1]":"the company’s annual sales forecast","note[0]":"profit/sales/growth forecast","form[0]":"ADJECTIVES/NOUN + forecast","collocation[0]":"a weather forecast","example[2]":"The weather forecast for the weekend is fine and dry.","collocation[1]":"a shipping forecast","example[3]":"According to the shipping forecast, strong winds can be expected later today.","collocation[2]":"a sales forecast","example[4]":"The gloomy sales forecast sparked rumours that the company would be making job cuts.","collocation[3]":"a profit forecast","example[5]":"The company has cut its profit forecast by £18m to £570m.","collocation[4]":"a growth forecast","example[6]":"The official growth forecasts for the economy are promising.","collocation[5]":"an economic forecast","example[7]":"The Bank of England revised its economic forecast in the wake of the figures.","collocation[6]":"a detailed forecast","example[8]":"A detailed forecast of the industry’s prospects has just been published.","collocation[7]":"optimistic","example[9]":"In his speech, the president gave an optimistic forecast for the economy.","collocation[8]":"pessimistic/gloomy","example[10]":"Scientists have produced a gloomy forecast on the effects of global warming.","collocation[9]":"make a forecast","example[11]":"It is too early to make a forecast on what will happen.","collocation[10]":"give a forecast","example[12]":"Economists gave an upbeat forecast for the world economy.","collocation[11]":"provide a forecast","example[13]":"Analysts usually provide growth forecasts for no more than two years ahead.","collocation[12]":"revise a forecast","example[14]":"The company has revised its sales forecast.","definition[1]":"to make a statement saying what is likely to happen in the future, based on the information that you have now","synonym[0]":"predict","example[15]":"Rain was forecast for the weekend.","example[16]":"The Federal Reserve Bank forecasts that the economy will grow by 2% this year.","note[1]":"forecast (that)","definition[2]":"a description of what is likely to happen in the future, based on information that is available now","example[17]":"The figures for 2001 are forecasts, the others are actuals.","example[18]":"a gloomy sales forecast","example[19]":"a cash-flow forecast","example[20]":"Economic forecasts are widely used by policy makers.","example[21]":"It is too early to make forecasts about demand.","example[22]":"He has cut his full-year profit forecast from £235 million to £220 million.","example[23]":"an inflation forecast of 3.5%","note[2]":"forecast of","example[24]":"The IMF had reduced its forecasts of economic growth among the world’s largest industrialized nations.","definition[3]":"to make a statement saying what is likely to happen in the future, based on information that is available now","example[25]":"Turnover is forecast to grow 6.7% this year.","example[26]":"This year we forecast growth of 30%.","example[27]":"The bank’s chief economist has forecast that interest rates will fall within two months.","note[3]":"forecast that","example[28]":"GDP growth was forecast at 1%.","note[4]":"forecast something at something"}