{"word[0]":"tab","signpost[0]":"in typing","definition[0]":"a tab key","definition[1]":"a set position in a line of writing that you get to by pressing the tab key","signpost[1]":"money that you owe","definition[2]":"an amount of money that you owe, or a record of an amount of money that you owe","example[0]":"The tab for the campaign was nearly $500 million.","example[1]":"I’ll put it on your tab and you can pay tomorrow.","example[2]":"He ran up a $4,000 tab in long-distance calls.","signpost[2]":"to open","definition[3]":"a small piece of metal that you pull to open a can of drink","definition[4]":"a small piece of metal, plastic, or paper that you pull to open something","signpost[3]":"small piece of paper/plastic etc","definition[5]":"a small piece of paper, cloth, plastic etc that sticks out from the edge of something, so that you can find it more easily","example[3]":"an index tab labeled ‘Expenses’","definition[6]":"a small piece of sticky plastic with a date on it that you put on your car’s license plate in the US to show that the car is legally allowed on the road","definition[7]":"a form of the illegal drug LSD or ecstasy","example[4]":"a tab of acid","signpost[4]":"cigarette","definition[8]":"a cigarette","signpost[5]":"Internet","definition[9]":"one of a number of web pages you have open at the same time","example[5]":"Do you want to close all tabs or the current tab?","definition[10]":"to press the tab key on a computer or typewriter","definition[11]":"a small piece of paper or cloth that is fixed to the edge of something, usually giving information about it","definition[12]":"a bill for something, especially one that has gradually increased over time","example[6]":"One out of three credit card holders pays their credit card tab in full every month.","example[7]":"the estimated government tab for resolving the S&L crisis","definition[13]":"a system used in some bars and restaurants in which they keep a record of what you have bought and you pay for it later","example[8]":"Can you put these drinks on my tab?","definition[14]":"to pay for something, especially when it is not your responsibility to pay","example[9]":"Taxpayers are picking up the tab for the government’s mistakes.","definition[15]":"a button on a computer keyboard that you press to move forward to a particular place on a line of text"}