{"word[0]":"load","signpost[0]":"amount of something","definition[0]":"a large quantity of something that is carried by a vehicle, person etc","example[0]":"The lorry had shed its load (=the load had fallen off).","example[1]":"The plane was carrying a full load of fuel.","example[2]":"a load of wood","note[0]":"load of","definition[1]":"the amount of work that a person or machine has to do","example[3]":"The computer couldn’t handle the load and crashed.","example[4]":"My work load has doubled since Henry left.","example[5]":"They hired more staff in order to spread the load.","example[6]":"Hans has a heavy teaching load this semester.","note[1]":"a light/heavy load","definition[2]":"a problem or worry that is difficult to deal with","example[7]":"When someone is depressed, the extra load of having financial problems can make the situation worse.","example[8]":"Knowing he was safe was a load off my mind (=I felt less worried).","example[9]":"Coping with ill health was a heavy load to bear.","signpost[1]":"washing","definition[3]":"a quantity of clothes that are washed together in a washing machine","example[10]":"I’ve already done three loads of laundry this morning.","definition[4]":"the amount of weight that something is supporting","example[11]":"a load-bearing wall","example[12]":"It increased the load on the wheels.","definition[5]":"an amount of electrical power that is being produced","definition[6]":"to put a large quantity of something into a vehicle or container","opposite[0]":"unload","example[13]":"Have you finished loading up?","example[14]":"It took an hour to load the van.","example[15]":"Will you help me load the dishwasher?","example[16]":"Emma loaded all the groceries into the car.","note[2]":"load something into/onto something","example[17]":"He loaded the cups onto a tray.","example[18]":"She loaded up the car with camping gear.","note[3]":"load something with something","definition[7]":"to put a necessary part into something in order to make it work, for example bullets into a gun or film into a camera","example[19]":"Did you load it with 200 or 400 film?","example[20]":"Can you load the CD into the player, please?","note[4]":"load something into something","definition[8]":"to put a program into a computer","example[21]":"The program takes a while to load.","example[22]":"To load the file, press the ‘return’ key.","definition[9]":"if a ship, aircraft etc loads, goods are put onto it","example[23]":"The first ship to load at the new port was the ‘Secil Angola’.","example[24]":"The boat called at Lerwick to load up with fresh vegetables.","note[5]":"load with","definition[10]":"an amount of goods or people transported on a road vehicle, train, or plane","example[25]":"Rail cars are used to move the bigger loads.","example[26]":"The lorry returned with a load of Spanish apricots.","example[27]":"The plane was carrying a full load of passengers.","example[28]":"a lorry-load of gravel","definition[11]":"the amount of something that a person or organization has to do","example[29]":"The firm’s computers are struggling to cope with the increased load.","example[30]":"The network has to deal with a heavy load of telephone traffic.","definition[12]":"an amount of money charged for managing an INVESTMENT FUND","example[31]":"Because of the 5% load, only $950 of the $1,000 actually gets invested in your name.","example[32]":"The new fund carries a front-end load (=an amount paid when the fund is first started) of 5.5%","example[33]":"a no-load fund","definition[13]":"to put goods into a road vehicle, train, boat, or plane to be transported","example[34]":"The tankers set off as soon as they have been loaded.","definition[14]":"to copy a computer program or file onto a computer","example[35]":"The new software can be loaded easily onto most machines.","note[6]":"load something onto something","definition[15]":"to include most or all of the charges at a particular period during the time that an insurance policy or INVESTMENT FUND is in use","example[36]":"A lot of personal pension funds are front-end loaded (=make most of their charges when the fund is first started)."}