{"word[0]":"material","definition[0]":"cloth used for making clothes, curtains etc","synonym[0]":"fabric","example[0]":"curtain material","example[1]":"scraps of material","example[2]":"a cape made of a soft material","definition[1]":"a solid substance such as wood, plastic, or metal","example[3]":"materials like wood or stone","example[4]":"harmful radioactive material","example[5]":"a paper company which imports raw materials (=substances which have not been treated) from North America.","example[6]":"recycled material","example[7]":"Animals depend on plant material for food.","note[0]":"organic/plant material","definition[2]":"the things that are used for making or doing something","example[8]":"a supply of building materials","example[9]":"artists’ materials","example[10]":"Videos often make good teaching material.","note[1]":"reading/writing etc material(s)","definition[3]":"information or ideas used in books, films etc","example[11]":"His act contains a lot of new material.","example[12]":"the raw material (=information that has not been carefully examined) for an article","example[13]":"Anita is collecting material for a novel.","note[2]":"material for","heading[0]":"for making clothes etc","example[14]":"She bought some pretty dress material.","example[15]":"Man-made fabrics such as polyester are easy to wash and iron.","example[16]":"furnishing fabrics","definition[4]":"woven material, especially material made from natural substances such as cotton and wool, which has not yet been made into any other products","example[17]":"The main trade was the production of woollen cloth.","display[0]":"textiles","definition[5]":"a general word for all types of cloth – used especially when talking about the business of producing and selling them","example[18]":"Textiles are one of Mexico’s main exports.","example[19]":"the textile industry","heading[1]":"a solid or liquid substance","definition[6]":"a substance, especially one that can be used for making things","example[20]":"building materials","example[21]":"The island has to import oil and other raw materials  (=materials used for making things).","example[22]":"radioactive material","display[1]":"substance","definition[7]":"a type of material such as a chemical or a mineral","example[23]":"The green colour of the leaf is due to a substance called chlorophyll.","example[24]":"Dioxin is one of the most toxic substances known to man.","display[2]":"matter","definition[8]":"a type of substance – used especially in the following phrases","example[25]":"waste matter from the body","example[26]":"It is important to add plenty of organic matter to the soil.","example[27]":"People throw away lots of vegetable matter.","display[3]":"stuff","definition[9]":"a substance – used especially when you do not know exactly what it is","example[28]":"What’s that sticky stuff on the floor?","definition[10]":"relating to your money, possessions, living conditions etc, rather than the needs of your mind or soul","opposite[0]":"spiritual","example[29]":"The spiritual life is more important than material possessions.","note[3]":"material goods/possessions/wealth etc","example[30]":"a society that places high importance on material rewards","definition[11]":"relating to the real world and physical objects, rather than religious or spiritual things","example[31]":"According to some, the material world is all that exists.","definition[12]":"important and needing to be considered when making a decision","opposite[1]":"irrelevant","example[32]":"material evidence","example[33]":"facts material to the investigation","note[4]":"material to","definition[13]":"important and having a noticeable effect","opposite[2]":"immaterial","example[34]":"material changes to the schedule","definition[14]":"something you need to make or do something","example[35]":"A shortage of building materials compounded escalating costs."}