{"word[0]":"assessment","definition[0]":"a process in which you make a judgment about a person or situation, or the judgment you make","example[0]":"a reading assessment test","example[1]":"What’s Michael’s assessment of the situation?","note[0]":"assessment of","definition[1]":"a calculation about the cost or value of something","example[2]":"a tax assessment","collocation[0]":"make an assessment","example[3]":"I had to make a quick assessment of the situation and act accordingly.","collocation[1]":"do/carry out an assessment","example[4]":"A teacher does a yearly assessment of each child’s progress.","collocation[2]":"a general/overall/broad assessment","example[5]":"The doctor must carry out a general assessment of the patient’s health.","collocation[3]":"a detailed assessment","example[6]":"We need a detailed assessment of what this will cost.","collocation[4]":"a comprehensive assessment","example[7]":"Our clients receive a comprehensive assessment of their financial affairs.","collocation[5]":"an objective assessment","example[8]":"The test results will provide an objective assessment of how much you have improved.","collocation[6]":"somebody’s personal assessment","example[9]":"What’s your personal assessment of the risks?","form[0]":"assessment + NOUN","collocation[7]":"the assessment procedure/process","example[10]":"Parents need to feel part of the assessment procedure.","collocation[8]":"assessment methods/techniques","example[11]":"We recommend using a variety of assessment methods.","definition[2]":"a judgement that you make about a person or situation after considering all the information","example[12]":"They will have to make an assessment of the services required to meet the health needs of the population.","definition[3]":"a calculation of how much something will cost to repair, how much something is worth, how much money someone should be given etc","example[13]":"Charges for students were based on an individual assessment of ability to pay.","definition[4]":"a calculation of the amount of tax that someone has to pay","example[14]":"Anyone facing a tax assessment which they consider unreasonable should seek professional advice."}