{"word[0]":"stuff","signpost[0]":"things","definition[0]":"used when you are talking about things such as substances, materials, or groups of objects when you do not know what they are called, or it is not important to say exactly what they are","example[0]":"I’ve got some sticky stuff on my shoe.","example[1]":"How do you think you’re going to fit all that stuff into the car?","example[2]":"I felt sorry for the ones who had to eat the awful stuff.","example[3]":"Where’s all the camping stuff?","signpost[1]":"activities/ideas","definition[1]":"used when talking about different activities, subjects, or ideas, when you do not say exactly what these are","example[4]":"What kind of stuff do you like to read?","example[5]":"I’ve got so much stuff to do this weekend.","example[6]":"There’s a lot of interesting stuff in this book.","example[7]":"He’s talked to me about all that stuff too.","example[8]":"He does mountain biking and skiing, and stuff like that.","signpost[2]":"work/art","definition[2]":"used when you are talking about what someone has done or made, for example writing, music, or art","example[9]":"I don’t like his stuff.","example[10]":"John Lee was getting ready to play his stuff.","example[11]":"He did some great stuff in his early films.","example[12]":"This is good stuff.","note[0]":"good stuff","signpost[3]":"character","definition[3]":"the qualities of someone’s character","example[13]":"Does he have the right stuff (=qualities that make you able to deal with difficulties)?","example[14]":"Surely you’re not going to give up? I thought you were made of sterner stuff (=were more determined).","explanation[0]":"Stuff is an uncountable noun and is not used in the plural You say","example[15]":"The shop sells all kinds of stuff","bad_example[0]":"The shop sells all kind of stuffs","display[0]":"foodstuff","explanation[1]":"Foodstuff is a countable noun and is often used in the plural","example[16]":"The country has to import basic foodstuffs such as rice","definition[4]":"to push or put something into a small space, especially in a quick careless way","synonym[0]":"shove","example[17]":"She stuffed two more sweaters into her bag.","note[1]":"stuff something into/in/up something","signpost[4]":"fill","definition[5]":"to fill something until it is full","example[18]":"Volunteers were busy stuffing envelopes.","example[19]":"boxes stuffed full of papers","example[20]":"a pillow stuffed with feathers","note[2]":"be stuffed with something","definition[6]":"to fill a chicken, pepper etc with a mixture of bread or rice, onion etc before cooking it","signpost[5]":"dead animal","definition[7]":"to fill the skin of a dead animal in order to make the animal look still alive","example[21]":"a stuffed owl"}