{"word[0]":"strengthen","signpost[0]":"feeling/belief/relationship","definition[0]":"to become stronger or make something stronger","opposite[0]":"weaken","example[0]":"Our friendship has steadily strengthened over the years.","example[1]":"Steve’s opposition only strengthened her resolve to go ahead.","example[2]":"The company plans to strengthen its hand  (=make itself more powerful) in Europe by opening an office in Spain.","example[3]":"The university hopes to strengthen its ties with the local community.","note[0]":"strengthen something’s ties/bonds/links etc","signpost[1]":"team/army etc","definition[1]":"to make an organization, army etc more powerful, especially by increasing the number or quality of the people in it","example[4]":"The team has been strengthened by the arrival of two new players.","signpost[2]":"financial situation","definition[2]":"if the financial situation of a country or company strengthens or is strengthened, it improves or is made to improve","example[5]":"measures to strengthen the economy","definition[3]":"to increase in value, or to increase the value of money","example[6]":"The pound has strengthened against other currencies.","signpost[3]":"body/structure","definition[4]":"to make something such as your body or a building stronger","example[7]":"Metal supports were added to strengthen the outer walls.","signpost[4]":"proof/reason","definition[5]":"to help prove something","example[8]":"Fresh evidence has greatly strengthened the case against him.","signpost[5]":"wind/current","definition[6]":"to increase in force","example[9]":"The wind had strengthened during the night.","collocation[0]":"strengthen somebody's position","example[10]":"They have strengthened their position by their performance in the recent local elections.","collocation[1]":"strengthen somebody's hand","example[11]":"The controversy has strengthened the hand of her critics.","collocation[2]":"strengthen somebody's resolve","example[12]":"Other people's doubts only strengthened my resolve to start my own business.","collocation[3]":"strengthen ties/bonds/links","example[13]":"He wants to strengthen ties with the West.","collocation[4]":"strengthen a relationship","example[14]":"Having counselling is a very positive step which could strengthen your relationship.","collocation[5]":"strengthen the role of somebody/something","example[15]":"A presidential decree strengthened the role of the Security Council.","definition[7]":"if a currency strengthens, or something strengthens it, the currency increases in value","example[16]":"The Singapore dollar has gradually strengthened against the pound and the US dollar.","example[17]":"The G7 industrial nations might act later this month to strengthen the yen.","definition[8]":"to improve the financial situation of a country, company etc","example[18]":"These measures are designed to strengthen the company’s market position."}