{"word[0]":"corruption","definition[0]":"dishonest, illegal, or immoral behaviour, especially from someone with power","note[0]":"political/official corruption","example[0]":"officials charged with bribery and corruption","example[1]":"The investigation uncovered widespread corruption within the police force.","definition[1]":"a changed form of something, for example a word","example[2]":"The word ‘Thursday’ is a corruption of ‘Thor’s Day’.","form[0]":"ADJECTIVES/NOUN + corruption","collocation[0]":"rife","example[3]":"Corruption was rife in the south of the country.","collocation[1]":"endemic","example[4]":"Firstly, we need to tackle the corruption that is endemic in the system.","collocation[2]":"political/financial corruption","example[5]":"It is a country with a long history of political corruption.","collocation[3]":"widespread corruption","example[6]":"The election campaign was marred by widespread corruption.","collocation[4]":"alleged corruption","example[7]":"He is about to be investigated for alleged corruption.","collocation[5]":"government/police corruption","example[8]":"There has been plenty of evidence of police corruption.","collocation[6]":"high-level corruption","example[9]":"He has promised to end high-level corruption.","collocation[7]":"moral corruption","example[10]":"Some people see television as a cause of moral corruption in young people.","collocation[8]":"fight/tackle corruption","example[11]":"He criticized the government for failing to fight corruption in high places.","collocation[9]":"root out corruption","example[12]":"a new campaign to root out corruption","collocation[10]":"stamp out corruption","example[13]":"The party's chairman called for action to stamp out corruption.","collocation[11]":"expose/uncover corruption","example[14]":"The newspaper prided itself on exposing corruption in government.","collocation[12]":"allegations/accusations/charges of corruption","example[15]":"He has strongly denied allegations of corruption.","collocation[13]":"bribery and corruption","example[16]":"the major crimes of bribery and corruption","definition[2]":"the crime of giving or receiving money, gifts, a better job etc in exchange for doing something dishonest or illegal","example[17]":"He denies twelve counts of corruption.","example[18]":"The Chamber of Deputies voted to allow Venice magistrates to investigate corruption charges against him.","definition[3]":"when someone who has power or authority uses it in a dishonest or illegal way to get money or an advantage","example[19]":"As well as causing a breakdown in the economic system, hyper-inflation led to a spread of corruption."}