{"word[0]":"sample","definition[0]":"a small part or amount of something that is examined in order to find out something about the whole","example[0]":"They took a blood sample to test for hepatitis.","example[1]":"I’d like to see some samples of your work.","note[0]":"sample of","definition[1]":"a small amount of a product that people can try in order to find out what it is like","example[2]":"free samples of a new shampoo","definition[2]":"a small group of people who have been chosen from a larger group to give information or answers to questions","example[3]":"The sample consisted of 98 secondary school teachers.","example[4]":"Out of a random sample of drivers, 21% had been in an accident in the previous year.","example[5]":"a nationally representative sample of over 950 elderly persons","definition[3]":"a small part of a song from a CD or record that is used in a new song","example[6]":"Her latest album makes extensive use of samples from a wide range of acid jazz tracks.","form[0]":"NOUN + sample","collocation[0]":"a blood/urine/tissue etc sample","example[7]":"He compared the samples with a blood sample from Mr Green.","collocation[1]":"a water/soil etc sample","example[8]":"They analysed soil samples collected from streams.","collocation[2]":"a DNA sample","example[9]":"Archaeologists are studying DNA samples from ancient Egyptian mummies.","collocation[3]":"take/collect a sample","example[10]":"The study took samples from workers at four nuclear plants.","collocation[4]":"give/provide a sample","example[11]":"He said he had once fainted when giving a sample of blood.","collocation[5]":"analyse/test a sample","example[12]":"All the samples were tested for bacteria.","definition[4]":"to taste food or drink in order to see what it is like","example[13]":"a chance to sample the local food","definition[5]":"to choose some people from a larger group in order to ask them questions or get information from them","example[14]":"18% of the adults sampled admitted having had problems with alcohol abuse.","definition[6]":"to try an activity, go to a place etc in order to see what it is like","example[15]":"Here’s your chance to sample the delights of country life.","definition[7]":"to use a small part of a song from a CD or record in a new song","example[16]":"Many of his songs have been sampled by other artists.","definition[8]":"a number of people or things chosen from a large group to take part in studies that provide information about the whole group","example[17]":"Of a sample of executives in 600 companies, 15% had no plans to do business in the EU.","example[18]":"The survey was based on a random sample (=a number of people or things chosen without knowing anything about them) of households from all income groups.","example[19]":"The agency interviewed a representative sample (=a specially chosen group including several different types of people) of 1,003 people in the city.","definition[9]":"a small amount of a product that people can use or look at in order to find out what it is like","example[20]":"He used the product after receiving a free sample in the mail.","example[21]":"We were shown some sample pages for the new book.","definition[10]":"a small part or amount of something that is tested in order to find out something about the whole","example[22]":"A sample of the water showed that it contained high amounts of sodium.","definition[11]":"to ask a group of people chosen from a larger group questions, in order to get information or opinions from them, so as to better understand the larger group","example[23]":"Four different groups of adults were sampled for the survey.","definition[12]":"to try a small amount of a product in order to find out what it is like","example[24]":"Here’s your chance to sample our latest product."}