{"word[0]":"teacher","definition[0]":"someone whose job is to teach, especially in a school","note[0]":"teacher training/education (=professional training to become a teacher)","example[0]":"a primary school teacher","definition[1]":"someone who teaches as their job, especially in a school","example[1]":"a high school teacher","display[0]":"principal","definition[2]":"the teacher who is in charge of a school or college","example[2]":"The teacher sent him to the principal’s office.","display[1]":"tutor","definition[3]":"someone who gives private lessons to one student or a small group of students. In Britain, a tutor is also a teacher in a university","example[3]":"They hired a tutor to help him with his English.","example[4]":"Your tutor will help you find a subject for your essay.","display[2]":"lecturer","definition[4]":"someone who teaches in a university or college","example[5]":"University lecturers aren’t very well paid.","display[3]":"professor","definition[5]":"a teacher in a college or university. In Britain, a professor  is a high-ranking university teacher, especially one who is head of a department","example[6]":"She was professor of linguistics at Cambridge University.","display[4]":"instructor","definition[6]":"someone who teaches a sport or a practical skill such as swimming or driving","example[7]":"He works as a ski instructor in the winter.","example[8]":"a driving instructor","display[5]":"coach","definition[7]":"someone who helps a person or team improve in a sport","example[9]":"a professional tennis coach","display[6]":"educator","definition[8]":"someone whose job involves teaching people, or someone who is an expert on education","example[10]":"Most educators agree that class sizes are still too big.","display[7]":"trainer","definition[9]":"someone who teaches people particular skills, especially the skills they need to do a job","example[11]":"a teacher trainer","example[12]":"Many companies pay outside trainers to teach management skills to their staff.","display[8]":"governess","definition[10]":"a woman who lived with a family and taught their children in past times","example[13]":"As a governess, Charlotte Brontë received twenty pounds a year."}