{"definition[0]":"a planned way of doing something, especially one that a lot of people know about and use","example[0]":"traditional teaching methods","example[1]":"I think we should try again using a different method.","example[2]":"Today’s methods of birth control make it possible for a couple to choose whether or not to have a child.","note[0]":"method of/for (doing) something","example[3]":"effective methods for the storage and retrieval of information","explanation[0]":"In everyday English, people usually say a way of doing something rather than a method of doing something:","example[4]":"a secure way of storing information","definition[1]":"a well-organized and well-planned way of doing something","example[5]":"There’s no method in the way they do their accounts.","collocation[0]":"use a method","example[6]":"Which payment method do you use when travelling?","collocation[1]":"adopt a method","example[7]":"Quite a few companies adopted Japanese business methods.","collocation[2]":"devise a method","example[8]":"Scientists have devised a method of recycling contaminated oil.","collocation[3]":"outline a method","example[9]":"This leaflet outlines the methods that are available to you.","collocation[4]":"effective/efficient","example[10]":"Some methods are more effective than others.","example[11]":"We need a more reliable method of predicting earthquakes.","example[12]":"No single method is suitable for all occasions.","collocation[5]":"a teaching method","example[13]":"Neill had considerable influence over modern teaching methods.","collocation[6]":"a farming method","example[14]":"Farming methods have changed a lot over the last 100 years.","collocation[7]":"the usual method","example[15]":"The usual method of investing in a company is by buying shares in it.","collocation[8]":"the traditional method","example[16]":"Farmers are being encouraged to return to more traditional methods of farming.","collocation[9]":"modern methods","example[17]":"Modern methods of solving crime depend a lot on forensic evidence.","collocation[10]":"the scientific method","example[18]":"It is sometimes difficult to apply the scientific method to subjects such as sociology or psychology.","collocation[11]":"an alternative method","example[19]":"Try to use alternative methods of transport, such as cycling or taking the bus.","definition[2]":"a way of doing something, especially one that is well known and often used","example[20]":"You can choose whichever method of payment you prefer.","example[21]":"an environmentally friendly method for treating household waste","display[0]":"way","definition[3]":"a set of actions that you use in order to do something. Way  is more informal than method and is used more often in everyday English","example[22]":"What’s the best way to remove wine stains?","example[23]":"a new way of treating the disease","example[24]":"There are lots of ways of cooking mushrooms.","display[1]":"means","definition[4]":"something that you use to do something or achieve something","example[25]":"Their main means of transport  is their car.","example[26]":"E-mail is often the most convenient means of communication.","example[27]":"He looked around for a means of escape.","example[28]":"Education and training are the most efficient means of improving the nation’s economy.","display[2]":"approach","definition[5]":"a way of dealing with a particular problem or situation, especially a way that has been carefully thought about or planned","example[29]":"Today’s approach to raising children is very different from 40 years ago.","example[30]":"I think we need to try a different approach.","display[3]":"technique","definition[6]":"a particular way of doing something, for which you need a skill that has to be learned and practised","example[31]":"tips on how to improve your exam technique","example[32]":"More patients are surviving thanks to improved surgical techniques.","display[4]":"tactics","definition[7]":"methods that you use in order to achieve what you want, especially in a game or competition","example[33]":"There were complaints about police tactics used to clear demonstrators.","example[34]":"The team was discussing tactics for the game.","display[5]":"strategy","definition[8]":"a set of carefully planned methods for achieving something that is difficult and may take a long time","example[35]":"our sales strategy","example[36]":"a strategy to reduce the level of teenage smoking","display[6]":"mode","definition[9]":"a particular way of doing something","example[37]":"For him, painting is just another mode of expression.","example[38]":"You can choose between several different modes of operation.","example[39]":"the most efficient mode of transportation","example[40]":"Withdrawing a child from class is still the preferred mode of providing extra help to that child.","definition[10]":"a planned way of doing something, especially one that a lot of people use","example[41]":"It is best to consider all methods of figuring your annual income tax before deciding on any one option.","note[1]":"method of","example[42]":"A buy-and-try policy is a suitable method for examining new convenience products.","note[2]":"method for"}