{"word[0]":"dimension","definition[0]":"a part of a situation or a quality involved in it","synonym[0]":"aspect","example[0]":"You can have a spiritual dimension to your life without being religious.","example[1]":"His coaching has added another dimension to my game.","note[0]":"add a new/an extra/another etc dimension (to something)","example[2]":"It is important to keep in mind the historical dimension to these issues.","note[1]":"political/social/economic etc dimension","example[3]":"the moral dimension of world politics","note[2]":"dimension of","definition[1]":"the length, height, width, depth, or diameter of something","example[4]":"a rectangle with the dimensions 5cm x 2cm","example[5]":"We’ll need to know the exact dimensions of the room.","definition[2]":"a direction in space that is at an angle of 90 degrees to two other directions","example[6]":"A diagram represents things in only two dimensions.","collocation[0]":"add/give/bring a new etc dimension to something","example[7]":"Digital cameras have added a new dimension to photography.","collocation[1]":"have a new/social etc dimension","example[8]":"Learning a language has an important cultural dimension.","collocation[2]":"take on a new/extra etc dimension","example[9]":"Since I met her, my life has taken on a completely different dimension.","collocation[3]":"a new/different dimension","example[10]":"The size of the bombs gave a new dimension to the terrorists’ campaign.","collocation[4]":"an extra/added/additional/further dimension","example[11]":"Movies soon had the added dimension of sound.","collocation[5]":"a social/political/cultural dimension","example[12]":"His writing has a strong political dimension.","collocation[6]":"a moral/ethical dimension","example[13]":"The book discusses the ethical dimension involved in genetic engineering.","collocation[7]":"a spiritual dimension","example[14]":"He was interested in the spiritual dimension to art.","collocation[8]":"the human dimension","example[15]":"What the figures cannot show us is the human dimension of the disaster.","collocation[9]":"an international dimension","example[16]":"The foreign players bring an international dimension to the English Premier League."}