{"word[0]":"lucky","comparative[0]":"luckier","superlative[0]":"luckiest","definition[0]":"having good luck","synonym[0]":"fortunate","opposite[0]":"unlucky","example[0]":"The children were lucky to survive the fire which destroyed their home.","note[0]":"be lucky to do/be something","example[1]":"Count yourself lucky you’ve got a husband like Jack.","note[1]":"count/consider/think yourself lucky","example[2]":"You might get lucky and find a bargain.","note[2]":"get lucky","example[3]":"those of us lucky enough to own our own homes","note[3]":"lucky enough to do something","example[4]":"I’ll be lucky if I get any of my money back.","note[4]":"lucky if","example[5]":"I was tremendously lucky that I didn’t die in the accident.","note[5]":"lucky (that)","example[6]":"We’ve been very lucky with the weather.","note[6]":"lucky with","definition[1]":"resulting from good luck","example[7]":"I didn’t really know your name – it was just a lucky guess.","example[8]":"A middle-aged woman had a lucky escape when a tree crashed down onto her car.","example[9]":"It’s lucky that no-one was hurt.","note[7]":"it is lucky (that)","definition[2]":"bringing good luck","example[10]":"a lucky charm","collocation[0]":"feel lucky","example[11]":"I feel so incredibly lucky to have had that experience.","example[12]":"They’re not a great team - they just got lucky.","example[13]":"You should count yourself lucky you weren’t seriously hurt.","collocation[1]":"strike (it) lucky","example[14]":"I applied for twenty jobs before I struck lucky.","collocation[2]":"extremely/exceedingly/incredibly lucky","example[15]":"Police say it was extremely lucky that no one was killed.","collocation[3]":"dead lucky","example[16]":"I was dead lucky to find a parking space right away.","collocation[4]":"pretty lucky","example[17]":"We were pretty lucky with the weather on this holiday.","form[0]":"lucky + NOUN","collocation[5]":"a lucky winner","example[18]":"The lucky winner of the competition will be announced next week.","collocation[6]":"a lucky man/woman/boy/girl","example[19]":"Your son’s a lucky man, having a father like you.","collocation[7]":"the lucky ones","example[20]":"They considered themselves the lucky ones because they escaped with only minor injuries.","collocation[8]":"be lucky enough to do something","example[21]":"I was lucky enough to be selected for the school team.","definition[3]":"happening because of good luck, or bringing you good luck","example[22]":"a lucky guess","example[23]":"Seven is considered a lucky number.","example[24]":"It’s lucky that I’ve got some spare keys.","example[25]":"Italy got a lucky goal in the last five minutes of the game.","example[26]":"‘How did you know he’d be there?’ ‘It was a lucky guess.’","definition[4]":"happening because of good luck. Fortunate is more formal than lucky","example[27]":"It was extremely fortunate that there was no one in the building when the bomb went off.","example[28]":"I’m in the fortunate position of doing a job I love.","example[29]":"Some plants actually prefer a lot of shade, which is fortunate for gardeners choosing plants for gloomy corners.","display[0]":"it’s a good thing (that)","definition[5]":"used when saying that there would have been problems if something had not happened","example[30]":"It’s a good thing that you brought an umbrella with you.","example[31]":"It’s a good job I’m here to help.","display[1]":"miraculous","definition[6]":"extremely lucky in a way that is almost unbelievable","example[32]":"A teenager had a miraculous escape last night when the car she was travelling in overturned.","example[33]":"The doctor gave her a month to live but she made a miraculous recovery.","example[34]":"It was miraculous that no one was seriously injured in the accident.","display[2]":"fortuitous","definition[7]":"happening because of good luck","example[35]":"a fortuitous decision","example[36]":"a fortuitous coincidence","example[37]":"It was fortuitous that no one else was hurt.","display[3]":"a fluke","definition[8]":"something that happens by chance, not because of skill or good judgment","example[38]":"The goal was a fluke.","example[39]":"By a fluke, he managed to get the question right.","display[4]":"be in the right place at the right time","definition[9]":"used when saying that someone is lucky and the situation is right for them","example[40]":"Making money from buying property is easy – you just have to be in the right place at the right time."}