{"word[0]":"statement","definition[0]":"something you say or write, especially publicly or officially, to let people know your intentions or opinions, or to record facts","example[0]":"In an official statement, she formally announced her resignation.","example[1]":"the prime minister’s recent statements on Europe","note[0]":"statement on/about","definition[1]":"a record showing amounts of money paid, received, owed etc","example[2]":"the company’s annual financial statements","example[3]":"I haven’t received my bank statement for last month yet.","definition[2]":"something you do, make, wear etc that causes people to have a certain opinion about you","example[4]":"The type of car you drive makes a statement about you.","example[5]":"a fashion statement","definition[3]":"the act of expressing something in words","example[6]":"presentation and clarity of statement","collocation[0]":"make a statement","example[7]":"The minister will make a statement on the matter tomorrow.","collocation[1]":"give a statement","example[8]":"He gave a statement to the police.","collocation[2]":"issue/release/put out a statement","example[9]":"The Russian Foreign Ministry issued a short statement saying the meeting was ‘useful’.","collocation[3]":"take/get a statement from somebody","example[10]":"I asked the police why they didn’t take a statement from me four years ago.","collocation[4]":"withdraw your statement","example[11]":"She later withdrew her statement.","form[0]":"ADJECTIVES/NOUN + statement","collocation[5]":"a short/brief statement","example[12]":"Police last night issued a brief statement about the incident.","collocation[6]":"a clear statement","example[13]":"The article was a clear statement of his beliefs.","collocation[7]":"a sweeping statement","example[14]":"Researchers do not want to make any sweeping statements at this stage.","collocation[8]":"a false/misleading statement","example[15]":"She is accused of making false statements to obtain a passport.","collocation[9]":"an official statement","example[16]":"The company is expected to make an official statement tomorrow.","collocation[10]":"a formal statement","example[17]":"You will be asked to make a formal statement.","collocation[11]":"a public statement","example[18]":"We will be making no public statements about the matter.","collocation[12]":"a written statement","example[19]":"One neighbour said in a written statement that she often heard a baby ‘crying for help’.","collocation[13]":"a prepared statement","example[20]":"His solicitor read a prepared statement on his behalf.","collocation[14]":"a sworn statement","example[21]":"The reports were based on sworn statements of graduates of the terrorist training camp.","collocation[15]":"a policy statement","example[22]":"In his first major policy statement to Parliament he promised to end corruption in public life.","collocation[16]":"a mission statement","example[23]":"The role of a mission statement is to focus on the purpose of the organization.","definition[4]":"something that someone says or writes publicly in order to tell people what they intend to do, what their opinion is etc","example[24]":"The president will make a statement to the press this afternoon.","display[0]":"announcement","definition[5]":"a public or official statement telling people what has happened or what will happen","example[25]":"The announcement was heard by millions of radio listeners this morning.","example[26]":"The company made an announcement yesterday that Rogers has resigned as managing director.","display[1]":"declaration","definition[6]":"an important official statement, especially about what a government or organization intends to do","example[27]":"On the 19th of July a declaration of war was delivered in Berlin.","example[28]":"Independence Hall is where the delegates met to sign the Declaration of Independence and write the Constitution.","display[2]":"press release","definition[7]":"an official statement giving information to the newspapers, radio, or television","example[29]":"The singer issued a press release saying that she was too ill to continue with the tour.","display[3]":"testimony","definition[8]":"a formal statement saying that something is true, especially one a witness makes in a court of law","example[30]":"The testimony of the two arresting officers was an important part of the prosecution case.","example[31]":"The jury based their decision almost entirely on the testimony of one witness.","display[4]":"affidavit","definition[9]":"a written statement that you swear is true, for use as proof in a court of law","example[32]":"A prison doctor who treated the accused sent an affidavit about his mental state.","definition[10]":"if an education authority statements a child who has special educational needs, they give a school additional money to help teach that child","definition[11]":"statement pieces of jewellery, shoes etc are very noticeable and impressive – used especially in magazines","definition[12]":"something you say or write publicly or officially to let people know your intentions or opinions, or to record facts","example[33]":"False statements on your tax form could land you in jail.","example[34]":"The Congressman issued a statement to the press.","example[35]":"The brokers had made misleading statements.","definition[13]":"a list showing amounts of money paid, received, owing etc and their total","example[36]":"You will receive a monthly statement showing the state of your account."}