{"word[0]":"relief","signpost[0]":"comfort","definition[0]":"a feeling of comfort when something frightening, worrying, or painful has ended or has not happened","example[0]":"I felt a huge surge of relief and happiness.","example[1]":"No one was hurt, and we all breathed a sigh of relief.","example[2]":"I hate to say it, but it was a relief to have him out of the house.","note[0]":"it is a relief to see/have/know etc something","example[3]":"The doctor said it was just the flu. What a relief!","note[1]":"what a relief/that’s a relief","example[4]":"He watched with relief as the girl nodded.","note[2]":"with relief","example[5]":"He laughed in relief.","note[3]":"in relief","example[6]":"To my relief, they spoke English.","note[4]":"to somebody’s relief","signpost[1]":"reduction of pain","definition[1]":"when something reduces someone’s pain or unhappy feelings","example[7]":"Marijuana can provide pain relief for some cancer patients.","example[8]":"the relief of suffering","note[5]":"relief of","example[9]":"The cool room provided relief from the terrible heat outdoors.","note[6]":"relief from","definition[2]":"money, food, clothes etc given to people who are poor or hungry","example[10]":"money raised for the relief effort","example[11]":"famine relief for victims of the drought","note[7]":"disaster/famine/flood etc relief","signpost[2]":"replacement","definition[3]":"a person or group of people that replaces another one and does their work after they have finished","example[12]":"the relief for the military guard","example[13]":"a relief driver","signpost[3]":"decoration","definition[4]":"a way of decorating wood, stone etc with a shape or figure that is raised above the surface, or the decoration itself","example[14]":"figures carved in relief","definition[5]":"money given by the government to help people who are poor, old, unemployed etc","synonym[0]":"welfare","example[15]":"families on relief during the Depression","note[8]":"on relief","signpost[4]":"war","definition[6]":"the act of freeing a town when it has been surrounded by an enemy","example[16]":"the relief of Mafeking","heading[0]":"– Meaning 1: a feeling of comfort when something frightening, worrying, or painful has ended or has not happened","collocation[0]":"a great/enormous/tremendous etc relief","example[17]":"It was a great relief to him when she returned safely.","collocation[1]":"a welcome relief","example[18]":"The holiday was a welcome relief from the pressure of work.","collocation[2]":"come as a relief","example[19]":"The court's decision came as a huge relief to Microsoft.","collocation[3]":"feel relief","example[20]":"I felt nothing but relief when it was over.","collocation[4]":"relief floods through somebody","example[21]":"When she heard he was still alive, relief flooded through her.","collocation[5]":"a sense/feeling of relief","example[22]":"She was filled with an overwhelming sense of relief.","collocation[6]":"breathe/heave a sigh of relief","example[23]":"United fans breathed a huge sigh of relief as Drogba's shot was tipped over the bar.","collocation[7]":"what a relief","example[24]":"What a relief to be able to say what I really feel!","collocation[8]":"such a relief","example[25]":"It's just such a relief to have found someone!","heading[1]":"– Meaning 3: money, food, clothes etc given to people who are poor or hungry","form[0]":"NOUN + relief","collocation[9]":"disaster/emergency relief","example[26]":"Our objective is to provide food aid and emergency relief to developing countries.","collocation[10]":"famine/flood relief","example[27]":"We donated $1,000 to the American Red Cross for flood relief.","form[1]":"relief + NOUN","collocation[11]":"a relief agency/organization","example[28]":"Relief agencies reported that many of the refugees had arrived in a terrible condition.","collocation[12]":"relief supplies/aid","example[29]":"US troops had helped distribute relief supplies to Kurdish refugees in northern Iraq.","collocation[13]":"relief efforts","example[30]":"In areas severely affected by the earthquake, it is difficult to coordinate relief efforts.","collocation[14]":"a relief operation","example[31]":"UN officials accused the government of obstructing relief operations in the south of the country.","collocation[15]":"a relief worker","example[32]":"The relief workers have to bring in clean drinking water by tanker.","collocation[16]":"relief work","example[33]":"The charity raised over five million pounds for relief work.","collocation[17]":"a relief convoy/flight","example[34]":"A relief convoy of 10 trucks set off with food and medical supplies.","definition[7]":"when a bad situation is reduced or stops for a time","example[35]":"Any sign of relief from price pressures will be welcome news for the economy.","example[36]":"a relief fund for refugees","definition[8]":"money given by the government to people who are poor, hungry, unemployed etc","example[37]":"In the future, the system simply won’t provide enough relief for low-income people.","example[38]":"rising relief spending as unemployment spreads","example[39]":"Farmers will receivefederal relief for crops damaged by drought.","definition[9]":"money or special tax arrangements etc given to countries or companies that owe money or have other problems","example[40]":"The committee will petition the bankruptcy court for appropriate relief.","definition[10]":"a person or group of people that does the work of another one after they have finished or if they cannot work at a particular time","example[41]":"I’ve arranged for a relief to cover for me while I’m away.","example[42]":"His father and brother fill in as relief drivers."}