{"word[0]":"bail","definition[0]":"money left with a court of law to make sure that a prisoner will return when their trial starts","example[0]":"Carpenter is free on bail while he appeals his conviction.","example[1]":"She was murdered by a man who was out on bail for rape.","example[2]":"The three men were released on bail pending an appeal.","example[3]":"He is not likely to be granted bail.","example[4]":"Carter has been refused bail and will remain in custody.","example[5]":"The judge ordered that Jones be held without bail.","example[6]":"Why can’t you ask your father to put up bail for you?","example[7]":"Two of the defendants jumped bail and fled to New York.","example[8]":"Bail was set at $30,000.","definition[1]":"one of the two small pieces of wood laid on top of the stumps in a game of cricket","collocation[0]":"be released/freed on bail","example[9]":"The men were questioned yesterday before being released on bail.","collocation[1]":"be granted/given bail","example[10]":"Magistrates adjourned the case until June 9 and Smith was granted bail.","collocation[2]":"get bail","example[11]":"His wife says he hopes to get bail.","collocation[3]":"be refused bail","example[12]":"Relatively few defendants are refused bail.","collocation[4]":"be held without bail","example[13]":"He was being held without bail pending another hearing.","collocation[5]":"set bail","example[14]":"Judge Philip Moscone set bail at $2 million.","collocation[6]":"post bail","example[15]":"He had to post bail of US$100,000 before he could fly home to Canada.","collocation[7]":"jump bail","example[16]":"He jumped bail and fled the country three days before he was to be sentenced.","form[0]":"ADJECTIVES/NOUN + bail","collocation[8]":"police bail","example[17]":"She was released on police bail.","collocation[9]":"conditional/unconditional bail","example[18]":"Both men were given unconditional bail and they left court without comment.","definition[2]":"to escape from a situation that you do not want to be in anymore","example[19]":"After ten years in the business, McArthur is baling out.","definition[3]":"if someone is bailed, they are let out of prison to wait for their trial after they have left a sum of money with the court","example[20]":"Dakers was bailed to appear at Durham Crown Court.","explanation[0]":"Bail is usually passive in this meaning","definition[4]":"when someone who has been accused of a crime is allowed to remain free until their court case starts, usually because an amount of money has been given to the court which the court will keep if the prisoner does not return","example[21]":"The magistrates refused their application for bail.","example[22]":"Six former members of staff have been arrested and released on bail while the inquiry continues.","definition[5]":"the amount of money paid for bail","example[23]":"Bail was set at £100,000 each on condition that the defendants did not leave the country.","definition[6]":"to leave a sum of money with a court of law as bail","example[24]":"If a defendant can post bail and presents no threat to the community, he can await trial at home."}