{"word[0]":"meeting","definition[0]":"an event at which people meet to discuss and decide things","example[0]":"We’re having a meeting next week to discuss the matter.","example[1]":"I’ll raise the matter at the next meeting.","note[0]":"at a meeting","example[2]":"She said that Mr Coleby was in a meeting.","note[1]":"in a meeting","example[3]":"There was a public meeting about the future of the gallery.","note[2]":"meeting about/on","example[4]":"I’ve got a meeting with Mr Edwards this afternoon.","note[3]":"meeting with","example[5]":"a meeting of senior politicians","note[4]":"meeting of","example[6]":"a meeting between unions and management","note[5]":"meeting between","definition[1]":"when people meet each other by chance or because they have arranged to do this","example[7]":"I had felt drawn to Alice ever since our first meeting.","definition[2]":"a sports competition or a set of races for horses","definition[3]":"an event at which a group of Quakers  (=a Christian religious group) pray together","collocation[0]":"have a meeting","example[8]":"I had a long meeting with my manager.","collocation[1]":"hold a meeting","example[9]":"The meetings are usually held on a Friday.","collocation[2]":"go to a meeting","example[10]":"All staff members are expected to attend the meeting.","collocation[3]":"call a meeting","example[11]":"The board has the power to convene a general meeting if necessary.","collocation[4]":"chair a meeting","example[12]":"The meeting was chaired by Professor Jones of the University of York.","collocation[5]":"open a meeting","example[13]":"There was disagreement about opening the meeting with a prayer.","collocation[6]":"close a meeting","example[14]":"He closed the meeting by saying, ‘I think we have made great progress.’","collocation[7]":"address a meeting","example[15]":"A member of Greenpeace addressed the protest meeting.","collocation[8]":"adjourn a meeting","example[16]":"This meeting is adjourned until tomorrow.","form[0]":"ADJECTIVES/NOUN + meeting","collocation[9]":"a committee/staff/board etc meeting","example[17]":"A staff meeting will be held at 3 p.m.","collocation[10]":"an annual meeting","example[18]":"the annual meeting of the British Medical Association","collocation[11]":"a monthly/weekly meeting","example[19]":"a routine weekly meeting with the managing director","collocation[12]":"a public/open meeting","example[20]":"A public meeting was held to discuss the proposal to build a new school.","collocation[13]":"a general meeting","example[21]":"The annual general meeting of the rugby club was held last night.","collocation[14]":"a private/closed meeting","example[22]":"The senator attended a private meeting with the president.","collocation[15]":"a summit meeting","example[23]":"The prime minister is in Paris for a European summit meeting.","collocation[16]":"a business meeting","example[24]":"He had to go into town for a business meeting.","collocation[17]":"a protest meeting","example[25]":"Anti-road campaigners are holding a protest meeting today.","collocation[18]":"an emergency/urgent meeting","example[26]":"The Council has called an emergency meeting to decide what action to take.","definition[4]":"an occasion when people meet in order to discuss something","example[27]":"a business meeting.","example[28]":"Mr Bell is in a meeting.","example[29]":"The committee will hold another meeting Wednesday.","display[0]":"conference","definition[5]":"an organized event, especially one that continues for several days, at which a lot of people meet to discuss a particular subject and hear speeches about it","example[30]":"Didn’t you give a talk at the conference last year?","example[31]":"a conference of women business leaders","display[1]":"convention","definition[6]":"a large formal meeting of people who belong to a political party, or to an organization of people with the same interests","example[32]":"the Democratic Party Convention","example[33]":"a convention for Star Trek fans","display[2]":"rally","definition[7]":"a large public meeting, especially one that is held outdoors to support or protest about something","example[34]":"There was a massive peace rally in London.","display[3]":"summit","definition[8]":"a meeting between government leaders from important and powerful countries, to discuss important matters","example[35]":"A summit meeting of OPEC leaders was called to find a solution to the oil crisis.","example[36]":"next week’s economic summit","display[4]":"caucus","definition[9]":"a local meeting of the members of a political party to choose people to represent them at a larger meeting, or to choose a candidate in an election","example[37]":"Obama won the Iowa caucus in 2007.","display[5]":"teleconference/video conference","definition[10]":"a business meeting in which people in different places talk to each other using telephones or video equipment","example[38]":"The chairman held teleconferences with his senior managers.","display[6]":"gathering/get-together","definition[11]":"a situation in which a group of people come together to meet, talk, and have drinks with each other, especially friends or family","example[39]":"We held a small family get-together to celebrate her birthday.","example[40]":"She arranged social gatherings in Kettering for young people on Saturday evenings.","display[7]":"date","definition[12]":"an arrangement to meet someone who you are having, or hoping to have, a romantic relationship with","example[41]":"I think I might ask her out on a date.","display[8]":"rendezvous","definition[13]":"a meeting where two people have arranged to meet at a particular time or place, often secretly","example[42]":"She arranged a rendezvous with him in the hotel bar.","display[9]":"tryst","definition[14]":"a secret meeting between people who are having a romantic relationship","example[43]":"a good place for a moonlight tryst","definition[15]":"an event at which people meet to talk and decide things","example[44]":"We had a meeting yesterday to discuss progress.","example[45]":"It was decided to hold a shareholders’ meeting later this month.","example[46]":"Two of the directors refused to attend the board meeting.","example[47]":"I’ve been in a meeting all afternoon.","example[48]":"The preliminary findings will be presented at a meeting next week.","example[49]":"Representatives of Middle Eastern banks were due in London this morning for a meeting with Bank of England officials."}