{"past_tense[0]":"told","signpost[0]":"communicate something","definition[0]":"if someone tells you something, they communicate information, a story, their feelings etc to you","example[0]":"Sheppard was telling the truth.","example[1]":"She told us some funny stories about her sister.","note[0]":"tell (somebody) a story/joke/secret/lie","example[2]":"Tell me straight, Adam. Just answer yes or no.","note[1]":"tell somebody straight","example[3]":"I wish someone had told me the meeting was canceled.","note[2]":"tell somebody (that)","example[4]":"The Chief of Police told reporters that two people were killed in the blast.","example[5]":"Jack had to go, but he didn’t tell me why.","note[3]":"tell somebody what/how/where/who etc","example[6]":"I think you’d better tell me exactly what’s been going on around here.","example[7]":"No one had told them about the drug’s side effects.","note[4]":"tell somebody about something","example[8]":"I’ll tell you all about it when I get back.","example[9]":"Tell me your phone number again.","note[5]":"tell somebody something","explanation[0]":"In written English, people often prefer to say that another writer describes something, rather than using tell:","example[10]":"His book describes how the human brain has developed.","signpost[1]":"show something","definition[1]":"to give information in ways other than talking","example[11]":"The light tells you when the machine is ready.","note[6]":"tell somebody how/what/where/who etc","example[12]":"The bear’s sense of smell tells it where prey is hiding.","example[13]":"What do these fossils tell us about climate change?","signpost[2]":"what somebody should do","definition[2]":"to say that someone must do something","example[14]":"Do as you are told (=obey me) and don’t ask questions.","example[15]":"The teacher told the children to sit down quietly.","note[7]":"tell somebody (not) to do something","example[16]":"I thought I told you not to touch anything!","example[17]":"Bernice was told she had to work late this evening.","example[18]":"Stop trying to tell me what to do all the time.","note[8]":"tell somebody what/how etc","type[0]":"intransitive, transitive not in progressive","signpost[3]":"know","definition[3]":"to know something or be able to recognize something because of certain signs that show this","example[19]":"You could tell a mile off that he was lying.","note[9]":"tell (something) a mile off","example[20]":"She might have been lying. Benjy couldn’t tell.","note[10]":"can/can’t tell","example[21]":"The moment Kramer walked in, I could tell that things were not going well.","note[11]":"tell (that)","example[22]":"It’s hard to tell how long the job will take.","note[12]":"tell when/how/whether/if etc","example[23]":"I could tell from his tone of voice that Ken was disappointed.","note[13]":"tell something by something/from something","signpost[4]":"recognize difference","definition[4]":"to be able to see how one person or thing is different from another","example[24]":"Can you tell the difference between sparkling wine and champagne?","example[25]":"How can you tell a fake Vuitton handbag from the real thing?","note[14]":"tell something from something","type[1]":"transitive usually in past tense","signpost[5]":"warn","definition[5]":"to warn someone that something bad might happen","example[26]":"I told you it was a waste of time talking to him.","example[27]":"My mother told me not to trust Robert.","signpost[6]":"tell somebody about bad behaviour","definition[6]":"to tell someone in authority about something wrong that someone you know has done – used especially by children","synonym[0]":"tell on somebody","example[28]":"If you hit me, I’ll tell.","type[2]":"intransitive not in progressive","signpost[7]":"affect","definition[7]":"to have an effect on someone, especially a harmful one","example[29]":"These late nights are really beginning to tell on him.","collocation[0]":"tell a story/tale","example[30]":"He then told the story of how he was injured while riding his motorcycle.","collocation[1]":"tell a joke","example[31]":"They sat around telling terrible jokes.","collocation[2]":"tell somebody a secret","example[32]":"I offered to tell her my secret if she didn’t tell anyone else.","collocation[3]":"tell a lie","example[33]":"They told lies about us.","collocation[4]":"tell the truth","example[34]":"‘I’m telling you the truth, ’ she persisted.","heading[0]":"GRAMMAR: Patterns with tell","explanation[1]":"In meaning 1, tell is transitive and must be followed by an object","explanation[2]":"You tell someone something","example[35]":"He told her the news","explanation[3]":"You tell something to someone","example[36]":"He told the news to his mother","bad_example[0]":"He told to his mother the news","explanation[4]":"You tell someone about something","example[37]":"He told me about his feelings","bad_example[1]":"He told about his feelings","explanation[5]":"You tell someone to do something","example[38]":"He told me to sit down","explanation[6]":"You use tell someone (that) when reporting what someone said","example[39]":"He told them that he was sorry","example[40]":"She told me I could go","bad_example[2]":"He told that he was sorry","definition[8]":"to give someone information by speaking or writing to them","example[41]":"She wrote to tell me she was getting married.","example[42]":"Can you tell us where the nearest garage is?","display[0]":"let somebody know","definition[9]":"to tell someone something when you know more about it","example[43]":"Let me know your new address as soon as you can.","example[44]":"Let us know what happens at the interview.","display[1]":"pass a message on to somebody","definition[10]":"to tell another person the information that has been told to you","example[45]":"She’s with a client at the moment, but I’ll pass the message on to her.","example[46]":"If I get any news, I’ll pass it on.","definition[11]":"to give someone all the necessary information about a situation, so that they can do their work","example[47]":"Police officers were briefed before going out to arrest the suspects.","display[2]":"relate","definition[12]":"to tell someone about something that happened to you or to someone else","example[48]":"One girl related a story about a friend who had accidentally become pregnant.","display[3]":"recount","definition[13]":"to tell someone about a series of events","example[49]":"The guide recounted the history of the castle, from the 1300s onwards.","display[4]":"bring something to somebody’s attention","definition[14]":"to tell someone about something that they did not know about, but which they need to know about","example[50]":"I wanted to bring the matter to your attention.","example[51]":"She was the first person to study the effects of pesticides, and to bring them to people’s attention.","display[5]":"fill somebody in","definition[15]":"to tell someone about things that have happened recently, especially at work","example[52]":"Can you fill Robert in on the progress we’ve made while he’s been on holiday?","heading[1]":"to officially tell someone","display[6]":"inform","definition[16]":"to officially tell someone about something","example[53]":"Do you think we ought to inform the police?","example[54]":"Doctors should inform patients about the possible side effects of any drugs they prescribe.","display[7]":"announce","definition[17]":"to tell people publicly and officially about something","example[55]":"The university chancellor announced his resignation on Friday.","example[56]":"It was announced that the company had made a profit of $6 billion.","display[8]":"report","definition[18]":"to officially tell someone about something that has happened","example[57]":"She was able to report that the project was nearly finished.","display[9]":"notify","definition[19]":"to tell someone officially about something that has happened or that is planned to happen","example[58]":"Staff were notified several months in advance that they would be losing their jobs."}