{"word[0]":"passage","signpost[0]":"in a building","definition[0]":"a long narrow area with walls on either side which connects one room or place to another","example[0]":"My office is just along the passage.","example[1]":"We walked down a narrow passage to the back of the building.","example[2]":"an underground passage","signpost[1]":"from a book etc","definition[1]":"a short part of a book, poem, speech, piece of music etc","example[3]":"He read out a short passage from the Bible.","note[0]":"passage from/of","definition[2]":"the movement of people or vehicles along a road or across an area of land","example[4]":"Both sides agreed to allow the free passage of medical supplies into the area.","example[5]":"He was guaranteed safe passage out of the country.","example[6]":"The bridge isn’t strong enough to allow the passage of heavy vehicles.","note[1]":"passage of","signpost[2]":"of a law","definition[3]":"when a new law is discussed and accepted by a parliament or Congress","example[7]":"They are expecting the new legislation to have quite a rough passage  (=be discussed and criticized a lot) through Parliament.","example[8]":"The bill was amended several times during its passage through Congress.","note[2]":"passage through","definition[4]":"a journey on a ship","example[9]":"My parents couldn’t afford the passage to America.","note[3]":"passage to","signpost[3]":"inside somebody’s body","definition[5]":"a tube in your body that air or liquid can pass through","example[10]":"the nasal passages","signpost[4]":"way through","definition[6]":"a way through something","example[11]":"The police forced a passage through the crowd.","example[12]":"A narrow passage led to a small room at the back of the house.","example[13]":"He groped his way along the dark passage.","collocation[0]":"an underground/subterranean passage","example[14]":"The air in these underground passages is cold and damp.","collocation[1]":"a secret passage","example[15]":"The bookcase moved to reveal a secret passage.","collocation[2]":"a maze of passages","example[16]":"We wandered through a maze of passages.","definition[7]":"the progress of a law, bill etc through parliament before it takes effect","example[17]":"A month after its passage, Italy’s insider-trading law is continuing to stir debate.","example[18]":"One result of the oil crisis could be a slowdown in the passage of a tougher Clean Air Act."}