{"definition[0]":"an arrangement or promise to do something, made by two or more people, companies, organizations etc","example[0]":"They had made an agreement that they would share the profits equally.","note[0]":"agreement that","example[1]":"Haydon came to an agreement with his creditors.","note[1]":"agreement with","example[2]":"an agreement on arms reduction","note[2]":"agreement on","example[3]":"Under the agreement, most agricultural prices will remain at the same level.","note[3]":"under an agreement","definition[1]":"when people have the same opinion as each other","opposite[0]":"disagreement","example[4]":"It is easier for two parties to reach agreement than for three.","example[5]":"There is general agreement that copyright is a good idea.","example[6]":"There is widespread agreement on the need for prison reform.","example[7]":"A decision will not be made until everyone is in agreement.","note[4]":"be in agreement","definition[2]":"when someone says yes to an idea, plan, suggestion etc","example[8]":"Would their discussion result in his agreement to visit his stepmother?","note[5]":"agreement to do something","example[9]":"Such arrangements cannot be altered without the agreement of the bank.","note[6]":"agreement of","definition[3]":"an official document that people sign to show that they have agreed to something","example[10]":"Please read the agreement and sign it.","example[11]":"a hire purchase agreement","collocation[0]":"make an agreement","example[12]":"We made an agreement not to tell anyone.","collocation[1]":"sign an agreement","example[13]":"The two countries have signed an agreement on military co-operation.","collocation[2]":"have an agreement","example[14]":"They have an agreement that all workers should be union members.","collocation[3]":"reach/come to an agreement","example[15]":"It took the two sides several weeks to reach an agreement.","example[16]":"The two sides failed to come to an agreement.","collocation[4]":"break/violate an agreement","example[17]":"The UN accused the country's leaders of breaking international agreements.","collocation[5]":"keep/honour an agreement","example[18]":"It’s important to keep to your student loan agreement.","collocation[6]":"go back on an agreement","example[19]":"Republican leaders accused Democrats of trying to renege on an agreement to have a House vote.","collocation[7]":"be bound by an agreement","example[20]":"India is bound by the agreements signed under the World Trade Organisation.","collocation[8]":"negotiate an agreement","example[21]":"They have been trying to negotiate an agreement with a Chinese company.","collocation[9]":"hammer out an agreement","example[22]":"Traders are focused on Washington, where Republicans and Democrats are hammering out an agreement to balance the federal budget.","collocation[10]":"draft an agreement","example[23]":"The legal team will draft a second agreement incorporating these changes.","collocation[11]":"broker an agreement","example[24]":"The US has been trying to broker an agreement between the Israelis and the Palestinians.","collocation[12]":"enter into an agreement","example[25]":"In 2006 the city authorities entered into an agreement with a private firm to operate the gardens.","collocation[13]":"finalize an agreement","example[26]":"The developer hopes to finalise an agreement this week with the local authority.","collocation[14]":"an agreement breaks down","form[0]":"ADJECTIVES/NOUN + agreement","collocation[15]":"a written agreement","example[27]":"There is usually a written agreement between the borrower and the bank.","collocation[16]":"a verbal agreement","example[28]":"The doctor needs to have a verbal agreement from the patient.","collocation[17]":"a trade agreement","example[29]":"The administration has signed a multi-billion dollar trade agreement with Colombia.","collocation[18]":"a legal agreement","example[30]":"The golf club is also offering to enter into a legal agreement with local residents.","collocation[19]":"a binding agreement","example[31]":"Lawyers are in the process of drafting a legally binding agreement between both parties.","collocation[20]":"a formal/informal agreement","collocation[21]":"a peace agreement","example[32]":"The five countries in the region signed a peace agreement.","collocation[22]":"a ceasefire agreement","example[33]":"A ceasefire agreement was signed between the government and the rebels.","collocation[23]":"an international agreement","example[34]":"an international agreement on combating climate change","collocation[24]":"a multilateral agreement","example[35]":"a multilateral nuclear arms agreement","collocation[25]":"a bilateral agreement","example[36]":"a bilateral agreement between the UK and Korean governments","collocation[26]":"a draft agreement","example[37]":"The government of Iraq refused to accept the wording of the draft UN agreement.","collocation[27]":"a gentleman’s agreement","example[38]":"The candidates seemed to have a gentleman’s agreement not to criticize each other.","collocation[28]":"the terms of an agreement","example[39]":"Under the terms of the agreement, the debt would be repaid over a 20-year period.","collocation[29]":"a breach of an agreement","example[40]":"Both sides were accusing each other of breaches of the agreement.","collocation[30]":"be close to an agreement","example[41]":"Management and unions are close to an agreement about pay.","definition[4]":"an arrangement or promise to do something, made by two or more people or organizations","example[42]":"Under the agreement, the company will distribute our products in North America.","example[43]":"What happens if the warring parties fail to reach an agreement?"}