{"signpost[0]":"way somebody/something looks","definition[0]":"the way someone or something looks to other people","example[0]":"He was always criticising his wife’s appearance.","example[1]":"We are often attracted to somebody first by their physical appearance.","example[2]":"Women, in general, tend to be more concerned than men about their personal appearance.","example[3]":"She had an outward appearance of calm, but deep down she was really worried.","example[4]":"The metal posts spoiled the appearance of the garden.","example[5]":"A garnish helps to enhance the appearance of any dish.","example[6]":"She’s the kind of woman who takes pride in her appearance.","example[7]":"You shouldn’t judge by appearances.","example[8]":"They work hard at school without giving the appearance of being particularly hard-working.","example[9]":"The case had all the appearances of a straightforward murder.","example[10]":"The pupils looked angelic – but appearances can be deceptive.","example[11]":"He was, to all appearances, a respectable, successful businessman.","example[12]":"They’ve changed the appearance of the whole building.","note[0]":"appearance of","signpost[1]":"somebody takes part in a public event","definition[1]":"when a famous person takes part in a film, concert, or other public event","note[1]":"appearance money/fee (=money paid to a famous person to attend an event)","example[13]":"It was his first public appearance since the election.","example[14]":"He made his last appearance for the club in the Cup Final.","signpost[2]":"something new starts to exist","definition[2]":"when something new begins to exist or starts being used","example[15]":"The industry has changed greatly with the appearance of new technologies.","example[16]":"the appearance of buds on the trees","signpost[3]":"arrival","definition[3]":"the unexpected or sudden arrival of someone or something","example[17]":"Eileen was deep in concentration, and the sudden appearance of her daughter startled her.","signpost[4]":"at a law court/meeting","definition[4]":"an occasion when someone goes to a court of law or official meeting to give information, answer questions etc","example[18]":"He is due to make another court appearance on Monday.","heading[0]":"– Meaning 1: the way someone or something looks to other people","collocation[0]":"somebody's/something's physical appearance","example[19]":"If you want to improve your physical appearance, eat well and exercise.","collocation[1]":"somebody's personal appearance","example[20]":"Teenagers are very conscious of their personal appearance.","collocation[2]":"somebody's/something's odd/strange appearance","example[21]":"Children sometimes stared at him because of his odd appearance.","collocation[3]":"a distinctive/striking appearance","example[22]":"The unusual leaves give the plant a distinctive appearance.","collocation[4]":"an attractive/handsome/pleasing etc appearance","example[23]":"Large blue eyes set in a long thin face give him a striking and attractive appearance.","collocation[5]":"somebody's youthful appearance","example[24]":"She was no longer a young woman, despite her youthful appearance.","collocation[6]":"the outward appearance","example[25]":"Beneath the outward appearance of confidence, she is very shy.","collocation[7]":"the general/overall appearance","example[26]":"The second phase of the project is to improve the town’s overall appearance.","collocation[8]":"the visual appearance","example[27]":"Intensive farming changed the visual appearance of the countryside.","collocation[9]":"have a ... appearance","example[28]":"The young girl had a pleasing appearance.","collocation[10]":"improve/enhance the appearance of something/somebody","example[29]":"Fresh air improves the appearance of the skin.","collocation[11]":"change/alter the appearance of something","example[30]":"The proposed dam will change the appearance of the surrounding countryside enormously.","collocation[12]":"give something/somebody a … appearance","example[31]":"His uniform gave him an official appearance.","collocation[13]":"take pride in your appearance","example[32]":"She seems to take no pride at all in her personal appearance these days.","collocation[14]":"judge by appearances","heading[1]":"– Meaning 2: when a famous person takes part in a film, concert, or other public event","form[0]":"ADJECTIVES/NOUN + appearance","collocation[15]":"somebody's first/second/last etc appearance","example[33]":"This is the band's last appearance in the UK before a 46-date tour of Europe.","collocation[16]":"a public appearance","example[34]":"In his first public appearance since his election, the president-elect ruled out talks with the United States.","collocation[17]":"a radio/TV appearance","example[35]":"John hated the endless TV appearances to promote each new album.","collocation[18]":"a guest appearance","example[36]":"He made several guest appearances on the show in the 1960s.","collocation[19]":"a cameo appearance","example[37]":"Alfred Hitchcock always made a cameo appearance in his own films.","collocation[20]":"a personal appearance","example[38]":"The First Lady is asked to make a large number of personal appearances for worthy causes.","collocation[21]":"a live appearance","example[39]":"Troy's first live appearance was at last year's Montreux Jazz Festival.","collocation[22]":"a Wembley/Hollywood Bowl etc appearance","example[40]":"He led the Broncos to three Super Bowl appearances in twelve years.","collocation[23]":"a farewell appearance","example[41]":"His farewell appearance for the club was made in front of a packed crowd.","collocation[24]":"make an appearance","example[42]":"The president made a dramatic appearance on nationwide television to announce a fresh peace initiative.","form[1]":"appearance + NOUN","collocation[25]":"appearance fee/money","example[43]":"He gave his appearance fee to charity.","example[44]":"She’d had plastic surgery to change her appearance.","example[45]":"The mushrooms are similar in appearance to poisonous ones, so you have to be careful.","display[0]":"looks","definition[5]":"someone’s appearance, especially when considering how good-looking they are. Looks is more informal than appearance","example[46]":"Girls of that age are always worried about their looks.","example[47]":"People generally describe him as having boyish good looks.","display[1]":"image","definition[6]":"the appearance and character that a person, organization, product etc deliberately tries to produce","example[48]":"She wowed fans with her sleek new image.","example[49]":"The scandal has damaged her image as an honest politician.","example[50]":"The car has a racy new image.","display[2]":"aspect","definition[7]":"the appearance of someone or something","example[51]":"The costume gives his character an even more sinister aspect."}