{"word[0]":"structure","definition[0]":"the way in which the parts of something are connected with each other and form a whole, or the thing that these parts make up","example[0]":"challenges to the existing power structure","example[1]":"A new management structure has been introduced.","example[2]":"molecular structures","example[3]":"the social structure of organizations","note[0]":"social/political/economic etc structure","example[4]":"the structure of the brain","note[1]":"structure of","definition[1]":"something that has been built, especially something large such as a building or a bridge","example[5]":"a high wooden structure with a curved roof","definition[2]":"a situation where activities are carefully organized and planned","example[6]":"These kids require a lot of structure and stability.","form[0]":"ADJECTIVES/NOUN + structure","collocation[0]":"social/political/economic structure","example[7]":"Many changes had taken place in the social and political structure of the island.","collocation[1]":"class structure","example[8]":"Britain had a very rigid class structure.","collocation[2]":"power structure","example[9]":"He was a critic of the country’s power structure.","collocation[3]":"management structure","example[10]":"Reform of the management structure was needed.","collocation[4]":"career structure","example[11]":"Teachers now have a proper career structure.","collocation[5]":"basic structure","example[12]":"These genes are involved in determining the basic structure of cells.","collocation[6]":"internal structure","example[13]":"Scientists have been investigating the internal structure of the planet Mars.","collocation[7]":"molecular structure","example[14]":"The book tells of the race to find the molecular structure of DNA.","definition[3]":"to arrange the different parts of something into a pattern or system in which each part is connected to the others","synonym[0]":"organize","example[15]":"The exhibition is structured around three topics.","example[16]":"software that helps users structure their work and their data","definition[4]":"the way an organization, system, market etc is organized or put together","example[17]":"Mr. Reed has set a course that ultimately will dismantle much of the bank’s huge bureaucratic structure.","example[18]":"a complex structure of affiliated companies"}