{"word[0]":"decide","definition[0]":"to make a choice or judgment about something, especially after considering all the possibilities or arguments","example[0]":"Has anything been decided yet?","example[1]":"The trainees decide among themselves what programs to take.","example[2]":"Tina’s decided to go to Rome for her holidays.","note[0]":"decide to do something","example[3]":"It was decided that four hospitals should close.","note[1]":"decide (that)","example[4]":"I can’t decide whether I like him or not.","note[2]":"decide who/what/whether etc","example[5]":"People have a right to decide how to spend their own money.","example[6]":"A meeting was called to decide between the three candidates.","note[3]":"decide between something","example[7]":"You must decide for yourself.","note[4]":"decide for yourself","example[8]":"He eventually decided against telling her.","note[5]":"decide against/in favour of (doing) something","example[9]":"After a long discussion, they decided in favour of  (=chose) the older applicant.","explanation[0]":"In more formal English, you can say it is decided that something should be done","example[10]":"It was decided that he should resign","definition[1]":"to influence a situation or event so that a particular result is produced","example[11]":"It was the penalty kick that decided the match.","definition[2]":"to be the reason for someone making a particular choice","example[12]":"Taxes could be the deciding factor for millions of floating voters.","example[13]":"The look he gave her decided her not to ask.","note[6]":"decide somebody to do something","definition[3]":"to make an official or legal judgment","example[14]":"The Commission will have the power to decide disputes.","example[15]":"If the Parole Board decides in his favour, the prisoner will be released.","note[7]":"decide in favour of/against somebody","definition[4]":"to make a choice to do something","example[16]":"We decided to send our son to a boarding school.","example[17]":"I decided to go home early.","display[0]":"make up your mind","definition[5]":"to decide something, especially after thinking about it for a long time. Make up your mind is less formal than decide and is mainly used in spoken English","example[18]":"Have you made up your mind about where you’ll go on holiday?","display[1]":"choose to do something","definition[6]":"to decide to do something – especially when this is different from what people expect or tell you to do","example[19]":"She chose to ignore my advice.","example[20]":"More young couples are choosing not to marry.","display[2]":"make a decision","definition[7]":"to decide after thinking carefully about something, especially about something that is very important","example[21]":"They made a decision not to have children.","display[3]":"resolve","definition[8]":"to decide that you will definitely do something, especially because you think it will be better for you, or because of your past experiences","example[22]":"She resolved to work hard at school.","display[4]":"determine","definition[9]":"to officially decide what something shall be","example[23]":"Each hospital can determine its own pay rates.","display[5]":"come down in favour of something","definition[10]":"to decide to support a particular plan, argument etc – used especially about groups of people","example[24]":"Eight of the ten committee members came down in favour of the changes.","display[6]":"come to/reach a decision","definition[11]":"to officially decide about something important after discussing and carefully considering it – used especially about groups of people","example[25]":"After two hours of discussion, the committee had still not come to a decision on any of the proposals."}