{"comparative[0]":"rarer","superlative[0]":"rarest","definition[0]":"not seen or found very often, or not happening very often","opposite[0]":"common","example[0]":"This species of plant is becoming increasingly rare.","example[1]":"I only saw Helen on the rare occasions when I went into her shop.","example[2]":"It is rare to find such an interesting group of people.","note[0]":"it is rare (for somebody/something) to do something","example[3]":"It is very rare for her to miss a day at school.","definition[1]":"meat that is rare has only been cooked for a short time and is still red","example[4]":"I like my steak rare.","definition[2]":"very good or surprising","example[5]":"We had a rare old time at the party.","definition[3]":"not existing in large numbers or in large amounts","example[6]":"The law prevents the export of rare birds.","example[7]":"The plates are quite rare. Only about a hundred were made.","display[0]":"scarce","definition[4]":"not available in large enough numbers or amounts at a particular time – used especially about things people need","example[8]":"After the war, food and clothing were scarce.","example[9]":"People are having to compete for scarce resources.","display[1]":"not common","definition[5]":"fairly rare","example[10]":"Silver coins of this period are not common, and could be very valuable.","display[2]":"infrequent","definition[6]":"not happening often","example[11]":"As time went on, her visits became more and more infrequent.","display[3]":"be few and far between","definition[7]":"to not be common – especially much less common than you might expect","example[12]":"Luckily, accidents such as these are few and far between.","example[13]":"Bargains are, unfortunately, few and far between.","display[4]":"be (something of) a rarity","definition[8]":"if something or someone  is a rarity, it is surprising to find one, because very few exist","example[14]":"Women are still something of a rarity in senior management positions.","display[5]":"be like hen’s teeth","definition[9]":"to be extremely rare","example[15]":"Good Greek restaurants are like hen’s teeth around here."}