{"word[0]":"wire","definition[0]":"thin metal in the form of a thread, or a piece of this","example[0]":"copper wire","example[1]":"a wire fence","definition[1]":"a piece of metal like this, used for carrying electrical currents or signals","example[2]":"a telephone wire","definition[2]":"a piece of electronic recording equipment, usually worn secretly on someone’s clothes","definition[3]":"a telegram","form[0]":"ADJECTIVES/NOUN + wire","collocation[0]":"fine/thin","example[3]":"Use a piece of fine wire to clear the obstruction.","example[4]":"Curtains hung from a thick wire.","collocation[1]":"copper/steel wire","example[5]":"Electrical impulses are sent down the copper wire.","collocation[2]":"barbed wire","example[6]":"The prison was surrounded by barbed wire.","form[1]":"wire + NOUN","example[7]":"We drew up outside a compound surrounded by a wire fence.","collocation[3]":"a wire rack","example[8]":"Bake the biscuits for 10 minutes until golden. Cool on a wire rack.","collocation[4]":"a piece/length/strand of wire","example[9]":"The pieces of wire he’d cut were too short.","collocation[5]":"a coil of wire","example[10]":"The coil of barbed wire will be used for a fence.","collocation[6]":"a loop of wire","example[11]":"There is no latch or knob – just a loop of wire that goes over a nail.","definition[4]":"to connect wires inside a building or piece of equipment so that electricity can pass through","example[12]":"Check that the plug has been wired up properly.","definition[5]":"to connect electrical equipment to the electrical system using wires","example[13]":"The CD player had been wired up to the car’s cigarette lighter.","note[0]":"wire something to something","definition[6]":"to send money electronically","definition[7]":"to attach a piece of recording equipment to a person or room, especially secretly","definition[8]":"to send a telegram to someone","definition[9]":"to fasten two or more things together using wire","example[14]":"The poles had all been wired together.","note[1]":"wire something together","definition[10]":"to send money electronically from one bank to another","example[15]":"Prosecutors said Burks moved $45,000 to his girlfriend and wired $13,300 to a bank account in Florida.","definition[11]":"to connect something to a computer system or another piece of equipment","example[16]":"Her laptop is wired up to a router, and the other computers in the house run on wireless adaptors."}