{"word[0]":"turn","signpost[0]":"your body","definition[0]":"to move your body so that you are looking in a different direction","example[0]":"Ricky turned and walked away.","example[1]":"She turned her head in surprise.","example[2]":"Brigitte glared at him, turned on her heel (=turned away suddenly because of anger), and stomped out of the room.","example[3]":"Dan turned away, hiding the fear in his eyes.","note[0]":"turn around/round/away","example[4]":"He turned around to look at Kim.","note[1]":"turn (your head/face) to do something","example[5]":"‘No, ’ she said, turning her head to see David’s reaction.","type[0]":"transitive usually + adverb/preposition","definition[1]":"to move something so that it is pointing or aiming in a different direction","note[2]":"turn a/the page (=move a page in a book over so that you can read the next page)","example[6]":"Could you turn your chairs to face this way?","note[3]":"turn something to face something/somebody","example[7]":"You may turn over your exam papers now.","note[4]":"turn something around/over/upside down etc","example[8]":"The firemen turned their hoses on the blaze.","note[5]":"turn something on something/somebody","example[9]":"He turned down the corner of the sheet to peep at the baby.","note[6]":"turn something down/up","definition[2]":"to go in a new direction when you are walking, driving etc, or to make the vehicle you are using do this","example[10]":"I watched until he turned the corner.","example[11]":"Turn left at the church.","note[7]":"turn left/right","example[12]":"She cycled up the street and turned into Long Road.","note[8]":"turn into/onto/down etc","example[13]":"Turning the car around, we headed home.","definition[3]":"if a road, river etc turns, it curves and starts to go in a new direction","example[14]":"Further on, the river turns east.","example[15]":"The road turns sharply at the top of the hill.","signpost[1]":"move around central point","definition[4]":"to move around a central or fixed point, or to make something move in this way","example[16]":"The wheels turned slowly, then picked up speed.","example[17]":"For some reason, the key wouldn’t turn.","example[18]":"She gently turned the handle of the bedroom door.","note[9]":"turn the handle/knob/key/tap etc","type[1]":"linking verb, transitive","definition[5]":"to start to have a different quality, or to make something do this","example[19]":"Rose’s hair was already turning grey.","note[10]":"turn (something) red/blue/white etc","example[20]":"In October the leaves turn orange and yellow.","example[21]":"The sun had turned the sky a glowing pink.","example[22]":"Then it turned cold and started to rain.","note[11]":"the weather turns cold/nasty etc","example[23]":"The police are worried that the situation could turn violent.","note[12]":"turn nasty/mean/violent etc","explanation[0]":"Turn is a linking verb in this meaning It links the subject of the sentence with an adjective","example[24]":"His face turned pale","example[25]":"Their relationship turned sour","signpost[2]":"attention/thoughts","definition[6]":"to start to think about, deal with, look at etc a particular person, thing, or subject, instead of what you were thinking about etc before","example[26]":"Many investors have turned their attention to opportunities abroad.","note[13]":"turn your attention/thoughts/efforts etc to something/somebody","example[27]":"Phil turned his gaze towards the older man.","example[28]":"As usual, the conversation turned back to her children.","note[14]":"turn to/towards etc something","example[29]":"Now is the time of year when thoughts turn in the direction of summer holidays.","example[30]":"Next the Senator turned to education.","signpost[3]":"age/time","definition[7]":"to become a particular age, or to reach a particular time","example[31]":"My son’s just turned 18.","note[15]":"somebody turns 15/20/40 etc","example[32]":"It’s just turned three.","note[16]":"it’s turned 2 o'clock/5/midday etc","signpost[4]":"make/let go out","definition[8]":"to make or let someone or something go out from where they are","example[33]":"Turn the dough out onto a lightly floured board.","note[17]":"turn somebody/something out/outside/into etc (something)","example[34]":"There are some criminals who cannot be turned loose onto the streets.","signpost[5]":"tide","definition[9]":"if the tide turns, the sea starts to come in or go out again","signpost[6]":"change development","definition[10]":"if something such as a war, situation, game of sport etc turns, or someone turns it, something happens to change the way it is developing","example[35]":"Mills turned the game by scoring twice.","example[36]":"The victory turned the tide of the war in North Africa.","definition[11]":"to break up soil so that it is ready for growing crops","example[37]":"a distant tractor turning the soil","signpost[7]":"wood/metal","definition[12]":"to shape a wooden or metal object using a special tool","signpost[8]":"milk","definition[13]":"if milk turns, it becomes sour","definition[14]":"to move around a central or fixed point","example[38]":"The wheels of the train began to turn.","display[0]":"go around","definition[15]":"to turn around a central point. Go around is a little more informal than turn and is very common in everyday English","example[39]":"When the fan goes around, the warm air is pushed back downwards.","display[1]":"revolve/rotate","definition[16]":"to turn around and around a central point. Rotate and revolve are more formal than turn and sound more technical","example[40]":"The Earth rotates on its axis once every twenty-four hours.","example[41]":"The stage revolves at various points during the performance.","display[2]":"spin","definition[17]":"to turn around many times very quickly","example[42]":"The ice skater began to spin faster and faster.","display[3]":"whirl","definition[18]":"to spin around extremely quickly, often in a powerful or uncontrolled way","example[43]":"The blades of the helicopter whirled overhead.","display[4]":"twirl (around)","definition[19]":"to spin around quickly, especially as part of a dance or performance","example[44]":"The couples were twirling around on the dance floor.","display[5]":"swirl (around)","definition[20]":"to move around quickly in a circular movement, especially when the movement goes outwards or upwards from the center","example[45]":"Her white skirt swirled around her legs as she danced.","example[46]":"The leaves began to swirl around.","display[6]":"spiral","definition[21]":"to move in a continuous curve that gets nearer to or further from its central point as it goes around","example[47]":"The smoke spiralled toward the ceiling.","signpost[9]":"chance to do something","definition[22]":"the time when it is your chance, duty, or right to do something that each person in a group is doing one after the other","example[48]":"It’s your turn. Roll the dice.","example[49]":"I think it’s our turn to drive the kids to school this week.","example[50]":"Whose turn is it to set the table?","note[18]":"turn to do something","explanation[1]":"In everyday English, people often say that it is someone’s go in a game rather than turn:","example[51]":"Whose go is it now?","example[52]":"Wait until it’s your go.","definition[23]":"a place where one road goes in a different direction from the one you are on","example[53]":"According to the map we missed our turn back there.","example[54]":"I think we took a wrong turn coming out of town.","note[19]":"take the first/a wrong etc turn","example[55]":"Take the second turn on the left.","definition[24]":"a curve in a road, path etc","example[56]":"There’s a sharp turn coming up ahead.","signpost[10]":"change direction","definition[25]":"a change in the direction you are moving","example[57]":"Make a left turn at the station.","note[20]":"make a left/right turn","signpost[11]":"change in events","definition[26]":"a sudden or unexpected change that makes a situation develop in a different way","example[58]":"From then on, our fortunes took a downward turn.","note[21]":"take a dramatic/fresh/different etc turn","example[59]":"My career had already taken a new turn.","example[60]":"The president was stunned by the sudden turn of events.","example[61]":"Two days after the operation, Dad took a turn for the worse.","note[22]":"take a turn for the worse/better","signpost[12]":"act of turning something","definition[27]":"the act of turning something completely around a fixed point","example[62]":"I gave the screw another two or three turns.","definition[28]":"the difference between the price at which a MARKETMAKER will buy and sell a particular share","synonym[0]":"SPREAD","definition[29]":"if something takes a particular turn, it starts developing in a completely different way","example[63]":"Things may take a bad turn and the economic situation may deteriorate.","example[64]":"The economy seems to be taking a turn for the worse (=suddenly becoming worse).","definition[30]":"to make a profit","example[65]":"The China operation has just started turning a profit."}