{"word[0]":"goods","definition[0]":"things that are produced in order to be sold","example[0]":"the large market for consumer goods (=televisions, washing machines etc)","example[1]":"Britain’s leading exporter of manufactured goods (=things that are made, not grown)","example[2]":"There will be tax increases on a range of goods and services.","example[3]":"furniture and other household goods","note[0]":"electrical/industrial/agricultural etc goods","definition[1]":"things that someone owns and that can be moved","example[4]":"They were charged with handling stolen goods.","example[5]":"We collected up our goods and left.","definition[2]":"things which are carried by road, train etc","synonym[0]":"freight","example[6]":"a goods train","form[0]":"ADJECTIVES/NOUN + goods","collocation[0]":"electrical goods","example[7]":"Today's shoppers are spending more money on mobile phones and electrical goods than on clothing.","collocation[1]":"household goods","example[8]":"Household goods are downstairs in the basement.","collocation[2]":"consumer goods","example[9]":"The market for consumer goods is huge.","collocation[3]":"manufactured goods","example[10]":"Imports of manufactured goods have increased rapidly.","collocation[4]":"industrial goods","example[11]":"machinery and other industrial goods","collocation[5]":"agricultural goods","example[12]":"The United States became a major exporter of agricultural goods.","collocation[6]":"luxury goods","example[13]":"The new industrial middle classes began to demand luxury goods.","collocation[7]":"duty-free goods","example[14]":"What is the permitted amount of duty-free goods?","collocation[8]":"white goods","example[15]":"The house is unfurnished, except for white goods.","collocation[9]":"brown goods","example[16]":"The company has 22 percent of the total market for brown goods.","collocation[10]":"perishable goods","example[17]":"Perishable goods are transported in refrigerated trucks.","collocation[11]":"faulty goods","example[18]":"Consumers have a right to reasonable protection against the sale of faulty goods.","collocation[12]":"stolen goods","example[19]":"The police charged him with handling stolen goods.","collocation[13]":"counterfeit goods","example[20]":"Counterfeit goods will be seized and traders will face prosecution.","collocation[14]":"somebody’s worldly goods","example[21]":"All his worldly goods fit in four packing cases.","collocation[15]":"goods and services","example[22]":"The company provides a range of specialized goods and services.","collocation[16]":"produce goods","example[23]":"The company started a factory in Singapore, to produce goods for export.","collocation[17]":"manufacture goods","example[24]":"Local industries were created to manufacture goods that were previously imported.","collocation[18]":"import goods","example[25]":"Western Europe is the world’s second largest market for imported goods.","collocation[19]":"export goods","example[26]":"The company exports Thai goods to Europe.","collocation[20]":"supply goods","example[27]":"On 3 September he supplied goods to the hotel valued at £350.00.","definition[3]":"things that are produced in order to be used or sold","example[28]":"North Korea has no hard currency reserves to buy goods.","example[29]":"The strike is expected to delay payments to companies that sell goods to the government.","example[30]":"Suppliers have refused to ship goods since the company filed for bankruptcy last month.","example[31]":"If Mexico develops its economy, it will export goods and not its workers.","example[32]":"Manaus became a free-trade zone where companies could freely import goods and components.","definition[4]":"heavy things that are carried by road, train etc","synonym[1]":"FREIGHT","example[33]":"The report criticises the transport industry for the distances over which goods are moved by road."}