{"word[0]":"mission","signpost[0]":"air force/army etc","definition[0]":"an important job that involves travelling somewhere, done by a member of the air force, army etc, or by a spacecraft","example[0]":"He was sent on over 200 missions before being killed in action.","example[1]":"US troops taking part in the peacekeeping mission","example[2]":"the first manned space mission to Mars","note[0]":"mission to","definition[1]":"an important job that someone has been given to do, especially when they are sent to another place","example[3]":"Her mission was to improve staff morale.","example[4]":"a group of US congressmen on a fact-finding mission to Northern Ireland","note[1]":"rescue/diplomatic/fact-finding etc mission","example[5]":"scientists on a mission to the rainforest, to study possible medicinal uses of plants","note[2]":"on a mission","signpost[1]":"duty","definition[2]":"something that you feel you must do because it is your duty","synonym[0]":"calling","example[6]":"Tom’s mission was to help young people in his local community.","example[7]":"His main mission in life is to earn as much money as possible.","signpost[2]":"purpose","definition[3]":"the purpose or the most important aim of an organization","example[8]":"The mission of International House is to enable students of different cultures to live together and build life-long friendships.","definition[4]":"a group of important people who are sent by their government to another country to discuss something or collect information","synonym[1]":"delegation","example[9]":"a British trade mission to Moscow","definition[5]":"religious work that involves going to a foreign country in order to teach people about Christianity or help poor people","definition[6]":"a building where this kind of work is done, or the people who work there","definition[7]":"an important job that someone is given to do","example[10]":"Her mission was to improve staff morale and output.","definition[8]":"the aim of a company or organization","example[11]":"Our mission is to provide quality long-term care to the maximum number of patients.","definition[9]":"a trip that a group of people are sent on, for example in order to collect information","example[12]":"He has just been on a fact-finding mission to China.","definition[10]":"a group of people who are sent by their government or an important organization to another country to collect information, have discussions etc","example[13]":"The UN has sent a mission to the area."}