{"word[0]":"combine","definition[0]":"if you combine two or more different things, or if they combine, they begin to exist or work together","example[0]":"Ruth hesitated, uncertain of how to combine honesty and diplomacy in her answer.","example[1]":"The combined effects of the war and the drought resulted in famine.","note[0]":"combined effect/effects","example[2]":"Augustine was later to combine elements of this philosophy with the teachings of Christianity.","note[1]":"combine something with something","example[3]":"Diets are most effective when combined with exercise.","example[4]":"A number of factors have combined to create this difficult situation.","note[2]":"combine to do something","definition[1]":"to have two or more different features or qualities at the same time","example[5]":"Good carpet wool needs to combine softness with strength.","note[3]":"combine something with/and something","definition[2]":"if two or more different substances combine, or if you combine them, they mix or join together to produce a new single substance","example[6]":"Combine all the ingredients in a large bowl.","example[7]":"Different amino acids combine to form proteins.","example[8]":"Steel is produced by combining iron with carbon.","definition[3]":"to do two different activities at the same time","note[4]":"combine business with pleasure (=work and enjoy yourself at the same time)","example[9]":"Many people enjoy combining a holiday with learning a new skill.","example[10]":"the problems facing women who wish to combine a career and family","note[5]":"combine something and something","definition[4]":"if two or more groups, organizations etc combine, or if you combine them, they join or work together in order to do something","example[11]":"University zoologists and government vets are combining forces  (=working together) to investigate the disease.","example[12]":"Ten British and French companies combined to form the Channel Tunnel Group.","definition[5]":"a machine used by farmers to cut grain, separate the seeds from it, and clean it","definition[6]":"a group of people, businesses etc who work together","example[13]":"The factory was sold to a British combine after the war.","definition[7]":"if two or more groups or organizations combine, or if you combine them, they join together","example[14]":"They said they expect no job losses from combining their operations.","example[15]":"Two old established practices combined to form The Anthony Clark Partnership.","definition[8]":"an association of two or more businesses or companies that work together on a temporary or permanent basis","example[16]":"a large regional banking combine","example[17]":"There may be concern if one airline combine controls more than 25% of a relevant market."}