{"word[0]":"explanation","definition[0]":"the reasons you give for why something happened or why you did something","example[0]":"Can you think of any explanation for this failure?","note[0]":"explanation of/for","example[1]":"The concert was cancelled without explanation.","note[1]":"without explanation","definition[1]":"a statement or piece of writing intended to describe how something works or make something easier to understand","example[2]":"The ability to give clear explanations is the most important quality of the ideal teacher.","note[2]":"provide/give an explanation","example[3]":"I’ll try and give you a quick explanation of how the machine works.","note[3]":"explanation of","collocation[0]":"have an explanation","example[4]":"Does the hospital have any explanation for why he died?","collocation[1]":"give an explanation","example[5]":"The police gave no explanation for their actions.","collocation[2]":"provide/offer an explanation","example[6]":"This theory may provide an explanation for the origins of the universe.","collocation[3]":"ask for/demand an explanation","example[7]":"When I asked for an explanation, the people at the office said they didn't know.","example[8]":"Furious parents are demanding an explanation from the school.","collocation[4]":"wait for an explanation","example[9]":"She continued to stare at him in silence, waiting for an explanation.","collocation[5]":"find/think of/come up with an explanation","example[10]":"Scientists have been unable to find an explanation for this phenomenon.","collocation[6]":"owe (somebody) an explanation","example[11]":"I think you owe me some kind of explanation.","collocation[7]":"accept an explanation","example[12]":"The court accepted her explanation.","collocation[8]":"need/require an explanation","example[13]":"We think the minister’s decision requires an explanation.","collocation[9]":"a possible explanation","example[14]":"Can anyone think of a possible explanation for why this is happening?","collocation[10]":"the most likely/probable explanation","example[15]":"The most likely explanation is that John missed the bus.","example[16]":"The most probable explanation is that the water was contaminated.","collocation[11]":"an obvious explanation","example[17]":"There is no obvious explanation for his strange behaviour.","collocation[12]":"a reasonable/plausible explanation","example[18]":"Pilot error is the most plausible explanation for the crash.","collocation[13]":"a satisfactory/adequate explanation","example[19]":"A bank must offer an adequate explanation of all its charges.","collocation[14]":"a convincing/credible explanation","example[20]":"The author fails to provide a convincing explanation for the main character’s motives.","collocation[15]":"a logical/rational explanation","example[21]":"Physics finally gave us a rational explanation for the atom’s strange behaviour.","collocation[16]":"further explanation","example[22]":"He gave no further explanation for leaving, and she did not ask for any.","collocation[17]":"there is no apparent explanation","example[23]":"There was no apparent explanation for the attack."}