{"word[0]":"attention","signpost[0]":"listen/look/think carefully","definition[0]":"when you carefully listen to, look at, or think about someone or something","example[0]":"My attention wasn’t really on the game.","example[1]":"She tried to pay attention to what he was saying.","example[2]":"If you paid more attention  in class, you might actually learn something!","example[3]":"Scott sat down at his desk and turned his attention to the file he had in front of him.","example[4]":"As a society we need to give more attention to the needs of older people.","example[5]":"Now he’s gone, I can give you my undivided attention.","example[6]":"This game is fun and is sure to keep the attention of any young student.","example[7]":"They listened to the speech with close attention.","example[8]":"Attention to detail is essential in this job.","example[9]":"During the lecture Sarah’s attention began to wander.","type[0]":"plural, uncountable","signpost[1]":"interest","definition[1]":"the interest that people show in someone or something","example[10]":"She was flattered by all the attention he was giving her.","example[11]":"Rob loves being the centre of attention (=the person who everyone is interested in, listens to etc).","example[12]":"She spent a lot of time trying to avoid the attentions  (=romantic interest) of her boss.","example[13]":"The man then turned his attentions to (=became romantically interested in)  her sister.","example[14]":"a player who quickly attracted the attention of several clubs","note[0]":"attract/receive/enjoy attention","example[15]":"The exhibition received little attention in the press.","example[16]":"Her case attracted a great deal of media attention.","note[1]":"public/media/press attention","example[17]":"The book holds the reader’s attention right to the very end.","note[2]":"hold/keep somebody’s attention","definition[2]":"to make someone notice you, especially because you want to speak to them or you need their help","example[18]":"She waved to attract the attention of the waitress.","definition[3]":"to make someone notice you and be interested in what you are doing","example[19]":"Children often misbehave in order to get attention.","definition[4]":"to make people notice and be concerned or think about something","example[20]":"The purpose of the article was to draw attention to the problems faced by single parents.","example[21]":"We wanted to focus public attention on this matter.","example[22]":"He left quietly to avoid drawing attention to himself.","definition[5]":"to make people stop being concerned about something such as a social problem","example[23]":"All this talk of war is just an attempt to draw attention away from the serious economic problems that face our country.","definition[6]":"to tell someone, especially someone in authority, about something such as a problem","example[24]":"The matter was first brought to my attention earlier this year.","definition[7]":"if something such as a problem comes to the attention of someone in authority, they find out about it","example[25]":"It came to my attention that Jenny was claiming overtime pay for hours she had not worked.","definition[8]":"if something escaped your attention, you did not notice it","example[26]":"This fact had not escaped the attention of the authorities.","signpost[2]":"repair/cleaning","definition[9]":"something you do to repair or clean something","example[27]":"The bike’s in fairly good condition, but the gears need a bit of attention.","signpost[3]":"care","definition[10]":"things that you do to help or to take care of someone or something","example[28]":"Pets need a lot of care and attention.","example[29]":"Anyone who comes into contact with these chemicals should seek urgent medical attention.","example[30]":"Your plants look like they could do with a bit of attention.","collocation[0]":"pay attention to something/somebody","example[31]":"He read the final page, paying particular attention to the last paragraph.","collocation[1]":"turn your attention to something/somebody","example[32]":"She quickly put away the shopping and then turned her attention to preparing dinner.","collocation[2]":"give something/somebody your attention","example[33]":"She promised to give the matter her attention the next day.","collocation[3]":"somebody’s attention wanders","example[34]":"During the service, her mind began to wander.","collocation[4]":"somebody’s full/complete/undivided attention","example[35]":"He gave the task his undivided attention.","display[0]":"pay attention","definition[11]":"to carefully listen to, look at, or think about something or someone","example[36]":"She told the class to stop talking and pay attention.","example[37]":"In any relationship, it helps to pay attention to each other’s needs.","display[1]":"concentrate","definition[12]":"to think carefully about something that you are doing and not let other things disturb your thoughts","example[38]":"I tried to read a few pages, but I was too upset to concentrate.","example[39]":"Children need their own quiet space where they can concentrate on their homework.","display[2]":"keep your mind on something","definition[13]":"to continue to pay attention to something, especially when you are very excited or worried about something else","example[40]":"On Friday, the day of the party, I had a dreadful time keeping my mind on my work.","example[41]":"Good football players keep their minds on the game at all times.","display[3]":"keep your eyes on something","definition[14]":"to keep watching something carefully, so that you do not make any mistakes","example[42]":"The first rule of driving is to keep your eyes on the road.","example[43]":"Keep your eyes on the ball – now swing!","display[4]":"be engrossed in something","definition[15]":"to be paying so much attention to a book, a conversation, some work etc, that you do not notice what is happening around you","example[44]":"Helen was sitting up in bed, engrossed in a novel.","example[45]":"He was so engrossed in what he was doing he didn’t even hear the doorbell ring.","display[5]":"be absorbed in something","definition[16]":"to be giving all your attention to something, especially something you are reading, watching, or thinking about","example[46]":"The little boy sat at the edge of the pond, totally absorbed in watching the fish.","example[47]":"He was a quiet man who often seemed to be absorbed in his own thoughts.","example[48]":"Matilda was curled up in an armchair, absorbed in a book.","display[6]":"give something/somebody your undivided attention","definition[17]":"to give all your attention to something or someone and not do anything else – used especially when this is something you want or need to do","example[49]":"Come round when the kids are in bed so I can give you my undivided attention.","example[50]":"Once I’ve finished my exams, I’ll be able to give my undivided attention to looking for a job.","definition[18]":"used to ask people to listen to important information that is being announced, especially on a loudspeaker (=piece of equipment used to make sounds louder)","example[51]":"Attention, please! Could passenger Marie Thomas please proceed to Gate 25 immediately.","definition[19]":"used when ordering a group of soldiers to stand up straight in neat lines","definition[20]":"written on the front or at the top of a letter when you want a particular person to read it or deal with it","example[52]":"for the attention of the manager"}