{"word[0]":"instead","definition[0]":"used to say what is done, when you have just said that a particular thing is not done","example[0]":"Geoff didn’t study law. Instead, he decided to become an actor.","example[1]":"If Jo can’t attend the meeting, I could go instead.","definition[1]":"used when saying that a particular thing is used or happens and not another thing, or that someone does something and not another person","example[2]":"There were no single rooms, so I booked a double instead.","example[3]":"Chris couldn't go to the meeting, so I said that I would go instead.","example[4]":"Can I have soup instead of salad?","example[5]":"I really wished it had been me instead of him.","display[0]":"rather than","definition[2]":"instead of something or someone – often used when someone does something instead of doing another thing, because it seems better or more suitable","example[6]":"Rather than driving around all day looking for somewhere to park, why don’t you take a bus into town?","example[7]":"A lot of people are choosing to rent rather than buy their own homes.","example[8]":"I’d say it was warm rather than hot.","example[9]":"It might be better if you asked him rather than me.","display[1]":"in somebody/something’s place","definition[3]":"having the position or role that something or someone else once had","example[10]":"The factory was demolished and flats were built in its place.","example[11]":"If I refused to go, they would send someone else in my place.","display[2]":"on behalf of somebody/on somebody’s behalf","definition[4]":"instead of someone or as their representative","example[12]":"She asked the doctor to speak to her parents on her behalf.","example[13]":"He collected the award on behalf of his sister.","display[3]":"in favour of","definition[5]":"used when something is not chosen or used, because something else seems much better","example[14]":"The original plan was abandoned in favour of a new proposal.","example[15]":"She was rejected for the job in favor of a more experienced teacher.","display[4]":"in preference to","definition[6]":"used when something is chosen or used because it seems much better than something else","example[16]":"What makes customers choose one brand in preference to another?"}