{"word[0]":"courage","definition[0]":"the quality of being brave when you are facing a difficult or dangerous situation, or when you are very ill","opposite[0]":"cowardice","example[0]":"Sue showed great courage throughout her illness.","example[1]":"He did not have the courage to tell Nicola that he was ending their affair.","example[2]":"Driving again after his accident must have taken a lot of courage (=needed courage).","example[3]":"I plucked up the courage to go out by myself.","note[0]":"summon/pluck up the courage (to do something)","example[4]":"Gradually I lost the courage to speak out about anything.","note[1]":"courage to do something","collocation[0]":"have courage","example[5]":"She certainly has a lot of courage.","collocation[1]":"show courage","example[6]":"The pilot showed great skill and courage.","collocation[2]":"summon (up)/muster your courage","example[7]":"Summoning all her courage, she got up to see what the noise was.","collocation[3]":"bolster your courage","example[8]":"They sang and whistled as they marched, to bolster their courage.","collocation[4]":"somebody’s courage fails","example[9]":"I was going to jump but my courage failed at the last moment.","collocation[5]":"something gives you courage","example[10]":"My mother nodded, which gave me the courage to speak up.","collocation[6]":"have the courage to do something","example[11]":"I didn’t have the courage to say what I really thought.","collocation[7]":"find the courage to do something","example[12]":"You must find the courage to deal with the problem.","collocation[8]":"pluck up/screw up the courage to do something","example[13]":"He was trying to pluck up the courage to end their relationship.","collocation[9]":"lack the courage to do something","example[14]":"He lacked the courage to look her full in the face.","collocation[10]":"It takes courage to do something/sth takes courage","example[15]":"It takes courage to make a big change in your life like that.","collocation[11]":"great courage","example[16]":"The men had fought with great courage.","collocation[12]":"enough/sufficient courage","example[17]":"Harry plucked up enough courage to ask her out.","collocation[13]":"personal courage","example[18]":"Her recovery owed a great deal to her personal courage.","collocation[14]":"moral courage","example[19]":"He said his faith gave him the moral courage to survive his ordeal.","collocation[15]":"physical courage","example[20]":"It seemed strange that someone of great physical courage could be so unsure of himself in other ways.","collocation[16]":"political courage","example[21]":"Do our politicians have the political courage to make unpopular decisions?","example[22]":"the courage of the soldiers","example[23]":"She showed great courage throughout her illness.","example[24]":"He finally plucked up the courage (=found the courage) to ask her for a date.","display[0]":"bravery","definition[1]":"courage in a dangerous or frightening situation, especially when you are fighting in a war","example[25]":"He won a medal for bravery during the Iraq war.","display[1]":"guts","definition[2]":"the courage and determination to do something difficult or unpleasant","example[26]":"It must have taken a lot of guts for him to say that.","display[2]":"heroism","definition[3]":"very great courage in a dangerous situation","example[27]":"The president praised the heroism of the firefighters."}