{"word[0]":"round","pos[0]":"adverb, preposition","definition[0]":"surrounding or on all sides of something or someone","example[0]":"We sat round the table playing cards.","example[1]":"Gather round! I have an important announcement to make.","example[2]":"He put his arm gently round her waist.","example[3]":"I kept the key on a chain round my neck.","example[4]":"The ballroom’s huge, with windows all the way round.","example[5]":"There was a lovely courtyard with tables all round.","definition[1]":"used to say that someone or something turns so that they face in the opposite direction","example[6]":"When he turned round I recognised him immediately.","example[7]":"Graham glanced round, startled by the voice behind him.","definition[2]":"in or to many places or parts of an area","example[8]":"Reggie went round making sure all the lights were off.","example[9]":"Leah showed me round on my first day at the office.","example[10]":"A guide took us round the palace and gardens.","example[11]":"He spent a whole year travelling round Europe.","example[12]":"She looked round the room as though leaving it for the last time.","example[13]":"changes that are affecting the weather all round the world","definition[3]":"moving in a circle","example[14]":"She watched the clock hands go round.","example[15]":"An aeroplane was circling round far overhead.","example[16]":"Until the 16th century people believed that the Sun went round the Earth.","example[17]":"He stared at the washing machine, just watching the clothes go round and round.","example[18]":"a shoal of tiny fish swimming round in circles","definition[4]":"if you go round to someone’s house, you go to their house, usually to visit them","example[19]":"I might go round to Nigel’s this evening.","example[20]":"He’s invited us round for dinner.","example[21]":"We’ll be round  (=will arrive) at seven.","definition[5]":"to other people or positions","example[22]":"A big box of chocolates was handed round.","example[23]":"He’d moved his furniture round.","definition[6]":"on the other side of something, or to the other side of it without going through it or over it","example[24]":"He ran round to open Kate’s door for her.","example[25]":"There must be another entrance round the back.","example[26]":"I watched the two boys disappear round the corner.","example[27]":"She came round to his side of the desk.","note[0]":"round to","definition[7]":"in the area near a particular place","example[28]":"Much of the countryside round Hinkley Point is given over to agriculture.","example[29]":"Do you live round here?","example[30]":"He owned all the land round about (=in the surrounding area).","definition[8]":"used to show that someone spends time in a place without doing anything useful","example[31]":"People were just standing round and not doing anything to help.","definition[9]":"if something is organized round a particular person or thing, it is organized according to their needs, wishes, ideas etc","example[32]":"Working from home, she could arrange her hours round her children.","example[33]":"He had built his whole existence round her.","definition[10]":"a way round a difficult situation or problem is a way to solve it or avoid it","example[34]":"She’s going to have to buy a car. I can’t see any other way round it.","example[35]":"strategies to get round (=solve) the  problem","definition[11]":"used to show the length of a line surrounding something","example[36]":"The park was about five miles round.","definition[12]":"shaped like a circle","example[37]":"a big round table","example[38]":"Jamie’s eyes grew round with delight.","definition[13]":"shaped like a ball","example[39]":"small round berries","definition[14]":"fat and curved","example[40]":"round chubby cheeks","definition[15]":"a round number or figure is a whole number, often ending in 0","note[1]":"a round hundred/dozen etc (=a complete hundred etc)","example[41]":"Let’s make it a round figure: say £50?","example[42]":"Altogether, in round figures, there are about three thousand students here.","note[2]":"in round figures","signpost[0]":"series","definition[16]":"a round of events is a series of related events, which are part of a longer process","example[43]":"a third round of peace talks","note[3]":"round of","example[44]":"the Government’s latest round of expenditure cuts","definition[17]":"one of the parts of a competition that you have to finish or win before you can go on to the next part","example[45]":"I got beaten in the first round.","note[4]":"the first/final/next/qualifying etc round","example[46]":"Two of their candidates made it through to the next round.","example[47]":"the final round of the championship","signpost[1]":"golf","definition[18]":"a complete game of golf","example[48]":"I played a round of golf on Sunday morning.","signpost[2]":"boxing/wrestling","definition[19]":"one of the periods of fighting in a boxing or wrestling match","signpost[3]":"drinks","definition[20]":"if you buy a round of drinks in a bar, you buy drinks for all the people in your group","example[49]":"What are you having? It’s my round.","note[5]":"it’s my/your etc round","signpost[4]":"gun shot","definition[21]":"a single shot from a gun, or a bullet for one shot","example[50]":"I’ve only got ten rounds of ammunition left.","example[51]":"Richards fired a few rounds.","signpost[5]":"circle","definition[22]":"something that has a circular shape","example[52]":"Slice the potatoes into rounds.","signpost[6]":"food/newspapers/letters etc","definition[23]":"a regular visit to a number of houses, offices etc to deliver or sell things","example[53]":"I used to do a paper round.","note[6]":"paper/milk round","signpost[7]":"song","definition[24]":"a song for three or four singers, in which each one sings the same tune, starting at a different time","collocation[0]":"a round of talks/negotiations/meetings","example[54]":"A second round of talks got under way this week.","collocation[1]":"a round of voting","example[55]":"In the first round of voting he took 44.5 percent of the vote,","collocation[2]":"a round of cuts","example[56]":"The president is likely to approve a new round of cuts in military forces.","collocation[3]":"a round of layoffs","example[57]":"The latest round of layoffs could bring its labor force down to 60,000.","collocation[4]":"a round of violence","example[58]":"What has prompted the latest round of violence?","definition[25]":"to go round something such as a bend or the corner of a building","example[59]":"As they rounded the bend and came in sight of the river, Philip took her hand.","example[60]":"The tide was coming in as he rounded the rocks.","definition[26]":"to make something into a round shape","example[61]":"The stones were then rounded, polished and engraved.","definition[27]":"if your eyes round, you open them wide because you are shocked, frightened etc","example[62]":"Barbara’s eyes rounded in surprise.","definition[28]":"a round number or sum is a whole number, often ending in 0","example[63]":"Let’s make it a round £50 I owe you.","definition[29]":"when an amount is not expressed as an exact number, but as the nearest 10,100,1, 000 etc","example[64]":"In round figures, the expected profit is about £600 million.","definition[30]":"a number or set of things that are connected such as a series of meetings or discussions","example[65]":"The current round of bargaining began on Oct. 23.","example[66]":"Canadian retailers are facing a round of bankruptcies after being hit by one of the worst holiday sales seasons ever."}