{"word[0]":"stereotype","definition[0]":"a belief or idea of what a particular type of person or thing is like. Stereotypes are often unfair or untrue","example[0]":"racist stereotypes in the media","note[0]":"racial/sexual/cultural etc stereotype","example[1]":"women who don’t fit the stereotype of the good mother","note[1]":"stereotype of","example[2]":"stereotypes about the elderly","note[2]":"stereotype about","form[0]":"ADJECTIVES/NOUN + stereotype","collocation[0]":"racial/racist stereotypes","example[3]":"The novel has been criticized for reinforcing racial stereotypes.","collocation[1]":"cultural stereotypes","example[4]":"His jokes often depend on cultural stereotypes.","collocation[2]":"national stereotypes","example[5]":"Such cartoons show how persistent national stereotypes are.","collocation[3]":"sexual/gender stereotypes","example[6]":"Feminists justifiably object to these sexual stereotypes.","collocation[4]":"an old/traditional stereotype","example[7]":"Many people still believe that old stereotype.","collocation[5]":"a popular/common stereotype","example[8]":"Current evidence indicates that older people are more healthy than popular stereotypes suggest.","collocation[6]":"a negative stereotype","example[9]":"We should avoid negative stereotypes regarding the performance of older workers.","collocation[7]":"fit/conform to a stereotype","example[10]":"He doesn’t fit the stereotype of a Stanford student.","collocation[8]":"reinforce a stereotype","example[11]":"Charities for older people must be careful not to reinforce harmful stereotypes.","collocation[9]":"challenge a stereotype","example[12]":"These young women want to challenge gender stereotypes.","definition[1]":"to decide unfairly that a type of person has particular qualities or abilities because they belong to a particular race, sex, or social class","example[13]":"Homeless people are stereotyped as alcoholics or addicts.","note[3]":"be stereotyped as something","explanation[0]":"Stereotype is often used in the passive"}