{"word[0]":"interest","definition[0]":"if you have an interest in something or someone, you want to know or learn more about them","example[0]":"I’d recommend this book to anyone who has an interest in jazz.","example[1]":"Ben has shown an interest in learning French.","example[2]":"My mother had never expressed any interest in the garden.","example[3]":"Babies soon begin to take an interest in the world around them.","example[4]":"John appeared to have no interest in girls.","example[5]":"I watched the first few episodes, but soon lost interest.","example[6]":"The last round of bidding aroused considerable interest.","example[7]":"Our survey reveals a disturbing lack of interest in teacher training.","example[8]":"I read your article with great interest.","example[9]":"My parents encouraged my interest in science.","note[0]":"interest in","definition[1]":"an activity that you enjoy doing or a subject that you enjoy studying","example[10]":"His interests include walking and golf.","example[11]":"As a biologist, my main interest has been human genetics.","example[12]":"Her outside interests  (=interests that are not part of her work) were numerous.","definition[2]":"a quality or feature of something that attracts your attention or makes you want to know more about it","example[13]":"A Persian rug will add colour and interest to your hallway.","example[14]":"It’s a book that will be of interest to a wide range of readers.","note[1]":"be of (no) interest (to somebody)","example[15]":"What you do in your private life is of no interest to me.","example[16]":"art galleries, museums and other places of interest","example[17]":"topics of general interest  (=that everyone wants to know about)","definition[3]":"the extra money that you must pay back when you borrow money","example[18]":"How much are the monthly interest payments?","example[19]":"The interest on the loan is 16% per year.","note[2]":"interest on","definition[4]":"money paid to you by a bank or financial institution when you keep money in an account there","example[20]":"an account that pays higher interest","example[21]":"The more you save, the more interest you’ll earn.","definition[5]":"the things that bring advantages to someone or something","example[22]":"We’ve got to balance economic interests and environmental interests.","example[23]":"The regulations were introduced in order to safeguard the interests of local fishing communities.","note[3]":"protect/look after/safeguard somebody’s interests","example[24]":"The court decided that it was in the girl’s best interests to remain with her grandparents.","note[4]":"be in somebody’s (best) interest(s) (to do something)","example[25]":"He has your best interests at heart, you know.","note[5]":"have somebody’s (best) interests at heart","definition[6]":"if you have an interest in a particular company or industry, you own shares in it","example[26]":"The company is believed to be keen to sell its extensive brewing interests.","example[27]":"His business interests are spread throughout Europe.","example[28]":"In 1986 GM acquired a controlling interest in the sports car maker Lotus.","note[6]":"controlling interest","definition[7]":"a group of people in the same business who share aims or ideas","example[29]":"Farming interests now dominate many of the National Park committees.","example[30]":"The majority of Brazil’s huge commercial interests support the measure.","example[31]":"the need to reduce the influence of special interests  (=groups who are concerned about particular subjects)","collocation[0]":"have an interest in something","example[32]":"Steve has a keen interest in bird-watching.","collocation[1]":"show interest in something","example[33]":"He had shown great interest in her work.","collocation[2]":"express an interest in something","example[34]":"A number of well-known film directors have expressed interest in the script.","collocation[3]":"take an interest in something","example[35]":"Jacky first took an interest in golf when he was about six years old.","collocation[4]":"have no interest in something","example[36]":"Andy had no interest in politics.","collocation[5]":"lose interest in something","example[37]":"Tilda had lost interest in what was being said.","collocation[6]":"arouse/generate/attract interest","example[38]":"This extraordinary story has aroused interest in many quarters.","collocation[7]":"feign interest","example[39]":"Ted scanned the report, feigning interest.","collocation[8]":"interest grows","example[40]":"Interest in the project has steadily grown.","collocation[9]":"interest wanes","example[41]":"When his initial interest waned, the teacher paid more attention to him.","collocation[10]":"great interest","example[42]":"The government has shown great interest in the idea.","collocation[11]":"enormous/intense interest","example[43]":"This tournament has created enormous interest.","collocation[12]":"considerable/strong/keen interest","example[44]":"The results of their work will be of considerable interest.","collocation[13]":"special/particular interest","example[45]":"Natural history was a special interest of his.","collocation[14]":"a personal interest in something","example[46]":"He took a personal interest in the lives of his workers.","collocation[15]":"renewed interest","example[47]":"There has been a renewed interest in abstract painting in recent years.","collocation[16]":"a consuming interest","example[48]":"Roland had a consuming interest in cricket.","collocation[17]":"a long-term/abiding interest","example[49]":"She has had a long-term interest in antiques.","collocation[18]":"a lot of interest","example[50]":"There has been a lot of interest in the story.","collocation[19]":"a great deal of interest","example[51]":"The exhibition has generated a great deal of interest.","collocation[20]":"a lack of interest","example[52]":"The show was cancelled due to a lack of interest on the part of the public.","definition[8]":"to make someone want to pay attention to something and find out more about it","example[53]":"Here’s an article which might interest you.","example[54]":"What interests me is all the history of these places.","example[55]":"It may interest you to know that a number of scholarships are available.","note[7]":"it interests somebody that/how/to do","definition[9]":"to try to persuade someone to buy, do, or eat something","note[8]":"Could I interest you in a drink/dessert etc? (=used as a polite way of offering someone a drink etc)","example[56]":"The salesman tried to interest me in the higher-priced model.","note[9]":"interest somebody in something","definition[10]":"an amount paid by a borrower to a lender, for example to a bank by someone borrowing money for a loan or by a bank to a DEPOSITOR (=someone keeping money in an account there)","example[57]":"Any spare cash is best put in a savings account where it will earn interest.","example[58]":"US savings bonds will pay interest at 7.01% from May 1 through Oct. 31.","example[59]":"Some credit cards don’t charge interest on unpaid balances.","example[60]":"a period during which you only pay interest on the loan and make no capital repayments","definition[11]":"shares that you own in a company, or a part of a company that a person or organization owns","synonym[0]":"HOLDING","example[61]":"Highlands Gold Ltd holds a 30% interest in the mine.","example[62]":"He acquired interests in a number of publishing companies.","definition[12]":"a group of people with strong reasons for wanting something to happen because they will gain an advantage from it","example[63]":"He is determined to preventpowerful vested interests from blocking the reform.","definition[13]":"the possession of rights, especially to land, property etc","example[64]":"The husband can release his interest in the legal estate to his wife."}