{"word[0]":"optimistic","definition[0]":"believing that good things will happen in the future","opposite[0]":"pessimistic","example[0]":"Andrew took a more optimistic view.","example[1]":"Bankers are cautiously optimistic about the country’s economic future.","note[0]":"optimistic about","example[2]":"We are still relatively optimistic that the factory can be saved.","note[1]":"optimistic (that)","definition[1]":"thinking that things will be better, easier, or more successful than is actually possible","example[3]":"an optimistic estimate","example[4]":"somewhat over-optimistic expectations","note[2]":"over-optimistic","definition[2]":"believing that good things will happen","example[5]":"I’m optimistic about our chances of winning.","example[6]":"an optimistic view of the future","display[0]":"hopeful","definition[3]":"believing that what you hope for will happen","example[7]":"The test results made him feel more hopeful about his chances of recovery.","definition[4]":"thinking about what is good in a situation, rather than what is bad","example[8]":"Try to be more positive about your work.","example[9]":"She has a very positive attitude to life.","display[1]":"upbeat","definition[5]":"having a cheerful attitude and showing that you expect to succeed, or that a situation will get better, especially the economic or political situation","example[10]":"The prime minister was upbeat, predicting that the economy would soon come out of recession.","example[11]":"an upbeat message about the party’s chances of winning the election","display[2]":"bullish","definition[6]":"feeling confident about the future – used especially when talking the economic situation, or a company’s chances of success","example[12]":"He’s very bullish about the company’s prospects.","example[13]":"Stockmarket analysts expect the bullish trend to continue.","display[3]":"sanguine","definition[7]":"hopeful and not worried about what will happen in the future, especially when the situation seems difficult – a very formal use","example[14]":"Koons himself somehow remains sanguine in the face of all the criticism.","example[15]":"Other commentators are less sanguine, and fear that the world economy is on the verge of recession.","display[4]":"rosy","definition[8]":"if the future or your life seems rosy, it seems good and you expect good things to happen","example[16]":"The future looks rosy for the team.","example[17]":"Returning soldiers found life less rosy than they had hoped.","example[18]":"The price of oil keeps going up, and things look pretty rosy for the big oil companies.","display[5]":"look on the bright side","definition[9]":"to consider the good parts of a situation, which seems bad in many other ways – used especially when telling someone that they should do this","example[19]":"Look on the bright side – it could have been a lot worse."}