{"word[0]":"settlement","signpost[0]":"official agreement","definition[0]":"an official agreement or decision that ends an argument, a court case, or a fight, or the action of making an agreement","example[0]":"Union leaders and company bosses will meet tomorrow in an attempt to reach a settlement.","example[1]":"His lawyers are understood to be negotiating a settlement.","example[2]":"Hopes grew that a workable peace settlement might emerge.","example[3]":"She got her home as part of the divorce settlement.","example[4]":"The company paid out over $10 million in an out-of-court settlement.","example[5]":"the search for a peaceful settlement of the Northern Ireland conflict","note[0]":"settlement of","signpost[1]":"payment","definition[1]":"when you pay all the money that you owe","example[6]":"the settlement of all his debts","example[7]":"Wyatt had received the property in settlement of a bet.","note[1]":"in settlement (of something)","signpost[2]":"group of houses","definition[2]":"a group of houses and buildings where people live, especially in a place where few people have lived before","example[8]":"The railway stations created new settlements.","example[9]":"an early Iron Age settlement","signpost[3]":"new area/places","definition[3]":"when a lot of people move to a place in order to live there, especially in a place where not many people have lived before","example[10]":"the settlement of the American West","signpost[4]":"sinking","definition[4]":"the process in which a building or the ground slowly sinks downwards","synonym[0]":"subsidence","collocation[0]":"reach a settlement","example[11]":"The companies reached a settlement in March.","collocation[1]":"achieve a settlement","example[12]":"The government was determined to achieve a settlement in Northern Ireland.","collocation[2]":"negotiate a settlement","form[0]":"ADJECTIVES/NOUN + settlement","collocation[3]":"an amicable settlement","example[13]":"Disputes were often taken to a village council, which attempted to bring about an amicable settlement.","collocation[4]":"a peaceful settlement","example[14]":"Both sides are working towards a peaceful settlement.","collocation[5]":"a political settlement","example[15]":"The British government favours a political settlement in the Middle East.","collocation[6]":"a peace settlement","example[16]":"Hopes of a peace settlement receded.","collocation[7]":"a divorce settlement","example[17]":"She acquired full ownership of the building in her 1986 divorce settlement.","collocation[8]":"an out-of-court settlement","example[18]":"The army denied liability but agreed on an out-of-court settlement.","collocation[9]":"the terms of a settlement","example[19]":"Under the terms of the settlement, the company will pay an undisclosed sum as compensation.","definition[5]":"an official agreement or decision that ends an argument between two people or organizations","example[20]":"After 15 years of litigation, appeals lawyers reached a settlement with the insurance company.","example[21]":"The inflation rate fell, reflecting recent lowwage settlements.","example[22]":"increases in public sector pay settlements","definition[6]":"the payment of money that someone owes","example[23]":"The company made afull and final settlement of £30 million.","example[24]":"Non-US residents are prepared to use the dollarin settlement of debts.","definition[7]":"the process of making payments relating to cheques, buying investments etc","synonym[1]":"CLEARING","example[25]":"The Bank of England and the London Stock Exchange developed a computerised settlement system for transactions in gilt-edged securities."}