{"word[0]":"brave","comparative[0]":"braver","superlative[0]":"bravest","definition[0]":"dealing with danger, pain, or difficult situations with courage and confidence","example[0]":"brave soldiers","example[1]":"her brave fight against cancer","example[2]":"It was brave of you to speak in front of all those people.","note[0]":"it is brave of somebody (to do something)","definition[1]":"brave people","example[3]":"Today we remember the brave who died in the last war.","example[4]":"Despite their captain’s brave performance, Arsenal lost 2–1.","example[5]":"the brave efforts of the medical staff to save his life","note[1]":"brave effort/attempt","definition[2]":"showing that you are not afraid to do things that other people find dangerous or difficult","example[6]":"I think he was incredibly brave to do a parachute jump.","example[7]":"a brave attempt to change the system","display[0]":"courageous","definition[3]":"very brave – used especially about someone fighting for what they believe in, or fighting against a disease","example[8]":"a courageous speech","example[9]":"her courageous fight against cancer","display[1]":"daring","definition[4]":"brave and willing to take a lot of risks","example[10]":"a daring escape from a prison camp","example[11]":"a daring fighter pilot","example[12]":"a daring thing to do","display[2]":"bold","definition[5]":"willing to make difficult decisions or say what you think, even though it may involve risks","example[13]":"It was a bold move to set up his own company.","example[14]":"She was very bold in criticizing the leadership.","display[3]":"intrepid","definition[6]":"willing to do dangerous things or go to dangerous places","example[15]":"an intrepid traveller","example[16]":"We sent our intrepid reporter to find out what is happening.","display[4]":"adventurous","definition[7]":"used about someone who enjoys going to new places and doing new, possibly dangerous, things","example[17]":"More adventurous visitors can go skiing or snowboarding.","display[5]":"fearless","definition[8]":"not afraid of anything or anyone","example[18]":"a fearless campaigner for human rights","display[6]":"heroic","definition[9]":"very brave and admired by many people","example[19]":"heroic rescuers","example[20]":"Despite heroic efforts to save him, he died.","display[7]":"plucky","definition[10]":"brave and determined – often used in newspapers","example[21]":"Plucky Megan, aged 10, has beaten cancer twice.","definition[11]":"to deal with a difficult, dangerous, or unpleasant situation","example[22]":"I decided to take the train to work rather than brave the traffic.","example[23]":"More than 100 people braved the elements and attended the rally.","note[2]":"brave the elements/weather etc","definition[12]":"a young fighting man from a Native American tribe"}