{"word[0]":"tie up","definition[0]":"to tie someone’s arms, legs etc so that they cannot move","synonym[0]":"bind","example[0]":"The intruders tied Kurt up and left him.","definition[1]":"to fasten something together, using string, rope etc","example[1]":"He tied up all the old newspapers.","definition[2]":"to be very busy, so that you cannot do anything else","example[2]":"I can’t see you tomorrow – I’ll be tied up all day.","signpost[0]":"traffic/phone/court etc","definition[3]":"to block a system or use it so much that other people cannot use it or it does not work effectively","example[3]":"Don’t tie up the phone lines making personal calls.","example[4]":"Protesters tied up the traffic for three hours today.","definition[4]":"if your money is tied up in something, it is all being used for that thing and is not available for anything else","example[5]":"My money’s all tied up in the house.","note[0]":"be tied up in","signpost[1]":"arrangements","definition[5]":"to finish arranging all the details of something such as an agreement or a plan","synonym[1]":"finalize","example[6]":"We’d better tie up the details with a solicitor.","definition[6]":"to be very closely related to something","synonym[2]":"be linked to","example[7]":"The shortage of teachers is tied up with the issue of pay.","definition[7]":"to do the things that are necessary in order to finish a piece of work","example[8]":"I need to tie up a few loose ends before I go on vacation.","definition[8]":"to tie an animal to something with a rope, chain etc","synonym[3]":"tether","example[9]":"She left the dog tied up to a tree.","note[1]":"tie something ↔ up to","signpost[2]":"boat","definition[9]":"to tie a boat to something with a rope, chain etc","synonym[4]":"moor","example[10]":"We tied up alongside a barge.","example[11]":"There was a boat tied up at the jetty.","note[2]":"tie something ↔ up","definition[10]":"an agreement to become business partners","example[12]":"IBM’s tie-up with Auspex System Inc","note[3]":"tie-up with","definition[11]":"a strong connection between two or more things","example[13]":"the tie-up between class interests and politics","note[4]":"tie-up between","definition[12]":"a situation in which traffic is prevented from moving or there is a problem which prevents a system or plan from working","definition[13]":"to use money for something so that it is not easily available to be used for anything else","example[14]":"These securities could be a good choice for investors who can afford to tie up their money for two to seven years.","example[15]":"Her cash is all tied up in real estate.","note[5]":"tie ↔ something up in","example[16]":"The bank had too high a percentage of its assets, about 20%, tied up in one borrower.","definition[14]":"to use a telephone line so that it cannot be used for anything else or by anyone else","example[17]":"With broadband, your phone line will never need to be tied up again.","definition[15]":"to be very busy so that you do not have time to see someone or to do something","example[18]":"I can’t see you tomorrow — I’m going to be tied up all day.","definition[16]":"to finish arranging all the details of a contract, deal, or plan","example[19]":"Our sales team were able to tie up a new contract.","definition[17]":"to block the movement of vehicles or people so that they cannot move freely","example[20]":"There’s a free roadside service for stranded vehicles that tie up traffic.","example[21]":"The company says that a tie-up with a foreign major is now on the cards."}