{"word[0]":"collect","signpost[0]":"bring together","definition[0]":"to get things of the same type from different places and bring them together","example[0]":"After 25 years of collecting recipes, she has compiled them into a cookbook.","example[1]":"The company collects information about consumer trends.","example[2]":"We’ve been out collecting signatures for our petition.","signpost[1]":"keep objects","definition[1]":"to get and keep objects of the same type, because you think they are attractive or interesting","example[3]":"Arlene collects teddy bears.","signpost[2]":"rent/debts/taxes","definition[2]":"to get money that you are owed","example[4]":"The landlady came around once a month to collect the rent.","note[0]":"collect tax/rent/a debt","signpost[3]":"money to help people","definition[3]":"to ask people to give you money or goods for an organization that helps people","example[5]":"I’m collecting for Children in Need.","note[1]":"collect for","signpost[4]":"increase in amount","definition[4]":"if something collects in a place, or you collect it there, it gradually increases in amount","example[6]":"Rain collected in pools on the road.","example[7]":"solar panels for collecting energy from the sun","example[8]":"I didn’t know what to do with it, so it just sat there collecting dust.","signpost[5]":"win something","definition[5]":"to receive something because you have won a race, game etc","example[9]":"Redgrave collected his fifth Olympic gold medal in Sydney.","signpost[6]":"take somebody/something from a place","definition[6]":"to come to a particular place in order to take someone or something away","example[10]":"Martin’s gone to collect the children from school.","example[11]":"I’ve got to go and collect the book I ordered from the library.","definition[7]":"to come together gradually to form a group of people","synonym[0]":"gather","example[12]":"A crowd was beginning to collect around the scene of the accident.","example[13]":"She collects stamps  (=as a hobby).","example[14]":"They have collected 650 signatures for their petition.","definition[8]":"to collect information from different places, or to collect crops, flowers, wood etc, especially from the ground","example[15]":"Computers make it easier to gather information.","example[16]":"The men gathered firewood.","display[0]":"assemble","definition[9]":"to collect something such as information in an organized way","example[17]":"When all the evidence is assembled, we will write our report.","display[1]":"build up","definition[10]":"to gradually collect more things of the same type over time","example[18]":"He has built up one of the country’s finest collections of art.","display[2]":"accumulate","definition[11]":"to gradually get more and more of something such as money, possessions, or knowledge, over time. Accumulate is more formal than build up","example[19]":"He is driven by the desire to accumulate wealth.","display[3]":"amass","definition[12]":"to collect a large amount of something such as money, information, or knowledge, over time","example[20]":"Carnegie amassed a fortune in the steel industry.","display[4]":"run up a bill/debt/loss","definition[13]":"to allow a debt to increase quickly, especially by spending too much","example[21]":"He ran up huge gambling debts.","definition[14]":"a short prayer in some Christian services","definition[15]":"to arrange for cheques to be paid","example[22]":"The district banks provide a variety of services for commercial banks, including collecting and clearing cheques.","definition[16]":"to obtain payment of debts or taxes","example[23]":"The company wasn’t aggressive about collecting debts.","example[24]":"Russia’s public finances must be brought into order by collecting more taxes and cutting spending.","definition[17]":"when you telephone someone collect, the person receiving the call pays for it","example[25]":"Calling the US is very expensive from here - better to call collect."}