{"word[0]":"fault","signpost[0]":"responsible for mistake","definition[0]":"if something bad that has happened is your fault, you should be blamed for it, because you made a mistake or failed to do something","example[0]":"I’m really sorry – it’s all my fault.","example[1]":"I didn’t sleep well that night, but it was my own fault.","example[2]":"It’s your fault we’re late.","note[0]":"be somebody’s fault (that)","example[3]":"It’s my fault for not making your new job clearer.","note[1]":"be somebody’s fault for doing something","signpost[1]":"something wrong with something","definition[1]":"something that is wrong with a machine, system, design etc, which prevents it from working properly","example[4]":"a design fault","example[5]":"It sounds as if there’s a fault in one of the loudspeakers.","note[2]":"fault in","definition[2]":"something that is wrong with something, which could be improved","example[6]":"There are two serious faults in Hobsbawm’s discussion of nationalism.","example[7]":"For all its faults (=in spite of its faults) we love this city.","definition[3]":"a mistake in the way that something was made, which spoils its appearance","example[8]":"The sweater had a fault in it and I had to take it back.","signpost[2]":"somebody’s character","definition[4]":"a bad or weak part of someone’s character","example[9]":"His worst fault is his arrogance.","example[10]":"I may have my faults, but ingratitude is not one of them.","example[11]":"For all his faults (=in spite of his faults) he was a good father.","signpost[3]":"crack","definition[5]":"a large crack in the rocks that form the Earth’s surface","example[12]":"the San Andreas fault","signpost[4]":"tennis","definition[6]":"a mistake made when a player is serving the ball in tennis","heading[0]":"something wrong","definition[7]":"a problem in a machine, system, design etc that causes damage or makes it not work properly","example[13]":"The fire was caused by an electrical fault.","example[14]":"a fault in the engine","display[0]":"defect","definition[8]":"a fault in something such as a product or machine, resulting from the way it was made or designed","example[15]":"Cars are tested for defects before they leave the factory.","definition[9]":"a part of a plan, system, or argument that is not as good as the other parts, and makes it likely to fail","example[16]":"What are the strengths and weaknesses of each method?","display[1]":"flaw","definition[10]":"a fault in a plan, system, argument etc, especially one that makes it useless or not effective","example[17]":"Your argument has a fundamental flaw.","example[18]":"There was one major flaw in his suggestion – we didn’t have enough money.","display[2]":"bug","definition[11]":"a fault in a computer program","example[19]":"A bug in the system was quickly fixed.","display[3]":"glitch","definition[12]":"a small fault in the way something works, that can usually be easily corrected","example[20]":"I noticed a small glitch when installing the software.","display[4]":"mistake","definition[13]":"something that is wrong in someone’s spelling, grammar, calculations etc","example[21]":"The article was full of spelling mistakes.","display[5]":"there’s something wrong with something","definition[14]":"used when saying that there is a problem in a machine, car etc, but you do not know what it is","example[22]":"There’s something wrong with the computer – it won’t close down.","definition[15]":"to criticize someone or something for a mistake","example[23]":"You might not like O'Donnel’s arrogance, but it’s hard to fault what he does on the field.","note[3]":"it is hard/difficult to fault somebody/something","example[24]":"The judge cannot be faulted on his decision.","note[4]":"be faulted on/for something","explanation[0]":"Fault is often used in the passive","definition[16]":"something that is wrong with a machine, system etc that prevents it from working correctly","example[25]":"Soviet engineers identified 32 design faults in the reactor, any of which could have led to an explosion.","definition[17]":"a mistake in the way something is made, that spoils its appearance","synonym[0]":"FLAW","definition[18]":"the responsibility of a person or organization for damage or injury to someone, or for a criminal act","example[26]":"The borrowers were at fault for signing fraudulent applications.","definition[19]":"used to talk about arrangements where it is not necessary to prove that someone was at fault for the person who was injured or hurt to receive money","example[27]":"no-fault systems for medical malpractice cases that would provide limited but guaranteed benefits","example[28]":"no-fault auto insurance"}