{"word[0]":"life","plural[0]":"lives","signpost[0]":"time somebody is alive","definition[0]":"the period of time when someone is alive","example[0]":"Learning goes on throughout life.","example[1]":"You have your whole life ahead of you.","example[2]":"I’ve known John all my life (=since I was born).","example[3]":"His main aim in life was to have fun.","example[4]":"It was one of the best days of my life.","example[5]":"The accident scarred him for life (=for the rest of his life).","example[6]":"She knew she’d feel guilty for the rest of her life.","example[7]":"Raj spent his life caring for others.","example[8]":"Bonington spent his entire adult life in France.","example[9]":"We don’t know much about the poet’s early life (=when he was young).","example[10]":"Poor diet can lead to a whole range of diseases in later life (=when you are older).","example[11]":"She married late in life (=when she was fairly old).","example[12]":"He’s a life member (=continuing until he dies) of the club.","example[13]":"For the first time in my life I was happy.","note[0]":"in somebody’s life","example[14]":"I’ve never been so embarrassed in my life!","signpost[1]":"state of being alive","definition[1]":"the state of being alive","example[15]":"The right to life is the most basic of human rights.","example[16]":"Danny was a cheerful little boy who loved life.","example[17]":"Two firefighters risked their lives to save the children.","signpost[2]":"way somebody lives","definition[2]":"the way you live your life, and what you do and experience during it","example[18]":"Having a baby changes your life completely.","example[19]":"The family moved to Australia to start a new life.","example[20]":"Ken’s whole life revolved around surfing  (=that was the main interest and purpose of his life).","example[21]":"You shouldn’t let your boyfriend rule your life (=control and affect everything you do).","example[22]":"My grandmother had a hard life (=a life full of problems).","example[23]":"She’s led a very sheltered life (=a life in which you have been protected from unpleasant things).","example[24]":"The operation should enable Bobby to lead a normal life.","note[1]":"lead/live/have a ... life","example[25]":"She just wanted to live a quiet life.","example[26]":"He had been drawn into a life of crime.","note[2]":"a life of crime/poverty/misery etc","signpost[3]":"particular situation/job","definition[3]":"the experiences, activities, and ways of living that are typical of being in a particular job, situation, society etc","example[27]":"Why do so few women enter political life?","example[28]":"the British way of life","example[29]":"Are you enjoying married life?","example[30]":"Noise has become one of the main pollutants of modern city life.","note[3]":"city/country/village etc life","example[31]":"He missed the routine of army life.","note[4]":"army/student/college etc life","definition[4]":"the time in your life when you are doing a particular job, are in a particular situation etc","example[32]":"Sara admits to having affairs throughout her married life.","example[33]":"Most of his working life was spent in the shipyards.","example[34]":"Now a celebrity chef, he rarely talks about his life as an army cook.","note[5]":"somebody’s life as something","signpost[4]":"human existence","definition[5]":"human existence, considered as a variety of experiences and activities","example[35]":"My Aunt Julia had very little experience of life.","example[36]":"Life has a way of changing the best of plans.","example[37]":"For some people, religion gives life a meaning.","example[38]":"I try to see the funny side of life.","example[39]":"the frustrations and disappointments of everyday life","note[6]":"daily/everyday life","signpost[5]":"time when something exists/works","definition[6]":"the period of time during which something happens or exists","example[40]":"The building began life as a monastery.","note[7]":"start/begin/come to life as something","example[41]":"The issues will not be resolved during the life of the present parliament.","note[8]":"life of","definition[7]":"the period of time during which something is still good enough to use","example[42]":"Careful use can extend the life of your washing machine.","example[43]":"What’s the average life of a passenger aircraft?","signpost[6]":"living things","definition[8]":"the quality of being alive that people, animals, plants etc have and that objects and dead things do not have","example[44]":"Ben felt her neck for a pulse or any other sign of life.","example[45]":"In the springtime, everything comes to life again.","definition[9]":"living things, such as people, animals, or plants","example[46]":"Is there life on other planets?","example[47]":"The island is rich in bird life.","note[9]":"human/animal/plant/bird etc life","definition[10]":"a chance in a game, especially a computer game, in which you can be defeated or do something wrong and can still continue playing","example[48]":"He’s up to level five and still has three lives left.","signpost[7]":"activity","definition[11]":"activity or movement","example[49]":"The house was quiet and there was no sign of life.","example[50]":"She was always so cheerful and full of life.","signpost[8]":"interest/excitement","definition[12]":"a quality of being interesting or exciting","example[51]":"Try to put some life into your writing.","example[52]":"The game really came to life after a magnificent goal from Rooney.","example[53]":"A gifted teacher can really bring literature to life for his or her students.","definition[13]":"the punishment of being put in prison for the rest of your life","example[54]":"He was sentenced to life for the murder.","note[10]":"be sentenced to/get/be given life","example[55]":"I think she should get life.","signpost[9]":"art","definition[14]":"when you paint, draw etc something you are looking at, especially a person or animal","example[56]":"She’s taking classes in life drawing.","signpost[10]":"book/film","definition[15]":"the story of someone’s life","synonym[0]":"biography","example[57]":"Boswell’s ‘Life of Johnson’","heading[0]":"– Meaning 2: the state of being alive","collocation[0]":"save somebody’s life","example[58]":"The money you give will save the life of a child.","collocation[1]":"risk your life","example[59]":"He risked his life to help Jews during the Second World War.","collocation[2]":"lose your life","example[60]":"Hundreds of people lost their lives on the first day of the fighting.","collocation[3]":"take a/somebody’s life","example[61]":"All cultures consider it wrong to take a life for no reason.","collocation[4]":"take your own life","example[62]":"He was depressed and decided to take his own life.","collocation[5]":"claim the life of somebody","example[63]":"The disease claimed the lives of up to a quarter of the population.","collocation[6]":"cost lives/cost somebody their life","example[64]":"That decision may have cost him his life.","collocation[7]":"give your life/lay down your life","example[65]":"These men gave their lives during the war to keep us free.","collocation[8]":"endanger the life of somebody","example[66]":"They wanted to capture the gunman without endangering the lives of his hostages.","collocation[9]":"spare somebody’s life","example[67]":"She begged him to spare the life of her son.","collocation[10]":"be fighting for your life","example[68]":"One badly burned man was fighting for his life in hospital.","collocation[11]":"cling to life","example[69]":"She clung to life, despite the pain.","collocation[12]":"owe your life to somebody","example[70]":"The victim said he owed his life to the stranger who helped him.","collocation[13]":"take your life in your hands","example[71]":"Just crossing this road is taking your life in your hands.","definition[16]":"a former US magazine known for having many interesting photographs of different places around the world. It stopped being published in 2007.","definition[17]":"the period of time during which something takes place or exists","example[72]":"industrial products used during the life of a mining operation","example[73]":"The rate of interest is often subsidized and fixed for the life of the loan.","definition[18]":"the period of time during which something is still good enough to use, fresh enough to eat etc","example[74]":"Our general purpose machinery has an estimated useful life of 80,000 running hours.","example[75]":"Castrol GTX2 oil has been specially formulated to prolong the life of catalytic converters.","definition[19]":"the period of time during which a person works","example[76]":"The average remaining service life of employees at the end of the last financial year was 10 years.","example[77]":"Managers may spend as much as 50% of their working lives engaged in meetings.","definition[20]":"until a person’s death, or until the end of their working life","example[78]":"The balance of the pension fund is used for an annuity giving a guaranteedincome for life.","example[79]":"Few people can count on having a job for life."}