{"word[0]":"listen","definition[0]":"to pay attention to what someone is saying or to a sound that you can hear","example[0]":"Listen! There’s a strange noise in the engine.","example[1]":"The whole class was listening attentively.","note[0]":"listen carefully/intently/hard etc","example[2]":"Liz stood still and listened hard  (=very carefully).","example[3]":"We sat around listening to music.","note[1]":"listen to","definition[1]":"used to tell someone to pay attention to what you are going to say","example[4]":"Listen, I want you to come with me.","definition[2]":"to consider what someone says and accept their advice","example[5]":"I told him not to go, but he just wouldn’t listen.","example[6]":"I wish I’d listened to Dad.","example[7]":"She refused to listen to reason (=accept sensible advice).","explanation[0]":"You listen to someone or something","example[8]":"I love listening to classical music","bad_example[0]":"I love listening classical music","explanation[1]":"You listen to someone or something doing something","example[9]":"I listened to the rain falling on the roof","display[0]":"hear","explanation[2]":"You hear someone or something","example[10]":"I heard a sudden shout","explanation[3]":"You hear someone or something do something","example[11]":"I heard something fall into the water","explanation[4]":"You hear someone or something doing something","example[12]":"I heard someone shouting","definition[3]":"to pay attention to what someone is saying or to a sound that you hear","example[13]":"I didn’t hear the answer, because I wasn’t listening when she read it out.","example[14]":"He listened carefully to every word I said.","display[1]":"pay attention","definition[4]":"to listen carefully to what someone is saying","example[15]":"I nodded to show I was paying attention.","example[16]":"She was tired and wasn’t paying attention to what he was saying.","display[2]":"eavesdrop","definition[5]":"to secretly listen to someone else’s conversation by standing near them, hiding behind a door etc","example[17]":"I caught him eavesdropping on our conversation.","example[18]":"They spoke in quiet voices which made it hard to eavesdrop.","display[3]":"overhear","definition[6]":"to hear someone say something, especially accidentally","example[19]":"I overheard him say something about wanting to move house.","example[20]":"Excuse me! I couldn’t help overhearing that you were planning a trip to Thailand.","display[4]":"tune in (to something)","definition[7]":"to listen to a radio programme, or to someone using a radio transmitter","example[21]":"Over a million people tune in to the programme each week.","example[22]":"Tune in at the same time next week for the next episode.","example[23]":"The equipment could be used by criminals to tune in to police broadcasts.","display[5]":"tap","definition[8]":"to connect a piece of electronic recording equipment to a telephone system so that you can listen to people’s telephone conversations","example[24]":"The police had tapped the phones of all three suspects.","example[25]":"The president had to resign over an illegal phone-tapping operation.","display[6]":"bug","definition[9]":"to hide a small piece of electronic recording equipment in someone’s room, car, office etc in order to listen secretly to what is said there","example[26]":"Security agents bugged their offices and managed to get some evidence against them.","example[27]":"Wells was convinced the house was bugged and insisted on playing loud music while we talked."}