{"word[0]":"investigation","definition[0]":"an official attempt to find out the truth about or the cause of something such as a crime, accident, or scientific problem","example[0]":"The investigation continued for nearly three years.","example[1]":"a criminal investigation","example[2]":"A private detective was hired to conduct the investigation.","example[3]":"The authorities are planning to launch a full-scale investigation into the crash.","note[0]":"investigation into","example[4]":"Baker demanded an investigation of the district attorney’s office.","note[1]":"investigation of","definition[1]":"the act of investigating something","example[5]":"the investigation of computer fraud","example[6]":"The whole issue is still under investigation.","note[2]":"under investigation","definition[2]":"a process in which the police or another organization try to find out the truth about a crime or accident","example[7]":"Following a major police investigation, two men were arrested.","example[8]":"The investigation into the causes of the air crash are continuing.","display[0]":"inquiry","definition[3]":"an official process to find out why something happened, which usually takes several months or years","example[9]":"Local people are calling for an inquiry into the accident.","example[10]":"An independent inquiry found serious shortcomings at the children’s home.","display[1]":"case","definition[4]":"a matter that police or officials are trying to find out information about, especially so that it can be dealt with in a court of law","example[11]":"The case has never been solved.","example[12]":"The police say it is one of the most puzzling cases they have had to deal with.","display[2]":"probe","definition[5]":"an investigation in which many questions are asked to find out the truth about something – used especially in journalism","example[13]":"The TV show featured a probe into charges charged by high street banks.","display[3]":"inquest","definition[6]":"a legal investigation to find out why someone died","example[14]":"The inquest heard that Mr Swan was poisoned.","display[4]":"survey","definition[7]":"a process in which people are asked questions in order to find out about their opinions or about their behaviour","example[15]":"They did a survey to find out the most popular pop star.","example[16]":"Based on a survey of 250 companies, the report says that ‘ over two thirds of companies expect operating costs to increase as a result of addressing environmental issues.","display[5]":"autopsy","definition[8]":"a medical examination of a dead person’s body, to find out why that person died","example[17]":"If she died of a drug overdose, it would show up in the autopsy."}