{"word[0]":"stock","signpost[0]":"in a shop","definition[0]":"a supply of a particular type of thing that a shop has available to sell","example[0]":"We have a huge stock of quality carpets on sale.","example[1]":"Buy now while stocks last!","example[2]":"I’m sorry, that swimsuit is completely out of stock in your size.","note[0]":"out of stock/in stock","signpost[1]":"finance","definition[1]":"a share in a company","example[3]":"the trading of stocks and shares","definition[2]":"the total value of all of a company’s shares","signpost[2]":"amount available","definition[3]":"the total amount of something that is available to be used in a particular area","example[4]":"Cod stocks in the North Atlantic have dropped radically.","example[5]":"the stock of housing in rural areas","signpost[3]":"supplies","definition[4]":"a supply of something that you keep and can use when you need to","example[6]":"He keeps a stock of medicines in the cupboard.","note[1]":"stock of","example[7]":"The country has been building up its stock of weapons.","signpost[4]":"cooking","definition[5]":"a liquid made by boiling meat or bones and vegetables, which is used to make soups or to add flavour to other dishes","example[8]":"chicken stock","example[9]":"vegetable stock","definition[6]":"the part of a gun that you hold or put against your shoulder, usually made of wood","definition[7]":"farm animals, especially cattle","synonym[0]":"livestock","signpost[5]":"flower","definition[8]":"a plant with pink, white, or light purple flowers and a sweet smell","definition[9]":"a thick part of a stem onto which another plant can be added so that the two plants grow together","signpost[6]":"actors","definition[10]":"a stock company(2)","definition[11]":"if a shop stocks a particular product, it keeps a supply of it to sell","example[10]":"We stock a wide range of kitchen equipment.","definition[12]":"to fill something with a supply of something","example[11]":"Our refrigerator at college was always stocked with beer.","note[2]":"stock something with something","definition[13]":"one of the shares into which ownership of a company is divided, or these shares considered together","example[12]":"The company might issue (=make available and sell) stock in order to pay down debt.","example[13]":"Investors are likely to earn superior returns if they hold (=own) stock for five years or longer.","example[14]":"More than 100 companies have filed plans to sell stock to the public for the first time.","example[15]":"The company sold a block of stock (=a large quantity of shares, usually more than 10,000) in the Hong Kong firm to unknown investors.","example[16]":"Stock prices were up in heavy trading.","definition[14]":"different classes of a company’s stock. Each class has different characteristics, for example the right to vote at shareholders’ meetings","example[17]":"The Class B stock carries 10 times the votes of the Class A common stock.","definition[15]":"one of the bonds sold by a government to finance its BUDGET DEFICIT (=the difference between what it gets in taxes and what it spends). Government bonds are usually considered to be a very safe form of investment","synonym[1]":"GOVERNMENT SECURITY","definition[16]":"a supply of a COMMODITY (=oil, metal, farm product etc) that has been produced and is kept to be used when needed","example[18]":"Global stocks (=total stocks in the world) of cocoa amount to 2 million tons, the equivalent of about eight months’ usage.","definition[17]":"a supply of RAW MATERIALs (=materials for use in manufacturing) or parts before they are used in production, or a supply of FINISHED GOODS","synonym[2]":"inventory","example[19]":"If you are going to have a large stock of components you must store them sensibly.","example[20]":"When an unexpected rise in demand occurs, it can be met partly by producing more and partly by running down (=reducing by using) stocks of finished goods.","definition[18]":"a supply of goods, kept for sale by a shop or other RETAILER","example[21]":"Equipment importers had big stocks of last year’s skis and boots still on their hands.","example[22]":"Most children’s bookshops will always have these titles in stock.","example[23]":"A problem with production meant that all the shops were out of stock (=had none of something left).","example[24]":"Distribution control has cut out two layers from the chain, giving greater control of retail stock levels (=quantities in stock).","definition[19]":"the houses, flats etc available in a particular place","example[25]":"The list of discounts offered by housebuilders gets longer as the stock of unsold new homes rises.","example[26]":"Another aspect of housing which merits attention is the condition of the older housing stock.","definition[20]":"an amount of gold, money etc that a country, company etc has available at a particular time","example[27]":"The US gold stock was down $1 million in November to $11.06 billion.","example[28]":"By making goods scarce, high tax policies render the existing stock of money more inflationary.","synonym[3]":"LIVESTOCK","example[29]":"He invested in stock, building up a herd of 1000 cattle.","definition[21]":"if a shop stocks a particular product, it keeps a supply of it to be sold","example[30]":"Independent boutiques that sell expensive clothes are stocking less merchandise as their sales drop.","definition[22]":"to have a supply of something so that it is ready to be used","example[31]":"The parts depot in California is well-stocked (=has lots of parts in stock)."}