{"word[0]":"discrimination","definition[0]":"the practice of treating one person or group differently from another in an unfair way","note[0]":"racial/sex/religious etc discrimination (=treating someone unfairly because of their race, sex etc)","example[0]":"laws to prevent discrimination","example[1]":"widespread discrimination against older people in the job market","note[1]":"discrimination against","example[2]":"discrimination in favour of university graduates","note[2]":"discrimination in favour of","definition[1]":"the ability to recognize the difference between two or more things, especially the difference in their quality","example[3]":"shape discrimination","form[0]":"ADJECTIVES/NOUN + discrimination","collocation[0]":"racial/race discrimination","example[4]":"Laws have been passed banning racial discrimination.","collocation[1]":"sex/sexual discrimination","example[5]":"She claimed she’d been the victim of sex discrimination.","collocation[2]":"age discrimination","example[6]":"Age discrimination disadvantages older workers.","collocation[3]":"religious discrimination","example[7]":"There must be an end to religious discrimination.","collocation[4]":"job/employment discrimination","example[8]":"Progress has been made in eliminating job discrimination.","collocation[5]":"workplace discrimination","example[9]":"The new law aims to bring an end to workplace discrimination.","collocation[6]":"unlawful discrimination","example[10]":"The European Court of Justice decided that she had been the subject of unlawful discrimination.","collocation[7]":"experience/face discrimination","example[11]":"Government figures suggest that ethnic minorities face discrimination looking for jobs.","collocation[8]":"end/outlaw discrimination","example[12]":"The purpose of the law is to end discrimination in the workplace.","collocation[9]":"a victim of discrimination","example[13]":"Victims of discrimination have the right to make a complaint.","collocation[10]":"discrimination on the grounds/basis of something","example[14]":"Discrimination on the grounds of nationality is prohibited.","definition[2]":"the process of treating one market, country, type of product etc differently from another","example[15]":"the discrimination in favour of imported wine when it comes to excise duty","definition[3]":"when a worker in a company is treated unfairly because of their race, sex, age etc, especially by not being considered for a job. This is illegal in many countries","example[16]":"The survey showed that there was unofficial discrimination against women in the engineering industry.","example[17]":"The Bill prohibits employment discrimination against qualified disabled persons on the grounds of their disability."}