{"word[0]":"forge","definition[0]":"to develop something new, especially a strong relationship with other people, groups, or countries","synonym[0]":"form","example[0]":"In 1776 the United States forged an alliance with France.","note[0]":"forge a relationship/alliance/link etc (with somebody)","example[1]":"The two women had forged a close bond.","example[2]":"Back in the 1980s, they were attempting to forge a new kind of rock music.","definition[1]":"to illegally copy something, especially something printed or written, to make people think that it is real","example[3]":"Someone stole my credit card and forged my signature.","example[4]":"a forged passport","definition[2]":"to move somewhere or continue doing something in a steady determined way","example[5]":"Her speech wasn’t going down too well, but she forged on.","example[6]":"Crowds of people forged through the streets towards the embassy.","note[1]":"forge into/through","example[7]":"He forged into the lead in the fourth set.","definition[3]":"to make something from a piece of metal by heating the metal and shaping it","definition[4]":"a place where metal is heated and shaped into objects","definition[5]":"a large piece of equipment that produces high temperatures, used for heating and shaping metal objects","definition[6]":"to produce a document or money that is not GENUINE (=real), or to sign something with a false name","example[8]":"They had forged some company documents and set up phoney  (=false) bank accounts.","example[9]":"Someone stole my cheque book and forged my signature.","definition[7]":"to establish a relationship of working together with another person, organization or country","example[10]":"Air France also forged an alliance with Delta Air Lines, helped by a the open-skies deal between France and the U.S.","note[2]":"forge an alliance/partnership/relationship etc with","example[11]":"A number of links have been forged between Danish and American companies.","note[3]":"forge an alliance/partnership/relationship etc between","example[12]":"Both General Motors and Ford would like to forge a liaison with Jaguar.","example[13]":"The US hopes to forge a closer economic relationship with East European countries.","definition[8]":"to make an agreement with another person, organization, or country","example[14]":"They forged an agreement with the Philips to produce two games using the electronics company’s Compact Disc-Interactive format.","note[4]":"forge an agreement with"}