{"word[0]":"acceptance","definition[0]":"when you officially agree to take something that you have been offered","example[0]":"He wrote a letter of acceptance  (=a letter in which you agree to accept a job, university place etc) to the university.","example[1]":"the formal acceptance of an invitation","note[0]":"acceptance of","definition[1]":"when people agree that an idea, statement, explanation etc is right or true","example[2]":"This management style gained acceptance in the 1980s.","note[1]":"gain/find acceptance","example[3]":"the acceptance of Einstein’s theory","example[4]":"There is still not widespread acceptance that fathers can care for children as well as mothers do.","note[2]":"acceptance that","definition[2]":"the ability to accept an unpleasant situation which cannot be changed, without getting angry or upset about it","example[5]":"By the end of the trial, Nicolas moved towards acceptance of his fate.","definition[3]":"the process of allowing someone to become part of a group or a society and of treating them in the same way as the other members","example[6]":"Acceptance by their peer group is important to most youngsters.","definition[4]":"taking or agreeing to take something offered","example[7]":"Indonesia’s acceptance of aid from western countries","definition[5]":"when someone accepts a plan, idea, agreement etc","example[8]":"A judge can force acceptance of a bankruptcy plan.","definition[6]":"when a buyer agrees to take goods from a seller and must therefore pay for them","definition[7]":"the willingness of people to buy a product, especially a new or changed product","example[9]":"The company’s earnings have fallen in the last four years owing to poor acceptance of new products.","example[10]":"The key issue driving consumer acceptance of this technology is pricing.","definition[8]":"in a takeover, agreement by individual shareholders to the offer","example[11]":"The takeover offer has received acceptances from shareholders representing 160 million shares.","definition[9]":"agreement to pay a BILL OF EXCHANGE, the words on a bill showing this agreement, or the accepted bill itself","example[12]":"Bankers’ acceptances require actual certificates to be delivered the same day."}