{"word[0]":"extent","definition[0]":"how large, important, or serious something is, especially something such as a problem or injury","example[0]":"Considering the extent of his injuries, he’s lucky to be alive.","note[0]":"extent of","example[1]":"It’s too early to assess the full extent of the damage.","definition[1]":"the length or size of something","example[2]":"They opened out the nets to their full extent.","example[3]":"The region is over 10,000 square kilometres in extent.","note[1]":"in extent","collocation[0]":"to some extent/to a certain extent","example[4]":"What you say is true to some extent, but it’s not the whole picture.","collocation[1]":"to a large/great extent","example[5]":"The materials we use will depend to a large extent on what is available.","collocation[2]":"to a small extent","example[6]":"The plan succeeded to a small extent.","collocation[3]":"to a greater extent","example[7]":"Children suffer the effects of poor diet to a greater extent than adults.","collocation[4]":"to a lesser extent","example[8]":"The same is true for women, though to a lesser extent.","collocation[5]":"to a considerable/significant extent","example[9]":"The affair affected his popularity to a considerable extent.","collocation[6]":"to a limited extent","example[10]":"In the USA, and to a limited extent in Britain, the housing market is in recession.","collocation[7]":"to such an extent that/to the extent that","example[11]":"He annoyed her to such an extent that she had to leave the room.","collocation[8]":"to the same extent","example[12]":"The roads were congested but not to the same extent as in London.","collocation[9]":"to what extent?","example[13]":"To what extent does cutting down trees contribute to climate change?","collocation[10]":"the extent to which","example[14]":"The report focused on the use of speed cameras, particularly the extent to which they reduced accidents.","heading[0]":"– Meaning 2: how large, important, or serious something is, especially something such as a problem or injury","collocation[11]":"the full extent","example[15]":"He refused to reveal the full extent of his debts.","collocation[12]":"the actual/true extent","example[16]":"Rescue workers still do not know the true extent of the disaster.","collocation[13]":"know/realize the extent of something","example[17]":"We do not yet know the extent of the damage.","collocation[14]":"understand the extent of something","example[18]":"Other people didn’t seem to understand the extent of his disability.","collocation[15]":"discover/find out the extent of something","example[19]":"We were shocked when we discovered the extent of the fraud.","collocation[16]":"assess/establish/determine the extent of something","example[20]":"We are still trying to assess the extent of the problem.","collocation[17]":"show/reveal the extent of something","example[21]":"These pictures show the extent of the devastation caused by the earthquake.","example[22]":"A report published by the government has revealed the extent of air pollution in the area."}