{"word[0]":"economic","definition[0]":"relating to trade, industry, and the management of money","example[0]":"Economic growth is slow.","example[1]":"the government’s economic policy","example[2]":"Economic reform is needed.","example[3]":"In the current economic climate (=conditions), we must keep costs down.","definition[1]":"an economic process, activity etc produces enough profit for it to continue","synonym[0]":"profitable","opposite[0]":"uneconomic","example[4]":"It is no longer economic to run the service.","collocation[0]":"economic activity","example[5]":"This year we have seen an upturn in global economic activity.","collocation[1]":"economic growth/development","example[6]":"We have enjoyed a period of steady economic growth.","collocation[2]":"an economic slowdown/downturn","example[7]":"Experts are predicting an economic slowdown at the beginning of next year.","collocation[3]":"economic recession","example[8]":"People are scared they will lose their homes if there is an economic recession.","collocation[4]":"an economic crisis","example[9]":"The country’s economic crisis continues to deepen as workers demonstrated against rising food prices.","collocation[5]":"economic recovery","example[10]":"There are now signs of economic recovery in the region.","collocation[6]":"economic problems","example[11]":"The country’s continuing economic problems could lead to recession.","collocation[7]":"the economic system","example[12]":"There are fears that the country’s whole economic system could collapse.","collocation[8]":"an economic policy","example[13]":"Controlling inflation is the main aim of the government’s economic policy.","collocation[9]":"economic reform","example[14]":"The government agreed to a programme of economic reform.","collocation[10]":"the economic climate","example[15]":"In the current economic climate, a lot of people are trying to save more and spend less.","collocation[11]":"economic sanctions","example[16]":"The UN threatened economic sanctions against the regime.","collocation[12]":"economic performance","example[17]":"How do you explain this poor economic performance over the last few years?","collocation[13]":"economic factor","example[18]":"Complex economic and social factors have contributed to the rise in violent crime.","collocation[14]":"an economic indicator","example[19]":"The main economic indicators show that the economy is still in decline.","definition[2]":"relating to or involving economics, money, finance, industry, trade etc","example[20]":"The economic climate (=general state of the economy) is not likely to improve significantly in the current year.","example[21]":"The country is facing a severe economic crisis.","example[22]":"The government is trying to promote political stability and economic growth.","example[23]":"What are the prospects for economic recovery?","definition[3]":"a business or an investment that is economic produces enough profit to make it worth continuing with","example[24]":"Oilfields that are not economic today may become considerably more attractive when oil prices increase."}