{"word[0]":"agenda","definition[0]":"a list of problems or subjects that a government, organization etc is planning to deal with","example[0]":"Measures to combat terrorism will be high on the agenda.","note[0]":"be high on the agenda/be top of the agenda","example[1]":"The government set an agenda for constitutional reform.","example[2]":"Our Centre has limited its research agenda to four areas.","note[1]":"political/economic/legislative/domestic etc agenda","definition[1]":"the ideas that a political party thinks are important and the things that party aims to achieve","example[3]":"The Republicans have stuck to their conservative agenda.","definition[2]":"a list of the subjects to be discussed at a meeting","example[4]":"the next item (=subject) on the agenda","collocation[0]":"be high on the agenda","example[5]":"New measures to combat terrorism are high on the agenda.","collocation[1]":"be (at the) top of the agenda","example[6]":"Energy efficiency is top of the agenda.","collocation[2]":"be on the political agenda","example[7]":"Immigration is an important issue on the political agenda.","collocation[3]":"have an agenda","example[8]":"Brown has an agenda for the university’s future.","collocation[4]":"set an agenda","example[9]":"The new government set an agenda for constitutional reform.","collocation[5]":"put something on the agenda","example[10]":"This incident has put the issue of racism firmly back on the agenda.","collocation[6]":"agree an agenda","example[11]":"The meeting ended in chaos as representatives were unable to agree an agenda.","collocation[7]":"establish/create/provide an agenda","example[12]":"We need to establish an agenda for future research.","example[13]":"What’s the first item on the agenda?","example[14]":"High on the agenda of today’s meeting of the G8 is global warming.","definition[3]":"a list of things that someone considers important or that they are planning to do","example[15]":"The recent strengthening of the dollar - and how to stop it - should be at the top of the agenda.","definition[4]":"someone’s secret plan or aims, rather than the ones that they say that they have","example[16]":"The union accused the company board of having a hidden agenda."}