{"word[0]":"star","signpost[0]":"in the sky","definition[0]":"a large ball of burning gas in space that can be seen at night as a point of light in the sky","example[0]":"I lay on my back and looked up at the stars.","example[1]":"The sky was filled with stars.","example[2]":"The stars were shining.","example[3]":"The stars were all out  (=they were shining).","example[4]":"The stars were twinkling overhead  (=shining and quickly changing from bright to faint).","example[5]":"sitting around a campfire under the stars","note[0]":"under the stars","signpost[1]":"famous performer/player","definition[1]":"a famous and successful actor, musician, or sports player","note[1]":"a pop/movie/TV/football etc star","example[6]":"By the age of 20, she was already a big star (=a very famous and successful performer).","example[7]":"He is a rising star (=someone who is becoming famous and successful) in the music world.","example[8]":"She’s a good actress but she lacks star quality (=a special quality that could make someone a star).","signpost[2]":"main person in a film/play etc","definition[2]":"the person who has the main part, or one of them, in a film, play, show etc","example[9]":"Ray Grimes, the star of the television series ‘Brother John’","note[2]":"star of","signpost[3]":"best/most successful person","definition[3]":"the person who gives the best performance in a film, play, show etc","example[10]":"Laporte, as Ebenezer Scrooge, is undoubtedly the star of the show.","example[11]":"Shamu, the killer whale, is the show’s star attraction (=best and most popular person or thing).","definition[4]":"the best or most successful person in a group of players, workers, students etc","example[12]":"the team’s star player","note[3]":"star player/performer/salesman etc","example[13]":"the school’s star pupil","example[14]":"the star columnist of ‘The Sunday Times’","definition[5]":"a shape with four or more points, which represents the way a star looks in the sky","definition[6]":"a mark in the shape of a star, used to draw attention to something written","example[15]":"I put a star next to the items that we still need to buy.","definition[7]":"a piece of cloth or metal in the shape of a star, worn to show someone’s rank or position – used especially on military uniforms","example[16]":"a four-star general","signpost[4]":"hotels/restaurants","definition[8]":"a mark used in a system for judging the quality of hotels and restaurants","example[17]":"a two-star hotel","note[4]":"three-star/four-star/five-star etc","heading[0]":"– Meaning 1: a large ball of burning gas in space that can be seen at night as a point of light in the sky","collocation[0]":"a star shines","example[18]":"I looked up and saw hundreds of stars shining in the sky.","collocation[1]":"a star twinkles","example[19]":"Stars began to twinkle in the darkening night sky.","collocation[2]":"stars appear/come out","example[20]":"We arrived home just as the stars were coming out.","collocation[3]":"the stars are out","example[21]":"There was a full moon, and the stars were out.","collocation[4]":"look up at the stars","example[22]":"I had spent a lot of time looking up at the stars as a kid.","collocation[5]":"sleep under the stars","example[23]":"In the desert, they slept out under the stars.","example[24]":"the brightest star in the night sky","collocation[6]":"faint","example[25]":"The star is faint but visible.","collocation[7]":"a distant star","example[26]":"He stared up towards the distant stars.","collocation[8]":"a cluster of stars","example[27]":"He fixed his telescope on a tiny little cluster of stars in the constellation of Taurus.","heading[1]":"– Meaning 2: a famous and successful actor, musician, or sports player","form[0]":"ADJECTIVES/NOUN + star","collocation[9]":"a big star","example[28]":"He has worked with some of the world’s biggest stars.","collocation[10]":"a movie/Hollywood star","example[29]":"He looked like a movie star.","collocation[11]":"a pop/rock star","example[30]":"Who’s your favourite pop star?","collocation[12]":"a TV star","example[31]":"Most TV stars do quite a lot of charity work.","collocation[13]":"a soap star","example[32]":"She was known as a soap star before she took up singing.","collocation[14]":"a sports/football/basketball etc star","example[33]":"Sam was a football star in college.","collocation[15]":"an international star","example[34]":"His performance in 'The Titanic' made him an international star.","collocation[16]":"a rising star","example[35]":"She is very much the rising star of Black American fiction.","collocation[17]":"a child star","example[36]":"The production team say they have been careful to look after all their child stars.","form[1]":"star + NOUN","collocation[18]":"star quality","example[37]":"She radiates genuine star quality.","collocation[19]":"star treatment","example[38]":"Winners get star treatment from the media.","collocation[20]":"a star vehicle","example[39]":"He denied that the movie was just a star vehicle for Tom Hanks.","collocation[21]":"a star of stage and screen","example[40]":"Now this much-loved star of stage and screen has been made a Dame.","definition[9]":"a large ball of burning gas in space, which can be seen at night as a point of light in the sky","example[41]":"The dark night sky was clear and full of stars.","display[0]":"planet","definition[10]":"one of the large objects that goes around the Sun, for example the Earth, Saturn, Mercury, or Mars","example[42]":"The planet Uranus was discovered in 1781.","display[1]":"sun","definition[11]":"the star that gives us light and heat, around which the planets move. There are also many millions of other suns in the universe","example[43]":"The sun came out from behind a cloud.","example[44]":"a dying sun","display[2]":"moon","definition[12]":"the round object that moves around the Earth every 28 days, or a similar object that goes around another planet","example[45]":"The moon rose in the night sky.","example[46]":"Titan is one of the moons of Saturn.","display[3]":"asteroid","definition[13]":"a mass of rock that moves around the sun. Most asteroids are found between Jupiter and Mars","example[47]":"the asteroid belt","display[4]":"pulsar","definition[14]":"a type of star that is far away in space and produces radiation and radio waves","display[5]":"quasar","definition[15]":"an object like a star that is far away in space and shines extremely brightly","display[6]":"supernova","definition[16]":"a very large exploding star","display[7]":"constellation","definition[17]":"a group of stars that forms a particular pattern and has a name","example[48]":"The constellation of Orion is one of the most easily recognizable patterns of stars in the night sky.","display[8]":"galaxy","definition[18]":"one of the large groups of stars that make up the universe","example[49]":"Astronomers have detected a galaxy 11 billion light years away.","display[9]":"the universe","definition[19]":"all space, including all the stars and planets","example[50]":"How many planets in the universe have life?","heading[2]":"a famous person","definition[20]":"a famous and successful actor, musician, or sportsperson","example[51]":"She dreamed of becoming a movie star.","example[52]":"a talent show to find the stars of the future","display[10]":"celebrity","definition[21]":"someone who often appears in newspapers, on television etc and is well-known to the public. Celebrities are often famous for being famous, not because they have any great talent","example[53]":"The magazine is full of gossip about celebrities.","display[11]":"name","definition[22]":"a famous person whose name is known by many people – used especially in the following expressions","example[54]":"All the big names in football were at the awards dinner.","example[55]":"Giorgio Armani is one of the most famous names in fashion.","example[56]":"He is yet to become a household name (=someone who everyone has heard of).","display[12]":"personality","definition[23]":"an entertainer or sports player who is famous and often appears in the newspapers, on television etc – used especially in the following phrases","example[57]":"Many advertisers use TV personalities to promote their products.","example[58]":"He was chosen as sports personality of the year.","heading[3]":"a very famous person","display[13]":"superstar","definition[24]":"an extremely famous performer, especially a musician or film actor","example[59]":"The film made Tom Cruise an international superstar.","display[14]":"legend","definition[25]":"someone who is famous and admired for being extremely good at doing something – used especially about people who are at the end of a long career or who have died","example[60]":"blues legend John Lee Hooker","example[61]":"Jane Fonda is the daughter of film legend Henry Fonda.","definition[26]":"someone who was one of the best players or performers that there have ever been","example[62]":"He was one of the all-time soccer greats.","definition[27]":"if someone stars in a film, television show etc, they are one of the main characters in it","example[63]":"‘The Freshman’ was Brando’s first starring role (=the most important part in a film) in ten years.","example[64]":"Eastwood starred in ‘The Good, the Bad, and the Ugly’.","note[5]":"star in","example[65]":"DeVito stars opposite Dreyfuss in the movie.","note[6]":"star with/opposite","example[66]":"Hugh Grant stars as the romantic hero.","note[7]":"star as","definition[28]":"if a film, television show, or play stars someone, that person is one of the main characters in it","synonym[0]":"feature","example[67]":"a film starring Meryl Streep","example[68]":"The movie starred Orson Welles as Harry Lime.","note[8]":"star somebody as ...","definition[29]":"to put an asterisk (=a star-shaped mark) next to something written","example[69]":"The starred items are available.","explanation[0]":"Star is usually passive in this meaning","definition[30]":"in the GROWTH/SHARE MATRIX, a company or product with quite a large share of a market that is growing quickly"}