{"word[0]":"pair","plural[0]":"pairs","signpost[0]":"joined together","definition[0]":"an object that is made from two similar parts that are joined together","example[0]":"two pairs of jeans","note[0]":"pair of trousers/scissors/glasses etc","example[1]":"a pair of black tights","signpost[1]":"belonging together","definition[1]":"two things of the same type that are used together","example[2]":"earrings, £5 a pair","example[3]":"a pair of skis","example[4]":"We have five pairs of free tickets to give away.","example[5]":"She felt as if every pair of eyes in the room was on her.","note[1]":"pair of hands/eyes/legs etc","example[6]":"a new pair of sandals","note[2]":"pair of","signpost[2]":"two people","definition[2]":"two people who are standing or doing something together, or who have some type of connection with each other","example[7]":"The pair are looking for sponsorship from local businesses.","example[8]":"a pair of dancers","signpost[3]":"two animals","definition[3]":"a male and a female animal that come together in order to breed","example[9]":"a pair of doves","example[10]":"a breeding pair","definition[4]":"two horses that work together","definition[5]":"to put people or things into groups of two, or to form groups of two","example[11]":"We were each paired with a newcomer to help with training.","note[3]":"be paired with somebody","explanation[0]":"Pair is usually passive in this meaning, when used as a transitive verb","definition[6]":"if animals pair, they come together in order to breed","definition[7]":"if two companies, people, or things are paired, they are put into groups of two because they are connected in some way or will work together","example[12]":"When the new products were paired, encouraging customer gains resulted.","example[13]":"Chrysler paired with Hilton Hotels for a promotion giving frequent hotel guests free Chrysler cars.","note[4]":"pair with","example[14]":"Any cut in capital gains taxes would be paired with increases in other taxes.","definition[8]":"if the shares in two companies are paired, they are considered to be shares in one company when they are bought or sold, even though the companies have separate management arrangements","example[15]":"The companies are managed separately, but their shares are paired for trading in the market."}