{"word[0]":"astrology","definition[0]":"the study of the positions and movements of the stars and how they might influence people and events","example[0]":"Do you believe in astrology?","example[1]":"The science of astrology has existed for thousands of years.","display[0]":"horoscope","definition[1]":"a description of people’s characters and the things that will happen to them, based on the position of the stars and planets at the time of their birth – especially a description that is printed in a newspaper or magazine","example[2]":"I sometimes read my horoscope in the daily paper.","example[3]":"My horoscope says that I should be careful about investing money.","display[1]":"the signs of the zodiac","definition[2]":"the twelve signs that you can belong to according to your birth date and the position of the stars then, which some people believe influence our characters and our lives","example[4]":"The carving shows the twelve signs of the zodiac.","display[2]":"star sign/sign","definition[3]":"one of the 12 signs of the zodiac","example[5]":"What sign are you?","example[6]":"My favourite star sign is Aquarius.","display[3]":"Aries","definition[4]":"the first sign of the zodiac, which is represented by a ram. People born between March 21 and April 20 belong to this sign.","display[4]":"Taurus","definition[5]":"the second sign of the zodiac, represented by a bull. People born between April 21 and May 21 belong to this sign.","display[5]":"Gemini","definition[6]":"the third sign of the zodiac, represented by twins. People born between May 22 and June 21 belong to this sign.","display[6]":"Cancer","definition[7]":"the fourth sign of the zodiac, represented by a crab. People born between June 22 and July 23 belong to this sign.","display[7]":"Leo","definition[8]":"the fifth sign of the zodiac, represented by a lion. People born between July 24 and August 23 belong to this sign.","display[8]":"Virgo","definition[9]":"the sixth sign of the zodiac, represented by a young woman. People born between August 24 and September 23 belong to this sign.","display[9]":"Libra","definition[10]":"the seventh sign of the zodiac, represented by a pair of Scales. People born between September 24 and October 23 belong to this sign.","display[10]":"Scorpio","definition[11]":"the eighth sign of the zodiac, represented by a scorpion. People born between October 24 and November 22 belong to this sign.","display[11]":"Sagittarius","definition[12]":"the ninth sign of the zodiac, represented by an animal that is half horse and half human, carrying a bow and arrow. People born between November 23 and December 21 belong to this sign.","display[12]":"Capricorn","definition[13]":"the tenth sign of the zodiac, represented by a goat. People born between December 22 and January 20 belong to this sign.","display[13]":"Aquarius","definition[14]":"the 11th sign of the zodiac, represented by a man carrying water. People born between January 21 and February 19 belong to this sign.","display[14]":"Pisces","definition[15]":"the 12th sign of the zodiac, represented by a pair of fish. People born between February 20 and March 20 belong to this sign."}