{"word[0]":"other","signpost[0]":"the second of two","definition[0]":"used to refer to the second of two people or things, which is not the one you already have or the one you have already mentioned","example[0]":"I can’t find my other shoe.","note[0]":"the/your other","example[1]":"One man was arrested, but the other one got away.","example[2]":"He kept shifting awkwardly from one foot to the other.","example[3]":"She took it for granted that each knew who the other was.","signpost[1]":"the rest","definition[1]":"used to refer to all the people or things in a group apart from the one you have already mentioned or the one that is already known about","example[4]":"The other hotels are all full.","example[5]":"She’s much brighter than all the other children in her class.","example[6]":"I chose this coat in the end because the other ones were all too expensive.","example[7]":"I can see Julie, but where have all the others gone?","note[1]":"the/your others","signpost[2]":"additional","definition[2]":"used to refer to additional people or things of the same kind","example[8]":"There are one or two other problems I’d like to discuss.","example[9]":"I’ve got some other friends I’d like to invite.","example[10]":"Have you any other questions?","example[11]":"The guests included, among others, Elizabeth Taylor and Michael Jackson.","note[2]":"among others","signpost[3]":"different","definition[3]":"used to refer to a different person or thing from the one you have already mentioned or the one that is already known about","example[12]":"David and Jessica were playing with two other children.","example[13]":"You’d better change into some other clothes.","example[14]":"Do you envy other women who seem to manage their lives better?","example[15]":"Can we discuss this some other time?","example[16]":"There is no other job I would rather do.","example[17]":"Saudi Arabia produces more oil than any other country.","example[18]":"I hope you will learn to show more respect for others  (=other people).","example[19]":"Some people are at greater risk than others.","note[3]":"some ... others","signpost[4]":"opposite","definition[4]":"used to refer to the thing that is opposite you, furthest from you, or moving away from you","example[20]":"You can park on the other side of the street.","note[4]":"the other side/end/direction etc","example[21]":"He lives at the other end of the road.","example[22]":"She drove off in the other direction.","explanation[0]":"You use other before a plural noun","example[23]":"children from other countries","bad_example[0]":"others countries","display[0]":"others","explanation[1]":"Others is a plural pronoun meaning ‘other people or things’","example[24]":"We try to help others","display[1]":"another","explanation[2]":"Another is written as one word  Don’t write","example[25]":"There must be another way of doing it","bad_example[1]":"an other"}