{"word[0]":"tourist","definition[0]":"someone who is visiting a place for pleasure on holiday","example[0]":"Cambridge is always full of tourists in the summer.","example[1]":"The Statue of Liberty is a major tourist attraction.","example[2]":"What effect will this have on the local tourist industry?","example[3]":"Durham, with its cathedral and castle, is a popular tourist centre.","note[0]":"tourist centre/destination/resort etc","collocation[0]":"foreign tourists","example[4]":"Millions of foreign tourists visit the capital every year.","collocation[1]":"an American/Japanese etc tourist","example[5]":"She saw a crowd of Japanese tourists, cameras at the ready, wandering down the path.","collocation[2]":"tourists visit a place","example[6]":"About six million tourists visit the country each year.","collocation[3]":"tourists flock to a place","example[7]":"Tourists have flocked to the area ever since the TV series was filmed there.","collocation[4]":"attract/draw tourists","example[8]":"They hope to change the image of the city and attract more tourists.","form[0]":"tourist + NOUN","collocation[5]":"a tourist attraction","example[9]":"Yellowstone National Park is a major tourist attraction.","collocation[6]":"a tourist destination/centre/spot","example[10]":"Egypt became a popular tourist destination in the nineteenth century.","collocation[7]":"the tourist industry","example[11]":"The tourist industry is booming, with more visitors this year than ever before.","collocation[8]":"the tourist season","example[12]":"Even in the tourist season the beaches don’t get packed.","collocation[9]":"a group/party of tourists","example[13]":"The guide was talking to a party of tourists.","example[14]":"The hotel is very popular with tourists.","example[15]":"a major tourist destination","display[0]":"traveller","definition[1]":"someone who travels somewhere","example[16]":"a weary traveller returning home after a long journey","example[17]":"The building’s luxurious interior will appeal to business travellers.","example[18]":"The strike will affect air travellers.","example[19]":"Paul Theroux, the American traveller, once went from London to India by train.","display[1]":"visitor","definition[2]":"someone who comes to visit a particular country, area, museum etc","example[20]":"Times Square attracts more than 30 million visitors annually.","display[2]":"holiday-maker","definition[3]":"someone who is on holiday somewhere","example[21]":"The beach was packed with holiday-makers.","example[22]":"75 percent of Alamo's rentals are to vacationers.","display[3]":"sightseer","definition[4]":"a tourist who is visiting a famous or interesting place","example[23]":"Crowds of sightseers come to London every year.","display[4]":"backpacker","definition[5]":"someone who is travelling for pleasure, staying in cheap accommodation and carrying a backpack","example[24]":"a cheap hotel which is used mainly by backpackers","definition[6]":"someone who travels to visit a place for pleasure or a holiday","example[25]":"About 40,000 Americans go there each year, mostly for business but some as tourists.","example[26]":"The city relies on its tourist industry and many of its citizens are shopkeepers and guides.","example[27]":"The Statue of Liberty is a major tourist attraction (=a place, building etc that many tourists go to see)."}