{"word[0]":"enthusiastic","definition[0]":"feeling or showing a lot of interest and excitement about something","example[0]":"The singer got an enthusiastic reception.","example[1]":"an enthusiastic supporter of reform","example[2]":"All the staff are enthusiastic about the project.","note[0]":"enthusiastic about (doing) something","collocation[0]":"be/feel enthusiastic","example[3]":"The Irish are very enthusiastic about horse racing.","collocation[1]":"seem/appear enthusiastic","example[4]":"I wanted to go, but Helen seemed less enthusiastic.","collocation[2]":"sound enthusiastic","example[5]":"‘I’m sure we can do it, ’ she said, trying to sound enthusiastic.","collocation[3]":"look enthusiastic","example[6]":"Your husband doesn’t look too enthusiastic about the idea.","form[0]":"enthusiastic + NOUN","collocation[4]":"enthusiastic support","example[7]":"His policies won him the enthusiastic support of middle-income voters.","collocation[5]":"enthusiastic supporter","example[8]":"He is an enthusiastic supporter of the war.","collocation[6]":"enthusiastic response","example[9]":"The proposal has received an enthusiastic response from the union.","collocation[7]":"enthusiastic reception/welcome","example[10]":"The audience gave him an enthusiastic reception.","collocation[8]":"enthusiastic crowd/audience","example[11]":"It’s nice to see such an enthusiastic crowd at the match.","collocation[9]":"enthusiastic applause","example[12]":"His speech was greeted by enthusiastic applause.","collocation[10]":"an enthusiastic amateur","example[13]":"There are a few professionals in the race, but most are enthusiastic amateurs.","definition[1]":"feeling or showing a lot of interest or excitement about something","example[14]":"He’s really enthusiastic about his new job.","example[15]":"An enthusiastic crowd cheered the team onto the pitch.","display[0]":"eager","definition[2]":"wanting to do something or know about something very soon","example[16]":"He was eager to hear every detail of her day.","example[17]":"She was always eager for her turn on the catwalk.","example[18]":"The room was full of eager young faces.","example[19]":"We waited in eager anticipation.","display[1]":"keen","definition[3]":"eager to work or learn","example[20]":"She hasn’t much experience but she’s very keen.","example[21]":"John was a keen student who worked very hard.","display[2]":"zealous","definition[4]":"doing something in a very enthusiastic way, especially supporting something or making sure that people obey rules","example[22]":"She was a zealous supporter of the revolution.","example[23]":"The company has been extremely zealous in defending its interests.","example[24]":"Officials have been very zealous in the application of the new regulations.","display[3]":"avid","definition[5]":"used when you want to emphasize that someone does something a lot or is very interested in something","example[25]":"an avid golfer","example[26]":"She was an avid reader all her life.","example[27]":"I’ve become an avid collector of his work.","example[28]":"Henry is an avid fan of the sport.","example[29]":"As a schoolboy he had an avid interest in birds.","display[4]":"fervent","definition[6]":"believing or feeling something very strongly and sincerely","example[30]":"Galinsoga was one of Franco’s most fervent supporters.","example[31]":"One of Allen 's fervent admirers was Richard Nixon.","example[32]":"her fervent belief in promoting the work of good women artists","display[5]":"be mad about something","definition[7]":"to like something very much and be very interested in it","example[33]":"My sister’s mad about horses.","example[34]":"Since you’re so mad about clothes, you can help me choose a wedding dress.","display[6]":"can’t wait to do something","definition[8]":"to be very eager to do something","example[35]":"I can’t wait to get started.","display[7]":"be looking forward to something","definition[9]":"to feel pleased and excited because you know that something is going to happen soon","example[36]":"I’m looking forward to the vacation."}