{"signpost[0]":"move to place","definition[0]":"to move something to a particular place or position, especially using your hands","example[0]":"He put the coffee on the table.","example[1]":"Where did you put the programmes?","signpost[1]":"change somebody’s situation/feelings","definition[1]":"to make someone be in a situation or have a feeling","example[2]":"Don’t put yourself into a situation you can’t handle.","example[3]":"I don’t want to put you in danger.","example[4]":"Pit closures have put thousands of miners out of a job (=made them lose their job).","example[5]":"Politics puts me to sleep.","example[6]":"A knee injury put him out of action for three months.","example[7]":"The long delay had put us all in a bad mood.","note[0]":"put somebody in a good/bad etc mood","example[8]":"His boss resigned and Murphy was put in charge.","note[1]":"put somebody in control/command/charge etc","signpost[2]":"write/print something","definition[2]":"to write or print something or to make a mark with a pen or pencil","example[9]":"Put your name at the top of each answer sheet.","note[2]":"put something in/on/under etc something","example[10]":"He put his signature to the contract  (=he signed it to show he agreed with it).","note[3]":"put something to something","signpost[3]":"express","definition[3]":"to say or write something using words in a particular way","example[11]":"So it was an accident, an ‘act of God’ if you want to put it like that.","example[12]":"When women joined the organization, it ‘took on a new look', as news reports put it.","example[13]":"It is hard to put into words (=express) how I feel now.","example[14]":"He’s not very musical, to put it mildly (=he’s not musical at all).","example[15]":"We get on each other’s nerves, to put it bluntly (=to say exactly what I mean).","example[16]":"It’s fairly risky. Or to put it another way (=say it in different words), don’t try this at home.","example[17]":"The subject matter makes the painting a little, how shall I put it (=how can I say it politely?), undesirable for public display.","example[18]":"The question was well put.","note[4]":"put something well/cleverly/simply etc","signpost[4]":"ask/suggest","definition[4]":"to ask a question or make a suggestion, especially to get someone’s opinion or agreement","example[19]":"Can I put a question to you?","example[20]":"I put it to you that this proposal has to be considered.","example[21]":"He put the proposal to his wife.","note[5]":"put a proposition/proposal/case etc to somebody","example[22]":"The budget was put before the board of directors.","note[6]":"put something before somebody","signpost[5]":"make somebody/something do something","definition[5]":"to make someone or something work or do something, or to use it","example[23]":"a scheme to put unemployed people to work on government construction projects","example[24]":"If you have a spare room, put it to work for you – take in a lodger.","example[25]":"Computer games are being put to use in the classroom.","example[26]":"We put 15 rain jackets to the test (=we tested them).","signpost[6]":"have importance/quality","definition[6]":"to consider something as having a particular level of importance or quality","example[27]":"A recent poll put Dr Martens among the world’s top thirty designer labels.","note[7]":"put somebody as/among/in etc something","example[28]":"Some companies put profit before safety.","note[8]":"put somebody/something before somebody/something","example[29]":"The job’s important to him, but he puts his family first.","note[9]":"put somebody/something first/second etc","signpost[7]":"send somebody somewhere","definition[7]":"to arrange for someone to go to a place, or to make them go there","example[30]":"Put the boys to bed around eight o'clock.","example[31]":"The company is putting in new management.","note[10]":"put somebody in (something)","example[32]":"Pneumonia put him in the hospital for a week.","definition[8]":"to throw a shot (=a heavy metal ball) in a sports competition","heading[0]":"– Meaning 4: to say or write something using words in a particular way","collocation[0]":"well","example[33]":"Sorry, I’m not putting it very well.","collocation[1]":"simply","example[34]":"Put simply, our aim is to create art.","collocation[2]":"succinctly","example[35]":"A Russian economist put it most succinctly: ‘People do not care about carbon.’","collocation[3]":"mildly","example[36]":"His theory is controversial, to put it mildly.","collocation[4]":"bluntly/crudely/plainly","example[37]":"I would put it more bluntly. I think you are wallowing in self-pity.","collocation[5]":"delicately","example[38]":"He had been drunk, or as Hilton delicately put it, ‘talkative’.","collocation[6]":"cleverly","example[39]":"I didn't agree with her, but she put her argument so cleverly that I was almost persuaded.","collocation[7]":"put something another way","example[40]":"The dress was too small for me, or, to put it another way, I was too big for it.","collocation[8]":"put something this/that way","example[41]":"Let me put it this way - she's not as young as she was.","collocation[9]":"put something like that/this","example[42]":"‘He's been completely irresponsible.’ ‘I wouldn’t put it quite like that.’","collocation[10]":"put something into words","example[43]":"She couldn’t put her feelings into words.","collocation[11]":"how shall I/we put it?","example[44]":"Mr Lewis is now – how shall we put it? – hardly the influence he once was.","heading[1]":"– Meaning 7: to ask a question or make a suggestion, especially to get someone’s opinion or agreement","collocation[12]":"put a question (to somebody)","example[45]":"I will be putting that very question to her.","collocation[13]":"put a proposition/proposal to somebody","example[46]":"I’ve a proposition to put to you.","collocation[14]":"put a point to somebody","example[47]":"You should put that point to the Chancellor.","collocation[15]":"put a case (to somebody)","example[48]":"He wanted to put his case to the full committee.","collocation[16]":"put it to somebody that","example[49]":"I put it to him that what we needed was some independent advice.","definition[9]":"to move something to a particular place","example[50]":"I’ve put the wine in the fridge.","example[51]":"Where have you put my grey shirt?","definition[10]":"to put something somewhere carefully","example[52]":"‘It’s beautiful, ’ he said, placing it back on the shelf.","display[0]":"lay","definition[11]":"to put someone or something down carefully on a flat surface","example[53]":"He laid all the money on the table.","example[54]":"She laid the baby on his bed.","definition[12]":"to carefully put something in a suitable position","example[55]":"Position the microphone to suit your height.","example[56]":"Troops were positioned around the city.","display[1]":"slip","definition[13]":"to put something somewhere with a quick movement","example[57]":"He slipped his arm around her waist.","example[58]":"Carrie quickly slipped the money into her bag.","display[2]":"shove","definition[14]":"to put something into a space or container quickly or carelessly","example[59]":"Shove anything you don’t want in that sack.","example[60]":"I’ve ironed those shirts so don’t just shove them in a drawer.","display[3]":"stick","definition[15]":"to put something somewhere quickly or carelessly","example[61]":"I stuck the address in my pocket and I can’t find it now.","example[62]":"Could you bung those clothes in the washing machine?","display[4]":"dump","definition[16]":"to put something down somewhere in a careless and untidy way","example[63]":"Don’t just dump all your bags in the kitchen.","example[64]":"People shouldn’t dump rubbish at the side of the street.","display[5]":"pop","definition[17]":"to quickly put something somewhere, usually for a short time","example[65]":"Pop it in the microwave for a minute.","display[6]":"thrust","definition[18]":"to put something somewhere suddenly or forcefully","example[66]":"‘Hide it, ’ he said, thrusting the watch into her hand.","heading[2]":"to put something into a liquid","display[7]":"dip","definition[19]":"to put something into a liquid for a very short time and take it out again","example[67]":"She dipped her hand in the water to see how hot it was.","example[68]":"Prawns are delicious dipped in a spicy sauce.","display[8]":"plunge","definition[20]":"to put something quickly, firmly, and deeply into a liquid","example[69]":"Plunge the pasta into a pan of boiling water.","example[70]":"I had to plunge my arm in up to the elbow to reach the keys.","display[9]":"dunk","definition[21]":"to put something such as a piece of bread or cake into a hot drink or soup before eating it","example[71]":"I love biscuits dunked in coffee.","display[10]":"immerse","definition[22]":"to put something deep into a liquid so that it is completely covered","example[72]":"If the plant’s leaves look dry, immerse the roots in water for a while.","definition[23]":"to offer a proposal, plan etc to a group of people which they can accept or reject","example[73]":"The latest offer will be put to the negotiating committee this afternoon.","definition[24]":"to sign a letter, document etc saying that you agree with what is written in it","definition[25]":"another name for PUT OPTION (=the right to sell shares etc at a particular price within a specific period of time)","example[74]":"In-the-money puts are options where the price at which the holder can sell the stock is well above the current market price of the shares.","example[75]":"Japanese players are holding a large amount of dollar puts at 132.4 yen."}