{"signpost[0]":"reasonable and acceptable","definition[0]":"a fair situation, system, way of treating people, or judgment seems reasonable, acceptable, and right","opposite[0]":"unfair","example[0]":"All we are asking for is a fair wage.","example[1]":"£150 is a fair price.","example[2]":"What do you think is the fairest solution?","example[3]":"The report is a fair summary of the issues facing us.","example[4]":"the right to a fair trial","note[0]":"fair trial/hearing","example[5]":"It’s only fair that we tell him what’s happening.","note[1]":"it’s only fair (that)","example[6]":"It’s fair to say that by then he had lost the support of his staff.","note[2]":"it’s fair to say (that)","example[7]":"It seems fair to give them a second chance.","note[3]":"it is fair to do something","example[8]":"I can’t carry on working such long hours. It’s not fair on my family.","note[4]":"it’s not fair on somebody","signpost[1]":"treating everyone equally","definition[1]":"treating everyone in a way that is right or equal","example[9]":"Why does Eric get to go and I don’t? It’s not fair!","example[10]":"Life isn’t always fair.","example[11]":"My boss expects a lot – but he’s very fair.","example[12]":"You pay him $10 an hour – it’s only fair that I should get the same.","example[13]":"The old law wasn’t fair to women.","note[5]":"fair to","signpost[2]":"hair/skin","definition[2]":"someone who is fair, or who has fair hair or skin, has hair or skin that is very light in colour","signpost[3]":"according to the rules","definition[3]":"a fair fight, game, or election is one that is played or done according to the rules","signpost[4]":"level of ability","definition[4]":"neither particularly good nor particularly bad","example[14]":"Her written work is excellent but her practical work is only fair.","definition[5]":"weather that is fair is pleasant and not windy, rainy etc","example[15]":"It should be generally fair and warm for the next few days.","signpost[5]":"pleasant/attractive","definition[6]":"pleasant and attractive","example[16]":"a fair maiden","definition[7]":"treating people equally or in the way that is right","example[17]":"It’s not fair that she gets paid more than me.","example[18]":"Everyone has the right to a fair trial.","display[0]":"just","definition[8]":"morally right and fair","example[19]":"a just punishment","example[20]":"a just cause","example[21]":"a just society","example[22]":"Do you think it was a just war?","display[1]":"reasonable","definition[9]":"fair and sensible according to most people’s standards","example[23]":"a reasonable request","example[24]":"Lateness, without a reasonable excuse, will not be tolerated.","display[2]":"balanced","definition[10]":"giving fair and equal treatment to all sides of an argument or subject","example[25]":"Balanced reporting of the news is essential.","display[3]":"even-handed","definition[11]":"giving fair and equal treatment to everyone, especially when it would be easy to favour one particular group","example[26]":"The drama takes an even-handed look at the consequences of violent crime, both on attackers and their victims.","example[27]":"The film is even-handed and does not try to make you support either side.","display[4]":"equitable","definition[12]":"giving equal treatment to everyone involved","example[28]":"We need an equitable solution to this problem.","example[29]":"a more equitable distribution of wealth","definition[13]":"a form of outdoor entertainment, at which there are large machines to ride on and games in which you can win prizes","definition[14]":"an outdoor event, at which there are large machines to ride on, games to play, and sometimes farm animals being judged and sold","note[6]":"state/county fair","definition[15]":"an outdoor event with games and things to eat and drink, usually organized to get money for a school, club etc","synonym[0]":"fête","definition[16]":"a market where animals and farm products are sold","example[30]":"a horse fair","definition[17]":"a situation or arrangement which is fair is reasonable, honest, and acceptable","example[31]":"The committee takes seriously the need to be fair and just in everything it does.","example[32]":"fair voting procedures","definition[18]":"a large show where business people producing a particular product or service can meet to advertise or sell their products","example[33]":"the Frankfurtbook fair","example[34]":"Many businesses deal less formally, for example at trade fairs."}