{"word[0]":"executive","definition[0]":"a manager in an organization or company who helps make important decisions","example[0]":"a marketing executive","example[1]":"top executives on high salaries","note[0]":"senior/top executive","definition[1]":"a group of people who are in charge of an organization and make the rules","example[2]":"the union’s executive","definition[2]":"relating to the job of managing a business or organization and making decisions","note[1]":"executive body/committee etc (=a group of people who have the power to make decisions)","example[3]":"a commission with executive powers","definition[3]":"for the use of people who have important jobs in a company","example[4]":"the executive dining-room","definition[4]":"expensive and designed for people who earn a lot of money","note[2]":"executive cars/homes etc","example[5]":"executive toys  (=objects to play with at work)","definition[5]":"someone who has an important job as a manager in a company or business","example[6]":"She is Scottish Power’s most senior woman executive.","example[7]":"a senior executive with a major pharmaceuticals company","example[8]":"One of the BBC’s top executives was working under a freelance contract.","definition[6]":"the part of a government responsible for taking decisions on policy, running the government etc, rather than for making laws","example[9]":"an audit on behalf of both the legislative and the executive","definition[7]":"a government organization responsible for deciding policy and taking decisions to do with one particular thing","definition[8]":"the group of people in a political organization, society etc that make the rules and make sure that they work in the way that was planned","example[10]":"The executive deferred a decision on his future until mid-January.","example[11]":"a meeting of the Labour Party executive","definition[9]":"connected with making decisions and managing and organizing things, especially within a company or government","example[12]":"Some of the members of the executive board decided to rethink the organizational culture.","example[13]":"When he reached the company’s retirement age of 60, he decided to give up his executive duties.","example[14]":"the legislative and executive functions of government","definition[10]":"for the use of people who have important jobs in the management of a company or business","example[15]":"The Falcon 20 is one of the most versatile executive jets (=small jet planes for the use of a company’s top managers) flying in the world today.","example[16]":"the executive lounge at Heathrow airport","example[17]":"the executive dining room","example[18]":"For an executive car, the BMW’s depreciation is relatively low."}