{"word[0]":"parliament","definition[0]":"the group of people who are elected to make a country’s laws and discuss important national affairs","example[0]":"They demanded a free parliament and press.","definition[1]":"the period during which the British Parliament meets","example[1]":"We expect to get these laws passed during the present parliament.","collocation[0]":"be elected to parliament","example[2]":"She was elected to parliament in 1997.","collocation[1]":"stand for parliament","example[3]":"Ms Jackson stood for Parliament as a Labour candidate.","collocation[2]":"enter/get into parliament","example[4]":"Tony Blair first entered Parliament in 1983.","collocation[3]":"be returned to Parliament","example[5]":"Creevey was returned to Parliament as MP for Appleby.","collocation[4]":"a bill is passed by parliament","example[6]":"The bill was passed by Parliament last May.","collocation[5]":"a bill goes through parliament","example[7]":"The bill is currently going through Parliament.","collocation[6]":"go before/be put before parliament","example[8]":"The Bill goes before Parliament on November 16.","collocation[7]":"dissolve parliament","example[9]":"The prime minister will ask the Queen to dissolve Parliament and call an election.","collocation[8]":"a member of parliament","example[10]":"He was the Conservative member of Parliament for Edgbaston.","collocation[9]":"an act of parliament","example[11]":"Their rights are guaranteed by Act of Parliament.","collocation[10]":"a seat in parliament","example[12]":"If Morgan resigns his seat in Parliament, there will be a bye-election.","collocation[11]":"a session of parliament","example[13]":"The Queen opened a new session of Parliament last week.","collocation[12]":"the lifetime of a parliament","example[14]":"We shall not make changes in this area, at least in the lifetime of this Parliament.","explanation[0]":"In meanings 1 and 2, parliament is usually followed by a singular verb","example[15]":"Parliament has been unable to agree","example[16]":"Parliament have been unable to agree","definition[2]":"the main law-making institution in the UK, which consists of the House of Commons and the House of Lords","example[17]":"The government has actually increased its majority in Parliament.","note[0]":"in Parliament","definition[3]":"the group of people elected to make a country’s laws and discuss important national issues","example[18]":"The Dutch parliament voted to begin lifting economic sanctions."}