{"word[0]":"mould","signpost[0]":"shaped container","definition[0]":"a hollow container that you pour a liquid or soft substance into, so that when it becomes solid, it takes the shape of the container","example[0]":"Another method, used especially for figures, was to pour the clay into a mould.","example[1]":"lime jello in a mould","signpost[1]":"type of person","definition[1]":"if someone is in a particular mould, or fits into a particular mould, they have all the attitudes and qualities typical of a type of person","example[2]":"She didn’t quite fit into the standard ‘high-flying businesswoman’ mould.","note[0]":"fit (into) a mould","example[3]":"a socialist intellectual in the mould of Anthony Crosland","note[1]":"in the same mould (as somebody/something)/in the mould of somebody/something","signpost[2]":"growing substance","definition[2]":"a soft green, grey, or black substance that grows on food which has been kept too long, and on objects that are in warm wet air","example[4]":"The chemical was used to kill a mold that grows on peanuts.","example[5]":"The walls were black with mould.","heading[0]":"– Meanings 2 & 3","collocation[0]":"break the mould","example[6]":"The program broke the mould of the traditional TV chat show.","collocation[1]":"fit the mould","example[7]":"She doesn't fit the mould of the stereotypical mother.","collocation[2]":"be in the mould of somebody/something","example[8]":"As an actor he is in the mould of Bruce Lee.","collocation[3]":"be cast in a mould","example[9]":"He didn't want to be cast in the mould of being an academic.","collocation[4]":"come from a different/the same mould","example[10]":"He clearly comes from a different mould than his brother.","collocation[5]":"the traditional/classic mould","example[11]":"He was not a conservative in the traditional mould.","definition[3]":"to shape a soft substance by pressing or rolling it or by putting it into a mould","example[12]":"moulded plastic chairs","example[13]":"Mould the sausage meat into little balls.","note[2]":"mould something into something","definition[4]":"to influence the way someone’s character or attitudes develop","example[14]":"an attempt to mold public opinion","example[15]":"I try to take young athletes and mold them into team players.","note[3]":"mould something/somebody into something","definition[5]":"to fit closely to the shape of something, or to make something fit closely","example[16]":"The lining of the boot molds itself to the shape of your foot.","note[4]":"mould (something) to something","example[17]":"Her wet dress was moulded to her body."}