{"word[0]":"disaster","definition[0]":"a sudden event such as a flood, storm, or accident which causes great damage or suffering","example[0]":"One hundred and twenty people died in China’s worst air disaster.","example[1]":"the economic consequences of the Chernobyl nuclear disaster","example[2]":"The 1987 hurricane was the worst natural disaster to hit England for decades.","example[3]":"Their expedition nearly ended in disaster, when one of the climbers slid off the mountain.","example[4]":"The drought could spell disaster for wildlife.","example[5]":"Disaster struck when two men were killed during their parachute jumps.","example[6]":"The peace process was on the brink of disaster.","example[7]":"Luckily the pilot saw the other plane just in time, and a disaster was narrowly averted.","example[8]":"The oil spill was a disaster for Alaskan sea animals.","note[0]":"disaster for","definition[1]":"something that is very bad or a failure, especially when this is very annoying or disappointing","example[9]":"The evening was an unmitigated disaster (=a complete failure).","example[10]":"Five small boys on skis is a recipe for disaster (=is very likely to end badly).","example[11]":"Because of the weather, the parade was a total disaster.","note[1]":"something is a complete/total/disaster","example[12]":"The cuts in funding will be a disaster for the schools.","heading[0]":"– Meaning 1: a sudden event such as a flood, storm, or accident which causes great damage or suffering","form[0]":"ADJECTIVES/NOUN + disaster","collocation[0]":"a natural disaster","example[13]":"In recent years there has been an increase in weather-related natural disasters.","collocation[1]":"an ecological/environmental disaster","example[14]":"This region is facing an ecological disaster as a result of toxic waste.","collocation[2]":"an air/rail disaster","example[15]":"The crash was the worst rail disaster in Pakistan’s  history.","collocation[3]":"a nuclear disaster","example[16]":"A conflict could get out of hand and degenerate into nuclear disaster.","collocation[4]":"a terrible disaster","example[17]":"It was a terrible disaster which carried away a large part of the hillside.","collocation[5]":"a disaster strikes","example[18]":"Congress often gives millions of dollars in foreign aid when natural disasters strike.","collocation[6]":"prevent/avert a disaster","example[19]":"They called for an international programme to prevent the disaster happening again.","form[1]":"disaster + NOUN","collocation[7]":"a disaster area/zone","example[20]":"Military planes flew food supplies to the disaster area.","collocation[8]":"disaster relief","example[21]":"an emergency appeal for disaster relief","collocation[9]":"a disaster victim","example[22]":"Aid is being given to the disaster victims.","heading[1]":"– Meaning 2: something that is very bad or a failure, especially when this is very annoying or disappointing","collocation[10]":"a complete/total disaster","example[23]":"Last Saturday’s game was a complete disaster for our team.","collocation[11]":"a financial/economic/military etc disaster","example[24]":"The project was a financial disaster.","collocation[12]":"a national disaster","example[25]":"The Labour Party called the new government 'a national disaster'.","collocation[13]":"a personal disaster","example[26]":"I’d taken some professional risks and survived a few personal disasters.","collocation[14]":"an unmitigated disaster","example[27]":"The $24,000,000 movie was an unmitigated disaster.","collocation[15]":"a potential disaster","example[28]":"Always save a backup copy of your work to avoid potential disasters.","collocation[16]":"an impending disaster","example[29]":"She had a sense of impending disaster.","collocation[17]":"end in disaster","example[30]":"By the late 1990s his career had ended in disaster.","collocation[18]":"spell disaster","example[31]":"Bad luck and the recession spelt disaster for her business.","collocation[19]":"be on the brink of disaster","example[32]":"Once again the peace process was on the brink of disaster.","collocation[20]":"be a recipe for disaster","example[33]":"If you get married too young, it’s a recipe for disaster.","collocation[21]":"something is a disaster waiting to happen","example[34]":"The government’s educational reforms are a disaster waiting to happen.","definition[2]":"a sudden event such as an accident, or a natural event such as a flood or storm, which causes great damage or suffering","example[35]":"200 people died in the train disaster.","example[36]":"The earthquake was the worst natural disaster to hit India for over 50 years.","display[0]":"catastrophe","definition[3]":"a terrible event in which there is a lot of destruction, damage, suffering, or death over a wide area of the world","example[37]":"A large comet hitting the Earth would be a catastrophe.","example[38]":"We don’t want another nuclear catastrophe like Chernobyl.","example[39]":"Scientists say that the oil spill is an ecological catastrophe.","display[1]":"tragedy","definition[4]":"a very sad event, that shocks people because it involves death","example[40]":"It was a tragedy that he died so young.","example[41]":"the AIDS tragedy in Africa","display[2]":"debacle","definition[5]":"an event or situation that is a complete failure and is very embarrassing","example[42]":"The opening ceremony turned into a debacle.","example[43]":"The team is hoping to do better this game, after last week’s debacle against the Chicago Bears.","heading[2]":"natural disasters","display[3]":"earthquake","definition[6]":"a sudden shaking of the Earth’s surface that often causes a lot of damage","example[44]":"A powerful earthquake struck the Indonesian island of Sulawesi.","example[45]":"It was the biggest earthquake to hit the Pacific Northwest for 52 years.","definition[7]":"a very large amount of water that covers an area that is usually dry","example[46]":"Bangladesh has been hit by a series of devastating floods  (=very bad floods).","example[47]":"The crisis began with floods that covered one third of the countryside.","display[4]":"drought","definition[8]":"a long period of dry weather when there is not enough water for plants and animals to live","example[48]":"The country experienced its worst drought this century.","example[49]":"In East Africa, three years of drought have left 10 million people in urgent need of food and water.","display[5]":"famine","definition[9]":"a situation in which a large number of people have little or no food for a long time and many people die","example[50]":"Poor harvests led to famine.","example[51]":"4,000,000 people are threatened by famine in northern Ethiopia.","display[6]":"hurricane","definition[10]":"a storm that has very strong fast winds and that moves over water – used about storms in the North Atlantic Ocean","example[52]":"extreme weather such as hurricanes","example[53]":"Hurricane Andrew left southern Florida in ruins.","display[7]":"typhoon","definition[11]":"a violent tropical storm – used about storms in the Western Pacific Ocean","example[54]":"A typhoon has hit the Philippines, lifting roofs off houses and uprooting trees.","display[8]":"tsunami","definition[12]":"a very large wave, caused by extreme conditions such as an earthquake, which can cause a lot of damage when it reaches land","example[55]":"Thousands of people were killed in the tsunami.","example[56]":"Many Pacific earthquakes have generated tsunamis.","example[57]":"100 people died in the mining disaster.","example[58]":"Hurricane Katrina was the worst natural disaster ever to hit New Orleans.","definition[13]":"a complete failure","example[59]":"Disaster could strike if the company is outbid by many of its expected rivals for the franchise.","example[60]":"What is good news for shoppers can be a disaster for share- holders."}