{"word[0]":"pleasure","definition[0]":"the feeling of happiness, enjoyment, or satisfaction that you get from an experience","example[0]":"She sipped her drink with obvious pleasure.","note[0]":"with pleasure","example[1]":"Are you taking the trip for business or pleasure?","note[1]":"for pleasure","definition[1]":"an activity or experience that you enjoy very much","example[2]":"the simple pleasures of life","example[3]":"Carol was a pleasure to work with.","note[2]":"be a pleasure to read/work with/watch etc","definition[2]":"used to be polite when you are meeting someone, asking for something, agreeing to do something etc","example[4]":"It’s been a pleasure to meet you.","example[5]":"May I have the pleasure of seeing you again?","note[3]":"have the pleasure of (doing) something","example[6]":"‘Give the kids a hug for me.’ ‘With pleasure.’","note[4]":"It’ll be a pleasure/With pleasure","collocation[0]":"take pleasure in (doing) something","example[7]":"He takes great pleasure in boasting about his big salary.","collocation[1]":"get pleasure from/out of something","example[8]":"Young children get a lot of pleasure from dressing up.","collocation[2]":"find pleasure in (doing) something","example[9]":"I find great pleasure in reading.","collocation[3]":"give (somebody) pleasure","example[10]":"Over the years, painting has given me a lot of pleasure.","collocation[4]":"bring pleasure to somebody","example[11]":"His singing has brought pleasure to millions.","collocation[5]":"derive pleasure from something","example[12]":"I derive great pleasure from playing chess.","collocation[6]":"great/enormous/immense pleasure","example[13]":"Steinbeck’s books have brought enormous pleasure to many people.","collocation[7]":"sheer/pure pleasure","example[14]":"He studied ancient languages for the sheer pleasure of learning.","collocation[8]":"genuine/real pleasure","example[15]":"She smiled with genuine pleasure.","collocation[9]":"perverse pleasure","example[16]":"Some people derive perverse pleasure from the suffering of others.","collocation[10]":"a source of pleasure","example[17]":"Her garden was a constant source of pleasure.","definition[3]":"the feeling you have when you are doing something you enjoy or when something very nice has happened to you","example[18]":"Most craftsmen get a lot of pleasure out of making things.","example[19]":"His music has brought pleasure to people all over the world.","display[0]":"happiness","definition[4]":"the feeling you have when you are happy","example[20]":"Happiness is more important than money.","example[21]":"Pauline was willing to do anything for her children’s happiness.","example[22]":"I doubt she’ll find happiness with Gary.","display[1]":"joy","definition[5]":"a deep feeling of great happiness, because something good has happened","example[23]":"It’s hard to describe the joy we felt, seeing each other again after so many years.","example[24]":"They danced with joy when they heard the news.","display[2]":"delight","definition[6]":"great happiness and excitement, because of something good that has happened","example[25]":"To the audience’s delight, she agreed to play another song.","example[26]":"Imagine my delight when I found out that the house was for sale.","display[3]":"contentment","definition[7]":"a quietly happy and satisfied feeling, especially because you are happy with your work, your life etc","example[27]":"He moved to the country and found contentment for the first time in his life.","example[28]":"She settled back in her chair and sighed with contentment.","display[4]":"euphoria","definition[8]":"an extremely strong feeling of happiness and excitement that continues for a short time","example[29]":"The whole country experienced a period of euphoria after the war ended.","example[30]":"the euphoria that parents feel after the birth of a child","display[5]":"elation","definition[9]":"a strong feeling of happiness and excitement, especially because you have achieved something","example[31]":"After she had made her first landing, she experienced a great sense of elation.","example[32]":"The troops’ sense of elation at the victory was not to last."}