{"word[0]":"demand","definition[0]":"the need or desire that people have for particular goods and services","example[0]":"Production is increasing faster than demand.","example[1]":"the demand for new housing","note[0]":"demand for","example[2]":"As a speaker he was always in demand.","note[1]":"in demand","definition[1]":"a very firm request for something that you believe you have the right to get","example[3]":"demonstrations in support of the nationalists’ demands","example[4]":"their demand for higher salaries","example[5]":"demands that he should resign","note[2]":"demand that","form[0]":"ADJECTIVES/NOUN + demand","example[6]":"Demand for housing is higher than ever.","example[7]":"Recently the demand for new cars has been relatively low.","collocation[0]":"a big demand","example[8]":"There’s always a big demand for photographs of celebrities.","collocation[1]":"a great/huge demand","example[9]":"There is a huge demand for business software and services.","collocation[2]":"increased/increasing/growing demand","example[10]":"One of the problems is the growing demand for housing.","collocation[3]":"falling demand","example[11]":"the falling demand for coal","collocation[4]":"consumer demand","example[12]":"Consumer demand for new technology is strong.","collocation[5]":"meet/satisfy demand","example[13]":"There are reports that the company cannot produce enough to meet demand.","collocation[6]":"keep up with demand","example[14]":"Public funding for higher education has not kept up with demand.","collocation[7]":"cope with demand","example[15]":"The existing services were not capable of coping with the demand for advice.","collocation[8]":"increase/boost demand","example[16]":"A very hard winter boosted the demand for natural gas.","collocation[9]":"reduce demand","example[17]":"Higher interest rates reduce the demand for credit.","collocation[10]":"demand rises/increases","example[18]":"Demand for energy has continued to rise.","collocation[11]":"demand falls","example[19]":"Demand for the products has fallen in the last six months.","collocation[12]":"be much in demand","example[20]":"Fuel-efficient cars are now much in demand.","collocation[13]":"supply outstrips/exceeds demand","example[21]":"In the 1980s, the supply of grain far exceeded the demand.","collocation[14]":"a lack of demand","example[22]":"Many factories closed through lack of demand.","collocation[15]":"a surge in demand","example[23]":"There’s often a surge in demand for the Internet at the weekend.","definition[2]":"to ask for something very firmly, especially because you think you have a right to do this","example[24]":"Angry demonstrators demanded the resignation of two senior officials.","example[25]":"‘Where are you going?’ she demanded angrily.","example[26]":"I demand to know what’s going on.","note[3]":"demand to know/see/have etc something","example[27]":"They demanded that the military government free all political prisoners.","example[28]":"It seemed that no matter what she did, more was demanded of her.","note[4]":"demand something of somebody","definition[3]":"if one thing demands another, it needs that thing in order to happen or be done successfully","example[29]":"Too many things demanded his attention at the same time.","example[30]":"It’s a desperate situation demanding a desperate remedy.","heading[0]":"GRAMMAR: Patterns with demand","explanation[0]":"You demand something","example[31]":"I demand an explanation!","explanation[1]":"You demand to do something","example[32]":"She demanded to see the manager","explanation[2]":"In everyday English, you demand that someone does something","example[33]":"I demand that he apologizes","explanation[3]":"In formal English, you demand that someone do something, using the base form of the verb  (=the infinitive without ‘to’)","example[34]":"His opponents are demanding that he resign","bad_example[0]":"demand someone to do something","explanation[4]":"You use the base form of the verb when talking about the past  In everyday English, people also say","example[35]":"They demanded that he resign","example[36]":"They demanded that he resigned","explanation[5]":"You demand that someone should do something  This pattern is often used in the past, when reporting what someone has demanded","example[37]":"His opponents demanded that he should resign","definition[4]":"the amount of spending on goods and services by companies and people in a particular economy","example[38]":"Demand in the US economy generated 23 million new jobs during the 1990s.","definition[5]":"the total amount of a type of goods or services that people or companies buy in a particular period of time","example[39]":"Lower interest rates did nothing to increase demand for loans to buy houses.","example[40]":"There was a very strong demand for jeans and T-shirts over the last month.","example[41]":"Chrysler said its Jeep plant won’t operate next week because of weak demand.","definition[6]":"the total amount of a type of goods or services that people or companies would buy if they were available","example[42]":"Power companies have been forced to reduce voltage when demand exceeded available supplies during extreme cold or hot spells.","example[43]":"Demand for phone service in Thailand far outstrips the supply with back orders totaling about one million.","definition[7]":"the idea that the more something costs, the less demand for it there is"}