{"word[0]":"sight","signpost[0]":"ability to see","definition[0]":"the physical ability to see","synonym[0]":"vision","example[0]":"Anne’s sight is very good for someone of her age.","example[1]":"He began to lose his sight six years ago.","example[2]":"an emergency operation to save his sight","example[3]":"You will get a free sight test if you are under 16.","signpost[1]":"act of seeing","definition[1]":"the act of seeing something","example[4]":"The house is hidden from sight behind trees.","example[5]":"Just the sight of him made her go all weak.","note[0]":"sight of","example[6]":"Marcie will faint at the sight of blood.","note[1]":"at the sight of something","signpost[2]":"thing you see","definition[2]":"something you can see","example[7]":"As he reached the front door, he saw a strange sight.","example[8]":"the sights and sounds of the forest","example[9]":"Street dentists are a common sight in Pakistan.","note[2]":"familiar/common/rare etc sight","definition[3]":"famous or interesting places that tourists visit","example[10]":"In the afternoon, you’ll have a chance to relax or see the sights.","example[11]":"So, Maria’s showing you the sights of Copenhagen, is she?","definition[4]":"the part of a gun or other weapon that guides your eye when you are aiming at something","collocation[0]":"good sight","example[12]":"Many types of fish have good sight.","collocation[1]":"poor sight","example[13]":"His sight was quite poor.","collocation[2]":"failing sight","example[14]":"He ran the business until failing sight forced him to retire.","collocation[3]":"lose your sight","example[15]":"As the result of a severe illness, she lost her sight at the age of twelve.","collocation[4]":"save somebody’s sight","example[16]":"Surgeons believe they can save her sight.","collocation[5]":"somebody’s sight fails","example[17]":"He was in his seventies when his sight began to fail.","form[0]":"sight + NOUN","collocation[6]":"a sight test","example[18]":"If your sight test shows that you need glasses, the optician will give you a prescription.","heading[0]":"something that you see","example[19]":"A herd of elephants is a magnificent sight.","example[20]":"Even Charles cheered up at the sight of the food.","display[0]":"view","definition[5]":"the area you can see from a window or place, especially when it is beautiful","example[21]":"The view from the top of the mountain is amazing.","example[22]":"The hotel has great views of Lake Windermere.","example[23]":"We had a good view of the firework display.","display[1]":"panorama","definition[6]":"an impressive view of a very large area that stretches a long way across in front of you","example[24]":"a panorama of snow-covered hills and mountains","display[2]":"vista","definition[7]":"a view of a large area of beautiful scenery – used in written descriptions","example[25]":"The road around the island offers some spectacular vistas.","display[3]":"scene","definition[8]":"what you see in a place, especially where people are moving around and doing things","example[26]":"Reporters described the horrific scenes which followed the bombing.","example[27]":"His pictures are mainly of local scenes.","display[4]":"spectacle","definition[9]":"something that you see that is very unusual, surprising, or strange","example[28]":"It must have been an unusual spectacle.","example[29]":"I leaned over the balcony to get a look at the spectacle below.","display[5]":"visuals","definition[10]":"pictures or parts of a film, video etc that people can see, as opposed to the parts you can hear","example[30]":"Good visuals will help keep your audience’s attention.","definition[11]":"to see something from a long distance away, or see something you have been looking for","example[31]":"The sailors gave a shout of joy when they sighted land.","example[32]":"Several rare birds have been sighted in the area.","definition[12]":"words written on a BILL OF EXCHANGE or PROMISSORY NOTE to show that it must be paid as soon as it is shown to the ACCEPTOR","example[33]":"The more usual situation is where payment is at sight, meaning when the paying bank has examined the documents and found them to be in order.","definition[13]":"words written on a BILL OF EXCHANGE or PROMISSORY NOTE to show how much later it will be paid after it has been given to the payer, usually 30,60, or 90 days later","definition[14]":"a financial document that is payable at sight must be paid when it is received by the person who is responsible for paying it","definition[15]":"a financial document that is payable after sight must be paid on a stated number of days after it is received by the person who is responsible for paying it"}