{"word[0]":"grant","definition[0]":"to give someone something or allow them to have something that they have asked for","example[0]":"Britain could grant Spain’s request.","example[1]":"I would love to be able to grant her wish.","example[2]":"The council have granted him permission to build on the site.","note[0]":"grant somebody something","example[3]":"A licence to sell alcohol was granted to the club.","note[1]":"grant something to somebody","example[4]":"Grant that we may know your presence and love.","note[2]":"grant that","explanation[0]":"In everyday English, people usually say give permission rather than grant permission:","example[5]":"They gave him permission to stay.","definition[1]":"to admit that something is true although it does not make much difference to your opinion","example[6]":"He’s got talent, I grant you, but he doesn’t work hard enough.","definition[2]":"an amount of money given to someone, especially by the government, for a particular purpose","example[7]":"The university gets a government grant.","example[8]":"Anyone wishing to apply for a grant should write to the Treasurer.","example[9]":"a grant of £50,000","note[3]":"grant of","example[10]":"These studios are funded by a grant from the Kress Foundation.","note[4]":"grant from","form[0]":"NOUN + grant","collocation[0]":"a government grant","example[11]":"The school has won a £240,000 government grant to improve its science and technology areas.","collocation[1]":"a research grant","example[12]":"He received a research grant to study the effect of pollution on the environment.","collocation[2]":"a student grant","example[13]":"If you are on a low income, you may be able to get a student grant.","collocation[3]":"a block grant","example[14]":"Congress approved block grants for education, health, and social services.","collocation[4]":"a grant of £5,000, $8,000 etc","example[15]":"The library received a grant of $20,000 to improve its computer facilities.","collocation[5]":"apply for a grant","example[16]":"We could apply for a grant and start a serious research programme.","collocation[6]":"be eligible for a grant","example[17]":"This booklet explains who is eligible to receive a grant.","collocation[7]":"get/obtain a grant","example[18]":"You may be able to get a grant to learn a trade.","collocation[8]":"receive a grant","example[19]":"It is likely that you will receive a grant to cover your tuition.","collocation[9]":"give/award somebody a grant","example[20]":"If you have been awarded a grant, you must send the details to the university.","collocation[10]":"be funded by a grant","example[21]":"The expansion of the computer department was funded by a government grant.","definition[3]":"a sum of money given to a person or organization for a particular purpose, often by a government","example[22]":"West Berlin’s Free University was founded with major grants from the Ford Foundation.","example[23]":"The Arts Council awarded (=gave) her  a grant of £2200 for a photographic mission to the Andes.","definition[4]":"to officially give a person or an organization something they have asked for","example[24]":"The government granted the U.S. company timber rights to a 28,000-square-mile area.","example[25]":"The company has been granted a temporary license to continue mining."}