{"word[0]":"project","definition[0]":"a carefully planned piece of work to get information about something, to build something, to improve something etc","example[0]":"The project aims to provide an analysis of children’s emotions.","example[1]":"a three-year research project","example[2]":"The scheme will now be extended after a successful pilot project (=a small trial to test if an idea will be successful).","example[3]":"The project is funded by Wellcome plc.","example[4]":"a project manager","example[5]":"a project to develop a substitute for oil","note[0]":"project to do something","definition[1]":"a part of a school or college course that involves careful study of a particular subject over a period of time","example[6]":"a geography project","example[7]":"We’re doing a project on pollution.","note[1]":"project on","definition[2]":"a housing project","form[0]":"ADJECTIVES/NOUN + project","collocation[0]":"a research project","example[8]":"The aim of this research project is to study modern food habits.","collocation[1]":"a construction project","example[9]":"Spending on new construction projects has been reduced.","collocation[2]":"a development project","example[10]":"Our aim is assess the environmental impact of new development projects.","collocation[3]":"a pilot project","example[11]":"These changes were shelved after pilot projects showed poor results.","collocation[4]":"a major project","example[12]":"The company is funding a major research project into the causes of addiction.","collocation[5]":"an ambitious project","example[13]":"Young people often enjoy the challenge of an ambitious project.","example[14]":"Was the project successful?","collocation[6]":"work on a project","example[15]":"A team has been working on the project for three years.","collocation[7]":"be involved in a project","example[16]":"I am involved in various projects.","collocation[8]":"set up a project","example[17]":"$30 million would be required to set up the project.","collocation[9]":"embark on a project","example[18]":"He was embarking on the biggest project of his career.","collocation[10]":"complete a project","example[19]":"The project was completed on time.","form[1]":"project + NOUN","collocation[11]":"a project manager/leader","example[20]":"The project manager is responsible for sorting this out.","collocation[12]":"a phase/stage of a project","example[21]":"The first phase of the project was due to be completed by the end of 2008.","signpost[0]":"calculate","definition[3]":"to calculate what something will be in the future, using the information you have now","example[22]":"The company projected an annual growth rate of 3%.","example[23]":"projected sales figures","example[24]":"Total expenditure is projected to rise by 25%.","note[2]":"be projected to do something","signpost[1]":"stick out","definition[4]":"to stick out beyond an edge or surface","synonym[0]":"protrude","example[25]":"projecting teeth","example[26]":"Four towers projected from the main building.","note[3]":"project out/from/through etc","definition[5]":"to make the picture of a film, photograph etc appear in a larger form on a screen or flat surface","example[27]":"She projected the slide onto the wall.","note[4]":"project something onto something","signpost[2]":"yourself","definition[6]":"to try to make other people have a particular idea about you","example[28]":"I hope the team will project a smart professional image.","example[29]":"his attempts to project himself as a potential leader","note[5]":"project yourself (as something)","signpost[3]":"send","definition[7]":"to make something move up or forwards with great force","example[30]":"The plant projects its seeds over a wide area.","signpost[4]":"success","definition[8]":"to make someone quickly have success or a much better job","example[31]":"His success projected him onto Channel 4‘s comedy series ’Packet of Three'.","note[6]":"project somebody into/onto etc something","definition[9]":"to imagine that someone else is feeling the same emotions as you","example[32]":"You’re projecting your insecurity onto me.","note[7]":"project something on/onto somebody","definition[10]":"an important and carefully planned piece of work that will create something new or improve a situation","example[33]":"the country’s largest everconstruction project","example[34]":"San Miguel plans to finance the project 42% from equity and 58% from loans.","example[35]":"a joint copper-miningresearch project","example[36]":"The project is scheduled to be completed in early 2009.","definition[11]":"money needed for a large building project, usually in the form of investment loans","example[37]":"Olympia & York Developments Ltd. is negotiating long-term project financing for its Canary Wharf development in London.","definition[12]":"to calculate what the size, amount, or rate of something will be in the future","example[38]":"California Microwave dropped 2 points after itprojected earnings of 19 cents a share for the third quarter.","example[39]":"Sources said that privately the company is projecting a bigger decline."}