{"word[0]":"prisoner","definition[0]":"someone who is kept in a prison as a legal punishment for a crime or while they are waiting for their trial","note[0]":"remand prisoner British English (=someone who is in prison waiting for their trial)","example[0]":"Relationships between the staff and the prisoners are good.","example[1]":"Prisoners here only serve short sentences.","example[2]":"The organization is arguing for the release of political prisoners (=people in prison because of their political opinions).","definition[1]":"someone who is taken by force and kept somewhere","synonym[0]":"captive","example[3]":"Our pilot was taken prisoner.","example[4]":"The army advanced, taking 200,000 prisoners.","example[5]":"The guerrillas kept her prisoner for three months.","note[1]":"hold/keep somebody prisoner","example[6]":"He was being held prisoner.","definition[2]":"someone who is in a place or situation from which they cannot escape","example[7]":"He is a prisoner of his own past.","form[0]":"ADJECTIVES/NOUN + prisoner","collocation[0]":"a remand prisoner","example[8]":"A prison governor is refusing to accept any more remand prisoners.","collocation[1]":"a condemned prisoner","example[9]":"There is an appeal process for condemned prisoners.","collocation[2]":"a political prisoner","example[10]":"They demanded that the military government free all political prisoners.","collocation[3]":"an escaped prisoner","example[11]":"Soldiers arrived, looking for escaped prisoners.","collocation[4]":"release/free a prisoner","example[12]":"Hundreds of prisoners were released.","definition[3]":"someone who is kept in a prison as a punishment for a crime, or while they are waiting for their trial","example[13]":"Prisoners may be locked in their cells for twenty-two hours a day.","example[14]":"a prisoner serving a life sentence for murder","display[0]":"convict","definition[4]":"someone who has been found guilty of a crime and sent to a prison. Convict is used especially about someone who is sent to prison for a long time. It is more commonly used in historical descriptions, or in the phrase an escaped convict","example[15]":"The convicts were sent from England to Australia.","example[16]":"Police were hunting for an escaped convict.","example[17]":"Low-risk convicts help to fight forest fires and clean up public lands.","display[1]":"inmate","definition[5]":"someone who is kept in a prison or a mental hospital","example[18]":"Some inmates are allowed to have special privileges.","example[19]":"He was described by a fellow inmate as a quiet man.","definition[6]":"someone who is kept somewhere and not allowed to go free, especially in a war or fighting. Captive is a rather formal word which is used especially in literature","example[20]":"Their objective was to disarm the enemy and release the captives.","example[21]":"She was held captive (=kept as a prisoner) in the jungle for over three years.","display[2]":"prisoner of war","definition[7]":"a soldier, member of the navy etc who is caught by the enemy during a war and kept in the enemy’s country","example[22]":"My grandad was a prisoner of war in Germany.","example[23]":"They agreed to release two Iranian prisoners of war.","display[3]":"hostage","definition[8]":"someone who is kept somewhere as a prisoner, in order to force people to agree to do something, for example in order to get money or to achieve a political aim","example[24]":"Diplomats are continuing their efforts to secure the release of the hostages.","example[25]":"The US hostages were held in Tehran for over a year.","display[4]":"detainee/internee","definition[9]":"someone who is kept in a prison, usually because of their political views and often without a trial","example[26]":"In some cases, political detainees have been beaten or mistreated.","example[27]":"23,531 people passed through the camps between 1944 and 1962, including 14,647 political internees.","example[28]":"the detainees at Guantanamo Bay","definition[10]":"a British television series about a man who is made to live in a strange village. He is called ‘number six’ and says ‘I am not a number. I am a free man’. The head man in the village is ‘number two’, and the relationship between them and the whole situation, are very mysterious. The Prisoner, made in 1967–68, is still popular, with the sign connected with the programme, an old-fashioned bicycle called a penny-farthing, still being recognized."}