{"word[0]":"service","signpost[0]":"official system/organization","definition[0]":"the official system for providing something, especially something that everyone in a country needs to have, or the official organization that provides it","example[0]":"the health service","example[1]":"the postal service","example[2]":"the police service","example[3]":"the prison service","example[4]":"Workers in the emergency services (=the police, hospital, and the fire service) are forbidden from striking.","example[5]":"There has been a decline in public services in recent years.","example[6]":"the essential services (=the police, hospitals, fire service, and organizations that provide basic things such as water, gas, or electricity)","signpost[1]":"something provided by a company","definition[1]":"a particular type of help or work that is provided by a business to customers, but not one that involves producing goods","example[7]":"A wide range of financial services are available.","example[8]":"Datapost offers a delivery service to over 160 countries.","note[0]":"provide/offer a service","example[9]":"Our aim is to provide the best service at the lowest price.","example[10]":"the supply of goods and services","signpost[2]":"in a shop/restaurant/bar","definition[2]":"the help that people who work in a shop, restaurant, bar etc give you","example[11]":"Service is included in your bill  (=the charge for paying the people who serve you is included).","example[12]":"The service was terrible and so was the food.","note[1]":"good/bad/slow etc service","example[13]":"At our bank, we insist on high standards of customer service.","note[2]":"customer service","definition[3]":"the work that someone does for a person or organization, especially over a long period","example[14]":"a long service award","example[15]":"a career in public service (=work done for the public or the government)","example[16]":"Brian retired after 25 years of service to the company.","note[3]":"20/30 years etc of service","example[17]":"He received an award for services to sport.","note[4]":"services to somebody/something","signpost[3]":"being used","definition[4]":"used to talk about whether a piece of equipment, a vehicle etc is available to be used, or how long it can be used","example[18]":"Steel tools give good service for years.","note[5]":"give good/excellent etc service","example[19]":"These trains have been in service for many years.","note[6]":"in service","example[20]":"The escalator is out of service.","note[7]":"out of service","signpost[4]":"religious ceremony","definition[5]":"a formal religious ceremony, especially in church","example[21]":"The service was held in the chapel.","note[8]":"hold/conduct a service","example[22]":"a memorial service for the disaster victims","note[9]":"marriage/funeral/christening etc service","definition[6]":"help that you give to someone","example[23]":"He did her a service by telling her the truth.","note[10]":"do somebody a service","example[24]":"My secretary is at your service.","note[11]":"be at somebody’s service","example[25]":"Can I be of any service?","note[12]":"be of service (to somebody)","signpost[5]":"checks on a car/machine","definition[7]":"an examination and repair of a machine or car to keep it working properly","example[26]":"I’m getting the bus home – my car’s in for a service.","signpost[6]":"tennis/ball game","definition[8]":"an act of hitting a ball through the air in order to start a game, especially in tennis","example[27]":"It’s your service.","signpost[7]":"plates/cups etc","definition[9]":"a set of plates, bowls, cups etc that match each other","signpost[8]":"bus/train/plane etc","definition[10]":"a regular journey made by a bus, train, boat etc to a particular place at a particular time","example[28]":"the 8:15 service to Cambridge","signpost[9]":"legal document","definition[11]":"when someone is given a legal document telling them that they must do something or that something is going to happen","example[29]":"the service of a summons","definition[12]":"if someone services a machine or vehicle, they examine it and do what is needed to keep it working well","example[30]":"The plumber came to service the boiler.","example[31]":"I'm having the car serviced next week.","note[13]":"have something serviced","explanation[0]":"Service is often used in the passive in this meaning","definition[13]":"to provide people with something they need or want","example[32]":"schools that service local communities","definition[14]":"business that involves selling help and advice, or delivering goods etc for customers, rather than manufacturing goods","example[33]":"He charged a £600,000 fee for consulting services.","definition[15]":"the regular work done by a public or other large national organization, or the organization itself","example[34]":"For many years, the statepostal service fell outside the monopoly rules.","definition[16]":"a system of regular flights etc between two places","example[35]":"The airline has opened a trans-Atlantic service between Toronto and Singapore.","example[36]":"a daily air service between London and Paris","definition[17]":"an organization or department that provides advice and help, for example on legal or personal problems","example[37]":"Acounselling service can provide employees with appropriate support.","definition[18]":"the help given to customers by people working in a shop, restaurant etc","example[38]":"Our service standards are monitored to ensure they remain at a consistently high level.","definition[19]":"the work an employee does for a company or organization","example[39]":"There are automatic pay increases based on length of service.","definition[20]":"service roads, stairs, lifts etc are for the use of people working in a place or delivering goods to it, rather than the general public","example[40]":"A new service road and tanker turning area is proposed for the site.","definition[21]":"to pay a debt, loan etc","example[41]":"Cardholders are having troubleservicing their debtsto the lender.","definition[22]":"if a financial institution services loans, debts etc, it manages them for another company, for example by collecting payments, calculating interest etc","example[42]":"We currently service loans for more than 15 million customers nationwide.","definition[23]":"to examine a machine or piece of equipment and to mend it if necessary","example[43]":"Compaq relies heavily on independent dealers to sell and service its computers.","definition[24]":"to provide a particular service, such as help, advice, transport etc","example[44]":"Our customers in Mexico are serviced through a network of independent insurance firms."}