{"word[0]":"suggest","definition[0]":"to tell someone your ideas about what they should do, where they should go etc","example[0]":"The zoo asked its visitors to suggest a name for the new baby panda.","example[1]":"It has been suggested that the manager will resign if any more players are sold.","example[2]":"May I suggest that you think carefully before rushing into this?","note[0]":"can/may I suggest","example[3]":"Her mother suggested that she should go and see the doctor.","note[1]":"suggest (that)","example[4]":"I suggest you call him first.","example[5]":"Johnson suggested to Boswell that they should buy the island. ","note[2]":"suggest something to somebody","example[6]":"Tracey suggested meeting for a drink after work.","note[3]":"suggest doing something","example[7]":"Can you suggest what kind of tool I should use?","note[4]":"suggest how/where/what etc","definition[1]":"to make someone think that a particular thing is true","synonym[0]":"indicate","example[8]":"Trends in spending and investment suggest a gradual economic recovery.","example[9]":"The evidence suggests that single fathers are more likely to work than single mothers.","note[5]":"evidence/results/data/studies etc suggest(s) that","example[10]":"Opinion polls suggest that only 10% of the population trust the government.","definition[2]":"to tell someone about someone or something that is suitable for a particular job or activity","synonym[1]":"recommend","example[11]":"John Roberts has been suggested for the post of manager.","note[6]":"suggest somebody/something for something","definition[3]":"to state something in an indirect way","synonym[2]":"imply","example[12]":"Are you suggesting my husband’s been drinking?","definition[4]":"to remind someone of something or help them to imagine it","example[13]":"The stage was bare, with only the lighting to suggest a prison.","heading[0]":"GRAMMAR: Patterns with suggest","explanation[0]":"You suggest something to someone","example[14]":"He suggested a solution to us","bad_example[0]":"He suggested us a solution","explanation[1]":"You suggest doing something","example[15]":"I suggested going for a walk in the park","bad_example[1]":"I suggested to go for a walk in the park","explanation[2]":"In everyday English, you suggest that someone does something","example[16]":"I suggest that she waits a few weeks","bad_example[2]":"I suggest her to wait a few weeks","explanation[3]":"In more formal English, you suggest that someone do something, using the base form of the verb  (=the infinitive without ‘to’)","example[17]":"I suggest that she wait a few weeks","explanation[4]":"You can also use the base form of the verb when talking about the past","example[18]":"I suggested that she wait a few weeks","explanation[5]":"You suggest that someone should do something","example[19]":"The doctor suggested that she should sit down","explanation[6]":"In more formal English, you can say it has been suggested that something is true","example[20]":"It has been suggested that the substance can cause cancer","definition[5]":"to tell someone your ideas about what they should do","example[21]":"'Why don’t you come with us?', Alan suggested.","example[22]":"It was a sunny afternoon and so I suggested going to the beach.","definition[6]":"to suggest that someone goes somewhere, tries something etc because you know that it is good and you think they will like it","example[23]":"Can you recommend a good restaurant near here?","example[24]":"It’s a brilliant book - I’d recommend it to anyone.","display[0]":"propose","definition[7]":"to formally suggest a plan or course of action, especially at a meeting","example[25]":"The government has proposed building a new town just north of the city.","example[26]":"I propose that we send a delegation to London to discuss our concerns.","display[1]":"put forward","definition[8]":"to suggest an idea, plan, reason etc","example[27]":"The party has put forward new proposals to reduce the number of cars in the town centre.","example[28]":"The idea was first put forward by Aristotle.","example[29]":"A number of reasons have been put forward to explain these negative results.","display[2]":"nominate","definition[9]":"to officially suggest someone for an important job or position, or a person, film etc for a prize, especially when people will vote to make a decision","example[30]":"He’s been nominated for the Nobel Prize in Literature several times.","example[31]":"Three candidates have been nominated for the position of chairman."}