{"signpost[0]":"for a purpose","definition[0]":"for the purpose of doing something","example[0]":"Samuel trained every day in order to improve his performance.","example[1]":"In order to understand how the human body works, you need to have some knowledge of chemistry.","definition[1]":"so that something can happen or so that someone can do something","example[2]":"Sunlight is needed in order for the process of photosynthesis to take place in plants.","signpost[1]":"arrangement","definition[2]":"the way that things or events are arranged in relation to each other, so that one thing is first, another thing is second etc","synonym[0]":"sequence","example[3]":"There seemed to be no logical order to the sections.","example[4]":"Make sure that you put the books back in the right order.","note[0]":"in the right/correct order","example[5]":"The files are all out of order.","note[1]":"out of order/in the wrong order","example[6]":"Their names are arranged in alphabetical order.","note[2]":"in alphabetical order","example[7]":"The cities are listed in order of importance.","note[3]":"in order of importance/difficulty etc","example[8]":"Students learn the verbs in order of difficulty.","example[9]":"The prices are given in ascending order.","note[4]":"in ascending/descending order","example[10]":"She read out the names in reverse order.","note[5]":"in reverse order","example[11]":"Then they call out our names in order and we answer yes or no.","note[6]":"in order","signpost[2]":"instruction","definition[3]":"an instruction to do something that is given by someone in authority","example[12]":"The captain had to give the order to abandon ship.","note[7]":"order to do something","example[13]":"She is under orders to have a complete rest.","note[8]":"under orders (from somebody) (to do something)","example[14]":"He was thrown into the river on the emperor’s orders.","note[9]":"on somebody’s orders","example[15]":"The company cannot be identified by order of the court.","note[10]":"by order of somebody","signpost[3]":"controlled situation","definition[4]":"a situation in which rules are obeyed and authority is respected","example[16]":"the breakdown of law and order","example[17]":"The riots are a threat to public order.","example[18]":"The army was called in to restore order.","example[19]":"The physics teacher couldn’t keep order in any class.","note[11]":"keep order/keep somebody in order","example[20]":"She had trouble keeping her teenage sons in order.","signpost[4]":"well-organized state","definition[5]":"a situation in which everything is controlled, well organized, and correctly arranged","example[21]":"Let’s have some order in here.","example[22]":"You need to put your financial affairs in order.","example[23]":"She keeps her room in good order.","signpost[5]":"for food or drink","definition[6]":"a request for food or drink in a restaurant or bar","example[24]":"The waiter took our orders.","example[25]":"Last orders now please!","note[12]":"last orders","definition[7]":"the food or drink you have asked for in a restaurant or bar","example[26]":"When our order finally arrived we were very hungry indeed.","signpost[6]":"for goods","definition[8]":"a request by a customer for a company to supply goods","example[27]":"Goods will be sent within 24 hours of receiving your order.","example[28]":"You can always cancel your order if you change your mind.","example[29]":"The government has placed an order for (=asked a company to supply) new weapons.","example[30]":"Please complete the enclosed order form.","example[31]":"They make hand-made shoes to order.","note[13]":"make/supply something to order","example[32]":"My bicycle is on order.","note[14]":"on order","definition[9]":"goods that you have ordered from a company","example[33]":"Your order has arrived – you can collect it from the store any time.","signpost[7]":"social/economic situation","definition[10]":"the political, social, or economic situation at a particular time","example[34]":"The people of South Africa wanted a new order.","example[35]":"He dared to challenge the established (=traditional) order.","example[36]":"He called the rioters a threat to the social order.","note[15]":"social/political order","signpost[8]":"religious group","definition[11]":"a society of monks or nuns (=people who live a holy life according to religious rules)","example[37]":"the Benedictine Order","example[38]":"the order of Jesuits","note[16]":"order of","signpost[9]":"secret society","definition[12]":"an organization or a society whose members meet for secret ceremonies","signpost[10]":"official honour","definition[13]":"a group of people who have received a special official reward from a king, president etc for their services or achievements","example[39]":"the Order of the Garter","definition[14]":"an official piece of paper that can be exchanged for money","signpost[11]":"animals/plants","definition[15]":"a group of animals or plants that are considered together because they evolved from the same plant or animal","definition[16]":"a list of jobs that a computer has to do in a particular order","heading[0]":"– Meaning 2: the way that things or events are arranged in relation to each other, so that one thing is first, another thing is second etc","collocation[0]":"the right/correct order","example[40]":"Of course, the notes must be played in the right order.","collocation[1]":"the wrong order","example[41]":"The pages had been put in the wrong order.","collocation[2]":"the same order","example[42]":"He always closed the windows in the same order.","collocation[3]":"reverse order","example[43]":"They announced the results in reverse order, starting with the last.","collocation[4]":"alphabetical order","example[44]":"List the names in alphabetical order.","collocation[5]":"numerical order","example[45]":"The dogs are given numbers, and stand in numerical order while the judge looks at them.","collocation[6]":"chronological order","example[46]":"The paintings are arranged in chronological order.","collocation[7]":"ascending/descending order","example[47]":"The films are ranked in ascending order of profitability.","collocation[8]":"a logical order","example[48]":"Put the events of the story into a logical order.","collocation[9]":"put/arrange something in order","example[49]":"Decide what points you want to talk about, and put them in order.","collocation[10]":"in order of importance/priority/preference etc","example[50]":"The country’s main exports were, in order of importance, coffee, sugar, and soya beans.","heading[1]":"– Meaning 3: an instruction to do something that is given by someone in authority","collocation[11]":"give/issue an order","example[51]":"Do not fire until I give the order.","collocation[12]":"obey an order","example[52]":"He refused to obey this order.","collocation[13]":"follow orders/carry out orders","example[53]":"The men argued that they had only been following orders.","collocation[14]":"take orders from somebody","example[54]":"I don’t take orders from you!","collocation[15]":"disobey/ignore an order","example[55]":"Anyone who disobeys these orders will be severely punished.","collocation[16]":"have orders to do something","example[56]":"The soldiers had orders to shoot anyone on the streets after 10 o'clock.","collocation[17]":"receive an order","example[57]":"The general says he received no order to withdraw.","collocation[18]":"make an order","example[58]":"The court made an adoption order.","form[0]":"ADJECTIVES/NOUN + order","collocation[19]":"a direct order","example[59]":"What happens to a soldier who disobeys a direct order?","collocation[20]":"strict orders","example[60]":"They had strict orders not to allow anyone through.","collocation[21]":"a court order","example[61]":"Now they’re faced with a court order that could force them to leave.","collocation[22]":"an executive order","example[62]":"President Grant issued an executive order establishing a reservation for the Nez Perce Indians.","collocation[23]":"doctor’s orders","example[63]":"She was to rest as much as possible on doctor’s orders.","signpost[12]":"ask for food/drink","definition[17]":"to ask for food or a drink in a restaurant, bar etc","example[64]":"Anne ordered another glass of wine.","example[65]":"Are you ready to order?","example[66]":"He sat down and ordered a meal.","signpost[13]":"ask for goods","definition[18]":"to ask for goods or services to be supplied","example[67]":"I’ve ordered a new computer from the supplier.","example[68]":"I’ll order you a taxi.","note[17]":"order somebody something","signpost[14]":"tell somebody to do something","definition[19]":"to tell someone that they must do something, especially using your official power or authority","example[69]":"The court ordered his release from prison.","example[70]":"‘Stay right there, ’ she ordered.","example[71]":"Tom was ordered to pay £300 as compensation.","note[18]":"order somebody to do something","example[72]":"Her doctor had ordered her to rest for a week.","example[73]":"The soldiers were ordered back to their units.","note[19]":"be ordered back to something","example[74]":"He ordered that the house be sold.","note[20]":"order that","definition[20]":"to arrange something in an order","example[75]":"The list is ordered alphabetically.","heading[2]":"to tell someone they must do something","definition[21]":"to tell someone that they must do something, using your official power or authority","example[76]":"A policeman ordered him to stop.","example[77]":"He ordered his men to put down their weapons.","example[78]":"‘Don’t move, ’ he ordered.","definition[22]":"to say to someone that they must do something","example[79]":"Stop telling me what to do!","example[80]":"The headmaster told me to wait outside his office.","display[0]":"give orders/instructions","definition[23]":"to tell someone exactly what they must do","example[81]":"The police chief gave orders to shoot.","example[82]":"The doctor gave instructions that she should rest as much as possible.","display[1]":"command","definition[24]":"used about a high-ranking person such as a general, captain, or king ordering someone to do something","example[83]":"The general commanded the troops to fall back.","example[84]":"They believe that the Lord has commanded them to do this.","display[2]":"instruct","definition[25]":"to tell someone to do something, especially when you tell them exactly how it should be done","example[85]":"The architect was instructed to keep the plans simple.","example[86]":"She took three tablets every day, as instructed by her doctor.","definition[26]":"to give someone an official or legal order to do something","example[87]":"The judge directed the jury to find her not guilty.","display[3]":"subpoena","definition[27]":"to officially order someone to appear in a court of law in order to answer questions","example[88]":"Another three of the president’s advisors were subpoenaed.","definition[28]":"a request by a customer for goods or services","example[89]":"To place your order by telephone, call this number between 8 am and 6 pm.","example[90]":"The company has received an order for 1,500 machines.","note[21]":"order for","example[91]":"It has three firm orders (=definite ones) for its latest twin-jet aircraft.","definition[29]":"goods that someone has ordered from a company","example[92]":"Your order has arrived - you can collect it from the store any time.","definition[30]":"the number of requests by customers to buy a new product, book, or record before it has been put on sale","example[93]":"His new album had been released to advance orders in the UK of 100,000.","definition[31]":"if goods are on order, a customer has asked for them but has not yet received them","example[94]":"America’s airlines alone have more than $130 billion-worth of aircraft on order.","definition[32]":"if something is made or supplied to order, it is made or supplied especially for a particular customer who has asked for it","example[95]":"Our exclusive conservatories are still handmade to order, using traditional skills.","definition[33]":"an official statement from a court of law or other authority stating that something must be done","example[96]":"The decision removed a temporary restraining order that prevented the New York Department of Insurance from releasing the reports.","definition[34]":"the condition of goods or property when they are bought or sold","example[97]":"The documents state the quantity of goods and their apparent order and condition when received.","example[98]":"The property is in good decorative order.","definition[35]":"if equipment, a machine etc is in good working order, it is working well","example[99]":"Our standards ensure a BMW bought from us is in perfect running order.","definition[36]":"if equipment or a machine is out of order, it is not working","example[100]":"I tried to ring him yesterday but his phone was out of order.","definition[37]":"the way that several things are arranged, showing which comes first, second etc","example[101]":"Place the proposals in order of priority.","definition[38]":"the arrangement of different subjects for discussion at a meeting","example[102]":"As clerk to the committee, your main task is to establish the order of business.","definition[39]":"the most important thing to be discussed at a meeting or dealt with","example[103]":"House Democratic leaders plan to make the proposed tax the top order of business when Congress returns.","definition[40]":"to ask a company to supply goods or services","example[104]":"Dealers have been reluctant to order new cars in the face of weak sales.","example[105]":"You can order computer games or DVDs that aren’t in stock.","definition[41]":"to tell someone to do something, using your authority or power over them","example[106]":"A federal appeals court in Philadelphia overturned the verdict and ordered a new trial.","example[107]":"Congress has ordered businesses to comply with the new regulations."}