{"word[0]":"knowledge","definition[0]":"the information, skills, and understanding that you have gained through learning or experience","example[0]":"He did not have much knowledge of American history.","note[0]":"knowledge of","example[1]":"the need to increase knowledge about birth control","note[1]":"knowledge about","explanation[0]":"In everyday English, people usually say that someone knows about something rather than has knowledge of/about something:","example[2]":"He didn’t know much about American history.","definition[1]":"when you know about a particular situation or event, or the information you have about it","example[3]":"Evans denied all knowledge of the robbery.","example[4]":"I had no knowledge of this whatsoever until ‘The Times’ contacted me.","example[5]":"She acted with the full knowledge of her boss  (=her boss knew about her action).","example[6]":"Ministers publicly denied that they had prior knowledge of the attack  (=they denied that they knew that it was going to happen).","example[7]":"Kay smiled, secure in the knowledge that she was right.","note[2]":"(secure/safe) in the knowledge that","example[8]":"Their affair is public knowledge.","note[3]":"be common/public knowledge","example[9]":"To the best of my knowledge, the new project will be starting in June.","note[4]":"to (the best of) somebody’s knowledge","example[10]":"To our knowledge, this is the first time it’s happened.","example[11]":"‘Is it true that she’s leaving the company?’ ‘Not to my knowledge (=I do not think so).’","example[12]":"He was annoyed to find the contract had been signed without his knowledge.","note[5]":"without somebody’s knowledge","collocation[0]":"have some knowledge of something","example[13]":"The book assumes that you already have some knowledge of physics.","collocation[1]":"get knowledge","example[14]":"He gets all his knowledge about politics from watching the television.","collocation[2]":"increase/improve your knowledge","example[15]":"If you want to improve your knowledge of the language, you should go and live in France.","example[16]":"In the past twenty years, we have greatly increased our knowledge of how the brain works.","collocation[3]":"broaden/expand your knowledge","example[17]":"The course is designed to help students broaden their knowledge of modern American literature.","collocation[4]":"show/demonstrate your knowledge","example[18]":"The test should be an opportunity for students to demonstrate their knowledge.","form[0]":"ADJECTIVES/NOUN + knowledge","collocation[5]":"general knowledge","example[19]":"The questions are intended to test your general knowledge.","collocation[6]":"scientific/technical knowledge","example[20]":"the practical application of scientific knowledge","collocation[7]":"specialist/expert knowledge","example[21]":"Making profitable investments requires specialist knowledge.","collocation[8]":"detailed knowledge","example[22]":"You need to have a detailed knowledge of criminal law.","collocation[9]":"first-hand/personal knowledge","example[23]":"writers who had no first-hand knowledge of war","collocation[10]":"basic knowledge","example[24]":"These things are obvious to anyone with even a basic knowledge of computers.","collocation[11]":"in-depth/thorough knowledge","example[25]":"He demonstrated an in-depth knowledge of the subject matter.","collocation[12]":"considerable/extensive/vast knowledge","example[26]":"She had considerable knowledge of antiques.","collocation[13]":"intimate knowledge","example[27]":"He seemed to have an intimate knowledge of prison life.","collocation[14]":"inside knowledge","example[28]":"his inside knowledge gained from 20 years in the industry","collocation[15]":"background knowledge","example[29]":"The test will show what background knowledge a student brings to the course.","collocation[16]":"a thirst for knowledge","example[30]":"She arrived at college with a thirst for knowledge.","collocation[17]":"somebody's breadth of knowledge","example[31]":"They lack his breadth of knowledge about the industry.","explanation[1]":"Knowledge is an uncountable noun and is not used in the plural You say","example[32]":"He has a lot of technical knowledge","bad_example[0]":"He has a lot of technical knowledges","explanation[2]":"Knowledge is always followed by a singular verb","example[33]":"Expert knowledge is  necessary","explanation[3]":"When talking about something that you know or learn, you say a piece of knowledge","example[34]":"This is a useful piece of knowledge","definition[2]":"the facts and information that you have learned, and the understanding you have gained","example[35]":"Our knowledge of other cultures and societies has improved.","example[36]":"scientific knowledge","display[0]":"expertise","definition[3]":"special knowledge about how to do something, that you get through experience, training, or study","example[37]":"The technical expertise was provided by a Japanese company.","example[38]":"They need people with medical expertise.","display[1]":"know-how","definition[4]":"practical knowledge about how to do something","example[39]":"Business leaders often lack the local know-how to tackle problems in specific countries.","example[40]":"financial know-how","display[2]":"wisdom","definition[5]":"good sense and judgment, based on knowledge and experience","example[41]":"the wisdom of the older family members","example[42]":"It’s a matter of common wisdom that newspapers cannot be trusted.","display[3]":"grasp","definition[6]":"how much you know about a situation or subject, and how well you understand it","example[43]":"He’s been praised for his grasp of the country’s economic problems.","example[44]":"She has a good grasp of the language.","definition[7]":"facts, skills and understanding gained through learning or experience","example[45]":"Given its market knowledge, Price Waterhouse was able to provide a useful insight into each supplier.","example[46]":"Auditors’ knowledge of their client company means they are well-placed to judge the likelihood of company survival."}