{"word[0]":"characteristic","definition[0]":"a quality or feature of something or someone that is typical of them and easy to recognize","example[0]":"Violent images are a defining characteristic of his work.","note[0]":"defining/distinguishing characteristic","example[1]":"a baby discovering the physical characteristics of objects","note[1]":"characteristic of","collocation[0]":"a physical characteristic","example[2]":"physical characteristics such as your height and weight","collocation[1]":"a personal characteristic","example[3]":"What are the personal characteristics that a leader requires?","collocation[2]":"a human characteristic","example[4]":"The power of speech is an entirely human characteristic.","collocation[3]":"a national  characteristic","example[5]":"Organization is often seen as a German national characteristic.","collocation[4]":"the main characteristic of something","example[6]":"A new interest in art was one of the main characteristics of this period.","collocation[5]":"a common characteristic","example[7]":"Successful firms tend to have common characteristics.","collocation[6]":"a distinguishing/distinctive characteristic","example[8]":"The blue feathers are the distinguishing characteristic of the male bird.","collocation[7]":"a defining characteristic","example[9]":"Originality is one of the defining characteristics of a great band.","collocation[8]":"an important/essential characteristic","example[10]":"An essential characteristic of good teaching is that it must create interest in the learner.","collocation[9]":"an inherited characteristic","example[11]":"Intelligence is an inherited characteristic.","collocation[10]":"a striking characteristic","example[12]":"Its canals are one of Amsterdam’s most striking characteristics.","collocation[11]":"have a characteristic","example[13]":"He has all the characteristics of a great husband.","collocation[12]":"show a characteristic","example[14]":"A material may exhibit the characteristics of both a liquid and a solid.","collocation[13]":"share a characteristic","example[15]":"The group shared one characteristic - they were all under 25.","collocation[14]":"inherit a characteristic","example[16]":"We all inherit physical characteristics from our parents.","definition[1]":"something that is typical of someone or something and makes them easy to recognize","example[17]":"He had several characteristics which made him different to the rest of his family.","example[18]":"the physical characteristics of the brain","example[19]":"He studied the special characteristics of adult speech addressed to children.","display[0]":"quality","definition[2]":"a characteristic of a person, especially a good one such as kindness or intelligence","example[20]":"Tina has a lot of good qualities.","example[21]":"I’m not sure about his leadership qualities.","example[22]":"Obedience is a quality that my father admires.","display[1]":"feature","definition[3]":"an important or interesting characteristic of something","example[23]":"it seems to be a feature of modern society that we tend to judge ourselves by our work above everything else.","example[24]":"A curious feature of the novel is the absence of women.","example[25]":"The building still has many of its original features.","display[2]":"property","definition[4]":"a characteristic of a substance or object, for example hardness or elasticity, or how it behaves – used especially in scientific contexts","example[26]":"We examined the physical properties of various metals.","example[27]":"changes in the electrical properties of cells","example[28]":"Some plants have healing properties.","display[3]":"attribute","definition[5]":"a good or useful characteristic","example[29]":"I suspected I probably did not quite possess all the attributes required to succeed at the highest level.","example[30]":"All living things are able to reproduce their kind, an attribute which no machine possesses..","display[4]":"good/bad points","definition[6]":"good or bad characteristics – used when someone or something has both good and bad characteristics","example[31]":"The seller will obviously emphasize the car’s good points.","example[32]":"Draw up a list of your partner’s good and bad points.","definition[7]":"very typical of a particular thing or of someone’s character","example[33]":"the highly characteristic (=very typical) flint walls of the local houses","example[34]":"the qualities that were characteristic of the Nixon administration","explanation[0]":"In everyday English, people usually say typical rather than characteristic:","example[35]":"The building is typical of those in the area."}