{"word[0]":"profession","definition[0]":"a job that needs a high level of education and training","example[0]":"people who work in the professions (=doctors, lawyers etc)","example[1]":"nurses, social workers, and other people in the caring professions (=ones that involve looking after people)","example[2]":"members of the teaching profession","note[0]":"the legal/medical/teaching etc profession","example[3]":"Some students enter other professions such as arts administration.","note[1]":"enter/go into/join a profession","example[4]":"Johnson was a barrister by profession.","note[2]":"by profession","definition[1]":"all the people who work in a particular profession","example[5]":"the medical profession","explanation[0]":"In this meaning, profession is usually followed by a singular verb","example[6]":"Our profession has been keen to use new technology","example[7]":"Our profession have been keen to use new technology","definition[2]":"a statement of your belief, opinion, or feeling","example[8]":"a profession of faith","note[3]":"profession of","form[0]":"ADJECTIVES/NOUN + profession","collocation[0]":"the legal profession","example[9]":"He followed his father into the legal profession.","example[10]":"The medical profession is still divided about the main cause of heart attacks.","collocation[1]":"the teaching profession","example[11]":"There are not enough physicists entering the teaching profession.","collocation[2]":"the accountancy/accounting profession","example[12]":"Many economics graduates enter the accountancy profession.","collocation[3]":"the nursing profession","example[13]":"Mary had retired from the nursing profession.","collocation[4]":"the caring professions","example[14]":"A high proportion of people in the caring professions are women.","example[15]":"Hugh intended to enter the medical profession.","collocation[5]":"leave a profession","example[16]":"Why do you want to leave the profession?","collocation[6]":"a member of a profession","example[17]":"Some members of the medical profession supported the use of these drugs.","collocation[7]":"reach/be at the top of your profession","example[18]":"He was a very highly respected man, at the top of his profession.","definition[3]":"a job that needs advanced education and special training","example[19]":"realtors, a profession with an established record of service to the public","example[20]":"People assume that money management is a well-paid profession.","definition[4]":"used to talk about the people working in a particular job, considered as separate groups","example[21]":"In the bankruptcy field you find some of the legal profession’s most forceful personalities.","definition[5]":"accountants, doctors, lawyers, teachers etc considered as one group","example[22]":"During this century, the professions have been one of the fastest growing sectors of the occupational structure.","definition[6]":"if someone is a doctor, teacher etc by profession, that is what they trained to do as their job. This phrase is usually used when talking about the fact that someone is doing different work for a period of time","example[23]":"A graphic designer by profession, he has spent the last two years in public relations."}