{"word[0]":"floor","signpost[0]":"in a building","definition[0]":"the flat surface that you stand on inside a building","example[0]":"a polished wooden floor","example[1]":"a puddle of water on the kitchen floor","example[2]":"a warehouse that has 410,000 square feet of floor space","signpost[1]":"in a car","definition[1]":"the part of a car that forms its inside floor","signpost[2]":"level in building","definition[2]":"one of the levels in a building","example[3]":"a ground floor flat","example[4]":"Our office is on the top floor.","note[0]":"on the top/first/tenth etc floor","example[5]":"We are located on the seventh floor of the building.","note[1]":"floor of","signpost[3]":"ocean/forest/cave floor etc","definition[3]":"the ground at the bottom of the ocean, the forest etc","example[6]":"creatures that live on the ocean floor","signpost[4]":"for dancing","definition[4]":"an area in a room where people can dance","example[7]":"There were two or three couples already on the dance floor.","example[8]":"Everyone took to the floor for the last waltz.","note[2]":"take (to) the floor","signpost[5]":"where people work","definition[5]":"a large area in a building where a lot of people do their jobs","example[9]":"He wasn’t keen on the idea of working on the shop floor (=the part of a factory where people make things using machines).","example[10]":"the busy trading floor (=area where stocks and shares are bought and sold)","definition[6]":"an officially agreed limit below which something cannot go","example[11]":"Manufacturers have tried to put a floor under the price of their products.","collocation[0]":"clean the floor","example[12]":"Next he had to clean the floor.","collocation[1]":"wash/mop the floor","example[13]":"The floor needs mopping.","collocation[2]":"sweep the floor","example[14]":"He grabbed a broom and began sweeping the floor.","collocation[3]":"wax/polish the floor","example[15]":"I washed and waxed the kitchen floor.","collocation[4]":"sit/lie/sleep on the floor","example[16]":"Officers found her lying face down on the floor.","collocation[5]":"fall/drop/sink to the floor","example[17]":"He let his cigarette fall to the floor.","form[0]":"ADJECTIVES/NOUN + floor","collocation[6]":"the bathroom/kitchen/bedroom etc floor","example[18]":"I’ve still got to clean the bathroom floor.","collocation[7]":"a wooden floor","example[19]":"The hut had a muddy wooden floor.","collocation[8]":"a marble floor","example[20]":"He strode across the marble floor.","collocation[9]":"a tiled floor","example[21]":"There were a couple of oriental rugs on the tiled floor.","collocation[10]":"a carpeted floor","example[22]":"Barbara was sitting on the carpeted floor.","collocation[11]":"a bare floor","example[23]":"Father Murphy led me to a tiny room with a bare floor and a simple bed.","form[1]":"floor + NOUN","collocation[12]":"floor tiles","example[24]":"When you buy floor tiles, always get a few extra.","collocation[13]":"floor polish","example[25]":"The room smelt of floor polish.","collocation[14]":"a floor covering","example[26]":"A carpet fitter can fit floor coverings quickly and inexpensively.","collocation[15]":"floor space","example[27]":"The shop has 33,000 square feet of floor space.","example[28]":"She lives in an apartment on the eighteenth floor.","display[0]":"storey","definition[7]":"used when saying how many levels a building has","example[29]":"a five-storey car park","example[30]":"The school is a single storey building.","display[1]":"the ground floor","definition[8]":"the floor of a building that is at ground level","example[31]":"There is a shop on the ground floor.","example[32]":"The emergency room is on the first floor.","display[2]":"the first floor","definition[9]":"the floor of a building above the one at ground level","example[33]":"She lives on the first floor.","display[3]":"deck","definition[10]":"one of the levels on a ship, bus, or plane","example[34]":"The Horizon Lounge is on the top deck of the ship.","definition[11]":"to surprise or shock someone so much that they do not know what to say or do","example[35]":"A couple of the questions completely floored me.","definition[12]":"to hit someone so hard that they fall down","example[36]":"He was floored in the first round of the fight.","definition[13]":"to make a car go as fast as possible","example[37]":"I got into the car and floored it.","definition[14]":"the lowest EXCHANGE RATE a currency is permitted to fall to","example[38]":"Traders were buying Argentine pesos at prices well belowthe currency’s floor against the dollar.","definition[15]":"a level below which prices, wages etc are not allowed to fall","example[39]":"The agreement might also act as a floor to wages during the recession.","example[40]":"Quarterlyprice floors were established for Japanese commodities.","definition[16]":"the part of a financial market where shares, COMMODITIES (=oils, metals, farm products) etc are bought and sold. In American English, only trading floor and exchange floor are used, not dealing floor","example[41]":"He eventually took responsibility for running the dealing floor.","example[42]":"Any business done by a member ‘under the rules’ is treated as exchange business, even where this takes place away from the exchange floor.","definition[17]":"a dealing, trading, or exchange floor","definition[18]":"the place where a public meeting or discussion happens, or the people who attend it","example[43]":"At the meeting, the administration were recommended by the floor to reconsider the deal they had earlier rejected.","definition[19]":"if you get in on the ground floor, you get involved in a business activity when it begins","example[44]":"The scope for an entrepreneur to get in on the ground floor and turn petrol stations into shops was obvious to those with an eye for business.","definition[20]":"used to refer to the workers who make the goods in a factory","example[45]":"the union’s influence on the factory floor","example[46]":"He’d moved up from shop floor worker to production manager.","definition[21]":"the area in a factory where the ordinary workers do their work","example[47]":"The chairwoman started her working life on the shop floor."}