{"word[0]":"strength","signpost[0]":"physical","definition[0]":"the physical power and energy that makes someone strong","example[0]":"I’m trying to build up my strength.","example[1]":"Jo hit him with all her strength.","example[2]":"He never ceased to be amazed by her physical strength.","example[3]":"She didn’t even have the strength to stand up.","note[0]":"have/find the strength to do something","signpost[1]":"determination","definition[1]":"the quality of being brave or determined in dealing with difficult or unpleasant situations","example[4]":"She had enormous strength of character  (=strong ability to deal with difficult situations).","example[5]":"I think you have to find an inner strength in order to feel good about yourself.","example[6]":"Jenny didn’t have the strength to end the relationship.","example[7]":"The sea was very cold and it required great strength of mind to get in.","note[1]":"strength of mind/purpose","signpost[2]":"feeling/belief","definition[2]":"how strong a feeling, belief, or relationship is","synonym[0]":"depth","example[8]":"We understand the strength of feeling against the proposal.","example[9]":"Governments cannot ignore the strength of public opinion.","note[2]":"strength of","signpost[3]":"organization/country etc","definition[3]":"the political, military, or economic power of an organization, country, or system","example[10]":"The socialists organized a show of strength  (=when a country or organization shows how strong it is).","example[11]":"the strength of the US economy","signpost[4]":"useful quality or ability","definition[4]":"a particular quality or ability that gives someone or something an advantage","example[12]":"Her main strength is her critical thinking ability.","example[13]":"Be aware of your own strengths and weaknesses.","example[14]":"The great strength of our plan lies in its simplicity.","definition[5]":"how strong an object or structure is, especially its ability to last for a long time without breaking","example[15]":"a device for testing the strength of concrete structures","signpost[5]":"substance/mixture","definition[6]":"how strong a substance or mixture is","example[16]":"Add water to dilute the solution to the required strength.","example[17]":"Young plants can be fed with half-strength liquid fertilizer.","note[3]":"full-strength/half-strength/double-strength etc","signpost[6]":"number of people","definition[7]":"the number of people in a team, army etc","example[18]":"The Edinburgh team are now at full strength.","example[19]":"The police force is below strength at the moment  (=there are fewer police than there should be).","note[4]":"below strength","example[20]":"Security forces were out in strength  (=in large numbers) but did not intervene.","note[5]":"in strength","definition[8]":"the value of a country’s money when compared to other countries’ money","example[21]":"the strength of the dollar on the international money markets","signpost[7]":"natural force","definition[9]":"how strong a natural force is","example[22]":"the strength of the sunlight","signpost[8]":"colour/light/flavour/smell etc","definition[10]":"how strong a colour, taste etc is","heading[0]":"– Meaning 1: the physical power and energy that makes someone strong","collocation[0]":"physical strength","example[23]":"Some of the tasks required considerable physical strength.","collocation[1]":"great/enormous strength","example[24]":"Hercules was famous for his great strength.","collocation[2]":"superhuman strength","example[25]":"In the movie, Walsh performs feats of superhuman strength.","collocation[3]":"superior strength","example[26]":"Using his superior strength, Rocky dragged the struggling Larsen another twenty yards back.","collocation[4]":"brute strength","example[27]":"There is more to wrestling than brute strength. Tactics are important too.","collocation[5]":"full strength","example[28]":"It takes time to get your full strength back after you have been ill.","collocation[6]":"have the strength to do something","example[29]":"He didn't even have the strength to sit up.","collocation[7]":"find the strength to do something","example[30]":"Mary found the strength to climb up onto the upturned boat.","collocation[8]":"use your strength","example[31]":"He used all his strength to heave the door shut.","collocation[9]":"gather/muster/summon your strength","example[32]":"He sat for a couple of minutes, gathering his strength.","collocation[10]":"build up your strength","example[33]":"You need to build up your strength.","collocation[11]":"gain strength","example[34]":"After the operation, he spent several weeks relaxing and gaining strength.","heading[1]":"– Meaning 2: the quality of being brave or determined in dealing with difficult or unpleasant situations","collocation[12]":"great strength","example[35]":"She showed great strength in dealing with her problems.","collocation[13]":"inner strength","example[36]":"Geoff had an inner strength which got him through the tough times.","collocation[14]":"mental strength","example[37]":"He's a player who has the skill and the mental strength to win.","example[38]":"This proved that he has the strength to cope with such a high-powered job.","example[39]":"Paula had found the strength to escape from an abusive marriage.","collocation[15]":"gain/draw strength from somebody/something","example[40]":"He gained strength from being back with the people and things he loved.","collocation[16]":"show strength","example[41]":"The decision to continue shows incredible strength and courage.","collocation[17]":"strength of character","example[42]":"The victims' families have shown amazing strength of character.","collocation[18]":"strength of purpose/mind","example[43]":"In pursuing this ambition, William showed remarkable strength of purpose.","collocation[19]":"a source of strength","example[44]":"Her faith had always been a source of strength for her.","heading[2]":"– Meaning 5: a particular quality or ability that gives someone or something an advantage","collocation[20]":"a great strength","example[45]":"Diversity is one of India's greatest strengths.","collocation[21]":"a real strength","example[46]":"The play's real strength is the way it explores relationships.","collocation[22]":"build on/capitalize on a strength","example[47]":"The organization must move forward and capitalize on its strengths.","collocation[23]":"play to your strengths","example[48]":"Both parties are playing to their strengths.","collocation[24]":"identify strengths","example[49]":"The teacher can identify each child's strengths and build on these.","collocation[25]":"know somebody's strengths","example[50]":"It's important to know your strengths as well as your weaknesses.","collocation[26]":"somebody's/something's strength lies in something","example[51]":"The show's strength lies in the fact that it appeals to all ages.","collocation[27]":"strengths and weaknesses","example[52]":"All technologies have different strengths and weaknesses.","definition[11]":"the value of a country’s money, especially when this is at a high level","example[53]":"the strength of the yen on the international money markets","definition[12]":"the power or influence that a person, organization, country etc has","example[54]":"Before and during negotiations, a salesperson will benefit by assessing the relative strength of his power base.","definition[13]":"the good qualities or abilities that someone or something has","example[55]":"One of her management strengths is the ability to delegate.","example[56]":"Judging one’s own strengths and weaknesses is far from easy."}