{"word[0]":"fix","signpost[0]":"repair","definition[0]":"to repair something that is broken or not working properly","example[0]":"He’s outside fixing the brakes on the car.","example[1]":"Ellis was able to quickly find and fix the problem.","definition[1]":"to decide on a limit for something, especially prices, costs etc, so that they do not change","example[2]":"The interest rate has been fixed at 6.5%.","note[0]":"fix something at something","example[3]":"Rent was fixed at $1,750 per month.","definition[2]":"if two or more companies fix the price for a particular product or service, they secretly agree on the price they will charge for it, in order to keep the price high and make more profit. This practice is illegal","example[4]":"The government accused the two companies of fixing petrol prices.","definition[3]":"to make arrangements for something","example[5]":"‘So when do I get to meet them?’ ‘Tomorrow, if I can fix it.’","example[6]":"I’ve fixed for you to see him this afternoon at four.","note[1]":"fix (it) for somebody to do something","signpost[1]":"attach","definition[4]":"to attach something firmly to something else, so that it stays there permanently","example[7]":"The shelves should be fixed to the wall with screws.","note[2]":"fix something to/on something","signpost[2]":"prepare food","definition[5]":"to prepare a meal or drinks","example[8]":"I’ll watch the kids and you fix dinner.","example[9]":"Terry fixed herself a cold drink and sat out on the balcony.","example[10]":"Can I fix you a snack?","note[3]":"fix somebody something","signpost[3]":"solve","definition[6]":"to find a solution to a problem or bad situation","example[11]":"The government seems confident that environmental problems can be fixed.","signpost[4]":"hair/face","definition[7]":"to make your hair or make-up look neat and attractive","example[12]":"Who fixed your hair for the wedding?","example[13]":"Hold on. Let me just fix my face (=put on make-up) before we go out.","signpost[5]":"cat/dog","definition[8]":"to do a medical operation on a cat or dog so that it cannot have babies","synonym[0]":"neuter","definition[9]":"to arrange an election, game etc dishonestly, so that you get the result you want","example[14]":"Many suspected that the deal had been fixed in advance.","signpost[6]":"paintings/photographs","definition[10]":"to use a chemical process on paintings, photographs etc that makes the colours or images permanent","signpost[7]":"punish","definition[11]":"used to say that you will punish someone you are angry with","example[15]":"If anybody did that to me, I’d fix him good.","definition[12]":"something that solves a problem","example[16]":"Robinson called the proposal a quick fix (=a temporary or easy solution) of limited value.","definition[13]":"an amount of something, especially an illegal drug such as heroin, that you often use and badly want","example[17]":"addicts looking for a fix","example[18]":"I need my fix of caffeine in the morning or I can’t think.","definition[14]":"something that has been dishonestly arranged","example[19]":"People think the election was a fix.","definition[15]":"to repair something","example[20]":"We had to fix some computer problems.","example[21]":"It will cost millions of dollars tofix the system.","definition[16]":"to decide on a level, value etc for something","example[22]":"It is very difficult to fix an offer price several weeks in advance.","note[4]":"fix at","example[23]":"They agreed to fix a time for the interview.","example[24]":"Mike wants to fix up a meeting with you.","definition[17]":"to arrange something dishonestly in order to get the result you want","example[25]":"We suspected that the deal had been fixed in advance.","example[26]":"Allegations of a fix were not proven.","example[27]":"Obviously his appointment was a fix.","definition[18]":"a solution to a problem, especially if the solution is temporary","example[28]":"They do not want aquick fix, they want a resolution of the issues.","example[29]":"Is there a fix for the suffering Caribbean economy?","definition[19]":"a solution to a computer software problem","example[30]":"Do not apply this fix if you are running a Power PC Mac.","example[31]":"The bug fixes in previous versions of the software are also included in the current update.","definition[20]":"to understand what someone or something is really like","example[32]":"Investors are trying to get a fix on Sony’s future."}