{"word[0]":"bowl","definition[0]":"a wide round container that is open at the top, used to hold liquids, food, flowers etc","note[0]":"a soup/salad/cereal etc bowl (=a bowl to eat or serve soup, salad etc from)","example[0]":"Mix all the ingredients thoroughly in a large bowl.","example[1]":"Fill the bowl with water.","example[2]":"Beat the butter in a mixing bowl until creamy and soft.","note[1]":"a mixing/serving bowl","definition[1]":"the amount of something contained in a bowl","example[3]":"a bowl of rice","note[2]":"bowl of","example[4]":"a bowl of fruit","definition[2]":"an outdoor game played on grass, in which you try to roll big balls as near as possible to a small ball","definition[3]":"a special game in American football played by the best teams after the normal playing season","example[5]":"the Rose Bowl","definition[4]":"a ball that you use in the game of bowls","definition[5]":"the part of an object such as a spoon, pipe, toilet etc that is shaped like a bowl","note[3]":"a toilet/lavatory bowl","example[6]":"the bowl of a pipe","signpost[0]":"stadium","definition[6]":"a large stadium shaped like a bowl, where people go to watch special events such as sports games or music concerts","example[7]":"the Hollywood Bowl","form[0]":"types of bowl","collocation[0]":"a soup/cereal/pudding bowl","example[8]":"These work well as pasta or cereal bowls.","collocation[1]":"a salad/sugar/fruit bowl","example[9]":"There are some apples in the fruit bowl if you want one.","collocation[2]":"a mixing bowl","example[10]":"Put the butter and sugar in a mixing bowl.","collocation[3]":"a serving bowl","example[11]":"She put the strawberries in a glass serving bowl.","collocation[4]":"a washing-up bowl","example[12]":"a plastic washing-up bowl","collocation[5]":"a wooden/china/glass etc bowl","example[13]":"I broke a china bowl.","definition[7]":"to roll a ball along a surface when you are playing the game of bowls","definition[8]":"to throw a ball at the batsman (=the person who hits the ball) in cricket","definition[9]":"to make a batsman have to leave the field by throwing a ball so that it hits the wicket behind him","definition[10]":"to travel along very quickly and smoothly","example[14]":"We were bowling along at about 90 miles per hour.","note[4]":"bowl along/down"}