{"signpost[0]":"can do something","definition[0]":"to let someone do or have something, or let something happen","example[0]":"Are dictionaries allowed in the exam?","note[0]":"something is allowed","example[1]":"Students should be allowed to make their own decisions. ","note[1]":"somebody should be allowed to do something ","example[2]":"My parents wouldn’t allow me to go to the party.","note[2]":"allow somebody to do something","example[3]":"Students are not allowed to eat in class.","example[4]":"Passengers are allowed one item of hand luggage each.","note[3]":"allow somebody something","example[5]":"How much time are we allowed?","example[6]":"He allowed himself the occasional glass of wine.","note[4]":"allow yourself something ","example[7]":"We don’t allow diving in the pool.","note[5]":"allow something","example[8]":"I don’t allow the cat in the bedroom.","note[6]":"allow somebody in/out/up etc","example[9]":"The audience is not allowed backstage.","example[10]":"Don’t allow your problems to dominate your life.","note[7]":"allow something to do something","signpost[1]":"make something possible","definition[1]":"to make it possible for something to happen or for someone to do something, especially something helpful or useful","example[11]":"Our new system will allow for more efficient use of resources.","note[8]":"allow for something","example[12]":"A 24-hour ceasefire allowed the two armies to reach an agreement.","example[13]":"a seat belt that allows the driver greater freedom of movement","example[14]":"This adjustment of the figures allows a fairer comparison.","signpost[2]":"have enough of something","definition[2]":"to be sure that you have enough time, money, food etc available for a particular purpose","example[15]":"Allow yourselves plenty of time to get to the airport.","example[16]":"I’ve allowed half a bottle of wine for each person.","note[9]":"allow something for somebody/something","signpost[3]":"correct/permitted","definition[3]":"to accept that something is correct or true, or that something is acceptable according to the rules or law","example[17]":"The judge allowed the evidence.","example[18]":"I allow that there may have been a mistake.","note[10]":"allow that","explanation[0]":"You allow someone to do something","example[19]":"Her boss allows her to work from home","explanation[1]":"Something is allowed","example[20]":"Working from home is allowed","explanation[2]":"Allow is often used in the passive","explanation[3]":"You let someone do something","example[21]":"Her boss lets her work from home","bad_example[0]":"let someone to do something","explanation[4]":"Let is not used in the passive","explanation[5]":"Something  is permitted","example[22]":"Working from home is permitted","explanation[6]":"Someone is permitted to do something","example[23]":"Employees are permitted to work from home","explanation[7]":"Permit is usually used in the passive","definition[4]":"to say that someone can do something – used about parents, teachers, or people in authority","example[24]":"They don’t allow students to chew gum in the classroom.","example[25]":"I’m not allowed to stay out after ten o'clock.","definition[5]":"to allow someone to do something. Let is not used in the passive, and is much more commonly used in everyday English than allow","example[26]":"Will your mum let you come to the party?","example[27]":"I’ll borrow John’s bicycle, if he’ll let me.","definition[6]":"if something is permitted, it is allowed according to the rules – used especially on written notices and announcements","example[28]":"Smoking is not permitted anywhere in the building.","display[0]":"give somebody permission","definition[7]":"used when someone in an important official position decides to allow someone to do something","example[29]":"He was given special permission to leave school early.","example[30]":"The Home Office has given him permission to stay in Britain indefinitely.","display[1]":"give your consent","definition[8]":"to say that you will allow someone to do something that will affect you personally, or a member of your family, when you have a legal right to say ‘no’","example[31]":"Her parents have given their consent to the marriage.","example[32]":"You can’t build on someone’s land without the owner’s consent.","display[2]":"give something the go-ahead","definition[9]":"to officially allow a planned project or activity to happen","example[33]":"The government finally gave the go-ahead for a new terminal at Heathrow airport.","example[34]":"A new nuclear plant has been given the go-ahead.","display[3]":"authorize","definition[10]":"to officially or legally allow someone to do something – used about laws or people","example[35]":"The UN resolution would authorize the use of force.","example[36]":"I never authorized them to give information about me to other banks.","display[4]":"entitle","definition[11]":"to give someone the right to do or have something","example[37]":"The pass entitles you to travel on any bus, at any time, in Norwich.","example[38]":"If the goods are faulty, the customer is entitled to a refund.","display[5]":"sanction","definition[12]":"to give official approval and support for something","example[39]":"The Truman administration refused to sanction a military attack.","example[40]":"The advertisements were sanctioned by the candidate himself.","definition[13]":"when the tax authorities allow an amount, cost, or expense, they permit it not to be counted as part of income or profits","example[41]":"You’re allowed a certain amount a year in personal allowances, before you have to pay any tax.","definition[14]":"to decide that an amount of money claimed for insurance, damages etc is correct and should be paid","example[42]":"The judge allowed claims against the company involving unpaid dividends and disallowed others."}