{"word[0]":"illegal","definition[0]":"not allowed by the law","synonym[0]":"unlawful","opposite[0]":"legal","example[0]":"illegal drugs","example[1]":"They were involved in illegal activities.","example[2]":"It is illegal to sell tobacco to someone under 16.","note[0]":"it is illegal to do something","explanation[0]":"In everyday English, people often say that something is against the law rather than illegal:","example[3]":"It is against the law to have a gun without a licence.","collocation[0]":"completely/totally illegal","example[4]":"The deal was completely illegal.","collocation[1]":"highly illegal","example[5]":"It all sounds highly illegal.","collocation[2]":"strictly illegal","example[6]":"Phone tapping is strictly illegal.","collocation[3]":"technically illegal","example[7]":"This type of boxing, although technically illegal, remained popular until the 1880s.","collocation[4]":"be illegal","example[8]":"It is illegal to sell tobacco products to anyone under the age of 16.","collocation[5]":"become illegal","example[9]":"The drug did not become illegal until the 1970s.","collocation[6]":"make something illegal","example[10]":"He was involved in the campaign to make hunting illegal.","collocation[7]":"declare something illegal","example[11]":"The strike was declared illegal on July 7.","form[0]":"illegal + NOUN","collocation[8]":"an illegal weapon","example[12]":"He was charged with carrying an illegal weapon.","example[13]":"She was found guilty of possession of illegal drugs.","collocation[9]":"an illegal substance","example[14]":"Customs officials found an illegal substance in Smith’s luggage.","collocation[10]":"illegal parking/gambling/hunting etc","example[15]":"The fines for illegal parking are likely to increase.","collocation[11]":"illegal immigrants","example[16]":"An estimated seven million illegal immigrants are brought into Europe each year.","collocation[12]":"illegal activities","example[17]":"They were suspected of being involved in illegal activities.","collocation[13]":"an illegal act","example[18]":"Driving without insurance is an illegal act.","collocation[14]":"illegal use of something","example[19]":"They were found guilty of the illegal use of confidential information.","definition[1]":"forbidden by law","example[20]":"It is illegal to sell tobacco to children under 16.","example[21]":"He was carrying an illegal weapon.","display[0]":"be against the law","definition[2]":"to be illegal. This phrase is very commonly used in everyday English, instead of saying that something is illegal","example[22]":"Driving a car without insurance is against the law.","example[23]":"It’s against the law to hit a child.","definition[3]":"illegal – a rather formal word, which is used especially when this particular action is considered to be illegal, although there are some situations where such actions can be legal","example[24]":"The judges said that the strike was unlawful.","example[25]":"The money was obtained by unlawful means.","example[26]":"a verdict of unlawful killing","display[1]":"illicit","definition[4]":"illicit  activities or goods are illegal and usually kept secret","example[27]":"Marijuana remains the most commonly used illicit drug in the United States.","example[28]":"the illicit trade in stolen cattle","display[2]":"illegitimate","definition[5]":"not allowed or acceptable according to rules or agreements","example[29]":"the illegitimate use of power","example[30]":"The election results were declared to be illegitimate.","example[31]":"illegitimate share trading","display[3]":"unconstitutional","definition[6]":"not allowed by a country’s constitution (=set of rules and principles by which a country is governed)","example[32]":"The court ruled that the new law was unconstitutional.","definition[7]":"an illegal immigrant","example[33]":"Illegals are still slipping through in unacceptable numbers.","example[34]":"It’s illegal to copy copyrighted movie cassettes.","example[35]":"Despite knowing about the illegal activity, the executives failed to tell the government for months.","example[36]":"He made illegal payments in connection with contracts awarded to his company.","definition[8]":"involving an instruction, CHARACTER etc that is not allowed in a particular computer program"}