{"word[0]":"dig","past_tense[0]":"dug","definition[0]":"to move earth, snow etc, or to make a hole in the ground, using a spade or your hands","example[0]":"They dig a small hole in the sand to bury their eggs.","note[0]":"dig a hole/trench/grave etc","example[1]":"Dig down about 6 inches.","note[1]":"dig down","example[2]":"birds digging for worms","note[2]":"dig for","definition[1]":"to remove something, especially vegetables, from the ground using a spade","example[3]":"freshly dug carrots","definition[2]":"to put your hand into something, especially in order to search for something","example[4]":"She dug around in her bag for a pen.","example[5]":"He dug his hands deep into his pockets.","definition[3]":"to like something","example[6]":"I dig that hat!","definition[4]":"to make a hole in the ground using your hands, a tool, or a machine","example[7]":"Some workmen were digging a trench at the side of the road.","example[8]":"In Africa, the people know where to dig for water.","display[0]":"make a hole","definition[5]":"to dig a hole in the ground, using your hands or a tool","example[9]":"Make a hole just big enough for the plant’s roots.","display[1]":"burrow","definition[6]":"if an animal burrows, it makes a hole or a passage in the ground by digging the earth with its feet, nose etc","example[10]":"The rabbits had burrowed a hole under the fence.","display[2]":"plough","definition[7]":"to turn over the soil using a machine or a tool pulled by animals, to prepare the soil for planting seeds","example[11]":"The farmers here still plough their fields using buffaloes.","display[3]":"excavate","definition[8]":"to dig a large hole in the ground, especially as a preparation for building something","example[12]":"The men began excavating the hole for the pool.","display[4]":"bore","definition[9]":"to make a deep round hole in the ground using a special machine, especially in order to look for oil or water","example[13]":"Companies need a special licence to bore for oil.","definition[10]":"a joke or remark that you make to annoy or criticize someone","example[14]":"He couldn’t resist a dig at the referee.","note[3]":"dig at","example[15]":"Here was a chance to have a dig at trade unionists.","definition[11]":"an organized process of digging in order to find ancient objects for study","example[16]":"an archaeological dig"}