{"word[0]":"dream","signpost[0]":"while sleeping","definition[0]":"a series of thoughts, images, and feelings that you experience when you are asleep","example[0]":"I had lots of dreams last night.","example[1]":"a dream about drowning","note[0]":"dream about","example[2]":"In my dream I flew to a forest of enormous trees.","note[1]":"in a dream","signpost[1]":"wish","definition[1]":"a wish to do, be, or have something – used especially when this seems unlikely","note[2]":"beyond your wildest dreams (=better than anything you imagined or hoped for)","example[3]":"Her dream is to make a movie.","example[4]":"I have just met the man of my dreams (=the perfect man)!","example[5]":"I fulfilled a childhood dream when I became champion.","note[3]":"fulfil/realize a dream","example[6]":"She had dreams of university.","note[4]":"dream of (doing) something","heading[0]":"– Meaning 1: a series of thoughts, images, and feelings that you experience when you are asleep","collocation[0]":"have a dream","example[7]":"I had a dream about you last night.","collocation[1]":"a bad dream","example[8]":"The movie gave the kids bad dreams.","collocation[2]":"a strange/weird dream","example[9]":"Sometimes I have a strange dream in which I try to speak but I can’t.","collocation[3]":"a vivid dream","example[10]":"In a vivid dream he saw a huge coloured bird flying above his head.","collocation[4]":"a recurrent/recurring dream","example[11]":"Having recurrent dreams is a very common experience.","collocation[5]":"be/seem like a dream","example[12]":"That summer was so wonderful it seemed like a dream.","collocation[6]":"Sweet dreams!","example[13]":"Good night, Sam! Sweet dreams!","heading[1]":"– Meaning 2: a wish to do, be, or have something – used especially when this seems unlikely","collocation[7]":"have a dream/dreams","example[14]":"I had dreams of becoming a doctor.","collocation[8]":"achieve/fulfil/realize a dream","example[15]":"He had finally achieved his dream of winning an Olympic gold medal.","collocation[9]":"pursue/follow a dream","example[16]":"She left her home town to pursue her dreams.","collocation[10]":"dream a dream","example[17]":"We can dream great dreams for ourselves and others.","form[0]":"ADJECTIVES/NOUN + dream","collocation[11]":"big/great dreams","example[18]":"She was a little girl with big dreams.","collocation[12]":"an impossible dream","example[19]":"Having a number one record had seemed an impossible dream.","collocation[13]":"a childhood dream","example[20]":"I had a childhood dream of becoming an astronaut.","collocation[14]":"a lifelong dream","example[21]":"His lifelong dream had been to write a novel.","collocation[15]":"a distant dream","example[22]":"Peace in this area may still be a distant dream.","collocation[16]":"a dream comes true","example[23]":"I’d always wanted to go to Africa and at last my dream came true.","collocation[17]":"the man/woman/house etc of your dreams","example[24]":"We can help you find the house of your dreams.","collocation[18]":"not/never in your wildest dreams","example[25]":"Never in my wildest dreams did I think I would win the competition.","collocation[19]":"beyond your wildest dreams","example[26]":"Suddenly he was wealthy beyond his wildest dreams.","heading[2]":"when you are sleeping","definition[2]":"the thoughts, images, and feelings that go through your mind while you are asleep","example[27]":"I had a strange dream last night -- you and I were in some sort of forest.","display[0]":"nightmare","definition[3]":"a very unpleasant and frightening dream","example[28]":"She still has terrible nightmares about the accident.","display[1]":"daydream","definition[4]":"a series of pleasant thoughts that go through your mind when you are awake, so that you do not notice what is happening around you","example[29]":"Neil was in a daydream, and didn’t hear the teacher call his name.","display[2]":"reverie","definition[5]":"a state of imagining or thinking about pleasant things, that is like dreaming","example[30]":"The doorbell rang, shaking her from her reverie.","heading[3]":"something that you want to do","definition[6]":"something very special that you want to do and that you think about a lot, especially something that is not very likely to happen","example[31]":"As a teenager, his dream was to become a professional footballer.","display[3]":"ambition","definition[7]":"something that you want to achieve and that you work hard to achieve, especially in your work","example[32]":"My ambition had always been to start my own business.","display[4]":"aspirations","definition[8]":"the important things that people want from their lives – used especially about the things a society or a large group of people wants","example[33]":"It’s important that young people think seriously about their career aspirations.","display[5]":"fantasy","definition[9]":"something exciting that you imagine happening to you, which is extremely unlikely to happen and often involves sex","example[34]":"schoolboy fantasies","display[6]":"pipe dream","definition[10]":"a dream that is impossible or is extremely unlikely to happen","example[35]":"Is world peace no more than a pipe dream?","past_tense[0]":"dreamed","definition[11]":"to think about something that you would like to happen or have","example[36]":"She dreamed of becoming a chef.","note[5]":"dream of/about (doing) something","example[37]":"He’s got the sort of money that you and I can only dream about.","example[38]":"She dreamed that one day she would be famous.","note[6]":"dream (that)","explanation[0]":"You dream of doing something","example[39]":"I’ve always dreamed of being an artist","bad_example[0]":"I’ve always dreamed to be an artist","definition[12]":"to have a dream while you are asleep","example[40]":"I dreamt about you last night.","example[41]":"It’s quite common to dream that you’re falling.","signpost[2]":"not pay attention","definition[13]":"to think about something else and not give your attention to what is happening around you","example[42]":"She had been dreaming and had not followed the conversation.","signpost[3]":"imagine","definition[14]":"to imagine that you have done, seen, or heard something that you have not","example[43]":"I was sure I posted the letter but I must have dreamt it."}