{"word[0]":"strain","definition[0]":"worry that is caused by having to deal with a problem or work too hard over a long period of time","example[0]":"I couldn’t look after him anymore; the strain was too much for me.","example[1]":"Did you find the job a strain?","example[2]":"the stresses and strains of police life","example[3]":"The long working hours put a severe strain on employees.","note[0]":"put/place a strain on somebody","example[4]":"I could see that she was beginning to crack under the strain.","note[1]":"crack/collapse/buckle etc under the strain","example[5]":"The trial has been a terrible strain for both of us.","note[2]":"strain for","example[6]":"It’s quite a strain on me when he’s drinking heavily.","note[3]":"strain on","example[7]":"I know you’ve been under a lot of strain lately.","note[4]":"under (a) strain","signpost[0]":"difficulty","definition[1]":"a difficulty or problem that is caused when a person, relationship, organization, or system has too much to do or too many problems to deal with","example[8]":"The flu epidemic has put a huge strain on the health service.","note[5]":"put/place (a) strain on something","example[9]":"The party split under the strain.","note[6]":"break/crack/collapse etc under the strain","example[10]":"The dry summer has further increased the strain on water resources.","example[11]":"The attack has led to strains in the relationship between the two countries.","note[7]":"strain in","example[12]":"His marriage was under strain.","definition[2]":"a situation in which something is being pulled or pushed, or is holding weight, and so might break or become damaged","example[13]":"These four posts take the strain of the whole structure.","example[14]":"Some of these exercises put too much strain on the back muscles.","example[15]":"The rope snapped under the strain.","note[8]":"break/snap/collapse etc under the strain","example[16]":"The strain on the cables supporting the bridge is enormous.","signpost[1]":"injury","definition[3]":"an injury to a muscle or part of your body that is caused by using it too much","example[17]":"Long hours working at a computer can cause eye strain.","example[18]":"The goalkeeper is still out of action with a knee strain.","signpost[2]":"plant/animal","definition[4]":"a type of animal, plant, or disease","example[19]":"different strains of wheat","note[9]":"strain of","example[20]":"a new strain of the flu virus","signpost[3]":"quality","definition[5]":"a particular quality which people have, especially one that is passed from parents to children","example[21]":"There’s a strain of madness in his family.","signpost[4]":"way of saying something","definition[6]":"an amount of a feeling that you can see in the way someone speaks, writes, paints etc","example[22]":"a strain of bitterness in Young’s later work","collocation[0]":"great/considerable/severe strain","example[23]":"The country’s health system is under great strain.","collocation[1]":"a terrible strain","example[24]":"It’s been a terrible strain.","collocation[2]":"an intolerable strain","example[25]":"The cost of these wars put an intolerable strain on the economy.","collocation[3]":"undue strain","example[26]":"How much can you invest without putting any undue strain on your finances?","collocation[4]":"emotional strain","example[27]":"She has been suffering from considerable emotional strain.","collocation[5]":"financial strain","example[28]":"This welfare program has eased the financial strain of raising children alone.","collocation[6]":"put/place (a) strain on somebody/something","example[29]":"Living with my parents put quite a strain on our marriage.","example[30]":"They are worried that the court system might collapse under the strain.","collocation[7]":"ease the strain","example[31]":"You can do much to ease the strain of the situation for her.","collocation[8]":"be under (a) strain","example[32]":"Claudia could see that he was under considerable strain.","collocation[9]":"stresses and strains","example[33]":"Holidays help people to cope with the stresses and strains of life.","signpost[5]":"injure","definition[7]":"to injure a muscle or part of your body by using it too much or making it work too hard","example[34]":"I’ve strained a muscle in my leg.","example[35]":"You’ll strain your eyes trying to read in this light.","signpost[6]":"effort","definition[8]":"to try very hard to do something using all your strength or ability","example[36]":"I strained my ears, listening for any sound in the silence of the cave.","note[10]":"strain your ears/eyes","example[37]":"She was straining to keep her head above the water.","note[11]":"strain (something) to do something","example[38]":"Bill choked and gasped, straining for air.","definition[9]":"to separate solid things from a liquid by pouring the mixture through something with very small holes in it","example[39]":"She strained the pasta.","definition[10]":"to cause difficulties for something by making too much work or too many problems which it cannot deal with easily","example[40]":"The increased costs will certainly strain our finances.","example[41]":"The incident has strained relations between the two countries.","example[42]":"I felt that my patience was being strained to the limit.","signpost[7]":"pull/push","definition[11]":"to pull hard at something or push hard against something","example[43]":"Buddy’s huge gut strained against the buttons on his shirt.","note[12]":"strain against","example[44]":"a dog straining at its lead","note[13]":"strain at"}