{"word[0]":"determined","definition[0]":"having a strong desire to do something, so that you will not let anyone stop you","example[0]":"Gwen is a very determined woman.","example[1]":"She was determined to win.","note[0]":"determined to do something","example[2]":"He was determined that the same mistakes would not be repeated.","note[1]":"determined (that)","definition[1]":"showing determination, especially in a difficult situation","example[3]":"The library was closed down despite determined opposition.","example[4]":"She was making a determined effort to give up smoking.","note[2]":"determined attempt/effort","definition[2]":"if you are determined to do something, you have decided that you are definitely going to do it, and you will not let anything stop you. Determined  is also used about someone’s character, when they usually behave in this way","example[5]":"I was determined to be a doctor.","example[6]":"She’s a very determined woman.","definition[3]":"determined not to change what you are doing, especially when other people think you are behaving in an unreasonable way. Stubborn  is often used when you disapprove of someone. It is also sometimes used when you admire them","example[7]":"I wish you would stop being so stubborn!","example[8]":"Churchill’s stubborn refusal to surrender","display[0]":"single-minded","definition[4]":"someone who is single-minded  works very hard in order to achieve one particular thing, and thinks that everything else is much less important","example[9]":"During a war, a leader must be single-minded and, if necessary, ruthless.","example[10]":"her single-minded pursuit of power","definition[5]":"determined to succeed, even if a situation is difficult or frightening","example[11]":"In competitive sports, it is as important to be mentally tough as it is to be physically fit.","example[12]":"Gorelick is known as a tough manager.","display[1]":"firm","definition[6]":"showing by your behaviour that you are determined not to change your mind, especially when you are telling someone what to do","example[13]":"What this country needs is firm leadership.","example[14]":"You have to be firm with young children.","display[2]":"feisty","definition[7]":"determined and full of energy, and not afraid to say what you think and argue with people – used especially when you admire this person. Feisty is often used about women","example[15]":"In the film she plays a feisty young woman who is smarter than all the men put together.","example[16]":"a feisty kid with a mind of his own","example[17]":"the city’s feisty mayor","display[3]":"headstrong","definition[8]":"determined to do what you want, without listening to other people’s advice or thinking about the results of your actions – used especially about young people","example[18]":"Her sister was headstrong and impulsive, and made a point of going out whenever and wherever she liked.","display[4]":"resolute","definition[9]":"doing something in a very determined way because you have very strong beliefs, aims etc","example[19]":"the soldiers’ resolute defence of the town","display[5]":"tenacious","definition[10]":"determined and refusing to give up","example[20]":"McTaggart was seen by many in the environment movement as a tenacious hero.","example[21]":"his tenacious grip on power","display[6]":"dogged","definition[11]":"dogged behaviour shows that you are very determined and that you will not give up – used especially in the following phrases","example[22]":"The team played with dogged determination.","example[23]":"his dogged refusal to admit defeat","example[24]":"the dogged persistence of the defenders","display[7]":"persistent","definition[12]":"continuing to do something, although this is difficult, or other people warn you not to do it","example[25]":"If you want to get a job, you have to be persistent. Don’t give up.","display[8]":"strong-willed","definition[13]":"always very determined to do what you want to do, even if other people think it is not a good idea to do it","example[26]":"She has always been a strong-willed child.","display[9]":"ruthless","definition[14]":"someone who is ruthless is so determined to get what they want, that they do not care if they harm other people","example[27]":"a ruthless dictator","example[28]":"He was ruthless in his ambition.","display[10]":"mean business","definition[15]":"to be determined to do something and show other people that you are determined to do it, even if it involves harming someone","example[29]":"The one-day strike proved that the union meant business."}