{"word[0]":"set up","signpost[0]":"company/organization etc","definition[0]":"to start a company, organization, committee etc","synonym[0]":"establish","example[0]":"Now Betterware plans to set up shop elsewhere in Europe.","note[0]":"set up shop/set up in business","example[1]":"They want to set up their own import–export business.","note[1]":"set something ↔ up","example[2]":"new regulations for setting up political parties","example[3]":"John decided to set up as a graphic designer.","note[2]":"set (yourself) up (as something)","signpost[1]":"arrange/organize","definition[1]":"to make the arrangements that are necessary for something to happen","example[4]":"I’ll set up an appointment for you.","example[5]":"There was a lot of work involved in setting up the festival.","signpost[2]":"equipment","definition[2]":"to prepare the equipment that will be needed for an activity so that it is ready to be used","example[6]":"The next band was already setting up on the other stage.","example[7]":"Can someone set the overhead projector up?","signpost[3]":"build/put up","definition[3]":"to place or build something somewhere, especially something that is not permanent","example[8]":"They’ve set up roadblocks around the city.","signpost[4]":"trick somebody","definition[4]":"to trick someone in order to achieve what you want, especially to make it appear that they have done something wrong or illegal","example[9]":"Cox claimed that the police had tried to set him up.","signpost[5]":"provide money","definition[5]":"to provide someone with money that they need, especially in order to start a business","example[10]":"After he qualified as a doctor, his mother set him up in a practice of his own.","example[11]":"Selling her share of the company has set her up for life.","signpost[6]":"healthy/full of energy","definition[6]":"to make you feel healthy and full of energy","example[12]":"A good breakfast will set you up for the day.","definition[7]":"to deliberately make people believe that you have the authority and skill to do something, especially when this is not true","example[13]":"politicians who set themselves up as moral authorities","signpost[7]":"put somebody in position","definition[8]":"to put someone in a position in which they are able to do something, or in which something is likely to happen to them","example[14]":"If he won the fight, it would set him up for a title shot.","note[3]":"set somebody up for","example[15]":"Anyone with public duties sets themselves up for attack.","definition[9]":"to arrange for two people to meet, because you think they might start a romantic relationship","example[16]":"‘How did you meet Nick?’ ‘A friend set us up.’","definition[10]":"to get your own home, furniture etc, especially when you leave your parents’ home to live with a wife, husband, or partner","example[17]":"Many parents try to help their children set up home.","definition[11]":"to start making a loud unpleasant noise","example[18]":"The party guests were setting up a steady din.","definition[12]":"the way that something is organized or arranged","example[19]":"the traditional classroom set-up","definition[13]":"a dishonest plan that is intended to trick someone","example[20]":"How do I know this isn’t a set-up?","definition[14]":"the act of organizing something, such as a business or a computer system","example[21]":"The IT department will assist you with installation and setup.","definition[15]":"several pieces of equipment that work together in a system","example[22]":"‘Do you use the school darkroom?’ ‘No, I’ve got my own setup at home.’","example[23]":"The bank is hopeful of setting up a branch office in Shanghai soon.","example[24]":"Better promotion of the the area is intended to make it more attractive to firms setting up.","definition[16]":"to begin operating a business","example[25]":"There are many tax advantages that encourage foreign banks to set up shop here.","example[26]":"He would prefer to set up in business as an independent financial adviser.","definition[17]":"to make all the arrangements so that something can happen, such as a meeting, event, or a system for doing something","example[27]":"Several companies set up 24-hour telephone hotlines to deal with enquiries.","example[28]":"He recently set up a stress-management class that was attended by about 60 workers.","definition[18]":"the way something is organized or arranged","example[29]":"The trust will be managed by a board of directors, although that setup requires regulatory approval.","definition[19]":"all the parts that work together in a system, especially a computer system","example[30]":"Multimedia setups can mix video clips, recorded speech, music, and computer graphics."}