{"word[0]":"significance","definition[0]":"the importance of an event, action etc, especially because of the effects or influence it will have in the future","opposite[0]":"insignificance","example[0]":"Stella didn’t attach any significance to Doug’s query.","example[1]":"The crime problem has great significance to the general public.","note[0]":"great/little significance (in/to/for something)","example[2]":"The press were slow to grasp the significance of what happened.","note[1]":"grasp/appreciate the significance (of something)","example[3]":"the significance of climate change","note[2]":"significance of","example[4]":"The book assesses the significance of Stalin’s policies between 1927 and 1939.","example[5]":"The results of the study have a wider significance for all the profession.","note[3]":"significance for","definition[1]":"the meaning of a word, sign, action etc, especially when this is not immediately clear","example[6]":"Only later did we realize the true significance of his remark.","note[4]":"full/real/true significance","example[7]":"the significance of the words that refer to the bread Christ shares with his disciples","collocation[0]":"great/considerable significance","example[8]":"The judge said the new evidence was of great significance.","collocation[1]":"little significance","example[9]":"This information on its own is of little significance.","collocation[2]":"wider significance","example[10]":"The research dealt with one small group, but their conclusions are of much wider significance.","collocation[3]":"special significance","example[11]":"This place has a special significance for Icelanders.","collocation[4]":"political/social/historical etc significance","example[12]":"The political significance of this change should not be underestimated.","collocation[5]":"have significance","example[13]":"A child's relationship to his parents has a lasting significance for his future relationships.","collocation[6]":"attach significance to something","example[14]":"They say they don't attach much significance to opinion polls.","collocation[7]":"take on a new/special etc significance","example[15]":"Sporting competitions took on a new political significance during the Cold War.","collocation[8]":"acquire/assume significance","example[16]":"As links with Europe continue to grow, language learning assumes even greater significance.","collocation[9]":"grasp/appreciate/understand the significance of something","example[17]":"The press was slow to grasp the significance of what had happened.","collocation[10]":"assess the significance of something","example[18]":"It is often difficult to assess the significance of an event until more time has passed."}