{"word[0]":"box","definition[0]":"a container for putting things in, especially one with four stiff straight sides","note[0]":"toolbox/shoebox/matchbox etc (=a box used for keeping tools etc in)","example[0]":"a strong cardboard box","note[1]":"cardboard/wooden/plastic etc box","definition[1]":"the amount of something contained in a box","example[1]":"a box of chocolates","note[2]":"box of","definition[2]":"a small square on a page for people to write information in","example[2]":"Put an ‘X’ in the box if you would like to join our mailing list.","definition[3]":"a square or rectangle on a page where information is given or where an answer can be written","example[3]":"The box on the left gives a short history of the battle.","signpost[0]":"in a court/theatre etc","definition[4]":"a small area of a theatre or court that is separate from where other people are sitting","example[4]":"the jury box","signpost[1]":"small building","definition[5]":"a small building or structure used for a particular purpose","synonym[0]":"booth","note[3]":"telephone box British English","example[5]":"a sentry box","signpost[2]":"sports field","definition[6]":"a special area of a sports field that is marked by lines and used for a particular purpose","example[6]":"the penalty box","signpost[3]":"protection","definition[7]":"a piece of plastic that a man wears over his sex organs to protect them when he is playing a sport, especially cricket","signpost[4]":"tree","definition[8]":"a small tree that keeps its leaves in winter and is often planted around the edge of a garden or field","example[7]":"a box hedge","form[0]":"types of box","collocation[0]":"a cardboard/wooden/plastic box","example[8]":"We packed all our things into big cardboard boxes.","collocation[1]":"a storage box","example[9]":"Plastic storage boxes are useful for  putting things in the attic.","collocation[2]":"a toolbox","example[10]":"The hammer’s in the tool box.","collocation[3]":"a shoebox","example[11]":"She used to keep photographs in old shoe boxes.","collocation[4]":"a sandwich/lunch box","example[12]":"Most of the kids bring lunch boxes to school.","collocation[5]":"a jewellery box","example[13]":"A jewellery box had gone missing.","collocation[6]":"a money box","example[14]":"How much have you got in your money box?","collocation[7]":"a cash box","example[15]":"Thieves stole £100 from a cash box at the school.","collocation[8]":"a pile/stack of boxes","example[16]":"There was a pile of boxes in the street outside the house.","definition[9]":"to fight someone as a sport by hitting them with your closed hands inside big leather gloves","definition[10]":"to put things in boxes","example[17]":"Help me box up the Christmas tree lights.","definition[11]":"to draw a box around something on a page","definition[12]":"to think of ideas and solutions that are completely different and new, especially in business","example[18]":"It’s always diffiult to think outside the box and come up with a good product name.","definition[13]":"if something ticks all the boxes, you think it is very good and exactly what you want","example[19]":"Sony’s new high definition TV ticks all the boxes."}