{"word[0]":"operation","definition[0]":"the process of cutting into someone’s body to repair or remove a part that is damaged","example[0]":"She’s going to need an operation on her ankle.","note[0]":"operation on","example[1]":"an operation for cancer","note[1]":"operation for","example[2]":"He had an operation to reduce the swelling in his brain.","note[2]":"operation to do something","signpost[0]":"business/organization","definition[1]":"a business, company, or organization","example[3]":"The firm set up its own property development operation.","example[4]":"a microchip manufacturing operation","example[5]":"Nolan and Barnes were both involved in the operation.","signpost[1]":"work/activities","definition[2]":"the work or activities done by a business or organization, or the process of doing this work","example[6]":"Many small businesses fail in the first year of operation.","example[7]":"The Education Business Partnership has been in operation since 1989.","signpost[2]":"actions","definition[3]":"a set of planned actions or activities for a particular purpose","example[8]":"The UN rescue operation started shortly after dawn.","signpost[3]":"machine/system","definition[4]":"the way the parts of a machine or system work together, or the process of making a machine or system work","example[9]":"The aircraft’s engine operation was normal.","example[10]":"The device has a single button, allowing for easy operation.","example[11]":"Careful checks must be made before the factory commences operation.","example[12]":"The new investment system came into operation in 1999.","example[13]":"Protective clothing must be worn when the machine is in operation.","note[3]":"in operation","signpost[4]":"principle/law/plan etc","definition[5]":"the way something such as a principle or law works or has an effect","example[14]":"The new rule comes into operation on February 1.","note[4]":"come/go into operation","example[15]":"A scheme is being brought into operation to see how these changes would work.","note[5]":"put/bring something into operation","example[16]":"a clear example of the law of gravity in operation","signpost[5]":"military/police action","definition[6]":"a planned military or police action, especially one that involves a lot of people","example[17]":"Britain will carry out a joint military operation with the US.","definition[7]":"an action done by a computer","collocation[0]":"have an operation","example[18]":"Harris had a hip operation in October.","example[19]":"She has undergone 50 operations since birth.","collocation[1]":"do/carry out an operation","example[20]":"The operation was carried out by a team of surgeons at Papworth Hospital.","example[21]":"I’ve done this operation hundreds of times.","collocation[2]":"recover from an operation","example[22]":"A man is recovering from an emergency operation after his pet dog attacked him.","collocation[3]":"survive an operation","example[23]":"Only one person has survived an operation to implant an artificial heart.","form[0]":"ADJECTIVES/NOUN + operation","collocation[4]":"a knee/heart/stomach etc operation","example[24]":"He is almost back to full fitness after a knee operation.","collocation[5]":"a major/minor operation","example[25]":"The unit cares for patients recovering from major operations.","collocation[6]":"an emergency operation","example[26]":"He had to have his spleen removed in an emergency operation.","collocation[7]":"a routine operation","example[27]":"a routine operation to remove an appendix","collocation[8]":"a life-saving operation","example[28]":"The child underwent a life-saving operation to remove a blockage in her stomach.","collocation[9]":"a transplant operation","example[29]":"He is too weak to undergo a transplant operation.","example[30]":"He had an operation to remove a blood clot from his brain.","display[0]":"procedure","definition[8]":"an operation performed in a particular way on a particular part of the body. Procedure is used especially in medical English, for example by doctors and people who work in hospitals. In everyday English people usually say operation","example[31]":"a common surgical procedure","example[32]":"The procedure normally only takes a few minutes.","display[1]":"transplant","definition[9]":"an operation to remove an organ from one person’s body and put it into another person’s body","example[33]":"There is a shortage of donors for heart transplants.","example[34]":"She had to have a kidney transplant.","display[2]":"surgery","definition[10]":"medical treatment involving an operation","example[35]":"She required surgery on her right knee.","example[36]":"He was taken in for surgery.","display[3]":"plastic surgery","definition[11]":"surgery to improve someone’s appearance","example[37]":"The singer has just had plastic surgery on her nose.","display[4]":"bypass","definition[12]":"an operation to make someone’s blood flow past a part of their heart that is blocked or damaged, often using a vein that has been removed from another part of their body","example[38]":"He went into hospital for a triple heart bypass.","display[5]":"skin graft","definition[13]":"an operation to repair an area of skin that has been badly damaged, especially using skin from another part of someone’s body","example[39]":"Her leg was severely burned and may require a skin graft.","definition[14]":"the way the parts of a machine, system etc work together, or the process of making a machine, system etc work","example[40]":"the design and operation of specialized equipment","definition[15]":"if something is in operation, or is put into operation, it is working or is made to start working","example[41]":"The nuclear plants in operation produce 400,000 megawatts.","example[42]":"The new subway lines are scheduled togo into operation at the end of the year.","example[43]":"The manufacturer put a $120 million joint venture in Hungaryinto operation last March.","definition[16]":"a business activity or company","example[44]":"It claimed to be the only European commuter rail operation not supported by public money.","definition[17]":"a part of a large business or company that does a particular activity or type of work","example[45]":"Its West European operations have emerged as the biggest profit earners in the entire group.","example[46]":"The business has been able to shed its loss-making operations.","example[47]":"This move strengthens the company’s retailing operations in the Netherlands.","definition[18]":"the process of operating as a business","example[48]":"The publishing house ceased operations in 1998.","example[49]":"The firm is still in operation.","definition[19]":"a company’s normal activities related to providing services or producing goods, rather than other actions with financial effects, such as selling assets","example[50]":"The company reported earnings from operations of about 88 cents a share.","definition[20]":"the action of buying or selling something","synonym[0]":"TRANSACTION","example[51]":"Their purchase was not the straightforward financial operation they claimed.","definition[21]":"when a law, system, or rule comes into operation, it starts having an effect or being used","example[52]":"The new rule comes into operation on 1 February.","example[53]":"We hope to put the new regulations into operation immediately.","definition[22]":"an action done by a computer or a machine","example[54]":"Several operations can be carried out by the program at the same time.","definition[23]":"a set of actions, usually involving a large number of people, that are planned to achieve a particular purpose","example[55]":"a salvage operation","example[56]":"The construction and administration of questionnaires is a highly skilled operation."}