{"past_tense[0]":"made","signpost[0]":"produce","definition[0]":"to produce something, for example by putting the different parts of it together","example[0]":"I’m going to show you how to make a box for your tools.","example[1]":"A family of mice had made their nest in the roof.","example[2]":"She made her own wedding dress.","example[3]":"The company has been making quality furniture for over 200 years.","example[4]":"They met while they were making a film.","example[5]":"Make a list of all the things you need.","example[6]":"He made her a toy horse, using just some straw and bamboo twigs.","note[0]":"make somebody something","example[7]":"Paper is made from wood.","note[1]":"be made from something","example[8]":"a shirt made of silk","note[2]":"be made (out) of something","example[9]":"She’s very good at making things from old scraps of material.","note[3]":"make something from/out of something","signpost[1]":"do","definition[1]":"used with some nouns to say that someone does something","example[10]":"Anyone can make a mistake.","example[11]":"I can’t make a decision just yet.","example[12]":"I need to make a quick phone call.","example[13]":"You could have made more effort to talk to him.","example[14]":"He made no attempt to apologize.","example[15]":"Could I make a suggestion?","example[16]":"There are a few points I’d like to make.","example[17]":"The police were called but no arrests were made.","example[18]":"I suppose we should make a start on cleaning this room.","example[19]":"Stop making such a fuss!","definition[2]":"to cook or prepare food or drink","example[20]":"When was the last time you made a cake?","example[21]":"John was making breakfast in the kitchen.","example[22]":"Who’s going to make the tea?","example[23]":"I’ll make you some sandwiches.","definition[3]":"to cause something to happen, or cause a particular state or condition","example[24]":"Its beautiful beaches make this a highly popular area with tourists.","example[25]":"It was this movie which made him a star.","example[26]":"His attitude made him very unpopular with colleagues.","example[27]":"The photo makes her look much older than she really is.","example[28]":"The president has made it clear that he is not going to change his mind.","example[29]":"The use of computers has made it possible for more people to work from home.","note[4]":"make something difficult/easy/possible etc","example[30]":"Over 80,000 people attended, making it the biggest sporting event in the area.","note[5]":"make something the best/worst/most expensive etc","example[31]":"I like him because he makes me laugh.","note[6]":"make somebody/something do something","explanation[0]":"In written English, people often use cause somebody to do something rather than make somebody do something, as it sounds more formal:","example[32]":"His attitude caused him to be unpopular with colleagues.","definition[4]":"to force someone to do something","example[33]":"My parents always make me do my homework before I go out.","note[7]":"make somebody do something","example[34]":"I was made to wait four hours before I was examined by a doctor.","note[8]":"be made to do something","signpost[2]":"mark/hole etc","definition[5]":"to cause a mark, hole etc to appear","example[35]":"Make a hole in the paper.","note[9]":"make a hole/dent/mark etc","example[36]":"The cup has made a mark on the table.","signpost[3]":"achieve something","definition[6]":"to succeed in achieving a particular position, rate etc","example[37]":"He was never good enough to make the team.","example[38]":"I don’t think we’ll make the deadline.","signpost[4]":"get money","definition[7]":"to earn or get money","example[39]":"The plan could cost you more than you would make.","example[40]":"They made a profit of £140 million.","example[41]":"His one aim in life was to make money.","example[42]":"She hopes to make a living (=earn the money she needs to live) from writing children’s books.","example[43]":"He’s made a fortune (=earned a lot of money) selling computers on the Internet.","example[44]":"How easy is it to make money out of gardening?","note[10]":"make something out of something","signpost[5]":"have a quality","definition[8]":"to have the qualities that are necessary for a particular job, use, or purpose","example[45]":"I’m sure you will make a very good teacher.","note[11]":"make noun","example[46]":"The hall would make an ideal venue for a wedding reception.","example[47]":"An old cardboard box makes a comfortable bed for a kitten.","explanation[1]":"Make is a linking verb in this meaning It links the subject of the sentence with an adjective and noun","example[48]":"You’ll make a wonderful father","example[49]":"The leaves make a pretty table decoration ","signpost[6]":"be a total","definition[9]":"to be a particular amount when added together","example[50]":"Two and two make four.","example[51]":"There are nine people coming, plus me, which makes ten.","signpost[7]":"calculate","definition[10]":"used to say what you have calculated a number to be","example[52]":"I make that $150 altogether.","signpost[8]":"sports score","definition[11]":"to achieve a particular score in a sports game","example[53]":"Surrey had made 92 by lunchtime.","definition[12]":"to arrive at or get to a particular place, especially when it is difficult","example[54]":"I don’t think we’re going to make the town before nightfall.","signpost[9]":"make something perfect","definition[13]":"to make something complete or successful","example[55]":"The hat makes the outfit.","display[0]":"be made of","explanation[2]":"You use this when saying which material is used to make something The material has not been changed and can still be recognized","example[56]":"The table is made of wood","example[57]":"The ring was made of solid gold","display[1]":"be made from","explanation[3]":"You use this especially when the materials used to make something have been completely changed and cannot be recognized","example[58]":"The drink is made from cherries","example[59]":"Cheese is made from milk","bad_example[0]":"made by cherries","bad_example[1]":"made by milk","display[2]":"be made by","explanation[4]":"You use this when saying who makes something","example[60]":"The pots are made by local craftsmen","explanation[5]":"You also use this when saying how something is made","example[61]":"Tar is made by heating coal to a high temperature","definition[14]":"used about things you make yourself, or things that are made in a factory","example[62]":"Diane makes all her own clothes.","example[63]":"My camera was made in China.","definition[15]":"to make something in large quantities to be sold, or to make something as the result of a natural process","example[64]":"The factory produces high-quality steel.","example[65]":"Japan produces some of the most advanced mobile phones.","example[66]":"The pancreas is a gland in your body which produces hormones.","display[3]":"create","definition[16]":"to make something new and original","example[67]":"Tarantino created a whole new style of films.","example[68]":"Many companies invest a lot of money in creating new products.","example[69]":"Potter was famous for creating characters such as ‘Peter Rabbit’.","example[70]":"This technique is used to create images of beautiful forests.","display[4]":"manufacture","definition[17]":"to make machines, cars, equipment etc in factories","example[71]":"The company manufactures aircraft parts.","display[5]":"mass-produce","definition[18]":"to make very large quantities of something in a factory","example[72]":"They developed a way to mass-produce the drug.","display[6]":"develop","definition[19]":"to design and make something new over a period of time","example[73]":"In 1962, Enders developed an effective vaccine against measles.","example[74]":"The company is developing new anti-virus software.","display[7]":"form","definition[20]":"to make something as the result of a natural process or chemical reaction","example[75]":"Hydrogen and oxygen combine to form water.","example[76]":"The research will help us understand how planets are formed.","display[8]":"generate","definition[21]":"to make something such as heat, electricity, or power","example[77]":"Wind can be used to generate electricity.","definition[22]":"the name of a particular product or of the company that makes it","example[78]":"What make is your car?","example[79]":"It’s one of the most popular makes of satellite phone on the market.","note[12]":"make of","definition[23]":"to produce something by working or by using industrial processes","example[80]":"The company makes and sells pumps and motors.","example[81]":"a label on the toy read ‘ made in Taiwan’","example[82]":"The purpose of this business is to make money.","example[83]":"He expects to make $100,000 this year.","definition[24]":"to earn the money you need to live","example[84]":"He makes a good living selling used cars.","definition[25]":"to make more or less money than you spend","example[85]":"The company made a pretax profit of £309,000.","definition[26]":"if a financial institution makes a market in particular shares etc, it has them available for people and organizations to buy at all times","example[86]":"The company said it would no longer make a market in government securities.","definition[27]":"if you make good on a promise or loan, you do what you promised or give back money that is owed","example[87]":"How does Honda plan to make good its pledge?","example[88]":"Pirelli intends to make good on any trading losses by its allies.","note[13]":"make good on","definition[28]":"to be successful in a particular activity or business","example[89]":"This is a tough business, but I hope you make it.","example[90]":"He failed in his efforts to make it big in Los Angeles.","definition[29]":"to cause either great success or complete failure","example[91]":"They were well aware that large scale investment would make or break the company.","example[92]":"This is a make-or-break year for us.","definition[30]":"a particular name for a product made by a particular company","synonym[0]":"BRAND","example[93]":"The goods were the manufacturer’s own make.","example[94]":"Its devices can work with many different makes of computer.","definition[31]":"to be always trying to get an advantage for yourself"}