{"definition[0]":"something that you hear, or what can be heard","synonym[0]":"noise","example[0]":"There were strange sounds coming from the next room.","example[1]":"a vowel sound","example[2]":"She could hear the sound of voices.","note[0]":"sound of","definition[1]":"the sound produced by a television or radio programme, a film etc","example[3]":"We apologize for the loss of sound during that report.","example[4]":"a sound engineer","definition[2]":"the loudness of a television, radio, film etc","example[5]":"Turn the sound down a little, will you?","note[1]":"turn the sound down/up","definition[3]":"the particular quality that a singer’s or group’s music has","example[6]":"We’re trying to develop a harder, funkier sound.","definition[4]":"a narrow area of water that connects two larger areas of water","collocation[0]":"loud","example[7]":"There was a loud creaking sound and the branch snapped.","collocation[1]":"faint/soft","example[8]":"The sound was so faint I wasn’t sure what it was at first.","collocation[2]":"deafening","example[9]":"The sound of the waterfall was deafening.","collocation[3]":"distinctive/unmistakable","example[10]":"Suddenly from below came the unmistakable sound of gunfire.","collocation[4]":"a strange sound","example[11]":"I heard a strange sound coming from outside.","collocation[5]":"a familiar sound","example[12]":"Suddenly she heard the familiar sound of the key being turned in the front door.","collocation[6]":"a distant sound","example[13]":"All seemed quiet, but for the distant sound of police sirens.","collocation[7]":"a muffled sound","example[14]":"Now there were muffled sounds of movement.","collocation[8]":"a banging/tearing/hissing etc sound","example[15]":"There was an odd buzzing sound in her ears.","collocation[9]":"hear a sound","example[16]":"She heard the sound of a car starting.","collocation[10]":"make a sound","example[17]":"The machine made a strange hissing sound.","collocation[11]":"not make a sound","example[18]":"He lay still and didn’t make a sound.","collocation[12]":"a sound comes from somewhere","example[19]":"The sounds seemed to be coming from the study below.","collocation[13]":"sound travels","example[20]":"Light travels faster than sound.","collocation[14]":"sound carries","example[21]":"I knew the sound of the horn would would carry for miles.","collocation[15]":"a sound stops","example[22]":"The sound stopped suddenly.","collocation[16]":"a sound dies away","example[23]":"I listened until the sound had died away completely.","heading[0]":"a high sound","display[0]":"squeak","definition[5]":"a very short high sound or cry","example[24]":"I heard the squeak of his shoes on the tiled floor.","example[25]":"Annie gave a squeak of surprise.","display[1]":"creak","definition[6]":"a long high sound that something makes when someone opens it, walks on it, sits on it etc – used especially about a door, wooden floor, bed, or stairs","example[26]":"the creak of floorboards","example[27]":"The door opened with a creak.","display[2]":"screech","definition[7]":"a loud, long, unpleasantly high sound – used especially about someone’s voice, or about brakes, tyres etc","example[28]":"There was a screech of tyres followed by a bang.","example[29]":"She let out a screech of horror.","display[3]":"beep","definition[8]":"a high electronic sound that a machine sends out, especially in order to attract someone’s attention","example[30]":"You’ll hear a bleep when the photocopier’s finished printing.","heading[1]":"a quiet sound","display[4]":"hum","definition[9]":"a quiet low continuous sound, especially from electrical equipment, traffic, an engine, or people’s conversation","example[31]":"The only sound was the faint hum of the air-conditioning unit.","example[32]":"He could hear the hum of distant traffic.","display[5]":"rustle","definition[10]":"a continuous quiet sound from papers, leaves, or clothes when they rub together","example[33]":"She heard the rustle of dried leaves behind her.","example[34]":"the rustle of silk dresses","display[6]":"murmur","definition[11]":"a quiet low continuous sound, especially from people’s voices that are far away","example[35]":"The murmur of voices died away.","example[36]":"They spoke in a low murmur.","display[7]":"rumble","definition[12]":"a series of long low sounds, especially from big guns, traffic, or thunder","example[37]":"I heard a rumble of thunder.","example[38]":"the low rumble of a train approaching","heading[2]":"made by a liquid","display[8]":"splash","definition[13]":"the sound that a liquid makes when something hits it, or when it hits against another thing","example[39]":"She jumped into the pool with a big splash.","example[40]":"the splash of the waves against the rocks","display[9]":"gurgle","definition[14]":"the low sound that water makes when it flows gently over or through something","example[41]":"the gurgle of a stream","example[42]":"She listened to the gurgle as the water drained out of the bath.","display[10]":"plop","definition[15]":"the sudden short sound when something is dropped into a liquid","example[43]":"Kate dropped the ice into her glass with a plop.","heading[3]":"made by air or gas","display[11]":"hiss","definition[16]":"a continuous high sound when air or gas comes out of something","example[44]":"There was a hiss of steam from the coffee machine.","example[45]":"Workers reported hearing a loud hiss moments before the explosion.","heading[4]":"made by an explosion, gun etc","display[12]":"bang","definition[17]":"a short sudden loud noise made by a gun, bomb etc","example[46]":"There was a loud bang as the bomb exploded.","example[47]":"The firework went off with a bang.","display[13]":"boom","definition[18]":"a very loud sound from an explosion, which you can hear for several seconds after it begins","example[48]":"The building exploded into rubble with a loud boom.","example[49]":"The boom of artillery fire echoed in the distance.","display[14]":"roar","definition[19]":"a continuous very loud noise that gets louder and continues for a long time","example[50]":"The light was followed by the deafening roar of explosions.","example[51]":"the roar of the ship’s guns","heading[5]":"made by things hitting other things","definition[20]":"a loud sound caused especially when something hard or heavy hits something else","example[52]":"I heard a loud bang and rushed out to see what had happened.","example[53]":"He slammed the door shut with a bang.","display[15]":"crash","definition[21]":"a very loud sound caused when something hits something else, especially when damage is caused","example[54]":"The tray of dishes fell to the floor with a crash.","example[55]":"I heard an enormous crash outside our house, and I went to see what had happened.","display[16]":"thud","definition[22]":"a quiet low sound made when a heavy object falls down onto surface","example[56]":"There was a dull thud as the box hit the floor.","example[57]":"His head hit the ground with a sickening thud.","display[17]":"thump","definition[23]":"a dull loud sound made when a heavy object hits something else","example[58]":"There was a loud thump as Eddie threw Luther back against the wall.","display[18]":"clink","definition[24]":"a short ringing sound made when two glass, metal, or china objects hit each other","example[59]":"the clink of champagne glasses","example[60]":"The clink of cutlery could be heard in the restaurant.","display[19]":"tinkle","definition[25]":"the pleasant sound that is made by light pieces of glass or metal hitting each other repeatedly","example[61]":"He listened to the faint tinkle of cow bells in the distance.","display[20]":"jingle","definition[26]":"the sound of small metal objects being shaken together","example[62]":"the jingle of her bracelets","example[63]":"the jingle of keys","display[21]":"rattle","definition[27]":"a short repeated sound made when things hit against each other – used especially when part of something is loose and is hitting against something","example[64]":"There was a strange rattle coming from the engine.","example[65]":"the rattle of the trolley","signpost[0]":"seem","definition[28]":"if something or someone sounds good, bad, strange etc, that is how they seem to you when you hear about them or read about them","example[66]":"I’ll come over to Richmond and take you out for dinner. How does that sound (=used to ask someone what they think of your suggestion)?","example[67]":"faraway places with strange-sounding names","example[68]":"Istanbul sounds really exciting.","note[2]":"sound adj","example[69]":"The whole story sounded very odd.","example[70]":"$80 sounds about right for a decent hotel room.","example[71]":"That sounds a good idea.","note[3]":"sound noun","example[72]":"Nick sounds like a nice guy.","note[4]":"sound like","example[73]":"It sounds to me as if he needs professional help.","note[5]":"it sounds as if/as though","example[74]":"It sounds like you had a good time on your trip.","note[6]":"it sounds like","definition[29]":"if a noise sounds like a particular thing, that is how it seems to you when you hear it","example[75]":"To Thomas, her laugh sounded horribly like a growl.","example[76]":"I heard what sounded like fireworks.","example[77]":"Her breathing sounded very loud.","example[78]":"The banging sounded as if it was coming from next door.","note[7]":"(it) sounds as if/as though","example[79]":"It sounds like the dog wants to be let out.","note[8]":"(it) sounds like","definition[30]":"if someone sounds tired, happy, sad etc, that is how they seem to you when you hear their voice","example[80]":"Are you okay? You sound tired.","example[81]":"Josie didn’t sound very keen when I spoke to her.","example[82]":"Her voice sounded very young.","example[83]":"You sound as if you’ve got a cold.","note[9]":"sound as if/as though","example[84]":"She sounded like she’d been crying.","example[85]":"You sound just like my mother  (=the things you say, opinions you express etc are just like the things my mother says).","signpost[1]":"warning","definition[31]":"to publicly give a warning or tell people to be careful","example[86]":"Several earlier studies had sounded similar warnings.","example[87]":"Now it is an American economist who is sounding the alarm.","example[88]":"I would, however, sound a note of caution.","note[10]":"sound a note of caution/warning","signpost[2]":"make a noise","definition[32]":"if something such as a horn or bell sounds, or if you sound it, it makes a noise","example[89]":"The bell sounded for dinner.","example[90]":"Sound your horn to warn other drivers.","example[91]":"She was unable to sound the alarm.","signpost[3]":"pronounce","definition[33]":"to make the sound of a letter in a word","example[92]":"The ‘s’ in ‘island’ is not sounded.","explanation[0]":"Sound is usually passive in this meaning","signpost[4]":"measure depth","definition[34]":"to measure the depth of the sea, a lake etc","explanation[1]":"Sound is a linking verb This type of verb links the subject of the sentence with an adjective or noun","example[93]":"That sounds ridiculous","example[94]":"It sounds a good idea","signpost[5]":"well-judged","definition[35]":"sensible or good, and likely to produce the right results","example[95]":"The book is full of sound advice.","example[96]":"a man of great integrity and sound judgement","example[97]":"a sound investment","example[98]":"environmentally sound farming practices","note[11]":"ecologically/ideologically/theoretically etc sound","definition[36]":"someone who is sound can be depended on to make good decisions and give good advice","example[99]":"He’s very sound on matters of law.","note[12]":"sound on","definition[37]":"someone who is sound is a good person and can be trusted – used especially by young people","example[100]":"My mum’s sound. She’d never throw me out.","signpost[6]":"thorough","definition[38]":"complete and thorough","example[101]":"a sound understanding of money and banking systems","example[102]":"a sound knowledge of English","example[103]":"He has a sound grasp of European history.","signpost[7]":"in good condition","definition[39]":"in good condition and not damaged in any way","opposite[0]":"unsound","note[13]":"sound as a bell British English spoken (=in perfect condition)","example[104]":"The floor was completely sound.","example[105]":"Is the building structurally sound?","signpost[8]":"healthy","definition[40]":"physically or mentally healthy","note[14]":"sound as a bell British English spoken (=in perfect health)","definition[41]":"sound sleep is deep and peaceful","note[15]":"sound sleeper (=someone who always sleeps well)","collocation[17]":"sound advice","example[106]":"He gave us some sound advice.","collocation[18]":"sound judgment","example[107]":"He was beginning to rely on her sound judgment.","collocation[19]":"a sound reason","example[108]":"Both these buyers have sound reasons for their choice.","example[109]":"Property is usually a sound investment.","collocation[20]":"a sound policy","example[110]":"The problems of industry will only be solved by sound economic policies.","collocation[21]":"a sound basis","example[111]":"Sometimes friendship is a sound basis for a good marriage.","collocation[22]":"environmentally/ecologically sound","example[112]":"The government encourages environmentally sound management of the countryside.","collocation[23]":"ideologically sound","example[113]":"It was the ideologically sound thing to do.","collocation[24]":"scientifically/technically sound","example[114]":"Are these studies scientifically sound?"}