{"word[0]":"supply","plural[0]":"supplies","signpost[0]":"amount available","definition[0]":"an amount of something that is available to be used","example[0]":"The nation’s fuel supplies will not last forever.","example[1]":"To protect the food supply, the government ordered the slaughter of affected cattle.","example[2]":"There was a plentiful supply of cheap labour.","note[0]":"plentiful/abundant/adequate etc supply","example[3]":"I’ve only got a week’s supply of tablets left.","note[1]":"supply of","signpost[1]":"act of supplying","definition[1]":"when you supply something","example[4]":"The military government is trying to stop the supply of guns to the rebels.","note[2]":"supply of/to","collocation[0]":"a good supply","example[5]":"In hot countries, always carry a good supply of water.","collocation[1]":"a plentiful/abundant supply","example[6]":"There was a plentiful supply of books and magazines to read.","collocation[2]":"an adequate supply","example[7]":"The larger cities usually have more modern health facilities and an adequate supply of medicines.","collocation[3]":"a constant/steady/regular supply","example[8]":"For dairy farming, a constant supply of lush grass is essential.","collocation[4]":"an endless/inexhaustible supply","example[9]":"He has an endless supply of jokes.","collocation[5]":"a ready supply","example[10]":"The early settlers also found a ready supply of flints in the chalk cliffs.","collocation[6]":"a small/limited supply","example[11]":"There is a limited supply of land for building.","collocation[7]":"a dwindling supply","example[12]":"We cannot rely on the dwindling supplies of crude oil and natural gas.","collocation[8]":"a fresh supply","example[13]":"A fresh supply of fuel was needed.","collocation[9]":"use up/exhaust a supply","example[14]":"The diver had nearly used up his supply of oxygen.","definition[2]":"to provide people with something that they need or want, especially regularly over a long period of time","example[15]":"Paint for the project was supplied by the city.","example[16]":"An informer supplied the police with the names of those involved in the crime.","note[3]":"supply somebody with something","example[17]":"They were arrested for supplying drugs to street dealers.","note[4]":"supply something to somebody","past_tense[0]":"supplied","definition[3]":"to provide goods or services to customers, especially regularly and over a long period of time","example[18]":"In certain circumstances they will charge an additional amount when supplying agricultural goods and services.","example[19]":"The company supplies products and services to the energy industry.","example[20]":"The computer giant has agreed to supply Mitsubishi with mainframe and minicomputers.","definition[4]":"to give someone something they want or need","example[21]":"Several pharmaceutical companies are supplyingadditional data and making recommendations on labeling.","example[22]":"Financing was supplied by a syndicate of international banks.","example[23]":"All employees were supplied with protective clothing.","definition[5]":"an amount of something that is available to be sold, bought, used etc","example[24]":"The quality of the locallabour supply has helped to keep his company growing.","example[25]":"One-quarter of the nation’soil supply is shipped via the pipeline.","example[26]":"Coal inventories at the end of March were 390,000 metric tons, a 14-day supply.","example[27]":"During times of rapid growth demand for aircraft maintenance resources also tends to outstrip supply.","definition[6]":"if something is in short supply, very little of it is available","example[28]":"Pricing information is in short supply because computer makers don’t like to talk about the latest trends.","example[29]":"The building projects are behind schedule and construction materials in desperately short supply.","definition[7]":"a system that provides water, gas etc","example[30]":"Thepublic water supply company said the charge was related to its environmental testing laboratory.","definition[8]":"the act of supplying something","example[31]":"There were some difficulties in the supply of raw materials."}