{"word[0]":"lobby","plural[0]":"lobbies","definition[0]":"a wide passage or large hall just inside the entrance to a public building","synonym[0]":"foyer","example[0]":"a hotel lobby","example[1]":"I’ll meet you in the entrance lobby.","definition[1]":"a hall in the British parliament where members of parliament and the public meet","definition[2]":"one of the two passages in the British parliament where members go to vote for or against a bill","definition[3]":"a group of people who try to persuade a government that a particular law or situation should be changed","example[2]":"the anti-foxhunting lobby","example[3]":"a powerful environmental lobby group","explanation[0]":"In this meaning, lobby is usually followed by a singular verb","example[4]":"The business lobby has warned the government against raising taxes","example[5]":"The business lobby have warned the government against raising taxes","definition[4]":"an attempt to persuade a government to change a law, make a new law etc","example[6]":"a mass lobby of Parliament by women’s organizations","definition[5]":"to try to persuade the government or someone with political power that a law or situation should be changed","example[7]":"The group is lobbying for a reduction in defence spending.","note[0]":"lobby for/against","example[8]":"We’ve been lobbying our state representative to support the new health plan.","note[1]":"lobby somebody to do something","definition[6]":"a group of people with similar interests who try to persuade a government that a particular law or situation should be changed","example[9]":"Opposition to the new law is expected from India’s industry lobby.","example[10]":"The Prime Minister is still under pressure from the farm lobby.","definition[7]":"an attempt by a group of people to persuade members of a government that a particular law or situation should be changed","example[11]":"A mass lobby of parliament is planned for next week.","note[2]":"lobby of","past_tense[0]":"lobbied","definition[8]":"to try to persuade a government that a particular law or situation should be changed","example[12]":"The financial community is expected to continue lobbying Congress to introduce new legislation.","example[13]":"Industrialists are already lobbying against the reforms.","note[3]":"lobby against","example[14]":"Small firms are lobbying for a change to the law.","note[4]":"lobby for"}