{"word[0]":"embargo","plural[0]":"embargoes","definition[0]":"an official order to stop trade with another country","synonym[0]":"boycott","note[0]":"trade/arms/oil etc embargo","example[0]":"Many allies are pushing to lift the embargo.","note[1]":"impose/lift an embargo","example[1]":"an embargo on wheat exports","note[2]":"embargo on/against","example[2]":"an embargo against the country","collocation[0]":"place/impose an embargo on something","example[3]":"The UN imposed an embargo on trade with the military regime.","collocation[1]":"lift/end an embargo","example[4]":"Britain favours lifting the embargo on humanitarian grounds.","collocation[2]":"break an embargo","example[5]":"It has been almost impossible to stop countries breaking the embargo.","collocation[3]":"tighten an embargo","example[6]":"We are taking further action to tighten the embargo.","form[0]":"ADJECTIVES/NOUN + embargo","collocation[4]":"a complete/total embargo","example[7]":"There is a complete embargo on arms sales to governments that violate human rights.","collocation[5]":"a strict embargo","example[8]":"The new measures include a strict embargo on fuel.","collocation[6]":"a trade embargo","example[9]":"The EU has threatened to impose a trade embargo on the US.","collocation[7]":"an economic embargo","example[10]":"He asked for an immediate end to the economic embargo imposed last year.","collocation[8]":"an arms embargo","example[11]":"Ministers knew that the arms embargo was being broken.","collocation[9]":"an international embargo","example[12]":"Under the terms of the international embargo, medical aid can still be flown into the capital.","definition[1]":"to officially stop particular goods being traded with another country","example[13]":"Several countries embargoed arms shipments to Yugoslavia.","definition[2]":"to stop information from being made public until a particular date or until permission is given","synonym[1]":"censor","definition[3]":"an official order stopping trade with a country. Governments and organizations put embargoes on countries with which they have a political disagreement","example[14]":"Union officials put an embargo on the importation of yarn by ordering dockers not to handle it.","example[15]":"The UN was urged to lift the embargo (=end it).","example[16]":"An oil embargo would also hurt Italy and Germany, the main importers of Libya’s high quality crude.","definition[4]":"an official order stopping information from being made public until a particular date or time","example[17]":"We need to know when the embargo on the press release will be lifted.","definition[5]":"when there is a possibility of war, a government order stopping ships from an enemy country from entering or leaving its ports","example[18]":"Many countries embargoed arms shipments to Sudan."}