{"word[0]":"art","definition[0]":"the use of painting, drawing, sculpture etc to represent things or express ideas","example[0]":"the Museum of Modern Art in New York","example[1]":"an example of early Indian art","type[0]":"plural, uncountable","definition[1]":"objects that are produced by art, such as paintings, drawings etc","example[2]":"an art exhibition","example[3]":"an art critic","example[4]":"an arts and crafts fair","example[5]":"The exhibition features works of art by Picasso and Matisse.","definition[2]":"the skill of drawing or painting","example[6]":"He’s very good at art.","example[7]":"an art teacher","example[8]":"art college","definition[3]":"the ability or skill involved in doing or making something","example[9]":"Television is ruining the art of conversation.","example[10]":"Writing advertisements is quite an art (=it is difficult to do).","example[11]":"I’ve got the early morning routine down to a fine art.","note[0]":"have/get something down to a fine art","explanation[0]":"You use art when talking in general about paintings, drawings etc","example[12]":"She believes that art should be beautiful","bad_example[0]":"She believes that the art should be beautiful","explanation[1]":"You use art when talking about a particular type of art","example[13]":"He is fond of modern art","bad_example[1]":"He is fond of the modern art","explanation[2]":"You use the art of when talking about the paintings, drawings etc that were produced in a particular place, or at a particular time","example[14]":"There is an exhibition of the art of nineteenth-century Italy ","explanation[3]":"You also often use the art of  when talking about the skill of doing something","example[15]":"He is an expert in the art of lying ","heading[0]":"types of art","display[0]":"modern art","definition[4]":"art from the late 19th century until now","example[16]":"I’m not very keen on modern art.","display[1]":"contemporary art","definition[5]":"art that is being created now","example[17]":"an exhibition of contemporary art","display[2]":"Western art","definition[6]":"art in Europe and North America","example[18]":"Velasquez was one of the greatest figures in the history of Western art.","display[3]":"fine art","definition[7]":"art, especially painting, which is made to be beautiful or affect your emotions, rather than to be useful","example[19]":"She wants to study fine art at college.","example[20]":"the Royal Academy of Fine Arts","display[4]":"abstract art","definition[8]":"paintings or images that consist of shapes or lines which do not look like people, places, or objects","example[21]":"it’s almost impossible for any artist not to be influenced by Picasso’s abstract art.","display[5]":"figurative art","definition[9]":"art that shows pictures of people, places, or objects","example[22]":"In this country, we always feel more comfortable with figurative art.","display[6]":"conceptual art","definition[10]":"a type of modern art, which shows ideas about the world","example[23]":"In conceptual art, the idea behind the work of art holds as much importance as the artwork itself.","display[7]":"applied art","definition[11]":"the use of artistic principles in the design of objects and images for people to use. This includes subjects such as fashion, jewellery design, architecture, and photography","example[24]":"Van de Velde taught at the new school of applied art.","display[8]":"primitive art","definition[12]":"art by people who live in societies where there is a very simple way of life and no modern technology or industry","example[25]":"The interest in primitive art came about largely through the work of Gauguin.","display[9]":"pop art","definition[13]":"art that shows ordinary objects that you find in people’s homes, which was made popular in the 1960s by artists such as Andy Warhol","example[26]":"The relationship of advertising to art was part of the pop art phenomenon in the 1960s.","display[10]":"the visual arts","definition[14]":"painting, sculpture, and other art forms that you look at, not literature or music","example[27]":"The approach to the visual arts has changed in the last two decades.","display[11]":"the decorative arts","definition[15]":"the design and production of beautiful things for the home, such as furniture, pottery, and cloth","example[28]":"The exhibition will also cover the decorative arts.","display[12]":"the performing arts","definition[16]":"dance, music, or drama, done to entertain people","example[29]":"San Diego’s School for the Creative and Performing Arts","display[13]":"the plastic arts","definition[17]":"art that involves producing objects such as sculptures or pots","example[30]":"the decline of the plastic arts in the fifth century","display[14]":"performance art","definition[18]":"a type of art that can combine acting, dance, and other actions to express an idea","example[31]":"It will be a mixture of live performance art, music and poetry in an informal club setting."}