{"word[0]":"investigate","definition[0]":"to try to find out the truth about something such as a crime, accident, or scientific problem","example[0]":"The state police are investigating the incident.","example[1]":"The study investigates the impact of violent TV programming on children.","example[2]":"I heard a noise and went downstairs to investigate.","explanation[0]":"In everyday English, people often say look into something rather than investigate something:","example[3]":"I’ll ask my colleague to look into it.","definition[1]":"to try to find out more about someone’s character, actions etc, because you think they may have been involved in a crime","example[4]":"Penney was already being investigated by the police on suspicion of murder.","example[5]":"Police are investigating an explosion in the city centre.","example[6]":"The aim of the study is to investigate how climate change is affecting animal behaviour.","example[7]":"There were fears he may have drowned in the lake, so divers were sent down to investigate.","display[0]":"look into something","definition[2]":"to find out more about a problem, especially after someone has asked you to do this","example[8]":"The manager promised to look into my complaint.","example[9]":"Please could you look into the matter for me?","display[1]":"explore","definition[3]":"to consider or discuss something, in order to help you decide what you should do","example[10]":"Military leaders are exploring new ways of defending the United States from terrorism.","example[11]":"I’m going to explore the possibility of a part-time job.","display[2]":"probe","definition[4]":"to try to find secret or hidden information, especially by asking questions","example[12]":"The press began probing into the actor’s private life.","example[13]":"We have been probing the reasons why the government has been so slow to react to the problem of climate change.","display[3]":"delve","definition[5]":"to look somewhere in order to try to find more information about something, especially something that is difficult to find out about","example[14]":"Over the past year Ms Deen has been delving into the national archives, in order to discover information on the early Muslim settlers.","example[15]":"I think we need to delve a little deeper.","display[4]":"be under investigation","definition[6]":"if someone or their activities are under investigation, the police are trying to find out if they have done something illegal","example[16]":"Several public figures are under investigation for corruption.","definition[7]":"to try to discover the truth about a crime, accident etc","example[17]":"The fraud office isinvestigating allegations of insider trading by a former employee of the firm."}