{"word[0]":"safety","plural[0]":"safeties","signpost[0]":"not in danger","definition[0]":"when someone or something is safe from danger or harm","example[0]":"You shouldn’t travel alone, for safety’s sake.","example[1]":"For your own safety, please do not smoke inside the plane.","example[2]":"measures to improve the health and safety of employees","note[0]":"safety of","example[3]":"We were able to watch the lions in complete safety.","note[1]":"in safety","example[4]":"For safety, always climb with a partner.","note[2]":"for safety","signpost[1]":"harmful/not harmful","definition[1]":"how safe something is to use, do etc","example[5]":"Lower speed limits are part of a new road safety campaign.","example[6]":"The device meets safety standards.","note[3]":"safety standards/regulations/precautions etc","example[7]":"Campaigners have challenged the safety of genetically modified foods.","signpost[2]":"safe place","definition[2]":"a place where you are safe from danger","example[8]":"They reached safety seconds before the bomb went off.","example[9]":"Firefighters led the children to safety.","note[4]":"get/lead/drag etc somebody to safety","example[10]":"Thirty thousand people fled to the safety of the capital.","definition[3]":"a way of getting two points in American football by making the other team put the ball down in its own goal","definition[4]":"a lock on a gun that stops anyone from shooting it by accident","collocation[0]":"public safety","example[11]":"The police must put public safety first.","collocation[1]":"personal safety","example[12]":"She didn’t seem to care about her own personal safety.","collocation[2]":"road safety","example[13]":"Extra lighting would improve road safety in this area.","collocation[3]":"food safety","example[14]":"New food safety laws say that sandwiches for sale in shops must be kept refrigerated.","form[0]":"safety + NOUN","collocation[4]":"safety standards","example[15]":"He claims safety standards on ferries are still not high enough.","collocation[5]":"safety regulations","example[16]":"She was sold an electric fire that broke all the safety regulations.","collocation[6]":"safety equipment","example[17]":"Your employer should provide the necessary safety equipment.","collocation[7]":"a safety measure","example[18]":"New safety measures have been introduced after two horses died in last year’s race.","collocation[8]":"a safety hazard","example[19]":"The firing range is poorly designed and poses a significant safety hazard.","collocation[9]":"a safety record","example[20]":"The aircraft has a good safety record.","collocation[10]":"health and safety","example[21]":"The Agency’s function is to promote health and safety at work.","collocation[11]":"improve safety","example[22]":"New plans have been announced to improve safety on the railways.","collocation[12]":"ensure/guarantee somebody’s safety","example[23]":"There were few laws or regulations to ensure the safety of workers.","collocation[13]":"fear for somebody’s safety","example[24]":"They fear for the safety of relatives they have left behind.","collocation[14]":"for your own safety","example[25]":"He had been kept in custody for his own safety.","collocation[15]":"for safety reasons","example[26]":"For safety reasons visitors won’t be able to go down the tunnels.","collocation[16]":"as a safety precaution","example[27]":"A fence was put around the lake as a safety precaution.","definition[5]":"the state of being safe from danger or harm","example[28]":"The company seemed totally unconcerned about the safety of its workers.","definition[6]":"the state of not being dangerous or likely to cause harm or injury","example[29]":"Some businesses are failing to meet basic food safety standards.","example[30]":"Experts say that after the introduction of safety measures, the plant is among the safest.","definition[7]":"safety equipment is designed to prevent injury or damage","example[31]":"Workers using power tools must wear the proper safety equipment.","example[32]":"The new model has improved crash resistance and other safety features."}