{"word[0]":"failure","signpost[0]":"lack of success","definition[0]":"a lack of success in achieving or doing something","opposite[0]":"success","example[0]":"Successful people often aren’t very good at dealing with failure.","example[1]":"the conference’s failure to reach an agreement","note[0]":"failure to do something","signpost[1]":"unsuccessful person/thing","definition[1]":"someone or something that is not successful","example[2]":"I always felt a bit of a failure at school.","definition[2]":"a situation in which a business has to close because of a lack of money","example[3]":"Business failures in Scotland rose 10% last year.","signpost[2]":"machine/body part","definition[3]":"an occasion when a machine or part of your body stops working properly","example[4]":"The cause of the crash was engine failure.","example[5]":"He died from kidney failure.","note[1]":"heart/kidney/liver etc failure","example[6]":"a failure in the computer system","note[2]":"failure in","signpost[3]":"crops","definition[4]":"an occasion when crops do not grow or produce food, for example because of bad weather","example[7]":"a series of crop failures","collocation[0]":"end in/result in failure","example[8]":"A series of rescue attempts ended in failure.","collocation[1]":"be doomed to failure","example[9]":"The rebellion was doomed to failure from the start.","collocation[2]":"admit failure","example[10]":"He was too proud to admit failure.","collocation[3]":"accept failure","example[11]":"Being able to accept failure is part of life.","collocation[4]":"avoid failure","example[12]":"She was anxious to avoid failure.","collocation[5]":"complete/total/utter failure","example[13]":"The project ended in total failure.","collocation[6]":"abject/dismal failure","example[14]":"The experiment was considered a dismal failure.","collocation[7]":"a personal failure","example[15]":"He considered his inability to form long-term relationships to be a personal failure.","collocation[8]":"economic failure","example[16]":"Economic failure drove the government out of office.","collocation[9]":"fear of failure","example[17]":"Fear of failure should not deter you from trying.","collocation[10]":"the risk/possibility of failure","example[18]":"The risk of failure for a new product is very high.","example[19]":"The possibility of failure was sufficiently high for the auditors to warn investors.","collocation[11]":"an admission of failure","example[20]":"Dropping out of college would be an admission of failure.","collocation[12]":"a history of failure","example[21]":"Some children have a history of failure at school.","collocation[13]":"a string of failures","example[22]":"The team has had a string of failures in recent games.","collocation[14]":"a sense of failure","example[23]":"People may feel a sense of failure if they admit they have ended up in a job they hate.","collocation[15]":"the consequences of failure","example[24]":"The political consequences of failure would be defeat at the next election.","form[0]":"failure + NOUN","collocation[16]":"a failure rate","example[25]":"There is a high failure rate in the restaurant industry.","example[26]":"The book was a complete failure.","example[27]":"I felt a complete failure.","display[0]":"flop","definition[5]":"something that is not successful because people do not like it – used especially about a film, play, product, or performance","example[28]":"Despite the hype, the movie was a flop at the box office.","example[29]":"Their next computer was a flop.","display[1]":"disaster","definition[6]":"used when saying that something is extremely unsuccessful","example[30]":"Our first date was a disaster.","example[31]":"Their marriage was a total disaster.","display[2]":"fiasco","definition[7]":"something that is completely unsuccessful and goes very badly wrong – used especially about things that have been officially planned, which go very wrong","example[32]":"The baggage system broke down on the first day the airport was open. It was a complete fiasco.","example[33]":"The fiasco came close to ending de Gaulle's political career.","display[3]":"debacle","definition[8]":"an event or situation that is a complete failure, because it does not happen in the way that it was officially planned","example[34]":"the banking debacle that has put our economy at risk","display[4]":"shambles","definition[9]":"if a situation or event is a shambles, it is completely unsuccessful because it has been very badly planned or organized, and no one seems to know what to do","example[35]":"The first few shows were a shambles, but things soon got better.","display[5]":"washout","definition[10]":"a failure – used when something is so bad that it would be better if it had not happened","example[36]":"The play wasn’t a complete washout; the acting was okay.","example[37]":"His most recent and ambitious project, a big-budget Hollywood film, was a washout with both critics and audiences alike.","display[6]":"turkey","definition[11]":"something that is so bad and unsuccessful that you think the people involved should be embarrassed about it – a very informal use","example[38]":"At the time most people thought the car was a complete turkey.","example[39]":"Since then he has appeared in a string of turkeys.","definition[12]":"a situation in which a business that is not successful has to close because it is losing money","example[40]":"The Official Receiver recommended a detailed investigation intothe reasons for the company’s failure.","example[41]":"Business failures rose by 31% to 62,767, according to Dun & Bradstreet.","definition[13]":"lack of success in achieving or doing something","example[42]":"the failure of some large firms to adhere to a strict policy on wages","definition[14]":"a situation in which equipment or a machine stops working","example[43]":"potential financial loss as a result of computer failure"}