{"word[0]":"examine","definition[0]":"to look at something carefully and thoroughly because you want to find out more about it","example[0]":"A team of divers was sent down to examine the wreck.","example[1]":"Hegel’s philosophy will be examined in detail in Chapter 4.","example[2]":"In the course, we will examine how and why Spain became a democracy in 1931.","note[0]":"examine how/whether/what etc","example[3]":"The police will have to examine the weapon for fingerprints.","note[1]":"examine something for something","explanation[0]":"In everyday English, people usually say have or take a look at something or someone rather than examine something or someone:","example[4]":"I had a look at the car but I couldn’t see anything wrong with it.","definition[1]":"if a doctor examines you, they look at your body to check that you are healthy","definition[2]":"to ask someone questions to test their knowledge of a subject","example[5]":"You will be examined on American history.","note[2]":"examine somebody in/on something","definition[3]":"to officially ask someone questions in a court of law","example[6]":"Experts who examined the painting believe it is genuine.","example[7]":"Her new book examines the causes of social discontent.","example[8]":"A team of divers was sent down to examine the wreckage.","example[9]":"The police will examine the weapon for fingerprints.","display[0]":"have a look at/take a look at","definition[4]":"to quickly examine something to find out what is wrong with it or to find out more about it. Have a look at is less formal than examine, and is the usual phrase to use in everyday English","example[10]":"I’ll have a look at your car if you like.","display[1]":"inspect","definition[5]":"to examine something carefully to make sure that it is correct, safe, or working properly, especially when it is your job to do this","example[11]":"The building is regularly inspected by a fire-safety officer.","example[12]":"Some insurance people have already been here to inspect the damage caused by the storm.","example[13]":"Russian and American teams will have the right to inspect each other’s missile sites.","display[2]":"analyze","definition[6]":"to examine something carefully, especially detailed information about something, so that you can understand it","example[14]":"Researchers analyzed the results of the survey.","example[15]":"We’re still analysing all the data.","example[16]":"One of the problems in analyzing the situation is that we do not have all the information yet.","display[3]":"study","definition[7]":"to spend a lot of time examining something very carefully, for example a problem or situation","example[17]":"I won’t comment till I’ve had time to study the proposals.","example[18]":"A team of scientists has been studying the effects of global warming on Antarctica.","display[4]":"review","definition[8]":"to examine something such as a situation or process to see if any changes are necessary","example[19]":"The bank will review its security procedures after last week’s attack.","display[5]":"scrutinize","definition[9]":"to examine something very carefully to find out if there is anything wrong with it","example[20]":"Congress is currently scrutinizing the deal."}