{"word[0]":"tradition","definition[0]":"a belief, custom, or way of doing something that has existed for a long time, or these beliefs, customs etc in general","example[0]":"the traditions of South East Asia","example[1]":"the tradition that the eldest son inherits the property","example[2]":"By tradition, it’s the bride’s parents who pay for the wedding.","form[0]":"ADJECTIVES/NOUN + tradition","collocation[0]":"a long tradition","example[3]":"This country has a long tradition of accepting political refugees.","collocation[1]":"a time-honoured/long-standing tradition","example[4]":"In time-honoured tradition, they have a drink in every pub along the high street.","collocation[2]":"a strong tradition","example[5]":"There is a strong tradition of sport at the school.","collocation[3]":"an old/ancient tradition","example[6]":"In rural Wales, the old traditions persisted.","collocation[4]":"a family tradition","example[7]":"According to family tradition, he must sing at his own wedding.","collocation[5]":"a cultural/religious tradition","example[8]":"cultural traditions that date back many generations","collocation[6]":"a local tradition","example[9]":"The villagers are all keen to preserve local traditions.","collocation[7]":"American/British/Western etc tradition","example[10]":"The festival is a part of the Scottish tradition which is worth preserving.","collocation[8]":"follow a tradition","example[11]":"He followed the family tradition and became a doctor.","collocation[9]":"maintain/carry on/continue/uphold a tradition","example[12]":"We maintain a tradition of cider making dating from Norman times.","collocation[10]":"break with tradition","example[13]":"Why not break with tradition and study at Leeds, say, or London, instead of Oxford?","collocation[11]":"establish a tradition","example[14]":"They are continuing a tradition established by the firm’s Victorian founder.","collocation[12]":"be steeped in tradition","example[15]":"It is an area of the country steeped in tradition."}