{"word[0]":"teach","past_tense[0]":"taught","signpost[0]":"school/college etc","definition[0]":"to give lessons in a school, college, or university, or to help someone learn about something by giving them information","note[0]":"teach school/college etc American English (=teach in a school etc)","example[0]":"He taught geography at the local secondary school.","note[1]":"teach (somebody) English/mathematics/history etc","example[1]":"Neil teaches at the Guildhall School of Music in London.","note[2]":"teach at","example[2]":"We were never taught anything about other religions.","note[3]":"teach somebody (something) about something","example[3]":"I’m teaching English to Italian students.","note[4]":"teach something to somebody","signpost[1]":"show somebody how","definition[1]":"to show someone how to do something","example[4]":"My father taught me to swim.","note[5]":"teach somebody (how) to do something","example[5]":"different methods of teaching children how to read","example[6]":"Can you teach me one of your card tricks?","note[6]":"teach somebody something","signpost[2]":"change somebody’s ideas","definition[2]":"to show or tell someone how they should behave or what they should think","example[7]":"When I was young, we were taught to treat older people with respect.","note[7]":"teach somebody to do something","example[8]":"No one ever taught him the difference between right and wrong.","example[9]":"He taught me that the easy option isn’t always the best one.","note[8]":"teach somebody that","signpost[3]":"experience shows something","definition[3]":"if an experience or situation teaches you something, it helps you to understand something about life","example[10]":"Experience has taught me to avoid certain areas of the city.","example[11]":"It’s certainly taught me that work and money aren’t the most important things in life.","definition[4]":"to give lessons in a school, college, or university","example[12]":"I taught for a year in France.","example[13]":"He teaches physics at York University.","display[0]":"lecture","definition[5]":"to teach in a college or university by giving talks to groups of students on a subject","example[14]":"He lectures in engineering at a local college.","display[1]":"instruct","definition[6]":"to teach someone how to do something, especially a particular practical skill","example[15]":"He was instructing them how to use the computer system.","example[16]":"Staff are instructed in how to respond in the event of a fire.","display[2]":"tutor","definition[7]":"to teach one student or a small group","example[17]":"I found work tutoring Mexican students in English.","display[3]":"coach","definition[8]":"to give private lessons, especially so that someone can pass an important test","example[18]":"He coaches students for their university entrance exams.","definition[9]":"to teach a person or group of people in the particular skills or knowledge they need to do a job","example[19]":"It will take at least a month to train the new assistant.","display[4]":"educate","definition[10]":"to teach someone over a long period, usually at school or university","example[20]":"He was educated in England.","example[21]":"Her parents want to educate her at home.","display[5]":"show somebody the ropes","definition[11]":"to show someone how to do a job or task that they have just started doing","example[22]":"Miss McGinley will show you the ropes and answer any questions you may have."}