{"word[0]":"extend","type[0]":"intransitive + adverb/preposition, transitive","definition[0]":"to continue for a longer period of time, or to make something last longer","example[0]":"Management have agreed to extend the deadline.","example[1]":"Some of our courses extend over two years.","note[0]":"extend for/into/over etc","example[2]":"The government has extended the ban on the import of beef until June.","note[1]":"extend something for/by/until something","signpost[0]":"area/distance","definition[1]":"to continue for a particular distance or over a particular area","example[3]":"The River Nile extends as far south as Lake Victoria.","note[2]":"across/over/through etc","example[4]":"The shelf extends 20 cms from the bookcase.","note[3]":"extend 100 km/30 yards etc (from something)","signpost[1]":"size","definition[2]":"to make a room, building, road etc bigger or longer","example[5]":"We plan to extend the kitchen by six feet.","signpost[2]":"include/affect","definition[3]":"to affect or include people, things, or places","example[6]":"My duties at the school extend beyond just teaching.","note[4]":"extend to/beyond etc","example[7]":"The vote was extended to all women aged 21 and over in 1928.","definition[4]":"to make something affect more people, situations, areas etc than before","example[8]":"British Coal is planning to extend its operations in Wales.","example[9]":"We can extend our insurance cover to travel abroad.","note[5]":"extend something to somebody/something","signpost[3]":"offer help/thanks","definition[5]":"to officially offer someone help, sympathy, thanks etc","example[10]":"We’d like to extend a warm welcome to our French visitors.","note[6]":"extend something to somebody","example[11]":"I’d like to extend my thanks to all the catering staff.","example[12]":"The Coroner extended his sympathy to the victim’s family.","example[13]":"The Headteacher has extended an invitation to the prime minister to visit the school.","example[14]":"The banks have decided to extend credit to the company  (=allow them to borrow more money).","signpost[4]":"arms/legs","definition[6]":"to stretch out a hand or leg","example[15]":"George extended his hand (=offered to shake hands).","signpost[5]":"continue winning","definition[7]":"to increase the number of points, games etc by which one person or team is ahead of other competitors","example[16]":"Manchester United extended their lead at the top of the table to 10 points.","signpost[6]":"furniture","definition[8]":"if a table or ladder extends, it can be made longer","definition[9]":"to increase the period of time for which an agreement, contract etc is effective","example[17]":"The company decided not to extend his employment contract.","example[18]":"The lease has been extended to five years.","definition[10]":"to make something bigger or increase its range","example[19]":"Conservationists have successfully blocked a plan to extend the golf course through the woods.","example[20]":"If the program is successful it will be extended to cover the whole country.","definition[11]":"to make credit available to someone","example[21]":"This was the first time that banks had extended credit to a Mexican government agency."}