{"word[0]":"domestic","definition[0]":"relating to or happening in one particular country and not involving any other countries","example[0]":"US foreign and domestic policy","example[1]":"our nation’s domestic affairs","example[2]":"Domestic flights (=flights that stay inside a particular country) go from Terminal 1.","example[3]":"the booming domestic economy","note[0]":"domestic market/economy/demand etc","definition[1]":"relating to family relationships and life at home","example[4]":"Unfortunately his domestic life wasn’t very happy.","example[5]":"families that can afford domestic help (=help with cleaning, washing etc)","example[6]":"an organization that supports women facing domestic violence (=violence in a family, especially from a husband to his wife)","example[7]":"Nowadays there is more sharing of domestic chores.","note[1]":"domestic tasks/chores/responsibilities etc","definition[2]":"used in people’s homes","example[8]":"a new tax on domestic fuel","example[9]":"domestic appliances such as washing machines","definition[3]":"someone who is domestic enjoys spending time at home and is good at cooking, cleaning etc","example[10]":"No, I’m not very domestic.","definition[4]":"a domestic animal lives on a farm or in someone’s home","opposite[0]":"wild","example[11]":"domestic pets","heading[0]":"– Meaning 1: relating to or happening in one particular country and not involving any other countries","collocation[0]":"the domestic market","example[12]":"The French domestic market is the largest consumer of champagne.","collocation[1]":"the domestic economy","example[13]":"Japan’s domestic economy expanded greatly during this period.","collocation[2]":"domestic policy","example[14]":"The president’s foreign and domestic policies have been criticized.","collocation[3]":"domestic affairs","example[15]":"Colombia rejected any interference in its domestic affairs.","collocation[4]":"domestic demand","example[16]":"Exports fell by 0.5 percent while domestic demand grew.","collocation[5]":"domestic consumption","example[17]":"In the past the country’s industry was small enough to thrive on domestic consumption alone.","collocation[6]":"domestic flights","example[18]":"London’s airports handle one hundred thousand domestic flights a year.","heading[1]":"– Meaning 2: relating to family relationships and life at home","collocation[7]":"domestic life","example[19]":"She enjoyed domestic life and bringing up three children.","collocation[8]":"domestic tasks","example[20]":"How many hours do you spend on domestic tasks each week?","collocation[9]":"domestic chores","example[21]":"Many people find domestic chores very tedious.","collocation[10]":"domestic responsibilities","example[22]":"It can be hard to balance your work and your domestic responsibilities.","collocation[11]":"domestic problems","example[23]":"I didn’t want to listen to any more of his domestic problems.","collocation[12]":"a domestic dispute","example[24]":"Police are often called to domestic disputes.","collocation[13]":"domestic violence/abuse","example[25]":"The organization supports women who are victims of domestic violence.","collocation[14]":"domestic waste","example[26]":"More domestic waste needs to be recycled.","collocation[15]":"domestic help","example[27]":"People in well-paid jobs can afford  domestic help.","collocation[16]":"domestic service","example[28]":"She went into domestic service at the age of 15.","definition[5]":"a servant who works in a large house","definition[6]":"a fight between members of a family in their home","example[29]":"It sounded like the neighbours were having a bit of a domestic.","definition[7]":"relating to the home or the family","example[30]":"dramatic rises planned on domestic fuel bills","definition[8]":"relating to the country you live in, rather than abroad","example[31]":"The government hoped to halt the overall decline in domestic investment by restructuring industrial production.","example[32]":"Only farmers with a federal license can sell peanuts on thedomestic market.","example[33]":"Foreign concern over human rights issues does not constitute interference indomestic affairs."}