{"past_tense[0]":"showed","past_participle[0]":"shown","signpost[0]":"let somebody see","definition[0]":"to let someone see something","example[0]":"The man grinned, showing bad teeth.","example[1]":"The children proudly showed me their presents.","note[0]":"show somebody something","example[2]":"Show your ticket to the woman at the entrance.","note[1]":"show something to somebody","signpost[1]":"prove something","definition[1]":"to provide facts or information that make it clear that something is true, that something exists, or that something has happened","example[3]":"Figures showed a 9% rise in inflation.","example[4]":"Gary has shown his faith in the club’s future by agreeing to stay on.","example[5]":"The Polish economy began to show signs of recovery.","example[6]":"It just goes to show (=proves) how much people judge each other on how they look.","example[7]":"Several studies have shown that aggressive toys lead to bad behaviour.","note[2]":"studies/evidence/research etc shows","example[8]":"Mike needed a copy of the will to show that the books had been left to him.","note[3]":"show (that)","example[9]":"We have shown our critics that we can succeed.","note[4]":"show somebody (that)","example[10]":"This document shows how to oppose bad decisions about new housing.","note[5]":"show how","example[11]":"She just wants a chance to show what she can do.","note[6]":"show what","example[12]":"Charles showed himself to be a fine leader.","note[7]":"show somebody/something to be something","example[13]":"The campaign has been shown to be a waste of money.","note[8]":"be shown to be/do something","example[14]":"The new treatment has been shown to reduce the number of deaths.","explanation[0]":"In written English, people often prefer to use indicate, which sounds more formal than show:","example[15]":"The latest statistics indicate that the country is falling deeper into recession. ","example[16]":"This research demonstrates the need to treat cancer early.","explanation[1]":"In scientific contexts, they often prefer prove or demonstrate, which sound more definite:","signpost[2]":"feelings/attitudes/qualities","definition[2]":"to let your feelings, attitudes, or personal qualities be clearly seen","opposite[0]":"hide","example[17]":"Think positively and show some determination.","example[18]":"She had learned not to show her emotions.","example[19]":"It was the sound a man might make when in pain but trying not to show it.","example[20]":"Mary showed great interest in the children.","signpost[3]":"explain with actions","definition[3]":"to explain to someone how to do something, by doing it yourself or using actions to help them learn","example[21]":"Show me how the gun works.","note[9]":"show somebody how","example[22]":"Maureen showed Peter how to feed the young animals.","note[10]":"show somebody how to do something","example[23]":"Can you show Lucy the way to slice onions?","signpost[4]":"picture/map etc","definition[4]":"if a picture, map etc shows something, you can see it on the picture, map etc","example[24]":"I want a photograph that shows his face.","example[25]":"The map shows the main rivers of the region.","signpost[5]":"guide somebody","definition[5]":"to go with someone and guide them to a place","example[26]":"Can you show Mrs Davies to the bathroom?","note[11]":"show somebody to/into something","example[27]":"I can show myself out  (=out of the office or house).","note[12]":"show somebody out/in","example[28]":"Come on, I’ll show you the way.","signpost[6]":"point at something","definition[6]":"to let someone see where a place or thing is, especially by pointing to it","example[29]":"Can you show me exactly where he fell?","note[13]":"show somebody where","signpost[7]":"film/television","definition[7]":"to make a film or television programme available on a screen for people to see, or to be on a screen","example[30]":"The film was shown on television last night.","example[31]":"The match was shown live  (=could be seen on television while it was being played).","example[32]":"It’s now showing at cinemas across London.","signpost[8]":"be easy to see","definition[8]":"if something shows, it is easy to see","example[33]":"His happiness showed in his face.","example[34]":"Her scar doesn’t show, because her hair covers it.","example[35]":"Stephen was worried, and it showed.","signpost[9]":"dirt/mark","definition[9]":"if material shows the dirt or a mark, it is easy to see the dirt or mark on it","example[36]":"Light-coloured clothes tend to show the dirt.","signpost[10]":"increase/decrease","definition[10]":"to have an increase or decrease in something, or a profit or loss","example[37]":"The price of players is the reason why many football clubs show big losses on their balance sheets.","example[38]":"Recent elections have shown significant gains by right-wing groups.","signpost[11]":"art/pictures","definition[11]":"to put a group of paintings or other works of art in one place so that people can come and see them","synonym[0]":"exhibit","example[39]":"Her recent sculptures are being shown at the Hayward Gallery.","example[40]":"The Whitney Museum was the first to show Mapplethorpe’s photographs.","definition[12]":"to put an animal into a competition with other animals","example[41]":"Do you plan to show your dogs?","definition[13]":"to arrive at the place where someone is waiting for you","synonym[1]":"turn up","example[42]":"I went to meet Hank, but he never showed.","heading[0]":"let someone see","definition[14]":"to let someone see something, especially by holding it out in front of them","example[43]":"Everyone has to show their identity cards at the entrance to the building.","example[44]":"Stephanie showed us her engagement ring.","display[0]":"flash","definition[15]":"to show something to someone very quickly","example[45]":"‘We’re police’, he said, flashing his card at us.","example[46]":"Miranda flashed a surprised look into the mirror.","display[1]":"let somebody have a look/take a look","definition[16]":"to show something to someone, especially so that they can examine it, repair it etc","example[47]":"If the wound doesn’t get better soon, you should let the doctor take a look at it.","example[48]":"Mike’s good with cars – let him have a look.","display[2]":"reveal","definition[17]":"to let someone see or know about something that is usually hidden, or that you want to keep secret – often used about showing your feelings or private thoughts","example[49]":"Suzy looked away quickly in order not to reveal her true feelings.","example[50]":"He lifted the lid of the box to reveal a small snake.","display[3]":"expose","definition[18]":"to let someone see something that could not be seen before","example[51]":"The receding tide had exposed huge expanses of sand.","example[52]":"The bear opened its mouth, exposing rows of sharp teeth.","heading[1]":"show someone how to do something","definition[19]":"to explain to someone how to do something or how something works, especially by doing it yourself","example[53]":"Laurie’s been showing me how to snowboard.","example[54]":"Can I show you how the oven works?","display[4]":"demonstrate","definition[20]":"to show how to do something or how something works – especially to a group of people","example[55]":"A qualified instructor will demonstrate how to use the machines properly.","example[56]":"There’s a meeting this afternoon to demonstrate the new software.","display[5]":"guide/take somebody through something","definition[21]":"to show someone how to do something, or how a process happens, especially something difficult or complicated","example[57]":"The book guides you through the different stages of starting your own business.","example[58]":"A stockbroker will take you through the minefield of stocks and shares.","signpost[12]":"performance","definition[22]":"a performance for the public, especially one that includes singing, dancing, or jokes","example[59]":"I enjoyed the show immensely.","example[60]":"The show starts at 7:30 pm.","example[61]":"They’ve come to town to see a Broadway show.","example[62]":"Perry was the star of the show.","signpost[13]":"tv/radio","definition[23]":"a programme on television or on the radio","example[63]":"The senator appeared on the CBS show ‘Face the Nation’.","example[64]":"a new television quiz show","signpost[14]":"collection of things to see","definition[24]":"an occasion when a lot of similar things are brought together in one place so that people can come and look at them","example[65]":"the Paris Boat Show","example[66]":"a fashion show for charity","example[67]":"Kelly has a show of her latest work opening shortly.","signpost[15]":"pretended act","definition[25]":"when you pretend to do or feel something","synonym[2]":"pretence","example[68]":"Susan put on a show of regret all day.","example[69]":"The waiter made a show of wiping the table.","example[70]":"a show of gratitude","note[14]":"show of","signpost[16]":"colourful scene","definition[26]":"an impressive scene, especially one that is very colourful","synonym[3]":"display","example[71]":"Maple trees put on their best show in the autumn.","example[72]":"a glorious show of colour in the rose garden","definition[27]":"a competition between similar things or animals to choose the best","example[73]":"The dog show was being held in the Agricultural Hall.","signpost[17]":"event/situation","definition[28]":"something which is being done or organized","example[74]":"We need to find someone to run the show (=be in charge).","heading[2]":"– Meaning 2: a programme on television or on the radio","form[0]":"ADJECTIVES/NOUN + show","collocation[0]":"live","example[75]":"Tonight’s show is live from Wembley Stadium.","collocation[1]":"a TV/television/radio show","example[76]":"What’s your favourite TV show?","collocation[2]":"a quiz show","example[77]":"It’s the BBC’s most popular quiz show.","collocation[3]":"a game show","example[78]":"It’s been a popular game show for years.","collocation[4]":"a chat show","example[79]":"She was on the chat show to publicize her new novel.","collocation[5]":"a family show","example[80]":"It’s a real family show, with something for everyone.","collocation[6]":"a news show","example[81]":"the morning news show","collocation[7]":"appear on/take part in a show","example[82]":"They were trying to persuade Daniel Radcliffe to appear on the show.","collocation[8]":"host a show","example[83]":"He presents his own chat show on ITV.","collocation[9]":"watch a show","example[84]":"People of all ages watch the show.","collocation[10]":"the star of the show","example[85]":"Very quickly, Williams became the star of the show.","definition[29]":"an occasion when a lot of similar things are brought together in one place so that people can come and look at them or so that they can compete against each other"}