{"word[0]":"trade","signpost[0]":"buying/selling","definition[0]":"the activity of buying, selling, or exchanging goods within a country or between countries","synonym[0]":"commerce","note[0]":"the arms/drug/slave etc trade (=the buying and selling of weapons, drugs etc)","example[0]":"international trade agreements","example[1]":"unfair trade practices","example[2]":"There has been a marked increase in trade between East and West.","note[1]":"trade between","example[3]":"Trade in ivory has been banned since 1990.","note[2]":"trade in","signpost[1]":"amount of business","definition[1]":"business activity, especially the amount of goods or products that are sold","example[4]":"A lot of pubs nowadays do most of their trade at lunchtimes.","example[5]":"Souvenir shops rely mainly on passing trade.","note[3]":"passing trade","signpost[2]":"an exchange of things","definition[2]":"when you exchange something you have for something that someone else has","example[6]":"Let’s make a trade – my frisbee for your baseball.","definition[3]":"when a player on a sports team is exchanged for a player from another team","example[7]":"The Celtics star demanded a trade after talks with management broke down.","signpost[3]":"job/work","definition[4]":"a particular job, especially one needing special skill with your hands","note[4]":"tools of your trade (=the things that you need to do your job)","example[8]":"Brian insisted that his sons learn a trade.","example[9]":"My grandfather was a plumber by trade (=that was his job).","form[0]":"ADJECTIVES/NOUN + trade","collocation[0]":"international/foreign trade","example[10]":"International trade is essential for long-term economic growth.","collocation[1]":"global/world trade","example[11]":"We want the poorer nations to benefit from increased global trade.","collocation[2]":"the arms/timber/book etc trade","example[12]":"Britain is heavily involved in the arms trade.","collocation[3]":"the drugs/slave trade","example[13]":"the country’s thriving drugs trade","collocation[4]":"the tourist trade","example[14]":"The wildlife and scenery have helped to make the tourist trade Alaska's second industry","collocation[5]":"the retail trade","example[15]":"Advertising encourages the retail trade to stock and display the product.","collocation[6]":"the wholesale trade","example[16]":"In the domestic market, the wholesale trade and retail trade developed rapidly.","form[1]":"trade + NOUN","collocation[7]":"trade barriers","example[17]":"The removal of trade barriers will help our trading partnership.","collocation[8]":"a trade agreement","example[18]":"On April 3 a new trade agreement between Romania and the USA was signed.","collocation[9]":"a trade embargo","example[19]":"Delegates urged the US government to lift its trade embargo against Vietnam.","collocation[10]":"trade talks/negotiations","example[20]":"A further round of trade talks begins this week in Geneva.","collocation[11]":"a trade deficit","example[21]":"The foreign trade deficit widened by 42% compared with the previous year.","collocation[12]":"a trade surplus","example[22]":"Scotch whisky is a major contributor to the UK trade balance, with a large trade surplus.","definition[5]":"to buy and sell goods, services etc as your job or business","example[23]":"They had to travel into town to trade the produce from their farm.","example[24]":"India began trading with Europe in the 15th and 16th centuries.","note[5]":"trade with","example[25]":"The company trades in silk, tea, and other items.","definition[6]":"to exist and operate as a business","note[6]":"cease trading (=stop being a business because you are bankrupt)","example[26]":"The firm now trades under the name Lanski and Weber.","definition[7]":"to buy or sell something on the stock exchange","example[27]":"Over a million shares were traded today.","explanation[0]":"Trade is usually passive in this meaning","definition[8]":"to exchange something you have for something someone else has","example[28]":"We traded necklaces.","example[29]":"I wouldn’t mind trading jobs with her.","note[7]":"trade something with somebody","example[30]":"I’ll trade you my camera for your drill.","note[8]":"trade (somebody) something for something","example[31]":"Trade between Hong Kong and eastern European countries has been very limited.","example[32]":"Restrictive practices in their home market have given Japanese industries an unfair advantage ininternational trade.","example[33]":"The Reptile Protection Trust wants to ban the trade in pet turtles.","definition[9]":"the value of a country’s imports and exports, especially when these are compared","example[34]":"The statistics on UK trade provided some basis for optimism.","example[35]":"Hungary’s total net trade fell between the last two quarters of the year.","example[36]":"The newtrade figures were released today.","definition[10]":"the business done by hotels, banks etc","example[37]":"The figures suggest an improvement in theretail trade (=business done by shops).","example[38]":"For years, the building trade was in heavy recession.","definition[11]":"the business of making and selling clothes","definition[12]":"the level of activity in a company, industry etc","example[39]":"Trade is very slow at the moment.","example[40]":"Garden centres do most of their trade at weekends.","example[41]":"They were doing a brisk trade (=doing a lot of business) in Christmas trees right up to the 24th.","example[42]":"The restaurants on Boat Quay were doing a roaring trade (=doing a lot of business).","definition[13]":"a particular job, especially one needing special skills with your hands","example[43]":"Similar rates of pay apply in other trades, including carpentry, plumbing and joinery.","definition[14]":"buying and selling shares, bonds etc on a stock exchange, or an occasion when people do this","example[44]":"Shares of the company were down $265 at $693 in morning trade.","example[45]":"For trades of 2,000 or more shares, the charge will be $60 plus five cents a share.","definition[15]":"to buy and sell goods, services etc as part of your business","example[46]":"The agreement allows metals and plastics to be traded among 24 countries.","example[47]":"They intended to start up a business trading in electronics equipment.","example[48]":"These countries can trade with Britain without having to pay import duties.","example[49]":"The joint venture willtrade under the name of Do It All chain.","example[50]":"The company currently trades on the American Stock Exchange.","definition[16]":"to buy or sell shares, bonds, currencies, COMMODITIES (=oil, metal, farm products) etc","example[51]":"115 million shares were traded, more than 15% of the company’s stock."}