{"word[0]":"second","definition[0]":"the second person, thing, event etc is the one that comes after the first","example[0]":"the Second World War","example[1]":"the second of August","example[2]":"a second year student","example[3]":"his second wife","example[4]":"Clinton’s second term in office","example[5]":"the second half of the year","example[6]":"the second time in three days","definition[1]":"the position in a competition or scale that comes after the one that is the best, most successful etc","example[7]":"She won second prize.","example[8]":"They climbed to second place in the League.","example[9]":"Africa’s second highest mountain","note[0]":"second largest/most successful etc","example[10]":"The euro will have a circulation second only to that of the dollar.","note[1]":"be second only to something","definition[2]":"another example of the same thing, or another in addition to the one you have","example[11]":"We advertised for a second guitarist.","example[12]":"There was a second reason for his dismissal.","example[13]":"I asked the doctor for a second opinion (=when you ask another person to repeat an examination, test etc for you).","definition[3]":"a unit for measuring time. There are 60 seconds in a minute","example[14]":"Hold your breath for six seconds.","example[15]":"The operation takes only 30 seconds.","example[16]":"Ultrasonic waves travel at around 300 metres per second.","example[17]":"Within seconds, Bev called back.","note[2]":"within seconds","definition[4]":"a very short period of time","example[18]":"I’ll be back in a second.","example[19]":"Just a second (=wait a moment), I’ll come and help.","example[20]":"At least 30 shots were fired in a matter of seconds (=in a very short time).","definition[5]":"one of the 60 parts into which a minute of an angle is divided. It can be shown as a symbol after a number. For example, 78° 52′ 11″ means 78 degrees 52 minutes 11 seconds.","definition[6]":"someone who helps someone in a fight, especially in boxing or, in the past, a duel","definition[7]":"second base","definition[8]":"next after the first one","example[21]":"Tea is the most popular drink, while coffee ranks second  (=it is the second most popular drink).","example[22]":"I came second in the UK championships.","note[3]":"come/finish etc second","definition[9]":"used before you add information to what you have already said","synonym[0]":"secondly","definition[10]":"to formally support a suggestion made by another person in a meeting","note[4]":"second a motion/proposal/amendment etc","definition[11]":"to send someone to do someone else’s job for a short time","example[23]":"Jill’s been seconded to the marketing department while Dave’s away.","note[5]":"be seconded to something","explanation[0]":"Second is usually passive","definition[12]":"the second half, quarter etc of the financial year","example[24]":"The company expects second-quarter sales to be substantially below those of the equivalent period a year ago.","definition[13]":"to officially support a suggestion, idea etc made by another person at a formal meeting so that it can be discussed or voted on","example[25]":"Each nomination must be proposed and seconded by two members of the committee.","definition[14]":"to arrange for an employee to work for another organization for a period of time","example[26]":"We provide the opportunity for you to be seconded to industry to receive additional in-service training.","note[6]":"second somebody to something"}