{"definition[0]":"a group such as a club or business that has formed for a particular purpose","example[0]":"The public expect high standards from any large organization.","example[1]":"the World Trade Organization","example[2]":"a voluntary organization which helps disabled people with their transport needs","example[3]":"an illegal terrorist organization","example[4]":"international organizations such as the UN","definition[1]":"planning and arranging something so that it is successful or effective","example[5]":"Putting on a show of this kind involves considerable organisation.","example[6]":"The college has helped Anne with the organization of the event.","note[0]":"organization of","definition[2]":"the way in which the different parts of a system are arranged and work together","example[7]":"There needs to be a change in the organization of the health service.","definition[3]":"a group of people, companies, or countries, which is set up for a particular purpose","example[8]":"Greenpeace is an international organization that protects the environment.","example[9]":"the World Health Organization","display[0]":"institution","definition[4]":"a large important organization such as a bank, church, or university","example[10]":"The University is an important academic institution.","example[11]":"financial institutions such as banks","display[1]":"association","definition[5]":"an organization for people in a particular profession, sport, or activity, which officially represents its members – often used in names","example[12]":"I met a representative of the National Association of Teachers.","example[13]":"the Football Association","display[2]":"party","definition[6]":"an organization of people with the same political aims which you can vote for in elections","example[14]":"Which political party do you support?","example[15]":"He voted for the Republican Party’s candidate.","definition[7]":"an important group of people who make the rules and advise people about what should be allowed","example[16]":"the sport’s governing body","example[17]":"The government has set up an advisory body.","display[3]":"club/society","definition[8]":"an organization for people who share an interest, for example a sport","example[18]":"We belong to a tennis club.","example[19]":"I joined the university film society.","display[4]":"union","definition[9]":"an organization formed by workers in order to protect their rights","example[20]":"The union ordered its members out on strike.","display[5]":"charity","definition[10]":"an organization which collects money to help people who are poor, sick etc and does not make any profit for itself","example[21]":"She has raised a lot of money for local charities.","display[6]":"quango","definition[11]":"an organization set up by the government, which has official power but whose members have not been elected","example[22]":"the amount of money that is wasted on government quangos","definition[12]":"a company, business, group etc that has been formed for a particular purpose","example[23]":"a not-for-profit organization","example[24]":"Federal officials making the grants consider such factors as an organization’s ability to raise other funds.","definition[13]":"the planning and arranging of work of a particular business, company, group etc","example[25]":"new management methods that challenge classical ideas about organisation","definition[14]":"someone working for a company who never takes risks and always agrees with the people in authority","example[26]":"Entrepreneurial types are more creative and experimental - without them organization Man and Woman will suffer."}