{"word[0]":"within","definition[0]":"before a certain period of time has passed","example[0]":"We should have the test results back within 24 hours.","example[1]":"He fell sick and died within a matter of weeks.","example[2]":"Within an hour of our arrival Caroline was starting to complain.","definition[1]":"during a certain period of time","example[3]":"the enormous success of televised sport within the last twenty years","example[4]":"Within the space of a year, three of the town’s factories have closed down.","definition[2]":"less than a certain distance from a particular place","example[5]":"The invading troops came within 50 miles of Paris.","example[6]":"Within a five mile radius of Ollerton there are several pubs and restaurants.","example[7]":"We live within easy reach of (=close to) the shops.","example[8]":"Adjust the driver’s seat so that all the controls are within reach (=close enough to touch).","example[9]":"As she came within sight of the house, she saw two men getting out of a car.","note[0]":"within sight/earshot (of something)","definition[3]":"inside a particular building or area","example[10]":"Prisoners who died were buried within the walls of the prison.","example[11]":"public footpaths within the national park","example[12]":"The rooms within were richly furnished.","example[13]":"Baby rabbits for sale. Enquire within.","note[1]":"apply/enquire within","definition[4]":"inside a society, organization, or group of people","example[14]":"There have been a lot of changes within the department since I joined.","example[15]":"an attempt to reform the system from within","definition[5]":"if something stays within a particular limit or set of rules, it does not go beyond that limit","example[16]":"We have to operate within a very tight budget.","example[17]":"Security firms have to work strictly within the law.","example[18]":"You can go anywhere you want within reason (=within reasonable limits).","definition[6]":"inside a person’s body or mind","example[19]":"Elaine felt a pain deep within her.","example[20]":"I’m feeling more relaxed within myself."}