{"word[0]":"comment","definition[0]":"an opinion that you express about someone or something","synonym[0]":"remark","note[0]":"no comment (=used by people in public life when they do not want to answer questions)","example[0]":"He was fined for making abusive comments to the referee.","example[1]":"his comments about asylum seekers","note[1]":"comment on/about","definition[1]":"criticism or discussion of something someone has said or done","example[2]":"The speech received much comment in the press.","collocation[0]":"make a comment","example[3]":"Everyone was making appreciative comments about the delicious food.","collocation[1]":"have a comment","example[4]":"Do you have any comments on that, David?","collocation[2]":"pass (a) comment","example[5]":"He looked at my photos but he didn’t pass comment.","collocation[3]":"invite comment(s)","example[6]":"The website invites comments from people who visit it.","collocation[4]":"welcome comments","example[7]":"We would welcome your comments and suggestions.","collocation[5]":"receive comments","example[8]":"It is very helpful to receive comments from the public.","collocation[6]":"a brief/quick comment","example[9]":"I just want to make a very brief comment.","collocation[7]":"a helpful/constructive comment","example[10]":"Pay close attention to your teacher’s constructive comments.","collocation[8]":"a positive/negative comment","example[11]":"There were some very positive comments in the report.","collocation[9]":"a critical comment","example[12]":"The school has received critical comments from inspectors.","collocation[10]":"(a) fair comment","example[13]":"I accepted as fair comment 90% of what he said.","collocation[11]":"a snide comment","example[14]":"She made some really snide comments about you when you weren’t here.","collocation[12]":"a disparaging/derogatory comment","example[15]":"Never make disparaging comments about a colleague’s work.","collocation[13]":"a scathing/damning comment","example[16]":"There were a lot of scathing comments about the film.","collocation[14]":"an appreciative comment","example[17]":"Appreciative comments may improve your staff’s performance.","collocation[15]":"a sarcastic comment","example[18]":"I tried to stay calm, despite his sarcastic comments.","collocation[16]":"a casual comment","example[19]":"I only made a casual comment about finding the work a bit boring.","collocation[17]":"a passing comment","example[20]":"She got upset about a passing comment I made about her clothes.","collocation[18]":"a shrewd comment","example[21]":"His newspaper article is always full of shrewd comments.","collocation[19]":"a wry comment","example[22]":"‘Perhaps the food could be improved, ’ was the wry comment of one prisoner.","collocation[20]":"a bitter comment","example[23]":"Several pensioners passed some bitter comments.","collocation[21]":"a public comment","example[24]":"The jury are forbidden from making public comments.","definition[2]":"something that you say or write in order to give your opinion","example[25]":"Does anyone have any comments?","example[26]":"Readers are invited to send in their comments and suggestions.","definition[3]":"something that you say","example[27]":"Just ignore them if they start making rude remarks.","example[28]":"I’m not sure what he meant by that last remark.","definition[4]":"something that someone mentions about a subject in a discussion, argument, article etc","example[29]":"That’s an interesting point, Steve.","example[30]":"He raises  (=mentions) a number of important points in his paper.","display[0]":"observation","definition[5]":"a comment in which you say what you think or have noticed about something","example[31]":"Karl Marx made the observation that history repeats itself first as tragedy, second as farce.","display[1]":"aside","definition[6]":"a comment made in a low voice, that you intend only certain people to hear","example[32]":"‘Is that true?’ she whispered in an aside to Don.","display[2]":"quip","definition[7]":"a clever and amusing comment","example[33]":"She knew she should reply with some light-hearted quip.","display[3]":"dig","definition[8]":"a comment you make to annoy or criticize someone","example[34]":"I’m tired of her little digs at me.","display[4]":"taunt","definition[9]":"a comment intended to make someone angry or upset","example[35]":"The fans made racist taunts throughout the game.","definition[10]":"to express an opinion about someone or something","example[36]":"People were always commenting on his size.","note[2]":"comment on","example[37]":"Smith’s lawyer commented that the decision was ‘outrageous’.","note[3]":"comment that"}