{"word[0]":"quarter","definition[0]":"one of four equal parts into which something can be divided","example[0]":"Cut the cake into quarters.","example[1]":"a quarter of a mile","note[0]":"a/one quarter (of something)","example[2]":"roughly one quarter of the city’s population","example[3]":"It’s about a page and a quarter.","example[4]":"three quarters of a million pounds","note[1]":"three quarters (of something)","example[5]":"in the last quarter of the 19th century","note[2]":"the first/second etc quarter","signpost[0]":"part of an hour","definition[1]":"a period of 15 minutes","example[6]":"I’ll meet you in a quarter of an hour.","example[7]":"She arrived three quarters of an hour (=45 minutes) late.","example[8]":"It’s a quarter of two.","note[3]":"(a) quarter to (something)","example[9]":"I’ll meet you at a quarter past ten.","note[4]":"(a) quarter past (something)","definition[2]":"a coin used in the US and Canada worth 25 cents","signpost[1]":"three months","definition[3]":"a period of three months, used especially when discussing business and financial matters","example[10]":"Our database is updated every quarter.","example[11]":"The company’s profits rose by 11% in the first quarter of the year.","note[5]":"the first/second/third/fourth quarter","definition[4]":"one of the four equal periods of time into which games of some sports are divided","example[12]":"The home side took the lead in the second quarter.","signpost[2]":"part of a city","definition[5]":"an area of a town","example[13]":"I found a small flat in the student quarter.","example[14]":"Granada’s ancient Arab quarter","example[15]":"a historic quarter of the city","signpost[3]":"college","definition[6]":"one of the four periods into which a year at school or college is divided, continuing for 10 to 12 weeks","example[16]":"What classes are you taking this quarter?","signpost[4]":"moon","definition[7]":"the period of time twice a month when you can see a quarter of the moon’s surface","definition[8]":"to cut or divide something into four parts","example[17]":"Quarter the tomatoes and place them round the dish.","definition[9]":"to provide someone with a place to sleep and eat, especially soldiers","example[18]":"Our troops were quartered in Boston until June.","explanation[0]":"Quarter is usually passive in this meaning","example[19]":"They’re firing almost a quarter of the workforce.","example[20]":"A quarter of the project’s income comes from government grants.","definition[10]":"a period of three months, especially in connection with bills, payments, and income","example[21]":"We will send you a bill every quarter.","example[22]":"Sales in the fourth quarter rose 28% to $1.2 million","example[23]":"The sales director of the SMMT expects sales in the final quarter to be below those in 1999.","example[24]":"At the end of each financial quarter, the chief executive provides information on performance against targets.","definition[11]":"a coin in the US and Canada, worth 25 cents","definition[12]":"if something quarters or is quartered, it decreases to a quarter of what it was","example[25]":"Mergers and acquisitions fees have quartered in the past year."}