{"word[0]":"controversial","definition[0]":"causing a lot of disagreement, because many people have strong opinions about the subject being discussed","example[0]":"the controversial issue of welfare reform","example[1]":"a highly controversial (=very controversial) plan to flood the valley in order to build a dam","example[2]":"He is a controversial figure (=person who does controversial things) in the art world.","collocation[0]":"a controversial issue/topic/subject","example[3]":"I tried to avoid controversial topics such as politics and religion.","collocation[1]":"a controversial decision","example[4]":"The court’s decision was highly controversial.","collocation[2]":"a controversial plan/proposal/policy","example[5]":"the controversial plan to build a new airport","collocation[3]":"a controversial figure","example[6]":"He is a controversial figure in politics.","collocation[4]":"a controversial measure","example[7]":"Banning smoking in public places was a controversial measure.","collocation[5]":"controversial legislation","example[8]":"The controversial legislation has not yet been officially approved.","collocation[6]":"the controversial nature of something","example[9]":"The report was kept secret because of its controversial nature.","collocation[7]":"highly controversial","example[10]":"This policy is highly controversial.","collocation[8]":"politically controversial","example[11]":"The area of workers’ rights remains politically controversial.","definition[1]":"causing a lot of disagreement and angry argument, especially in the newspapers, on television etc","example[12]":"Abortion is a controversial subject.","example[13]":"The film was highly controversial at the time.","display[0]":"contentious","definition[2]":"likely to cause a lot of disagreement and argument","example[14]":"the contentious issue of immigration","example[15]":"These claims are highly contentious.","display[1]":"debatable/arguable","definition[3]":"used when you think that something is not certain and that people have different opinions about it, especially in the phrase it is debatable/arguable whether","example[16]":"It is debatable whether this book is as good as her previous novel.","example[17]":"It is arguable whether these measures will reduce the overall cost.","example[18]":"Does the treatment work? I think that’s debatable.","display[2]":"something is a moot point","definition[4]":"used when you think that something is not certain and that people have different opinions about it – a rather formal phrase","example[19]":"Whether this proposal will really reduce crime is a moot point."}