{"definition[0]":"if you are alone in a place, there is no one with you","synonym[0]":"by yourself","example[0]":"She lives alone.","example[1]":"You shouldn’t leave a child alone in the house.","example[2]":"My wife and I like to spend time alone together away from the kids.","explanation[0]":"In everyday English, people often say by yourself or on your own rather than alone:","example[3]":"She lives by herself/on her own.","definition[1]":"without any friends or people you know","example[4]":"It was scary being all alone in a strange city.","example[5]":"She was all alone in the world (=she had no family or friends to help her or look after her).","definition[2]":"feeling unhappy and lonely","example[6]":"I cried like a child because I felt so alone.","definition[3]":"without any help from other people","example[7]":"He was left to raise their two children alone.","definition[4]":"without including anything else","example[8]":"The case will cost thousands of pounds in legal fees alone.","display[0]":"on your own/by yourself","definition[5]":"without help from anyone else","example[9]":"I can’t move the bed on my own.","example[10]":"See if you can work out the answer by yourself.","example[11]":"Did you paint this picture all on your own?","example[12]":"It’s not fair that she does everything all by herself.","definition[6]":"without any help from anyone else. Alone is more formal and less common than on your own or by yourself","example[13]":"Police believe the killer acted alone.","display[1]":"independently","definition[7]":"without asking for help or advice from anyone","example[14]":"Students are taught to work independently.","example[15]":"One day she will have to live independently without the support of her family.","display[2]":"unaided","definition[8]":"without the help of anyone or anything – used especially about people who are very weak, ill etc","example[16]":"He is unable to breathe unaided.","example[17]":"After treatment, he was able to go up and down stairs unaided.","display[3]":"single-handedly","definition[9]":"doing something difficult or impressive without help from anyone else","example[18]":"She single-handedly reformed the entire system.","display[4]":"solo","definition[10]":"by one person, not a group","example[19]":"Lindbergh’s solo flight across the Atlantic Ocean","example[20]":"She is planning to release a solo album.","example[21]":"He sang and played the song solo.","display[5]":"lone","definition[11]":"doing something alone – used especially in the following phrases","example[22]":"Police say the attack was carried out by a lone gunman.","example[23]":"The government should do more to help lone parents  (=who raise a child alone).","display[6]":"self-made","definition[12]":"someone who has become very rich or successful without help from anyone else","example[24]":"Like most self-made men, he was extremely self-confident."}