{"word[0]":"tolerate","definition[0]":"to allow people to do, say, or believe something without criticizing or punishing them","example[0]":"We simply will not tolerate vigilante groups on our streets.","definition[1]":"to be able to accept something unpleasant or difficult, even though you do not like it","synonym[0]":"stand","example[1]":"I couldn’t tolerate the long hours.","explanation[0]":"In everyday English, people usually say stand rather than tolerate:","example[2]":"I don’t know how she can stand working there.","definition[2]":"if a plant tolerates particular weather or soil conditions, it can exist in them","example[3]":"plants that tolerate drought","definition[3]":"if a person or their body can tolerate a food or other substance, it can use it without becoming ill","example[4]":"Women’s bodies can tolerate less alcohol than men’s.","definition[4]":"to accept unpleasant behaviour or an unpleasant situation, even though you do not like it","example[5]":"We will not tolerate any kind of racism.","example[6]":"People tolerated corruption for years.","display[0]":"put up with something","definition[5]":"to accept unpleasant behaviour or an unpleasant situation even though you do not like it. Put up with is less formal than tolerate, and is the usual word to use in everyday English","example[7]":"I don’t see how you can put up with the constant noise.","example[8]":"Many people put up with poor pay and working conditions because they are afraid of losing their jobs.","display[1]":"accept","definition[6]":"to agree or deal with a situation you do not like but cannot change","example[9]":"She found it hard to accept his death.","display[2]":"stand/bear","definition[7]":"to accept or be forced to accept an unpleasant situation – used especially about things which cause you pain or make you feel upset. Bear is more formal than stand","example[10]":"I don’t know how you’ve stood it for so long.","example[11]":"Maisie couldn’t bear the pain any longer.","example[12]":"How do you stand living in such a mess?","definition[8]":"to accept an unpleasant situation or someone’s unpleasant behaviour without becoming upset","example[13]":"She was shouting at him and he just stood there and took it.","example[14]":"I can’t take much more of this.","display[3]":"live with something","definition[9]":"to accept a bad situation as a permanent part of your life that you cannot change","example[15]":"I’ve had back pain for many years and I’ve just learned to live with it.","example[16]":"The guilt I felt was very hard to live with.","display[4]":"endure","definition[10]":"to accept an unpleasant or difficult situation for a long time","example[17]":"The victims of this war have endured tremendous pain and suffering.","example[18]":"The refugees endured cramped and filthy conditions."}