{"signpost[0]":"minutes/hours etc","definition[0]":"the thing that is measured in minutes, hours, days, years etc using clocks","example[0]":"Einstein changed the way we think about space and time.","example[1]":"close relationships established over a long period of time","example[2]":"Customers have only a limited amount of time to examine the goods.","example[3]":"Their marriage got better as time went by.","note[0]":"time passes/goes by","signpost[1]":"on a clock","definition[1]":"a particular point in time shown on a clock in hours and minutes","note[1]":"have you got the time? British English,  do you have the time? American English (=used to ask someone if they know what time it is)","example[4]":"‘What time is it?’ ‘It’s about two thirty.’","example[5]":"What time are you going out tonight?","example[6]":"Robin’s just learning to tell the time.","note[2]":"tell the time","example[7]":"Oh no. Look at the time. I’ll be late.","note[3]":"look at the time","example[8]":"Is that the time? I must go.","note[4]":"is that the time?","example[9]":"By this time tomorrow I’ll know whether I’ve got the job.","note[5]":"this time tomorrow/last week etc","signpost[2]":"occasion","definition[2]":"an occasion when something happens or someone does something","example[10]":"That was the only time we disagreed.","example[11]":"Do you remember the time I hit Tom Benson?","example[12]":"Mary had seen the film many times.","example[13]":"One time (=once) I went to a garage sale and bought fifteen books.","example[14]":"It was the first time that he had lost a game.","note[6]":"(for) the first/second/last etc time","example[15]":"Gerry had just had back surgery for the third time in two years.","example[16]":"Why don’t you drop in for a drink next time you’re over this way?","note[7]":"(the) next time/(the) last time/this time","example[17]":"The last time  (=the most recent time) I saw Jonathan was Thursday evening.","example[18]":"The freezing weather did not return until February but this time we were prepared.","example[19]":"I missed their concert the first time round so I’m going next week.","note[8]":"the first/second/next/last etc time round","example[20]":"I meet up with Julie every time I go to Washington.","note[9]":"every/each time","example[21]":"How many times did you take your driving test?","note[10]":"how many times ... ?","example[22]":"How many times have I told you not to wander off like that? (=I have told you many times)","example[23]":"The first time I saw it, I loved it","bad_example[0]":"At the first time I saw it, I loved it","signpost[3]":"point when something happens","definition[3]":"the particular minute, hour, day etc when something happens or should happen","example[24]":"Now is the right time for us to move to London.","example[25]":"We’ll sort that out when the time comes (=when it becomes necessary).","example[26]":"This might be a good time to start planning the new garden.","note[11]":"a good/bad time","example[27]":"Now is not the time to annoy Peter.","note[12]":"not the time/hardly the time","example[28]":"‘When do you want to meet?’ ‘Well, there’s no time like the present.’","note[13]":"there’s no time like the present","example[29]":"It’s nearly dinner time.","note[14]":"dinner/lunch/tea etc time","example[30]":"We empty the till each night at closing time.","note[15]":"opening/closing time","example[31]":"Our estimated arrival time is 2:30 pm.","note[16]":"arrival/departure time","example[32]":"England is so lovely at this time of year.","note[17]":"time of day/year","example[33]":"She was three months pregnant at the time of Stephen’s death.","note[18]":"at the time of something","example[34]":"He is performing as well as at any time in his career.","note[19]":"at some/any/that time","example[35]":"The UK has 500,000 stray dogs on its streets at any one time (=at any particular time).","example[36]":"At the time when this scheme was introduced, it was recognised that there might be problems.","note[20]":"at a/the time when ...","example[37]":"The phone was ringing but by the time she got indoors, it had stopped.","note[21]":"by the time ...","example[38]":"Rosie – it’s time to get up.","note[22]":"it’s time to do something","example[39]":"Come on, it’s time for bed.","note[23]":"it’s time for something","example[40]":"He glanced at his watch. ‘It’s time for me to go.’","example[41]":"It’s time I fed the dog.","note[24]":"it’s time somebody did something","signpost[4]":"period of time","definition[4]":"a period of time during which something happens or someone does something","example[42]":"Dustin wanted to spend as much time as possible with his family.","example[43]":"Andy and Tom talked for some time (=for a fairly short period).","example[44]":"Alison was married, for a time (=for a fairly short period), to a comedian.","example[45]":"Martin disliked being away from his family for any length of time (=for more than just a short period).","example[46]":"It took her a long time to make a decision.","example[47]":"Learning a language isn’t easy – it takes time (=takes a long period of time).","example[48]":"I first met Jennifer a long time ago.","note[25]":"a long/short/limited time","example[49]":"They stopped for a short time to rest the horses.","example[50]":"While in New York he took time to visit some friends.","note[26]":"take time to do something","example[51]":"I wanted to make better use of my travel time.","note[27]":"travel time","signpost[5]":"available time","definition[5]":"an amount of time that is available for you to do something","note[28]":"we’re out of time (=used on radio and television programmes to say that there is no more time available on the programme)","example[52]":"I’ll visit him if I have time.","example[53]":"Molly would like to do some diving if there is time.","example[54]":"We don’t have to rush. We have all the time in the world (=have plenty of time).","example[55]":"June had little time to spare (=available time) for making her own clothes.","example[56]":"Being prepared for meetings will save time.","example[57]":"I don’t want to waste time arguing.","example[58]":"She spent precious time (=valuable and important time) looking for a telephone.","example[59]":"I seem to spend most of my time on the phone.","example[60]":"McDuff passed the time writing letters  (=wrote letters because he had nothing else to do).","example[61]":"Book your ticket soon, as time is running out.","example[62]":"He writes poetry in his spare time.","note[29]":"free/spare time","example[63]":"Now the children have left home, she has too much time on her hands.","note[30]":"have time on your hands/time to kill","example[64]":"Make time to talk to your children.","note[31]":"make/find time (for something/to do something)","example[65]":"She realized she would have time for a coffee before her train left.","note[32]":"have time for something","signpost[6]":"period in history","definition[6]":"a particular period in history","example[66]":"Mankind has used the horse since ancient times.","example[67]":"In earlier times, servants would use the bare wooden stairs at the back of the house.","example[68]":"Air pollution has become one of the most significant health problems of our time.","note[33]":"our time(s)","example[69]":"He lived at the time of the Napoleonic wars.","note[34]":"at/in/during etc the time of something","signpost[7]":"pleasant/unpleasant","definition[7]":"a good time, bad time, difficult time etc is a period or occasion when you have good, bad, difficult etc experiences","example[70]":"This was the happiest time of her life.","example[71]":"Julie went to a wedding at the weekend and had the time of her life (=enjoyed herself very much).","example[72]":"They had their happy times, but they had their hard times too.","note[35]":"good/bad/hard etc times","example[73]":"Did you have a good time at the party?","note[36]":"have a good/great/lovely etc time","signpost[8]":"in part of the world","definition[8]":"the way of referring to points in time in one particular part of the world","example[74]":"Eastern Standard Time","example[75]":"British Summer Time","example[76]":"The flight to Boston arrives at 1.15 pm local time.","signpost[9]":"time taken","definition[9]":"the amount of time taken by a competitor in a race","example[77]":"The Olympic medallist’s time in the 200 metres final was 19.21 seconds.","definition[10]":"the amount of time a journey takes","example[78]":"The journey time to London is approximately four hours.","definition[11]":"the end of the normal period of playing time in a sports game, especially football","synonym[0]":"full time","example[79]":"Mason’s goal 13 minutes from time earned his team a place in the finals.","definition[12]":"the number of beats in each bar in a piece of music","example[80]":"Waltzes are usually in three-four time.","heading[0]":"– Meanings 1,5 & 6","example[81]":"As time passed, she thought less and less about her family back home.","collocation[0]":"take time","example[82]":"Learning a new skill takes time.","collocation[1]":"have time","example[83]":"I didn’t do it because I didn’t have time.","collocation[2]":"have/get time to do something","example[84]":"We never get time to do anything together.","collocation[3]":"spend time","example[85]":"I’m going to spend some time with my family.","collocation[4]":"pass the time","example[86]":"The prisoners pass the time reading, or writing letters.","collocation[5]":"waste time","example[87]":"You are wasting your time arguing with him.","collocation[6]":"save time","example[88]":"I used a ready-made sauce in order to save time.","collocation[7]":"make/find time to do something","example[89]":"You need to make time to do things you enjoy.","collocation[8]":"kill time","example[90]":"He was just killing time before his appointment.","form[0]":"ADJECTIVES/NOUN + time","collocation[9]":"a long time","example[91]":"I haven’t seen him for a long time.","collocation[10]":"a short time","example[92]":"A short time later, she heard him drive away.","collocation[11]":"a limited time","example[93]":"The offer is available for a limited time only.","collocation[12]":"some time","example[94]":"I’ve known the truth for some time.","example[95]":"He spends all this free time watching television.","collocation[13]":"precious/valuable time","example[96]":"I’m sorry if I’m taking up your valuable time.","collocation[14]":"family time","example[97]":"As the children get older, evenings become valuable family time.","collocation[15]":"journey/travel time","example[98]":"By train, the journey time to London is about two hours.","collocation[16]":"a period of time","example[99]":"Over a period of time the students develop their own ideas.","collocation[17]":"an amount/a length of time","example[100]":"Customers only have a limited amount of time to inspect the goods.","collocation[18]":"there is time to do something","example[101]":"There was no time to discuss it further.","collocation[19]":"it takes time to do something","example[102]":"It took them a long time to struggle through the crowds.","collocation[20]":"as time goes on","example[103]":"I understood him better as time went on.","collocation[21]":"time is running out","example[104]":"Doctors are looking for a suitable donor, but time is running out.","collocation[22]":"time’s up","example[105]":"Time’s up, class. Put your pens down and hand your papers to the front.","collocation[23]":"have time to kill","example[106]":"I still had some time to kill, so I thought I’d make a couple of phone calls.","heading[1]":"a time when something happens","definition[13]":"a time when something happens or when you should do something","example[107]":"The last time I saw her she was in high school.","example[108]":"It’s time for you to go to bed.","example[109]":"The best time to visit Scotland is in late May.","definition[14]":"a time when something happens. Occasion is more formal than time","example[110]":"They have been seen together on several occasions.","example[111]":"The last occasion the two teams met, the Giants won easily.","display[0]":"moment","definition[15]":"a particular point in time when something happens","example[112]":"At that moment  (=at exactly that time), the door bell rang.","example[113]":"The next moment she was gone.","definition[16]":"a particular time during a longer period of time","example[114]":"At one point during the play she completely forgot her lines.","example[115]":"the lowest point of the holiday","definition[17]":"a long period of time, especially many months or years","example[116]":"They’ve been married a long time – nearly 30 years.","example[117]":"The house has been empty for a long time.","display[1]":"all day/night/year/week","definition[18]":"continuing for the whole day, night, year etc – used especially to emphasize that it is a long time","example[118]":"It’s going to take me all night to finish this essay.","example[119]":"He’s in London all week, and only comes home at the weekends.","display[2]":"hours/weeks/months/years","definition[19]":"many hours, weeks, months, or years – used to emphasize that it is a long time, or much longer than it should be","example[120]":"It’s years since I rode a bike.","example[121]":"My wife had to wait months for a hospital appointment.","display[3]":"ages","definition[20]":"a very long time","example[122]":"I’ve been standing here for ages.","example[123]":"The software takes ages to load.","example[124]":"They’ve lived there for ages.","display[4]":"a while","definition[21]":"a fairly long time","example[125]":"I hadn’t seen Paul for a while, and he’d completely changed.","example[126]":"It may be some time before the company starts to make a profit.","display[5]":"the longest time","example[127]":"For the longest time, my daughter wasn’t reading at all.","example[128]":"It took me the longest time to figure out how to work the sunroof in this car.","display[6]":"a minute/moment","example[129]":"I’ll call you back in a minute.","example[130]":"Can I show you something? It will only take a moment.","display[7]":"a second","definition[22]":"a very short time","example[131]":"I’ll be ready in a second.","example[132]":"Just a second – I can’t find my wallet.","display[8]":"an instant","example[133]":"In an instant, they were gone.","example[134]":"He paused for an instant.","display[9]":"a little while/a short while","definition[23]":"a short period of time, especially a few hours, days, or weeks","example[135]":"I’ve been to Tokyo, but I was only there for a short while.","example[136]":"I saw him a little while ago.","definition[24]":"to arrange that something should happen at a particular time","example[137]":"I saw from the station clock that I had timed my arrival perfectly.","example[138]":"The tour has been timed to allow visitors to attend the opening night of the Verona opera season.","note[37]":"be timed to do something","example[139]":"Her book was timed to coincide with (=arranged to be at the same time as) an exhibition of Goya’s paintings at the National Gallery.","example[140]":"The meeting has been timed for three o'clock.","note[38]":"be timed for something","explanation[0]":"Time is often passive in this meaning","definition[25]":"to measure how fast someone or something is going, how long it takes to do something etc","example[141]":"We had to run up the stairs while the Sergeant timed us.","example[142]":"They timed the winner at 2 minutes and 14.05 seconds.","note[39]":"time somebody/something at something","definition[26]":"to hit a ball or make a shot at a particular moment","example[143]":"Keith timed the pass well.","note[40]":"time something well/badly etc","example[144]":"a beautifully timed shot","definition[27]":"a US weekly news magazine which is sold in the US and is also available in many countries around the world","definition[28]":"the quantity that is measured in minutes, hours, years etc using clocks","example[145]":"The company needs more time to restructure its finances.","example[146]":"The Channel Tunnel considerably cut the journey time from London to Paris.","definition[29]":"one and a half times or one and a quarter times the normal rate of pay","example[147]":"You get time and a half if you come into the office on Saturday.","definition[30]":"twice or three times the normal rate of pay","example[148]":"We worked Sundays and holidays at double time.","definition[31]":"a particular point in time","example[149]":"What time is the meeting?","definition[32]":"the time in one particular part of the world, or the time used in one particular area","example[150]":"We will be arriving in New York at 3 a.m. local time.","definition[33]":"arriving or happening at the correct time or the time that was arranged","example[151]":"86% of our domestic flights were on time last year.","example[152]":"The card rewards customers for paying their bills on time.","example[153]":"The committee meets six times a year.","example[154]":"Customers resented being charged $100 every time they brought a vehicle in for repairs.","definition[34]":"used to say how much bigger, better etc one thing is than another","example[155]":"The stock was recently selling for more than 200 times the past four quarters’ earnings."}