{"comparative[0]":"stronger","superlative[0]":"strongest","signpost[0]":"able to lift heavy things/do hard work","definition[0]":"having a lot of physical power so that you can lift heavy things, do hard physical work etc","example[0]":"He was a big strong man.","example[1]":"Jack was tall and strong.","example[2]":"I’m not strong enough to fight him.","example[3]":"He picked her up in his big strong arms.","note[0]":"strong hands/arms/muscles etc","signpost[1]":"not easily broken or damaged","example[4]":"good strong shoes","example[5]":"The locks on the doors were solid and strong.","signpost[2]":"able to deal with difficulty","definition[1]":"determined and able to deal with a difficult or upsetting situation","example[6]":"I’m not strong enough to take insults and hatred.","example[7]":"Laura had a strong character.","definition[2]":"having a lot of power or influence","example[8]":"The Fifth French Republic was established with a strong president in 1958.","example[9]":"a strong national army","example[10]":"Our party is the strongest as we come up to the election.","signpost[3]":"feelings/opinions","definition[3]":"strong emotions, opinions, beliefs etc are ones that you feel or believe a lot and are very serious about","example[11]":"He had a strong sense of responsibility to his vocation of preaching.","example[12]":"There has been strong support for the strike.","example[13]":"The proposal has met with strong opposition from local people.","example[14]":"Many people have strong feelings about the issue.","note[1]":"strong feelings/views/opinions","signpost[4]":"affect/influence","definition[4]":"a strong desire, influence etc affects you very much","example[15]":"He had a strong desire for power.","example[16]":"Such feelings may have a strong influence over your decisions.","example[17]":"The temptation is very strong.","definition[5]":"a strong relationship, friendship etc is very loyal and likely to last a long time","example[18]":"He maintained strong links with the world of the deaf.","example[19]":"She still has a strong relationship with her mother.","example[20]":"I have a strong commitment to the quality of teaching.","signpost[5]":"argument/reason etc","definition[6]":"likely to persuade other people that something is true or the correct thing to do","example[21]":"There is a strong case for an energy conservation programme.","example[22]":"They need strong evidence to secure a conviction.","example[23]":"a strong argument","signpost[6]":"likely","definition[7]":"likely to succeed or happen","example[24]":"She’s a strong candidate for the party leadership.","example[25]":"A year ago, there was a strong possibility that he wouldn’t live.","note[2]":"strong possibility/chance/probability","signpost[7]":"healthy","definition[8]":"healthy, especially after you have been ill","example[26]":"I don’t think her heart is very strong.","example[27]":"You’ve been blessed with a strong constitution (=you are healthy and do not easily become ill).","signpost[8]":"good at something","definition[9]":"very good at something","example[28]":"His writing was strong on description.","example[29]":"We beat a team that was much stronger than ourselves.","example[30]":"Tact never was my strong point.","note[3]":"be somebody’s strong point/suit","signpost[9]":"taste/smell","definition[10]":"having a taste or smell that you notice easily","example[31]":"strong coffee","example[32]":"This cheese has a very strong flavour.","example[33]":"a strong smell of petrol","signpost[10]":"alcohol/drugs etc","definition[11]":"having a lot of a substance, such as alcohol, that gives something its effect","example[34]":"extra strong beer","example[35]":"strong painkillers","example[36]":"I haven’t touched strong drink (=alcoholic drinks) for years.","signpost[11]":"light/colour","definition[12]":"bright and easy to see","example[37]":"The light was not very strong.","definition[13]":"a strong currency (=the type of money used in a country) does not easily lose its value compared with other currencies","heading[0]":"– Meanings 5 & 6","collocation[0]":"strong views/opinions/ideas","example[38]":"She has strong views on education.","collocation[1]":"a strong feeling","example[39]":"I have a lot of strong feelings on the issue.","collocation[2]":"a strong belief","example[40]":"We have a strong belief that everyone has the right to worship freely.","collocation[3]":"a strong sense of something","example[41]":"There is a strong sense of community here.","collocation[4]":"strong support","example[42]":"The idea won strong support in rural areas.","collocation[5]":"strong opposition","example[43]":"There had been strong opposition to the scheme from the national park authority.","collocation[6]":"a strong interest in something","example[44]":"At 16, he developed a strong interest in archaeology.","collocation[7]":"a strong commitment to something","example[45]":"Since its establishment in 1945 the College has had a strong commitment to research.","collocation[8]":"a strong desire for something/to do something","example[46]":"People have a strong desire for personal independence.","collocation[9]":"a strong influence","example[47]":"The experience of living there had a strong influence on me.","collocation[10]":"a strong impression","example[48]":"She made a strong impression on me.","collocation[11]":"a strong temptation","example[49]":"There’s always a strong temptation to put off doing difficult tasks.","heading[1]":"having a strong body","definition[14]":"having a lot of physical strength","example[50]":"It took four strong men to lift the piano.","example[51]":"You open it – you’re stronger than I am.","definition[15]":"very strong – used about someone’s body, arms, muscles etc","example[52]":"his big powerful shoulders","example[53]":"He was a tall man with a powerful physique.","display[0]":"muscular","definition[16]":"having big muscles and looking strong","example[54]":"She liked men who were big and muscular.","example[55]":"He had a firm muscular body.","display[1]":"well-built","definition[17]":"a well-built man is strong and tall and has a big body","example[56]":"Police say the man they are looking for is 36 years old, 6 feet tall, and well-built.","display[2]":"hunky","definition[18]":"strong and attractive","example[57]":"She married hunky Hollywood star Brad Pitt.","example[58]":"He looks hunky, but he’s not really my type.","example[59]":"The bags are made of strong black plastic.","example[60]":"We need a strong rope for this job.","definition[19]":"strong – used especially about something that can be used a lot without damaging it or making it weaker","example[61]":"a pair of tough leather boots","example[62]":"Kitchen floors need to be tough enough to withstand heavy use.","display[3]":"heavy-duty","definition[20]":"extremely strong – used about materials, tools, machines etc that are made especially to be used a lot without being easily damaged","example[63]":"heavy-duty rubber gloves","example[64]":"a heavy-duty carpet for the hallway","display[4]":"sturdy","definition[21]":"strong and often thick, and not likely to fall over or get broken","example[65]":"a fence made with sturdy wooden posts","example[66]":"The furniture is simple but sturdy.","display[5]":"unbreakable","definition[22]":"extremely strong and impossible to break","example[67]":"Babies need to have unbreakable dishes and cups.","display[6]":"indestructible","definition[23]":"impossible to break, damage, or destroy, and lasting forever","example[68]":"Gold is virtually indestructible.","example[69]":"The pyramids were built as indestructible tombs for the Pharaohs.","display[7]":"hard-wearing","definition[24]":"used about materials and products that will remain in good condition for a long time even when they are used a lot","example[70]":"Ceramic tiles are easy to keep clean and hard-wearing.","example[71]":"a hard-wearing fabric","display[8]":"durable","definition[25]":"used about materials and products that will remain in good condition for a long time – often used on product labels","example[72]":"The jacket has a durable nylon lining.","example[73]":"Varnish is more durable than paint.","display[9]":"robust","definition[26]":"strongly made – used especially about the structure of something, for example a vehicle or machine","example[74]":"a mountain bike with a robust frame","example[75]":"The hardware for the computer must be robust and inexpensive.","definition[27]":"a strong economy or business is financially successful, especially because a lot of money is being earned or received","example[76]":"They fear a strong economy will lead to higher inflation.","example[77]":"products that will help the company maintain a strong cash flow","definition[28]":"if a financial market is strong, prices in it are rising","example[78]":"the recent strong performance by the stock market","definition[29]":"a currency whose value is high compared with other currencies","example[79]":"He blamed the company’s poor exports on the strong pound.","definition[30]":"high demand or growth, a high number of sales etc","example[80]":"Demand will continue to be strong and to outpace production.","example[81]":"Prices of some bonds moved up a point after strong buying."}