{"word[0]":"fly","past_tense[0]":"flew","past_participle[0]":"flown","signpost[0]":"travel by plane","definition[0]":"to travel by plane","example[0]":"She’s flying back to the States tomorrow.","example[1]":"Will you take the train there or fly?","example[2]":"Maurice is nervous about flying, so he usually travels overland.","example[3]":"Lewis stopped off in Jamaica before flying on to Toronto.","example[4]":"The prime minister will be flying to Delhi later today for a three-day visit.","note[0]":"fly to","example[5]":"He was arrested at Heathrow after flying from Brussels airport.","note[1]":"fly from/out of/in etc","signpost[1]":"move through the air","definition[1]":"if a plane, spacecraft etc flies, it moves through the air","example[6]":"The plane was attacked as it flew over restricted airspace.","signpost[2]":"control a plane","definition[2]":"to be at the controls of a plane and direct it as it flies","example[7]":"She was the first woman to fly Concorde.","example[8]":"The pilot was instructed to fly the plane to Montreal airport.","example[9]":"Sonny learnt to fly when he was 15.","signpost[3]":"send somebody/something by plane","definition[3]":"to take goods or people somewhere by plane","example[10]":"The injured boy was flown by air ambulance to the Royal London Hospital.","example[11]":"US planes have been flying food and medical supplies into the area.","note[2]":"fly something into/out of etc something","signpost[4]":"use air company/service","definition[4]":"to use a particular airline or use a particular type of ticket when you travel by plane","example[12]":"We usually fly economy class.","example[13]":"Millions of passengers fly British Airways every year.","signpost[5]":"cross sea by plane","definition[5]":"to cross a particular ocean or area of sea in a plane","example[14]":"Who was the first person to fly the Atlantic?","signpost[6]":"birds/insects","definition[6]":"to move through the air using wings","example[15]":"The mother bird will feed her chicks until they are able to fly.","example[16]":"The evening air was clouded with mosquitoes and other flying insects.","example[17]":"The robin shook its feathers and flew away.","example[18]":"At that moment, a wasp flew in through the open window.","note[3]":"fly away/off/in etc","signpost[7]":"move somewhere quickly","definition[7]":"to move somewhere quickly and suddenly","example[19]":"Rachel’s hand flew to her mouth.","example[20]":"Ellen flew across the room and greeted her uncle with a kiss.","note[4]":"fly down/across/out of etc","example[21]":"The door flew open and a child rushed out.","note[5]":"fly open/shut","definition[8]":"to move quickly and suddenly through the air","example[22]":"There was a loud explosion, and suddenly there was glass flying everywhere.","example[23]":"William hit Jack on the head and sent his glasses flying.","example[24]":"The ball bounced off the wall and went flying into the garden next door.","signpost[8]":"kite","definition[9]":"to make a kite fly in the air","example[25]":"In the park people were walking their dogs or flying their kites.","signpost[9]":"move freely","definition[10]":"to move freely and loosely in the air","example[26]":"Harriet ran after him, her hair flying behind her.","signpost[10]":"flag","definition[11]":"if a flag flies, or if you fly it, it is fixed to the top of a tall pole so that it can be easily seen","example[27]":"After the invasion, people were forbidden to fly their national flag.","example[28]":"The flags were flying cheerfully in the breeze.","example[29]":"The government ordered that all flags should be flown at half mast (=halfway down the pole, in order to express public sadness at someone’s death).","definition[12]":"to leave somewhere in order to escape","synonym[0]":"flee","example[30]":"By the time the police arrived, the men had flown.","definition[13]":"a plan that will fly will be successful and useful","example[31]":"News is that the plan for the new hotel isn’t going to fly.","explanation[0]":"Fly belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[1]":"In this sentence, ‘the plane’ is the object of fly","example[32]":"He flew the plane across the desert","explanation[2]":"In this sentence, ‘the plane’ is the subject of fly","example[33]":"The plane flew across the desert","plural[0]":"flies","signpost[11]":"insect","definition[14]":"a small flying insect with two wings","example[34]":"There were flies buzzing all around us.","signpost[12]":"trousers","definition[15]":"the part at the front of a pair of trousers which you can open","example[35]":"He quickly did up his fly.","example[36]":"Your flies are undone.","signpost[13]":"fishing","definition[16]":"a hook that is made to look like a fly and is used for catching fish","signpost[14]":"baseball","definition[17]":"a fly ball","definition[18]":"to hit a ball in baseball high into the air","definition[19]":"very fashionable and attractive","example[37]":"Wear something really fly for your Friday date.","definition[20]":"clever and not easily tricked","example[38]":"He’s a bit of a fly character.","example[39]":"From Belfast, British Airways Cargo flies to London Heathrow, Manchester and Glasgow.","example[40]":"Mr McGovern always flies economy class.","definition[21]":"to take goods or people to a place by plane","example[41]":"It was more cost-effective to fly the chemicals direct to each country.","example[42]":"A waiting helicopter flew the president to his next meeting.","definition[22]":"if a product or idea flies, it succeeds","example[43]":"We were never confident the system was going to fly.","example[44]":"A product which the market has clearly rejected cannot be made to fly","definition[23]":"to be or do the opposite of what most people think is reasonable, sensible or normal","example[45]":"A sales tax would fly in the face of EU moves towards greater standardisation of indirect taxes.","example[46]":"She made a virtue of flying in the face of business convention."}