{"word[0]":"trial","signpost[0]":"court","definition[0]":"a legal process in which a judge and often a jury in a court of law examine information to decide whether someone is guilty of a crime","example[0]":"The trial is due to start next week.","example[1]":"Brady was on trial for assault.","note[0]":"on trial (for something)","definition[1]":"a process of testing to find out whether something works effectively and is safe","example[2]":"a new drug that is undergoing clinical trials","signpost[1]":"try somebody/something","definition[2]":"a short period during which you use or do something or employ someone to find out whether they are satisfactory for a particular purpose or job","note[1]":"trial separation (=a period of time in which a husband and wife do not live together, to find out whether they want to stay married)","example[3]":"The security system will be reviewed after a three-month trial period.","example[4]":"Smith was hired on a six-month trial basis.","example[5]":"They let me have the computer on trial for thirty days.","note[2]":"on trial","signpost[2]":"difficulty","definition[3]":"something that is difficult to deal with, and that is worrying or annoying","example[6]":"the daily trials of living in a poor country","example[7]":"the trials and tribulations of running a business","example[8]":"My brothers and I were always a real trial to my parents.","note[3]":"be a trial (to/for somebody)","collocation[0]":"be on trial","example[9]":"Her son is on trial charged with murder.","collocation[1]":"stand/face trial","example[10]":"Doctors said he was unfit to stand trial.","collocation[2]":"go on trial","example[11]":"Taylor went on trial accused of fraud.","collocation[3]":"be awaiting/facing trial","example[12]":"Its managing director is awaiting trial on corruption charges.","collocation[4]":"put somebody on trial","example[13]":"They should never have been put on trial, let alone convicted.","collocation[5]":"bring somebody to trial","example[14]":"The people who were responsible for this crime must be brought to trial.","collocation[6]":"be sent for trial","example[15]":"Smith's lawyer battled to stop him being sent for trial in Britain.","collocation[7]":"a trial is held","example[16]":"We believe the trial will be held sometime next month.","collocation[8]":"a trial opens","example[17]":"The trial opened 5 weeks ago.","collocation[9]":"a trial is adjourned","example[18]":"The trial was adjourned until November.","form[0]":"ADJECTIVES/NOUN + trial","collocation[10]":"a murder/fraud etc trial","example[19]":"She was a witness in a murder trial.","collocation[11]":"a fair trial","example[20]":"He is entitled to a fair trial.","collocation[12]":"a criminal trial","example[21]":"In a criminal trial, guilt has to be proven beyond reasonable doubt.","collocation[13]":"a civil trial","example[22]":"In civil trials, the jury's decision need not be unanimous.","collocation[14]":"a case goes/comes to trial","example[23]":"If the case ever went to trial, he would probably lose.","collocation[15]":"the trial judge","example[24]":"The trial judge acquitted the accused on the charge of assault.","collocation[16]":"the trial lawyer","example[25]":"He is regarded as one of the finest trial lawyers in the state.","collocation[17]":"the trial court","example[26]":"The evidence will be fully tested in the trial court.","collocation[18]":"a trial date","example[27]":"No trial date has been set because of procedural delays.","collocation[19]":"the trial verdict","example[28]":"His lawyers have said they will appeal the civil trial verdict.","definition[4]":"to thoroughly test something to see if it works correctly or is effective","synonym[0]":"try out","example[29]":"These techniques were trialled by teachers in 300 schools.","definition[5]":"a legal process in which a court of law examines a case to decide whether someone is guilty of a crime","example[30]":"Three former brokers were ordered tostand trial for securities fraud.","definition[6]":"a process of testing a product to see whether it is safe, effective etc","example[31]":"The company expectsclinical trials (=scientific tests on a drug to see if it is safe before it is sold) to continue for two years.","definition[7]":"if you do something by or through trial and error, you try several different ways of doing it to get the result you want","example[32]":"I got these machine settings right purely by trial and error."}