{"word[0]":"port","signpost[0]":"where ships stop","definition[0]":"a place where ships can be loaded and unloaded","example[0]":"The ferry was about to leave port.","note[0]":"come into port/leave port","example[1]":"We’ll have two days ashore while the ship is in port.","note[1]":"be in port","signpost[1]":"town","definition[1]":"a town or city with a harbour or docks where ships can be loaded or unloaded","example[2]":"Britain’s largest port","definition[2]":"a part of a computer where you can connect another piece of equipment, such as a printer","signpost[2]":"wine","definition[3]":"strong sweet Portuguese wine that is usually drunk after a meal","example[3]":"a glass of port","signpost[3]":"side of ship","definition[4]":"the left side of a ship or aircraft when you are looking towards the front","opposite[0]":"starboard","example[4]":"on the port side","example[5]":"The plane tilted to port.","note[2]":"to port","form[0]":"ADJECTIVES/NOUN + port","collocation[0]":"a busy port","example[6]":"Hong Kong is one of the world’s busiest ports.","collocation[1]":"a major/important port","example[7]":"The city became a major port.","collocation[2]":"a bustling port","example[8]":"Until the 1870s, Port Albert was a bustling port.","collocation[3]":"a fishing port","example[9]":"The town is Iceland's biggest fishing port.","collocation[4]":"a container port","example[10]":"Hamburg is one of Europe's main container ports.","collocation[5]":"a ferry port","example[11]":"Dover is an important ferry port.","example[12]":"Many shops remain open on a Sunday, especially if cruise ships are in port.","collocation[6]":"come into port","example[13]":"We stood on the quay and watched the ships come into port.","collocation[7]":"leave port","example[14]":"Two fishing boats were preparing to leave port.","display[0]":"harbour","definition[5]":"an area of water next to the land which is protected by walls so the water is calm, and is a place where ships can stay when they are not sailing","example[15]":"They sailed into Portsmouth Harbour","example[16]":"Tourist boats leave the harbour at Riva regularly.","example[17]":"the harbour wall","display[1]":"dock","definition[6]":"a place in a port where ships are loaded, unloaded, or repaired","example[18]":"A crowd was waiting at the dock to greet them.","example[19]":"The ship was in dock for repairs.","display[2]":"pier","definition[7]":"a structure that is built over and into the water so that boats can stop next to it or people can walk along it","example[20]":"The yacht was moored at a pier.","display[3]":"jetty","definition[8]":"a wall or platform built out into the water, used for getting on and off boats","example[21]":"a wooden jetty","example[22]":"The house has a private jetty.","display[4]":"mooring","definition[9]":"the place where a ship or boat is fastened to the land or to the bottom of the sea","example[23]":"Tugs towed the boat away from its mooring at White Bay.","display[5]":"marina","definition[10]":"a harbour where people keep boats which are used for pleasure","example[24]":"They are building a new 220-berth marina.","example[25]":"The apartments have a private marina.","definition[11]":"to move software from one computer system to another","example[26]":"Can Windows applications be ported to Unix?","note[3]":"port something from/to something","definition[12]":"a place where ships can load and unload people or things, or a town or city that has one of these places","example[27]":"Inspectors were holding up grain exports at Canadian ports.","example[28]":"Port officials reported huge losses on port operations last year.","example[29]":"The cargo can leave port immediately.","example[30]":"the Jordanian port of Aqaba","definition[13]":"a part of a computer where you can connect another piece of equipment such as a printer","example[31]":"The unit plugs into the printer port of your PC.","definition[14]":"to run software on another computer system without changing it in any way","note[4]":"port something to something"}