{"word[0]":"pretend","definition[0]":"to behave as if something is true when in fact you know it is not, in order to deceive people or for fun","example[0]":"He’s not asleep – he’s just pretending.","example[1]":"To pretend ignorance of the situation would be irresponsible.","example[2]":"I can’t marry her and to pretend otherwise would be wrong.","example[3]":"We can’t go on pretending that everything is OK.","note[0]":"pretend (that)","example[4]":"Let’s pretend we’re on the Moon.","example[5]":"She pretended not to notice.","note[1]":"pretend to do something","type[0]":"transitive usually in negatives","definition[1]":"to claim that something is true, when it is not","example[6]":"I can’t pretend I understand these technical terms (=I admit I do not understand them).","example[7]":"The book doesn’t pretend to be for beginners.","note[2]":"pretend to do/be something","definition[2]":"to deliberately behave as though something is true when it is not, either for fun or to deceive someone","example[8]":"Mark closed his eyes and pretended to be asleep.","example[9]":"She shouted but he pretended that he hadn’t heard her.","display[0]":"act","definition[3]":"to behave in a particular way – often used when saying that someone is pretending that something is true, when it is not","example[10]":"Paul acted as if nothing was wrong.","example[11]":"She always acts like she’s pleased to see me, but I’m sure she’s not.","example[12]":"He enjoyed acting the fool (=pretending to be stupid) and couldn’t care less about his studies.","example[13]":"The boy acted all innocent and said that he knew nothing about the money.","example[14]":"I tried to act the good housewife when I got married.","display[1]":"make out something","definition[4]":"to pretend that something is true, in order to avoid doing something or to deceive someone","example[15]":"I didn’t want to go, so I made out I was busy.","example[16]":"She always makes out that she doesn’t have any money.","display[2]":"be putting it on","definition[5]":"to be pretending to be ill, hurt etc, especially in order to avoid doing something, or to make other people feel sympathy for you","example[17]":"She’s not really upset, she’s just putting it on.","display[3]":"feign interest/surprise/ignorance/illness etc","definition[6]":"to pretend that you are interested, surprised etc","example[18]":"‘Oh really!’ he said, trying to feign interest.","example[19]":"Sometimes it’s best just to feign ignorance  (=pretend that you do not know).","display[4]":"keep up appearances","definition[7]":"to pretend that your life is happy and successful, especially when you have suffered some kind of trouble or loss","example[20]":"Although we were poor, our family always tried to keep up appearances.","example[21]":"She did her best to keep up appearances after her husband left her.","heading[0]":"to pretend to be someone or something","display[5]":"impersonate","definition[8]":"to copy the way that a famous person speaks and behaves, in order to entertain people, or to pretend to have an official job, in order to trick people","example[22]":"He’s brilliant at impersonating the president.","example[23]":"It’s illegal to impersonate a police officer.","display[6]":"pose as somebody","definition[9]":"to pretend to be someone else, especially someone in an official position, so that it is easier for you to do something bad or illegal","example[24]":"He posed as a doctor to gain access to the hospital.","example[25]":"There have been cases of thieves posing as telephone engineers.","display[7]":"masquerade as somebody/something","definition[10]":"to pretend to be someone or something else – used especially when saying that someone or something is not who they claim to be","example[26]":"Their advertisements are always full of people in white coats masquerading as scientists.","example[27]":"It’s not real news – it’s government propaganda masquerading as news.","definition[11]":"imaginary or not real – used especially by children","example[28]":"We sang songs around a pretend campfire."}