{"word[0]":"regular","signpost[0]":"every hour/day/week etc","definition[0]":"happening every hour, every week, every month etc, usually with the same amount of time in between","opposite[0]":"irregular","example[0]":"The company holds regular meetings with employees.","example[1]":"His breathing was slow and regular.","example[2]":"Trains will run at regular intervals from 11am to 4pm.","example[3]":"We hear from him on a regular basis.","example[4]":"He phones us every Sunday at six, regular as clockwork (=always at the same time).","example[5]":"a regular job (=a job that you do during normal working hours)","signpost[1]":"often","definition[1]":"happening or doing something very often","example[6]":"a regular occurrence","example[7]":"Regular exercise helps keep your weight down.","example[8]":"Penn Station was in regular use (=people used it often) until the 1960s.","example[9]":"He’s one of the bar’s regular customers.","note[0]":"regular customer/visitor","signpost[2]":"usual","definition[2]":"normal or usual","example[10]":"He has returned to his regular duties.","example[11]":"Our regular opening hours are 10am to 7pm.","signpost[3]":"equal distance","definition[3]":"with the same amount of space between each thing and the next","example[12]":"The pipes were placed at regular intervals.","example[13]":"a carpet with a regular pattern of flowers","definition[4]":"ordinary, without any special feature or qualities","example[14]":"a regular type of guy","signpost[4]":"normal size","definition[5]":"of a normal or standard size","example[15]":"a regular Coke","definition[6]":"evenly shaped with parts or sides of equal size","example[16]":"a regular hexagon","example[17]":"He’s very handsome, with strong regular features (=an evenly shaped face).","definition[7]":"a regular verb changes its forms in the same way as most verbs, for example its past tense and past participle end in ‘ed’. The verb ‘dance’ is regular, but the verb ‘be’ is not.","signpost[5]":"emphasizing","definition[8]":"used to emphasize what you think someone is like","example[18]":"He’s a regular little dictator!","definition[9]":"someone who often goes to the same bar, restaurant etc or who takes part in an activity very often","example[19]":"The barman knows all the regulars by name.","definition[10]":"a soldier whose permanent job is in the army","definition[11]":"petrol that contains lead","definition[12]":"happening at the same time each day, month, year etc, usually quite often","example[20]":"At least the job guarantees you a regular income.","example[21]":"Payments should be madeat regular intervals, preferably weekly.","example[22]":"Make sure you back up the data on a regular basis.","definition[13]":"of a normal or standard size or amount","example[23]":"We offer three sizes: small, regular and large.","example[24]":"Save 30% off the regular price.","definition[14]":"a customer who always goes to the same shop or uses the same service","example[25]":"A discount is available to our regular customers.","definition[15]":"people who work for a company for the whole of the working day or week, not for just some of the time","example[26]":"union fears that casual workers were replacing regular staff","definition[16]":"a customer who goes to the same shop etc very often","example[27]":"She’s one of our regulars."}