{"word[0]":"percentage","definition[0]":"an amount expressed as if it is part of a total which is 100","example[0]":"Tax is paid as a percentage of total income.","example[1]":"Interest rates fell by six percentage points (=6%).","example[2]":"The numbers are small in percentage terms (=when calculated as a percentage).","example[3]":"A high percentage of married women have part-time jobs.","note[0]":"high/low/small percentage","example[4]":"Crime figures showed significant percentage increases.","note[1]":"percentage change/increase etc","example[5]":"The percentage of school leavers that go to university is about five per cent.","note[2]":"percentage of","explanation[0]":"If the noun that follows a percentage of  is plural, use a plural verb after it","example[6]":"Only a small percentage of people are interested in politics","definition[1]":"a share of the profits","example[7]":"She gets a percentage for every record sold.","collocation[0]":"high/large","example[8]":"A high percentage of our students pass the exam.","collocation[1]":"small/low","example[9]":"Only a small percentage of people suffer from the allergy.","example[10]":"We get a significant percentage of our oil from Nigeria and Angola.","form[0]":"percentage + NOUN","collocation[2]":"a percentage point","example[11]":"The party increased its share of the vote by almost 4 percentage points.","collocation[3]":"a percentage increase/change","example[12]":"Poorer pensioners experienced the greatest percentage increase in their pensions.","collocation[4]":"in percentage terms","example[13]":"The quantity of carbon dioxide was, in percentage terms, extremely small.","collocation[5]":"express something as a percentage","example[14]":"The number is expressed as a percentage of the total population of the country.","definition[2]":"an amount considered as part of a total which is 100","example[15]":"What percentage of sales are generated abroad?","example[16]":"Rental companies bought a high percentage of the vehicles sold.","example[17]":"Spending on research and development as a percentage of profits is low.","definition[3]":"the increase, decrease etc considered as part of a total which is 100","example[18]":"The percentage increase in the construction sector was much higher than in manufacturing."}