{"signpost[0]":"physical harm","definition[0]":"physical harm that is done to something or to a part of someone’s body, so that it is broken or injured","example[0]":"These chemicals have been found to cause serious environmental damage.","example[1]":"There may be permanent brain damage.","example[2]":"His eyesight suffered irreparable damage.","example[3]":"damage to property","note[0]":"damage to","signpost[1]":"emotional harm","definition[1]":"harm caused to someone’s emotions or mind","example[4]":"The death of a parent can cause long-lasting psychological damage.","signpost[2]":"bad effect","definition[2]":"a bad effect on something","example[5]":"the attempts at political damage control during the scandal","note[1]":"damage limitation/control","example[6]":"The damage to his reputation was considerable.","example[7]":"The closure of the factory will cause severe damage to the local economy.","collocation[0]":"do damage","example[8]":"Too much sun can do severe damage to your skin.","collocation[1]":"cause damage","example[9]":"We surveyed the damage caused by the bomb.","collocation[2]":"suffer/sustain damage","example[10]":"She has suffered damage to her hearing.","collocation[3]":"repair the damage","example[11]":"The cost of repairing the damage could be around £300 million.","collocation[4]":"prevent/avoid damage","example[12]":"Young trees need protecting to prevent damage from the wind.","form[0]":"ADJECTIVES/NOUN + damage","collocation[5]":"serious/severe","example[13]":"The earthquake caused severe damage to a number of buildings.","collocation[6]":"extensive/widespread","example[14]":"Because of the size of the bomb, the damage was extensive.","collocation[7]":"permanent/irreparable/irreversible damage","example[15]":"By smoking for so long, she may have suffered irreversible damage to her health.","collocation[8]":"minor damage","example[16]":"Fortunately, the fire caused only minor damage.","collocation[9]":"physical damage","example[17]":"There is considerable evidence that the drug can cause physical damage.","collocation[10]":"structural damage","example[18]":"The building was checked for structural damage.","collocation[11]":"environmental damage","example[19]":"The programme will concentrate on reducing environmental damage and pollution.","collocation[12]":"fire/storm/flood etc damage","example[20]":"The campsite suffered extensive flood damage.","collocation[13]":"brain/liver/nerve etc damage","example[21]":"If you drink a lot of alcohol it can cause liver damage.","collocation[14]":"accidental damage","example[22]":"The insurance covers you for accidental damage to your possessions while you are on holiday.","collocation[15]":"criminal damage","example[23]":"The boy was charged with criminal damage after setting fire to his girlfriend’s house.","definition[3]":"to cause physical harm to something or to part of someone’s body","example[24]":"insects that damage crops","example[25]":"Smoking can severely damage your health.","note[2]":"badly/severely/seriously damage","definition[4]":"to have a bad effect on something or someone in a way that makes them weaker or less successful","example[26]":"The changes in share values have damaged investor confidence.","definition[5]":"to cause physical harm to something or someone, or have a bad effect on them","example[27]":"Several buildings were damaged by the earthquake.","example[28]":"The other car wasn’t damaged.","example[29]":"The scandal could damage his career.","display[0]":"harm","definition[6]":"to have a bad effect on something","example[30]":"They use chemicals that will harm the environment.","example[31]":"The oil crisis could harm the economy.","display[1]":"spoil","definition[7]":"to have a bad effect on something and make it less successful, enjoyable, useful etc","example[32]":"We didn’t let the rain spoil our holiday.","example[33]":"Local people say the new buildings will spoil the view.","display[2]":"vandalize","definition[8]":"to deliberately damage buildings, vehicles, or public property","example[34]":"All the public telephones in the area had been vandalized.","display[3]":"sabotage","definition[9]":"to secretly damage machines or equipment so that they cannot be used, especially in order to harm an enemy","example[35]":"There is evidence that the airplane was sabotaged.","display[4]":"tamper with something","definition[10]":"to deliberately and illegally damage or change a part of something in order to prevent it from working properly","example[36]":"The car’s brakes had been tampered with.","display[5]":"desecrate","definition[11]":"to damage a church or other holy place","example[37]":"The church had been desecrated by vandals.","display[6]":"deface","definition[12]":"to deliberately spoil the appearance of something by writing on it, spraying paint on it etc","example[38]":"Someone had defaced the statue and painted it bright orange.","definition[13]":"a bad effect on something that makes it weaker or less successful","example[39]":"The result of this policy will be severe damage to the British economy.","definition[14]":"physical harm caused to something","example[40]":"a fire which caused hundreds of pounds’ worth of damage to property","definition[15]":"damage caused by a flood, storm etc","example[41]":"The shop suffered severe smoke damage.","definition[16]":"money that a court orders someone to pay to someone else for harming them or their property, or causing them financial loss","example[42]":"The group is facing claims for damages after supplying faulty goods.","example[43]":"They are being sued for damages by clients who had been advised to invest in an insurance company that went bankrupt.","example[44]":"A federal jury awarded damages for breach of contract.","definition[17]":"to cause physical harm to something","example[45]":"Be careful not to damage the timer mechanism.","example[46]":"goods damaged in transit","definition[18]":"to have a bad effect on something in a way that makes it weaker or less successful","example[47]":"Taylor felt her reputation had been damaged by the newspaper article."}