{"signpost[0]":"same opinion","definition[0]":"to have or express the same opinion about something as someone else","opposite[0]":"disagree","example[0]":"Teenagers and their parents rarely agree.","example[1]":"‘We have to talk.’ ‘Absolutely, ’ Meredith replied. ‘I couldn’t agree more.’","note[0]":"I quite agree/I couldn’t agree more","example[2]":"If she felt he was right, she would agree with him.","note[1]":"agree with","example[3]":"Most people nowadays would agree that a good pub is one of our best traditions.","note[2]":"agree that","example[4]":"We don’t agree on everything, of course.","note[3]":"agree on/about","signpost[1]":"say yes","definition[1]":"to say yes to an idea, plan, suggestion etc","opposite[1]":"refuse","example[5]":"I suggested we go somewhere for the weekend and she agreed at once.","example[6]":"No one really knows why he agreed to do the film.","note[4]":"agree to do something","example[7]":"My sister won’t agree to our mother going into a nursing home.","note[5]":"agree to","signpost[2]":"decide together","definition[2]":"to make a decision with someone after a discussion with them","example[8]":"We agreed a new four-year contract.","note[6]":"agree a price/plan/strategy etc","example[9]":"We agreed to meet again the following Monday.","example[10]":"They managed to agree on a date for the wedding.","note[7]":"agree on","example[11]":"We agreed that elections would be held in May.","explanation[0]":"In more formal English, you say it was agreed that when saying what people agreed","example[12]":"It was agreed that the post would be advertised","signpost[3]":"be the same","definition[3]":"if two pieces of information agree with each other, they match or are the same","example[13]":"Your story doesn’t agree with what the police have told us.","display[0]":"agree with somebody/something","explanation[1]":"You agree with someone","example[14]":"I agree with Tanya","bad_example[0]":"I agree Tanya","explanation[2]":"You agree with an opinion or statement","example[15]":"He agrees with this view","bad_example[1]":"He agrees this view","display[1]":"agree on/about something","explanation[3]":"People  agree on or about a subject","example[16]":"My wife and I agree on most things","display[2]":"agree to something","explanation[4]":"You agree to a plan or suggestion","example[17]":"They agreed to all our proposals","bad_example[2]":"They agreed all our proposals","heading[0]":"to say yes","definition[4]":"to say that you think that someone’s plan or suggestion is a good idea and you think it should happen","example[18]":"Charles suggested going for a picnic, and we all agreed.","example[19]":"The Council of Ministers would never agree to such a plan.","example[20]":"Few people expect the rebels to agree to the peace plan.","example[21]":"When I proposed that in future we should hold our meetings in the bar, the others agreed wholeheartedly.","definition[5]":"to agree to do what someone has asked","example[22]":"They asked if I would give a talk, and I stupidly said yes.","display[3]":"approve","definition[6]":"to officially agree to a plan or proposal","example[23]":"Congress approved the plan by a large majority.","display[4]":"give your consent","definition[7]":"to say that you agree to something that will affect you, your family, or your property, when you have the legal right to say ‘no’","example[24]":"Her parents have given their consent to the marriage.","display[5]":"go along with something","definition[8]":"to agree with someone else’s plan or suggestion even though you are not sure if it is the right thing to do","example[25]":"He wasn’t very happy with the idea, but he decided to go along with it.","heading[1]":"to have the same opinion","definition[9]":"to have the same opinion as someone, or to think that a statement is correct","example[26]":"I totally agree with what you’ve just said.","example[27]":"I completely agree with Chomsky when he says that humans are born with a special ability to learn language.","example[28]":"Most experts agree that dieting needs to be accompanied by regular exercise.","display[6]":"be in agreement","definition[10]":"if people are in agreement, they agree with each other, especially after discussing something","example[29]":"The brothers are in agreement over the future of their company.","example[30]":"The world’s scientists are in agreement that global warming is a problem that needs to be addressed.","display[7]":"share somebody’s view/be of the same opinion","definition[11]":"to have the same opinion as someone, especially about an important issue","example[31]":"A lot of people share his view that tourism will have a negative impact on the island.","example[32]":"Professor Dawkins is of the same opinion as Dr Jones.","example[33]":"They share the view that nuclear energy can play an important role in meeting global demands for energy.","example[34]":"All three specialists were of the same opinion about the cause of her illness.","display[8]":"concur","definition[12]":"to agree with someone or about something – a very formal word which is used especially in official contexts","example[35]":"The committee concurred with this view.","example[36]":"She asked her colleague, and she concurred.","example[37]":"Was it his aggression which set him apart from his rivals? ‘Possibly, ’ he concurred.","example[38]":"As most biblical scholars concur, the letter could not have been written by any contemporary of Jesus.","display[9]":"see eye to eye","definition[13]":"to agree with someone about something – used especially in negative sentences","example[39]":"We don’t always see eye to eye, but we do respect each other’s opinions.","display[10]":"agree up to a point","definition[14]":"to partly agree with someone","example[40]":"I agree with you up to a point, but surely the situation is more complex than that?","example[41]":"They have agreed a price for the land.","example[42]":"He has agreed a new two-year contract.","example[43]":"The company agreed in principle to sell the paper mill to local managers.","example[44]":"The companies agreed on the broad terms of a settlement.","example[45]":"The management and the unions rarely seem to agree.","example[46]":"Actually, I agree with Mike on this point.","example[47]":"He agreed that we need more time and resources."}