{"word[0]":"refuse","definition[0]":"to say firmly that you will not do something that someone has asked you to do","example[0]":"She asked him to leave, but he refused.","example[1]":"Mom flatly refused to go back into the hospital.","note[0]":"flatly refuse/refuse point-blank (to do something)","example[2]":"The chairman refused to answer any more questions.","note[1]":"refuse to do something","example[3]":"I absolutely refuse to take part in anything illegal.","definition[1]":"to say no to something that you have been offered","synonym[0]":"turn down","example[4]":"She refused a second piece of cake.","example[5]":"The offer seemed too good to refuse.","example[6]":"When they offered all that money, I could hardly refuse, could I?  (=it was very unlikely that you would refuse)","definition[2]":"to not give or allow someone something that they want, especially when they have asked for it officially","example[7]":"She was refused a work permit.","note[2]":"refuse somebody something","collocation[0]":"stubbornly refuse","example[8]":"He stubbornly refused to pay the fine.","collocation[1]":"adamantly refuse","example[9]":"They are still adamantly refusing to release the data to the general public.","collocation[2]":"steadfastly refuse","example[10]":"She steadfastly refused to marry him.","collocation[3]":"consistently refuse","example[11]":"Politicians have consistently refused to listen to us.","collocation[4]":"flatly refuse","example[12]":"He flatly refused to tell me anything.","collocation[5]":"simply refuse","example[13]":"Some children simply refuse to do what they’re told.","collocation[6]":"refuse point-blank","example[14]":"I refused point-blank to let him in.","collocation[7]":"somebody can hardly refuse","example[15]":"Going out was the last thing I wanted to do, but I could hardly refuse.","example[16]":"I asked the bank for a loan, but they refused.","example[17]":"When they refused to leave, we had to call the police.","display[0]":"say no","definition[3]":"to say that you will not do something when someone asks you","example[18]":"They asked me so nicely that I couldn’t really say no.","display[1]":"turn somebody/something down","definition[4]":"to refuse to accept an offer or invitation, or a formal request","example[19]":"They offered me the job but I turned it down.","example[20]":"The board turned down a request for $25,000 to sponsor an art exhibition.","example[21]":"I’ve already been turned down by three colleges.","display[2]":"reject","definition[5]":"to refuse to accept an idea, offer, suggestion, or plan","example[22]":"They rejected the idea because it would cost too much money.","example[23]":"The Senate rejected a proposal to limit the program to two years.","display[3]":"decline","definition[6]":"to politely refuse to accept an offer or invitation, or refuse to do something","example[24]":"She has declined all offers of help.","example[25]":"A palace spokesman declined to comment on the rumours.","display[4]":"deny","definition[7]":"to refuse to allow someone to do something or enter somewhere","example[26]":"They were denied permission to publish the book.","example[27]":"He was denied access to the US.","display[5]":"veto","definition[8]":"to officially refuse to allow a law or plan, or to refuse to accept someone’s suggestion","example[28]":"Congress vetoed the bill.","example[29]":"The suggestion was quickly vetoed by the other members of the team.","display[6]":"disallow","definition[9]":"to officially refuse to accept something because someone has broken the rules, or not done it in the correct way","example[30]":"The goal was disallowed by the referee.","example[31]":"The court decided to disallow his evidence.","display[7]":"rebuff","definition[10]":"to refuse to accept someone’s offer, request, or suggestion","example[32]":"The company raised its offer to $6 billion, but was rebuffed.","example[33]":"He was politely rebuffed when he suggested holding the show in Dublin.","display[8]":"give somebody/something the thumbs down","definition[11]":"to refuse to allow or accept a plan or suggestion","example[34]":"The plan was given the thumbs down by the local authority.","example[35]":"They gave us the thumbs down.","definition[12]":"waste material that has been thrown away","note[3]":"household/domestic refuse","example[36]":"a refuse dump","example[37]":"refuse collection"}