{"word[0]":"radical","signpost[0]":"change/difference","definition[0]":"a radical change or difference is very big and important","opposite[0]":"slight","example[0]":"They are proposing radical changes to the way the company is run.","example[1]":"a radical reform of the tax system","example[2]":"There are radical differences between the two organizations.","signpost[1]":"opinions","definition[1]":"radical ideas are very new and different, and are against what most people think or believe","example[3]":"He has put forward some very radical ideas.","example[4]":"I was shocked by her radical views.","example[5]":"a radical approach to education","definition[2]":"someone who is radical has ideas that are very new and different, and against what most people think or believe","example[6]":"a radical left-wing politician","example[7]":"a radical feminist","definition[3]":"very good or enjoyable","example[8]":"That was one radical party last night!","collocation[0]":"a radical change","example[9]":"If that offer is serious, it will mark a radical change in policy.","collocation[1]":"a radical transformation","example[10]":"The city has undergone a radical transformation.","collocation[2]":"radical measures","example[11]":"Instead of retreating, he suggested even more radical measures.","collocation[3]":"radical reform","example[12]":"He said the institution was in need of radical reform.","collocation[4]":"a radical overhaul","example[13]":"government plans for a radical overhaul of the health care system","collocation[5]":"a radical difference","example[14]":"There is a radical difference between this and other dieting methods.","collocation[6]":"a radical departure","example[15]":"The design of the building is a radical departure from tradition.","collocation[7]":"a radical rethink","example[16]":"The Conservative Party leader called for a radical rethink of economic policy.","definition[4]":"someone who has new and different ideas, especially someone who wants complete social and political change","example[17]":"radicals on the extreme left wing of the party"}