{"word[0]":"dummy","plural[0]":"dummies","signpost[0]":"for clothes","definition[0]":"a model that is the shape and size of a person, especially used in order to show clothes in a shop or when you are making clothes","example[0]":"a shop-window dummy","example[1]":"a tailor’s dummy","signpost[1]":"copy","definition[1]":"an object that is made to look like a tool, weapon, vehicle etc but which you cannot use","example[2]":"During practice runs, the warheads in the missiles will be dummies.","signpost[2]":"doll","definition[2]":"a small model of a person, with a mouth that can be moved so that it looks as though it is talking, used for entertainment","example[3]":"a ventriloquist’s dummy","definition[3]":"a move in a sport such as football in which a player pretends to pass the ball but does not, in order to deceive the other team’s players","signpost[3]":"for babies","definition[4]":"a specially shaped rubber object that you put in a baby’s mouth for it to suck","signpost[4]":"stupid person","definition[5]":"someone who is stupid","example[4]":"No, you dummy. The other hand.","signpost[5]":"card game","definition[6]":"cards that are placed on the table by one player for all the other players to see in a game of bridge","definition[7]":"a dummy tool, weapon, vehicle etc is made to look like a real one but you cannot use it","synonym[0]":"replica","example[5]":"a dummy rifle","definition[8]":"a product that is made to look like a real product and is used for testing, obtaining people’s opinions etc","definition[9]":"a test advertisement or design","definition[10]":"a model of a human used for showing clothes in a shop window or for testing car safety","definition[11]":"a dummy product is made to look like a real one and is used for tests, getting people’s opinions etc","example[6]":"72% of the men in the group taking a dummy pill continued to lose hair.","definition[12]":"a dummy organization is used to hide the real owner of assets, or to hide criminal activities","example[7]":"They had set up a series of dummy corporations to buy and sell 8,000 acres of useless New Mexico desert.","definition[13]":"a dummy activity is used to make people think that something is happening when it is not","example[8]":"They used dummy trades to create a false impression of a more active market than really existed."}