{"comparative[0]":"busier","superlative[0]":"busiest","definition[0]":"if you are busy, you are working hard and have a lot of things to do","example[0]":"She’s busy now – can you phone later?","example[1]":"a busy mother of four","example[2]":"There were lots of activities to keep the kids busy.","example[3]":"Mr Haynes is busy with a customer at the moment.","note[0]":"busy with","example[4]":"Rachel’s busy studying for her exams.","note[1]":"busy doing something","explanation[0]":"You are busy with something","example[5]":"I’m very busy with work at the moment","bad_example[0]":"busy for something","bad_example[1]":"busy on something","definition[1]":"a busy period of time is full of work or other activities","example[6]":"December is the busiest time of year for shops.","example[7]":"a busy day","example[8]":"He took time out of his busy schedule to visit us.","definition[2]":"a busy place is very full of people or vehicles and movement","example[9]":"We live on a very busy road.","definition[3]":"if a telephone you are calling is busy, it makes a repeated sound to tell you that the person you are calling is talking on their telephone","example[10]":"I called Sonya, but her line was busy.","example[11]":"I keep getting a busy signal.","signpost[0]":"pattern","definition[4]":"a pattern or design that is busy is too full of small details – used to show disapproval","definition[5]":"if you are busy, you have a lot of things you need to do","example[12]":"Sorry I haven’t called you, but I’ve been really busy.","example[13]":"a busy housewife","example[14]":"Angela was becoming more and more unhappy, but her husband was too busy to notice.","example[15]":"Not now Stephen, I’m busy.","example[16]":"Alex is busy studying for his exams.","display[0]":"rushed/run off your feet","definition[6]":"very busy and in a hurry, because you have too many things to do","example[17]":"We’ve been absolutely rushed off our feet getting ready for our son’s birthday party.","display[1]":"snowed under","definition[7]":"so busy that you can hardly deal with all the work you have to do","example[18]":"I can’t stop for lunch today – I’m completely snowed under.","example[19]":"We’ve been snowed under with applications for the job.","display[2]":"up to your ears/neck in something","definition[8]":"extremely busy because you have a lot of work to deal with","example[20]":"Teachers say they are up to their ears in paperwork and don’t have enough time for teaching.","display[3]":"tied up","definition[9]":"busy in your job, so that you cannot do anything else","example[21]":"I’m sorry, but he’s tied up at the moment. Could you call back later?","example[22]":"I can’t see you tomorrow: I’m tied up all day.","display[4]":"have a lot to do","definition[10]":"to have to do a lot of things, so that you need to hurry or work hard","example[23]":"Let’s get started – we have a lot to do.","display[5]":"have a lot on","definition[11]":"to be busy, especially because you have arranged to do a lot of things during a particular period","example[24]":"I’ve got a lot on this weekend.","example[25]":"He says he’ll try and see you as soon as possible, but he has a lot going on this afternoon.","definition[12]":"use this about times when you have a lot of things you need to do","example[26]":"We have a busy day ahead of us tomorrow.","example[27]":"July and August are our busiest times.","display[6]":"hectic","definition[13]":"a hectic time or situation is extremely busy, so that you are always in a hurry and often feel excited or worried","example[28]":"It was really hectic at work today.","example[29]":"The band had a hectic recording schedule.","display[7]":"the rush hour","definition[14]":"the time in the morning and evening when a lot of people are travelling to or from work","example[30]":"The buses are so crowded during the rush hour you never get a seat.","example[31]":"In most British cities the rush hour does not start until about 8 o’clock.","definition[15]":"a telephone that is busy is being used","definition[16]":"someone who is busy is working and is not available","example[32]":"Mr Bullon is busy right now - can you phone back after lunch?","example[33]":"I’ve been busy with customers all morning","definition[17]":"a busy period is full of work","example[34]":"Christmas is one of Oxford Street’s busiest times of the year."}