{"word[0]":"premium","definition[0]":"the cost of insurance, especially the amount that you pay each year","example[0]":"insurance premiums","definition[1]":"an additional amount of money, above a standard rate or amount","example[1]":"Consumers are prepared to pay a premium for organically grown vegetables.","example[2]":"Top quality cigars are being sold at a premium.","definition[2]":"good quality petrol","definition[3]":"of very high quality","example[3]":"premium ice cream","example[4]":"the current consumer trend for premium products","example[5]":"premium quality British potatoes","definition[4]":"a payment that you make for insurance","example[6]":"Some insurance companies offer small sum policies, with monthly or annual premiums.","example[7]":"single premium life insurance policies","example[8]":"Car insurance premiums shot up by almost a quarter.","definition[5]":"an additional amount of money, above a standard amount or rate","example[9]":"The company’s earnings will grow by about 25% a year and investors will be willing to pay a premium (=pay more than usual) for that growth.","example[10]":"As long as there is a threat of war in the Middle Eastern oil fields, oil prices will command a premium (=buyers will have to pay more than usual).","definition[6]":"if something is at a premium, there is little of it available or it is difficult to obtain","example[11]":"With parking space at a premium in Japanese cities, the microcar is a popular form of transport.","definition[7]":"if one thing is sold at a premium to another, it costs more","example[12]":"Platinum usually trades at a premium to gold.","definition[8]":"if you put a premium on something, you consider it to be especially valuable","example[13]":"Employers today put a premium on reasoning skills and willingness to learn.","definition[9]":"premium products, goods etc are of higher quality than usual","example[14]":"Premium brands of beer will grow faster, in line with the trend toward people demanding better quality."}