{"word[0]":"marsh","definition[0]":"an area of low flat ground that is always wet and soft","definition[1]":"an area of low flat ground that is always wet and soft, that often has grasses or reeds growing in it but no trees","example[0]":"The low hills you can see are like islands surrounded by the marsh.","example[1]":"Miles of salt marsh   (=which has salt water under it because it is near the sea) stretched before us, reaching to the shores of the River Severn.","example[2]":"Hackney Marshes","example[3]":"the rustling of the marsh grass","display[0]":"swamp","definition[2]":"land that is always very wet or covered with a layer of water, that often has trees growing in it – used especially about areas in hot countries","example[4]":"the swamps of Florida","example[5]":"Less than 200 years ago, the city was a swamp, infested by mosquitoes.","display[1]":"bog","definition[3]":"an area of low wet muddy ground, sometimes with bushes or grasses growing in it","example[6]":"His foot started slowly sinking into the bog.","example[7]":"The destruction of peat bogs is contributing to global warming, according to a report commissioned by Friends of the Earth.","display[2]":"wetland","definition[4]":"an area of land that is partly covered with water, and that has grasses and other plants growing in it – often used about areas that are important to birds or wildlife","example[8]":"The ecosystem of the world 's largest wetland, the Pantanal in southwest Brazil, is being threatened by tourists.","example[9]":"wetland birds","display[3]":"fen","definition[5]":"a large area of low flat wet land – used especially about the area of this type of land in eastern England in Cambridgeshire and Lincolnshire, which is known as the Fens","example[10]":"He grew up in the Fens","example[11]":"Intensive cultivation and continued drainage of the Fens further accelerates the degradation of the land.","display[4]":"mire","definition[6]":"an area of wet muddy ground, which people and vehicles etc get stuck in","example[12]":"The wagon was stuck fast in the mire.","example[13]":"The rain was turning the highway into a mire."}