{"word[0]":"breakdown","definition[0]":"the failure of a relationship or system","example[0]":"Family breakdown can lead to behavioural problems in children.","note[0]":"marriage/marital/family breakdown","example[1]":"He moved away after the breakdown of his marriage.","note[1]":"breakdown of","example[2]":"A sudden rise in oil prices could lead to a breakdown of the economy.","example[3]":"There has been a serious breakdown in relations between the two countries.","note[2]":"breakdown in","definition[1]":"a serious medical condition in which someone becomes mentally ill and is unable to work or deal with ordinary situations in life","example[4]":"I was worried he might have a breakdown if he carried on working so hard.","example[5]":"Two years ago he suffered a mental breakdown.","example[6]":"She had already had one nervous breakdown.","definition[2]":"an occasion when a car or a piece of machinery breaks and stops working","example[7]":"Always carry a phone with you in case you have a breakdown on the motorway.","example[8]":"a breakdown in the cooling system","definition[3]":"a list of all the separate parts of something","example[9]":"Can you give us a breakdown of the figures?","definition[4]":"the changing of a substance into other substances","example[10]":"the breakdown of glucose in the body to release energy","form[0]":"ADJECTIVES/NOUN + breakdown","collocation[0]":"marriage/marital breakdown","example[11]":"problems caused by the  increase in marital breakdown","collocation[1]":"family breakdown","example[12]":"A growing proportion of children are affected by family breakdown.","collocation[2]":"communication breakdown","example[13]":"The misunderstanding was the result of a communication breakdown.","collocation[3]":"complete/total breakdown","example[14]":"The disagreement finally led to a complete breakdown of their relationship.","collocation[4]":"irretrievable breakdown","example[15]":"The irretrievable breakdown of a marriage may be grounds for divorce.","collocation[5]":"cause/lead to a breakdown","example[16]":"Money problems often cause marriage breakdown.","definition[5]":"a statement showing information or a total amount separated into parts so that it is easier to understand","example[17]":"A spending breakdown showed the average household spent £47.70 on food per week.","example[18]":"Also in the report is a breakdown of when delays are most likely to occur.","definition[6]":"when something fails or stops working properly, especially because people cannot agree","example[19]":"At its worst, this legislation represents a total breakdown of the US budget process.","note[3]":"breakdown of/in","example[20]":"The company issued an apology, and said there had been abreakdown in communications."}