{"signpost[0]":"interesting/exciting","definition[0]":"something that happens, especially something important, interesting or unusual","example[0]":"one of the most important events in the history of mankind","signpost[1]":"social gathering","definition[1]":"a performance, sports competition, party etc at which people gather together to watch or take part in something","example[1]":"The conference was an important social event (=an event at which people can meet each other).","example[2]":"one of the major sporting events of the year","example[3]":"The school raises money by organizing fundraising events.","note[0]":"charity/fundraising etc event","signpost[2]":"race/competition","definition[2]":"one of the races or competitions that are part of a large sports competition","example[4]":"The next event will be the 100 metres.","example[5]":"The 800 metres is not his best event.","heading[0]":"– Meaning 1: something that happens, especially something important, interesting or unusual","collocation[0]":"a big/major event","example[6]":"Getting married is a major event in anyone’s life.","collocation[1]":"an important/significant event","example[7]":"It’s natural to be nervous before such an important event.","collocation[2]":"a momentous event","example[8]":"the momentous events of 9/11","collocation[3]":"a historic event","example[9]":"The signing of the peace treaty was a historic event.","collocation[4]":"a dramatic event","example[10]":"The dramatic events will be brought to you live on BBC.","collocation[5]":"a tragic event","example[11]":"Let’s not talk about the tragic events of the past.","collocation[6]":"a traumatic event","example[12]":"He was forced to relive the traumatic events of his kidnap.","collocation[7]":"a common/an everyday event","example[13]":"The death of a child was a common event in those days.","collocation[8]":"a rare/unusual event","example[14]":"A sighting of a white deer is a rare event.","collocation[9]":"recent events","example[15]":"Recent events in the country have caused great concern.","collocation[10]":"the latest events","example[16]":"We will be bringing you news of all the latest events.","collocation[11]":"current events","example[17]":"There are some similarities between what happened in the 1920s and current events in the US.","collocation[12]":"an event happens/takes place","example[18]":"The event took place last year.","collocation[13]":"events unfold","example[19]":"I watched the dramatic events unfold from my window.","collocation[14]":"events lead (up) to something","example[20]":"His assassination was one of the events that led to the First World War.","collocation[15]":"the events surrounding something","example[21]":"The events surrounding her death remain a mystery.","collocation[16]":"celebrate/commemorate/mark an event","example[22]":"Fans observed a minute’s silence to commemorate the tragic event.","collocation[17]":"witness an event","example[23]":"Luckily, a film crew were on the spot to witness the event.","collocation[18]":"record an event","example[24]":"Two photographers recorded the events.","collocation[19]":"a series/sequence of events","example[25]":"The incident was the first in a series of events that finally led to his arrest.","collocation[20]":"a chain of events","example[26]":"He set in motion a chain of events that he couldn’t control.","collocation[21]":"the course of events","example[27]":"Nothing you could have done would have changed the course of events.","heading[1]":"– Meaning 2: a performance, sports competition, party etc at which people gather together to watch or take part in something","form[0]":"ADJECTIVES/NOUN + event","collocation[22]":"a social event","example[28]":"I don’t go to many social events since my husband’s death.","collocation[23]":"a sporting event","example[29]":"Many of the weekend’s major sporting events were cancelled due to bad weather.","collocation[24]":"a cultural/musical event","example[30]":"a monthly guide to the cultural events in London","collocation[25]":"a charity/fund-raising event","example[31]":"Forthcoming fund-raising events include a sponsored five-mile walk.","collocation[26]":"hold/stage an event","example[32]":"The charity plans to stage several fund-raising events this year.","collocation[27]":"go to an event","example[33]":"Unfortunately, the prime minister will not be able to attend the event.","collocation[28]":"support an event","example[34]":"I’d like to thank everyone who came tonight for supporting the event.","collocation[29]":"boycott an event","example[35]":"The games went ahead despite threats to boycott the event.","collocation[30]":"sponsor an event","example[36]":"The event is sponsored by the Royal Bank of Scotland.","definition[3]":"something that happens, especially something important, interesting, or unusual","example[37]":"He spoke of the tragic event in which more than 100 people died.","example[38]":"recent political events","display[0]":"occurrence","definition[4]":"something that happens – used especially when saying how often something happens","example[39]":"Divorce is a common occurrence these days.","example[40]":"Storms like this one are fortunately a rare occurrence.","example[41]":"Accidents are almost a daily occurrence on this road.","display[1]":"incident","definition[5]":"something that happens, especially something that is unusual or unpleasant, or something that is one of several events","example[42]":"He died after a violent incident outside a nightclub.","example[43]":"This latest incident could put an end to his career.","display[2]":"occasion","definition[6]":"an important social event or celebration","example[44]":"She only wore the dress for special occasions.","example[45]":"It was his 100th birthday, and friends and family gathered to mark the occasion.","display[3]":"affair","definition[7]":"something that happens, especially something shocking in political or public life which involves several people and events","example[46]":"The affair has caused people to lose confidence in their government.","display[4]":"phenomenon","definition[8]":"something that happens or exists in society, science, or nature, especially something that is studied because it is difficult to understand","example[47]":"natural phenomena such as earthquakes","example[48]":"Homelessness is not a new phenomenon."}