{"word[0]":"target","signpost[0]":"aim","definition[0]":"something that you are trying to achieve, such as a total, an amount, or a time","synonym[0]":"goal","example[0]":"There is no target date for completion of the new project.","example[1]":"The government may fail to meet (=achieve) its  target of recycling 25% of domestic waste.","example[2]":"Jiang set annual growth targets of 8–9%.","example[3]":"demanding financial targets","note[0]":"sales/attainment/growth etc targets","example[4]":"the target of a one-third reduction in road accidents","note[1]":"target of","example[5]":"Higher degrees in English are a target for foreign students.","note[2]":"target for","example[6]":"The company says that growth of 10% is on target.","note[3]":"on target","signpost[1]":"object of attack","definition[1]":"an object, person, or place that is deliberately chosen to be attacked","example[7]":"Cars without security devices are an easy target for the thief.","note[4]":"easy/soft target","example[8]":"Railway stations are prime targets (=very likely targets) for bombs.","note[5]":"target for/of","signpost[2]":"object of an action","definition[2]":"the person or place that is most directly affected by an action, especially a bad one","example[9]":"The area has become a prime target for supermarket development.","example[10]":"The country is a target of criticism for its human rights record.","signpost[3]":"shooting","definition[3]":"something that you practise shooting at, especially a round board with circles on it","example[11]":"The area is used by the army for target practice.","heading[0]":"– Meaning 1: something that you are trying to achieve, such as a total, an amount, or a time","collocation[0]":"meet a target","example[12]":"The government wants to meet its target of building three million new homes by 2020.","collocation[1]":"reach/achieve/hit a target","example[13]":"They achieved their target with just days to spare.","collocation[2]":"set a target","example[14]":"The company has set ambitious business targets.","collocation[3]":"exceed a target","example[15]":"We have exceeded our target of £200,000.","collocation[4]":"fall short of a target","example[16]":"Car production at the plant has fallen short of its target by 5%.","form[0]":"ADJECTIVES/NOUN + target","collocation[5]":"ambitious/high","example[17]":"The targets they have set themselves are hugely ambitious.","example[18]":"The Kyoto Protocol set fairly modest targets for reductions in greenhouse gases.","collocation[6]":"achievable/realistic","example[19]":"The target is achievable, but only by hard work.","collocation[7]":"a financial target","example[20]":"Both businesses exceeded their financial targets.","collocation[8]":"a sales target","example[21]":"I’m confident we will meet our sales target by the end of the year.","collocation[9]":"a growth target","example[22]":"The company’s growth targets have been achieved for the last three years.","form[1]":"target + NOUN","collocation[10]":"a target date","example[23]":"There is no target date set for completion of the new project.","collocation[11]":"a target figure","example[24]":"The government has set a target figure of 6.2%","heading[1]":"– Meaning 2: an object, person, or place that is deliberately chosen to be attacked","collocation[12]":"a prime target","example[25]":"Sporting events could become a prime target for terrorists.","collocation[13]":"the main target","example[26]":"The rebel-held town is one of the main targets for U S troops.","collocation[14]":"an easy/soft target","example[27]":"Some criminals now regard churches as easy targets.","collocation[15]":"a sitting target","example[28]":"In the open, the soldiers are sitting targets.","collocation[16]":"somebody’s intended target","example[29]":"The gunman missed his intended target.","collocation[17]":"a military target","example[30]":"The group insists that its bombs were directed against military targets.","collocation[18]":"a civilian target","example[31]":"The army denied it had attacked civilian targets.","collocation[19]":"a legitimate target","example[32]":"The rebels claimed that trains carrying soldiers are a legitimate target.","collocation[20]":"attack a target","example[33]":"They have attacked military targets such as army camps and airfields.","collocation[21]":"hit a target","example[34]":"Not every bomb hit its target.","collocation[22]":"miss a target","example[35]":"All of the missiles missed their target and no-one was killed.","definition[4]":"to make something have an effect on a particular limited group or area","example[36]":"The advertisement was designed to target a mass audience.","example[37]":"a new benefit targeted on low-income families","note[6]":"target something on/at somebody/something","example[38]":"The programme is targeted at improving the health of women of all ages.","definition[5]":"to aim something at a target","example[39]":"The missiles are targeted at several key military sites.","definition[6]":"to choose a particular person or place to do something to, especially to attack them or criticize them","example[40]":"It’s clear that smaller, more vulnerable banks have been targeted.","example[41]":"He was targeted by terrorists for a second time last night.","definition[7]":"an organization, industry, government etc that is deliberately chosen to have something done to it","example[42]":"There was persistent speculation that the company could be the target of a takeover bid.","example[43]":"Computers are helping choose targets for direct-mail and telephone campaigns.","example[44]":"Europe will be the main target for rising South African coal exports.","definition[8]":"a result such as a total, an amount, or a time which you aim to achieve","example[45]":"Dealers are under pressure to meet sales targets.","example[46]":"Bonuses were introduced for employees who met production targets.","example[47]":"The federal funds rate slipped to 7% from its target level of 8%.","definition[9]":"on the way to achieving a result","example[48]":"The export business is booming and the U.S. business is right on target.","definition[10]":"a limited group of people or area that a plan, idea etc is aimed at","example[49]":"Who is the target audience for this book?","example[50]":"These advertisements are aimed mainly at our target customers.","definition[11]":"to aim products, programmes of work, etc at a particular area or group of people","example[51]":"We will target funds on areas of research where breakthroughs are imminent.","note[7]":"target something on something","example[52]":"The booklet is targeted at people approaching retirement.","note[8]":"target something at something","definition[12]":"to choose someone or something for a particular type of treatment","example[53]":"The main markets targeted for development have been those of the US and Western Europe."}