{"word[0]":"bind","past_tense[0]":"bound","signpost[0]":"tie/fasten","definition[0]":"to tie someone so that they cannot move or escape","note[0]":"bound and gagged (=tied up, and with cloth tied around your mouth so you cannot speak)","example[0]":"They bound my arms and legs with rope.","definition[1]":"to tie things firmly together with cloth or string","example[1]":"The pile of newspapers was bound with string.","signpost[1]":"form a connection","definition[2]":"to form a strong emotional or economic connection between two people, countries etc","synonym[0]":"unite","example[2]":"Their shared experiences in war helped to bind the two communities together.","note[1]":"bind somebody/something together","signpost[2]":"make somebody do something","definition[3]":"if you are bound by an agreement, promise etc, you must do what you have agreed to do or promised to do","example[3]":"The monks are bound by vows of silence.","note[2]":"be bound by something","example[4]":"Employees are not bound to give their reasons for leaving.","note[3]":"be bound to do something","explanation[0]":"Bind is usually passive in this meaning","signpost[3]":"stick together","definition[4]":"to stick together in a mass, or to make small pieces of something stick together","example[5]":"The flour mixture isn’t wet enough to bind properly.","example[6]":"The hydrogen molecule binds with the oxygen molecule.","note[4]":"bind with","signpost[4]":"book","definition[5]":"to fasten the pages of a book together and put them in a cover","signpost[5]":"stitch","definition[6]":"to sew cloth over the edge of a piece of material, or stitch over it, to strengthen it","example[7]":"The edges of the blanket were bound with ribbon.","definition[7]":"an annoying or difficult situation","example[8]":"It’s a real bind having to look after the children.","example[9]":"Caroline was really in a bind.","note[5]":"in a bind","definition[8]":"if a legal agreement binds someone, it makes them promise to do something","example[10]":"If a person signs a document which contains contract terms, he or she is bound by those terms.","example[11]":"the agreement with industry that binds companies to reduce the weight of packaging","note[6]":"bind somebody to do something"}