{"word[0]":"lend","past_tense[0]":"lent","definition[0]":"to let someone borrow money or something that belongs to you for a short time","example[0]":"I lent my CD player to Dave and I haven’t got it back yet.","note[0]":"lend something to somebody","example[1]":"The hospital agreed to lend us a wheelchair.","note[1]":"lend somebody something","example[2]":"Can you lend me £10 until tomorrow?","definition[1]":"if a bank or financial institution lends money, it lets someone have it on condition that they pay it back later, often gradually, with an additional amount as interest","example[3]":"The government is trying to encourage the banks to lend more.","example[4]":"A lot of banks are unwilling to lend money to new businesses.","example[5]":"The building society agreed to lend us £60,000.","definition[2]":"to give a situation, event etc a particular quality","example[6]":"The presence of members of the royal family lent a certain dignity to the ceremony.","note[2]":"lend something to something","example[7]":"Can you lend me $20?","example[8]":"Did you lend that book to Mike?","example[9]":"The documents were loaned by the local library.","display[0]":"let somebody use something/let somebody have something","definition[3]":"to let someone use something that belongs to you for a short time, especially a room, a house, or something big and expensive","example[10]":"Some friends are letting us use their house while they are on vacation.","example[11]":"Dad said he’d let me have his car for the weekend.","display[1]":"be on loan","definition[4]":"if something is on loan, it has been lent to a person or organization in an official way – often used about a library book or a work of art","example[12]":"The museum has an exhibition of paintings on loan from the Louvre.","example[13]":"According to the computer, this book is still out on loan.","definition[5]":"if a bank or financial institution lends money, it lets a person or organization borrow it on condition that they pay it back, with an additional amount as interest, usually gradually over an agreed period of time","example[14]":"Once again, the government is encouraging banks to lend.","example[15]":"Last year, financial institutions lent over $30 billion to new businesses.","definition[6]":"to let someone borrow money from you or use something that you own, which they will give back to you later","example[16]":"Can you lend me $20 till Friday?","example[17]":"Neighbouring countries offered to lend rescue equipment to the city authorities after the earthquake.","definition[7]":"to support or help someone or something","example[18]":"The bond market rally yesterday also lent some strength to the stock market.","example[19]":"The dollar’s weakness has lent support to precious metals prices."}