{"word[0]":"action","signpost[0]":"doing something","definition[0]":"the process of doing something, especially in order to achieve a particular thing","example[0]":"The government must take action (=do something) now to stop the rise in violent crime.","example[1]":"She was looking forward to putting her ideas into action (=doing the things she had planned).","example[2]":"Ambulance crews are ready to spring into action (=suddenly start doing something) if anything goes wrong during the race.","example[3]":"Environmental groups want tougher action on pollution from cars.","note[0]":"action on","signpost[1]":"something done","definition[1]":"something that someone does","example[4]":"The child could not be held responsible for his actions (=he was too young to be blamed for them).","example[5]":"Her prompt actions probably saved my life.","note[1]":"quick/swift/prompt action","example[6]":"The chief of police tried to justify his actions.","note[2]":"defend/justify your action(s)","signpost[2]":"fighting","definition[2]":"fighting during a war","example[7]":"There have been reports of widespread enemy action in the area.","example[8]":"530 servicemen were reported missing in action (=they were never seen again after a battle).","example[9]":"The men were sent into action with little or no training.","example[10]":"He had seen action (=been involved in fighting) in Korea.","example[11]":"His father was killed in action in Vietnam.","note[3]":"killed/wounded in action","signpost[3]":"legal","definition[3]":"a legal or formal process to decide whether someone has done something wrong","example[12]":"They are threatening to take legal action against the hospital  (=start a court case against them).","example[13]":"The director faces disciplinary action (=official action to punish him).","example[14]":"The matter is now the subject of a court action (=a court case).","example[15]":"The students agreed to drop their action (=decided not to continue with a court case or an official complaint).","example[16]":"The sisters brought a libel action against the newspaper  (=started a court case).","signpost[4]":"excitement","definition[4]":"exciting things that are happening","example[17]":"There hasn’t been much action around here for months.","example[18]":"New York is where all the action is.","definition[5]":"an action film has a lot of exciting scenes in it, in which people fight, chase, and kill each other","example[19]":"Gibson became famous in action movies.","example[20]":"a TV action hero","definition[6]":"the way something moves or works","example[21]":"a smooth braking action","example[22]":"the action of the heart","note[4]":"action of","signpost[5]":"effect","definition[7]":"the effect that a substance, especially a chemical, has on something","example[23]":"The drug blocks the action of the cancer gene.","example[24]":"the action of alcohol on the liver","note[5]":"action on/upon","heading[0]":"– Meaning 1: the process of doing something, especially in order to achieve a particular thing","collocation[0]":"take action","example[25]":"The government must take action to control inflation.","collocation[1]":"demand/call for action","example[26]":"Voters are demanding tougher action on gun crime.","collocation[2]":"swing/spring/leap into action","example[27]":"The fire crew immediately swung into action.","collocation[3]":"put something into action","example[28]":"She was looking forward to putting her plans into action.","example[29]":"The committee uses the expertise of local organisations to put these ideas into action.","collocation[4]":"immediate/prompt/swift action","example[30]":"The public wants immediate action to stop the terrorists.","collocation[5]":"urgent action","example[31]":"The Opposition called for urgent action to reduce unemployment.","collocation[6]":"firm/tough action","example[32]":"We need firm action to deal with the problem.","collocation[7]":"decisive action","example[33]":"We are urging the international community to take decisive action on debt relief.","collocation[8]":"drastic action","example[34]":"The president decided to take drastic action.","collocation[9]":"further action","example[35]":"No further action is necessary.","collocation[10]":"direct action","example[36]":"In a bid to stop whale hunting, Greenpeace have threatened direct action.","collocation[11]":"political action","example[37]":"Some forms of political action are more effective than others.","collocation[12]":"industrial/strike action","example[38]":"The miners voted in favour of industrial action.","collocation[13]":"joint action","example[39]":"Community leaders agreed to take joint action on scientific, social and environmental issues.","collocation[14]":"a course of action","example[40]":"Have you decided on a course of action?","collocation[15]":"a plan of action","example[41]":"The General outlined his plan of action for the campaign.","example[42]":"Environmental groups have put forward an action plan.","heading[1]":"– Meaning 5: fighting during a war","collocation[16]":"be killed/wounded in action","example[43]":"Four of her sons have been killed in action.","collocation[17]":"be missing in action","example[44]":"A further 9,000 allied military personnel are still officially listed as missing in action.","collocation[18]":"see action","example[45]":"By the time he was 20 he’d seen action in the Gulf War and Bosnia.","collocation[19]":"go into action","example[46]":"American soldiers are going into action against the Mujahadin.","collocation[20]":"be sent into action","example[47]":"He declared that French soldiers will not be sent into action in Iraq.","collocation[21]":"military action","example[48]":"America is not ruling out military action against Iran.","collocation[22]":"enemy action","example[49]":"The ship was damaged by enemy action.","heading[2]":"– Meaning 6: a legal or formal process to decide whether someone has done something wrong","collocation[23]":"legal action","example[50]":"The singer threatened legal action against the magazine.","collocation[24]":"court action","example[51]":"The couple are still considering whether to take court action.","collocation[25]":"a libel action","example[52]":"Judge Johan Kreigler dismissed a libel action brought against two newspapers.","collocation[26]":"a civil action","example[53]":"The victim can seek damages in a civil action.","collocation[27]":"take legal action","example[54]":"He is within his rights to take legal action.","collocation[28]":"face legal action","example[55]":"The council demanded that we remove the posters, or face legal action.","collocation[29]":"bring a legal action","example[56]":"Justice Mayor ruled that she cannot bring a legal action for damages against the plaintiff.","example[57]":"He is responsible for his own actions.","example[58]":"They refused to give a reason for their actions.","display[0]":"act","definition[8]":"a particular type of action","example[59]":"violent acts","example[60]":"I believe the killing was an act of desperation.","display[1]":"activities","definition[9]":"things that people do, especially for enjoyment or to achieve an aim","example[61]":"leisure activities","example[62]":"political activities","example[63]":"Surveys may not give a true picture of people’s activities.","definition[10]":"the things that someone does and the way they behave","example[64]":"Do you think that advertisements really influence people’s behaviour?","example[65]":"The man’s behaviour seemed rather odd.","definition[11]":"something that you do in order to achieve something","example[66]":"Her decision to sell the shares had been a smart move.","example[67]":"It’s a bold move to start a business in the current economic climate.","example[68]":"He needed time to figure out his next move.","definition[12]":"one of a series of things that you do in order to deal with a problem or to succeed","example[69]":"The first step is to make sure we have got funding for the project.","example[70]":"We must take steps to make sure that this does not happen again.","example[71]":"This is an important step towards peace.","display[2]":"measure","definition[13]":"an official action that is intended to deal with a particular problem","example[72]":"There are increased security measures at airports.","example[73]":"The school was closed as a precautionary measure following a chemical leak.","display[3]":"gesture","definition[14]":"something that you do to show how you feel about someone or something","example[74]":"Do you think it would be a nice gesture to send her some flowers?","example[75]":"The company gave us £100 as a gesture of goodwill.","display[4]":"deed","definition[15]":"an action, especially one that is very good or very bad","example[76]":"evil deeds","example[77]":"heroic deeds","example[78]":"This is my good deed for the day.","display[5]":"exploits","definition[16]":"exciting or brave actions","example[79]":"daring exploits","example[80]":"His exploits were legendary.","display[6]":"feat","definition[17]":"something someone does that people admire because you need a lot of skill, courage, or strength to do it","example[81]":"Completing a marathon is a remarkable feat for a six-year-old.","example[82]":"The bridge is a great feat of engineering.","definition[18]":"used by film directors to give the instruction to begin filming","example[83]":"Lights, camera, action!","definition[19]":"to do a specific thing that needs to be done, especially after discussing it","example[84]":"How are we actually going to action these objectives?","definition[20]":"when someone does something in order to deal with a problem or difficult situation","example[85]":"The government’s action was prompted by shortages of foreign exchange.","example[86]":"We must take action to make our shares accessible to a broader segment of the investing public.","definition[21]":"when important things happen, for example when there is a lot of buying or selling or prices rise or fall","example[87]":"The tax cut was intended to restore some market action in the banking and real-estate sectors.","definition[22]":"the process of taking a case or a claim against someone to a court of law","example[88]":"They began an action to repossess the house.","example[89]":"When the loan was not repaid, he threatened legal action.","example[90]":"They will bring an action against him if he does not repay the loan."}