{"word[0]":"driver","definition[0]":"someone who drives a car, bus etc","example[0]":"a taxi driver","example[1]":"Do you think you’re a good driver?","definition[1]":"a piece of software that makes a computer work with another piece of equipment such as a printer or a mouse","definition[2]":"a golf club with a wooden head","form[0]":"ADJECTIVES/NOUN + driver","collocation[0]":"a taxi/bus/truck etc driver","example[2]":"Car drivers face a new daily charge to enter the capital.","collocation[1]":"a racing driver","example[3]":"world famous racing drivers like Lewis Hamilton","collocation[2]":"a good driver","example[4]":"He thinks he’s a very good driver.","collocation[3]":"a careful/safe driver","example[5]":"Since I had the accident, I’m a much more careful driver.","collocation[4]":"a bad driver","example[6]":"There are a lot of bad drivers on the roads.","collocation[5]":"a dangerous driver","example[7]":"Some  young men tend to be dangerous drivers.","collocation[6]":"a reckless driver","example[8]":"Reckless drivers should be given more severe punishments.","collocation[7]":"a drunken/drunk driver","example[9]":"Her husband was killed by a drunken driver.","collocation[8]":"a hit-and-run driver","example[10]":"The boy was in hospital after being knocked down by a hit-and-run driver.","collocation[9]":"a learner driver","example[11]":"Learner drivers spend a lot of money on driving lessons.","collocation[10]":"an experienced driver","example[12]":"Young drivers are ten times more likely to be killed on the road than experienced drivers.","collocation[11]":"an inexperienced driver","example[13]":"Many accidents are caused by young or inexperienced drivers.","collocation[12]":"a delivery driver","example[14]":"He’s a delivery driver for a pizza takeaway restaurant.","definition[3]":"someone who regularly drives, or someone who is driving a car, train, etc at a particular time","example[15]":"Car drivers now pay more than ever for fuel.","example[16]":"The coach was badly damaged, but the driver was unhurt.","display[0]":"motorist","definition[4]":"someone who drives a car – used especially when talking about car drivers in general","example[17]":"increased taxes on the motorist","example[18]":"Motorists who are caught speeding have to pay a heavy fine.","display[1]":"chauffeur","definition[5]":"someone whose job is to drive a car for someone else","example[19]":"He was picked up by a chauffeur in a limousine.","display[2]":"trucker","definition[6]":"someone who drives a truck","example[20]":"Mexico has no limit on how many hours truckers can drive daily.","display[3]":"road hog","definition[7]":"someone who drives dangerously, without considering the safety of other people on the road, for example by not letting other drivers pass","example[21]":"Some road hogs drive at well below the speed limit, because they want to use their mobile phones.","definition[8]":"a person who drives a car, bus, train etc","definition[9]":"something that has an important influence on other things","example[22]":"Population growth is the biggest single driver of atmospheric pollution.","definition[10]":"a program that controls the operation of a piece of equipment","example[23]":"The program automatically chooses the correct driver for whatever option you’re configuring.","example[24]":"a 32 bit ScSC driver, featuring a Solaris operating system"}