{"definition[0]":"a disease of the body or mind, or the condition of being ill","example[0]":"She had all the normal childhood illnesses.","example[1]":"Her mother was recovering from a serious illness.","example[2]":"I’ve never missed a day’s work through illness.","example[3]":"ways to improve your health and reduce the risk of illness","collocation[0]":"have an illness","example[4]":"When did you first find out that you had the illness?","collocation[1]":"suffer from an illness","example[5]":"She suffers from a rare illness.","collocation[2]":"get/develop an illness","example[6]":"She developed the illness when she was in her 50s.","collocation[3]":"contract an illness","example[7]":"He contracted the illness while he was working abroad.","collocation[4]":"recover from an illness","example[8]":"It took several months for him to recover from his illness.","collocation[5]":"be diagnosed with an illness","example[9]":"Her husband had just been diagnosed with a terminal illness.","collocation[6]":"cause/lead to illness","example[10]":"Inadequate hygiene can lead to illness.","collocation[7]":"prevent illness","example[11]":"Vaccines have been successful in preventing illness.","form[0]":"ADJECTIVES/NOUN + illness","collocation[8]":"serious/severe","example[12]":"His illness is more severe than the doctors first thought.","example[13]":"He suffered a succession of minor illnesses.","collocation[9]":"fatal","example[14]":"She developed a fatal illness.","collocation[10]":"life-threatening","example[15]":"Doctors say that his illness isn’t life-threatening.","collocation[11]":"terminal","example[16]":"At that point the illness was thought to be terminal.","collocation[12]":"incurable","example[17]":"The films tells the sad story of a young boy with an incurable illness.","collocation[13]":"acute","example[18]":"A lot of illnesses can be either acute or chronic.","collocation[14]":"chronic","example[19]":"Diabetes is an example of a chronic illness.","collocation[15]":"a long/short illness","example[20]":"She nursed him through his long illness.","example[21]":"Arthur died following a short illness.","collocation[16]":"a debilitating illness","example[22]":"His last years were ruined by a debilitating illness.","collocation[17]":"a childhood illness","example[23]":"Measles is a common childhood illness.","collocation[18]":"a mental/psychiatric illness","example[24]":"We provide specialist care for young people with mental illnesses.","collocation[19]":"the symptoms of an illness","example[25]":"Symptoms of the illness include vomiting and severe headaches.","collocation[20]":"a period of illness","example[26]":"He returned to work after a period of illness.","definition[1]":"something wrong with your health which makes you feel ill","example[27]":"Her husband was in hospital for six months with a serious illness.","display[0]":"disease","definition[2]":"a particular illness, especially one that spreads to other people easily or that affects one part of your body","example[28]":"childhood diseases such as measles and chickenpox","example[29]":"heart disease","display[1]":"infection","definition[3]":"an illness that is caused by bacteria or a virus","example[30]":"His cough got worse and worse and became a chest infection.","display[2]":"condition","definition[4]":"a health problem that affects you permanently or for a long time","example[31]":"a medical condition such as asthma","example[32]":"a heart condition","display[3]":"problem","definition[5]":"something that is wrong with a particular part of your body or your health in general","example[33]":"a serious back problem","example[34]":"health problems","display[4]":"trouble","definition[6]":"illness or pain that affects a particular part of your body","example[35]":"I’ve had a bit of stomach trouble.","display[5]":"disorder","definition[7]":"an illness that prevents a particular organ of your body from working properly, or affects the way you behave","example[36]":"a liver disorder","example[37]":"a blood disorder","example[38]":"Anorexia nervosa is an eating disorder.","heading[0]":"an illness that is not very serious","display[6]":"bug","definition[8]":"an illness that spreads to other people very easily but that is not very serious","example[39]":"There’s a bug going round at school and a lot of the children are absent.","example[40]":"a flu bug","display[7]":"complaint","definition[9]":"an illness that affects a particular part of your body, especially one that is not very serious – used by doctors","example[41]":"a minor skin complaint","example[42]":"Deakin suffers from a back complaint called arachnoiditis.","display[8]":"ailment","definition[10]":"an illness that affects a particular part of your body, especially one that is not serious","example[43]":"People often go to their doctor about relatively minor ailments.","example[44]":"The ointment is used to treat ailments such as small wounds and insect bites.","heading[1]":"the general state of being ill","example[45]":"Stress is emerging today as a major cause of illness.","display[9]":"sickness","definition[11]":"the state of being ill, especially when it stops you working","example[46]":"absence from work due to sickness","display[10]":"ill health","definition[12]":"the state of being ill, usually for a long period of time","example[47]":"Research shows that there is a link between air pollution and ill health."}