{"word[0]":"competence","definition[0]":"the ability to do something well","opposite[0]":"incompetence","example[0]":"Doctors have to constantly update their knowledge in order to maintain their professional competence.","note[0]":"professional/linguistic/technical etc competence","example[1]":"Students will gain competence in a wide range of skills.","note[1]":"competence in","example[2]":"He questioned the competence of the government.","note[2]":"competence of","definition[1]":"the legal power of a court of law to hear and judge something in court, or of a government to do something","example[3]":"Many legal issues are within the competence of individual states rather than the federal government.","note[3]":"be within the competence of something","definition[2]":"a skill needed to do a particular job","example[4]":"Typing is considered by most employers to be a basic competence.","collocation[0]":"have competence","example[5]":"Older people often feel that they don't have any competence with computers.","collocation[1]":"demonstrate/show competence","example[6]":"Students have to demonstrate competence in maths and science.","collocation[2]":"acquire/achieve/gain/develop competence","example[7]":"First you have to acquire competence in methods of research.","collocation[3]":"lack competence","example[8]":"Some staff members lacked the competence to deal with technical problems.","collocation[4]":"professional competence","example[9]":"The courses will improve the skills and professional competence of the staff.","collocation[5]":"technical/linguistic/managerial etc competence","example[10]":"There are many careers that require a high degree of linguistic competence.","collocation[6]":"social competence","example[11]":"The first years of life are very important in a child's growth toward social competence.","collocation[7]":"a level/standard/degree of competence","example[12]":"The trainees are expected to acquire a basic level of competence.","definition[3]":"the ability or skill to do something well or to a satisfactory standard","example[13]":"To remain in the guild, members must maintain their standards of professional competence.","example[14]":"Part of the job requirement is that the candidate has competence in English.","definition[4]":"a skill that you need to do a particular job","example[15]":"short residential courses designed to develop specific management competences","definition[5]":"the official authority of a court to hear a legal case","synonym[0]":"JURISDICTION","example[16]":"The Court of Appeal possesses the competence to set aside convictions.","definition[6]":"when someone is old enough, well enough, or intelligent enough to make decisions, appear in a court of law, sign a legal document etc","example[17]":"Many children’s solicitors found it difficult to determine the child’s competence to give instructions."}