{"word[0]":"edge","signpost[0]":"outside part","definition[0]":"the part of an object that is furthest from its centre","example[0]":"Put the eggs in the centre of the dish, with the vegetables and herbs around the edge.","example[1]":"He stood at the water’s edge staring across the lake.","example[2]":"A leaf was on the ground, curling up at the edges.","example[3]":"the right hand edge of the page","note[0]":"the edge of something","example[4]":"Jennifer walked to the edge of the wood.","example[5]":"Billy sat on the edge of the bed.","signpost[1]":"blade","definition[1]":"the thin sharp part of a blade or tool that cuts","example[6]":"a knife with a sharp edge","signpost[2]":"advantage","definition[2]":"something that gives you an advantage over others","example[7]":"Companies are employing more research teams to get an edge.","example[8]":"The next version of the software will have the edge over its competitors.","definition[3]":"a quality in someone’s voice that makes it sound slightly angry or impatient","example[9]":"There was an edge of hostility in Jack’s voice.","example[10]":"Desperation lent an edge to her voice.","signpost[3]":"slope","definition[4]":"an area beside a very steep slope","example[11]":"She walked almost to the edge of the cliff.","signpost[4]":"quality","definition[5]":"a special quality of excitement or danger","example[12]":"The school’s campaign has been given an extra edge by being filmed for television.","heading[0]":"– Meaning 1: the part of an object that is furthest from its centre","collocation[0]":"the top edge","example[13]":"I gripped the top edge of the door and pulled myself up.","collocation[1]":"the bottom/lower edge","example[14]":"The lower edge of the window frame was starting to rot.","collocation[2]":"the front/back edge","example[15]":"I banged my elbow on the front edge of the desk.","collocation[3]":"the inside/inner edge","example[16]":"He painted carefully around the inner edge of each door.","collocation[4]":"the outside/outer edge","example[17]":"The airport is located on the outer edge of town.","collocation[5]":"the northern/southern etc edge","example[18]":"There’s a ridge of hills on the northern edge of the county.","collocation[6]":"the edge of the sea","example[19]":"The castle stands on the edge of the sea.","collocation[7]":"the river’s/water’s edge","example[20]":"We sat down at the water’s edge.","heading[1]":"– Meaning 3: something that gives you an advantage over others","collocation[8]":"have the edge over somebody/something","example[21]":"We believe our products have the edge over the competition.","collocation[9]":"get/gain an edge over somebody/something","example[22]":"A well trained workforce is a key factor in gaining a competitive edge over our rivals.","collocation[10]":"give somebody the edge","example[23]":"I hope my qualifications and experience will give me the edge.","collocation[11]":"lose your edge","example[24]":"He’s had a lot of injuries and lost a lot of his competitive edge.","collocation[12]":"a slight edge","example[25]":"Running on the inside lane will give him a slight edge.","collocation[13]":"a distinct edge","example[26]":"Being tall gives you a distinct edge in some sports.","collocation[14]":"a competitive edge","example[27]":"He believes investment in new technology is the only way for the company to maintain its competitive edge.","definition[6]":"the part of something that is furthest from its centre or nearest the place where it ends","example[28]":"He got up quickly, knocking his plate off the edge of the table.","example[29]":"the outer edge of the village","display[0]":"side","definition[7]":"the part of something that is near its left or right edge","example[30]":"On the left side of the garden there was an old stone wall.","example[31]":"They parked by the side of the road.","display[1]":"rim","definition[8]":"the edge of something circular, especially the top of a cup or glass, or the outside edge of a pair of glasses","example[32]":"a white cup with a gold rim","example[33]":"She was looking at me over the rim of her spectacles.","display[2]":"margin","definition[9]":"the empty space at the side of a page that has writing on it","example[34]":"My teacher had marked my essay and made some comments in the margin.","example[35]":"Leave wide margins on both sides of the page.","display[3]":"hem","definition[10]":"the edge of a piece of cloth that is turned under and stitched down, especially the lower edge of a skirt, trousers etc","example[36]":"If you want the dress a bit shorter, I can easily turn up the hem.","display[4]":"kerb","definition[11]":"the edge of the pavement (=raised path)","example[37]":"A big black car was parked at the kerb.","display[5]":"outskirts","definition[12]":"the areas of a city that are furthest away from the centre","example[38]":"The new station was built on the outskirts of the city.","display[6]":"perimeter","definition[13]":"the outside edge around an enclosed area of land such as a military camp or a prison","example[39]":"Security guards patrol the perimeter night and day.","definition[14]":"to move gradually with several small movements, or to make something do this","example[40]":"Tim was edging away from the crowd.","example[41]":"She edged closer to get a better look.","example[42]":"He edged her towards the door.","example[43]":"Christine edged her way round the back of the house.","note[1]":"edge your way into/round/through etc something","signpost[5]":"put at edge","definition[15]":"to put something on the edge or border of something","example[44]":"The city square was edged by trees.","example[45]":"The tablecloth is edged with lace.","note[2]":"be edged with something","explanation[0]":"Edge is usually passive in this meaning","definition[16]":"to change gradually, especially so as to get better or worse","example[46]":"The paper has edged ahead of  (=been more successful than) its rivals.","example[47]":"Profits have edged up.","note[3]":"edge up/down","signpost[6]":"grass","definition[17]":"to cut the edges of an area of grass so that they are tidy and straight","definition[18]":"if a person, company, or country has an edge over others, they are more successful, profitable etc because they have an advantage that the others do not have","example[48]":"They have a slight edge over their competitors.","example[49]":"It has lower overheads than many similar companies, giving it an important competitive edge.","definition[19]":"to increase by a small amount","example[50]":"Consumer prices edged up 0.2% last month.","example[51]":"Hong Kong edged ahead after a day of sharp swings.","example[52]":"Turnover edged forward 2% to £43.6 million.","definition[20]":"to decrease by a small amount","example[53]":"Sales of cars, trucks and buses in Japan edged down 0.9% in January.","example[54]":"The index, which had climbed to 106.6 in late July, edged back to 100.4."}