{"word[0]":"obey","definition[0]":"to do what someone in authority tells you to do, or what a law or rule says you must do","opposite[0]":"disobey","example[0]":"The little boy made no effort to obey.","example[1]":"‘Sit!’ he said, and the dog obeyed him instantly.","example[2]":"Soldiers are expected to obey orders without questioning them.","note[0]":"obey an order/command","example[3]":"Failure to obey the law can lead to a large fine.","note[1]":"obey the law/rules","explanation[0]":"Obey is used especially when talking about doing what laws or people in authority tell you to do. In everyday situations, people usually say do what somebody says:","example[4]":"My husband never does what I say.","example[5]":"She’s the sort of person who always obeys the rules.","collocation[0]":"obey an order/command/instruction","example[6]":"The first duty of a soldier is to obey orders.","collocation[1]":"an obligation to obey","example[7]":"Citizens have an obligation to obey the law.","collocation[2]":"must obey/have to obey","example[8]":"She felt she had to obey her father, even though she thought he was wrong.","collocation[3]":"refuse to obey","example[9]":"Many people felt the law was unfair, and refused to obey it.","collocation[4]":"blindly obey","example[10]":"He looked terrified, but blindly obeyed.","collocation[5]":"obey instantly/immediately","example[11]":"He expected his orders to be obeyed instantly.","example[12]":"You must obey a senior officer at all times.","example[13]":"If everyone obeys the rules of the road, safety is much improved.","display[0]":"do what somebody says","definition[1]":"to do what someone has advised or ordered you to do. In informal and everyday situations, people usually say do what somebody says rather than obey","example[14]":"I did what you said but the car still hasn’t started.","display[1]":"do what you are told/do as you are told","definition[2]":"to do what your parent or teacher says you must do – used especially about children","example[15]":"At school, we expect the pupils to do what they are told.","example[16]":"Do as you’re told and sit down.","display[2]":"follow somebody’s orders/instructions/advice","definition[3]":"to do what someone says you should do, or advises you to do","example[17]":"You must follow your doctor’s orders.","example[18]":"I followed the manufacturer’s instructions.","example[19]":"I hope she’ll follow my advice.","display[3]":"abide by something","definition[4]":"to accept and obey a rule, law, agreement etc","example[20]":"Players have to abide by the rules of the game.","display[4]":"respect","definition[5]":"to obey the law or customs of a place, even when you do not agree with them, because this is a necessary part of living in a society","example[21]":"Smokers should respect the law, and only smoke in the privacy of their own homes."}