{"past_tense[0]":"understood","signpost[0]":"meaning","definition[0]":"to know the meaning of what someone is telling you, or the language that they speak","example[0]":"She doesn’t understand English.","example[1]":"I’m sorry, I don’t understand. Can you explain that again?","example[2]":"The woman had a strong accent, and I couldn’t understand what she was saying.","example[3]":"I’m not very good at German, but I can make myself understood.","note[0]":"make yourself understood","signpost[1]":"fact/idea","definition[1]":"to know or realize how a fact, process, situation etc works, especially through learning or experience","example[4]":"I don’t really understand the political situation in Egypt.","example[5]":"How the drug works isn’t fully understood.","example[6]":"You don’t need to understand how computers work to be able to use them.","note[1]":"understand how/why/where etc","example[7]":"I understand that this treatment may not work.","note[2]":"understand (that)","signpost[2]":"person/feelings","definition[2]":"to realize how someone feels and why they behave the way they do, and to be sympathetic","example[8]":"My parents just don’t understand me.","example[9]":"Just tell him how you feel – I’m sure he’ll understand.","example[10]":"I can understand her wanting to live alone and be independent.","note[3]":"(can) understand somebody doing something","example[11]":"I understand how you feel, but I think you’re overreacting.","note[4]":"understand how/what etc","signpost[3]":"believe/think","definition[3]":"to believe or think that something is true because you have heard it or read it","example[12]":"‘I understand that he was 62 when he died, ’ McLeish said.","example[13]":"It is understood that the Queen approves of her nephew’s romance.","note[5]":"it is understood (that)","example[14]":"Dillons is understood to be reorganising the company’s management structure.","note[6]":"be understood to be (doing) something","explanation[0]":"In more formal English, you say it is understood that when saying what people in general believe is true","example[15]":"It is understood that an agreement will be signed today","explanation[1]":"Understand is not used in the progressive You say","example[16]":"I understand what you’re saying","bad_example[0]":"I’m understanding what you’re saying","definition[4]":"to know the meaning of something, or the reasons for something","example[17]":"I understand what you’re saying.","example[18]":"Doctors are beginning to understand what causes the disease.","definition[5]":"to understand something, especially the truth about a situation or the reasons for something","example[19]":"I can see why you don’t like him.","example[20]":"Do you see what I mean?","example[21]":"Oh, I see!","definition[6]":"to understand a joke, what someone says, the reasons why something is true etc","example[22]":"She didn’t seem to get the joke.","example[23]":"Do you get me?","example[24]":"He explained the math homework twice, but I still don’t get it.","example[25]":"I still don’t get why she left.","display[0]":"comprehend","definition[7]":"to understand something, or understand why something is important","example[26]":"The dream was easy to describe, but difficult to comprehend.","example[27]":"They had failed to comprehend the significance of the problem.","display[1]":"know what somebody means","definition[8]":"to understand what someone is telling you, or what a situation is like, especially because you have some experience or knowledge about this","example[28]":"‘It can be really hard to give up smoking.’ ‘I know exactly what you mean.’","example[29]":"We now know what the scientists meant when they warned about global warming.","display[2]":"follow","definition[9]":"to understand something such as an explanation or story as you hear it, read it etc","example[30]":"The plot is hard to follow.","example[31]":"His instructions were easy to follow.","heading[0]":"to understand something difficult","display[3]":"grasp","definition[10]":"to completely understand an idea or a fact, especially a complicated one","example[32]":"Some of his theories can be rather difficult for the ordinary reader to grasp.","example[33]":"I don’t think Stuart really grasped the point I was making.","display[4]":"fathom","definition[11]":"to understand what something means or the reasons for something, after thinking carefully about it","example[34]":"She looked at him, puzzled, trying to fathom the reasons for his actions.","display[5]":"make sense of something","definition[12]":"to understand something that is not easy to understand, especially by thinking about it","example[35]":"People are still trying to make sense of the news.","display[6]":"can’t make head nor tail of something","definition[13]":"used when something seems impossible to understand","example[36]":"I can’t make head nor tail of his plays, and I’m not sure that anyone else can either."}