{"word[0]":"slide","past_tense[0]":"slid","definition[0]":"to move smoothly over a surface while continuing to touch it, or to make something move in this way","example[0]":"Francesca slid across the ice.","note[0]":"slide along/across/down etc","example[1]":"He opened the oven door and slid the pan of cookies in.","note[1]":"slide something across/along etc","example[2]":"He slid open the door of the glass cabinet.","definition[1]":"to move somewhere quietly and smoothly, or to move something in this way","example[3]":"Daniel slid out of the room when no one was looking.","note[2]":"slide into/out of etc","example[4]":"She slid into the driver’s seat.","example[5]":"He slid the gun into his pocket.","note[3]":"slide something into/out of etc something","definition[2]":"if prices, amounts, rates etc slide, they become lower","synonym[0]":"drop","example[6]":"Stocks slid a further 3% on the major markets today.","definition[3]":"to gradually become worse, or to begin to have a problem","example[7]":"Students’ test scores started to slide in the mid-1990s.","example[8]":"Murphy gradually slid into a pattern of drug abuse.","note[4]":"slide into","definition[4]":"to move smoothly over a surface while continuing to touch it","example[9]":"The glass slid off the tray and crashed to the floor.","example[10]":"The kids were having fun sliding around on the polished floor.","display[0]":"slip","definition[5]":"to slide a short distance accidentally, and fall or lose your balance slightly","example[11]":"Be careful you don’t slip on the ice.","example[12]":"She slipped and broke her ankle.","display[1]":"skid","definition[6]":"to slide sideways or forwards in a way that is difficult to control – used especially about a moving vehicle","example[13]":"He slammed on the brakes and the car skidded to a halt.","example[14]":"Go slowly in wet or icy weather, because it’s easy to skid.","display[2]":"glide","definition[7]":"to move smoothly and quietly across water or a smooth surface, especially in a graceful way","example[15]":"A swan was gliding across the lake.","example[16]":"The ship glided into port.","display[3]":"slither","definition[8]":"to slide in an awkward way, for example on a rough or muddy surface. Also used to describe the movement of a snake as it goes from side to side along the ground","example[17]":"Tom slithered down the bank into the water.","example[18]":"The snake slithered away and disappeared under a rock.","signpost[0]":"for children","definition[9]":"a large structure with steps leading to the top of a long sloping surface that children can slide down","definition[10]":"a decrease in prices, amounts etc","example[19]":"the current slide in house prices","note[5]":"slide in","example[20]":"The company’s shares were on the slide again yesterday, down 7p at 339p.","note[6]":"on the slide","definition[11]":"a small piece of film in a frame that you shine a light through to show a picture on a screen or wall","example[21]":"a slide show","signpost[1]":"getting worse","definition[12]":"a situation in which something gradually gets worse, or someone develops a problem","example[22]":"School administrators were unable to explain the slide in student performance.","example[23]":"a slide into economic chaos","signpost[2]":"science","definition[13]":"a small piece of thin glass used for holding something that you want to look at under a microscope","signpost[3]":"music/machine","definition[14]":"a sliding part of a machine or musical instrument, such as the U-shaped tube of a trombone","definition[15]":"a sliding movement across a surface","example[24]":"The car went into a slide.","signpost[4]":"earth/snow","definition[16]":"a sudden fall of earth, stones, snow etc down a slope","example[25]":"a rock slide","signpost[5]":"for hair","definition[17]":"a small metal or plastic object that holds your hair in place","definition[18]":"to gradually become lower or less","example[26]":"Some dealers continued to buy silver as the price slid.","example[27]":"The new model didn’t stop their share of the U.S. car market from sliding."}