{"word[0]":"proud","comparative[0]":"prouder","superlative[0]":"proudest","signpost[0]":"pleased","definition[0]":"feeling pleased about something that you have done or something that you own, or about someone or something you are involved with or related to","opposite[0]":"ashamed","example[0]":"Seth was the proud owner of a new sports car.","example[1]":"The company is justly proud of its achievements.","note[0]":"be justly/rightly proud of something","example[2]":"Her parents are very proud of her.","note[1]":"proud of","example[3]":"You should be proud of yourself.","example[4]":"His past record is certainly something to be proud of.","example[5]":"Seven-year-old Ian is proud to have earned his red belt in karate.","note[2]":"proud to do/be something","example[6]":"She was proud that the magazine had agreed to publish one of her stories.","note[3]":"proud (that)","heading[0]":"GRAMMAR: Prepositions with proud","explanation[0]":"You are proud of someone or something","example[7]":"He’s proud of his son","bad_example[0]":"He’s proud for his son","signpost[1]":"too high opinion","definition[1]":"thinking that you are more important, skilful etc than you really are – used to show disapproval","example[8]":"a proud man who would not admit his mistakes","signpost[2]":"great self-respect","definition[2]":"having respect for yourself, so that you are embarrassed to ask for help when you are in a difficult situation","example[9]":"Some farmers were too proud to ask for government help.","signpost[3]":"impressive","definition[3]":"tall and impressive","collocation[0]":"very/really proud","example[10]":"Your family must be very proud of you.","collocation[1]":"justifiably/justly/rightly proud","example[11]":"He is justifiably proud of what he and his father achieved.","collocation[2]":"fiercely proud","example[12]":"They are fiercely proud of their native land.","collocation[3]":"immensely/intensely/inordinately proud","example[13]":"He said he was immensely proud to have been elected prime minister.","example[14]":"She was intensely proud of being Japanese.","collocation[4]":"the proud owner (of something)","example[15]":"She is now the proud owner of a four-bedroomed house.","collocation[5]":"a proud mother/father/parent","example[16]":"Mark is the proud father of a three-week-old baby boy.","definition[4]":"very pleased with what you, your family, or your country have achieved, or of something you own","example[17]":"I felt so proud when my son graduated from college.","example[18]":"Judith’s very proud of her new Ferrari.","display[0]":"pleased with yourself","definition[5]":"feeling pleased because something good has happened, especially because you think you have been very clever, skilful etc","example[19]":"He was smoking a big cigar and was obviously pleased with himself.","example[20]":"I’d made a big profit and was feeling pretty pleased with myself.","display[1]":"arrogant","definition[6]":"behaving in an unpleasant and annoying way, because you think you are better or know more than other people, and that your opinions are always right","example[21]":"He was arrogant and regarded people who disagreed with him as fools.","example[22]":"his arrogant attitude to women","display[2]":"vain","definition[7]":"too proud of your appearance, in a way that annoys other people","example[23]":"He’s so vain – he thinks all the girls fancy him.","display[3]":"conceited/big-headed","definition[8]":"proud of yourself because you think you are very intelligent, skilful, beautiful etc, especially without good reason and in a way that annoys people","example[24]":"Stewart’s the most arrogant conceited person I’ve ever known.","example[25]":"She was offered a brilliant job and became incredibly big-headed overnight.","display[4]":"pompous","definition[9]":"thinking that you are much more important than you really are, and using very long and formal words to try to sound important","example[26]":"The clerk was a pompous little man with glasses.","example[27]":"a pompous speech","display[5]":"smug","definition[10]":"pleased with yourself in a quiet but annoying way because you think you are in a better position than other people","example[28]":"Milly was looking very smug about coming top of the class.","example[29]":"a smug expression","display[6]":"self-satisfied","definition[11]":"pleased with what you have achieved and showing it clearly in an annoying way","example[30]":"She glared angrily into his self-satisfied face.","example[31]":"a self-satisfied grin"}