{"word[0]":"mix","definition[0]":"if you mix two or more substances or if they mix, they combine to become a single substance, and they cannot be easily separated","example[0]":"Oil and water don’t mix.","example[1]":"Shake the bottle well so that the oil mixes with the vinegar.","note[0]":"mix (something) with something","example[2]":"The powder is mixed with cold water to form a paste.","example[3]":"Mix the soured cream with ketchup.","example[4]":"First mix the butter and sugar together, then add the milk.","note[1]":"mix something together","example[5]":"Mix in 75 g of butter.","note[2]":"mix something in","example[6]":"Mix the herbs into the sauce.","note[3]":"mix something into something","definition[1]":"to combine two or more different activities, ideas, groups of things etc","example[7]":"Their musical style mixes elements of Eastern culture and Western pop.","example[8]":"His books mix historical fact with fantasy.","note[4]":"mix something with something","example[9]":"I don’t like to mix business with pleasure (=combine business and social activities at the same time).","definition[2]":"to meet, talk, and spend time with other people, especially people you do not know very well","synonym[0]":"socialize","example[10]":"Charlie doesn’t mix well with the other children.","note[5]":"mix with","definition[3]":"to prepare something, especially food or drink, by mixing things together","example[11]":"Will you mix us some martinis, Bill?","definition[4]":"to control the balance of sounds in a record or film","definition[5]":"the particular combination of things or people in a group or thing","example[12]":"the region’s rich ethnic mix  (=people of different races)","example[13]":"a good mix of people","note[6]":"mix of","example[14]":"We felt that between us we had the right mix of skills.","example[15]":"a complicated mix of colours and textures","definition[6]":"a combination of substances that you mix together to make something such as a cake","synonym[1]":"mixture","example[16]":"Add water to the cake mix and bake at 375°F.","note[7]":"cake/soup etc mix","definition[7]":"a particular arrangement of sounds, voices, or different pieces of music used on a pop record","example[17]":"the dance mix","definition[8]":"a group of different things combined together for a particular purpose","example[18]":"If the investment manager picks the right mix of bonds, his total return should rise quickly."}