{"word[0]":"qualification","definition[0]":"if you have a qualification, you have passed an examination or course to show you have a particular level of skill or knowledge in a subject","example[0]":"He left school without any qualifications.","example[1]":"We are looking for graduates with qualifications in maths or science.","note[0]":"qualification in","definition[1]":"a skill, personal quality, or type of experience that makes you suitable for a particular job or position","example[2]":"Does he have the right qualifications to become a Supreme Court Justice?","example[3]":"health and fitness qualifications for membership in the Territorial Army","note[1]":"qualification for","example[4]":"There have been questions about his qualifications to lead the company.","note[2]":"qualification to do something","definition[2]":"when a person or team reaches a necessary standard, for example by passing an examination or defeating another team","example[5]":"Upon qualification, you can expect to find work abroad fairly easily.","example[6]":"the US qualification for the World Cup","definition[3]":"something that you add to a statement to limit its effect or meaning","synonym[0]":"reservation","example[7]":"I welcome without qualification the Minister’s proposal.","collocation[0]":"have a qualification","example[8]":"You don't need to have any qualifications for this job.","collocation[1]":"lack qualifications","example[9]":"40 percent of the prisoners lack any qualifications.","collocation[2]":"get a qualification","example[10]":"I want to get the qualifications so that I can become a doctor.","form[0]":"ADJECTIVES/NOUN + qualification","collocation[3]":"academic qualifications","example[11]":"Eva had excellent academic qualifications.","collocation[4]":"educational qualifications","example[12]":"Too many children leave school without any educational qualifications.","collocation[5]":"a teaching/medical/legal etc qualification","example[13]":"She has a degree and a teaching qualification.","collocation[6]":"a professional qualification","example[14]":"A professional qualification in accountancy would be an advantage.","collocation[7]":"a vocational qualification","example[15]":"You can study for a vocational qualification in the tourism industry.","collocation[8]":"formal qualifications","example[16]":"He has no formal qualifications.","collocation[9]":"paper qualifications","example[17]":"We often find that paper qualifications are no guide to ability.","collocation[10]":"a recognized qualification","example[18]":"Trainees can work towards a recognised vocational qualification.","collocation[11]":"good/excellent qualifications","example[19]":"Good qualifications are a passport to success.","definition[4]":"an examination that you have passed at school, university, or in your profession","example[20]":"The government is determined to reduce the number of young people leaving school with no qualifications.","example[21]":"Even without paper qualifications (=official qualifications rather than experience or personal qualities), a well-motivated young girl should be able to find work as a shop assistant or a waitress.","definition[5]":"a skill, personal quality, or type of experience that makes you suitable for a particular job","example[22]":"Mr. Burkett has all the qualifications for a big-time fund-raiser: a limitless capacity for talking on the phone, and a lot of rich personal contacts.","example[23]":"Isobel has all the right qualifications to become a good manager."}