{"word[0]":"eat","past_tense[0]":"ate","past_participle[0]":"eaten","definition[0]":"to put food in your mouth and chew and swallow it","example[0]":"Felix chatted cheerfully as he ate.","example[1]":"A small girl was eating an ice cream.","example[2]":"We had plenty to eat and drink.","example[3]":"It’s important to eat healthily when you are pregnant.","example[4]":"I exercise and eat right and get plenty of sleep.","example[5]":"Would you like something to eat?","example[6]":"She can eat like a horse and never put on weight.","example[7]":"We stopped at McDonalds to get a bite to eat.","example[8]":"Good eating habits are the best way of preventing infection.","example[9]":"ready-to-eat foods such as deli meats and cheeses","example[10]":"‘More cake?’ ‘No thanks, I couldn’t eat another thing.’","example[11]":"No chicken for me. I don’t eat meat  (=I never eat meat).","example[12]":"Does Rob eat fish?","signpost[0]":"meal","definition[1]":"to have a meal","example[13]":"Let’s eat first and then go to a movie.","example[14]":"They’re eating breakfast.","example[15]":"We could not afford to eat at Walker’s very often.","note[0]":"eat at","signpost[1]":"use","definition[2]":"to use a very large amount of something","example[16]":"This car eats petrol.","collocation[0]":"eat breakfast/lunch/dinner etc","example[17]":"What time do you usually eat lunch?","collocation[1]":"eat well","example[18]":"The people work hard, but they eat well.","collocation[2]":"eat healthily/sensibly","example[19]":"If you eat healthily and exercise regularly, you’ll look and feel a lot better.","collocation[3]":"eat properly","example[20]":"He hadn’t been eating properly and was drinking far too much.","collocation[4]":"eat hungrily","example[21]":"The children ate hungrily, devouring everything on their plate.","collocation[5]":"eat sparingly","example[22]":"Carter joined us for lunch, but ate sparingly, as he always did.","collocation[6]":"have something/nothing to eat","example[23]":"We’ll leave after we’ve had something to eat.","collocation[7]":"have enough/plenty etc to eat","example[24]":"Have you had enough to eat?","collocation[8]":"have little to eat","example[25]":"The refugees had very little to eat and no clean water.","collocation[9]":"find something to eat","example[26]":"I got dressed and went downstairs to find something to eat.","collocation[10]":"get something to eat","example[27]":"I’m sure you can get something to eat on the train.","collocation[11]":"somebody’s eating habits","example[28]":"The doctor asked me about my eating habits and how much I smoked.","collocation[12]":"an eating disorder","example[29]":"She described her battle with the eating disorder bulimia.","collocation[13]":"a bite to eat","example[30]":"We should have time for a bite to eat before we set out.","collocation[14]":"eat like a horse","example[31]":"She eats like a horse but never puts on any weight!","collocation[15]":"eat like a bird","example[32]":"Ever since she was a child, Jan had always eaten like a bird.","collocation[16]":"I couldn’t eat another thing","example[33]":"Thanks, that was lovely, but I couldn’t eat another thing.","example[34]":"Experts recommend eating plenty of fruit and vegetables.","display[0]":"have","definition[3]":"to eat a particular food","example[35]":"‘What do you usually have for breakfast?’ ‘I usually just have coffee and toast.’","example[36]":"We had the set meal.","display[1]":"feed on something","definition[4]":"to eat a particular kind of food – used when talking about animals","example[37]":"Foxes feed on a wide range of foods including mice, birds, insects, and fruit.","display[2]":"consume","definition[5]":"to eat or drink something – used especially in scientific or technical contexts","example[38]":"Babies consume large amounts relative to their body weight.","display[3]":"munch (on) something","definition[6]":"to eat something with big continuous movements of your mouth, especially when you are enjoying your food","example[39]":"He was munching on an apple.","example[40]":"They were sitting on a bench munching their sandwiches.","display[4]":"nibble (on) something","definition[7]":"to eat something by biting off very small pieces","example[41]":"If you want a healthy snack, why not just nibble on a carrot?","display[5]":"pick at something","definition[8]":"to eat only a small amount of your food because you are not hungry or do not like the food","example[42]":"Lisa was so upset that she could only pick at her food.","display[6]":"stuff/gorge yourself","definition[9]":"to eat so much food that you cannot eat anything else","example[43]":"He’s always stuffing himself with cakes.","example[44]":"We gorged ourselves on my mother’s delicious apple tart.","display[7]":"slurp","definition[10]":"to eat soup, noodles etc with a noisy sucking sound","example[45]":"In England it’s considered rude to slurp your soup, but in some countries it’s seen as a sign of enjoyment.","heading[0]":"to eat something quickly","display[8]":"gobble something up/down","definition[11]":"to eat something very quickly, especially because you like it very much or you are greedy","example[46]":"You’ve gobbled up all the ice-cream!","example[47]":"The children gobbled it down in no time.","display[9]":"wolf something down","definition[12]":"to eat food quickly, especially because you are very hungry or in a hurry","example[48]":"The boy wolfed down everything on his plate and asked for more.","display[10]":"bolt something down","definition[13]":"to eat food very quickly, especially because you are in a hurry","example[49]":"He bolted down his breakfast and was out of the door within 5 minutes.","example[50]":"You shouldn’t bolt your food down like that.","display[11]":"devour","definition[14]":"to eat all of something quickly because you are very hungry","example[51]":"In a very short time, the snake had devoured the whole animal.","heading[1]":"to eat less food or stop eating","display[12]":"be on a diet","definition[15]":"to be eating less or different food than normal in order to become thinner","example[52]":"No cake thanks – I’m on a diet.","definition[16]":"to not eat for a period of time, often for religious reasons","example[53]":"Muslim people fast during the month of Ramadan."}