{"word[0]":"enough","definition[0]":"to the degree that is necessary or wanted","example[0]":"Are the carrots cooked enough?","example[1]":"He just hadn’t thought enough about the possible consequences.","example[2]":"You can go to school when you’re old enough.","example[3]":"You’re late. It’s just not good enough (=not satisfactory or acceptable).","example[4]":"Is the water warm enough for you?","note[0]":"enough for","example[5]":"Will Evans be fit enough to play?","note[1]":"enough to do something","example[6]":"The rooms are all large enough to take a third bed.","example[7]":"Surely no one would be foolish enough to lend him the money?","definition[1]":"fairly but not very","example[8]":"I was happy enough in Bordeaux, but I missed my family.","example[9]":"He’s a nice enough young man.","explanation[0]":"You use enough after an adjective or adverb","example[10]":"It’s small enough to fit in your pocket","example[11]":"We’re not going fast enough","bad_example[0]":"It’s enough small to fit in your pocket","bad_example[1]":"We’re not going enough fast","definition[2]":"as many or as much as is needed or wanted","example[12]":"Have I given you enough money?","example[13]":"Not enough is known about what happened.","example[14]":"Erica was worried that the children weren’t getting enough to eat.","note[2]":"enough to do/eat etc","example[15]":"Do you think we’ve got enough pizza to go round?","note[3]":"enough to go round","example[16]":"We only had $500, and that was nowhere near enough to buy a new camcorder.","note[4]":"not nearly/nowhere near enough","example[17]":"Come on – there’ll be time enough to chat later.","note[5]":"time/reason/trouble etc enough","example[18]":"There aren’t enough chairs for everyone.","example[19]":"The police didn’t have enough evidence to convict him.","note[6]":"enough (something) to do something","example[20]":"He didn’t even earn enough to pay the rent.","example[21]":"You’ve had more than enough time to make all the preparations.","definition[3]":"used to say that a situation is already bad and you do not want it to get any worse","example[22]":"She has enough problems without you two getting into fights.","example[23]":"I don’t want to bother him – he has enough to worry about.","explanation[1]":"You use enough before uncountable and plural nouns","example[24]":"There isn’t enough time","example[25]":"There aren’t enough books","definition[4]":"as much or as many as necessary, or as you want","example[26]":"My family never had enough money for holidays abroad.","example[27]":"Have you had enough to eat?","display[0]":"sufficient","definition[5]":"enough for a particular purpose","example[28]":"The police did not have sufficient evidence to justify a charge.","example[29]":"The accuracy of the older technique was sufficient for our needs.","display[1]":"adequate","definition[6]":"enough in quantity or good enough in quality for a particular purpose","example[30]":"All staff must be given adequate training in health and safety.","example[31]":"The heating system was barely adequate.","display[2]":"ample","definition[7]":"more than enough for what is needed","example[32]":"Local residents will be given ample opportunity to express their views.","example[33]":"People used to think that 1 GB of memory was ample for the average personal computer.","display[3]":"plenty","definition[8]":"an amount that is enough or more than enough","example[34]":"Allow yourself plenty of time to get to the airport.","example[35]":"Your daughter won’t need much cash at camp ($20-$25 will be plenty).","display[4]":"something will do/something should do","definition[9]":"used to say that a particular number or amount will be enough for what you need","example[36]":"‘How many envelopes do you want?’ ‘Ten should do.’"}