{"word[0]":"budget","definition[0]":"the money that is available to an organization or person, or a plan of how it will be spent","example[0]":"We had a really tight budget.","example[1]":"a welfare program with a budget of $2 million","note[0]":"budget of","example[2]":"The budget for photography has been cut.","note[1]":"budget for","example[3]":"The project was completed within budget.","note[2]":"on/within budget","example[4]":"If you come in under budget, everyone will be very impressed.","note[3]":"under budget","example[5]":"Feature movies always run over budget.","note[4]":"over budget","definition[1]":"an official statement that a government makes about how much it intends to spend and what taxes will be necessary","form[0]":"ADJECTIVES/NOUN + budget","collocation[0]":"an annual/monthly/weekly budget","example[6]":"The organization has an annual budget of $24 million.","collocation[1]":"the national/federal/state budget","example[7]":"He has a plan to balance the federal budget.","collocation[2]":"the defence/education etc budget","example[8]":"We had to make cuts in the defence budget.","collocation[3]":"the family/household budget","example[9]":"Often the husband and wife contribute equally to the family budget.","collocation[4]":"a big/large budget","example[10]":"The club does not have a large budget for new players.","collocation[5]":"a small/low/limited budget","example[11]":"It was a project with a low budget.","collocation[6]":"a tight budget","example[12]":"Most young people have to live within a tight budget.","collocation[7]":"a fixed budget","example[13]":"Our clients usually have a fixed budget.","collocation[8]":"a shoestring budget","example[14]":"The film had been made on a shoestring budget.","collocation[9]":"a total budget","example[15]":"The National Institute of Health had a total budget of $11. 3 billion.","collocation[10]":"an overall budget","example[16]":"There has been an increase in the overall budget made available by the Government for training.","collocation[11]":"have a budget","example[17]":"Hospital caterers have a budget of about £20 per person per week.","collocation[12]":"overspend your budget","example[18]":"The Metropolitan Police has overspent its budget by £70 million.","collocation[13]":"keep within a budget","example[19]":"Further cuts are needed in order to keep within the budget.","collocation[14]":"balance the budget","example[20]":"the importance of balancing the budget and cutting taxes","form[1]":"budget + NOUN","collocation[15]":"a budget deficit","example[21]":"The country has a budget deficit of over $4 billion.","collocation[16]":"a budget surplus","example[22]":"A huge budget surplus of over £16 billion was recorded.","collocation[17]":"budget cuts","example[23]":"The department has suffered severe budget cuts.","definition[2]":"to carefully plan and control how much money you spend and what you will buy with it","example[24]":"We’ll have to budget more carefully.","example[25]":"This scheme enables you to budget the cost through fixed monthly payments.","example[26]":"We’ve budgeted for a new car next year.","definition[3]":"if you budget something such as time, you decide how much of it you will need","definition[4]":"very low in price – often used in advertisements","synonym[0]":"cheap","example[27]":"budget flights","definition[5]":"in the UK, a plan for how the government will collect all the money it needs, which is announced each year by the Chancellor of the Exchequer (=the minister in charge of financial matters). The Chancellor is always shown going to Parliament carrying a special red case that contains the Budget speech. The speech is broadcast on television and radio, and most people take an interest in the effects of the Budget on taxes and on the price of things like petrol, alcohol, and cigarettes.","definition[6]":"an official statement that a government makes about how much it intends to spend and what the rates of taxes will be for the next year or six months","example[28]":"There is a great deal in the Budget to help investment.","example[29]":"This year’s Budget is expected to include measures to help small businesses.","definition[7]":"a detailed plan made by an organization or a government of how much it will receive as income over a particular period of time, and how much it will spend, what it will spend the money on etc","example[30]":"Each year business managers draw up a budget and suggest a series of financial targets.","example[31]":"The President has promised to balance the government’s budget (=make sure that no more is spent than is received as income) within three years.","definition[8]":"the amount of money that an organization has to spend on a particular activity in a given period of time, usually a year","example[32]":"Hospital caterers have a budget of about £10 per person per week.","example[33]":"The service operates on a very tight budget (=with very little money to spare).","example[34]":"The film was made on a shoestring budget (=a very small budget).","definition[9]":"if you are on a budget, you have to do something with as little money as possible","example[35]":"Our self catering apartments are popular with those on a budget.","definition[10]":"to carefully plan and control how much you spend","example[36]":"$100 million has been budgeted for fees and expenses.","note[5]":"budget (something) for something"}