{"word[0]":"mistake","definition[0]":"something that has been done in the wrong way, or an opinion or statement that is incorrect","example[0]":"The most common mistake is to plant them too deep.","example[1]":"We may have made a mistake in our calculations.","note[0]":"mistake in","definition[1]":"something you do that is not sensible or has a bad result","example[2]":"Buying the house seemed a great idea at the time, but now I can see it was a terrible mistake.","example[3]":"Marrying him was the biggest mistake she ever made.","example[4]":"I stupidly made the mistake of giving them my phone number.","note[1]":"make the mistake of doing something","heading[0]":"– Meaning 1: something that has been done in the wrong way, or an opinion or statement that is incorrect","collocation[0]":"make a mistake","example[5]":"The lab must have made a mistake – this can’t be right.","collocation[1]":"correct a mistake","example[6]":"Luckily I was able to correct the mistake before my boss saw it.","collocation[2]":"realize your mistake","example[7]":"As soon as he realized his mistake he turned in the right direction.","collocation[3]":"admit your mistake","example[8]":"It is better to admit your mistake and apologize.","collocation[4]":"mistakes happen","example[9]":"We’re very careful, but mistakes can happen.","form[0]":"ADJECTIVES/NOUN + mistake","collocation[5]":"a common mistake","example[10]":"A common mistake is to imagine that dogs think like humans.","collocation[6]":"a little/minor mistake","example[11]":"The essay was full of little mistakes.","collocation[7]":"a serious/grave mistake","example[12]":"There was a serious mistake in the instructions.","collocation[8]":"an honest mistake","example[13]":"Thomas admitted he had broken the law, but said that it had been an honest mistake.","collocation[9]":"a silly/stupid mistake","example[14]":"You need to be able to laugh at your own silly mistakes.","collocation[10]":"an easy mistake (to make)","example[15]":"She looks like her sister, so it’s an easy mistake to make.","collocation[11]":"a spelling mistake","example[16]":"She spotted two spelling mistakes in the article.","collocation[12]":"be full of mistakes","example[17]":"The article was full of mistakes.","collocation[13]":"it is a mistake to think/assume etc something","example[18]":"It would be a mistake to assume that all snakes are dangerous.","collocation[14]":"there must be some mistake","example[19]":"There must be some mistake. I definitely booked a room for tonight.","example[20]":"The report was full of mistakes.","collocation[15]":"be all a mistake","example[21]":"He couldn’t bring himself to tell her it was all a mistake.","heading[1]":"– Meaning 2: something you do that is not sensible or has a bad result","example[22]":"I just want to prevent you from making a terrible mistake.","collocation[16]":"learn from your mistakes","example[23]":"I’m sure he will learn from his mistakes.","collocation[17]":"repeat a mistake","example[24]":"We certainly do not want to repeat the mistakes of the past.","collocation[18]":"a big/great mistake","example[25]":"Buying this car was a big mistake.","collocation[19]":"a bad/terrible/dreadful etc mistake","example[26]":"It would be a terrible mistake to marry him.","example[27]":"The decision to take the money was a serious mistake.","collocation[20]":"a fatal mistake","example[28]":"His fatal mistake was to underestimate his opponent.","collocation[21]":"a costly mistake","example[29]":"Hiring him turned out to be a costly mistake.","collocation[22]":"it is a mistake to do something","example[30]":"It is a mistake to try to see everything in the museum in one day.","example[31]":"He made the mistake of revealing his true intentions.","collocation[23]":"make the same mistake again/twice","example[32]":"We won’t make the same mistake again.","definition[2]":"something incorrect that you accidentally do, say, or write","example[33]":"I made a mistake – it should say £230, not £320.","display[0]":"error","definition[3]":"a mistake","example[34]":"an error in the report","example[35]":"grammatical errors","example[36]":"He had made a serious error on his tax form.","display[1]":"misprint","definition[4]":"a small mistake in something that is printed","example[37]":"There was a misprint in the article, and instead of ‘pleasant’ it said ‘pheasant’.","display[2]":"typo","definition[5]":"a mistake in something that has been typed or printed","example[38]":"I spotted a couple of typos in the letter.","display[3]":"inaccuracy","definition[6]":"a piece of information that is not completely correct","example[39]":"The report contained several inaccuracies.","display[4]":"mix-up","definition[7]":"a careless mistake in which one name, time, address etc has been confused with another, so that the details of something are wrong","example[40]":"There was a mix-up over the train times and I missed my train.","display[5]":"slip-up","definition[8]":"a careless mistake when you are doing something","example[41]":"The other team took advantage of the goalie’s slip-up.","display[6]":"oversight","definition[9]":"a mistake in which you forget something or do not notice something","example[42]":"Through some oversight, the brochures were not ready by the right date.","display[7]":"a slip of the tongue","definition[10]":"a mistake in which you accidentally say a similar sounding word","example[43]":"When I said Thursday, I meant Tuesday. It was a slip of the tongue.","display[8]":"faux pas","definition[11]":"an embarrassing mistake in a social situation, when you do or say something that you shouldn’t","example[44]":"Harris, trying to be funny, addressed the waiter as ‘boy’. A deathly silence followed this faux pas.","heading[2]":"a stupid mistake","display[9]":"blunder","definition[12]":"a stupid mistake caused by not thinking carefully enough about what you are saying or doing, which could have serious results","example[45]":"In a serious blunder by the hospital, two babies were sent home with the wrong parents.","display[10]":"gaffe","definition[13]":"an embarrassing and stupid mistake made in a social situation or in public","example[46]":"a serious gaffe in her speech about immigration","display[11]":"howler","definition[14]":"a very bad mistake, especially one that shows you do not know something, and that often makes other people laugh","example[47]":"Photographers should be careful of making classic howlers, such as having a tree grow out of your subject’s head.","display[12]":"cock-up","definition[15]":"a silly mistake when you are doing something – a very informal use","example[48]":"They made a cock-up with the bill.","example[49]":"The government is anxious to avoid any more cock-ups.","past_tense[0]":"mistook","past_participle[0]":"mistaken","definition[16]":"to understand something wrongly","example[50]":"She mistook my meaning entirely.","example[51]":"Ken mistook her concern, thinking she was interested in him for another reason."}