{"word[0]":"joke","definition[0]":"something that you say or do to make people laugh, especially a funny story or trick","example[0]":"I couldn’t go out with someone for a joke, could you?","example[1]":"a joke about absent-minded professors","note[0]":"joke about","collocation[0]":"tell a joke","example[2]":"He was always telling jokes and making people laugh.","collocation[1]":"make a joke","example[3]":"He was cracking jokes and seemed relaxed and happy.","collocation[2]":"get a joke","example[4]":"She never gets my jokes.","collocation[3]":"laugh at somebody’s jokes","example[5]":"A few people laughed at his jokes, but some didn’t find them funny.","collocation[4]":"play a joke on somebody","example[6]":"John’s always playing jokes on his brothers.","collocation[5]":"a good/funny joke","example[7]":"I heard a really good joke the other day.","collocation[6]":"a bad/terrible joke","example[8]":"Dad was known for his bad jokes.","collocation[7]":"a cruel/sick joke","example[9]":"When I heard he had cancer, at first I thought it was some kind of sick joke.","collocation[8]":"an old joke","example[10]":"It reminded me of the old joke about the chicken crossing the road.","collocation[9]":"a dirty joke","example[11]":"A bunch of boys were telling dirty jokes.","collocation[10]":"a practical joke","example[12]":"What the workers think is a practical joke, management might regard as sabotage.","collocation[11]":"an inside/a private joke","example[13]":"After I’d worked there a while, I started to understand some of the inside jokes.","collocation[12]":"a running joke","example[14]":"It’s a running joke in our house that my husband can never find his keys.","collocation[13]":"a joke falls flat","example[15]":"His practical jokes usually fell flat.","collocation[14]":"be the butt of a joke","example[16]":"Somehow he’d become the butt of all his classmates’ jokes.","definition[1]":"a funny story that you tell people to make them laugh","example[17]":"We all sat around telling jokes.","example[18]":"Have you heard the joke about the man who found a frog in his soup?","display[0]":"funny story","definition[2]":"a short story that someone tells to make people laugh","example[19]":"He was one of those guys who are good at telling funny stories at dinner parties.","display[1]":"gag","definition[3]":"a short joke, especially one told by a professional entertainer","example[20]":"He’s a great comedian, with plenty of good gags.","display[2]":"one-liner","definition[4]":"a very short joke or funny remark","example[21]":"There are some memorable one-liners in the film.","display[3]":"wisecrack","definition[5]":"a funny remark or reply, especially one that is said in a very quick and clever way","example[22]":"It’s a comic masterpiece, packed with classic wisecracks.","display[4]":"pun","definition[6]":"a joke made by mixing up two different meanings of the same word, or two words with the same sound","example[23]":"a pun on the words ‘bear’ and ‘bare’","example[24]":"The title of the book is a witty play on words.","example[25]":"Shakespeare used a lot of puns for comic effect.","display[5]":"quip","definition[7]":"something funny and clever that someone says","example[26]":"He made some friendly quip about hair loss, and everyone laughed.","definition[8]":"to say things that are intended to be funny and that you do not really mean","example[27]":"Calm down, Jo, I was only joking.","example[28]":"I never joke about money.","example[29]":"As we left the hospital, he joked with the staff.","note[1]":"joke with","example[30]":"His father joked that his son was trying to put him out of business.","note[2]":"joke that"}