{"word[0]":"rent","definition[0]":"to regularly pay money to live in a house or room that belongs to someone else, or to use something that belongs to someone else","example[0]":"Most students rent rooms in their second year.","example[1]":"I’d rather have my own house than rent.","example[2]":"Some farmers rent their land from the council.","note[0]":"rent something from somebody","definition[1]":"to let someone live in a house, room etc that you own, or use your land, in return for money","example[3]":"She rents out two rooms to students.","note[1]":"rent something (out) to somebody","definition[2]":"to pay money for the use of something for a short period of time","example[4]":"Will you rent a car while you’re in Spain?","heading[0]":"to pay money to use something","definition[3]":"to pay money to use a house, room, vehicle, piece of equipment, area of land etc","example[5]":"He rented a room in a house on the Old Kent Road.","example[6]":"They flew out to New York and rented a car at the airport.","display[0]":"hire","definition[4]":"to pay money to use a car or a piece of clothing or equipment for a short period of time","example[7]":"Why don't we hire a van for the day?","example[8]":"You can hire suits for weddings.","display[1]":"lease","definition[5]":"to have a legal agreement under which you pay money to a person or company in order to use a building, area of land, vehicle, piece of equipment etc for a fixed period of time","example[9]":"They leased the offices from an American company.","example[10]":"The car is leased from BMW.","heading[1]":"to allow somebody to use something for money","display[2]":"rent/rent something out","definition[6]":"to allow someone to use a house, room, vehicle, piece of equipment, area of land etc in return for money","example[11]":"She rents the flat out to students.","display[3]":"let/let something out","definition[7]":"to allow someone to use a room, house, building etc in return for money","example[12]":"Some people don't want to let rooms to foreigners.","example[13]":"They let the house out while they were on holiday.","display[4]":"lease/lease something out","definition[8]":"to make a legal agreement which allows a person or company to use something that you own for a fixed period of time","example[14]":"Santa Clara ' s Redevelopment Agency leased the existing city golf course to developers.","definition[9]":"the money that someone pays regularly to use a room, house etc that belongs to someone else","example[15]":"I pay the rent at the beginning of every month.","example[16]":"an annual rent of £8,000","note[2]":"rent of","definition[10]":"an amount of money that you pay to use a car, boat etc that belongs to someone else","example[17]":"The rent was only $20 an hour.","definition[11]":"a large tear in something made of cloth","example[18]":"huge rents in the curtains","form[0]":"ADJECTIVES/NOUN + rent","example[19]":"Rents in the city centre are very high.","example[20]":"Our workers get low rents and other advantages.","collocation[0]":"exorbitant","example[21]":"Some landlords charge exorbitant rents.","collocation[1]":"fixed","example[22]":"The rent is fixed for three years.","collocation[2]":"affordable","example[23]":"The government plans to provide more homes at affordable rents.","collocation[3]":"the annual/monthly/weekly rent","example[24]":"Our annual rent is just over $15000.","collocation[4]":"ground rent","example[25]":"There is an additional ground rent of £30 per month.","collocation[5]":"a peppercorn rent","example[26]":"The colonel let us have the cottage for a peppercorn rent.","collocation[6]":"back rent","example[27]":"Mrs Carr said she is still owed several thousand dollars in back rent.","collocation[7]":"the rent is due","example[28]":"The rent is due at the beginning of the week.","collocation[8]":"pay the rent","example[29]":"She couldn’t afford to pay the rent.","collocation[9]":"increase/raise the rent","example[30]":"The landlord wants to put up the rent.","collocation[10]":"fall behind with the rent/get behind on the rent","example[31]":"You could be evicted if you fall behind with the rent.","collocation[11]":"collect the rent","example[32]":"His job is to collect the rents from the tenants.","collocation[12]":"the rent increases/goes up","example[33]":"The rent has gone up by over 50% in the last two years.","form[1]":"rent + NOUN","collocation[13]":"a rent increase","example[34]":"How can they justify such big rent increases?","collocation[14]":"rent arrears","example[35]":"The most common debts were rent arrears.","collocation[15]":"a rent book","definition[12]":"the past tense and past participle of rend","definition[13]":"to pay a regular amount of money for the use of something such as a house or office","example[36]":"The company had been renting for seven years before buying a 13,000-square-foot headquarters.","example[37]":"Businesses can rent PCs to alleviate peak workloads.","example[38]":"Who do you rent the shop from?","definition[14]":"to allow someone to use something in return for payment","example[39]":"video stores that rent Nintendo games","example[40]":"the lucrative business of renting out trailers and trucks","example[41]":"A New York dealer rented an Avis car to an unauthorized driver.","note[3]":"rent something to somebody","example[42]":"Many people trying to sell their second homes have decided to rent them out to tourists instead.","definition[15]":"to pay money for the use of something owned by someone else for a short period of time","example[43]":"Travelers prefer to rent cars with low mileage.","definition[16]":"if a house, office etc rents at or rents for a particular amount of money, that is how much it costs to use it","example[44]":"The new units are renting for £350 a month or less.","definition[17]":"money paid for the use of a house, office etc","example[45]":"Commercial rents have decreased significantly over the last few years.","definition[18]":"available to be rented","example[46]":"There is a lack of affordable housing for rent."}