{"word[0]":"enemy","plural[0]":"enemies","definition[0]":"someone who hates you and wants to harm you","example[0]":"She’s a dangerous enemy to have.","example[1]":"Cats and dogs have always been natural enemies.","example[2]":"an old enemy of her father","example[3]":"the unforgettable sight of the president shaking hands with his sworn enemy (=an enemy you will always hate)","example[4]":"a ruthless businessman who made a lot of enemies","note[0]":"make an enemy (of somebody)","example[5]":"I wouldn’t wish this on my worst enemy.","note[1]":"somebody’s worst enemy","definition[1]":"someone who opposes or competes against you","example[6]":"political enemies","example[7]":"He was imprisoned for being ‘an enemy of the revolution’.","definition[2]":"the country against which your country is fighting in a war","example[8]":"He was accused of collaboration with the enemy.","example[9]":"a town behind enemy lines","note[2]":"enemy forces/aircraft/territory etc","explanation[0]":"The enemy is usually followed by a singular verb","example[10]":"The enemy was defeated","example[11]":"The enemy were defeated","definition[3]":"something that people think is harmful or damaging","example[12]":"The usual enemies, cigarettes and alcohol, are targeted for tax rises.","example[13]":"The common enemy that united them was communism.","definition[4]":"if one thing is the enemy of another, the second thing cannot exist because the first thing destroys it","example[14]":"Boredom is the enemy of learning.","collocation[0]":"a great enemy","example[15]":"Henry prepared to fight his great enemy, the king of France.","collocation[1]":"a main/biggest/greatest enemy","example[16]":"Terrorism is our country’s main enemy.","collocation[2]":"an arch enemy","example[17]":"The comic book character Lex Luthor is Superman’s arch enemy.","collocation[3]":"bitter enemies","example[18]":"When these former friends quarrelled over money, they became bitter enemies.","collocation[4]":"sworn enemies","example[19]":"The men have been sworn enemies for many years.","collocation[5]":"a formidable enemy","example[20]":"The North Vietnamese army proved to be a formidable enemy.","collocation[6]":"deadly enemies","example[21]":"France and Germany, once deadly enemies, are now partners in the European Union.","collocation[7]":"an old/traditional enemy","example[22]":"In 1548, Scotland moved towards an alliance with her traditional enemy, England.","collocation[8]":"a common enemy","example[23]":"We must work together against the common enemy.","collocation[9]":"a political enemy","example[24]":"the prime minister’s political enemies","collocation[10]":"make enemies","example[25]":"During her long and turbulent career, she made many enemies.","collocation[11]":"defend/protect yourself from your enemies","example[26]":"Our country has a right to protect itself from its enemies.","collocation[12]":"defeat the enemy","example[27]":"We will never defeat our enemies unless we stop fighting each other.","collocation[13]":"an enemy force","example[28]":"The town is occupied by enemy forces.","collocation[14]":"an enemy position","example[29]":"General Hunt ordered an air strike on the enemy positions.","collocation[15]":"behind enemy lines","example[30]":"Men from the First Airborne Division were dropped behind enemy lines.","definition[5]":"someone who does not like you because you have had a big disagreement with them in the past or someone who opposes you in business or politics","example[31]":"If that’s how he treats his friends, I’d hate to be his enemy.","example[32]":"In business, it’s best not to make too many enemies.","display[0]":"adversary","definition[6]":"an enemy","example[33]":"When he retired, he was replaced by his old adversary.","example[34]":"He made the fatal mistake of underestimating his adversary.","display[1]":"foe","example[35]":"A guard called out ‘Who goes there – friend or foe?’","example[36]":"his former foes","display[2]":"arch enemy","definition[7]":"someone’s main enemy","example[37]":"In the movie, Batman goes into battle with his arch enemy the Joker.","display[3]":"opponent","definition[8]":"someone you are competing against, for example in a sports game, competition, or election","example[38]":"You win the game if you are left with more cards than your opponent.","example[39]":"He is admired even by his political opponents.","display[4]":"nemesis","definition[9]":"an enemy or opponent that is impossible to defeat – a rather formal use","example[40]":"In the final, he met his old nemesis, Rafael Nadal.","heading[0]":"country/army","definition[10]":"a country or army that you are fighting against in a war","example[41]":"Soldiers who were captured by the enemy suffered terribly.","example[42]":"The Russian Army were a formidable foe."}