{"word[0]":"past","signpost[0]":"previous","definition[0]":"done, used, or experienced before now","example[0]":"Judging by her past performance, Jane should do very well.","example[1]":"From past experience she knew that it was no use arguing with him.","example[2]":"Study some past exam papers to get an idea of the questions.","signpost[1]":"recent","definition[1]":"used to refer to a period up until now","example[3]":"the events of the past year","example[4]":"During the past two weeks, 12 people have died of the disease.","example[5]":"She has been feeling tired for the past few days.","signpost[2]":"finished","definition[2]":"finished or having come to an end","example[6]":"Winter is past and spring has come at last.","example[7]":"writers from past centuries","example[8]":"a tradition rooted in times long past","definition[3]":"having held a particular position in the past or achieved a particular honour in the past","example[9]":"a celebration for past and present employees of the newspaper","example[10]":"Bruce Jenner, a past Olympic champion","example[11]":"a past president of the golf club","note[0]":"past president/member/winner etc","definition[4]":"relating to the past tense","definition[5]":"later than a particular time","example[12]":"It’s ten past nine.","example[13]":"I should be finished by half past  (=30 minutes after the hour).","example[14]":"It was past midnight when the party ended.","example[15]":"Come on Annie, it’s long past your bedtime.","definition[6]":"further than a particular place","example[16]":"The hospital’s just up this road, about a mile past the school.","example[17]":"There are parking spaces over there, just past (=a little further than) the garage.","definition[7]":"up to and beyond a person or place, without stopping","example[18]":"She waved as she drove past.","example[19]":"Will you be going past my house on your way home?","example[20]":"Monica hurried straight past me and down the steps.","note[1]":"straight/right past","definition[8]":"if a period of time goes past, it passes","example[21]":"Weeks went past without any news.","example[22]":"The hours seemed to fly past.","definition[9]":"beyond or no longer at a particular point or stage","example[23]":"The roses were already past their best.","example[24]":"Reid never really got past the stage of copying other artists.","example[25]":"a pot of yoghurt well past its sell-by date","example[26]":"an Italian singer who was then past her prime  (=no longer strong and active)","example[27]":"I’m past caring about my appearance  (=I do not care about it anymore).","definition[10]":"the past life or existence of someone or something","example[28]":"At some time in its past the church was rebuilt.","example[29]":"The woman who ran the bar had a very shady past (=events in her past which might be considered bad).","collocation[0]":"the recent past","example[30]":"The optimistic economic climate of the recent past has gone.","collocation[1]":"the distant/remote past","example[31]":"Rivers of molten lava clearly flowed here in the distant past.","collocation[2]":"the immediate past","example[32]":"In order to understand the present, we must look at the immediate past.","collocation[3]":"forget the past","example[33]":"Forget the past and focus on the future.","collocation[4]":"be living in the past","example[34]":"You’ve got to stop living in the past.","collocation[5]":"be/become a thing of the past","example[35]":"We hope that smoking will become a thing of the past.","collocation[6]":"a break with the past","example[36]":"These policies are a break with the past.","collocation[7]":"in the dim and distant past","example[37]":"I think she sang Ireland's entry in the Eurovision Song Contest sometime in the dim and distant past.","display[0]":"in the past","definition[11]":"at a time before now, especially a long time ago","example[38]":"In the past, most children didn’t go to school at all.","example[39]":"We had a big argument, but it’s all in the past now.","display[1]":"in those days/in the old days","definition[12]":"a long time ago in your life, or in your parents’ or grandparents’ lives, when things were different","example[40]":"£5 was a lot of money in those days.","example[41]":"In the old days, only very rich people had cars.","display[2]":"at one time","definition[13]":"used for saying that something was true in the past, but is not now","example[42]":"At one time there were six schools in the village.","example[43]":"I would have agreed with you at one time.","display[3]":"back in the day","definition[14]":"used when you are talking about a time in the past, especially one that you remember as being very good","example[44]":"I loved Blondie back in the day.","example[45]":"Back in the day, everyone would meet at the boys’ club."}