{"word[0]":"vacation","definition[0]":"a holiday, or time spent not working","example[0]":"We’re planning a vacation in Europe.","example[1]":"He’s on vacation this week.","note[0]":"on vacation","example[2]":"We’re planning to go on vacation soon.","definition[1]":"the number of days, weeks etc that you are allowed as paid holiday by your employer","example[3]":"How much vacation do you get at your new job?","example[4]":"I think I have four vacation days left.","example[5]":"Employees are entitled to four weeks’ paid vacation annually.","definition[2]":"one of the periods of time when a university is closed","note[1]":"the Christmas/Easter/summer/long vacation","definition[3]":"one of the periods of time when a school or university is closed","note[2]":"Christmas/spring/summer vacation","collocation[0]":"take/have a vacation","example[6]":"We usually take a vacation once a year.","collocation[1]":"go on vacation","example[7]":"I’m going on vacation next month.","collocation[2]":"need a vacation","example[8]":"You’re working too hard. You need a vacation.","collocation[3]":"spend a vacation","example[9]":"Where did you spend your vacation?","form[0]":"ADJECTIVES/NOUN + vacation","collocation[4]":"a summer vacation","example[10]":"What did you do on your summer vacation?","collocation[5]":"a family vacation","example[11]":"We had to cancel the family vacation.","collocation[6]":"a long vacation","example[12]":"She decided to take a long vacation.","collocation[7]":"a short vacation","example[13]":"a short vacation at the beach","collocation[8]":"a two-week/three-day etc vacation","form[1]":"vacation + NOUN","collocation[9]":"a vacation spot","example[14]":"The island is my favorite vacation spot.","collocation[10]":"a vacation day","example[15]":"You could take a sick day or a vacation day.","collocation[11]":"vacation plans","example[16]":"Do you have any vacation plans this summer?","definition[4]":"time you spend away from school or work","example[17]":"Are you taking a vacation this summer?","example[18]":"We met on holiday in Cyprus.","example[19]":"What are you doing in the school holidays?","display[0]":"holiday","definition[5]":"a day that is set by law, when no one has to go to work or school","example[20]":"the Thanksgiving holiday","example[21]":"New Year’s Day is a national holiday.","example[22]":"In 2002, there was an extra public holiday to mark the Queen’s golden jubilee.","example[23]":"the August bank holiday  (=day when all the banks and shops are closed – used in British English)","definition[6]":"a time when you stop working or studying in order to rest, or a short vacation from school","example[24]":"a ten-minute coffee break","example[25]":"Lots of college kids come to the beaches during the spring break.","definition[7]":"a time when you are allowed not to work","example[26]":"We get four weeks’ annual leave  (=paid time off work each year).","example[27]":"He has been taking a lot of sick leave (=time off work because you are ill) recently.","example[28]":"Angela is on maternity leave  (= time off work when having a baby).","example[29]":"He was given compassionate leave (=time off work because someone close to you has died, is very ill etc) to go to his father’s funeral.","display[1]":"sabbatical","definition[8]":"a period when someone, especially a teacher, stops doing their usual work in order to study or travel","example[30]":"She was on sabbatical for six months.","example[31]":"I’m thinking of taking a sabbatical.","display[2]":"furlough","definition[9]":"a period of time when a soldier or someone working in another country can return to their own country as a holiday","example[32]":"While on furlough, he and his girlfriend got married.","display[3]":"R & R","definition[10]":"(rest and relaxation) a holiday, especially one given to people in the army, navy etc after a long period of hard work or during a war","example[33]":"Soldiers in Vietnam were taken to Hawaii for R & R.","definition[11]":"to go somewhere for a holiday","example[34]":"The Bernsteins are vacationing in Europe.","note[3]":"vacation in/at","definition[12]":"a period of time when people are on holiday or not working","example[35]":"Most factories close for a few weeks in the summer for vacations and plant maintenance.","example[36]":"Mr Williams wason vacation and couldn’t be reached.","definition[13]":"a period of time when universities and certain law courts or other organizations are closed","example[37]":"The process may take longer if the timetable is interrupted by a court vacation."}