{"word[0]":"coincidence","definition[0]":"when two things happen at the same time, in the same place, or to the same people in a way that seems surprising or unusual","example[0]":"‘I’m going to Appleby tomorrow.’ ‘What a coincidence! I’m going there too.’","example[1]":"It was sheer coincidence that we were staying in the same hotel.","note[0]":"sheer/pure coincidence","example[2]":"I think it is more than coincidence that all the complaints have come from the same group of people.","note[1]":"not a coincidence/more than coincidence","example[3]":"By coincidence, John and I both ended up at Yale.","note[2]":"by coincidence","definition[1]":"when two ideas, opinions etc are the same","example[4]":"a coincidence of interest between the mining companies and certain politicians","note[3]":"coincidence of","example[5]":"It was pure coincidence that we were on the same plane.","collocation[0]":"mere coincidence","example[6]":"Is it mere coincidence that they always seem to employ men?","collocation[1]":"a happy/lucky/fortunate coincidence","example[7]":"It was just a happy coincidence that he was there too.","collocation[2]":"an unfortunate coincidence","example[8]":"By a very unfortunate coincidence, she didn’t get either of his emails.","collocation[3]":"a strange/curious coincidence","example[9]":"What a strange coincidence that you were both living in Bangkok at the same time.","collocation[4]":"a remarkable/amazing/extraordinary coincidence","example[10]":"What an extraordinary coincidence meeting you here!","collocation[5]":"it is a coincidence that","example[11]":"It was a remarkable coincidence that two people with the same name were staying at the hotel.","collocation[6]":"it is not a/no coincidence that","example[12]":"It is no coincidence that the Government made the announcement today.","collocation[7]":"be more than (a) coincidence","example[13]":"When I saw him a third time, I realized it was more than just coincidence.","collocation[8]":"a string/series/set of coincidences","example[14]":"The accident happened because of a string of unfortunate coincidences."}