{"word[0]":"then","definition[0]":"at a particular time in the past or future","example[0]":"I wish I had known then what I know now.","example[1]":"It was then that I realised she’d tricked me.","example[2]":"He started his career in St Petersburg – or Leningrad as it then was.","example[3]":"They met in 1942 and from then on (=starting at that time) they were firm friends.","example[4]":"Silently she closed the door. Just then she heard a noise.","example[5]":"I was paid £1,000, which was a lot of money back then (=a long time ago when things were different) in the 1950s.","example[6]":"They’re sending out the results next week, so we won’t know anything until then.","note[0]":"by/until/since then","example[7]":"It was late evening when the doctor arrived, and by then it was too late.","example[8]":"That was in 1970. Since then the place has changed a lot.","definition[1]":"used to say what happens next or what you do next","example[9]":"Mix the flour and butter, then add the eggs.","example[10]":"Byron travelled to Italy and then to Greece.","definition[2]":"used when saying what the result of a situation or action will be","example[11]":"If you won’t tell him, then I will.","example[12]":"Start off early, then you won’t have to rush.","definition[3]":"used when you think that something is probably true because of what you know about the situation","example[13]":"Still in your pyjamas? Have you just got out of bed then?","definition[4]":"used at the beginning of a conversation or activity","example[14]":"Now then, what would you like to do today?","example[15]":"Right then, shall we start?","definition[5]":"used at the end of a conversation, especially to show that something has been agreed","example[16]":"Good, that’s settled then. We’ll all meet here next Wednesday.","example[17]":"Okay then, I’ll see you at work.","definition[6]":"used to show that you are saying something because of what someone has just said","example[18]":"‘We’re late.’ ‘We’d better hurry, then.’","example[19]":"‘Friday’s no good.’ ‘Then how about Saturday?’","definition[7]":"used to add something to what you have just mentioned","example[20]":"We have to invite your parents and my parents, and then there’s your brother.","definition[8]":"used to refer back to what you have just been talking about","example[21]":"This then was the situation facing the government at the end of the war.","definition[9]":"used when mentioning the person who had a particular job, title, or position at a time in the past","example[22]":"a visit to China by the then US President, Richard Nixon"}