{"word[0]":"alliance","definition[0]":"an arrangement in which two or more countries, groups etc agree to work together to try to change or achieve something","example[0]":"The companies have formed an alliance to market the product.","note[0]":"make/enter into/form/forge an alliance","example[1]":"Britain’s military alliance with her NATO partners","note[1]":"alliance with","example[2]":"the possibility of a political alliance between the two parties","note[2]":"alliance between","definition[1]":"a group of two or more countries, groups etc who work together to achieve something","example[3]":"independent organizations and alliances","definition[2]":"a close relationship, especially a marriage, between people","collocation[0]":"a military alliance","example[4]":"NATO has been the most successful military alliance in history.","collocation[1]":"a political alliance","example[5]":"They agreed not to make any political alliance with the East.","collocation[2]":"a strategic alliance","example[6]":"Strategic alliances are being forged with major European companies.","collocation[3]":"an electoral alliance","example[7]":"The weaker Liberal Democratic party was now considering an electoral alliance with Labour.","collocation[4]":"shifting alliances","example[8]":"the shifting alliances in the Middle East","collocation[5]":"a strong/close alliance","example[9]":"He forged a strong alliance between his state and the church.","collocation[6]":"a loose alliance","example[10]":"A loose alliance of opposition groups formed in 1990.","collocation[7]":"make/form an alliance","example[11]":"In 1902, Japan made an alliance with Britain.","collocation[8]":"go into/enter into an alliance with somebody","example[12]":"Spain then entered into an alliance with France.","collocation[9]":"forge an alliance","example[13]":"They won the election by forging an alliance with the Social Democrats.","collocation[10]":"break (off) an alliance","example[14]":"The Athenians broke off the alliance with Sparta and made alliances with Argos and Thessaly.","definition[3]":"an agreement between two or more organizations to work together","example[15]":"The two insurance companies agreed to form an alliance.","example[16]":"an alliance between the two media groups","example[17]":"The firm said it may need to form an alliance with another company to survive.","definition[4]":"if two or more organizations are in alliance with each other, they work together","example[18]":"The Japanese car company said it would only enter Eastern Europe in alliance with a European manufacturer."}