{"definition[0]":"to shut something in order to cover an opening, or to become shut in this way","example[0]":"Would you mind if I closed the window?","example[1]":"She closed the curtains.","example[2]":"Let me do the car door – it won’t close properly.","example[3]":"Beth closed her eyes and tried to sleep.","example[4]":"She heard the door close behind her.","signpost[0]":"move parts together","definition[1]":"to move the parts of something together so that there is no longer a space between them","example[5]":"Anne closed her book and stood up.","signpost[1]":"shut for period of time","definition[2]":"if a shop or building closes, or you close it, it stops being open to the public for a period of time","example[6]":"The shops close at six.","example[7]":"Harry usually closes the store completely when he goes on vacation.","signpost[2]":"stop operating","definition[3]":"if a company, shop etc closes, or you close it, it stops operating permanently","synonym[0]":"shut down","example[8]":"We have reluctantly decided to close the factory.","example[9]":"The shop closed down some time last year.","definition[4]":"to end or to make something end, especially in a particular way","example[10]":"In her closing remarks, the judge urged the jury to consider the facts only.","note[0]":"closing remarks","example[11]":"I will now close the meeting by asking you to join me in a final toast.","note[1]":"close something with/by etc","example[12]":"The movie closes with an emotional reunion in Prague.","note[2]":"close with","signpost[3]":"in money markets","definition[5]":"to be worth a particular amount of money at the end of a day’s trading (=the buying and selling of shares) on the stock exchange","example[13]":"The dollar closed at 64p against the pound.","note[3]":"close at","example[14]":"Their shares closed 27p up  (=worth 27p more).","signpost[4]":"offer finishes","definition[6]":"to finish on a particular date","example[15]":"Our special offer closes on June 3.","signpost[5]":"make distance/difference smaller","definition[7]":"to make the distance or difference between two things smaller","example[16]":"an attempt to close the gap between the rich and poor","example[17]":"The other car was closing on us fast.","note[4]":"close on","signpost[6]":"make something unavailable","definition[8]":"to make taking part in an activity or using an opportunity no longer possible","example[18]":"Bidding for the painting will close on Friday.","example[19]":"The country has now closed its borders to all foreign nationals  (=will not let foreigners in).","example[20]":"The legislation aims to close a lot of legal loopholes.","signpost[7]":"hold something","definition[9]":"if someone’s hands, arms etc close around something, or are closed around something, they hold it firmly","example[21]":"Her left hand closed over his arm.","note[5]":"close (something) around/round/over etc something","example[22]":"She closed her hand tightly around her bag.","definition[10]":"if a wound closes, or if someone closes it, the edges grow together again or are sewn together","example[23]":"The surgeon closed the incision neatly.","explanation[0]":"Close belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[1]":"In this sentence, ‘the door’ is the object of close","example[24]":"She closed the door","explanation[2]":"In this sentence, ‘the door’ is the subject of close","example[25]":"The door closed","definition[11]":"to stop being open, or to make something stop being open. You use close and shut especially about your eyes, your mouth, a door, a window, or a container","example[26]":"Can I close the window?","example[27]":"Her eyes slowly closed.","example[28]":"He closed the door gently, so as not to wake the children.","definition[12]":"to close something. Shut sometimes has a feeling of doing something quickly and firmly, whereas close sounds more careful","example[29]":"He shut the door with a loud bang.","example[30]":"Shut your eyes and go to sleep.","display[0]":"slam","definition[13]":"to close a door or lid quickly and noisily, especially because you are angry","example[31]":"She left the room, slamming the door behind her.","display[1]":"draw the curtains","definition[14]":"to close curtains by pulling them across a window","example[32]":"The curtains were still drawn at ten o'clock in the morning.","display[2]":"put the lid on something","definition[15]":"to close a container by putting a lid onto it","example[33]":"Did you put the lid on the cookie jar?","display[3]":"seal","definition[16]":"to close something so that no air or water can get in or out","example[34]":"In this experiment, the chamber must be completely sealed.","comparative[0]":"closer","superlative[0]":"closest","definition[17]":"not far from someone or something","example[35]":"If you need to buy bread or milk, the closest shop is about a mile away.","example[36]":"His eyes were small and close together.","example[37]":"There are several accounts of dolphins living in close proximity to humans  (=close to humans).","example[38]":"The victim had been shot at close range (=from very close).","example[39]":"Susan sat on a chair close to the window.","note[6]":"close to","example[40]":"I don’t mind where we go on vacation as long as it’s close to a beach.","signpost[8]":"near in time","definition[18]":"near to something in time","example[41]":"It was close to 1:15 a.m.","example[42]":"Our birthdays are quite close together.","note[7]":"close together","signpost[9]":"likely to happen","definition[19]":"seeming very likely to happen or very likely to do something soon","example[43]":"The two countries are close to signing a peace agreement.","note[8]":"close to doing something","example[44]":"We’re close to clinching the deal.","example[45]":"The old dog could barely whimper and seemed close to death.","note[9]":"close to death/tears/despair etc","example[46]":"The prosecution’s main witness was close to tears as she described the assault.","signpost[10]":"like/love","definition[20]":"if two people are close, they like or love each other very much","example[47]":"My brother and I are very close.","example[48]":"Fiona and I have always been close friends.","example[49]":"I felt closer to Rob that evening than ever before.","signpost[11]":"similar","definition[21]":"very similar to each other","example[50]":"Fitt was the closest thing to a socialist in the party.","example[51]":"Their newest model bears a close resemblance to (=is very similar to) that of their rival competitor.","example[52]":"When I saw Henry with another woman I felt something close to jealousy.","signpost[12]":"careful","definition[22]":"looking at, thinking about, or watching something very carefully","note[10]":"take/have/get a close look (at something)","example[53]":"She lifted up Jenny’s silver medallion to take a closer look.","example[54]":"You could have improved your answers by closer attention to detail.","example[55]":"Don’t worry, I’ll keep a close eye on the kids.","note[11]":"keep a close watch/eye on","signpost[13]":"number/amount","definition[23]":"if a number or amount is close to another number or amount, it is not much higher or lower than it","example[56]":"We don’t know the exact figures, but about 10,000 might be a close approximation  (=close to the actual figure).","example[57]":"Inflation is close to 7 percent.","signpost[14]":"competition/election etc","definition[24]":"finishing or being played, fought etc with both sides almost equal","note[12]":"a close second/third etc (=very nearly first, second etc)","example[58]":"It was a close game that could have gone either way.","example[59]":"The result is too close to call (=so close that it is impossible to know who will win).","signpost[15]":"very nearly bad","definition[25]":"used when you have only just managed to avoid something bad, dangerous, or embarrassing happening","example[60]":"‘Phew, that was close, ’ Frank said as he swerved to avoid the cyclist.","example[61]":"United had a close shave when Liverpool almost scored.","note[13]":"a close call/thing/shave","definition[26]":"very nearly getting, finding, or achieving something","example[62]":"At this point, the investigators were closer to the truth than they realized.","signpost[16]":"work/talk together","definition[27]":"relating to a situation in which people work well with each other or talk to each other often","example[63]":"He retained very close links with France throughout his life.","example[64]":"What we need now is closer cooperation between the club and supporters.","signpost[17]":"with little space","definition[28]":"with little or no space around something or between things","example[65]":"The horses are always eager for exercise after the close confinement of the stables.","example[66]":"The shoe is a close fit  (=there is no space around the foot).","example[67]":"I find it difficult to read such close print  (=with letters printed so close together).","definition[29]":"uncomfortably warm because there seems to be no air","example[68]":"The weather that night was hot and close, with a hint of thunder in the distance.","signpost[18]":"unwilling to talk about something","definition[30]":"unwilling to tell people about something","synonym[1]":"secretive","example[69]":"You’re very close about your work, aren’t you?","note[14]":"close about","signpost[19]":"unwilling to spend money","definition[31]":"not generous","example[70]":"You won’t get a penny out of Jack – he’s very close with his money.","heading[0]":"– Meaning 6: looking at, thinking about, or watching something very carefully","collocation[0]":"take/get a close look","example[71]":"She moved  forward to take a close look at the painting.","collocation[1]":"keep a close eye/watch on somebody/something","example[72]":"They have to keep a close eye on their finances.","collocation[2]":"a close examination","example[73]":"A closer examination of the facts soon solved the mystery.","collocation[3]":"a close study","example[74]":"Their research involved a close study of two communities.","collocation[4]":"close attention","example[75]":"You will lose weight if you combine exercise with close attention to your diet.","collocation[5]":"close scrutiny","example[76]":"The investigation included close scrutiny of the images on CCTV.","collocation[6]":"close inspection","example[77]":"Closer inspection revealed that the rocks were from an earlier period.","collocation[7]":"close supervision","example[78]":"Initially there will be close supervision of the trainee.","definition[32]":"not far away","example[79]":"Come a little closer, so you can see better.","example[80]":"Her father lives quite close by.","example[81]":"They were sitting close together on the couch.","example[82]":"A variety of good restaurants are close at hand (=very near).","example[83]":"James heard footsteps close behind him.","example[84]":"Ronnie sped off, with his brother’s car following close behind.","example[85]":"We must all stay close.","note[15]":"stay/keep close","example[86]":"He drew her close to him.","note[16]":"hold/draw somebody close","definition[33]":"near to the surface of something","example[87]":"An electric razor doesn’t really shave as close as a blade.","definition[34]":"the end of an activity or of a period of time","example[88]":"At the close of trade, the Dow Jones index was 1.92 points down.","example[89]":"The monsoon season was drawing to a close (=ending).","example[90]":"The event came to a close (=finished) with a disco.","example[91]":"Finally the meeting was brought to a close (=ended).","definition[35]":"used in street names for a road that has only one way in or out","example[92]":"Take a left turn into Brown’s Close.","definition[36]":"the area and buildings surrounding a cathedral","definition[37]":"if a company, shop etc closes or someone closes it, it stops operating permanently","example[93]":"Banks are closing down branches by the hundred.","definition[38]":"if a shop or building closes or someone closes it, it stops being open to the public for a period of time","example[94]":"The shops close at 6.","definition[39]":"if a share or currency closes at a particular value, it is worth that amount at the end of the day’s trading on a particular market","example[95]":"Amazon shares closed down at $29.56 on the NASDAQ.","example[96]":"The pound closed up slightly at $1.90130.","example[97]":"Special offer closes June 3.","definition[40]":"to reach the point in a deal or sale where everyone involved agrees to it","example[98]":"The objective of the negotiation phase is to close the deal.","example[99]":"He had to lower his price in order to close the sale.","definition[41]":"to stop having a particular account with a bank","example[100]":"Mr Samuels agreed to close the account and transfer the money to a company account.","definition[42]":"to calculate the financial results at the end of a particular accounting period","example[101]":"On Friday the company closed the books on its fiscal first quarter.","definition[43]":"if an investor or dealer on a financial market closes a position, they buy or sell the stocks, shares, currencies etc that they have agreed to buy or sell, even if this means that they lose money","example[102]":"If a dealer buys a futures contract and its price declines, he buys another at a lower price rather than closing out his position.","definition[44]":"the end of the day’s activity, for example on the stockmarket or in a bank","example[103]":"At the close, the Dow Jones Industrial Average had climbed 17.49.","example[104]":"The dividend was payable to shareholders on the Register of Members at close of business on 7th May."}