{"word[0]":"repair","definition[0]":"to fix something that is damaged, broken, split, or not working properly","example[0]":"Dad was up the ladder, repairing the roof.","example[1]":"Where can I get my shoes repaired?","definition[1]":"to do something to remove harm that you have caused","example[2]":"Neil tried to repair the damage that his statements had caused.","definition[2]":"something that you do to fix a thing that is damaged, broken, or not working","example[3]":"The church tower is in need of repair.","example[4]":"They did a good repair job on the roof.","example[5]":"His job is to make minor repairs on all the machines.","note[0]":"make/carry out/do repairs","example[6]":"an extensive programme of building repairs","note[1]":"structural/housing/motorway etc repairs","example[7]":"repairs to the roads","note[2]":"repair to","example[8]":"Many of the paintings were beyond repair  (=so damaged that they could not be mended).","note[3]":"beyond repair","example[9]":"Is the bridge still under repair?","note[4]":"under repair","collocation[0]":"make/do a repair","example[10]":"I have done some repairs to the chair over the years.","collocation[1]":"carry out a repair","example[11]":"The school was closed for two months while repairs were carried out.","collocation[2]":"a minor repair","example[12]":"In the summer, we had to carry out some minor repairs to the roof.","collocation[3]":"a major repair","example[13]":"The car didn't need to have any major repairs done.","collocation[4]":"necessary/essential repairs","example[14]":"The Council has agreed to carry out essential repairs to the fencing.","collocation[5]":"urgent repairs","example[15]":"More than £40,000 is needed for urgent repairs to the tower.","collocation[6]":"extensive repairs","example[16]":"The boat needed extensive repairs.","collocation[7]":"structural repairs","example[17]":"A survey showed that the bridge needed significant structural repairs.","collocation[8]":"electrical repairs","example[18]":"Never attempt electrical repairs without unplugging the appliance.","collocation[9]":"running repairs","example[19]":"Farm workers made their own tools and carried out their own running repairs.","collocation[10]":"be under repair","example[20]":"We were staying at a hotel while our house was under repair.","collocation[11]":"be in need of repair","example[21]":"Many of the cottages were badly in need of repair.","collocation[12]":"be beyond repair/be damaged beyond repair","example[22]":"Unfortunately the engine is beyond repair.","form[0]":"repair + NOUN","collocation[13]":"repair work","example[23]":"The council has been responsible for appointing contractors to carry out this repair work.","collocation[14]":"a repair job","example[24]":"It looked like a simple repair job to me.","collocation[15]":"a repair shop/yard","example[25]":"He works in a shoe repair shop.","collocation[16]":"a repair kit","example[26]":"a bicycle repair kit","definition[3]":"to fix something that is damaged, broken, or not working properly","example[27]":"All the cranes were inspected and repaired before federal safety officials arrived.","definition[4]":"to try to remove the damage a mistake or wrong action has caused","example[28]":"The company is working hard to repair the damage to its reputation.","definition[5]":"the act of fixing something that is damaged, broken, or not working properly","example[29]":"Mainframe computers typically need repairs after 7,000 hours.","example[30]":"Much of the drilling equipment isin need of repair.","example[31]":"Many of the vehicles arebeyond repair (=so badly damaged they cannot be repaired).","example[32]":"The bridge is under repair (=being repaired) and a 5 mph restriction is in force.","definition[6]":"in good, bad, poor etc condition","example[33]":"The equipment was considered to be in sufficiently good repair to be useable."}