{"word[0]":"fortune","definition[0]":"a very large amount of money","example[0]":"He made a fortune selling property in Spain.","example[1]":"My first painting sold for £25, a small fortune then for an art student.","example[2]":"He died in poverty in 1947, but his art is worth a fortune.","example[3]":"The carpet must have cost a fortune.","example[4]":"It is quite easy to decorate your house without spending a fortune.","example[5]":"Her personal fortune was estimated at £37 million.","signpost[0]":"chance","definition[1]":"chance or luck, and the effect that it has on your life","example[6]":"I had the good fortune to work with a brilliant head of department.","example[7]":"Sickness or ill fortune could reduce you to a needy situation.","example[8]":"I felt it was useless to struggle against fortune.","signpost[1]":"what happens to you","definition[2]":"the good or bad things that happen in life","example[9]":"a downturn in the company’s fortunes","example[10]":"This defeat marked a change in the team’s fortunes.","example[11]":"The geographical position of the frontier fluctuated with the fortunes of war (=the things that can happen during a war).","collocation[0]":"make a fortune","example[12]":"His family amassed a fortune during that period.","collocation[1]":"make your fortune","example[13]":"She made her fortune in the cosmetics industry.","collocation[2]":"earn a fortune","example[14]":"He hopes to earn a fortune from his latest invention.","collocation[3]":"lose a fortune","example[15]":"He lost a fortune in an unwise business deal.","collocation[4]":"cost a fortune","example[16]":"It’ll cost a fortune if we go by taxi.","collocation[5]":"spend a fortune","example[17]":"You don’t have to spend a fortune giving your family healthy meals.","collocation[6]":"pay a fortune","example[18]":"We had to pay a fortune in rent.","collocation[7]":"inherit a fortune","example[19]":"He inherited a fortune of a million pounds from his uncle.","collocation[8]":"leave somebody a fortune","example[20]":"He left his wife a modest fortune.","form[0]":"ADJECTIVES/NOUN + fortune","collocation[9]":"a huge/vast/immense fortune","example[21]":"Timothy was the heir to a vast fortune.","collocation[10]":"a large/substantial/considerable fortune","example[22]":"His father, an oil magnate, amassed a large fortune.","collocation[11]":"a small fortune","example[23]":"He made a small fortune in the London property boom.","collocation[12]":"a personal/private fortune","example[24]":"She is one of the richest women in Britain, with an estimated personal fortune of £90 million.","collocation[13]":"a £20 million/$40 million etc fortune","example[25]":"She is believed to have a £25 million fortune.","collocation[14]":"be worth a fortune","example[26]":"The building itself is worth a fortune.","example[27]":"Working on the Stock Exchange, he made a fortune in just a few years.","example[28]":"It would cost a fortune to treat all the waste.","example[29]":"Producers pay stars as much as $5,000 per film, a small fortune in Pakistan.","definition[3]":"how successful or unsuccessful a person, business, or industry is at a particular time","example[30]":"The company suffered a sudden decline in its fortunes.","example[31]":"Over the last couple of years we have seen a change in the fortunes of the Japanese car industry."}