{"definition[0]":"someone who has a special skill or special knowledge of a subject, gained as a result of training or experience","example[0]":"Tests should be administered by a medical expert.","note[0]":"medical/technical/financial etc expert","example[1]":"He’s a world expert on marine mammals.","note[1]":"expert on","example[2]":"an expert in statistics","note[2]":"expert in","heading[0]":"GRAMMAR: Prepositions with expert","explanation[0]":"Someone is an expert on a subject or issue","example[3]":"He’s an expert on the Cold War","bad_example[0]":"He’s an expert of the Cold War","explanation[1]":"Someone is an expert in a field of study or an activity","example[4]":"She’s an expert in family law","bad_example[1]":"She’s an expert of family law","collocation[0]":"a leading expert","example[5]":"He is one of the country’s leading experts on Islam.","collocation[1]":"a world/international expert","example[6]":"She is a world expert on tropical diseases.","collocation[2]":"an independent expert","example[7]":"The authorities called in an independent expert to advise them.","collocation[3]":"a medical/legal/financial etc expert","example[8]":"Medical experts agree that screening can prevent deaths from breast cancer.","collocation[4]":"a so-called expert","example[9]":"There are many so-called experts willing to tell you how to bring up your children.","collocation[5]":"experts say something","example[10]":"Experts are saying that the economy is likely to improve towards the end of this year.","collocation[6]":"experts believe something","example[11]":"Legal experts believe that the evidence will not be accepted in court.","collocation[7]":"experts advise/recommend something","example[12]":"Most financial experts recommend that you don’t borrow money on credit cards.","collocation[8]":"talk to/consult an expert","example[13]":"If cracks appear in your house, you should consult an expert to find out what is causing the problem.","collocation[9]":"get/obtain/seek advice from an expert","example[14]":"Don’t make big financial decisions without first seeking advice from an expert.","collocation[10]":"a team/panel of experts","example[15]":"You can get advice from our panel of gardening experts.","definition[1]":"someone who has a lot of knowledge about something or skill at doing something","example[16]":"a computer expert","example[17]":"an expert on beetles","example[18]":"It’s best to ask an expert.","display[0]":"specialist","definition[2]":"an expert who has studied a particular medical or technical subject for a long time and knows much more about it than other people","example[19]":"She is a specialist in corporate finance.","example[20]":"My doctor sent me to see a heart specialist.","display[1]":"authority","definition[3]":"an expert whose knowledge and opinions are greatly respected","example[21]":"The professor is one of the world’s leading authorities on African art.","display[2]":"connoisseur","definition[4]":"an expert on food, art, literature, or design, who has had a lot of experience and knows when something is of very good quality","example[22]":"He was a connoisseur of fine wines.","example[23]":"His works are popular among connoisseurs.","display[3]":"buff","definition[5]":"someone who is very interested in a subject and knows a lot about it","example[24]":"a wine buff","example[25]":"Jazz buffs will be familiar with the band’s first album.","display[4]":"virtuoso","definition[6]":"an expert player or performer","example[26]":"The piece was played by violin virtuoso Pavel Sporcl.","example[27]":"a virtuoso pianist","definition[7]":"having a special skill or special knowledge of a subject","opposite[0]":"inexpert","example[28]":"He cast his expert eye on the gardener’s work.","example[29]":"The police are expert at handling situations like this in strict confidence.","note[3]":"expert on/in/at","definition[8]":"relating to or coming from an expert","example[30]":"Ministers depend on civil servants for expert advice.","heading[1]":"– Meaning 2: relating to or coming from an expert","collocation[11]":"expert advice","example[31]":"Get some expert advice before investing in a property.","collocation[12]":"expert opinion","example[32]":"Expert opinion on the matter is deeply divided.","collocation[13]":"expert evidence/testimony","example[33]":"Two doctors were called to give expert testimony at the inquiry.","collocation[14]":"expert knowledge","example[34]":"He has expert knowledge of the plants and animals in this area.","collocation[15]":"expert eye","example[35]":"To the expert eye, this is a beautiful example of early Roman pottery.","definition[9]":"someone who has a special skill or special knowledge of an area of work or study, usually as the result of many years experience","example[36]":"One of the functions of the marketing expert in commerce is to develop a clear idea of the target market.","example[37]":"You don’t have to be an expert in accountancy to use this software package.","note[4]":"expert in/on","definition[10]":"advice etc given by an expert","example[38]":"You should seek expert advice on this kind of investment."}