{"word[0]":"trouble","signpost[0]":"problems","definition[0]":"problems or difficulties","example[0]":"Recent stock market losses point to trouble ahead.","example[1]":"We’re having a lot of trouble with the new computer system.","note[0]":"trouble with","signpost[1]":"bad point","definition[1]":"used when saying what is bad about a person or situation or what causes problems","example[2]":"The trouble with you is that you don’t listen.","example[3]":"The trouble is there are too many people and not enough places.","example[4]":"But no one ever remembers – that’s the trouble.","example[5]":"You never think, that’s your trouble.","signpost[2]":"fighting","definition[2]":"fighting, violence, or violent behaviour","example[6]":"If the kids start to cause trouble, ask them to move on.","example[7]":"A handful of people came looking for trouble.","example[8]":"If you start any trouble, you’ll regret it.","example[9]":"There was crowd trouble before the match.","signpost[3]":"worries","definition[3]":"problems in your life which you are worried about","example[10]":"He poured out all his troubles to me  (=told me all about his problems).","signpost[4]":"effort","definition[4]":"an amount of effort and time that is needed to do something","example[11]":"They’ve obviously gone to a lot of trouble to arrange everything.","example[12]":"I find that making my own clothes is more trouble than it’s worth (=takes too much time and effort).","example[13]":"The teacher took the trouble to learn all our names on the first day.","note[1]":"take the trouble to do something","example[14]":"If you’d asked me first, I could have saved you the trouble.","note[2]":"save somebody the trouble (of doing something)","signpost[5]":"health","definition[5]":"a problem that you have with your health","example[15]":"He has trouble with his breathing.","example[16]":"He suffers from back trouble.","note[3]":"heart/stomach/skin etc trouble","signpost[6]":"machine/system","definition[6]":"when something is wrong with a machine, vehicle, or system","example[17]":"engine trouble","example[18]":"He had to retire from the race because of trouble with the gearbox.","collocation[0]":"have trouble","example[19]":"He is having trouble getting his message across to the voters.","collocation[1]":"have no trouble","example[20]":"We had no trouble finding her house.","collocation[2]":"cause trouble","example[21]":"I hope the delay hasn’t caused you any trouble.","collocation[3]":"there is trouble","example[22]":"There was some trouble at her office, but she didn’t say what it was.","collocation[4]":"mean/spell trouble","example[23]":"They are now much more competitive, which can only spell trouble for their rivals.","collocation[5]":"be asking for trouble","example[24]":"It’s asking for trouble to wear high-heeled shoes on a long walk.","collocation[6]":"avoid trouble","example[25]":"We avoid trouble by planning carefully.","collocation[7]":"big/great trouble","example[26]":"High interest rates spell big trouble for homeowners.","collocation[8]":"terrible trouble","example[27]":"I’ve been having terrible trouble sleeping.","collocation[9]":"endless trouble","example[28]":"They had endless trouble with the water supply.","collocation[10]":"serious trouble","example[29]":"I was having serious trouble knowing where to begin.","collocation[11]":"teething troubles","example[30]":"There were a lot of teething troubles in the first year.","collocation[12]":"what the trouble is","example[31]":"A couple of nurses rushed into the room to see what the trouble was.","collocation[13]":"without any/much trouble","example[32]":"The work was carried out without any trouble.","explanation[0]":"Trouble  is usually used as an uncountable noun    Trouble is not used with ‘a’","example[33]":"Are you having trouble with your car?","bad_example[0]":"Are you having a trouble with your car?","explanation[1]":"The plural form troubles is used when talking about worries or bad experiences that someone has","example[34]":"Tell me about all your troubles ","definition[7]":"if a problem troubles you, it makes you feel worried or upset","example[35]":"There is one thing that’s been troubling me.","example[36]":"They have been deeply troubled by the allegations.","example[37]":"His conscience troubled him.","signpost[7]":"inconvenience","definition[8]":"to say something or ask someone to do something which may use or waste their time or upset them","synonym[0]":"bother","example[38]":"I promise not to trouble you again.","example[39]":"I don’t want to trouble the doctor with it.","note[4]":"trouble somebody with something","example[40]":"I won’t trouble you with the details.","signpost[8]":"health problem","definition[9]":"if a medical problem troubles you, it causes you pain or problems","example[41]":"He is still being troubled by an ankle injury.","signpost[9]":"cause problems","definition[10]":"to cause someone problems or difficulties","example[42]":"They look good enough to trouble most teams in the competition."}