{"word[0]":"society","plural[0]":"societies","definition[0]":"people in general, considered in relation to the laws, organizations etc that make it possible for them to live together","example[0]":"technology and its effects on modern society","example[1]":"Children are the most vulnerable members of society.","signpost[0]":"a particular group","definition[1]":"a particular large group of people who share laws, organizations, customs etc","example[2]":"Britain is now a multiracial society.","example[3]":"the capitalist societies of the West","example[4]":"the conservative segment of American society","signpost[1]":"club","definition[2]":"an organization or club with members who share similar interests, aims etc","example[5]":"the university film society","example[6]":"the American Cancer Society","example[7]":"the Society of Black Lawyers","note[0]":"society of","signpost[2]":"upper class","definition[3]":"the fashionable group of people who are rich and powerful","note[1]":"high society (=the richest, most fashionable etc people)","example[8]":"a society wedding","signpost[3]":"being with people","definition[4]":"when you are together with other people","example[9]":"Holidays are a time to enjoy the society of your family.","heading[0]":"– Meaning 2: a particular large group of people who share laws, organizations, customs etc","collocation[0]":"a free society","example[10]":"Censorship has no place in a free society.","collocation[1]":"a civilized society","example[11]":"A civilized society should treat its elderly members well.","collocation[2]":"a civil society","example[12]":"The protection of human rights is essential for a civil society.","collocation[3]":"a multicultural/multiracial society","example[13]":"We live in a multicultural society.","collocation[4]":"a democratic society","example[14]":"Education is important in a democratic society.","collocation[5]":"an advanced/modern society","example[15]":"The Greeks formed the first advanced societies in the West.","example[16]":"This kind of hatred and violence have no place in a modern society like ours.","collocation[6]":"an industrial society","example[17]":"In complex industrial societies, different groups specialize in particular activities.","collocation[7]":"a primitive society","example[18]":"In almost all primitive societies, volcanoes have been regarded with fear.","collocation[8]":"a just society","example[19]":"We are making progress towards a just society.","collocation[9]":"a classless society","example[20]":"the prime minister’s vision of a classless society","collocation[10]":"a capitalist society","example[21]":"As consumers in a capitalist society, we can press companies to behave responsibly.","collocation[11]":"the larger/wider society","example[22]":"The poor are part of the larger society, and programs must be there to help them.","definition[5]":"people in general, considered in relation to the structure of laws, organizations etc that make it possible for them to live together","example[23]":"Society may decide that it dislikes monopoly profits, purely on the grounds of equity.","example[24]":"We have grown up in a materialistic, capitalist society.","definition[6]":"a professional organization or club with members who share similar aims and interests","example[25]":"the American Society for Training and Development"}