{"word[0]":"careless","definition[0]":"not paying enough attention to what you are doing, so that you make mistakes, damage things etc","opposite[0]":"careful","example[0]":"It was careless of him to leave the door unlocked.","example[1]":"a careless mistake","example[2]":"careless driving","example[3]":"Careless talk can be disastrous for a business.","example[4]":"He’s careless with his glasses and has lost three pairs.","note[0]":"careless with","definition[1]":"natural and not done with any deliberate effort or attention","example[5]":"He ran a hand through his hair with a careless gesture.","definition[2]":"not concerned about something","example[6]":"She gave a careless shrug.","example[7]":"a man careless of his own safety","note[1]":"careless of","example[8]":"I made a few careless mistakes.","example[9]":"It was careless of you to leave your purse lying about.","example[10]":"He started getting careless about taking his medication.","display[0]":"clumsy","definition[3]":"often dropping or breaking things because you move around in a careless way","example[11]":"I’m so clumsy, I spilt milk all over the floor.","example[12]":"a clumsy child","display[1]":"sloppy","definition[4]":"careless and lazy in the way you do your work or in your behaviour generally","example[13]":"As a student, he was brilliant but sloppy.","example[14]":"I will not tolerate sloppy work.","display[2]":"reckless","definition[5]":"doing dangerous or stupid things without thinking about your own or other people’s safety","example[15]":"The driver of the car was arrested for reckless driving.","example[16]":"His actions showed a reckless disregard for human life.","display[3]":"irresponsible","definition[6]":"careless in a way that might affect other people, especially when you should be taking care of them","example[17]":"It’s irresponsible for parents to let their children smoke.","example[18]":"his irresponsible attitude to keeping animals","display[4]":"tactless","definition[7]":"carelessly saying something that upsets or embarrasses someone, without intending to do this","example[19]":"He kept making tactless remarks about her appearance.","example[20]":"a tactless question","example[21]":"I thought it would be tactless to ask about her divorce.","display[5]":"casual","definition[8]":"not being careful enough about something and treating it as though it is not important","example[22]":"He seems to have a very casual attitude towards his work.","example[23]":"She disliked the casual way in which he made decisions affecting other people’s lives.","display[6]":"negligent","definition[9]":"careless about something that you are responsible for, so that serious mistakes are made – used especially when someone will be officially punished for this","example[24]":"The doctor was negligent in using the wrong type of needle.","example[25]":"They found him guilty of negligent conduct."}