{"word[0]":"overtime","definition[0]":"time that you spend working in your job in addition to your normal working hours","example[0]":"six hours’ overtime","example[1]":"They’re working overtime to get the job finished.","example[2]":"He’s been doing a lot of overtime recently.","example[3]":"Many employees work countless hours of unpaid overtime.","example[4]":"Many of our offices will be working on overtime until the end of the year.","definition[1]":"the money that you are paid for working more hours than usual","example[5]":"He earns £450 a week, including overtime.","definition[2]":"a period of time added to the end of a sports game to give one of the two teams a chance to win","example[6]":"Steve Smith scored all nine of the Hawks’ points in overtime.","note[0]":"in overtime","collocation[0]":"work overtime","example[7]":"He's been working a lot of overtime.","collocation[1]":"do overtime","example[8]":"I did three hours overtime yesterday.","collocation[2]":"put in overtime","example[9]":"To earn enough money, he puts in a lot of overtime.","collocation[3]":"paid/unpaid overtime","example[10]":"Many teachers do a lot of unpaid overtime.","collocation[4]":"unlimited overtime","example[11]":"They offered us a bonus and unlimited overtime.","form[0]":"overtime + NOUN","collocation[5]":"overtime pay/payments/earnings","example[12]":"The salary figure does not include overtime pay.","example[13]":"If Joe worked 100 hours overtime at time and a half, his overtime payments would be $15,662.","collocation[6]":"overtime rates","example[14]":"Generous overtime rates are paid for late-night and weekend work.","example[15]":"Is there any limit on your ability to work overtime?","example[16]":"Staff at the bank will begin an overtime ban (=refuse to work overtime) tomorrow in a protest over pay.","example[17]":"Police officers who do this extra work are paid overtime.","example[18]":"They need paid holidays and vacations, as well as overtime pay for extra hours.","definition[3]":"time that a factory, office etc is operating in addition to its normal hours","example[19]":"The plant has worked overtime in some recent weeks because those models are selling well."}