{"word[0]":"especially","definition[0]":"used to emphasize that something is more important or happens more with one particular thing than with others","synonym[0]":"particularly","example[0]":"I never liked long walks, especially in winter.","example[1]":"Art books are expensive to produce, especially if they contain colour illustrations.","definition[1]":"to a particularly high degree or much more than usual","example[2]":"I was especially fond of chocolate biscuits.","example[3]":"Feedback is especially important in learning skills.","example[4]":"A depreciation of the dollar would make US exports cheaper and especially so in Japan.","example[5]":"Graphics are especially well handled in the book.","definition[2]":"for a particular person, purpose etc","example[6]":"She bought a new pair of trainers especially for the trip.","note[0]":"especially for","explanation[0]":"Especially is not used at the start of a sentence before the subject","example[7]":"I like Thai food especially","example[8]":"I especially like Thai food","bad_example[0]":"Especially I like Thai food","example[9]":"Young people especially are being affected by the economic crisis","bad_example[1]":"Especially young people are being affected","display[0]":"especially/particularly","definition[3]":"used when you want to emphasize that something concerns or affects one person or thing more than others, or is true about a particular situation more than others","example[10]":"This disease mostly affects women, particularly older women.","example[11]":"Paris is always full of tourists, especially in the summer.","example[12]":"It’s not easy to receive compliments, especially if you’re not used to them.","example[13]":"The surface is very slippery, particularly when it has been raining.","display[1]":"specially","example[14]":"I like parks, specially when they’ve got lakes.","example[15]":"You have to be careful what you say, specially if there are children listening.","display[2]":"in particular","definition[4]":"especially – used before or after a noun. Often used in the phrases anyone/anything/anywhere in particular and someone/something/somewhere in particular","example[16]":"Mary loves most classical music, in particular Bach and Vivaldi.","example[17]":"Kids in particular will love this show.","example[18]":"Is there anything in particular you would like to eat?","example[19]":"Was there someone in particular you were hoping to meet?","display[3]":"notably","definition[5]":"used for saying someone or something is an important example of what you are talking about","example[20]":"The use of illegal drugs – notably marijuana – has increased in recent years.","example[21]":"A number of respected philosophers, most notably Leibniz, criticized Newton’s theories.","display[4]":"above all","definition[6]":"used for emphasizing that something is more important than all the other things you have mentioned","example[22]":"Get plenty of sleep, eat lots of good food, and above all try to relax.","display[5]":"most of all","definition[7]":"more than anything or anyone else","example[23]":"Swimming and soccer are fun, but I like dancing most of all.","example[24]":"Out of everybody at school she was the person who helped me most of all."}