{"word[0]":"exercise","signpost[0]":"for health","definition[0]":"physical activities that you do in order to stay healthy and become stronger","example[0]":"Try to fit some regular exercise into your daily routine.","example[1]":"Working in an office, I don’t get much exercise.","example[2]":"Most people need to do more exercise.","note[0]":"do/take exercise","example[3]":"Gentle exercise can be beneficial for older people.","note[1]":"gentle/light exercise","example[4]":"After the operation, you should avoid strenuous exercise.","note[2]":"vigorous/strenuous exercise","definition[1]":"a movement or set of movements that you do regularly to keep your body healthy","example[5]":"stretching exercises","example[6]":"You can do exercises to strengthen your stomach muscles.","signpost[1]":"for a skill","definition[2]":"an activity or process that helps you practise a particular skill","example[7]":"relaxation exercises","example[8]":"role-play exercises","signpost[2]":"in a book","definition[3]":"a set of questions in a book that test a student’s knowledge or skill","example[9]":"Do Exercises 3 and 4 on page 51 for homework.","signpost[3]":"for a particular result","definition[4]":"an activity or situation that has a particular quality or result","example[10]":"closing libraries as part of a cost-cutting exercise","example[11]":"It’s a pointless exercise.","example[12]":"Buying a house can be an exercise in frustration.","note[3]":"exercise in","signpost[4]":"army/navy etc","definition[5]":"a set of activities for training soldiers etc","example[13]":"a military exercise","example[14]":"Half the unit was away on exercise.","note[4]":"on exercise","heading[0]":"– Meaning 1: physical activities that you do in order to stay healthy and become stronger","collocation[0]":"do some exercise","example[15]":"He ought to do more exercise.","example[16]":"He was advised by the doctor to take more exercise.","collocation[1]":"get some exercise","example[17]":"I don’t get enough exercise.","collocation[2]":"good exercise","example[18]":"Swimming is very good exercise for your muscles.","collocation[3]":"regular/daily exercise","example[19]":"Taking regular exercise is the best way to improve your overall health.","collocation[4]":"physical exercise","example[20]":"Physical exercise keeps you fit and helps to reduce stress.","collocation[5]":"hard/strenuous/vigorous exercise","example[21]":"Pregnant women should avoid strenuous exercise.","collocation[6]":"gentle/light/moderate exercise","example[22]":"Try to do some gentle exercise as part of your daily routine.","collocation[7]":"aerobic exercise","example[23]":"Aerobic exercise, such as jogging or cycling, is a great way to burn off fat.","collocation[8]":"a type/form of exercise","example[24]":"This type of exercise is excellent for losing weight.","collocation[9]":"lack of exercise","example[25]":"Children are becoming overweight through lack of exercise.","form[0]":"exercise + NOUN","collocation[10]":"an exercise programme/routine/regime","example[26]":"The athletes follow an intensive exercise programme.","example[27]":"I’m finding it quite hard to stick to my exercise routine.","collocation[11]":"an exercise class","example[28]":"I usually go to my exercise class on Wednesdays.","heading[1]":"– Meaning 2: a movement or set of movements that you do regularly to keep your body healthy","collocation[12]":"do an exercise","example[29]":"Try to do these exercises at least three days a week.","form[1]":"ADJECTIVES/NOUN + exercise","collocation[13]":"a basic exercise","example[30]":"He showed me some basic exercises for strengthening leg muscles.","collocation[14]":"keep-fit exercises","example[31]":"I couldn’t get to the gym, so I did a few keep-fit exercises in my bedroom.","collocation[15]":"a warm-up exercise","example[32]":"Do some warm-up exercises before lifting heavy weights.","collocation[16]":"a yoga exercise","example[33]":"Yoga exercises keep you supple.","collocation[17]":"a breathing exercise","example[34]":"We do breathing exercises in my yoga class.","signpost[5]":"use something","definition[6]":"to use a power, right, or quality that you have","example[35]":"There are plans to encourage people to exercise their right to vote.","example[36]":"People who can exercise some control over their surroundings feel less anxious.","signpost[6]":"do physical activity","definition[7]":"to do sports or physical activities in order to stay healthy and become stronger","example[37]":"It’s important to exercise regularly.","signpost[7]":"use part of your body","definition[8]":"to make a particular part of your body move in order to make it stronger","example[38]":"Swimming exercises all the major muscle groups.","definition[9]":"to make an animal walk or run in order to keep it healthy and strong","example[39]":"people exercising their dogs in the park","signpost[8]":"make somebody think","definition[10]":"to make someone think about a subject or problem and consider how to deal with it","example[40]":"It’s an issue that’s exercised the minds of scientists for a long time.","definition[11]":"if something exercises someone, they think about it all the time and are very anxious or worried – often used humorously","example[41]":"It was clear that Flavia had been exercised by this thought.","definition[12]":"to walk, do sports etc in order to stay healthy and become stronger","example[42]":"To lose weight, exercise regularly and eat less.","display[0]":"do some exercise/a lot of exercise etc","definition[13]":"this phrase is much more common than the verb exercise, and means the same thing","example[43]":"Her doctor said that she needed to do more exercise.","example[44]":"My son does very little exercise – I don’t know how he stays so slim.","example[45]":"Dogs need lots of exercise.","display[1]":"stay/keep/get in shape","definition[14]":"to stay or to become physically healthy and strong – used especially when you consider exercise as a way to keep a nice-looking body","example[46]":"Try jogging with a friend who also wants to get in shape.","display[2]":"keep fit","definition[15]":"to exercise regularly in order to stay healthy and strong","example[47]":"The class encourages older people to keep fit.","display[3]":"work out","definition[16]":"to do exercise in order to be healthy and strong, especially to exercise regularly in a gym or exercise class","example[48]":"He works out three times a week.","display[4]":"tone up","definition[17]":"to exercise in order to make your body or part of your body firmer","example[49]":"I need to tone up my stomach and legs.","display[5]":"warm up","definition[18]":"to do gentle exercises to prepare your body for more active exercise","example[50]":"It’s important to warm up before you begin to play.","display[6]":"stretch","definition[19]":"to reach your arms, legs, or body out to full length, in order to make your muscles as long as possible, so that you do not injure them when you exercise","example[51]":"Jog for five minutes, then stretch before starting on your run.","display[7]":"limber up","definition[20]":"to do gentle exercises so that your muscles are warm and not tight before you begin a more active exercise","example[52]":"The footballers were limbering up before a training session.","definition[21]":"to prepare for a sporting event by exercising in a particular way","example[53]":"She’s training to do the London Marathon.","display[8]":"practise","definition[22]":"to do a sports activity regularly, in order to get better and prepare for competition","example[54]":"The team practices on Wednesdays and Saturdays.","definition[23]":"to use your power, influence or a right that you have","example[55]":"Shareholders were encouraged to exercise their right to vote.","definition[24]":"to buy the property mentioned in an OPTION","example[56]":"The seller is likely to exercise the option if the market value of the property is above the repurchase price."}