{"word[0]":"mixture","definition[0]":"a combination of two or more different things, feelings, or types of people","example[0]":"The town is a mixture of the old and the new.","note[0]":"mixture of","example[1]":"the mixture of different people living in the city","example[2]":"She felt a strange mixture of excitement and fear.","example[3]":"a mixture of emotions","definition[1]":"a liquid or other substance made by mixing several substances together, especially in cooking","example[4]":"Pour the mixture into four small dishes.","example[5]":"Fill the bread with a mixture of lettuce, tomatoes, and cucumbers.","definition[2]":"a combination of substances that are put together but do not mix with each other","definition[3]":"several different substances, ideas, qualities etc that have been put together, especially so that they form one thing","example[6]":"Pour the mixture into the cake pan and bake for 50 minutes.","example[7]":"He looked at her with a mixture of admiration and curiosity.","display[0]":"combination","definition[4]":"two or more different things, substances etc that are used together or work together","example[8]":"Doctors use a combination of drugs to combat the disease.","example[9]":"The business failed due to a combination of bad management and a lack of experience.","display[1]":"blend","definition[5]":"a mixture of two or more things, qualities, or characteristics, especially ones that combine successfully or in a pleasant way","example[10]":"The England team is a good side, with a nice blend of experience and youthful energy.","example[11]":"The sauce uses a blend of different ingredients.","display[2]":"a cross between something and something","definition[6]":"a mixture of very different things – used when you are describing what something looks or sounds like","example[12]":"The building looked like a cross between a museum and a spaceship.","example[13]":"Her music sounds like a cross between the Rolling Stones and Amy Winehouse.","display[3]":"hybrid","definition[7]":"something that is produced by combining two or more things, especially using advanced scientific methods","example[14]":"Scientists are combining human and animal embryos to create genetic hybrids.","example[15]":"These industries use a hybrid of different technologies.","example[16]":"The plant is a hybrid of wheat and rye.","display[4]":"amalgam","definition[8]":"a mixture of different things, in which you can still recognize the original features","example[17]":"The record is an amalgam of hard rock, jazz, and blues.","display[5]":"synthesis","definition[9]":"something that has been made by combining different things, especially information or ideas","example[18]":"The essay should be a synthesis of the information from various sources.","heading[0]":"an untidy mixture","display[6]":"jumble","definition[10]":"a lot of different things mixed together in an untidy way","example[19]":"Rae looked through the jumble of old record albums and tapes.","display[7]":"mishmash","definition[11]":"a mixture of a lot of different things, styles etc that do not seem right together","example[20]":"If you look closely at the individual buildings they are a real hodgepodge of styles.","example[21]":"The story is a bit of a mishmash.","heading[1]":"a mxture of chemical substances","display[8]":"compound","definition[12]":"a chemical substance that contains atoms of two or more elements","example[22]":"common chemical compounds such as sodium chloride","display[9]":"solution","definition[13]":"a liquid mixed with a solid or a gas","example[23]":"a weak sugar solution"}