{"word[0]":"wall","signpost[0]":"around an area","definition[0]":"an upright flat structure made of stone or brick, that divides one area from another or surrounds an area","example[0]":"the Great Wall of China","example[1]":"We climbed over the wall into the orchard.","example[2]":"The estate is surrounded by high stone walls.","note[0]":"stone/brick/concrete wall","example[3]":"the ancient city walls","note[1]":"city/garden etc wall","signpost[1]":"in a building","definition[1]":"one of the sides of a room or building","example[4]":"Bob leaned against the wall.","example[5]":"We decided to paint the bathroom walls blue.","note[2]":"bedroom/kitchen etc wall","example[6]":"I put some pictures up on the walls.","note[3]":"on the wall","definition[2]":"the side of something hollow, especially within the body","example[7]":"The walls of the blood vessels had been damaged.","example[8]":"cell walls","signpost[2]":"Internet","definition[3]":"an area on a website such as Facebook where other people can leave messages and comments about you","example[9]":"a brick wall","display[0]":"fence","definition[4]":"a structure made of wood, metal etc that surrounds a piece of land","example[10]":"The garden was surrounded by an old wooden fence.","example[11]":"the chain link fence around the school","display[1]":"railings","definition[5]":"a metal fence that is made of a series of upright bars","example[12]":"the iron railings in front of the house","example[13]":"The boy was leaning over the railing on the side of the boat.","display[2]":"barrier","definition[6]":"a type of fence or gate that prevents people from moving in a particular direction","example[14]":"A guard stood near the barrier.","example[15]":"The police had put up barriers to keep the crowd under control.","display[3]":"screen","definition[7]":"a piece of furniture like a thin wall that can be moved around and is used to divide one part of a room from another","example[16]":"the screen around his hospital bed","example[17]":"a Japanese bamboo screen","example[18]":"a fire screen  (=that you put near a fire)","display[4]":"partition","definition[8]":"a thin wall that separates one part of a room from another","example[19]":"The room was divided into two by a thin partition.","example[20]":"The offices are separated by partitions and you can hear everything that is said in the next office.","display[5]":"barricade","definition[9]":"a line of objects that people have put across a road, to prevent people getting past, especially as part of a protest","example[21]":"The soldiers used tanks to smash through the barricades.","definition[10]":"if a business goes to the wall, it fails, especially because of financial difficulties","example[22]":"One of the highest-flyers in the computer industry went to the wall a year ago because of trouble handling a large acquisition.","definition[11]":"if sales, profits etc hit a wall, they reach their highest point before beginning to fall","example[23]":"Booming car sales in Germany hit a wall in August, plummeting 40%."}