{"word[0]":"vacancy","plural[0]":"vacancies","definition[0]":"a job that is available for someone to start doing","example[0]":"There are still two vacancies on the school board.","example[1]":"The council is making every effort to fill the vacancies.","example[2]":"information about job vacancies","example[3]":"We have no vacancies for photographers at the moment.","note[0]":"vacancy for","definition[1]":"a room in a hotel or building that is not being used and is available for someone to stay in","example[4]":"Let me see if we have a vacancy for tonight.","example[5]":"‘No vacancies’, the sign read.","definition[2]":"lack of interest or thought","example[6]":"His mouth fell open and the look of vacancy returned.","form[0]":"ADJECTIVES/NOUN + vacancy","collocation[0]":"a job vacancy","example[7]":"He searched the newspapers regularly for job vacancies.","collocation[1]":"a suitable vacancy","example[8]":"We will keep your CV on file in case other suitable vacancies arise.","collocation[2]":"an unfilled vacancy","example[9]":"The teaching unions estimate there are some 10,000 unfilled vacancies.","collocation[3]":"a staff vacancy","example[10]":"Other officers are working overtime because of staff vacancies.","collocation[4]":"have a vacancy","example[11]":"We have no vacancies for cleaners at present.","collocation[5]":"advertise a vacancy","example[12]":"Where did you see the vacancy advertised?","collocation[6]":"fill a vacancy","example[13]":"We are making every effort to fill the vacancies.","collocation[7]":"create/leave a vacancy","example[14]":"the vacancy which was created by White’s resignation","collocation[8]":"there is a vacancy","example[15]":"She asked if there were any vacancies for salespeople.","collocation[9]":"a vacancy comes up","example[16]":"A vacancy has arisen on the committee.","example[17]":"We havejob vacancies for graduates in engineering and information technology.","example[18]":"A vacancy has arisen (=become available) in the department for a senior accountant.","example[19]":"We haven’t been able to find anyone to fill this vacancy.","definition[3]":"a hotel room, flat, or office which has not been taken and which is therefore available for rent","example[20]":"Apartment vacancies are still high in several markets."}