{"word[0]":"recession","definition[0]":"a difficult time when there is less trade, business activity etc in a country than usual","example[0]":"the economic recession of the early 1980s","example[1]":"There is deep recession in the UK.","example[2]":"attempts to pull the country out of recession","note[0]":"into/out of recession","collocation[0]":"an economic recession","example[3]":"The economic recession of the '70s led to a fall in recruitment.","collocation[1]":"a world/global/worldwide recession","example[4]":"America’s airlines have been badly hit by the world recession.","collocation[2]":"a deep/severe recession","example[5]":"We are in the middle of a severe recession.","collocation[3]":"the worst recession","example[6]":"Colombia is going through its worst recession in decades.","collocation[4]":"the longest recession","example[7]":"The British economy was in its longest recession since the Second World War.","collocation[5]":"suffer/experience a recession","example[8]":"The country was suffering a deep recession.","collocation[6]":"slide/slip into recession","example[9]":"Most analysts don’t believe the economy will slide into recession.","collocation[7]":"plunge into recession","example[10]":"The US is about to plunge into recession.","collocation[8]":"be hit by a recession","example[11]":"Rural areas have been hardest hit by the recession.","collocation[9]":"cause recession","example[12]":"Rising oil prices help to fuel inflation and cause recession.","collocation[10]":"a recession deepens","example[13]":"Economists fear the recession may be deepening.","collocation[11]":"the beginning/end of the recession","example[14]":"The Chancellor is confident that we shall see the end of the recession in the next few months.","collocation[12]":"be in the middle/midst of a recession","example[15]":"We are in the midst of a world recession.","collocation[13]":"be in the depths of recession","example[16]":"The country is in the depths of recession.","definition[1]":"a period when a country’s economic growth stops and there is less trade","example[17]":"The industry has cut jobs due to the recession.","example[18]":"fears that the economy may be sliding into recession","display[0]":"depression","definition[2]":"a long period during which there is a bad recession, so that there is very little business activity and a lot of people do not have jobs","example[19]":"During the depression of the 1930s, as many as 20% of the population were jobless.","display[1]":"slump","definition[3]":"a fairly short period when there is a reduction in business and many people lose their jobs","example[20]":"The slump in the housing market is making it difficult for people to sell their homes.","display[2]":"slowdown","definition[4]":"a period when there is a reduction in business activity, that may be the start of a recession","example[21]":"High prices could tip the slowdown in the US into a world recession.","display[3]":"downturn","definition[5]":"a period during which there is a reduction in business activity and economic conditions become worse, when before the economy was growing","example[22]":"Public spending may reduce the effects of the downturn.","display[4]":"crash","definition[6]":"an occasion when the value of stocks and shares on a stock market falls suddenly and by a large amount, causing economic problems","example[23]":"The Wall Street Crash of 1929 was disastrous for not only the American economy, but for the world economy.","definition[7]":"a period of time when an economy or industry is doing badly, and business activity and employment decrease. Many economists consider that there is a recession when industrial production falls for six months in a row","example[24]":"The economy is heading into a recession.","example[25]":"Analysts concluded that the US would get out of recession and interest rates would rise."}