{"word[0]":"handle","signpost[0]":"do work","definition[0]":"to do the things that are necessary to complete a job","example[0]":"I handled most of the paperwork.","example[1]":"The case is being handled by a top lawyer.","example[2]":"The finance department handles all the accounts.","example[3]":"Computers can handle huge amounts of data.","signpost[1]":"deal with a situation","definition[1]":"to deal with a situation or problem by behaving in a particular way and making particular decisions","example[4]":"The headmaster handled the situation very well.","example[5]":"I knew I had handled the matter badly.","example[6]":"Leave it to me. I can handle it.","example[7]":"Most customers were satisfied with the way their complaints were handled.","example[8]":"Opposition leaders will be watching carefully to see how the prime minister handles the crisis.","signpost[2]":"deal with a person","definition[2]":"to deal with a person or behave towards them in a particular way, especially in order to keep them happy","example[9]":"Some customers are quite difficult to handle.","signpost[3]":"not become upset","definition[3]":"to not become upset in a difficult situation","example[10]":"She can’t handle it when people criticize her.","example[11]":"He doesn’t handle stress very well.","definition[4]":"to touch something or pick it up and hold it in your hands","example[12]":"He had never handled a weapon before.","example[13]":"We teach the children to handle the animals gently.","example[14]":"He was roughly handled by the mob.","signpost[4]":"control a vehicle","definition[5]":"to control the movement of a vehicle or an animal","example[15]":"I didn’t know if I’d be able to handle such a large vehicle.","definition[6]":"the way a vehicle handles is how easy it is to control","example[16]":"The car handles well, even on wet roads.","note[0]":"handles well/badly","signpost[5]":"move goods","definition[7]":"to move goods from one place to another","example[17]":"The Post Office handles nearly 2 billion letters and parcels over the Christmas period.","signpost[6]":"buy/sell goods","definition[8]":"to buy or sell goods","example[18]":"Bennet was charged with handling stolen goods.","definition[9]":"the part of a door that you use for opening it","example[19]":"Then he turned the handle and went in.","definition[10]":"the part of an object that you use for holding it","example[20]":"a knife with a carved wooden handle","example[21]":"the handle of his cup","example[22]":"a broom handle","definition[11]":"to deal with a difficult situation or problem","example[23]":"First-time travelers get some peace of mind when an agency handles everything.","definition[12]":"to deal with a particular client or product","example[24]":"She handles all our major clients.","definition[13]":"if you handle a particular job, you are responsible for doing it","example[25]":"He will handle merchandising and advertising as well as retaining his duties as president.","definition[14]":"to buy, sell, or deal with goods or services in business or trade","example[26]":"Domestic car manufacturers have said their dealers are free to handle foreign cars if they wish.","definition[15]":"to move goods etc from one place to another","example[27]":"We handle large volumes of imported goods."}