{"signpost[0]":"lowest side","definition[0]":"the flat surface on the lowest side of an object","example[0]":"What’s that on the bottom of your shoe?","note[0]":"the bottom of something","signpost[1]":"lowest inner part","definition[1]":"the lowest inner surface of something such as a container","example[1]":"The drugs had been hidden in a suitcase with a false bottom.","example[2]":"I found the keys – they were at the bottom of my handbag.","note[1]":"at/in the bottom of something","synonym[0]":"backside","example[3]":"I just sat on my bottom and slid down.","definition[2]":"the part of a set of clothes that you wear on the lower part of your body","example[4]":"pyjama bottoms","example[5]":"a blue bikini bottom","display[0]":"the bottom","definition[3]":"the lowest part of something","example[6]":"The house is at the bottom of that hill.","example[7]":"She scrolled down to the bottom of the screen.","display[1]":"the underneath/the underside","definition[4]":"the bottom surface on the outside of something","example[8]":"You will find the serial number on the underneath of the vacuum cleaner.","display[2]":"base","definition[5]":"the lowest part or the wide bottom part on which something stands","example[9]":"The lamp has a square base.","example[10]":"He had broken a bone at the base of his spine.","display[3]":"the foot","definition[6]":"the bottom of a tree, a hill, or some stairs","example[11]":"There was a small village at the foot of the mountain.","display[4]":"bed","definition[7]":"the ground at the bottom of a river, a lake, or the sea","example[12]":"the sea bed","example[13]":"They found some interesting stones on the river bed.","display[5]":"the foundations","definition[8]":"the layer of cement and stones that forms the bottom of a building","example[14]":"The builders have begun laying the foundations for the house.","definition[9]":"in the lowest place or position","opposite[0]":"top","example[15]":"It’s on the bottom shelf.","example[16]":"The towels are in the bottom drawer.","example[17]":"You’ve got some butter on your bottom lip.","example[18]":"the bottom right-hand corner of the page","definition[10]":"the least important, successful etc","example[19]":"I was bottom of the class (=the least successful student) in Spanish.","example[20]":"Britain came bottom on efforts to tackle pollution and global warming.","definition[11]":"in the place furthest away from where you are","example[21]":"the bottom field","collocation[0]":"the bottom drawer/shelf","example[22]":"My passport’s in the bottom drawer of my desk.","collocation[1]":"the bottom step","example[23]":"Jenna sat on the bottom step.","collocation[2]":"the bottom corner","example[24]":"Look at the bottom left-hand corner of your screen.","collocation[3]":"the bottom row","example[25]":"That’s me in the middle of the bottom row of the photograph.","collocation[4]":"the bottom half","example[26]":"There’s were only two windows in the bottom half of the building.","collocation[5]":"the bottom rung","example[27]":"I put my foot on the bottom rung and started to climb.","collocation[6]":"somebody’s bottom lip","example[28]":"Her bottom lip trembled and she started to cry.","definition[12]":"a humorous character who is changed into a donkey in Shakespeare’s play A midsummer night’s dream","definition[13]":"the lowest point, position, or level","example[29]":"Hopefully, we are finally seeing the bottom of this recession.","example[30]":"Short-term interest rates are now probably near their bottom.","definition[14]":"to get to the lowest possible point, position, or level in price or performance","example[31]":"He believes gold prices have hit bottom or are close to it.","example[32]":"Thailand’s economic slowdown may have reached bottom and signs are some sectors are recovering.","definition[15]":"used to say that prices reach extremely low levels, with many businesses and people in financial difficulty","example[33]":"The recession came and the bottom dropped out of the market for luxury houses.","example[34]":"The bottom fell out of the wool market and many farmers went bust."}