{"word[0]":"harmful","definition[0]":"causing harm","example[0]":"the harmful effects of smoking","example[1]":"chemicals that are harmful to the environment","note[0]":"harmful to","definition[1]":"causing physical harm – used especially about things that cause harm to your health, the environment etc","example[2]":"Smoking is harmful to your health.","example[3]":"drugs with harmful side effects","display[0]":"be bad for somebody/something","definition[2]":"to have a harmful effect on someone or something. This phrase is very commonly used in everyday English when saying that something is harmful","example[4]":"Everyone knows that too much alcohol is bad for you.","display[1]":"damaging","definition[3]":"used about things that cause permanent physical harm, or that have a bad effect in other ways, for example on people’s opinion of someone","example[5]":"Acid rain has a damaging effect on trees and the soil.","example[6]":"The allegations were very damaging to his career.","example[7]":"Constant criticism is damaging to a child’s self-esteem.","display[2]":"detrimental","definition[4]":"causing harm or having a bad effect on something","example[8]":"Employers are worried that the new laws will have a detrimental effect on their business.","example[9]":"chemicals that are detrimental to the environment","example[10]":"policies that have been detrimental to the interests of old people","definition[5]":"a negative effect is one that is bad and causes problems","example[11]":"The car tax had a negative effect on car sales.","example[12]":"the negative impact of the recession in the US","display[3]":"hazardous","definition[6]":"hazardous substances are likely to be dangerous to people’s health and safety","example[13]":"Hazardous waste needs to be disposed of safely.","example[14]":"hazardous chemicals","display[4]":"toxic","definition[7]":"toxic substances, smoke etc are poisonous","example[15]":"toxic waste","example[16]":"toxic fumes","example[17]":"Toxic chemicals spilled into the river.","display[5]":"pernicious","definition[8]":"used about something that has a gradual bad effect which is not easy to notice, especially on people’s morals, or on their health","example[18]":"the pernicious effects of violent video games","example[19]":"the pernicious effect of secondhand smoke"}