{"word[0]":"column","definition[0]":"a tall solid upright stone post used to support a building or as a decoration","definition[1]":"a line of numbers or words written under each other that goes down a page","example[0]":"Add up the numbers in each column.","note[0]":"in a column","example[1]":"a column of figures","note[1]":"column of","definition[2]":"an article on a particular subject or by a particular writer that appears regularly in a newspaper or magazine","note[2]":"music/science/gardening etc column","example[2]":"He writes a weekly column for ‘The Times’.","definition[3]":"one of two or more areas of print that go down the page of a newspaper or book and that are separated from each other by a narrow space","example[3]":"Turn to page 5, column 2.","example[4]":"‘The Sun’ devoted ten column inches to the event  (=their article filled a column ten inches long).","definition[4]":"something that has a tall thin shape","example[5]":"a column of smoke","definition[5]":"a long moving line of people or things","example[6]":"a column of marching men","heading[0]":"– Meaning 3: an article on a particular subject or by a particular writer that appears regularly in a newspaper or magazine","form[0]":"ADJECTIVES/NOUN + column","collocation[0]":"a newspaper column","example[7]":"He’s the writer of a weekly newspaper column.","collocation[1]":"a weekly/daily/monthly column","example[8]":"Her daily column covered a wide range of topics.","collocation[2]":"a regular column","example[9]":"His views were well-known from his regular column in The Spectator magazine.","collocation[3]":"a gossip column","example[10]":"She was upset by an item in the Washington Times gossip column.","collocation[4]":"an editorial column","example[11]":"the Financial Times editorial column","collocation[5]":"a financial column","example[12]":"He wrote a financial column for the evening newspaper.","collocation[6]":"a correspondence/letters column","example[13]":"Thousands of letters poured in to the correspondence column.","collocation[7]":"an obituary column","example[14]":"I spotted Stephenson's name in the obituary column.","collocation[8]":"the personal column","example[15]":"I put a small advertisement in the personal column of the paper.","collocation[9]":"an agony column","example[16]":"Romantic relationships are much discussed in all the agony columns.","collocation[10]":"a lonely hearts column","example[17]":"Some men place advertisements in the lonely hearts columns.","collocation[11]":"write a column","example[18]":"He writes a column on gardening for the Daily News.","collocation[12]":"have a column","example[19]":"Lynch had a weekly column in a Sydney newspaper.","form[1]":"column + NOUN","collocation[13]":"column inches","example[20]":"Many column inches have recently been devoted to the troubled pop star.","definition[6]":"a line of numbers written or printed under each other so that they can be easily added up, or a space on a page or on a computer screen for numbers to be arranged in this way","definition[7]":"one of two or more lines of print that go down the page of a newspaper or book and that are separated from each other by a narrow space"}