{"word[0]":"review","definition[0]":"a careful examination of a situation or process","example[0]":"The policy comes up for review (=will be reviewed) in April.","example[1]":"All fees are subject to review (=may be reviewed).","example[2]":"Mr Crowther asked for judicial review of the decision  (=an examination of the decision by a judge).","example[3]":"The company hired Bob to conduct an independent review of their workplace procedures.","note[0]":"carry out/conduct/undertake a review","example[4]":"the Teachers’ Pay Review Body","note[1]":"review body/committee/panel/board","example[5]":"She sent us her review of the research.","note[2]":"review of","example[6]":"We’re keeping this policy under review  (=we are continuing to examine it).","note[3]":"under review","definition[1]":"an article in a newspaper or magazine that gives an opinion about a new book, play, film etc","example[7]":"a film review","example[8]":"The film opened to rave reviews (=reviews that praised it a lot).","example[9]":"The band’s new album has had very good reviews.","note[4]":"good/bad/mixed review","example[10]":"The paper published a review of her book.","definition[2]":"the work of writing reviews for a newspaper or magazine","example[11]":"The journal receives review copies (=free copies to review) of most new software products.","example[12]":"The book was sent to the press for review in September.","note[5]":"for review","definition[3]":"a report on a series of events or a period of time, that mentions the most important parts","example[13]":"a review of the year","definition[4]":"an official show of the army, navy etc so that a king, president, or officer of high rank can see them","example[14]":"a naval review","collocation[0]":"carry out a review","example[15]":"No one has yet carried out a review of the system.","example[16]":"Government officials are conducting a review of the law.","collocation[1]":"undertake a review","example[17]":"The department plans to undertake a spending review.","collocation[2]":"keep something under review","example[18]":"He recommended that the matter should be kept under review.","collocation[3]":"come up for review","example[19]":"His contract is coming up for review.","collocation[4]":"be subject to review","example[20]":"These prices are subject to review.","form[0]":"ADJECTIVES/NOUN + review","collocation[5]":"a major review","example[21]":"We are conducting a major review of our procedures.","collocation[6]":"a thorough/comprehensive review","example[22]":"Their conclusion is based on a comprehensive review of all the previous studies.","collocation[7]":"an extensive/wide-ranging review","example[23]":"He is currently conducting a wide-ranging review of public spending.","collocation[8]":"a fundamental review","example[24]":"There have been calls for a fundamental review of our voting system.","collocation[9]":"an annual review","example[25]":"There will be an annual review of your salary.","collocation[10]":"an independent review","example[26]":"Their findings have been confirmed by a recent independent review.","collocation[11]":"an internal review","example[27]":"The Army is conducting an internal review.","collocation[12]":"judicial review","example[28]":"The case is likely to go to judicial review.","collocation[13]":"a policy review","example[29]":"The policy review proposed radical changes to the system.","collocation[14]":"a spending review","example[30]":"Extra money was promised in last summer’s spending review.","form[1]":"review + NOUN","collocation[15]":"a review body/committee/panel/board","example[31]":"We will set up a pay review body for all staff.","collocation[16]":"a review process","example[32]":"We cannot comment until the review process is over.","definition[5]":"to examine, consider, and judge a situation or process carefully in order to see if changes are necessary","example[33]":"We will review your situation and decide how we can help you.","example[34]":"The decision will be reviewed by the Supreme Court.","example[35]":"The team manager’s position will be reviewed at the end of the season.","definition[6]":"to write a short article describing and judging a new book, play, film etc","example[36]":"Bradman will review the best of the new children’s books.","definition[7]":"to look again at something you have studied, such as notes, reports etc","definition[8]":"to examine and describe the most important parts of a series of events or period of time","example[37]":"a journalist who will review the events of the past six months","definition[9]":"to officially watch a group of soldiers, ships etc at a military show","example[38]":"The president will review the soldiers on parade.","definition[10]":"when a situation or process is examined and considered carefully to see if it can be improved","example[39]":"The company is conducting an internal review (=done by employees of the company) of its activities.","example[40]":"performance reviews of hospitals","example[41]":"The plant is still under review for possible closure.","definition[11]":"when a RATINGS AGENCY examines particular bonds, debts etc to see if there has been a change in the level of risk that they will not be repaid","example[42]":"Moody’s has placed $2.5 billion of the company’s debt under review for possible upgrading.","definition[12]":"an article in a newspaper or magazine that gives an opinion about a new restaurant, product, film etc","example[43]":"Despite good reviews from food critics, the restaurant hasn’t made a profit in two years.","definition[13]":"to examine or consider a situation or process carefully to see if it can be improved","example[44]":"We hired an outside consultant to review our pricing policies.","example[45]":"The situation is being reviewed on a day-to-day basis.","definition[14]":"to examine particular bonds, debt etc to see if there has been a change in the level of risk that they will not be repaid","example[46]":"The company’s debt is being reviewed by Moody’s for possible downgrading.","definition[15]":"to write an article saying how good you think a new restaurant, product, film etc is","example[47]":"He reviews new models for a car magazine.","definition[16]":"to look at a document such as a report in detail","example[48]":"I need more time to review your report."}