{"word[0]":"mind","signpost[0]":"ability to think and imagine","definition[0]":"your thoughts or your ability to think, feel, and imagine things","example[0]":"It is impossible to understand the complex nature of the human mind.","example[1]":"Mind and body are closely related.","example[2]":"Meditation involves focussing the mind on a single object or word.","example[3]":"men who were chosen for their independence of mind","note[0]":"independence/strength/flexibility of mind","example[4]":"There was no doubt in my mind that it was the right decision to make.","note[1]":"in somebody’s mind","example[5]":"Do you have a clear picture in your mind of what you want?","example[6]":"A plan began to form in his mind.","example[7]":"The event is still fresh in most people’s minds.","signpost[1]":"character","definition[1]":"used to talk about the way that someone thinks and the type of thoughts they have","example[8]":"He has a very devious mind.","example[9]":"My naturally suspicious mind thought he might be lying.","signpost[2]":"intelligence","definition[2]":"your intelligence and ability to think, rather than your emotions","example[10]":"a mind trained to react with split-second accuracy","example[11]":"a bright child with an enquiring mind","note[2]":"a brilliant/enquiring/logical etc mind","signpost[3]":"intelligent person","definition[3]":"someone who is very intelligent, especially in a particular subject or activity","synonym[0]":"brain","example[12]":"This is one of the issues that has most interested military minds.","example[13]":"Some of the finest minds in the country are working on the project.","definition[4]":"what you use to think and imagine things","example[14]":"My mind was full of big ideas.","example[15]":"I never know what’s going on in her mind.","example[16]":"At the back of my mind I had the funny feeling that I’d met her somewhere before.","example[17]":"The same thoughts kept going through my mind and I couldn’t get to sleep.","display[0]":"head","definition[5]":"the place where someone’s mind is – use this especially when talking about the thoughts that are in someone’s mind","example[18]":"I can’t get him out of my head.","example[19]":"You need to get it into your head that you’ve done nothing wrong.","example[20]":"To keep myself calm, I counted to ten in my head.","example[21]":"She’s so quiet – you never quite know what’s going on inside her head (=what she is thinking).","display[1]":"subconscious","definition[6]":"the part of your mind that influences the way you think or behave, even though you may not realize this is happening, and which makes you have dreams","example[22]":"She suddenly remembered a traumatic incident that had been buried deep in her subconscious.","example[23]":"During the daytime our conscious minds are active, but during the night the subconscious takes over.","display[2]":"psyche","definition[7]":"someone’s mind, especially their feelings and attitudes, and the way these influence their character – used especially when talking about people’s minds in general","example[24]":"The need for love is deeply buried in our psyche.","example[25]":"Freud has provided an account of the human psyche’s stages of development.","example[26]":"The child is simply searching his psyche to find some past event that relates to his new experiences.","display[3]":"mentality","definition[8]":"a particular way of thinking that a group of people have, especially one that you think is wrong or bad","example[27]":"I just don’t understand the mentality of these people.","example[28]":"They all seem to have a kind of victim mentality, which makes them think that the world is permanently against them.","display[4]":"the ego","definition[9]":"the part of your mind that gives you your sense of who you are – used especially in Freudian psychology","example[29]":"the rational world of the ego and the irrational world of the unconscious","type[0]":"intransitive, transitive usually in questions and negatives","signpost[4]":"feel annoyed","definition[10]":"to feel annoyed or upset about something","example[30]":"I don’t mind the heat, in fact I quite like it.","example[31]":"The expression on Dan’s face showed that he did mind, very much.","example[32]":"I wouldn’t have minded if she’d asked me first.","example[33]":"Did you mind being away from home for so long?","note[3]":"mind doing something","example[34]":"Don’t your parents mind you staying out so late?","note[4]":"mind somebody doing something","example[35]":"He didn’t mind that other people in the village thought him odd.","note[5]":"mind that","explanation[0]":"The expression mind/not mind (something) is used especially in spoken English. In written English, people often use object/not object (to something) instead:","example[36]":"Many people do not object to paying higher taxes for better services.","example[37]":"Would you object if we changed a few details?","signpost[5]":"take care of something/somebody","definition[11]":"to be responsible for something for a short time","example[38]":"Will you mind my bag while I buy my ticket?","definition[12]":"to take care of a child while their parents are not there","example[39]":"My sister minds the baby while I’m at yoga.","signpost[6]":"obey","definition[13]":"to obey someone’s instructions or advice","example[40]":"Some dogs will mind instructions better than others.","explanation[1]":"In most of its meanings, mind is not used in the progressive","explanation[2]":"One common exception is the expression be minding your own business (sense 5)","explanation[3]":"Mind can also be used in the progressive when it means ‘take care of’ (senses 21 and 22)","example[41]":"I’m just minding the shop while she’s having lunch","explanation[4]":"In most of its meanings, mind is not used in the passive","explanation[5]":"Mind can only be used in the passive when it means ‘take care of’ (senses 21 and 22)","example[42]":"The children are being minded by a neighbour","definition[14]":"used to warn someone to be careful because they might hurt themselves or someone else, or damage something","example[43]":"Mind that bike, James!","example[44]":"Mind you don’t fall!","example[45]":"Mind your head – the ceiling’s a bit low.","note[6]":"mind your head/fingers etc","example[46]":"It’s slippery, so mind where you’re walking!","note[7]":"mind how/where/who etc","definition[15]":"a British charity organization which gives advice and practical help to people who are mentally ill and to their families, and which tries to make people in general understand more about mental illness","definition[16]":"if a brand or company is front of mind, people think of it as a possible choice when buying a particular type of product","example[47]":"An email newsletter will keep your brand front of mind.","example[48]":"Pirelli is trying to establish itself as a front-of-mind brand when it comes to buying tyres.","definition[17]":"how many people recognize and think of a particular brand or company compared with its competitors","example[49]":"The marketing battle is for share of mind."}