{"word[0]":"police","definition[0]":"the people who work for an official organization whose job is to catch criminals and make sure that people obey the law","example[0]":"Police surrounded the courthouse.","collocation[0]":"call the police","example[1]":"Staff called the police when they noticed a broken window.","collocation[1]":"tell the police","example[2]":"I think we should tell the police.","collocation[2]":"report something to the police","example[3]":"Why are so many crimes not reported to the police?","collocation[3]":"the police investigate something","example[4]":"Sussex Police are investigating a break-in at the club.","collocation[4]":"the police catch somebody","example[5]":"The police are no nearer to catching his killer.","collocation[5]":"the police arrest somebody/make an arrest","example[6]":"The police arrested Mr Fox as he tried to leave the country.","example[7]":"Officer Singer said the police have made no arrests in the robbery.","collocation[6]":"the police question/interview somebody","example[8]":"Police are questioning two men about the deaths.","collocation[7]":"the police charge somebody","example[9]":"The police have charged the parents with murder.","collocation[8]":"the police hold somebody","example[10]":"The police can hold suspects for up to 48 hours without charge.","example[11]":"The police detained several activists, but released them after questioning.","collocation[9]":"the police release somebody","example[12]":"The police released William and all charges were dropped.","collocation[10]":"the police appeal for something","example[13]":"Police are appealing for witnesses to the attack.","collocation[11]":"the police raid/storm a place","example[14]":"The police raided his home and took his computer.","form[0]":"ADJECTIVES/NOUN + police","collocation[12]":"armed police","example[15]":"Armed police surrounded the house.","collocation[13]":"uniformed police","example[16]":"Uniformed police and plain clothes detectives were present in large numbers.","collocation[14]":"riot police","example[17]":"Riot police moved in with tear gas.","collocation[15]":"traffic police","example[18]":"Traffic police closed the motorway after the accident.","form[1]":"police + NOUN","collocation[16]":"a police investigation","example[19]":"Despite a police investigation, no arrests were made.","collocation[17]":"a police raid","example[20]":"Six people were arrested in a police raid on the bar.","collocation[18]":"a police escort","example[21]":"The teams will parade through the city with a police escort.","collocation[19]":"a police cordon","example[22]":"The demonstrators tried to break through a police cordon.","collocation[20]":"the police force","example[23]":"Her son is in the police force.","collocation[21]":"a police officer","example[24]":"The police officer asked to see his driving licence.","collocation[22]":"a police station","example[25]":"They took him down to the police station to ask him some questions.","collocation[23]":"a police car","example[26]":"The men were being followed by an unmarked police car.","collocation[24]":"a police dog","example[27]":"Police dogs were used to catch the thieves.","collocation[25]":"police brutality/harassment","example[28]":"He claims to have witnessed many instances of police brutality.","explanation[0]":"Police is a plural noun and is followed by a plural verb","example[29]":"The police are investigating the case","bad_example[0]":"The police is investigating the case","explanation[1]":"When talking about someone who works for the police, you say officer,man, orwoman","bad_example[1]":"a police","heading[0]":"people in the police","display[0]":"police officer","definition[1]":"a member of the police. In British English, police officer is used especially in more formal contexts, for example in news reports. In everyday English, British people still usually say policeman or policewoman","example[30]":"a senior police officer","example[31]":"He was sentenced to life in prison for killing a police officer.","example[32]":"He is the officer in charge of the case.","example[33]":"Officer Fayard  (=in the US ‘Officer’ is used in the title of police officers)","display[1]":"policeman","definition[2]":"a man who is a member of the police","example[34]":"an off-duty policeman","example[35]":"He’s a former policeman.","display[2]":"policewoman","definition[3]":"a woman who is a member of the police","example[36]":"The girl, accompanied by a policewoman and two social workers, was seen in private by Sheriff George Crozier.","display[3]":"PC/WPC","definition[4]":"used in the job titles of British police officers. PC means ‘Police Constable’ and WPC means ‘Woman Police Constable’","example[37]":"PC Keith Fletcher","example[38]":"WPC Susan Larkin","display[4]":"detective","definition[5]":"a police officer whose job is to discover who is responsible for crimes","example[39]":"Detectives are investigating the death of a baby boy.","example[40]":"Detective Inspector John Hartwell","display[5]":"plain-clothes","definition[6]":"a plain-clothes police officer wears ordinary clothes instead of a uniform","example[41]":"Two plain-clothes police officers, acting as hotel security men, kept watch on him.","display[6]":"constable","definition[7]":"a British police officer of the lowest rank","example[42]":"a police constable","example[43]":"Constable Robin Cameron","display[7]":"chief constable","definition[8]":"a senior police officer who is in charge of the police in a particular area in Britain","example[44]":"the chief constable of North Yorkshire police","display[8]":"cop","example[45]":"You’d better call the cops.","display[9]":"trooper","definition[9]":"a US police officer in a state police force","example[46]":"a New Jersey state trooper","definition[10]":"to keep control over a particular area in order to make sure that laws are obeyed and that people and property are protected, using a police or military force","example[47]":"The army was brought in to police the city centre.","definition[11]":"to control a particular activity or industry by making sure that people follow the correct rules for what they do","example[48]":"The agency was set up to police the nuclear power industry.","definition[12]":"to control a particular activity or industry by making sure that people follow the correct rules","synonym[0]":"REGULATE"}