{"word[0]":"noise","definition[0]":"a sound, especially one that is loud, unpleasant, or frightening","example[0]":"What’s that noise?","example[1]":"Try not to make a noise when you go upstairs.","example[2]":"There was a lot of noise outside.","example[3]":"Noise levels have been reduced by 20%.","example[4]":"There was a strange whistling noise in his ears.","note[0]":"gurgling/banging/crackling etc noise","example[5]":"the problem of aircraft noise near airports","note[1]":"traffic/engine/background etc noise","example[6]":"the noise of the traffic","note[2]":"noise of","definition[1]":"unwanted signals produced by an electrical circuit","definition[2]":"pieces of unwanted information that can prevent a computer from working effectively","collocation[0]":"make a noise","example[7]":"The car engine was making a funny noise.","collocation[1]":"hear a noise","example[8]":"She heard a strange noise.","collocation[2]":"a noise comes from something","example[9]":"The noise seemed to be coming from the kitchen.","form[0]":"ADJECTIVES/NOUN + noise","collocation[3]":"a loud noise","example[10]":"The rain made a loud noise against the window.","collocation[4]":"a strange/funny noise","example[11]":"What’s that funny noise?","collocation[5]":"a gurgling/whistling/cracking etc noise","example[12]":"The water moved through the pipes with a loud gurgling noise.","collocation[6]":"constant noise","example[13]":"She was fed up with the constant noise of traffic.","collocation[7]":"background noise","example[14]":"The background noise made it hard to hear what he was saying.","collocation[8]":"traffic/aircraft/engine etc noise","example[15]":"It was peaceful there, with no traffic noise at all.","form[1]":"noise + NOUN","collocation[9]":"noise levels","example[16]":"The hospital is trying to reduce noise levels to help patients sleep.","collocation[10]":"noise pollution","example[17]":"The new airport will increase noise pollution in the surrounding area.","definition[3]":"a loud sound, especially an unpleasant one","example[18]":"Traffic noise is a problem in inner-city areas.","example[19]":"Why is the washing machine making so much noise?","display[0]":"racket/din","definition[4]":"a loud unpleasant noise, especially one that annoys you. Racket is more informal than din","example[20]":"I wish those kids would stop making such a racket.","example[21]":"I shouted to make myself heard above the din of the crowd.","example[22]":"the din of battle","display[1]":"row","definition[5]":"a very loud unpleasant noise, especially one that continues for a long time","example[23]":"the deafening row of the loudspeakers","display[2]":"roar","definition[6]":"a loud noise that continues for a long time – used about the noise from an engine, the traffic, a crowd, the sea, or the wind","example[24]":"She heard the roar of a motorbike behind her.","example[25]":"the roar of the waves breaking on the beach","example[26]":"the roar of the crowd at the Blue Jays baseball game","display[3]":"hubbub","definition[7]":"the unclear sound of a lot of people talking and moving around in a place","example[27]":"It’s a wonderful place to escape from the hubbub of London’s busy streets.","example[28]":"His voice rose above the hubbub.","display[4]":"commotion","definition[8]":"a noise made by people arguing or fighting","example[29]":"There was a big commotion going on outside the building.","example[30]":"He went downstairs to find out what was causing the commotion.","display[5]":"clamour","definition[9]":"a loud noise made by a group of people or things all making a noise at the same time","example[31]":"They heard the clamour of angry voices.","example[32]":"the clamor of the rain on the roof","example[33]":"the clamour of typewriters","example[34]":"the clamour of the birds"}