{"word[0]":"hook","signpost[0]":"hanging things","definition[0]":"a curved piece of metal or plastic that you use for hanging things on","example[0]":"Tom hung his coat on the hook behind the door.","signpost[1]":"catching fish","definition[1]":"a curved piece of thin metal with a sharp point for catching fish","signpost[2]":"interest","definition[2]":"something that is attractive and gets people’s interest and attention","synonym[0]":"draw","example[1]":"You always need a bit of a hook to get people to go to the theatre.","signpost[3]":"hitting somebody","definition[3]":"a way of hitting your opponent in boxing, in which your elbow is bent","signpost[4]":"fish","definition[4]":"to catch a fish with a hook","example[2]":"I hooked a 20-pound salmon last week.","signpost[5]":"fasten","definition[5]":"to fasten or hang something onto something else","example[3]":"Just hook the bucket onto the rope and lower it down.","note[0]":"hook something onto/to something","signpost[6]":"bend your finger/arm etc","definition[6]":"to bend your finger, arm, or leg, especially so that you can pull or hold something else","example[4]":"Ruth hooked her arm through Tony’s.","example[5]":"He tried to hook his leg over the branch.","signpost[7]":"interest/attract","definition[7]":"to succeed in making someone interested in something or attracted to something","example[6]":"cigarette ads designed to hook young people","signpost[8]":"electronic equipment","definition[8]":"to connect a piece of electronic equipment to another piece of equipment or to an electricity supply","example[7]":"We’ve got a CD player, but it’s not hooked up yet.","example[8]":"Computers from different manufacturers can often be hooked together.","note[1]":"hook something together","definition[9]":"to throw or kick a ball so that it moves in a curve","definition[10]":"to succeed in attracting someone","example[9]":"These tactics have helped hook such big clients as Coca-Cola.","definition[11]":"to connect one piece of electronic equipment to another piece of equipment or to an electricity supply","example[10]":"Hook one of the telephone lines to the fax machine.","note[2]":"hook something to/into something","definition[12]":"something that attracts customers","example[11]":"Free hotel rooms are one of the hooks designed to bring in new clients.","definition[13]":"if a person or business is off the hook, they are allowed to get out of a difficult situation, especially one they might have been punished for","example[12]":"The broker isn’t off the hook yet for the security violations.","definition[14]":"to have to pay for something, especially something that is not really your responsibility","example[13]":"Two dozen banks are on the hook for at least $100 million each."}