{"word[0]":"training","definition[0]":"the process of teaching or being taught the skills for a particular job or activity","example[0]":"Police drivers have to undergo intensive training.","example[1]":"a rigorous training session","example[2]":"On-the job training will be supplemented by classroom lectures.","example[3]":"The shop opens late on Fridays because of staff training.","example[4]":"On the course we received training in every aspect of the job.","note[0]":"training in","definition[1]":"physical exercises that you do to stay healthy or prepare for a competition","example[5]":"Lesley does weight training twice a week.","example[6]":"She’s in training for the Olympics.","note[1]":"be in training for something","collocation[0]":"give somebody/provide training","example[7]":"Employees should also be given adequate training in fire safety precautions.","collocation[1]":"receive/have/undergo training","example[8]":"A small group would receive intensive training, and then would train others.","collocation[2]":"need/require training","example[9]":"The team will need extra software training.","form[0]":"training + NOUN","collocation[3]":"a training course/programme","example[10]":"All staff are invited to take any training course at company expense.","collocation[4]":"a training session","example[11]":"Make sure you attend the computer training sessions.","collocation[5]":"a training manual","example[12]":"She has written a training manual for social workers.","form[1]":"ADJECTIVES/NOUN + training","collocation[6]":"on-the-job training","example[13]":"On-the-job training was seen as more important than formal education.","collocation[7]":"in-service training","example[14]":"Most employees take advantage of our in-service training program.","collocation[8]":"formal training","example[15]":"Vaughan had no formal training in art.","collocation[9]":"staff training","example[16]":"Insufficient priority is given to staff training.","collocation[10]":"teacher training","example[17]":"Applications for postgraduate teacher training have increased by nearly 50%.","collocation[11]":"job/vocational training","example[18]":"The college provides vocational training for nurses and theatre technicians.","collocation[12]":"basic training","example[19]":"All navy cooks undergo basic training as sailors.","definition[2]":"the process of training someone or of being trained","example[20]":"30 workers are being sent to Japan for training.","example[21]":"90% of the graduates were offeredon-the-job training (=training while working for an employer)."}