{"word[0]":"brand","definition[0]":"a type of product made by a particular company, that has a particular name or design","note[0]":"own brand British English,  store brand American English (=a product made and sold by a particular store)","example[0]":"products which lack a strong brand image","example[1]":"What brand of detergent do you use?","note[1]":"brand of","definition[1]":"a mark made or burned on a farm animal’s skin that shows who it belongs to","form[0]":"ADJECTIVES/NOUN + brand","collocation[0]":"a leading brand","example[2]":"a leading brand such as Toshiba","collocation[1]":"a top brand","example[3]":"Kids want to have Nike and Reebok and other top brands.","collocation[2]":"a popular brand","example[4]":"It’s the most popular brand of tequila in Mexico.","collocation[3]":"an own brand","example[5]":"A supermarket’s own brand should cost less than the nationally advertised brands.","form[1]":"brand + NOUN","collocation[4]":"the brand leader","example[6]":"Schwartz is the brand leader for herbs and spices in the UK.","collocation[5]":"a brand name","example[7]":"The use of tobacco brand names in sponsoring sports has been banned.","collocation[6]":"a brand image","example[8]":"A company carefully protects its brand image.","collocation[7]":"brand loyalty","example[9]":"Advertising is used to sell a product and create brand loyalty.","definition[2]":"to describe someone or something as a very bad type of person or thing, often unfairly","example[10]":"Stealing that money has branded Jim for life – no one will trust him again.","example[11]":"You can’t brand all football supporters as hooligans.","note[2]":"brand somebody (as) something","definition[3]":"to burn a mark onto something, especially a farm animal, in order to show who it belongs to","example[12]":"Each cow was branded with the ranch’s logo.","note[3]":"brand something with something","definition[4]":"to give a name to a product or group of products so that they can be easily recognized by their name or design","definition[5]":"a name given to a product by a company so that the product can easily be recognized by its name or its design","example[13]":"Virgin’s aim is to ensure that all its products and services match and exploit the brand.","example[14]":"the Lancôme brand of cosmetics","example[15]":"This is a company with strong brands and a good position in many markets.","example[16]":"We built the Veuve Clicquot brand slowly over seven years.","example[17]":"Argos bought five factories and developed its own brand called Fortuna.","example[18]":"We have made great efforts to brand our books by putting the company’s name on the front and back covers."}