{"past_tense[0]":"fell","past_participle[0]":"fallen","signpost[0]":"move downwards","definition[0]":"to move or drop down from a higher position to a lower position","example[0]":"The tree was about to fall.","example[1]":"The book fell from his hands.","example[2]":"Enough rain had fallen to flood the grounds.","example[3]":"She flushed and her eyes fell (=she looked down).","example[4]":"Rob fell down the stairs.","note[0]":"fall down","signpost[1]":"stop standing/walking etc","definition[1]":"to suddenly go down onto the ground after you have been standing, walking, or running, especially without intending to","example[5]":"I fell and hit my head.","example[6]":"Peter was playing by the river when he fell in (=fell into the water).","example[7]":"He slipped and fell on the ice.","note[1]":"slip/stumble/trip etc and fall","example[8]":"She fell to her knees beside his body.","note[2]":"fall to/on your knees","example[9]":"Lizzie fell down and hurt her knee.","definition[2]":"to go down to a lower level, amount, price etc, especially a much lower one","example[10]":"The rate of inflation was falling.","example[11]":"The island is warm all year round and winter temperatures never fall below 10 degrees.","example[12]":"He believes that educational standards are falling.","example[13]":"London share prices fell sharply yesterday.","note[3]":"fall sharply/steeply","example[14]":"Advertising revenue fell from $98.5 million to $93.3 million.","note[4]":"fall from","example[15]":"The number of subscribers had fallen to 1,000.","note[5]":"fall to","explanation[0]":"In everyday English, people often say an amount or level goes down rather than falls:","example[16]":"House prices have gone down again.","type[0]":"intransitive, linking verb","definition[3]":"to start to be in a new or different state","example[17]":"I’ll stay with her until she falls asleep.","note[6]":"fall adj","example[18]":"I think that I’ve fallen in love with Angela.","example[19]":"She fell ill with flu.","example[20]":"Albert fell silent and turned his attention to his food.","example[21]":"The house was empty for many years and fell into disrepair.","note[7]":"fall into","example[22]":"One false step can mean falling into debt.","example[23]":"He fell into despair.","type[1]":"intransitive always + preposition","signpost[2]":"belong to a group","definition[4]":"to belong to or be part of a particular group, area of responsibility, range of things, or type of things","example[24]":"Many illnesses fall into the category of stress-related illnesses.","example[25]":"Leaders fall into two categories.","example[26]":"The judge said that this matter did not fall within the scope of the auditor’s duties.","note[8]":"fall within","example[27]":"The job falls under the heading of ‘sales and marketing’.","note[9]":"fall under","example[28]":"Meat production falls under the control of the Agriculture Department.","signpost[3]":"start doing something","definition[5]":"to start doing something or being involved with something, often without intending to","example[29]":"I fell into conversation with some guys from New York.","example[30]":"He had fallen into the habit of having a coffee every time he passed the coffee machine.","signpost[4]":"hang down","definition[6]":"to hang down loosely","example[31]":"His dark hair fell over his face.","note[10]":"fall over","signpost[5]":"light/shadow","definition[7]":"to shine on a surface or go onto a surface","example[32]":"The last rays of sunlight were falling on the fields.","example[33]":"Arthur’s shadow fell across the doorway.","signpost[6]":"special event/celebration","definition[8]":"to happen on a particular day or at a particular time","example[34]":"I’d like to dedicate this record to all whose anniversaries fall at this time of year.","example[35]":"Her birthday will fall on a Friday this year.","note[11]":"fall on","signpost[7]":"lose power","definition[9]":"if a leader or a government falls, they lose their position of power","example[36]":"The previous government fell after only 6 months in office.","signpost[8]":"be taken by an enemy","definition[10]":"if a place falls in a war or an election, a group of soldiers or a political party takes control of it","example[37]":"The city fell to the advancing Russian armies.","signpost[9]":"be killed","definition[11]":"to be killed in a war","synonym[0]":"die","definition[12]":"to hit a particular place or a particular part of someone’s body","example[38]":"The first punch fell on his nose.","signpost[10]":"voice/sound","definition[13]":"if someone’s voice or a sound falls, it becomes quieter or lower","definition[14]":"to suddenly go down onto the floor when standing, walking, or running","example[39]":"She fell on the stairs and broke her ankle.","example[40]":"Children are always falling over.","display[0]":"trip on/over something","definition[15]":"to fall or almost fall when you hit your foot against something","example[41]":"Someone might trip over those toys.","example[42]":"I tripped on a piece of wood.","display[1]":"slip","definition[16]":"to fall or almost fall when you are walking on a wet or very smooth surface","example[43]":"She slipped and hurt her ankle.","example[44]":"I was scared I would slip on the highly polished floor.","display[2]":"stumble","definition[17]":"to almost fall when you put your foot down in an awkward way","example[45]":"He stumbled and almost fell.","example[46]":"One of our porters stumbled on the rough ground.","display[3]":"collapse","definition[18]":"to fall suddenly and heavily to the ground, especially when you become unconscious","example[47]":"One of the runners collapsed halfway through the race.","display[4]":"lose your balance","definition[19]":"to become unsteady so that you start to fall over","example[48]":"She lost her balance on the first step and fell down the stairs.","example[49]":"Have something to hold onto, in case you lose your balance.","display[5]":"fall flat on your face","definition[20]":"to fall forwards so you are lying on your front on the ground","example[50]":"She fell flat on her face getting out of the car.","signpost[11]":"movement down","definition[21]":"movement down towards the ground or towards a lower position","example[51]":"the first fall of autumn leaves","example[52]":"The rise and fall of the dancers’ bodies creates a pattern.","example[53]":"Mrs Evans had a fall (=fell to the ground) and broke her leg.","example[54]":"He stretched out his hands to break his fall (=prevent himself from falling too quickly and hurting himself).","signpost[12]":"reduction","definition[22]":"a reduction in the amount, level, price etc of something","example[55]":"the sharp fall in the birth rate in European countries","note[12]":"sharp/steep fall","example[56]":"There has been a fall in oil prices.","note[13]":"fall in","example[57]":"Their industrial output went down again in December, which meant a fall of 2.2% over the year.","note[14]":"fall of","signpost[13]":"season","definition[23]":"the season between summer and winter, when leaves change colour and the weather becomes slightly colder","synonym[1]":"autumn","example[58]":"Eleanor plans to go to Southwestern Community College this fall.","example[59]":"The area is beautiful in the fall.","signpost[14]":"loss of power/success","definition[24]":"a situation in which someone or something loses their position of power or becomes unsuccessful","example[60]":"the story of Napoleon’s rise and fall (=period of success followed by failure)","example[61]":"Rumours are that the company is heading for a fall (=is likely to fail soon).","example[62]":"The president lived on for twenty years after his fall from power.","definition[25]":"a situation in which a country, city etc is defeated by an enemy","example[63]":"the fall of Jerusalem in AD70","definition[26]":"an act of forcing your opponent onto the ground in wrestling or judo","signpost[15]":"snow/rocks","definition[27]":"an amount of snow, rocks etc that falls onto the ground","example[64]":"The road is blocked by a rock fall.","example[65]":"Fresh falls of snow were forecast.","heading[0]":"GRAMMAR: Patterns with fall (meaning 3)","display[6]":"in the fall/in fall","explanation[1]":"You use in the fall or in fall when talking about something that happens during the fall season","example[66]":"He visited them in the fall","display[7]":"in the fall of","explanation[2]":"You use in the fall of with a year when saying when something happens","example[67]":"The project will be completed in the fall of 2018","display[8]":"last fall/this fall etc","explanation[3]":"Don’t use in with these words","explanation[4]":"You say last fall","example[68]":"She started college last fall","bad_example[0]":"She started college in last fall","explanation[5]":"You say this fall","example[69]":"This fall the leaves are really beautiful","bad_example[1]":"In this fall the leaves are really beautiful","explanation[6]":"You say next fall","example[70]":"The book will come out next fall","bad_example[2]":"The book will come out in next fall","explanation[7]":"You say that fall","example[71]":"That fall I went to Kyoto","bad_example[3]":"In that fall I went to Kyoto","definition[28]":"the story in the Bible that tells how Adam and Eve, the first man and the first woman, disobeyed God. According to the story, God forbids Adam and Eve from eating the fruit (sometimes called ‘the apple’) on the Tree of Knowledge in the Garden of Eden. The serpent (=snake) persuades Eve to taste the fruit, and then Eve gives the fruit to Adam to eat. They are ashamed of disobeying God and wear fig leaves because they are also now ashamed of having no clothes on. When they tell God that they have eaten the fruit he sends them out of the Garden of Eden. This story is supposed to describe the way that human beings first learnt about the difference between good and evil.","definition[29]":"to go down to a lower price, level, amount etc","example[72]":"Sales of new passenger cars in Europe fell 9.6%.","example[73]":"The British pound fell to $1.7520 from $1.7850.","example[74]":"The company went public at $17 a share, but its stock price has fallen sharply since then.","example[75]":"The consumer confidence index fell steeply (=by a large amount) from 79.3 in May to 50.9 in October.","definition[30]":"if a payment falls due on or by a particular date, it must be made on or by that date","example[76]":"Subscriptions are payable annually and fall due on 1 December.","example[77]":"Of these sums, $44.2 million fell due for repayment within one year and a further $22 million fell due after more than one year.","example[78]":"Japanese companies have tried to make up for a fall in domestic demand by increasing sales overseas.","example[79]":"There has been a sharp fall in the price of copper.","example[80]":"The steep fall in the Nikkei index means interest rates will stay low.","definition[31]":"when a person or organization loses their position of power or becomes unsuccessful","example[81]":"the rise and fall of the British motorcycle industry"}