{"signpost[0]":"violence against somebody/something","definition[0]":"an act of violence that is intended to hurt a person or damage a place","example[0]":"a bomb attack","example[1]":"a knife attack","example[2]":"an arson attack (=an attempt to destroy a building using fire)","example[3]":"victims of racial attacks","example[4]":"There have been several attacks on foreigners recently.","note[0]":"attack on","signpost[1]":"in a war","definition[1]":"the act of using weapons against an enemy in a war","example[5]":"The attack began at dawn.","example[6]":"Rebel forces launched (=started) an  attack late Sunday night.","example[7]":"Once again we came under attack from enemy fighter planes.","note[1]":"be/come under attack","example[8]":"the threat of nuclear attack","note[2]":"air/missile/nuclear etc attack","example[9]":"the attack on Pearl Harbor","signpost[2]":"criticism","definition[2]":"a strong and direct criticism of someone or something","note[3]":"go on the attack (=start to criticize someone severely)","example[10]":"The company has come under fierce attack for its decision to close the factory.","example[11]":"The magazine recently published a vicious personal attack on the novelist.","definition[3]":"a sudden short period of suffering from an illness, especially an illness that you have often","example[12]":"He died after suffering a severe asthma attack.","example[13]":"I had a bad attack of flu at Christmas.","note[4]":"attack of","definition[4]":"a short period of time when you suddenly feel extremely frightened or worried and cannot think normally or deal with the situation","example[14]":"Her heart began to pound frantically, as if she were having a panic attack.","note[5]":"panic/anxiety attack","example[15]":"a sudden attack of nerves","signpost[3]":"attempt to stop something","definition[5]":"actions that are intended to get rid of or stop something such as a system, a set of laws etc","example[16]":"The new measures were seen by many as an attack on the Scottish way of life.","definition[6]":"an attempt by a player or group of players to score goals or win points","definition[7]":"the players in a team that are responsible for trying to score goals or win points","example[17]":"Heath will play alongside Smith in attack.","note[6]":"in attack","definition[8]":"when something such as a disease, insect, or chemical damages something","example[18]":"Unfortunately, the carved ceilings have suffered woodworm attack over the years.","heading[0]":"– Meaning 1: an act of violence that is intended to hurt a person or damage a place","form[0]":"NOUN + attack","example[19]":"Animal rights activists are believed to have carried out the bomb attack.","collocation[0]":"a terrorist attack","example[20]":"The accused men went on trial Monday for America’s worst-ever terrorist attack.","collocation[1]":"a knife/gun attack","example[21]":"He was sentenced to nine years in prison for the knife attack.","collocation[2]":"an arson attack","example[22]":"Ten classrooms were completely destroyed in the arson attack.","collocation[3]":"a violent/vicious/brutal attack","example[23]":"Police described it as an extremely violent attack.","collocation[4]":"a horrific attack","example[24]":"'This was a horrific attack, ' said Detective Chief Superintendent Ron Astles.","collocation[5]":"a frenzied attack","example[25]":"The woman was stabbed to death in a frenzied attack at her home.","collocation[6]":"a racial attack","example[26]":"Staffordshire police are treating the incident as a racial attack.","collocation[7]":"a sexual attack","example[27]":"There was no indication of a sexual attack.","collocation[8]":"an unprovoked attack","example[28]":"Their teenage son was knocked to the ground, kicked and punched in an unprovoked attack.","collocation[9]":"a motiveless attack","example[29]":"He was stabbed to death in an apparently motiveless attack.","collocation[10]":"carry out an attack","example[30]":"The man who carried out the attack has been described as white and 25 to 32 years old.","collocation[11]":"an attack happens/takes place","example[31]":"The attack took place at around 10 pm Thursday.","collocation[12]":"a series/spate/wave of attacks","example[32]":"The killing follows a series of brutal attacks on tourists.","collocation[13]":"the victim of an attack","example[33]":"She was the victim of an attack in her own home.","heading[1]":"– Meaning 2: the act of using weapons against an enemy in a war","form[1]":"ADJECTIVES/NOUN + attack","collocation[14]":"a nuclear attack","example[34]":"They would not risk a nuclear attack on the United States.","collocation[15]":"an all-out attack","example[35]":"General Smith was in favour of an all-out attack on the enemy.","collocation[16]":"a full-scale attack","example[36]":"German troops launched a full-scale attack on the city.","collocation[17]":"an armed attack","example[37]":"Armed attacks against Israeli settlements are on the increase.","collocation[18]":"a surprise attack","example[38]":"We launched a surprise attack on their camp just before dawn.","collocation[19]":"a missile/rocket/mortar attack","example[39]":"There were 15 dead and 20 wounded in a missile attack on the capital.","collocation[20]":"an air/bomb attack","example[40]":"Malta was under heavy air attack.","collocation[21]":"launch an attack","example[41]":"In April the French army launched an attack.","collocation[22]":"lead/mount an attack","example[42]":"The King now prepared to mount an attack on Granada.","collocation[23]":"come under attack","example[43]":"Camps in the south came under attack from pro-government forces.","collocation[24]":"be under attack","example[44]":"He arrived when the base was under attack from mortar and small arms fire.","definition[9]":"an act of using weapons against an enemy in a war","example[45]":"The US was threatening to launch an attack on Iran.","example[46]":"The men had been carrying out rocket attacks on British forces.","example[47]":"Bombs have been falling throughout the night, and the city is still under attack  (=being attacked).","display[0]":"invasion","definition[10]":"an occasion when an army enters a country and tries to take control of it","example[48]":"The Allies began their invasion of Europe.","example[49]":"The threat of foreign invasion is very real.","display[1]":"raid","definition[11]":"a short attack on a place by soldiers or planes, intended to cause damage but not take control","example[50]":"an air raid","example[51]":"NATO warplanes carried out a series of bombing raids on the city.","example[52]":"The village has been the target of frequent raids by rebel groups.","display[2]":"strike","definition[12]":"a sudden military attack, especially after a serious disagreement","example[53]":"Senior Israeli officials warned that they were still considering a military strike.","example[54]":"the possibility of a nuclear strike","display[3]":"assault","definition[13]":"a military attack intended to take control of a city, area, or building controlled by an enemy","example[55]":"The final military assault on Kwangju began at 3 am on May 27.","example[56]":"Hitler launched an all-out assault  (=using as many soldiers, weapons, planes etc as possible) on Russia.","display[4]":"ambush","definition[14]":"a sudden attack by people who have been waiting and hiding, especially an attack on a vehicle or people who are travelling somewhere","example[57]":"Five soldiers were shot in the back and killed in the ambush.","example[58]":"Enemy forces waiting in ambush opened fire on the vehicle.","display[5]":"counterattack","definition[15]":"a military attack made in response to an attack by an enemy","example[59]":"Government forces launched a counterattack against the guerillas.","example[60]":"If they successfully occupied the city, they would need to be capable of defending it against enemy counterattack.","display[6]":"onslaught","definition[16]":"a large violent attack by an army","example[61]":"In 1544 there was a full-scale onslaught on France, in which the English took Boulogne.","example[62]":"The troops were preparing for another onslaught against the enemy.","signpost[4]":"use violence","definition[17]":"to deliberately use violence to hurt a person or damage a place","example[63]":"She was attacked while walking home late at night.","example[64]":"His shop was attacked by a gang of youths.","example[65]":"Snakes will only attack if you disturb them.","example[66]":"He needed 200 stitches after being attacked with a broken bottle.","note[7]":"attack somebody/something with something","definition[18]":"to start using guns, bombs etc against an enemy in a war","example[67]":"Army tanks attacked a village near the capital on Sunday.","definition[19]":"to criticize someone or something very strongly","note[8]":"strongly/bitterly/savagely etc attack somebody/something","example[68]":"Last year Dr Travis publicly attacked the idea that abortion should be available on demand.","example[69]":"Newspapers attacked the government for failing to cut taxes.","note[9]":"attack somebody for (doing) something","definition[20]":"if something such as a disease, insect, or chemical attacks something, it damages it","example[70]":"a cruel disease that attacks the brain and nervous system","signpost[5]":"begin doing","definition[21]":"to begin to do something in a determined and eager way","example[71]":"She immediately set about attacking the problem.","example[72]":"Martin attacked his meal  (=started eating) with vigour.","definition[22]":"to move forward and try to score goals or win points","example[73]":"Brazil began to attack more in the second half of the match.","heading[2]":"to attack a person","definition[23]":"to use violence against someone and try to hurt them","example[74]":"She was attacked by a man with a baseball bat.","example[75]":"Police dogs are trained to attack.","definition[24]":"if a group of people ambush someone, they hide and wait for them and then attack them","example[76]":"The judge was ambushed by gunmen as he drove to work at the courthouse.","display[7]":"mug","definition[25]":"to attack someone and take money from them in a public place such as a street","example[77]":"He was mugged on his way home from school.","display[8]":"stab","definition[26]":"to attack someone with a knife","example[78]":"The victim had been stabbed in the neck.","definition[27]":"to attack and hurt someone – used especially when talking about this as a criminal offence","example[79]":"He assaulted a flight attendant who refused to serve him more drinks.","display[9]":"be set upon by somebody/something","definition[28]":"to be attacked by a group of people","example[80]":"He died outside his home after being set upon by a gang of youths.","display[10]":"turn on","definition[29]":"to suddenly change your behaviour and attack the person you are with, when they do not expect this","example[81]":"The dog suddenly turned on him, sinking its teeth into his arm.","heading[3]":"to attack a place","definition[30]":"to use weapons to try to damage or take control of a place","example[82]":"The village was attacked by enemy warplanes.","example[83]":"We will attack at dawn.","display[11]":"invade","definition[31]":"to enter a country and try to get control of it using force","example[84]":"The Romans invaded Britain 2,000 years ago.","display[12]":"storm","definition[32]":"to suddenly attack a city or building that is well defended by getting inside it and taking control","example[85]":"Elite troops stormed the building and rescued the hostages.","display[13]":"besiege","definition[33]":"to surround a city or building with soldiers in order to stop the people inside from getting out or from receiving supplies","example[86]":"In April 655, Osman’s palace was besieged by rebels."}