{"word[0]":"consensus","definition[0]":"an opinion that everyone in a group agrees with or accepts","example[0]":"The EU Council of Finance Ministers failed to reach a consensus on the pace of integration.","example[1]":"the current consensus of opinion","example[2]":"The general consensus was that technology was a good thing.","example[3]":"the consensus politics of the fifties","example[4]":"a lack of consensus about the aims of the project","note[0]":"consensus on/about","example[5]":"There is a consensus among teachers that children should have a broad understanding of the world.","note[1]":"consensus that","collocation[0]":"reach a consensus","example[6]":"The committee found that it was unable to reach a consensus.","collocation[1]":"achieve a consensus","example[7]":"Will further talks achieve a consensus on the UN peace plan?","collocation[2]":"build a consensus","example[8]":"Canada worked on building a consensus among national governments.","collocation[3]":"a consensus emerges","example[9]":"No consensus emerged from these discussions.","collocation[4]":"national/international consensus","example[10]":"There was no international consensus on how to deal with the situation.","collocation[5]":"political/scientific etc consensus","example[11]":"The scientific consensus is that global warming is already occurring.","collocation[6]":"general consensus","example[12]":"Most decisions are reached by general consensus.","collocation[7]":"broad consensus","example[13]":"There is a broad consensus that sport is good for you.","collocation[8]":"clear consensus","example[14]":"There was no clear consensus about the future direction of the company.","collocation[9]":"growing consensus","example[15]":"The growing consensus is that we should focus on economic efficiency.","collocation[10]":"strong consensus","example[16]":"There is a strong consensus that it is time for a change of leadership.","collocation[11]":"a consensus of opinion","example[17]":"There are still areas where no consensus of opinion has been reached.","collocation[12]":"a lack of consensus","example[18]":"Nothing was done because of a lack of consensus on the matter.","definition[1]":"agreement among a group of people","example[19]":"The leaders failed to reach a consensus on the issue of trade barriers.","example[20]":"The talks are aimed at building a consensus.","definition[2]":"the opinion that most people in a group have","example[21]":"The general consensus was that she would make a good chief executive officer."}