{"word[0]":"off","definition[0]":"away from a place","example[0]":"He got into his car and drove off.","example[1]":"Suddenly they turned off and parked in a side road.","example[2]":"Once we were off the main freeway, the trip felt more like a vacation.","example[3]":"Her husband was off on a business trip somewhere.","example[4]":"Are you ready? Off we go.","example[5]":"I must be off now  (=I must leave).","example[6]":"They were off to Italy  (=leaving to go to Italy) and wanted to make an early start.","definition[1]":"not on something, or removed from something","example[7]":"Keep off the grass.","example[8]":"As he leaned forward, his hat fell off.","example[9]":"Someone had taken the mirror off the wall.","example[10]":"Take your coat off.","example[11]":"I was trying to scrape the mud off my boots.","definition[2]":"out of a bus, train, plane etc","example[12]":"I’ll get off at the next stop.","example[13]":"Everyone got off the train at Winnipeg.","definition[3]":"a machine, piece of equipment etc that is off is not working or operating","example[14]":"Will someone switch the radio off?","example[15]":"Make sure all the lights are off.","definition[4]":"not at work, school etc because you are ill or on holiday","example[16]":"My secretary’s been off with flu for the past week.","example[17]":"Clare had to stay off school because her mother was ill.","example[18]":"You look tired. Why don’t you take tomorrow off?","example[19]":"He needs more time off duty for relaxation and rest.","example[20]":"‘Going to work today, mum?’ ‘No. It’s my day off today.’","definition[5]":"from someone","example[21]":"My brother once borrowed some money off him.","example[22]":"I got this necklace off a woman outside the market.","definition[6]":"used to say how far away something is","example[23]":"We could see the cliffs of Shetland about two miles off.","example[24]":"Kara’s home was a long way off across the sea.","definition[7]":"used to say how much time there is between now and a future event","example[25]":"With the exams now only a week off, I had to study hard.","example[26]":"Christmas seemed a long way off.","definition[8]":"used to say how likely or unlikely something is","example[27]":"Any kind of peace agreement still seems a long way off.","definition[9]":"only a short distance away from a place","example[28]":"Our hotel was just off the main street.","example[29]":"an island off the coast of France","definition[10]":"connected to a particular room, area, road etc","example[30]":"There’s a small bathroom off the main bedroom.","example[31]":"a narrow street leading off the corner of the square","definition[11]":"used to say that a price is reduced by a particular amount","example[32]":"If you buy more than ten, they knock 10% off.","definition[12]":"if an event which has been arranged is off, it will not now take place","example[33]":"The wedding’s off.","example[34]":"The race may have to be called off if the bad weather continues.","definition[13]":"behaviour that is off is rude or is not acceptable","example[35]":"She walked out before the end of your lecture, which I thought was a bit off.","example[36]":"Look, I know when someone’s being off with me.","definition[14]":"used to say how much of something someone has","example[37]":"How are you off for sports equipment (=do you have enough?)?","example[38]":"The school’s fairly well off for books these days.","note[0]":"be well/badly off for something","definition[15]":"no longer wanting or liking something","example[39]":"Toby’s been off his food for a few days.","example[40]":"I used to enjoy tennis, but I’ve gone off it a bit now.","note[1]":"go off something/somebody","example[41]":"She seems to have gone off Mark since he’s grown a beard.","definition[16]":"no longer taking something such as a drug or medicine","example[42]":"The operation was a success, and she’s off the morphine.","definition[17]":"food that is off is no longer fresh enough to eat","example[43]":"Ugh! The milk’s off.","example[44]":"Do you think the meat’s gone off?","definition[18]":"used to say that a particular kind of food is not available in a restaurant although it is on the menu","example[45]":"I’m sorry, the fish pie is off today, sir.","definition[19]":"not as good as usual","example[46]":"Sales figures for last year were a little off compared with those of the previous year.","definition[20]":"not correct or not right","example[47]":"Our calculations were off.","example[48]":"Guess again. You’re way off (=very far from being correct).","definition[21]":"used to talk about a pair of things such as wheels on a car, to mean the one on the right","example[49]":"The guy who did this ought to be offed."}