{"word[0]":"regime","definition[0]":"a government, especially one that was not elected fairly or that you disapprove of for some other reason","note[0]":"brutal/oppressive/corrupt regime","example[0]":"The regime got rid of most of its opponents.","definition[1]":"a particular system – used especially when talking about a previous system, or one that has just been introduced","example[1]":"Under the new regime, all sheep and cattle will be regularly tested for disease.","note[1]":"under a regime","definition[2]":"a special plan of food, exercise etc that is intended to improve your health","synonym[0]":"regimen","example[2]":"a dietary regime","collocation[0]":"a political regime","example[3]":"All political regimes attempt to manipulate the media.","collocation[1]":"a military regime","example[4]":"The military regime arrested anyone who dared to speak against it.","collocation[2]":"a totalitarian regime","example[5]":"Totalitarian regimes ban books they disapprove of.","collocation[3]":"an authoritarian regime","example[6]":"The post-war authoritarian regimes of eastern Europe have been replaced by democratically elected governments.","collocation[4]":"a communist regime","example[7]":"the collapse of communist regimes in eastern Europe","collocation[5]":"a fascist regime","example[8]":"Mussolini 's fascist regime in Italy","collocation[6]":"a democratic regime","example[9]":"the establishment of a liberal democratic regime","collocation[7]":"an oppressive/repressive regime","example[10]":"That country was held fast in the grip of an oppressive regime.","collocation[8]":"a brutal regime","example[11]":"Many asylum seekers have fled from brutal regimes.","collocation[9]":"a corrupt regime","example[12]":"Much of the aid that the Americans sent lined the pockets of his corrupt regime.","collocation[10]":"overthrow/topple a regime","example[13]":"In 1979, Tanzanian forces overthrew the regime of Ugandan dictator Idi Amin.","collocation[11]":"oppose a regime","example[14]":"People who opposed the regime were executed in a wave of political violence.","collocation[12]":"a regime comes to power","example[15]":"He criticised European leaders for supporting a regime that came to power through violence.","collocation[13]":"a regime collapses/falls","example[16]":"Authoritarian regimes tend to collapse in times of economic hardship."}