{"word[0]":"beginning","definition[0]":"the start or first part of an event, story, period of time etc","example[0]":"There’s a short poem at the beginning of every chapter.","example[1]":"From the beginning of my career as a journalist, I’ve been writing about gender issues.","example[2]":"I thought he loved me; perhaps he did in the beginning.","example[3]":"That chance meeting marked the beginning of a long and happy relationship.","example[4]":"This is just the beginning of a new and different life for you.","example[5]":"I said he would cause trouble, right from the beginning.","example[6]":"I opposed it from the very beginning.","example[7]":"The whole trip was a disaster from beginning to end.","example[8]":"I feel like I’ve been offered a new beginning.","example[9]":"Could we start at the beginning? Tell me where you first met him.","example[10]":"She’s been here since the beginning of the year.","note[0]":"beginning of","collocation[0]":"a new beginning","example[11]":"The country needed a new government and a new beginning.","collocation[1]":"mark the beginning of something","example[12]":"This event marked the beginning of a ten-year worldwide depression.","collocation[2]":"see the beginning of something","example[13]":"The 1970s saw the beginning of a technological revolution.","collocation[3]":"right at/from the beginning","example[14]":"That’s what I suggested right at the beginning.","collocation[4]":"at/from the very beginning","example[15]":"He had been lying to me from the very beginning.","collocation[5]":"start at the beginning","example[16]":"Just start at the beginning and tell us exactly what happened.","collocation[6]":"from beginning to end","example[17]":"The whole project was full of problems from beginning to end.","collocation[7]":"something is just/only the beginning","example[18]":"Signing the contract is just the beginning of a long process.","heading[0]":"GRAMMAR: Prepositions with beginning","explanation[0]":"You say in the beginning","example[19]":"In the beginning, she didn’t like him","explanation[1]":"You say at the beginning of a period of time","example[20]":"I started my new job at the beginning of the year","bad_example[0]":"in the beginning of the year","definition[1]":"the first part of something such as a story, event, or period of time","example[21]":"The beginning of the movie is very violent.","example[22]":"Let’s go back to the beginning.","display[0]":"start","definition[2]":"the beginning of something, or the way something begins","example[23]":"Tomorrow marks the start of the presidential election campaign.","example[24]":"It was not a good start to the day.","example[25]":"The runners lined up for the start of the race.","display[1]":"commencement","definition[3]":"the beginning of something – used especially in official contexts","example[26]":"the commencement of the academic year","example[27]":"the commencement of the contract","display[2]":"origin","definition[4]":"the point from which something starts to exist","example[28]":"He wrote a book about the origins of the universe.","example[29]":"The tradition has its origins in medieval times.","display[3]":"the onset of something","definition[5]":"the time when something bad begins, such as illness, old age, or cold weather","example[30]":"the onset of winter","example[31]":"An active lifestyle can delay the onset of many diseases common to aging.","display[4]":"dawn","definition[6]":"the beginning of an important period of time in history","example[32]":"People have worshipped gods since the dawn of civilization.","display[5]":"birth","definition[7]":"the beginning of something important that will change many people’s lives","example[33]":"the birth of democracy in South Africa","example[34]":"the birth of the environmental movement"}