{"signpost[0]":"write on something","definition[0]":"to write or draw on something, so that someone will notice what you have written","example[0]":"I’ve marked the pages you need to look at.","example[1]":"All school uniform should be clearly marked with the child’s name.","example[2]":"a document marked ‘confidential’","note[0]":"mark something personal/fragile/urgent etc","example[3]":"Any student who is more than 20 minutes late for class will be marked absent.","note[1]":"mark somebody present/absent","example[4]":"When you’re done, put your sheet in the envelope marked with your name.","note[2]":"mark something with something","example[5]":"Peter marked his name on the first page.","note[3]":"mark something on something","definition[1]":"to make a mark on something in a way that spoils its appearance or damages it, or to become spoiled in this way","example[6]":"Take off your shoes so you don’t mark the floor.","example[7]":"The disease had marked her face for life.","example[8]":"The table marks easily, so please be careful.","signpost[1]":"celebrate","definition[2]":"to celebrate an important event","example[9]":"celebrations to mark Australia Day","example[10]":"Mrs Lawson was presented with a gold watch to mark the occasion.","example[11]":"Carter’s 90th birthday will be marked with a large party at the Savoy Hotel.","signpost[2]":"show position","definition[3]":"to show where something is","example[12]":"A simple wooden cross marked her grave.","example[13]":"He had marked the route on the map in red.","example[14]":"She placed a bookmark between the pages to mark her place.","example[15]":"Troop positions were marked with colored pins.","signpost[3]":"year/month/week","definition[4]":"if a particular year, month, or week marks an important event, the event happened on that date during a previous year","example[16]":"This week marks the 250th anniversary of the birth of Joseph Priestley.","signpost[4]":"show a change","definition[5]":"to be a sign of an important change or an important stage in the development of something","example[17]":"Her latest novel marks a turning point in her development as a writer.","example[18]":"The move seemed to mark a major change in government policy.","example[19]":"These elections mark the end of an era.","signpost[5]":"quality/feature","definition[6]":"if something is marked by a particular quality or feature, it is a typical or important part of that thing","synonym[0]":"characterize","example[20]":"The villages of East Anglia are marked by beautiful churches with fine towers.","explanation[0]":"Mark is usually passive in this meaning","signpost[6]":"student’s work","definition[7]":"to read a piece of written work and put a number or letter on it to show how good it is","example[21]":"I’ve got a pile of exam papers to mark.","definition[8]":"to stay close to a player of the opposite team during a game","signpost[7]":"dirt","definition[9]":"a spot or dirty area on something that spoils its appearance","example[22]":"I can’t get these marks out of my T-shirt.","example[23]":"His feet left dirty marks all over the floor.","example[24]":"The skid marks (=marks left by a car’s tyres) were over 30 feet long.","signpost[8]":"damaged area","definition[10]":"a cut, hole, or other small sign of damage","example[25]":"a burn mark on the kitchen table","note[4]":"burn/scratch/bite etc mark","example[26]":"There were scratch marks all over the victim’s body.","signpost[9]":"coloured area","definition[11]":"a small area of darker or lighter colour on a plain surface such as a person’s skin or an animal’s fur","example[27]":"The kitten is mainly white with black marks on her back.","signpost[10]":"writing","definition[12]":"a shape or sign that is written or printed","example[28]":"What do those strange marks at the top mean?","example[29]":"Make a mark at the bottom of the page.","signpost[11]":"level/number","definition[13]":"a particular level, number, amount etc","example[30]":"The temperature is not expected to reach the 20 degree mark in the next few days.","note[5]":"pass/reach/approach etc the ... mark","example[31]":"In 1976 unemployment in Britain passed the one million mark.","definition[14]":"a letter or number given by a teacher to show how good a student’s work is","note[6]":"full/top marks (=the highest possible mark)","example[32]":"Her marks have been a lot lower this term.","example[33]":"She always gets good marks.","example[34]":"The highest mark was a B+.","note[7]":"good/high mark","example[35]":"The pass mark was 75%.","note[8]":"pass mark","definition[15]":"the standard unit of money used in Germany before the Euro","signpost[12]":"signature","definition[16]":"a sign in the form of a cross, used by someone who is not able to write their name","collocation[0]":"make a mark","example[36]":"Her lipstick had made a mark on his collar.","collocation[1]":"leave a mark","example[37]":"The glass had left a mark on the table.","collocation[2]":"remove a mark","example[38]":"The product removes greasy marks from clothes.","collocation[3]":"a mark comes off/out","example[39]":"I can’t get this dirty mark to come out.","collocation[4]":"a mark fades","example[40]":"His scratch marks have faded, but the memories never will.","form[0]":"ADJECTIVES/NOUN + mark","collocation[5]":"a black mark","example[41]":"There were black marks all over the floor.","collocation[6]":"a dirty mark","example[42]":"What’s that dirty mark on your coat?","collocation[7]":"a greasy mark","example[43]":"It’s good for getting greasy marks off carpet.","collocation[8]":"a tyre mark","example[44]":"The track was pretty soft and there were tyre marks.","collocation[9]":"a skid mark","example[45]":"After the accident, two sets of skid marks were found.","collocation[10]":"a scorch/burn mark","example[46]":"There appeared to be scorch marks on the ceiling.","collocation[11]":"a stretch mark","example[47]":"Most women get stretch marks when they have a baby.","collocation[12]":"a bite mark","example[48]":"Her arms were covered in itchy bite marks.","collocation[13]":"a scratch mark","example[49]":"The chairs had made scratch marks on the floor.","definition[17]":"a dirty area on something that spoils its appearance","example[50]":"The bark of the tree had made black marks on her trousers.","display[0]":"spot","definition[18]":"a small mark on something","example[51]":"a grease spot on my shirt","display[1]":"stain","definition[19]":"a mark that is difficult to remove, especially one made by a dark liquid","example[52]":"a wine stain on the tablecloth","example[53]":"blood stains","display[2]":"smudge","definition[20]":"a mark that is made when something touches against a surface","example[54]":"There was a smudge of lipstick on his cheek.","example[55]":"He had a smudge of chalk on his jacket.","display[3]":"smear","definition[21]":"a mark that is made by a small amount of something spread across a surface","example[56]":"The table had a smear of paint on the top.","display[4]":"fingerprint","definition[22]":"a mark on the surface of something that is made by someone’s fingers","example[57]":"The glass was covered with greasy fingerprints.","heading[0]":"a mark on your skin","display[5]":"blemish","definition[23]":"a mark on your skin that spoils its appearance","example[58]":"John grew a beard to hide the blemishes on his chin.","display[6]":"mole","definition[24]":"a small dark, sometimes raised, mark on your skin","example[59]":"Some moles may become cancerous.","example[60]":"Helena found a mole on her arm which had definitely not been there before.","display[7]":"freckles","definition[25]":"small light brown marks on your skin, especially on your face but also on your arms, shoulders etc","example[61]":"She had a light sprinkling of freckles across her nose.","display[8]":"birthmark","definition[26]":"a permanent mark on your skin that you have had since you were born","example[62]":"There was a small birthmark on her left cheek.","display[9]":"bruise","definition[27]":"a purple or brown mark on your skin that you get because you have fallen or been hit","example[63]":"Her legs were covered in cuts and bruises.","display[10]":"scar","definition[28]":"a permanent mark on your skin, caused by a cut or by something that burns you","example[64]":"The injury left a small scar on his forehead.","display[11]":"pimple/zit","definition[29]":"a small raised red mark or lump on your skin, which usually appears when a child is between 12 and 18 years old","example[65]":"When I was a teenager I had terrible spots.","example[66]":"The boy had a few pimples under his chin.","display[12]":"wart","definition[30]":"a small hard raised mark on your skin caused by a virus","example[67]":"His face was covered in hairy warts.","display[13]":"blister","definition[31]":"a small area of skin that is swollen and full of liquid because it has been rubbed or burned","example[68]":"There was a blister on his arm where the boiling milk had splashed him.","display[14]":"rash","definition[32]":"an area of small red spots on your skin, caused by an illness or an allergy","example[69]":"I can’t eat strawberries - they give me a rash.","definition[33]":"20 pounds, 1000 dollars etc","example[70]":"There is usually a fee to be paid, generally around the £100 mark plus VAT.","definition[34]":"to put a sign on something","example[71]":"You must mark all hazardous goods with international danger symbols."}