{"word[0]":"warning","definition[0]":"something, especially a statement, that tells you that something bad, dangerous, or annoying might happen so that you can be ready or avoid it","example[0]":"a warning that grey squirrels are threatening the existence of red squirrels","example[1]":"a warning of floods","note[0]":"warning of","example[2]":"warnings about the dangers of smoking","note[1]":"warning about","example[3]":"This experience should serve as a warning against complacency.","note[2]":"warning against","example[4]":"a warning to pregnant women not to drink alcohol","note[3]":"warning to","definition[1]":"a statement telling someone that if they continue to behave in an unsatisfactory way, they will be punished","note[4]":"written/verbal warning","example[5]":"The Surrey team were given a warning last year for repeated offences.","example[6]":"I’m giving you a final warning – don’t be late again.","collocation[0]":"give a warning","example[7]":"He slammed on the brakes without giving any warning.","collocation[1]":"issue a warning","example[8]":"The government issued a warning about eating raw eggs.","collocation[2]":"deliver/sound a warning","example[9]":"The chairman sounded a warning that jobs could be lost.","collocation[3]":"heed a warning","example[10]":"Drivers failed to heed warnings about fog.","collocation[4]":"ignore a warning","example[11]":"He had ignored their warning to stay in the car.","form[0]":"ADJECTIVES/NOUN + warning","collocation[5]":"advance/prior warning","example[12]":"Workers were given no advance warning of the closure.","collocation[6]":"fair warning","example[13]":"He was given fair warning that such behaviour would not be tolerated.","collocation[7]":"a stern warning","example[14]":"I got a stern warning against giving false information to the police.","collocation[8]":"a stark warning","example[15]":"Cigarette packets carry the stark warning ‘smoking kills’.","collocation[9]":"a health warning","example[16]":"All tobacco products must carry a health warning.","collocation[10]":"a flood/gale/tornado warning","example[17]":"A flood warning has been issued for the River Wye in Herefordshire.","collocation[11]":"without (any) warning","example[18]":"Police fired into the crowd without warning.","collocation[12]":"a word of warning","example[19]":"A word of warning: don’t use too much glue.","definition[2]":"something that you say or do to tell people about danger, or to tell them not to do something","example[20]":"All cigarette packets carry a government health warning.","example[21]":"She ignored her parents' warnings.","example[22]":"The army issued a warning that anyone who was out on the streets after dark was likely to be shot.","display[0]":"caution","definition[3]":"an official warning or a piece of advice telling you to be careful","example[23]":"Caution: do not install electrical equipment near or around water sources.","example[24]":"The video begins with a caution that you must do some warm-up exercises first.","display[1]":"tip-off","definition[4]":"a warning that someone is about to do something, especially one given to the police about a crime","example[25]":"Police were called to the hotel after a tip-off.","display[2]":"alert","definition[5]":"a warning to be ready for possible danger that may happen soon","example[26]":"Twelve flood alerts have been issued to areas along the River Severn.","example[27]":"a fire alert","example[28]":"The ambulance services were on red alert  (=they were ready to take action immediately).","display[3]":"advisory","definition[6]":"an official warning or notice that gives information about a dangerous situation","example[29]":"The air pollution gets so bad on some days that health advisories are posted at park entrances.","display[4]":"caveat","definition[7]":"a warning that something may not be completely true, effective etc. Also used when pointing out that it is important to remember something","example[30]":"The woman was offered treatment, but with the caveat that it had only a 30% chance of success.","example[31]":"One caveat is that you must take the goods back to the shop within 14 days.","example[32]":"There is one important caveat to this argument.","definition[8]":"a warning action or thing tells you that something bad or dangerous might happen","example[33]":"Red warning lights were flashing.","example[34]":"The government ignored all the warning signs.","example[35]":"She said nothing but gave him a warning look.","note[5]":"a warning look/glance","form[1]":"warning + NOUN","collocation[13]":"a warning sign","example[36]":"Don’t ignore the warning signs of stress.","collocation[14]":"a warning shot","example[37]":"Troops fired warning shots over the heads of demonstrators.","collocation[15]":"a warning light","example[38]":"She gave me a warning look, but I carried on.","collocation[16]":"a warning gesture","example[39]":"He put his finger to his lips in a warning gesture."}