{"word[0]":"guilty","signpost[0]":"ashamed","definition[0]":"feeling very ashamed and sad because you know that you have done something wrong","example[0]":"She looked self-conscious and guilty.","example[1]":"It was his guilty conscience that made him offer to help.","example[2]":"I feel really guilty about forgetting her birthday again.","note[0]":"guilty about/for/at","explanation[0]":"In everyday English, people often say that they feel bad about something rather than say that they feel guilty about it:","example[3]":"I feel bad about leaving him on his own.","signpost[1]":"of a crime","definition[1]":"having done something that is a crime","opposite[0]":"innocent","example[4]":"He pleaded guilty to two charges of theft.","example[5]":"The jury found her guilty of murder.","note[1]":"guilty of","example[6]":"He was found not guilty of the death of PC Jones.","definition[2]":"responsible for behaviour that is morally or socially unacceptable","example[7]":"Some journalists are guilty of reporting scandal in order to sell papers.","note[2]":"be guilty of doing something","heading[0]":"GRAMMAR: Prepositions with guilty","explanation[1]":"You feel guilty about/for/at something you have done","example[8]":"She felt guilty about what had happened ","example[9]":"I feel guilty for not doing more to help","explanation[2]":"Someone is guilty of a crime or doing something wrong","example[10]":"They were guilty of murder","example[11]":"The government is guilty of mismanaging the economy","definition[3]":"if someone is guilty of a crime or doing something wrong, they did it, and they should be punished for it","example[12]":"She was found guilty of murder.","example[13]":"He was guilty of serious misconduct.","example[14]":"The two guilty men were ordered to pay damages to their victims.","display[0]":"responsible","definition[4]":"used when saying who should be blamed for something bad that has happened","example[15]":"Police believe a local gang is responsible for the burglaries.","example[16]":"As manager, he is ultimately responsible for the failure of the project.","example[17]":"The other driver was responsible for the accident.","display[1]":"be to blame","definition[5]":"if someone is to blame for a bad situation, they are responsible","example[18]":"The government is partly to blame for the crisis.","example[19]":"If anything goes wrong, it’s never him that is to blame.","display[2]":"culpable","definition[6]":"responsible for something bad or illegal, so that you deserve to be blamed or punished","example[20]":"The people who helped the terrorists are equally culpable for what happened on July 7th.","example[21]":"He pleaded guilty to culpable homicide (=being guilty of causing someone’s death).","display[3]":"negligent","definition[7]":"responsible for something bad that has happened, because you did not take enough care, or you did not try to stop it from happening","example[22]":"The court decided that the railway company was negligent.","display[4]":"be in the wrong","definition[8]":"to be responsible for an accident, mistake etc – used when deciding which person, group etc should be blamed","example[23]":"The other driver was clearly in the wrong.","example[24]":"She always thinks it’s me who is in the wrong.","display[5]":"incriminating","definition[9]":"used about things which seem to show that someone is guilty of a crime","example[25]":"incriminating evidence","example[26]":"incriminating documents","example[27]":"He didn’t want to say anything incriminating."}