{"word[0]":"crash","signpost[0]":"car/plane etc","definition[0]":"to have an accident in a car, plane etc by violently hitting something else","example[0]":"The jet crashed after take-off.","example[1]":"He was drunk when he crashed the car.","note[0]":"crash a car/bus/plane etc","example[2]":"The plane crashed into a mountain.","note[1]":"crash into/onto etc","explanation[0]":"Crash is a reciprocal verb This type of verb is used when saying that two or more people or things do something that involves both or all of them","example[3]":"Two planes crashed in midair","example[4]":"Two planes crashed with each other in midair","example[5]":"One plane crashed with another in midair","signpost[1]":"hit somebody/something hard","definition[1]":"to hit something or someone extremely hard while moving, in a way that causes a lot of damage or makes a lot of noise","example[6]":"The plates went crashing to the ground.","example[7]":"A large branch came crashing down.","example[8]":"A brick crashed through the window.","note[2]":"crash into/through etc","example[9]":"We watched the waves crashing against the rocks.","signpost[2]":"loud noise","definition[2]":"to make a sudden loud noise","example[10]":"Thunder crashed and boomed outside.","definition[3]":"if a computer crashes, or if you crash the computer, it suddenly stops working","example[11]":"The system crashed and I lost three hours’ worth of work.","signpost[3]":"financial","definition[4]":"if a stock market or shares crash, they suddenly lose a lot of value","definition[5]":"to lose very badly in a sports event","example[12]":"Liverpool crashed to their worst defeat of the season.","definition[6]":"to stay at someone’s house for the night","example[13]":"Can I crash at your place on Saturday night?","definition[7]":"to go to bed, or go to sleep very quickly, because you are very tired","example[14]":"I crashed out on the sofa this afternoon.","signpost[4]":"party","definition[8]":"to go to a party that you have not been invited to","example[15]":"We crashed Joe’s party yesterday.","definition[9]":"to hit another vehicle, a tree, the ground etc, with a lot of force, causing a lot of damage","example[16]":"The plane crashed a kilometre from the runway.","example[17]":"He was scared I’d crash his car.","example[18]":"The car crashed into a tree.","definition[10]":"to move into something quickly and with force","example[19]":"He wasn’t paying attention, and almost hit another car.","example[20]":"The car hit a lamppost.","display[0]":"collide","definition[11]":"if two cars, trains, planes etc collide, they hit each other, especially when they are moving in opposite directions","example[21]":"The two planes collided in mid-air.","example[22]":"An express train collided with a freight train in the morning rush hour.","display[1]":"run into something","definition[12]":"to hit a vehicle or object that is directly in front of you, especially because you are not paying attention","example[23]":"He ran into the car in front while he was talking on his mobile phone.","display[2]":"smash into something","definition[13]":"to crash into something, causing a great amount of damage","example[24]":"An army helicopter smashed into the side of the mountain.","display[3]":"plough into","definition[14]":"to crash into something with a lot of force, especially when your vehicle continues moving afterwards","example[25]":"The bus went out of control and ploughed into a line of traffic.","display[4]":"ram","definition[15]":"to deliberately hit another boat or vehicle very hard, especially when it is not moving","example[26]":"The ship had been rammed by a submarine.","example[27]":"The gunmen tried to ram the police car.","definition[16]":"an accident in which a vehicle violently hits something else","note[3]":"a fatal crash (=one in which someone is killed)","example[28]":"a crash victim","example[29]":"Forty-one people were killed in a plane crash.","note[4]":"plane/car/rail crash","example[30]":"She was involved in a head-on crash with a motorbike  (=in which the front of one vehicle directly hits the front of another).","note[5]":"crash between/with","example[31]":"a motorway crash between a coach and a lorry","definition[17]":"a sudden loud noise made by something falling, breaking etc","example[32]":"I heard a loud crash.","example[33]":"The branch came down with a crash.","note[6]":"with a crash","example[34]":"a crash of thunder","note[7]":"crash of","definition[18]":"an occasion when a computer or computer system suddenly stops working","definition[19]":"an occasion on which the stocks and shares in a stock market suddenly lose a lot of value","example[35]":"the stock market crash of October 1987","form[0]":"ADJECTIVES/NOUN + crash","collocation[0]":"a car/train/plane etc crash","example[36]":"He was badly hurt in a car crash.","collocation[1]":"a road/rail/air crash","example[37]":"There will be an investigation into the cause of the air crash.","collocation[2]":"a head-on crash","example[38]":"He died in a head-on crash with a lorry.","collocation[3]":"a fatal crash","example[39]":"There have been several fatal crashes on this road.","collocation[4]":"a high-speed crash","example[40]":"the risk of injury from a high-speed crash","collocation[5]":"a horrific/terrible/appalling crash","example[41]":"a horrific crash in which three teenage boys were killed","collocation[6]":"have a crash","example[42]":"I’ve been nervous about driving since I had a crash last year.","collocation[7]":"a crash happens/occurs","example[43]":"The three-vehicle crash happened on the corner of Ongar Road.","collocation[8]":"a crash involves something","example[44]":"Two women were taken to hospital after a crash involving a bus and a car.","form[1]":"crash + NOUN","example[45]":"Families of the crash victims want to know what happened.","collocation[9]":"a crash site/scene","example[46]":"The authorities closed off a five-mile area around the crash site.","collocation[10]":"a crash investigator","example[47]":"Crash investigators spent several days examining the scene.","definition[20]":"a time when many stocks and shares lose a lot of their value very quickly, usually when investors lose confidence in the market and want to sell quickly","definition[21]":"an occasion when a computer or a piece of computer software suddenly stops working","example[48]":"If you don’t save your work and there’s a crash, you’ll lose everything you’ve done.","definition[22]":"if stockmarkets or shares crash, they suddenly lose a lot of value","example[49]":"The cost of the project has soared, causing the shares to crash 11p to 329p.","definition[23]":"if a computer or a piece of software crashes, or if you crash it, it suddenly stops working properly","example[50]":"The memory was completely overloaded, causing the system to crash.","example[51]":"an error which crashed the whole system"}