{"word[0]":"respect","signpost[0]":"admiration","definition[0]":"a feeling of admiring someone or what they do, especially because of their personal qualities, knowledge, or skills","example[0]":"I have the greatest respect for Jane’s work.","note[0]":"respect for","signpost[1]":"consideration","definition[1]":"the belief that something or someone is important and should not be harmed, treated rudely etc","opposite[0]":"disrespect","example[1]":"The boys showed a complete lack of respect for authority.","example[2]":"Out of respect for the wishes of her family, the affair was not reported in the media.","example[3]":"Your mother should be treated with respect.","note[1]":"with respect","signpost[2]":"for danger","definition[2]":"a careful attitude towards something or someone that could be dangerous","example[4]":"People should have a healthy respect for alcohol  (=a sensible careful attitude towards it).","example[5]":"My fear turned into a respect for the sea.","heading[0]":"– Meaning 1: a feeling of admiring someone or what they do, especially because of their personal qualities, knowledge, or skills","collocation[0]":"have respect for somebody","example[6]":"I have a lot of respect for my boss.","collocation[1]":"win/earn/gain respect","example[7]":"Morris eventually won the respect of his fellow workers.","collocation[2]":"command respect","example[8]":"Lady Thatcher commanded huge respect from everyone she worked with.","collocation[3]":"deserve respect","example[9]":"Nurses deserve our respect and admiration.","collocation[4]":"lose respect for somebody","example[10]":"She had lost all respect for him.","collocation[5]":"lose somebody’s respect","example[11]":"Once a child knows you have lied, you will lose their respect.","collocation[6]":"great respect","example[12]":"Rex and Joe had great respect for his judgement.","collocation[7]":"the utmost respect","example[13]":"I have the utmost respect for the prime minister.","collocation[8]":"mutual respect","example[14]":"Their relationship is based on mutual respect.","collocation[9]":"grudging respect","example[15]":"Initially his idea was seen as far-fetched, but gradually it has received grudging respect and support.","heading[1]":"– Meaning 2: the belief that something or someone is important and should not be harmed, treated rudely etc","collocation[10]":"show respect","example[16]":"We were taught to show respect for older people.","collocation[11]":"treat somebody/something with respect","example[17]":"Everyone has a right to be treated with respect.","collocation[12]":"have respect for somebody/something","example[18]":"These kids have no respect for authority.","collocation[13]":"get respect","example[19]":"You get more respect if you dress smartly.","collocation[14]":"proper/due respect","example[20]":"‘I want proper respect, ’ said Mother.","collocation[15]":"deep respect","example[21]":"The islanders have a deep respect for the ocean.","collocation[16]":"a lack of respect","example[22]":"They blame youth crime on unemployment and lack of respect for the law.","collocation[17]":"as a mark of respect","example[23]":"Flags were flown at half mast as a mark of respect for the dead seamen.","definition[3]":"to admire someone because they have high standards and good qualities such as fairness and honesty","example[24]":"I respect his views, although I do not agree with them.","example[25]":"She respected him for his honesty.","note[2]":"respect somebody for (doing) something","definition[4]":"to be careful not to do anything against someone’s wishes, rights etc","example[26]":"She said she wanted to leave, and her father respected her wishes.","example[27]":"I would like you to respect my privacy.","example[28]":"the need to respect human rights","definition[5]":"to not break a rule or law","example[29]":"The president is expected to respect the constitution.","definition[6]":"a left-wing political party in England and Wales which was started in January 2004. Its name is made up of the first letters of the words Respect, Equality, Socialism, Peace, Environmentalism, and Trade Unionism. Its supporters include the film director Ken Loach and the playwright Harold Pinter. One of the party’s most important members is George Galloway. The party’s full name is Respect – The Unity Coalition.","definition[7]":"in payment for","example[30]":"Tesco’s auditors also received £1.2 million in respect of audit work.","definition[8]":"about or concerning","example[31]":"How much time are buyers spending on their purchasing decisions with respect to various products?"}