{"definition[0]":"to make a liquid or other substance flow out of or into a container by holding it at an angle","example[0]":"She poured coffee for everyone.","example[1]":"Pour the oil into a frying pan and heat.","note[0]":"pour something into/out/down etc (something)","example[2]":"The wine was so bad I just poured it away.","note[1]":"pour something away","example[3]":"Why don’t you pour yourself another drink?","note[2]":"pour somebody something","signpost[0]":"liquid/smoke","definition[1]":"if a lot of liquid or smoke pours out, it comes out from somewhere in very large amounts","example[4]":"Smoke was pouring out of the upstairs windows.","note[3]":"pour from/down/out","example[5]":"Blood was pouring from his nose.","signpost[1]":"people or things","definition[2]":"if a lot of people or things pour into or out of a place, a lot of them arrive or leave at the same time","example[6]":"The crowds began pouring out of the stadium.","note[4]":"pour into/out of/from etc","example[7]":"Offers of help poured in from all over the country.","definition[3]":"if light is pouring into or out of a place, a lot of light is coming in or out","example[8]":"Light was pouring into the courtyard.","note[5]":"pour into/out of","example[9]":"Jessica was pouring more wine into her glass.","example[10]":"He poured me a drink.","example[11]":"Raj poured some water from the jug.","display[0]":"drizzle","definition[4]":"to pour a liquid onto food in small drops or in a small stream – often used in cooking instructions","example[12]":"Drizzle a little olive oil onto the bread.","example[13]":"Drizzle the lemon juice over the cake.","definition[5]":"to pour something out of a container by turning it upside down","example[14]":"He tipped the cup of milk into the pan.","example[15]":"She weighed out the flour and tipped it into the bowl.","display[1]":"spill","definition[6]":"to accidentally make a liquid or other substance come out of a container","example[16]":"Someone had spilled coffee all over the carpet.","example[17]":"The tanker was leaking, and spilled oil into the sea.","display[2]":"splash","definition[7]":"to pour a liquid quickly in an irregular stream","example[18]":"Tony hurriedly splashed some cream in his coffee.","example[19]":"Someone had splashed petrol over the steps and set light to them.","example[20]":"She splashed some perfume onto her wrists.","display[3]":"decant","definition[8]":"to pour liquid from one container into another container – a rather formal use","example[21]":"Rachel decanted the shampoo into small bottles for travelling.","example[22]":"He often decanted cheap whisky into bottles of more expensive brands."}