{"word[0]":"design","signpost[0]":"process of planning","definition[0]":"the art or process of making a drawing of something to show how you will make it or what it will look like","example[0]":"The new plane is in its final design stage.","example[1]":"the design process","example[2]":"the design team","example[3]":"a course in graphic design","example[4]":"computer-aided design","signpost[1]":"arrangement of parts","definition[1]":"the way that something has been planned and made, including its appearance, how it works etc","example[5]":"The car’s design has been greatly improved.","example[6]":"Some changes have been made to the computer’s basic design.","example[7]":"a design fault","example[8]":"The electric windows are an important design feature of this model.","example[9]":"the design of the new building","note[0]":"design of","signpost[2]":"pattern","definition[2]":"a pattern for decorating something","example[10]":"a floral design","example[11]":"Vinyl flooring is available in a wide range of designs.","signpost[3]":"drawing","definition[3]":"a drawing that shows how something will be made or what it will look like","example[12]":"the design for the new sports centre","note[1]":"design for","signpost[4]":"intention","definition[4]":"a plan that someone has in their mind","example[13]":"He has some grand designs for the company.","example[14]":"We shall never know whether this happened by accident or by design.","note[2]":"by design","heading[0]":"– Meaning 2: the way that something has been planned and made, including its appearance, how it works etc","example[15]":"Good design is very important in a house.","example[16]":"The latest model of the car has a much simpler design.","example[17]":"Many people were against such a modern design in the old city centre.","collocation[0]":"traditional","example[18]":"Our new range of furniture has a traditional design.","collocation[1]":"classical","example[19]":"a large building of classical design","collocation[2]":"the basic design","example[20]":"The basic design of the two churches is very similar.","collocation[3]":"create/produce a design","example[21]":"Use your imagination to create an interesting design in the garden.","collocation[4]":"come up with a design","example[22]":"We asked the architect to come up with another design.","form[0]":"design + NOUN","collocation[5]":"a design feature","example[23]":"The aircraft has some novel design features.","collocation[6]":"a design fault/flaw","example[24]":"If a washing-machine makes too much noise, it’s a design fault.","definition[5]":"to make a drawing or plan of something that will be made or built","example[25]":"The tower was designed by Gilbert Scott.","example[26]":"specially designed software","example[27]":"a badly designed office","note[3]":"well/badly etc designed","example[28]":"She designed a new logo for the company.","note[4]":"design something for something","definition[6]":"to plan or develop something for a specific purpose","example[29]":"These exercises are designed to strengthen muscles.","note[5]":"be designed to do something","example[30]":"The course is designed for beginners.","note[6]":"be designed for somebody/something","example[31]":"The book is designed as a reference manual.","note[7]":"be designed as something","explanation[0]":"Design is usually passive in this meaning","definition[7]":"the way in which something has been planned and made, including its appearance, how it works etc","example[32]":"One or two changes have been made to the computer’s basic design.","example[33]":"a company that believes in the importance of good design","definition[8]":"the process of making a drawing of something to show how it will be made or what it will look like","example[34]":"The theatre was designed by a local architect.","example[35]":"a well-designed office","example[36]":"There were too many badly built, badly designed vehicles.","example[37]":"software that is designed to work in Microsoft Windows","example[38]":"The course is designed for people who are learning business English.","note[8]":"be designed for","example[39]":"The program is designed as an incentive for Iowa companies to create new jobs.","note[9]":"be designed as"}