{"word[0]":"rumour","definition[0]":"information or a story that is passed from one person to another and which may or may not be true","example[0]":"I’ve heard all sorts of rumours about him and his secretary.","note[0]":"rumour about/of","example[1]":"There’s an unsubstantiated rumour that Eddie is bankrupt.","note[1]":"rumour that","collocation[0]":"a rumour spreads","example[2]":"A rumour spread that he had been killed.","collocation[1]":"a rumour goes around","example[3]":"There are a lot of rumors going around that they’re going to sell the company.","example[4]":"Not long afterwards, ugly rumours began to circulate.","collocation[2]":"rumour has it","example[5]":"Rumour has it that they plan to get married.","collocation[3]":"rumours fly around","example[6]":"There were wild rumours flying around the office on Wednesday.","collocation[4]":"hear a rumour","example[7]":"I heard a rumour that she was leaving.","collocation[5]":"spread a rumour","example[8]":"Someone has been spreading rumours about us.","collocation[6]":"deny a rumour","example[9]":"He is denying rumors that he plans to drop out of the race.","collocation[7]":"confirm a rumour","example[10]":"The actor’s agent would not confirm the rumour.","collocation[8]":"false/unfounded","example[11]":"He says that the rumours are completely unfounded.","example[12]":"False rumors began to spread that troops were massing on the border.","collocation[9]":"rumours are rife","example[13]":"Rumours were rife that the band had refused to play.","collocation[10]":"a widespread rumour","example[14]":"The arrests followed widespread rumours of police corruption.","collocation[11]":"a persistent rumour","example[15]":"Despite persistent rumours of an affair, his wife stood by him.","collocation[12]":"a strong rumour","example[16]":"There is a strong rumour that the government is planning to drop the idea.","collocation[13]":"a wild rumour","example[17]":"It has been a week of wild rumour and exaggeration.","collocation[14]":"a malicious rumour","example[18]":"The claims were dismissed by the government as ‘malicious rumours’.","collocation[15]":"an ugly/nasty rumour","example[19]":"Ugly rumours persisted that there had been a cover-up.","collocation[16]":"an unsubstantiated rumour","example[20]":"These are only unsubstantiated rumours.","collocation[17]":"a scurrilous rumour","example[21]":"Journalists spread scurrilous rumours about the school.","collocation[18]":"wild rumours","example[22]":"This led to wild rumours of American involvement in the attack.","example[23]":"The band denied the rumours that they may be splitting up.","example[24]":"The truth finally came out after months of rumour.","example[25]":"I’ve heard rumours about a ghost in the building.","display[0]":"speculation","definition[1]":"a situation in which a lot of people are talking about something that is happening, especially something that is happening in politics or public life, and trying to guess what the truth is","example[26]":"There was a great deal of speculation about a possible merger involving Belgium’s largest banks.","example[27]":"The report fuelled speculation  (=caused more speculation) that he was about to resign.","example[28]":"His future as a player has been the subject of intense speculation.","definition[2]":"things that people say about what they think has happened in other people’s private lives, which is usually not true","example[29]":"She tells me all the latest gossip from the office.","example[30]":"The magazine was full of gossip about celebrities.","example[31]":"You shouldn’t believe every piece of gossip you hear.","definition[3]":"something that people talk about a lot but which is not official","example[32]":"The government has dismissed talk of a military strike on the country.","example[33]":"There’s been a lot of talk of him resigning.","display[1]":"hearsay","definition[4]":"something that you have heard from someone else, but cannot prove whether it is true or untrue – often used in legal contexts","example[34]":"All the accounts were based on hearsay rather than eye-witness reports.","example[35]":"hearsay evidence","definition[5]":"information that is passed from one person to another and which may or may not be true","example[36]":"A spokesman denied rumours that the company was considering abandoning the U.S. market."}