{"word[0]":"belief","definition[0]":"the feeling that something is definitely true or definitely exists","example[0]":"a strong belief in God","note[0]":"belief in","example[1]":"her sincere belief that her brother was not the murderer","note[1]":"belief that","example[2]":"Thieves broke into the building in the mistaken belief that there was expensive computer equipment inside.","note[2]":"in the belief that","definition[1]":"the feeling that something is good and can be trusted","example[3]":"When you get something wrong, it can shake your belief in yourself.","example[4]":"If you’re selling, you have to have genuine belief in the product.","definition[2]":"an idea that you believe to be true, especially one that forms part of a system of ideas","example[5]":"religious beliefs","example[6]":"Several members hold very right-wing beliefs.","collocation[0]":"a firm/strong belief","example[7]":"It is still my firm belief that we did the right thing.","collocation[1]":"a strongly-held/deeply-held belief","example[8]":"her strongly-held belief that things were much better in the past","collocation[2]":"a common/popular/widespread belief","example[9]":"There is a common belief that educational standards are declining.","collocation[3]":"a widely-held belief","example[10]":"The article expressed the widely-held belief that unemployment leads to crime.","collocation[4]":"a mistaken/false belief","example[11]":"the mistaken belief that cannabis is not an addictive drug","collocation[5]":"a sincere belief","example[12]":"We have a sincere belief in the power of art to enhance human life.","collocation[6]":"a passionate belief","example[13]":"his passionate belief that technology is a tool to be used for the benefit of mankind","collocation[7]":"have a belief","example[14]":"You must always have the belief that you can succeed.","collocation[8]":"hold a belief","example[15]":"He held this belief until the day he died.","collocation[9]":"be based on the belief that …","example[16]":"Our policies must be based on the belief that the planet’s resources are finite.","collocation[10]":"it is my belief that","example[17]":"It is my belief that most teachers are doing a good job.","collocation[11]":"contrary to popular belief","example[18]":"Contrary to popular belief, boys are not usually better at maths than girls."}