{"word[0]":"meet","past_tense[0]":"met","signpost[0]":"see somebody at an arranged place","definition[0]":"to go to a place where someone will be at a particular time, according to an arrangement, so that you can talk or do something together","example[0]":"Meet me at 8.00.","example[1]":"I’ll meet you by the main reception desk.","example[2]":"We arranged to meet outside the theatre.","example[3]":"Why don’t we meet for lunch on Friday?","note[0]":"meet (somebody) for something","explanation[0]":"Meet is never passive in this meaning","signpost[1]":"see somebody by chance","definition[1]":"to see someone by chance and talk to them","synonym[0]":"bump into","example[4]":"You’ll never guess who I met in town.","example[5]":"I was worried I might meet Henry on the bus.","signpost[2]":"see somebody for the first time","definition[2]":"to see and talk to someone for the first time, or be introduced to them","note[1]":"(it was) nice meeting you (=used to say goodbye politely to someone you have just met for the first time)","example[6]":"We first met in Florence.","example[7]":"I met my husband at university.","example[8]":"Jane, come and meet my brother.","example[9]":"‘This is my niece, Sarah.’ ‘Pleased to meet you.’","note[2]":"nice/pleased to meet you","signpost[3]":"see somebody at an airport/station etc","definition[3]":"to be waiting for someone at an airport, station etc when they arrive in a plane or train","example[10]":"My dad met us at the station.","example[11]":"She got off the plane to be met by reporters.","signpost[4]":"come together to discuss something","definition[4]":"to come together in the same place in order to discuss something","example[12]":"The committee meets once a month.","example[13]":"The two groups will meet next week to discuss the project.","signpost[5]":"compete against somebody","definition[5]":"to play against another person or team in a competition, or to fight another army in a war","example[14]":"Manchester United will meet Blackburn Rovers in the sixth round of the Cup.","example[15]":"The two armies finally met on the battlefield at Stamford Bridge.","signpost[6]":"join or touch","definition[6]":"if two things meet, they touch or join at a particular place","example[16]":"The two roads meet just north of Flagstaff.","example[17]":"My hand met his under the table.","signpost[7]":"experience a problem or situation","definition[7]":"to experience a problem, attitude, or situation","synonym[1]":"encounter","example[18]":"Wherever she went she met hostility and prejudice.","explanation[1]":"Meet is a reciprocal verb This type of verb is used when saying that two or more people do something that involves both or all of them It does not need to have an object In this sentence, meet is intransitive and does not have an object","example[19]":"We met when we were at college ","explanation[2]":"In these sentences, meet is transitive","example[20]":"We met each other when we were at college","example[21]":"I met him when we were at college","definition[8]":"to be in the same place as someone else because you have arranged to see them","example[22]":"I’ll meet you at the restaurant, OK?","example[23]":"The two leaders are scheduled to meet again next month.","display[0]":"get together","definition[9]":"to meet with a group of people, in order to do something together","example[24]":"Why don’t we all get together and go out for a drink?","example[25]":"Have the students get together in groups of four to work on the problem.","display[1]":"come together","definition[10]":"if people come together, they meet in order to discuss things, exchange ideas etc","example[26]":"Goldman persuaded the heads of the groups to come together for an informal conference.","display[2]":"meet up","definition[11]":"if friends meet up, they meet in order to do something together","example[27]":"We must meet up some time.","example[28]":"Why don’t I meet up with you after lunch?","display[3]":"gather","definition[12]":"if people gather somewhere, they come together in the same place in order to do something or see something","example[29]":"Fans have started to gather outside the stadium.","example[30]":"Angry crowds gathered in front of the US embassy.","display[4]":"assemble","definition[13]":"if people assemble somewhere, they all come and stand together in the same place, especially as part of an officially arranged plan","example[31]":"If the fire alarm rings, please assemble in the parking lot.","example[32]":"The students began to assemble in the main hall.","definition[14]":"an occasion when a group of people riding horses go out to hunt foxes","definition[15]":"right or suitable","definition[16]":"to get together with another person to discuss something","example[33]":"The directors met again yesterday evening to discuss the crisis.","example[34]":"She spends a lot of time travelling to meet clients.","example[35]":"Bank officials will meet with company representatives later this week.","note[3]":"meet with","definition[17]":"to pay a debt or payment","example[36]":"The firm is having trouble meeting its debt payments.","definition[18]":"to achieve a level that has been set or expected","example[37]":"The car has failed to meet company sales targets.","example[38]":"The company has not met its growth projections.","definition[19]":"to produce enough goods to satisfy the demand for them","example[39]":"The company is operating both its plants at 100% capacity to meet the increased demand.","definition[20]":"to finish something at or before the time it was meant to be finished","example[40]":"The firm failed to meet the 31 March deadline for submitting the report.","definition[21]":"to succeed in doing something that you have to do","example[41]":"Although it has failed to meet certain financial requirements, the company believes it can meet the conditions in the future.","definition[22]":"to agree to some of the things that someone is demanding in an effort to reach an agreement with them","example[42]":"The company has offered to meet the unions halfway in their pay demands.","definition[23]":"a meeting","example[43]":"Let’s see if we can fix up a meet sometime next week."}