{"word[0]":"knock","signpost[0]":"door","definition[0]":"to hit a door or window with your closed hand to attract the attention of the people inside","example[0]":"I knocked and knocked but nobody answered.","example[1]":"Wilson went up and knocked on the door.","example[2]":"We knocked at the door but there was no one there.","note[0]":"knock at/on","signpost[1]":"hit and move something","definition[1]":"to hit something with a short quick action so that it moves or falls","example[3]":"As I got up, I knocked a pencil out of its holder.","note[1]":"knock something out of/from something","example[4]":"He knocked the knife from my hand.","example[5]":"At that moment, Sally knocked over her glass of wine.","note[2]":"knock something over","example[6]":"She tried to knock the gun aside but she was not fast enough.","note[3]":"knock something aside","signpost[2]":"hit somebody hard","definition[2]":"to hit someone very hard","example[7]":"He knocked her to the ground and kicked her.","example[8]":"Garry answered the door only to be knocked flying as two policemen came rushing in.","example[9]":"Simon could knock a man unconscious with one punch to the jaw.","note[4]":"knock somebody unconscious/cold/senseless","signpost[3]":"hit part of your body","definition[3]":"to hit something with part of your body","example[10]":"Morse knocked his shin against a suitcase that had been left just inside the door.","note[5]":"knock something against something","example[11]":"She knocked her head on a stone.","note[6]":"knock something on something","signpost[4]":"remove wall","definition[4]":"to remove a wall or part of a building in order to make a bigger room or space","example[12]":"We could make a bigger living space by knocking two rooms into one.","note[7]":"knock something into something","example[13]":"The wall between the kitchen and the dining room has been partially knocked through.","note[8]":"knock something through","definition[5]":"to criticize someone or their work, especially in an unfair or annoying way","example[14]":"The British press always knock British winners at any sport.","example[15]":"‘Designer fashion is silly.’ ‘Don’t knock it; it’s an important industry.’","definition[6]":"to kick or hit a ball somewhere","example[16]":"The aim is to knock the ball into the opposing goal.","signpost[5]":"make a noise","definition[7]":"if an engine or pipes etc are knocking, they make a noise like something hard being hit, usually because something is wrong with them","signpost[6]":"heart","definition[8]":"if your heart is knocking, it is beating hard, especially because you are afraid","synonym[0]":"pound","definition[9]":"the sound of something hard hitting a hard surface","example[17]":"a loud knock at the door","example[18]":"a knock in the engine","definition[10]":"the action of something hard hitting your body","example[19]":"He got a knock on the head when he fell.","definition[11]":"if something knocks the price of shares, stocks etc, the price changes very quickly and unexpectedly","example[20]":"Talk of easing the US credit policy knocked prices higher in light trade.","example[21]":"Its shares were knocked by the Kuwait Investment’s Office’s decision to sell 10% of its stake.","definition[12]":"to make it clear that you want to join something or want help from someone","example[22]":"A number of countries are knocking at the European Union’s door.","definition[13]":"something which suddenly makes a product fail or makes prices fall","example[23]":"The US is likely totake a series of knocks from discounting in the car market.","example[24]":"a 612-point knock to the FTSE-index"}