{"word[0]":"promise","definition[0]":"to tell someone that you will definitely do or provide something or that something will happen","example[0]":"Last night the headmaster promised a full investigation.","example[1]":"‘I’ll be back by 1.00.’ ‘Promise?’ ‘Yes! Don’t worry.’","example[2]":"He reappeared two hours later, as promised.","example[3]":"She’s promised to do all she can to help.","note[0]":"promise to do something","example[4]":"Hurry up – we promised we wouldn’t be late.","note[1]":"promise (that)","example[5]":"You promised me the car would be ready on Monday.","note[2]":"promise somebody (that)","example[6]":"‘Promise me you won’t do anything stupid.’ ‘I promise.’","example[7]":"I’ve promised that book to Ian, I’m afraid.","note[3]":"promise something to somebody","example[8]":"The company promised us a bonus this year.","note[4]":"promise somebody something","definition[1]":"to show signs of something","example[9]":"dark clouds promising showers later","example[10]":"Tonight’s meeting promises to be a difficult one.","note[5]":"promise to be something","heading[0]":"GRAMMAR: Patterns with promise","explanation[0]":"You promise to do something","example[11]":"He promised to help","explanation[1]":"You promise  that you will do something","example[12]":"I promise that I will come to your party","explanation[2]":"You promise  someone that you will do something","example[13]":"I promise you that I will come","explanation[3]":"You promised  that you would do something","example[14]":"She promised that she would come","explanation[4]":"You promised  someone that you would do something","example[15]":"My parents promised me that they would buy me a new car","bad_example[0]":"My parents promised me to buy a new car","explanation[5]":"You can also promise someone something","example[16]":"My parents promised me a new car","definition[2]":"to tell someone that you will definitely do something, or that something will happen","example[17]":"He promised to give the book back.","example[18]":"The organisers have promised that this year’s event will take place.","display[0]":"swear","definition[3]":"to make a very serious and sincere promise, for example in a law court","example[19]":"He had sworn to tell the truth.","example[20]":"I would never do that, I swear.","display[1]":"give somebody your word","definition[4]":"to promise sincerely that you will do something or that something is true – often used when you are trying to persuade someone that they can trust you","example[21]":"I give you my word that your money is safe with me.","example[22]":"I’ll let you go out tonight if you give me your word that you’ll be home by 11.","display[2]":"vow","definition[5]":"to make a very serious promise, often to yourself","example[23]":"She vowed that she would never drink alcohol again.","example[24]":"They vowed to carry on their campaign for justice.","display[3]":"assure","definition[6]":"to promise someone that something will happen or that something is true, in order to try to make them feel less worried","example[25]":"Police have assured the public that they are doing everything they can to find the killer.","display[4]":"guarantee","definition[7]":"to promise that you will make sure that something will definitely happen, so that there is no question of it not happening","example[26]":"I guarantee that you will have the documents by tomorrow.","example[27]":"How can you guarantee that this won’t happen again?","display[5]":"pledge","definition[8]":"to promise publicly or officially that you will do something, for example to give help or money","example[28]":"The government has pledged to increase overseas aid to $4 billion over the next five years.","display[6]":"undertake","definition[9]":"to make an official or legal promise to do something","example[29]":"The government undertook to keep price increases to a minimum.","example[30]":"The two sides undertook to respect each other’s territory.","display[7]":"commit to something","definition[10]":"to make a firm and definite promise to do something important, which will affect you for a long time and which could result in serious effects if you fail","example[31]":"Bobby felt unready to commit to a romantic relationship.","example[32]":"A group of 11 companies has committed to developing a new passenger plane.","definition[11]":"a statement that you will definitely do or provide something or that something will definitely happen","example[33]":"We received promises of support from several MPs.","note[6]":"promise of","example[34]":"He would never break his promise to his father.","note[7]":"promise to","example[35]":"She made a promise to visit them once a month.","example[36]":"I received a promise that this would not happen again.","note[8]":"promise that","definition[12]":"signs that something or someone will be good or successful","example[37]":"a young man full of promise","example[38]":"Bill shows great promise as a goalkeeper.","example[39]":"She didn’t fulfil her early promise.","definition[13]":"a sign that something, usually something good, may happen","example[40]":"the promise of spring","example[41]":"The letter gave a promise of greater happiness.","heading[1]":"– Meaning 1: a statement that you will definitely do or provide something or that something will definitely happen","collocation[0]":"make a promise","example[42]":"I made a promise to my mother that I’d look after Dad.","collocation[1]":"keep a promise","example[43]":"She said she would come back, and she kept her promise.","example[44]":"The mayor has fulfilled his promise to get tough on corruption.","collocation[2]":"break a promise","example[45]":"Once again, the government has broken its promises.","collocation[3]":"go back on your promise","example[46]":"They were angry that the company had gone back on its promise.","collocation[4]":"renege on a promise","example[47]":"It is tempting for the government to renege on its promise.","collocation[5]":"have somebody’s promise","example[48]":"‘It’ll remain a secret?’ ‘Yes, you have my promise.’","collocation[6]":"hold somebody to their promise","example[49]":"The next day, Gareth held me to my promise to take him fishing.","form[0]":"ADJECTIVES/NOUN + promise","collocation[7]":"a solemn promise","example[50]":"As governor, I made a solemn promise to defend the laws of the Republic.","collocation[8]":"a firm promise","example[51]":"What had happened to all those firm promises of help?","collocation[9]":"a vague promise","example[52]":"Larry made some vague promises to leave his wife.","collocation[10]":"a false/empty/hollow promise","example[53]":"I didn’t make any false promises.","collocation[11]":"a broken promise","example[54]":"There have been too many broken promises.","collocation[12]":"a campaign/election promise","example[55]":"He was accused of breaking a campaign promise not to raise taxes.","heading[2]":"– Meaning 2: signs that something or someone will be good or successful","collocation[13]":"show promise","example[56]":"She showed promise as a singer at an early age.","collocation[14]":"hold promise","example[57]":"The Internet clearly held great promise as an educational tool.","collocation[15]":"fulfil your/its promise","example[58]":"This young player has begun to fulfil his promise.","example[59]":"The rest of this movie never quite lives up to the promise of that opening moment.","collocation[16]":"great promise","example[60]":"He’d initially shown great promise as a goalkeeper.","collocation[17]":"early promise","example[61]":"Tracey showed early promise in mathematics.","definition[14]":"a statement that you will definitely do or provide something, which may not be reliable","example[62]":"‘I’ll call you tomorrow.’ ‘Is that a promise?’","example[63]":"Politicians are always making promises.","definition[15]":"a public or official promise to do a particular thing in the future","example[64]":"The Government has fulfilled at least 50% of its election pledges.","example[65]":"We have received pledges of help from various organizations.","definition[16]":"a very serious promise to do something or not to do something that you choose to make","example[66]":"He made a vow never to drink alcohol again.","example[67]":"your marriage vows","display[8]":"oath","definition[17]":"a formal promise, especially one that someone makes in a court of law","example[68]":"Witnesses swear a solemn oath to tell the truth.","example[69]":"Public officials must take an oath to support the US Constitution.","display[9]":"undertaking","definition[18]":"a serious or public promise to do something, especially something difficult which needs a lot of effort or money","example[70]":"The police have given an undertaking to reduce street crime in the city centre.","example[71]":"He was made to sign a written undertaking that he would not go within a mile of her house.","display[10]":"assurance","definition[19]":"a promise that something will happen or is true, made so that someone is less worried or more confident","example[72]":"You have my assurance that it won’t happen again.","example[73]":"The manager gave me his personal assurance that the goods would be delivered today.","definition[20]":"a very definite promise that something will happen. A guarantee is also a formal written promise by a company to repair or replace a product free if it has a fault within a fixed period of time.","example[74]":"With any diet, there’s no guarantee of success.","example[75]":"I’m afraid I can’t give you a 100% guarantee.","example[76]":"Is the camera still under guarantee (=within the period during which it can be repaired or replaced free)?"}