{"word[0]":"gain","signpost[0]":"get something","definition[0]":"to obtain or achieve something you want or need","example[0]":"After gaining independence in 1957, it was renamed ‘Ghana’.","example[1]":"Radical left-wing parties gained control of local authorities.","note[0]":"gain control/power","example[2]":"He gained a doctorate in Chemical Engineering.","note[1]":"gain a degree/qualification etc","explanation[0]":"In everyday English, people usually say get rather than gain:","example[3]":"She got a degree in English.","signpost[1]":"get gradually","definition[1]":"to gradually get more and more of a quality, feeling etc, especially a useful or valuable one","example[4]":"She has gained a reputation as a good communicator.","example[5]":"Many of his ideas have gained popular support.","example[6]":"an opportunity to gain experience in a work environment","example[7]":"The youngsters gradually gain confidence in their abilities.","example[8]":"The sport has gained in popularity in recent years.","note[2]":"gain in","signpost[2]":"advantage","definition[2]":"to get an advantage from a situation, opportunity, or event","example[9]":"an attempt to gain a competitive advantage over their rivals","example[10]":"Who really stands to gain (=is likely to get an advantage) from these tax cuts?","example[11]":"There’s nothing to be gained (=it will not help you) by losing your temper.","example[12]":"There is much to be gained from seeking expert advice early.","note[3]":"gain (something) from (doing) something","definition[3]":"to increase in weight, speed, height, or value","example[13]":"Carrie’s gained a lot of weight recently.","example[14]":"The dollar has gained 8% against the yen.","signpost[3]":"clock","definition[4]":"if a clock or watch gains, or if it gains time, it goes too fast","opposite[0]":"lose","definition[5]":"to reach a place after a lot of effort or difficulty","example[15]":"The swimmer finally gained the river bank.","collocation[0]":"gain control","example[16]":"The government of mainland China gained control of the island in 1683.","collocation[1]":"gain power","example[17]":"Many women wanted to gain power in a male-dominated world.","collocation[2]":"gain independence","example[18]":"Jamaica has had this flag since 1962, when it gained independence from Britain.","collocation[3]":"gain a reputation","example[19]":"He had gained a reputation as a crook.","collocation[4]":"gain notoriety","example[20]":"He gained notoriety as the author of a controversial novel.","collocation[5]":"gain support","example[21]":"The proposal failed to gain support.","collocation[6]":"gain popularity","example[22]":"Governments gain popularity by cutting taxes.","collocation[7]":"gain acceptance","example[23]":"The theory has gradually gained acceptance among scientists.","collocation[8]":"gain credibility","example[24]":"Screen actors feel that they gain credibility when they perform on stage.","collocation[9]":"gain experience","example[25]":"In her first job, she gained experience as a programme manager.","collocation[10]":"gain knowledge","example[26]":"Knowledge gained from the research will be used directly to help patients.","collocation[11]":"gain confidence","example[27]":"The managers were gaining confidence in their ability to take calculated risks.","collocation[12]":"gain strength","example[28]":"He is beginning to gain strength again after his illness.","collocation[13]":"gain an understanding","example[29]":"Drama is one of the key ways in which children can gain an understanding of themselves and of others.","collocation[14]":"gain an insight (into something)","example[30]":"You can gain an insight into horses’ feelings by the physical signs they give out.","collocation[15]":"gain momentum","example[31]":"In the 1850s and 1860s, the British colonisation of India gained momentum.","collocation[16]":"quickly/rapidly gain something","example[32]":"Adam quickly gained the respect of the soldiers under his command.","collocation[17]":"steadily gain something","example[33]":"The king was steadily gaining more support.","collocation[18]":"gradually gain something","example[34]":"He is gradually gaining confidence in his own abilities.","definition[6]":"an advantage or improvement, especially one achieved by planning or effort","example[35]":"The party made considerable gains at local elections.","example[36]":"substantial gains in efficiency","example[37]":"the potential gains from improved marketing","note[4]":"gain from","example[38]":"There are obvious gains for the student.","note[5]":"gain to/for","definition[7]":"an increase in the amount or level of something","opposite[1]":"loss","example[39]":"The Democratic Party needed a net gain of only 20 votes.","example[40]":"Eating too many fatty foods could cause weight gain.","example[41]":"a gain in weekly output","example[42]":"Retail sales showed a gain of 0.4%.","note[6]":"gain of","signpost[4]":"profit","definition[8]":"financial profit, especially when this seems to be the only thing someone is interested in","example[43]":"They are seeking to realize the maximum financial gain.","note[7]":"financial/economic/capital etc gain","example[44]":"a pre-tax gain of $20 million","example[45]":"Such research should not be for personal gain.","note[8]":"for gain","definition[9]":"to get or achieve something important or valuable, usually by working very hard","example[46]":"We hope togain a largershare of the local market.","example[47]":"BP America shared the knowledge gained from the disaster with other oil companies.","definition[10]":"to gradually get more of a useful or valuable quality, skill etc","example[48]":"Donald gained a lot of usefulexperience when he was working for a merchant bank.","example[49]":"Employees will gain in knowledge and confidence by making full use of the training opportunities.","definition[11]":"to increase in value or amount","example[50]":"Standard & Poor’s 500-stock index gained slightly, closing up 3.75 points.","example[51]":"Production in both China and India gained while domestic consumption slowed.","example[52]":"For the week, the Dow industrials gained 39.85 points.","definition[12]":"if a currency, share, or financial market gains ground, it increases in value","example[53]":"The stock market gained ground after two days of losses.","example[54]":"The dollar gained ground against  (=compared to) foreign currencies.","note[9]":"gain ground against","definition[13]":"to gradually become more popular, successful etc","example[55]":"The retailer has gained ground, with sales up 12.2%.","example[56]":"Aluminium has been gaining ground against  (=compared to) more traditional metals.","note[10]":"gain ground against/on","example[57]":"GM’s trucks are gaining ground on Ford’s F series.","example[58]":"Some countries depreciated their currencies so as to gain a competitive advantage over their trading rivals.","example[59]":"Malaysia has not always gained greatly from the sales of assets such as shares in its airline.","note[11]":"gain (something) from something","example[60]":"People with higher incomes clearly gained more from the tax cuts.","example[61]":"The management group owns about 18% of the stock and would stand to gain millions of dollars if the company were sold.","definition[14]":"to reach a position from which you can start to make progress and achieve your aims","example[62]":"European television groups will be ready to pay substantial amounts to gain a foothold in the UK market.","definition[15]":"to become more popular","example[63]":"The new idea was gaining currency.","definition[16]":"if a country or company gains access to a place, it is able to sell its products there for the first time","example[64]":"The government’s aim is to help US companies gain access to foreign markets.","example[65]":"US computer makers have accused the Japanese of selling machines at steep discounts to gain access to markets where they are not competitive.","definition[17]":"to manage to use something, especially something that is difficult to obtain","example[66]":"The program allows a hacker to secretly gain access to computer systems.","definition[18]":"if a plan, proposal etc gains approval, it is officially accepted","example[67]":"The company did not gain approval from the planning commission for the new building.","definition[19]":"become more popular","example[68]":"Insurance-funded plans are gaining in popularity because they are not subject to tax.","example[69]":"The supermarket chain’s share price ended the year with a near 60% gain.","example[70]":"The Nikkei average ended with a gain of 140.19 points at 35,522.99.","example[71]":"gains in consumer spending","example[72]":"a 50 point gain in the Dow Jones industrial average on the New York Stock Exchange","definition[20]":"financial profit","example[73]":"Developers cut down the forestsfor economic gain.","example[74]":"The senator denied the charge that he was using his office for personal gain.","definition[21]":"an advantage or improvement","example[75]":"The new machinery has produced bigefficiency gains.","definition[22]":"money or an advantage obtained dishonestly","example[76]":"The police now have been given more powers to crack down on drug dealers and seize their ill-gotten gains."}