{"word[0]":"Comfort","definition[0]":"a type of fabric conditioner (=liquid for making clothes feel soft), sold in the UK","signpost[0]":"physical","definition[1]":"a feeling of being physically relaxed and satisfied, so that nothing is hurting you, making you feel too hot or cold etc","example[0]":"I dress for comfort, not fashion.","example[1]":"Alan was very reluctant to leave the warmth and comfort of the fire.","example[2]":"Now you can watch your favorite movies in the comfort of your own home.","example[3]":"All our sports shoes are designed for comfort and performance.","note[0]":"built/made/designed for comfort","example[4]":"The temperature was too low for comfort.","note[1]":"too hot/high/tight etc for comfort","example[5]":"Upstairs is a more intimate bar where guests can relax in comfort.","note[2]":"in comfort","signpost[1]":"emotional","definition[2]":"if someone or something gives you comfort, they make you feel calmer, happier, or more hopeful after you have been worried or unhappy","example[6]":"Whenever he was upset, he would turn to her for comfort and advice.","example[7]":"a book which offers comfort and help to the parents of children with cancer","note[3]":"give/bring/provide/offer comfort","example[8]":"The knowledge that Cara was safe gave him some comfort.","example[9]":"My faith has been a source of great comfort over the years.","note[4]":"great/much/little comfort","example[10]":"He drew comfort from her warm support.","note[5]":"take/draw/derive comfort from (doing) something","example[11]":"You can take some comfort in the fact that you did your best.","note[6]":"find/take comfort in (doing) something","example[12]":"It was no comfort to think he might be as frightened as she was.","note[7]":"it’s no/some comfort","example[13]":"Well, if it’s any comfort, I don’t think he’ll try again.","note[8]":"if it’s any comfort","signpost[2]":"somebody/something that helps","definition[3]":"someone or something that helps you feel calmer, happier, or more hopeful after you have been worried or unhappy","example[14]":"It’s a comfort to know there’s someone to keep an eye on the kids.","example[15]":"Louisa’s been a great comfort to me since Mary died.","note[9]":"be a comfort (to somebody)","signpost[3]":"money/possessions","definition[4]":"a way of living in which you have all the money and possessions that you need or want","example[16]":"He was used to a life of comfort.","example[17]":"When Dad died, he left us both enough to live in comfort for the rest of our lives.","heading[0]":"– Meaning 2: if someone or something gives you comfort, they make you feel calmer, happier, or more hopeful after you have been worried or unhappy","collocation[0]":"take comfort from something","example[18]":"The family has taken comfort from the support of friends.","collocation[1]":"draw/derive comfort from something","example[19]":"Economists have been quick to draw comfort from the latest figures.","collocation[2]":"find/take comfort in something","example[20]":"He had been through a similar experience and she found comfort in that.","collocation[3]":"offer (somebody) comfort","example[21]":"Volunteers are available to offer comfort and advice.","collocation[4]":"give (somebody) comfort","example[22]":"It was impossible to give her any comfort.","collocation[5]":"bring (somebody) comfort","example[23]":"Religious belief can bring comfort during times of stress.","collocation[6]":"provide comfort","example[24]":"Talking about your problems may provide some comfort.","collocation[7]":"seek comfort","example[25]":"People come to us seeking comfort and guidance.","collocation[8]":"great comfort","example[26]":"Your letters have been a great comfort to me.","collocation[9]":"cold/small comfort","example[27]":"The tax changes will provide cold comfort to people living on a pension.","collocation[10]":"a word of comfort","example[28]":"He tried to find some words of comfort that would help her.","collocation[11]":"a source of comfort","example[29]":"Some people eat as a source of comfort.","collocation[12]":"a crumb of comfort","example[30]":"‘You’re no worse than the rest, ’ the football coach said, trying to offer me a crumb of comfort.","example[31]":"If it’s any comfort, you very nearly passed the exam.","form[0]":"comfort + NOUN","collocation[13]":"comfort food","example[32]":"I find pasta and cheese is a great comfort food.","definition[5]":"to make someone feel less worried, unhappy, or upset, for example by saying kind things to them or touching them","example[33]":"Within hours of the news, Helen arrived to comfort her heartbroken friend.","example[34]":"He longed to take her in his arms and comfort her.","example[35]":"Mr Aston’s father was last night being comforted by relatives.","example[36]":"She comforted herself with the thought that it would soon be spring.","note[10]":"comfort yourself"}