{"word[0]":"doctor","definition[0]":"someone who is trained to treat people who are ill","example[0]":"She was treated by her local doctor.","example[1]":"I’d like to make an appointment to see Dr Pugh.","example[2]":"‘Where’s Sandy today?’ ‘I think she’s at the doctor’s.’","note[0]":"the doctor’s","definition[1]":"someone who holds the highest level of degree given by a university","example[3]":"a Doctor of Law","collocation[0]":"go to the doctor","example[4]":"I’d been having bad headaches so I went to the doctor.","collocation[1]":"see a doctor","example[5]":"Have you seen a doctor about it yet?","collocation[2]":"ask a doctor","example[6]":"If you have any of these symptoms, you should consult a doctor.","collocation[3]":"call a doctor","example[7]":"His mother was very worried and called the doctor.","collocation[4]":"get a doctor","example[8]":"In the middle of the night we decided to get the doctor.","collocation[5]":"a doctor examines somebody","example[9]":"The doctor examined her and said she had a chest infection.","collocation[6]":"a doctor prescribes something","example[10]":"My doctor prescribed a course of antibiotics.","collocation[7]":"a doctor diagnoses flu/depression etc","example[11]":"The doctor diagnosed malaria.","form[0]":"ADJECTIVES/NOUN + doctor","collocation[8]":"a family doctor","example[12]":"We’ve had the same family doctor for fifteen years.","collocation[9]":"somebody’s local doctor","example[13]":"You should go and see your local doctor.","collocation[10]":"a hospital doctor","example[14]":"Junior hospital doctors have to work very long hours.","definition[2]":"someone who treats people who are ill, who has completed a long course of study at medical school","example[15]":"If you have bad chest pains, you should see a doctor.","display[0]":"GP","definition[3]":"a doctor who is trained in general medicine and who treats the people who live in a local area","example[16]":"My GP told me that I must lose weight.","display[1]":"physician","definition[4]":"a doctor","example[17]":"the American physician, Dr James Tyler Kent","display[2]":"quack","definition[5]":"someone who pretends to be a doctor","example[18]":"My father felt that people practicing alternative medicine were just a bunch of quacks.","display[3]":"the medical profession","definition[6]":"doctors and nurses considered as a group","example[19]":"This view is widely accepted among the medical profession.","display[4]":"surgeon","definition[7]":"a doctor who does operations in a hospital","example[20]":"One of the world’s top heart surgeons performed the operation.","display[5]":"specialist","definition[8]":"a doctor with special knowledge about a particular illness, part of the body, or type of treatment","example[21]":"The new drug is being tested by cancer specialists.","example[22]":"an eye specialist","display[6]":"consultant","definition[9]":"a very senior doctor in a hospital, with a lot of knowledge about a particular area of medicine","example[23]":"The consultant said that he did not think it was cancer.","display[7]":"paramedic","definition[10]":"someone who has been trained to treat sick or injured people, especially at the scene of an accident","example[24]":"Paramedics treated him for shock.","display[8]":"vet","definition[11]":"a doctor who treats animals","example[25]":"We took the cat to the vet.","display[9]":"paediatrician","definition[12]":"a doctor who treats children who are sick","display[10]":"gynaecologist","definition[13]":"a doctor who treats medical conditions and illnesses that affect women’s bodies","display[11]":"obstetrician","definition[14]":"a doctor who deals with the birth of children","display[12]":"radiographer","definition[15]":"someone whose job is to take X-rays or to treat people using an X-ray machine","heading[0]":"a doctor who treats mental illness","display[13]":"psychiatrist","definition[16]":"a doctor who is trained to treat people with mental illnesses","example[26]":"In order to become a psychiatrist, you first need a medical degree.","display[14]":"psychologist","definition[17]":"a scientist who studies and is trained in psychology (=the study of the mind)","example[27]":"Many psychologists believe that aggression is a learned behaviour.","display[15]":"shrink","definition[18]":"a humorous word for a psychiatrist","display[16]":"therapist","definition[19]":"a trained person whose job is to help people with their emotional problems, especially by talking to them and asking them to talk about their feelings","heading[1]":"someone who is studying to be a doctor","display[17]":"medical student","definition[20]":"a student who is studying medicine in order to be a doctor","example[28]":"James is a medical student at Edinburgh university.","display[18]":"intern","definition[21]":"a student who has almost finished studying to be a doctor, and who is working in a hospital","definition[22]":"to dishonestly change something in order to gain an advantage","example[29]":"He had doctored his passport to pass her off as his daughter.","example[30]":"There are concerns that some players have been doctoring the ball.","definition[23]":"to add something harmful to food or drink","example[31]":"Paul suspected that his drink had been doctored.","definition[24]":"to remove part of the sex organs of an animal to prevent it from having babies","synonym[0]":"neuter","example[32]":"You should have your cat doctored.","definition[25]":"to give someone medical treatment, especially when you are not a doctor","example[33]":"Bill doctored the horses with a strong-smelling ointment.","definition[26]":"someone who is trained to treat sick or injured people","definition[27]":"someone who has a DOCTORATE from a university","definition[28]":"to change something, especially in order to deceive people","example[34]":"Police uncovered 43 cars for sale with doctored mileage readings."}