{"word[0]":"bother","type[0]":"intransitive, transitive usually in questions and negatives","signpost[0]":"make an effort","definition[0]":"to make the effort to do something","example[0]":"Why bother to go abroad, when there are so many nice places here?","example[1]":"‘Do you want me to wait for you?’ ‘No, don’t bother.’","note[0]":"don’t/didn’t/won’t etc bother","example[2]":"He didn’t bother to answer the question.","note[1]":"(not) bother to do something","example[3]":"He didn’t bother with a reply.","note[2]":"not bother about/with","example[4]":"Many young people didn’t bother voting.","note[3]":"(not) bother doing something","definition[1]":"to make someone feel slightly worried, upset, or concerned","example[5]":"Being in a crowd really bothers me.","example[6]":"It was very noisy, but that didn’t bother me.","example[7]":"I try not to bother about what other people think.","note[4]":"bother about","example[8]":"It really bothered me that he’d forgotten my birthday.","note[5]":"it bothers somebody that/how/when","signpost[1]":"annoy","definition[2]":"to annoy someone, especially by interrupting them when they are trying to do something","example[9]":"Danny, don’t bother Ellen while she’s reading.","example[10]":"Would it bother you if I put on some music?","example[11]":"It didn’t seem worth bothering the doctor about.","note[6]":"bother somebody about/with something","signpost[2]":"cause pain","definition[3]":"if a part of your body bothers you, it is slightly painful or uncomfortable","example[12]":"My back’s been bothering me.","signpost[3]":"frighten","definition[4]":"to upset or frighten someone by talking to them when they do not want to talk to you, trying to hurt them, touch them sexually etc","example[13]":"Don’t worry – my dog won’t bother you.","example[14]":"If he starts bothering you, let me know.","definition[5]":"trouble or difficulty that has been caused by small problems and that usually only continues for a short time","synonym[0]":"trouble","note[7]":"something is more bother than it’s worth (=it is too difficult to be worth doing)","example[15]":"It’s an old car, but it’s never caused me any bother.","example[16]":"‘Thanks for your help.’ ‘It was no bother  (=used to emphasize that you were happy to help someone) at all.’","example[17]":"My mother hardly ever went to the bother of  (=the effort of) making cakes.","example[18]":"Are you sure the station is on your way? I don’t want to give you any extra bother.","example[19]":"I should have phoned the shop first and saved myself the bother of going there.","example[20]":"Joe’s been having a bit of bother with his back again.","note[8]":"bother with","definition[6]":"used when you are slightly annoyed","example[21]":"Oh bother! I forgot to phone Jean."}