{"word[0]":"wear","past_tense[0]":"wore","past_participle[0]":"worn","signpost[0]":"on your body","definition[0]":"to have something such as clothes, shoes, or jewellery on your body","note[0]":"wear a seat belt (=have it around yourself)","example[0]":"Susanna was wearing a black silk dress.","example[1]":"He wore glasses for reading.","example[2]":"Usually I wear black, grey, or brown.","note[1]":"wear black/white/red etc","example[3]":"I’m wearing a scarlet dress to the party.","note[2]":"wear something to a party/a dance/an interview etc","explanation[0]":"In everyday English, people often say that someone has something on rather than is wearing something:","example[4]":"She had on a black silk dress.","definition[1]":"to have your hair or beard in a particular style or shape","example[5]":"She wore her hair loose.","definition[2]":"to become thinner or weaker after continuous use, or to make something do this","example[6]":"The cushions are starting to wear a little.","example[7]":"His jeans have worn thin at the knees.","example[8]":"You’ve worn a hole in your sock.","definition[3]":"to have a particular expression on your face","example[9]":"His face wore a welcoming smile.","note[3]":"wear a smile/frown/grin etc","definition[4]":"the clothes worn for a particular occasion or activity, or by a particular group of people","example[10]":"the children’s wear department","example[11]":"a new range of casual wear","note[4]":"evening/casual/leisure etc wear","example[12]":"bridal wear","definition[5]":"damage caused by continuous use over a long period","example[13]":"Replace your trainers when they start to show signs of wear.","example[14]":"Check the equipment for wear and tear.","definition[6]":"the amount of use an object, piece of clothing etc has had, or the use you can expect to get from it","example[15]":"The dress stood up to the wear small children give their clothes.","example[16]":"You’ll get years of wear out of that coat.","collocation[0]":"evening wear","example[17]":"The band were dressed in evening wear.","collocation[1]":"casual wear","example[18]":"The company makes stylish casual wear for men and women.","collocation[2]":"leisure wear","example[19]":"This is leisure wear for active people.","collocation[3]":"formal wear","example[20]":"Actresses were dressed in everything from formal wear to miniskirts.","example[21]":"a bridal wear shop","collocation[4]":"maternity wear","example[22]":"The shop sells comfortable and fashionable maternity wear for every occasion.","collocation[5]":"children’s/men’s/women’s wear","example[23]":"the children’s wear section of the store","collocation[6]":"designer wear","example[24]":"I can’t afford designer wear.","definition[7]":"the amount of damage that can be expected to affect a product or property in normal use. Wear and tear is often taken into consideration by an insurance company when paying an insurance claim","example[25]":"The sum insured should be based on current replacement costs, less an allowance for wear and tear."}