{"word[0]":"plot","definition[0]":"a secret plan by a group of people to do something harmful or illegal","example[0]":"The court heard how she and her lover hatched a plot (=planned a plot) to kill her husband.","example[1]":"The plot to overthrow the military government was foiled (=prevented from being successful).","example[2]":"an assassination plot","example[3]":"a plot to bomb the UN headquarters","note[0]":"plot to do something","example[4]":"a plot against the king","note[1]":"plot against","signpost[0]":"story/film","definition[1]":"the events that form the main story of a book, film, or play","example[5]":"The plot was a little confusing.","example[6]":"We discover that Jack isn’t as innocent as he seems, as the plot unfolds (=gradually becomes clearer).","signpost[1]":"piece of land","definition[2]":"a small piece of land for building or growing things on","example[7]":"a two-acre plot of land","example[8]":"a vegetable plot","definition[3]":"a piece of land that a particular family owns in a cemetery, in which members of the family are buried when they die","signpost[2]":"drawing","definition[4]":"a drawing that shows the plan of a building at ground level","synonym[0]":"ground plan","collocation[0]":"be involved in a plot","example[9]":"He was involved in a plot to kidnap the pope.","collocation[1]":"mastermind a plot","example[10]":"He is accused of masterminding a plot to bring down the government.","collocation[2]":"uncover/discover a plot","example[11]":"They didn’t suspect that their plot had been uncovered.","collocation[3]":"foil a plot","example[12]":"The plot was foiled when he was stopped by US Customs agents.","collocation[4]":"hatch a plot","example[13]":"They have admitted hatching a plot to kill the president.","form[0]":"NOUN + plot","collocation[5]":"a murder plot","example[14]":"He was questioned about an attempted murder plot.","example[15]":"The assassination plot to kill General de Gaulle was unsuccessful.","collocation[6]":"a terrorist plot","example[16]":"Police foiled a terrorist plot to attack a nuclear reactor.","collocation[7]":"the victim of a plot","example[17]":"He was the victim of a plot by his political opponents.","collocation[8]":"be part of a plot","example[18]":"These accusations are part of a plot to discredit him.","definition[5]":"to make a secret plan to harm a person or organization, especially a political leader or government","example[19]":"The minister was found guilty of plotting the downfall of the government.","example[20]":"the story of a woman who plots revenge","example[21]":"They had plotted to blow up the White House.","example[22]":"He suspected that the military were secretly plotting against him.","definition[6]":"to draw marks or a line to represent facts, numbers etc","example[23]":"We plotted a graph to show the increase in sales figures this year.","example[24]":"You can plot all these numbers on one diagram for comparison.","note[2]":"plot something on something","definition[7]":"to mark, calculate, or follow the path of an aircraft or ship, for example on a map","example[25]":"We plotted a course across the Pacific.","example[26]":"a vacant plot (=empty piece of land)","example[27]":"a plot of land","definition[8]":"to draw a line or curve that shows facts or figures"}