{"definition[0]":"a copy of a valuable object, painting etc that is intended to deceive people","opposite[0]":"original","example[0]":"The painting was judged a fake.","example[1]":"Jones can spot a fake from 20 feet away.","definition[1]":"someone who is not what they claim to be or does not have the skills they say they have","example[2]":"Her psychologist turned out to be a fake.","definition[2]":"made to look like a real material or object in order to deceive people","opposite[1]":"genuine","example[3]":"fake fur","example[4]":"a fake ID card","example[5]":"a fake 20 dollar bill","definition[3]":"not real and seeming to be something it is not, in order to deceive people","example[6]":"I gave a fake name.","example[7]":"She was speaking with a fake German accent.","example[8]":"a fake smile of friendliness","definition[4]":"to make something seem real in order to deceive people","example[9]":"She faked her father’s signature on the cheque.","example[10]":"The insurance company suspected that he had faked his own death.","example[11]":"The results of the experiments were faked.","definition[5]":"to pretend to be ill, interested etc when you are not","example[12]":"I thought he was really hurt but he was faking it.","definition[6]":"to pretend to move in one direction, but then move in another, especially when playing sport","example[13]":"He faked a pass.","definition[7]":"made to look like something valuable or GENUINE (=real) in order to deceive people","example[14]":"fake Rolex watches","example[15]":"Three bank employees had issued fake certificates for collateral on loans.","definition[8]":"a copy of an original document, valuable object etc that is intended to deceive people into believing it is the real document, object etc","example[16]":"The signature on the contract proved to be a fake.","definition[9]":"to make an exact copy of something, or invent figures or results, in order to deceive people","example[17]":"She had faked her boss’s signature on the cheque."}