{"word[0]":"essential","definition[0]":"extremely important and necessary","example[0]":"Window locks are fairly cheap and absolutely essential.","example[1]":"Even in small companies, computers are an essential tool.","example[2]":"A good diet is essential for everyone.","note[0]":"essential for/to","example[3]":"It is essential that our pilots be given the best possible training.","note[1]":"it is essential (that)","example[4]":"It is essential to book in advance.","note[2]":"it is essential to do something","definition[1]":"the essential part, quality, or feature of something is the most basic one","synonym[0]":"fundamental","example[5]":"The essential difference between Sam and me was the fact that I took life seriously.","example[6]":"The essential point of relay racing is that it is a team effort.","heading[0]":"– Meaning 1: extremely important and necessary","collocation[0]":"essential information","example[7]":"You can get essential travel information from the website.","collocation[1]":"essential reading","example[8]":"The journal is essential reading for doctors.","collocation[2]":"essential services","example[9]":"The law prohibits workers in essential services from striking.","collocation[3]":"absolutely/really essential","example[10]":"It is absolutely essential to keep this information secret.","collocation[4]":"be seen/regarded as essential","example[11]":"These measures are seen as essential for national security.","collocation[5]":"be considered/deemed essential","example[12]":"During the summer, air conditioning is considered essential.","collocation[6]":"play/perform an essential role in something","example[13]":"Antibiotics play an essential role in controlling infection.","heading[1]":"– Meaning 2: the essential part, quality, or feature of something is the most basic one","collocation[7]":"the essential element","example[14]":"Hard work is the essential element of his success.","collocation[8]":"an essential ingredient","example[15]":"Most people believe that love is an essential ingredient in a marriage.","collocation[9]":"an essential difference","example[16]":"The essential difference between the two boats lies in the design of the hull.","collocation[10]":"the essential point","example[17]":"The essential point is that all children should have an equal opportunity to study.","collocation[11]":"an essential feature","example[18]":"A free press is an essential feature of a democracy.","collocation[12]":"an essential component","example[19]":"Controlling inflation is an essential component of the government’s economic strategy.","collocation[13]":"the essential nature of something","example[20]":"The essential nature of stem cells is that they are the source of all other cells in the body.","example[21]":"Water is essential for life.","example[22]":"The right to protest is an essential part of any democracy.","example[23]":"I missed out an essential ingredient.","example[24]":"They learn skills that are essential for success in later life.","display[0]":"vital","definition[2]":"extremely important and necessary. Vital sounds stronger than essential","example[25]":"His evidence was vital to the defence case.","example[26]":"Nurses and police officers provide vital services.","example[27]":"It is vital that leaking gas pipes are fixed immediately.","display[1]":"crucial","definition[3]":"extremely important and making the difference between success and failure","example[28]":"Advertising is crucial to successful book selling.","example[29]":"The headteacher has played a crucial role in transforming this school.","display[2]":"indispensable","definition[4]":"if someone or something is indispensable, you cannot do something without them and they are extremely useful","example[30]":"She soon made herself indispensable in the office.","example[31]":"Mobile phones have become an indispensable part of our daily lives.","display[3]":"something is a must","definition[5]":"used when recommending something to someone and saying that they should definitely have it, do it, visit it etc","example[32]":"Virus checkers are a must for computer users concerned with security.","example[33]":"If you’re in Austria, a visit to Salzburg is a must.","definition[6]":"something that is necessary to do something or in a particular situation","synonym[1]":"necessity","example[34]":"She packed a few essentials.","example[35]":"We only had the bare essentials (=the most necessary things)."}