{"word[0]":"mystery","plural[0]":"mysteries","definition[0]":"an event, situation etc that people do not understand or cannot explain because they do not know enough about it","example[0]":"Twenty years after the event, his death remains a mystery.","example[1]":"The way her mind worked was always a mystery to him.","example[2]":"‘Why did he do it?’ ‘I don’t know. It’s a complete mystery.’","example[3]":"The police never solved the mystery of Gray’s disappearance.","example[4]":"But why would anyone want to kill Jack? The mystery deepened.","example[5]":"What happened to the paintings after that is an unsolved mystery.","example[6]":"I don’t know how he got the job – it’s one of life’s little mysteries.","example[7]":"How life began on Earth is one of the great mysteries of science.","definition[1]":"the quality that something or someone has when they seem strange, secret, or difficult to understand or explain","example[8]":"Her dark glasses gave her an air of mystery.","example[9]":"Annie knew that there was some mystery surrounding her birth.","example[10]":"The circumstances of his death were veiled in mystery.","note[0]":"be shrouded/veiled in mystery","definition[2]":"a subject, activity etc that is very complicated, secret, or difficult to understand, and that people want to learn about","example[11]":"his introduction to the mysteries of the perfume business","note[1]":"the mysteries of something","definition[3]":"a story, film, or play about a murder, in which you are not told who the murderer is until the end","example[12]":"an Agatha Christie mystery","heading[0]":"– Meaning 1: an event, situation etc that people do not understand or cannot explain because they do not know enough about it","collocation[0]":"be a mystery","example[13]":"It’s a mystery how he got my phone number.","collocation[1]":"remain a mystery","example[14]":"What caused the accident remains a mystery.","collocation[2]":"solve/unravel a mystery","example[15]":"The children were given the clues and had to try to solve the mystery.","collocation[3]":"the mystery deepens","example[16]":"Why would he run away if he were not guilty? The mystery deepens.","collocation[4]":"the mystery surrounding something","example[17]":"Research has unravelled much of the mystery surrounding the ageing process.","collocation[5]":"a complete/total mystery","example[18]":"She said that her husband’s disappearance was a complete mystery.","collocation[6]":"an unsolved mystery","example[19]":"What happened to her is still an unsolved mystery.","collocation[7]":"a great mystery","example[20]":"It is one of the great mysteries of science.","collocation[8]":"a little/minor mystery","example[21]":"It was a minor mystery how the file had survived the fire.","collocation[9]":"a big mystery","example[22]":"If they are right, they have solved one of the biggest mysteries in astronomy.","collocation[10]":"something is one of life’s (little) mysteries","example[23]":"Where socks disappear to after they’ve been washed is one of life’s little mysteries.","heading[1]":"– Meaning 2: the quality that something or someone has when they seem strange, secret, or difficult to understand or explain","example[24]":"The origins of this tradition remain shrouded in mystery.","collocation[11]":"mystery surrounds something","example[25]":"Mystery has always surrounded the purpose of the great stone circle of Stonehenge.","collocation[12]":"deep mystery","example[26]":"the deep mystery of the human mind","collocation[13]":"great mystery","example[27]":"We wondered about the great mystery of death.","collocation[14]":"an element of mystery","example[28]":"There is an element of mystery and miracle in the process.","collocation[15]":"an air of mystery","example[29]":"There was an air of mystery about him.","collocation[16]":"a sense of mystery","example[30]":"The garden had hidden corners that gave it a sense of mystery.","definition[4]":"used to describe someone or something that people do not recognize or know anything about, especially when this causes great interest","example[31]":"a mystery virus","example[32]":"Who was the mystery woman spotted on board the yacht with the prince?","note[2]":"mystery man/woman"}