{"word[0]":"caution","definition[0]":"the quality of being very careful to avoid danger or risks","example[0]":"The physician must exercise caution when prescribing antidepressants.","example[1]":"Many parents are tempted to intervene, but most experts counsel caution.","note[0]":"counsel/urge caution","example[2]":"Evidence given by convicted criminals should always be treated with the utmost caution.","note[1]":"treat/view something with caution","example[3]":"We must proceed with extreme caution.","note[2]":"with caution","definition[1]":"a warning or piece of advice telling you to be careful","example[4]":"Although pleased, Henson added a caution that the team still has a long way to go.","example[5]":"A final word of caution – never try any of this without backing up your system.","note[3]":"word/note of caution","definition[2]":"a spoken official warning given to someone who has been arrested or who has done something wrong that is not a serious crime","example[6]":"He was let off with a caution.","example[7]":"The defendant may make a statement under caution.","note[4]":"under caution","collocation[0]":"advise caution","example[8]":"We advise caution if you are buying a property overseas.","collocation[1]":"urge caution","example[9]":"Scientists are urging caution in research involving genes.","collocation[2]":"exercise caution","example[10]":"Travellers are advised to exercise caution while travelling in remote areas.","collocation[3]":"proceed with caution","example[11]":"You should always proceed with caution in financial matters.","collocation[4]":"treat something with caution","example[12]":"The results of the survey should be treated with caution.","collocation[5]":"view something with caution","example[13]":"At the moment investors are viewing the shares with caution.","collocation[6]":"great caution","example[14]":"Exercise great caution when handling toxic waste.","collocation[7]":"extreme caution","example[15]":"Bears can be dangerous and walkers should proceed with extreme caution.","collocation[8]":"the utmost caution","example[16]":"You are advised to take the utmost caution when buying a second-hand car.","collocation[9]":"due caution","example[17]":"An over-confident driver may overtake without due caution.","definition[3]":"to warn someone that something might be dangerous, difficult etc","example[18]":"Business leaders are cautioning against hasty action that would hamper flexibility.","note[5]":"caution (somebody) against something","example[19]":"Officials were quick to caution that these remarks did not mean an end to the peace process.","note[6]":"caution (somebody) that","example[20]":"He cautioned them to avoid the forest at night.","note[7]":"caution somebody to do something","definition[4]":"to warn someone officially that the next time they do something illegal they will be punished","example[21]":"She was cautioned for speeding.","note[8]":"caution somebody for (doing) something","definition[5]":"to warn someone officially that what they say to a police officer may be used as evidence in a court of law","definition[6]":"if there is caution in the financial markets, people are unwilling to buy or sell because they are worried that prices will fall","example[22]":"Investors exercised caution in the run-up to the election."}