{"signpost[0]":"without involving others","definition[0]":"done without any other people, actions, processes etc coming between","opposite[0]":"indirect","example[0]":"Experienced users have direct access to the main data files.","example[1]":"I’m not in direct contact with them.","example[2]":"Few policy-makers have had direct experience of business.","example[3]":"Educational level has a sizeable direct effect on income.","note[0]":"direct effect/impact/influence etc","example[4]":"There is a direct link between poverty and ill-health.","note[1]":"direct link/connection/relationship etc","example[5]":"The decision to close the hospital is a direct result of Government health policy.","note[2]":"direct result/consequence","signpost[1]":"from one place to another","definition[1]":"going straight from one place to another without stopping or changing direction","example[6]":"Which is the most direct route to London?","example[7]":"a direct flight to New York","signpost[2]":"exact","definition[2]":"exact or total","example[8]":"Weight increases in direct proportion to mass.","example[9]":"For Lawrence, in direct contrast to Adam, everything seemed to come so easily.","example[10]":"a direct quote (=exact words) from the book","signpost[3]":"behaviour/attitude","definition[3]":"saying exactly what you mean in an honest clear way","example[11]":"Women often feel men are too direct and not sympathetic enough.","example[12]":"Now, let me ask you a direct question, and I expect a direct answer.","collocation[0]":"direct access","example[13]":"Very few people have direct access to the president.","collocation[1]":"direct contact","example[14]":"The disease is only spread by direct contact between people.","collocation[2]":"a direct link/connection","example[15]":"The campaign makes a direct link between global warming and the consumption of energy in the home.","collocation[3]":"a direct relationship","example[16]":"We think having a direct relationship with customers is very important.","collocation[4]":"a direct effect/impact","example[17]":"Our organization’s work has a direct impact upon children’s lives in this country.","collocation[5]":"a direct result/consequence","example[18]":"Many illnesses here are a direct consequence of bad diet.","collocation[6]":"direct experience","example[19]":"People learn best through direct experience.","collocation[7]":"direct evidence","example[20]":"There is no direct evidence that this causes any harm.","collocation[8]":"direct control","example[21]":"The state has direct control over certain industries.","signpost[4]":"aim","definition[4]":"to aim something in a particular direction or at a particular person, group etc","example[22]":"I’d like to direct your attention to paragraph four.","example[23]":"I want to direct my efforts more towards my own projects.","example[24]":"The machine directs an X-ray beam at the patient’s body.","note[3]":"direct something at/towards etc something","example[25]":"The new route directs lorries away from the town centre.","signpost[5]":"be in charge","definition[5]":"to be in charge of something or control it","example[26]":"Mr Turner was directing the investigation from a very early stage.","example[27]":"The choir was directed by Sir David Willcocks.","signpost[6]":"film/play","definition[6]":"to give the actors in a play, film, or television programme instructions about what they should do","example[28]":"The play was directed by Frank Hauser.","signpost[7]":"way/route","definition[7]":"to tell someone how to get to a place","example[29]":"Could you direct me to Trafalgar Square, please?","note[4]":"direct somebody to something","signpost[8]":"tell somebody to do something","definition[8]":"to tell someone what they should do","example[30]":"The judge directed the jury to find Mr Baggs not guilty.","note[5]":"direct somebody to do something","example[31]":"He directed that his body should be buried in Upton.","note[6]":"direct that","definition[9]":"without stopping or changing direction","synonym[0]":"directly","example[32]":"Can we fly direct to Chicago, or do we stop in Salt Lake City first?","definition[10]":"without dealing with anyone else first","example[33]":"Esther decided to contact the manager direct.","example[34]":"It is usually cheaper to buy the goods direct from the wholesaler."}