{"word[0]":"stretch","signpost[0]":"make something bigger/looser","definition[0]":"to make something bigger or looser by pulling it, or to become bigger or looser as a result of being pulled","example[0]":"A spider’s web can stretch considerably without weakening.","example[1]":"Where can I buy those things that stretch your shoes?","type[0]":"intransitive not in progressive","definition[1]":"if a material stretches, it can become bigger or longer when you pull it and then return to its original shape when you stop","definition[2]":"to straighten your arms, legs, or body to full length","example[2]":"Carl sat up in bed, yawned, and stretched.","example[3]":"Always stretch before exercising.","type[1]":"intransitive always +adv/preposition","definition[3]":"to reach a long way for something","example[4]":"Ann stretched across the couch and grabbed the phone.","note[0]":"stretch across/over","signpost[1]":"make something tight","definition[4]":"to pull something so that it is tight","example[5]":"The canvas is stretched over a wooden frame.","signpost[2]":"time/series","definition[5]":"to continue over a period of time or in a series, or to make something do this","example[6]":"Berg’s career as a government official stretched over 20 years.","note[1]":"stretch into/on/over etc","example[7]":"With a goal in the second half, Spurs stretched their lead to 3–0.","signpost[3]":"in space","definition[6]":"to spread out or cover a large area of land","example[8]":"Row after row of orange trees stretched to the horizon.","note[2]":"stretch to/into/away etc","example[9]":"a line stretching around the block","signpost[4]":"rule/limit","definition[7]":"to allow something that would not normally be allowed by a rule or limit","example[10]":"This once, I’ll stretch the rules and let you leave work early.","example[11]":"We’ll stretch a point (=allow a rule to be broken) and let the baby travel free this time.","signpost[5]":"food/money","definition[8]":"if you make an amount of money, food etc stretch or it stretches, you use less of it than you usually would so that you have it for a longer time","example[12]":"I’m going to have to stretch this $20 until payday.","signpost[6]":"abilities","definition[9]":"to make someone use all of their skill, abilities, or intelligence","example[13]":"The work’s too easy. The students aren’t being stretched enough.","signpost[7]":"length of land/water","definition[10]":"an area of land or water, especially one that is long and narrow","example[14]":"a beautiful stretch of countryside","note[3]":"stretch of","definition[11]":"a continuous period of time","example[15]":"She doesn’t leave the house for long stretches of time.","example[16]":"She rarely sleeps for eight hours at a stretch (=without stopping).","example[17]":"a stretch of three weeks without sunshine","definition[12]":"the action of stretching a part of your body out to its full length, or a particular way of doing this","example[18]":"The ski instructor showed us some special stretches.","signpost[8]":"material","definition[13]":"the ability a material has to increase in length or width without tearing","signpost[9]":"jail","definition[14]":"a period of time spent in prison","definition[15]":"stretch clothes or material stretch if you pull them, and then return to their original shape","example[19]":"stretch Levis","definition[16]":"if something stretches an amount of money or a supply of something, it uses it up so you have hardly enough for your needs","example[20]":"Our finances are stretched to the limit.","definition[17]":"to make an amount of money last longer than usual by being careful how it is spent and not wasting it","example[21]":"All departments are having to stretch their budgets.","definition[18]":"if a company stretches a brand, it starts to use an existing brand name on a different type of product, hoping that people will buy it because they recognize the name","example[22]":"Following Coca-Cola’s decision to market clothes, people asked how far a brand can be stretched."}