{"word[0]":"fear","definition[0]":"the feeling you get when you are afraid or worried that something bad is going to happen","example[0]":"a fear of flying","note[0]":"fear of","example[1]":"There are fears that share prices could decrease still further.","note[1]":"fear that","example[2]":"The girl’s parents expressed fears for her safety.","note[2]":"fear for","example[3]":"The children looked at her in fear.","note[3]":"in fear","example[4]":"People must be able to express their views without fear of criticism.","note[4]":"without fear","definition[1]":"the possibility or danger that something bad might happen","example[5]":"There’s no fear of revolt now.","collocation[0]":"somebody’s worst/greatest fear","example[6]":"Her worst fear was never seeing her children again.","collocation[1]":"an irrational fear","example[7]":"He grew up with an irrational fear of insects.","collocation[2]":"a deep-seated fear","example[8]":"He exploited people’s deep-seated fears about strangers.","collocation[3]":"groundless","example[9]":"As it turned out, these fears were groundless.","collocation[4]":"conquer/overcome your fear","example[10]":"She managed to conquer her fear of flying.","collocation[5]":"shake/tremble with fear","example[11]":"He was shaking with fear after being held at gunpoint.","collocation[6]":"show fear","example[12]":"She was determined not to show fear.","collocation[7]":"be gripped by fear","example[13]":"We were gripped by fear as the boat was tossed around by the waves.","collocation[8]":"be paralysed with fear","example[14]":"Bruce was paralysed with fear when he saw the snake.","collocation[9]":"confirm somebody’s fears","example[15]":"The look on Colin’s face confirmed all my worst fears.","collocation[10]":"ease/allay/dispel somebody’s fears","example[16]":"Frank eased my fears about not being able to speak the local language.","collocation[11]":"be in fear of/for your life","example[17]":"Celia was in fear of her life when she saw the truck coming toward her.","collocation[12]":"be full of fear","example[18]":"The residents are too full of fear to leave their houses.","collocation[13]":"be/live in fear of something","example[19]":"They were constantly in fear of an enemy attack.","collocation[14]":"have no fear of something","example[20]":"He had no fear of death.","collocation[15]":"somebody’s hopes and fears","example[21]":"We each had different hopes and fears about the trip.","definition[2]":"a feeling of being frightened","example[22]":"He was trembling with fear.","example[23]":"Fear of failure should not stop you trying.","display[0]":"terror","definition[3]":"a feeling of great fear, because you think that something terrible is about to happen","example[24]":"She let out a scream of pure terror.","display[1]":"fright","definition[4]":"a sudden feeling of fear, or a situation that makes you feel this","example[25]":"My body was shaking with fright.","example[26]":"You gave me a fright!","example[27]":"He’s had a bit of fright, that’s all.","display[2]":"panic","definition[5]":"a sudden feeling of fear or nervousness that makes you unable to think clearly or behave sensibly","example[28]":"She was in such a panic that she hardly knew what she was doing!","example[29]":"There were scenes of sheer panic immediately following the bomb blast.","display[3]":"alarm","definition[6]":"a feeling of fear or worry which shows in your voice or behaviour, because you think something bad might happen","example[30]":"When I mentioned her name, he looked up at me in alarm.","example[31]":"The streets were calm and there was no sign of alarm.","display[4]":"foreboding","definition[7]":"a feeling that something bad or unpleasant might happen although there is no obvious reason why it should","example[32]":"She felt the same sense of foreboding she had before her father died.","display[5]":"phobia","definition[8]":"a permanent strong unreasonable fear of something","example[33]":"I had a phobia about going to the dentist.","definition[9]":"to feel afraid or worried that something bad may happen","example[34]":"Fearing violence, the group asked for police protection.","example[35]":"Hundreds of people are feared dead in the ferry disaster.","example[36]":"a terrifying ordeal in which she feared for her life","note[5]":"fear for somebody’s safety/life","example[37]":"Police fear that there may be further terrorist attacks.","note[6]":"fear (that)","example[38]":"Women feared to go out at night.","note[7]":"fear to do something","example[39]":"His wife seemed depressed, and he feared for his children.","note[8]":"fear for somebody","explanation[0]":"In more formal English, you say it is feared that something is true","example[40]":"It is feared that the child has been abducted","definition[10]":"to be afraid of someone and what they might do","example[41]":"As a leader, he was distrusted and even feared."}