{"word[0]":"exception","definition[0]":"something or someone that is not included in a general statement or does not follow a rule or pattern","example[0]":"It’s been cold, but today’s an exception.","example[1]":"The law applies to all EU countries; Britain is no exception.","example[2]":"We don’t usually accept checks, but for you we’ll make an exception  (=not include you in this rule).","example[3]":"The spelling of this word is an interesting exception to the rule.","example[4]":"Successful two-career couples are still the exception, not the rule  (=used to emphasize that something is unusual).","example[5]":"With one or two notable exceptions, there are few women conductors.","note[0]":"notable/important/significant exception","example[6]":"With a few minor exceptions, the new edition is much like the previous one.","note[1]":"minor/major exception","example[7]":"We all laughed, with the exception of Maggie.","note[2]":"with the exception of somebody/something","example[8]":"Each plant, without exception, contains some kind of salt.","note[3]":"without exception","collocation[0]":"an important/significant exception","example[9]":"The treaty was ratified by all the EU member countries, with one significant exception, Britain.","collocation[1]":"a major exception","example[10]":"The major exception to the general downturn, the tourism sector, has actually seen an increase in profits.","collocation[2]":"a notable exception","example[11]":"The houses along the river are all relatively modern, with the notable exception of the old forge.","collocation[3]":"an obvious exception","example[12]":"The earliest historical records, with the obvious exception of Chinese, are written in Indo-European languages.","collocation[4]":"a conspicuous exception","example[13]":"With one conspicuous exception, Ayers Rock, the desert landscape is completely flat.","collocation[5]":"a minor exception","example[14]":"Everyone was in agreement, with a few minor exceptions.","collocation[6]":"a single/sole exception","example[15]":"All the men were killed, with the sole exception of Captain Jones.","collocation[7]":"a rare exception","example[16]":"Books on philosophy can be quite dull, but this is a rare exception.","collocation[8]":"with the exception of","example[17]":"The journey was fairly straightforward, with the exception of driving through London.","example[18]":"Without exception, all the children were well behaved and polite.","collocation[9]":"be no exception","example[19]":"The river floods every winter, and this year was no exception.","collocation[10]":"be the exception to the rule","example[20]":"Most of the boys were quite shy, but Larry was the exception to the rule.","collocation[11]":"be the exception, not the rule","example[21]":"Staying married for life seems to be the exception, not the rule these days.","collocation[12]":"make an exception","example[22]":"We usually require a 10% deposit, but I'll make an exception in this case.","definition[1]":"a particular event or risk that is mentioned in an insurance policy as something that the policy does not cover","synonym[0]":"EXCLUSION","example[23]":"Unless the claim is ruled out by one of the policy exceptions, then every consideration should be given for settlement."}