{"word[0]":"queen","signpost[0]":"ruler","definition[0]":"the female ruler of a country","example[0]":"Queen Elizabeth","example[1]":"At 18, Victoria was crowned queen  (=officially became ruler).","example[2]":"Cleopatra, Queen of Egypt","note[0]":"queen of","definition[1]":"the wife of a king","example[3]":"the future queen","signpost[1]":"card","definition[2]":"a playing card with a picture of a queen on it","example[4]":"the queen of diamonds","definition[3]":"the woman who wins a beauty competition, or who is chosen to represent a school, area etc","example[5]":"the carnival queen","signpost[2]":"insect","definition[4]":"a large female bee, ant etc, which lays the eggs for a whole group","signpost[3]":"homosexual","definition[5]":"an offensive word for a male homosexual who behaves very like a woman. Do not use this word.","signpost[4]":"chess","definition[6]":"the most powerful piece in the game of chess","collocation[0]":"become queen","example[6]":"Mary Tudor became queen in 1553.","collocation[1]":"crown somebody queen","example[7]":"The next day she was crowned Queen of England.","collocation[2]":"a queen rules/reigns","example[8]":"Queen Victoria reigned for over 60 years.","collocation[3]":"a queen abdicates","example[9]":"The Queen is unlikely to abdicate.","collocation[4]":"the reign of Queen Elizabeth/Victoria etc","example[10]":"She was born in the reign of Queen Victoria.","collocation[5]":"Her Majesty the Queen","example[11]":"Her Majesty the Queen will be visiting Australia in July.","definition[7]":"to change a pawn into a queen in the game of chess","definition[8]":"Her Majesty the Queen - the official title of the queen of the United Kingdom of Great Britain and Northern Ireland. The Queen is the official head of state of Britain and of other countries in the Commonwealth, but has little real political power. She has to give her official agreement (Royal Assent) to all new laws before they can actually become laws but in fact she does not have the right to refuse this agreement.","definition[9]":"a British rock group who were very popular in the 1970s and 1980s, and whose songs include Bohemian Rhapsody and We Are the Champions. Their main singer was Freddie Mercury, and they were known especially for playing to very large crowds, for example in football stadiums."}