{"signpost[0]":"knowledge/skill","definition[0]":"knowledge or skill that you gain from doing a job or activity, or the process of doing this","example[0]":"He had no previous experience of managing a farm.","example[1]":"The advice in the booklet reflects the practical experience we have gained  (=experience gained by actually doing something, rather than knowledge from books etc).","example[2]":"I had some experience in fashion design.","example[3]":"She was turned down on the grounds of lack of experience.","example[4]":"I have first-hand experience  (=experience gained by doing something myself) of running a school.","example[5]":"The programme enables pupils to gain some experience of the world of work.","note[0]":"gain/get experience","example[6]":"You’ve got a lot of experience of lecturing.","note[1]":"experience of/in/with","example[7]":"my experience in many areas of the music business","signpost[1]":"knowledge of life","definition[1]":"knowledge that you gain about life and the world by being in different situations and meeting different people, or the process of gaining this","example[8]":"Being a parent isn’t easy, as I know from experience.","note[2]":"know/learn/speak from experience","example[9]":"All animals appear to have some capacity to learn from experience.","example[10]":"I speak from bitter experience  (=having learnt something because something unpleasant happened).","example[11]":"From personal experience, she knew and understood the problems of alcohol addiction.","note[3]":"personal/previous/past experience","example[12]":"Beth’s experience suggests that people don’t really change deep down.","note[4]":"experience shows/suggests that","example[13]":"In his experience, women did not like getting their feet wet and muddy.","note[5]":"in somebody’s experience","signpost[2]":"something that happens","definition[2]":"something that happens to you or something you do, especially when this has an effect on what you feel or think","example[14]":"childhood experiences","example[15]":"I had a similar experience last year.","example[16]":"The two children in this story have been through a lot of bad experiences.","example[17]":"Parachuting is quite an experience.","example[18]":"This romantic evening cruise is a memorable experience.","note[6]":"memorable/unforgettable experience","example[19]":"This kind of religious experience was a sign of God’s special favour.","note[7]":"religious experience","example[20]":"This was my first experience of living with other people.","note[8]":"experience of/with","example[21]":"Failing an exam was a new experience for me.","note[9]":"experience for","heading[0]":"– Meaning 1: knowledge or skill that you gain from doing a job or activity, or the process of doing this","collocation[0]":"have experience","example[22]":"Applicants must have experience of working with children.","collocation[1]":"get/gain experience","example[23]":"He suggested that I should gain some experience in a related industry like travel.","collocation[2]":"lack experience","example[24]":"Some students lack experience writing essays.","collocation[3]":"broaden/widen your experience","example[25]":"After six years with the bank, he went to work in New York to broaden his experience.","collocation[4]":"considerable experience","example[26]":"Margaret has considerable experience of hospital work.","collocation[5]":"long experience","example[27]":"New prison officers are partnered by officers with long experience of dealing with violent prisoners.","collocation[6]":"useful/valuable experience","example[28]":"That summer he got some valuable experience working in a tax office.","collocation[7]":"invaluable experience","example[29]":"Playing in the under-21 squad gives these young players invaluable experience.","collocation[8]":"relevant experience","example[30]":"Applicants need a degree and two years of relevant experience.","collocation[9]":"past/previous experience","example[31]":"His only previous experience of broadcasting consisted of a job hosting a local radio station.","collocation[10]":"practical experience","example[32]":"The classes provide students with some practical experience of computers.","collocation[11]":"first-hand experience","example[33]":"She has no first-hand experience of running a school.","collocation[12]":"a wealth of experience","example[34]":"Between them, the management team have a wealth of experience.","collocation[13]":"lack of experience","example[35]":"My colleagues kept making comments about about my lack of experience.","heading[1]":"– Meaning 2: knowledge that you gain about life and the world by being in different situations and meeting different people, or the process of gaining this","collocation[14]":"personal experience","example[36]":"He spoke from personal experience about the harmful effects of taking drugs.","collocation[15]":"life experience","example[37]":"As an older parent, your life experience is one of your greatest assets.","example[38]":"As a journalist living in Iraq, he had first-hand experience of coping with terror on his doorstep.","collocation[16]":"bitter experience","example[39]":"I knew from bitter experience how unreliable she could be.","collocation[17]":"everyday experience","example[40]":"Hunger is part of everyday experience for these children.","collocation[18]":"know/learn from experience","example[41]":"Janet knew from experience that love doesn't always last.","collocation[19]":"speak from experience","example[42]":"The miners spoke from experience about the dangers of their work.","example[43]":"Many men in their twenties lack experience and social skills.","collocation[20]":"experience suggests/shows something","example[44]":"Experience suggests that children who commit crimes will continue to offend as adults.","example[45]":"He was embarrassed about his lack of experience with women.","heading[2]":"– Meaning 3: something that happens to you or something you do, especially when this has an effect on what you feel or think","form[0]":"ADJECTIVES/NOUN + experience","collocation[21]":"a good/bad experience","example[46]":"On the whole, going to boarding school was a good experience for him.","example[47]":"I've had some bad experiences when I've been travelling on my own.","collocation[22]":"positive/negative","example[48]":"The entire experience has been very positive.","example[49]":"Many people reported having negative experiences when dealing with their local council.","collocation[23]":"enjoyable/pleasant","example[50]":"We want to make the experience as enjoyable as possible.","example[51]":"She recalled pleasant experiences from her past.","collocation[24]":"memorable/unforgettable","example[52]":"Meeting the queen was a memorable experience.","collocation[25]":"painful","example[53]":"Her family supported her through the painful experience.","collocation[26]":"traumatic/harrowing","example[54]":"Having an operation can be a traumatic experience for a child.","example[55]":"The club scene was a whole new experience for me.","collocation[27]":"a formative experience","example[56]":"The trip was probably the most formative experience of my life.","example[57]":"Our childhood experiences make us what we are as adults.","collocation[28]":"a religious experience","example[58]":"As a young man he had a profound religious experience.","collocation[29]":"an everyday/commonplace experience","example[59]":"The sound of gunfire is an everyday experience in the city.","definition[3]":"if you experience a problem, event, or situation, it happens to you or affects you","example[60]":"Children need to experience things for themselves in order to learn from them.","example[61]":"Many old people will experience problems as the result of retirement.","note[10]":"experience problems/difficulties","definition[4]":"to feel a particular emotion, pain etc","example[62]":"Many women experience feelings of nausea during pregnancy.","definition[5]":"knowledge or skill gained from doing a particular job","example[63]":"He is a high-up executive who has years of experience in advising investors","example[64]":"Applicants will normally have at least two years’ experience teaching English for Business.","example[65]":"You will receive a salary in the range of £18,586 to £20,176 pa depending on qualifications and experience.","example[66]":"Jack’s bank manager pointed out that he had no business experience and was therefore a high risk from the bank’s point of view.","example[67]":"They are prepared to employ young people with no previous experience and train them.","definition[6]":"a record of the difference in amount between claims made by insured people and money they pay for their insurance policies. This information is used by insurance companies to calculate the amount people should pay for their insurance policies","example[68]":"With fleet insurance, the risk is rated on experience over the preceding five years."}