{"word[0]":"pulse","signpost[0]":"heart","definition[0]":"the regular beat that can be felt, for example at your wrist, as your heart pumps blood around your body","note[0]":"take somebody’s pulse (=count the beats of their pulse, usually by feeling their wrist)","example[0]":"His breathing was shallow and his pulse was weak.","example[1]":"She felt his neck. There was no pulse.","example[2]":"Her pulse raced  (=beat very quickly) with excitement.","example[3]":"The doctor listened to his breathing and checked his pulse.","note[1]":"check/feel somebody's pulse","example[4]":"I held his wrist, trying to find a pulse.","note[2]":"find a pulse","example[5]":"If your pulse rate is between 90 and 100, it is likely that you are unfit.","note[3]":"pulse rate","definition[1]":"a strong regular beat in music","example[6]":"the distant pulse of a steel band","signpost[1]":"sound/light/electricity","definition[2]":"an amount of sound, light, or electricity that continues for a very short time","signpost[2]":"feelings/opinions","definition[3]":"the ideas, feelings, or opinions that are most important to a particular group of people or have the greatest influence on them at a particular time","example[7]":"Clinton had an uncanny ability to sense the pulse of the nation.","collocation[0]":"take somebody's pulse","example[8]":"Remember to take your pulse at intervals while you are exercising.","example[9]":"The nurse left the room after checking the girl's pulse.","collocation[1]":"feel for a pulse","example[10]":"I felt for a pulse, but I couldn't find one.","example[11]":"To her relief, she found a pulse.","collocation[2]":"somebody's pulse beats","example[12]":"His pulse began to beat with a fierce rhythm.","collocation[3]":"somebody's pulse races","example[13]":"His long fingers brushed hers, sending her pulse racing.","collocation[4]":"somebody's pulse quickens","example[14]":"He heard a footfall in the passage outside and felt his pulse quicken.","collocation[5]":"weak/faint","example[15]":"The boy's pulse was very weak.","example[16]":"He's breathing better. The pulse is stronger too.","collocation[6]":"rapid/fast","example[17]":"Symptoms include a rapid pulse and dry skin.","collocation[7]":"slow","example[18]":"Her pulse was slow but steady.","example[19]":"A normal pulse is between 70 and 90 beats a minute.","form[0]":"pulse + NOUN","example[20]":"The doctor checked my weight and pulse rate.","collocation[8]":"pulse beat","example[21]":"The rhythm was steady, as regular as a pulse beat.","definition[4]":"to move or flow with a steady quick beat or sound","example[22]":"She felt the blood pulsing through her veins.","example[23]":"Colored lights pulsed in time to the music.","definition[5]":"if a feeling or emotion pulses through someone, they feel it very strongly","example[24]":"Excitement pulsed through the crowd.","note[4]":"pulse through","definition[6]":"to push a button on a food processor to make the machine go on and off regularly, rather than work continuously","example[25]":"Pulse several times until the mixture looks like oatmeal."}