{"signpost[0]":"move higher","definition[0]":"to move or lift something to a higher position, place, or level","example[0]":"Can you raise the lamp so I can see?","example[1]":"William raised his hat and smiled at her.","example[2]":"Raise your hand if you know the right answer.","explanation[0]":"In everyday British English, people usually say lift something up rather than raise something: ","example[3]":"Can you lift up the lamp a bit?","example[4]":"Put your hand up if you know the right answer.","explanation[1]":"British English speakers usually say put up your hand rather than raise your hand:","definition[1]":"to increase an amount, number, or level","example[5]":"Many shops have raised their prices.","example[6]":"The university is working to raise the number of students from state schools.","example[7]":"a campaign to raise awareness of meningitis","example[8]":"Dr Hayward intends to raise the museum’s profile (=make it more well-known).","explanation[2]":"In everyday British English, people usually say put up an amount, a price etc rather than raise it: ","example[9]":"They’ve put the price of fuel up again.","signpost[1]":"collect money","definition[2]":"to collect money that you can use to do a particular job or help people","example[10]":"The Trust hopes to raise $1 million to buy land.","example[11]":"They are raising funds to help needy youngsters.","example[12]":"a concert to raise money for charity","definition[3]":"to improve the quality or standard of something","example[13]":"Changing the law cannot raise standards.","example[14]":"The team need to raise their game.","signpost[2]":"start a subject","definition[4]":"to begin to talk or write about a subject that you want to be considered or a question that you think should be answered","synonym[0]":"bring up","example[15]":"He did not raise the subject again.","example[16]":"I’d like to raise the issue of publicity.","example[17]":"Betty raised the important question of who will be in charge.","signpost[3]":"cause a reaction","definition[5]":"to cause a particular emotion or reaction","example[18]":"This attack raises fears of increased violence against foreigners.","example[19]":"The way the research was carried out raises doubts about the results.","signpost[4]":"move eyes or face","definition[6]":"to move your eyes, head, or face so that you are looking up","example[20]":"Albert raised his eyes and stared at Ruth.","example[21]":"‘No, ’ he said without raising his head.","signpost[5]":"move upright","definition[7]":"to move or lift yourself into an upright position","example[22]":"Adele raised herself from the pillows.","note[0]":"raise yourself","example[23]":"He raised himself up on one elbow to watch.","signpost[6]":"children","definition[8]":"to look after your children and help them grow","example[24]":"Stan’s dad died, leaving his mother to raise three sons alone.","example[25]":"It was time for Dean to settle down and raise a family.","example[26]":"Anne married a Jew, despite being raised a Catholic.","example[27]":"The new generation was the first to be raised on processed food.","example[28]":"Camus was born and raised in Algeria.","signpost[7]":"animals or plants","definition[9]":"to look after animals or grow plants so that they can be sold or used as food","example[29]":"He raised cattle in Nebraska when he was young.","example[30]":"Jim retired to raise raspberries.","signpost[8]":"collect people","definition[10]":"to collect together a large group of people, especially soldiers","example[31]":"The rebels quickly raised an army.","signpost[9]":"card game","definition[11]":"to make a higher bid than an opponent in a card game","example[32]":"I’ll raise you $100.","signpost[10]":"speak to somebody","definition[12]":"to speak to someone on a piece of radio equipment","synonym[1]":"contact","example[33]":"They finally managed to raise him at Miller’s sheep farm.","signpost[11]":"wake somebody","definition[13]":"to wake someone who is difficult to wake","example[34]":"Try as he might he could not raise her.","signpost[12]":"dead person","definition[14]":"to make someone who has died live again","example[35]":"Jesus raised Lazarus from the grave.","signpost[13]":"build","definition[15]":"to build something such as a monument","synonym[2]":"erect","definition[16]":"an increase in the money you earn","example[36]":"We can cut the state budget or raise taxes.","example[37]":"The bank raised interest rates to 15%.","definition[17]":"to make people consider a question etc, for example by beginning to talk or write about it","example[38]":"I tried to raise several points at the meeting.","example[39]":"The Guinness affair raised the question of abolishing trial by jury in complicated fraud cases.","definition[18]":"to collect the money, capital etc that is needed to do something","example[40]":"Hammond Co. will need to raise $2 million to finance the offer.","definition[19]":"to succeed in getting a loan or mortgage","example[41]":"He raised a loan of $20 million from commercial banks.","definition[20]":"to write out or print out an INVOICE (=document stating how much has to be paid for work or goods), or to ask someone to do this","example[42]":"Where goods move between VAT registered traders, a tax invoice has to be raised.","example[43]":"The Senate voted itself a 23% pay raise."}