{"word[0]":"offer","definition[0]":"to ask someone if they would like to have something, or to hold something out to them so that they can take it","example[0]":"Can I offer you something to drink?","note[0]":"offer somebody something","example[1]":"They offered him a very good job, but he turned it down.","example[2]":"Maureen lit a cigarette and offered one to Lucy.","note[1]":"offer something to somebody","example[3]":"The drama school offers places to students who can show talent.","definition[1]":"to say that you are willing to do something","example[4]":"I don’t need any help, but it was nice of you to offer.","example[5]":"My dad has offered to pick us up.","note[2]":"offer to do something","example[6]":"The newspaper offered to apologise for the article.","definition[2]":"to provide something that people need or want","example[7]":"A number of groups offer their services free of charge.","example[8]":"The Centre offers a wide range of sports facilities.","example[9]":"Your doctor should be able to offer advice on diet.","note[3]":"offer advice/help/support etc","example[10]":"The course offers the opportunity to specialize in the final year.","note[4]":"offer an opportunity/chance/possibility","example[11]":"I did what I could to offer comfort to the family.","definition[3]":"to say that you are willing to pay a particular amount of money for something","example[12]":"They’ve offered us £75,000 for the house.","note[5]":"offer (somebody) something for something","example[13]":"The police are offering a reward for any information.","definition[4]":"a statement saying that you are willing to do something for someone or give them something","example[14]":"I can’t turn down the offer of a free trip to Milan!","note[6]":"offer of","example[15]":"His offer to resign will be accepted.","definition[5]":"an amount of money that you are willing to pay for something","example[16]":"Will you accept their offer?","example[17]":"Within 20 minutes they were prepared to make us an offer.","note[7]":"make (somebody) an offer (for/on something)","example[18]":"The company made an offer of $5 million for the site.","example[19]":"‘I’ll be interested if Newcastle make me a good offer, ’ said the 25-year-old striker.","note[8]":"a generous/good offer","example[20]":"We’re asking £2,500, but we’re open to offers.","note[9]":"be open to offers","definition[6]":"a reduction of the price of something in a shop for a short time","example[21]":"All special offers advertised in this brochure are subject to availability.","example[22]":"To take advantage of this offer (=buy something at the reduced price), complete the attached forms.","example[23]":"There’s a free offer on orders over £45.","note[10]":"offer on","collocation[0]":"accept an offer","example[24]":"Are you going to accept their offer?","collocation[1]":"take up an offer/take somebody up on their offer","example[25]":"I might take him up on his offer.","collocation[2]":"turn down/refuse/reject/decline an offer","example[26]":"She declined the offer of a lift.","collocation[3]":"get/receive an offer","example[27]":"He received the offer of a place at Cambridge University.","collocation[4]":"withdraw an offer","example[28]":"They suddenly withdrew their offer at the last minute.","form[0]":"ADJECTIVES/NOUN + offer","collocation[5]":"a job offer","example[29]":"I still did not have a formal job offer.","collocation[6]":"a kind/generous offer","example[30]":"We are grateful for your kind offer.","example[31]":"They were surprised by his generous offer to let them stay at his place.","collocation[7]":"an offer of help/support/friendship etc","example[32]":"Any offers of help would be appreciated.","collocation[8]":"I appreciate your offer","example[33]":"I appreciate your offer, but I don’t need any help.","definition[7]":"to say that you are willing to give someone something, or to give them it","example[34]":"The magazine offered discounts to advertisers.","example[35]":"They’ve offered us $200,000 for the house.","definition[8]":"to make an investment available for sale","example[36]":"The company offered about 18 million shares to investors on the Tokyo Stock Exchange at 6,800 yen each.","definition[9]":"to provide a product or service","example[37]":"It offers six credit cards with varying rates.","definition[10]":"if a product or service offers particular advantages or features, it has those features or advantages","example[38]":"Different software packages offer different features.","definition[11]":"a statement that you are willing to give someone something or do something for them","example[39]":"They approached him with the new job offer and, within hours, he accepted the post.","example[40]":"Before the offers of early retirement, the company had about 8,000 employees.","example[41]":"Their offer to buy the building was accepted.","note[11]":"make (somebody) an offer (for something)","example[42]":"The company declined (=refused) the $1-a-share offer because it wanted $3 a share.","definition[12]":"to be ready to consider different offers of money or other things people are willing to give you","example[43]":"We have no definite plans to sell but we are certainly open to offers.","definition[13]":"available to be bought or used","example[44]":"It’s still a seller’s market because of the shortage of property on offer.","definition[14]":"available for a short time at a reduced price","example[45]":"Olive oil is on offer this week.","example[46]":"This wine is currently on special offer at £3.29.","definition[15]":"a reduction in the price of something for a short time","example[47]":"Take advantage of our ‘buy six for the price of five’ offer.","example[48]":"The ferry company is running a special offer: a day trip to France for only £7.","definition[16]":"if property that is for sale is under offer, someone has offered an amount of money for it","example[49]":"We can confirm the club is under offer, but that’s as much as we can say at this stage.","definition[17]":"a free product or service"}