{"word[0]":"type","definition[0]":"one member of a group of people or things that have similar features or qualities","example[0]":"I’ve already seen a few movies of this type.","note[0]":"of this/that/each etc type","example[1]":"What type of music do you like?","note[1]":"type of","example[2]":"There are two main types of sleep.","explanation[0]":"Type is a countable noun and should be plural after words such as ‘these’, ‘those’, and ‘many’","example[3]":"this type of building","example[4]":"these types of building","bad_example[0]":"these type of building","definition[1]":"a person who has, or seems to have, a particular character","example[5]":"Jo’s not really the sporty type.","example[6]":"Beth is not the type to make a fuss.","definition[2]":"printed letters","example[7]":"italic type","definition[3]":"a small block with a raised letter on it that is used to print with, or a set of these","form[0]":"ADJECTIVES/NOUN + type","collocation[0]":"this/that type","example[8]":"He is not suited to this type of work.","collocation[1]":"a particular type","example[9]":"Have you flown this particular type of aircraft before?","collocation[2]":"the same type","example[10]":"They use the same type of axe as a tool and a weapon.","collocation[3]":"a different type","example[11]":"I’ve learned to work with different types of people.","collocation[4]":"a new type","example[12]":"These architects felt the time had come for a new type of public building.","collocation[5]":"the main type","example[13]":"Methane is the main type of gas produced.","collocation[6]":"skin/hair type","example[14]":"The best cleanser for you depends on your skin type.","collocation[7]":"blood type","example[15]":"Mother and child had the same blood type.","collocation[8]":"personality type","example[16]":"Find out your personality type by answering our simple questionnaire.","collocation[9]":"soil type","example[17]":"The plant thrives in a wide range of soil types.","display[0]":"type/kind/sort","definition[4]":"one member of a group of people or things that have similar features or qualities. Type is the usual word to use in scientific or technical contexts. In everyday English, people usually use kind or sort","example[18]":"What type of fish is this?","example[19]":"There are two main personality types.","display[1]":"kind","definition[5]":"a type of person or thing. Kind  is less formal than type, and is used especially in everyday English","example[20]":"What kind of food do you like?","example[21]":"There were all kinds of people there.","example[22]":"The study is the first of its kind in Ireland.","display[2]":"sort","definition[6]":"a type of person or thing. Sort  is less formal than type, and is used especially in everyday British English","example[23]":"What sort of person is she?","example[24]":"I like all sorts of music.","display[3]":"form","definition[7]":"one type of something from all the ones that are possible – used especially when things have different physical characteristics, or in certain fixed phrases","example[25]":"There are many forms of heart disease.","example[26]":"Melanoma is a form of skin cancer.","example[27]":"The first primitive life forms consumed various materials, including hydrogen sulfide, and released oxygen.","example[28]":"In those days, horses were the commonest form of transport.","example[29]":"We need to use alternative forms of energy.","example[30]":"a popular form of entertainment","display[4]":"variety","definition[8]":"a type that is slightly different from others in the same group","example[31]":"The French make many varieties of cheese.","example[32]":"This is a new variety of apple.","display[5]":"species","definition[9]":"a type of plant or animal, which can breed together to produce plants or animals of the same type","example[33]":"These forests contain many species of trees.","example[34]":"The giant panda is an endangered species.","display[6]":"of a ... nature","definition[10]":"used when talking about a particular type of thing","example[35]":"Many people find it embarrassing to discuss problems of a sexual nature.","example[36]":"Minor incidents of this nature normally occur about once a month.","display[7]":"category","definition[11]":"a group of people or things that are all of the same type – used when there is a clear system for deciding which group something belongs to","example[37]":"The three major categories of rock are: igneous, metamorphic, and sedimentary.","example[38]":"She won the best actress category at the Oscars.","display[8]":"brand","definition[12]":"used when talking about the particular way that someone does something or thinks about something, when this is very different from that of other people","example[39]":"She has her own special brand of humour.","example[40]":"He has called for a more positive brand of politics.","display[9]":"genre","definition[13]":"a type of art, music, literature etc. that has a particular style or feature","example[41]":"He has written novels in several genres, most notably science fiction.","heading[0]":"a type of product","definition[14]":"the name of a type of product made by a company, especially one that you use every day such as food or cleaning products","example[42]":"a survey to find out which brand of toothpaste people prefer","example[43]":"advertising for a well-known brand of cigarettes","definition[15]":"a type of product made by a particular company – used especially about things such as machines, equipment, or cars","example[44]":"‘What make of car do you drive?’ ‘A Ford.’","display[10]":"model","definition[16]":"one particular type or design of a vehicle, machine etc","example[45]":"The new models are much faster.","definition[17]":"to write something using a computer or a typewriter","example[46]":"He types with two fingers.","example[47]":"Type your password, then press ‘Return’.","example[48]":"I went home to type up the report.","note[2]":"type something up","example[49]":"Please wait while I type in your details.","note[3]":"type something in","definition[18]":"to find out what group something such as blood, cells, or a disease belong to","example[50]":"DNA typing","definition[19]":"to write something using a typewriter or WORD PROCESSOR","example[51]":"Does the report need to be typed?","example[52]":"How fast can you type?"}