{"word[0]":"scheme","definition[0]":"an official plan that is intended to help people in some way, for example by providing education or training","example[0]":"The money will be used for teacher training schemes.","example[1]":"a pension scheme","example[2]":"The pilot scheme proved to be a great success.","note[0]":"pilot scheme","example[3]":"schemes for two new cross-city lines","note[1]":"scheme for","example[4]":"a new scheme to boost exports","note[2]":"scheme to do something","definition[1]":"a clever plan, especially to do something that is bad or illegal – used to show disapproval","example[5]":"a get-rich-quick scheme","example[6]":"a scheme to pass false cheques","definition[2]":"a system that you use to organize information, ideas etc","example[7]":"a classification scheme","form[0]":"ADJECTIVES/NOUN + scheme","collocation[0]":"a major scheme","example[8]":"The government is introducing a major house-building scheme in the area.","collocation[1]":"a new scheme","example[9]":"The new scheme aims to reduce street crime by 30%.","collocation[2]":"an innovative scheme","example[10]":"an innovative scheme to help the unemployed get back to work","collocation[3]":"a grand scheme","example[11]":"In the end, the government’s grand scheme came to nothing.","collocation[4]":"a pilot scheme","example[12]":"The programme was introduced into 100 primary schools in a very successful pilot scheme.","collocation[5]":"a training scheme","example[13]":"The company runs an apprentice training scheme.","example[14]":"Does your employer offer a pension scheme?","collocation[6]":"a compensation/bonus etc scheme","example[15]":"a new compensation scheme for accident victims","collocation[7]":"an incentive scheme","example[16]":"There is a generous incentive scheme for the sales force.","collocation[8]":"introduce/launch a scheme","example[17]":"The scheme was launched last autumn by the company’s education officer.","collocation[9]":"run/operate a scheme","example[18]":"Parent volunteers help run the scheme.","collocation[10]":"be covered by a scheme","example[19]":"All employees are covered by the new bonus scheme.","definition[3]":"to secretly make clever and dishonest plans to get or achieve something","synonym[0]":"plot","example[20]":"She’s nothing but a lying, scheming little monster!","example[21]":"She schemed to kill him with poison.","example[22]":"He became aware that people were scheming against him and called an emergency meeting.","note[3]":"scheme against","definition[4]":"an official plan or arrangement that is intended to help people in some way","example[23]":"a government training scheme for the unemployed","definition[5]":"an arrangement in which the government or an employer provides financial help to people","example[24]":"There is a low-interest loan scheme for employees who have been with the company for over two years.","definition[6]":"a clever plan, especially to do something bad or illegal","example[25]":"a $1.9 billion fraud scheme","definition[7]":"a system used to organize information","example[26]":"a new classification scheme for the library"}