{"definition[0]":"the way in which two people or two groups feel about each other and behave towards each other","example[0]":"I have quite a good relationship with my parents.","note[0]":"relationship with","example[1]":"the special relationship between Britain and the US","note[1]":"relationship between","definition[1]":"the way in which two or more things are connected and affect each other","example[2]":"The lessons bear little relationship (=they are not connected to) the children’s needs.","example[3]":"the relationship between diet and health problems","example[4]":"He’s studying politics and its relationship to the media.","note[2]":"relationship to","definition[2]":"a situation in which two people spend time together or live together, and have romantic or sexual feelings for each other","example[5]":"He’s never had a sexual relationship before.","example[6]":"She doesn’t really want a relationship with me.","example[7]":"Are you in a relationship right now?","note[3]":"in a relationship","definition[3]":"the way in which you are related to someone in your family","example[8]":"‘What’s your relationship to Sue?’ ‘She’s my cousin.’","heading[0]":"– Meaning 1: the way in which two people or two groups feel about each other and behave towards each other","collocation[0]":"have a relationship","example[9]":"We’ve always had a good relationship with our neighbours.","collocation[1]":"develop/form/build a relationship","example[10]":"By that age, children start developing relationships outside the family.","collocation[2]":"forge a relationship","example[11]":"We want to forge closer relationships with our allies.","collocation[3]":"cement a relationship","example[12]":"We want to cement relationships with other transport associations.","collocation[4]":"make relationships","example[13]":"I found it impossible to make new relationships.","form[0]":"ADJECTIVES/NOUN + relationship","collocation[5]":"good/great","example[14]":"Over the years, we’ve developed a good relationship.","example[15]":"Laura had a very close relationship with her grandmother.","collocation[6]":"friendly/harmonious","example[16]":"My friendly relationship with Scott’s family continued after his death.","example[17]":"Our relationship is strong enough to survive anything.","collocation[7]":"a love-hate relationship","example[18]":"The local people have a love-hate relationship with tourists.","collocation[8]":"a special relationship","example[19]":"I did not want to risk losing this special relationship we shared.","collocation[9]":"a supportive relationship","example[20]":"People lacking supportive relationships were expected to be prone to depression.","collocation[10]":"a working relationship","example[21]":"She’s a fine actress and we developed a great working relationship.","collocation[11]":"family relationships","example[22]":"Travelling a lot for business can strain family relationships.","collocation[12]":"a personal relationship","example[23]":"Drinking affects personal relationships.","collocation[13]":"human relationships","example[24]":"Human relationships fascinate me.","collocation[14]":"a social relationship","example[25]":"Satisfactory social relationships with adults are very important.","collocation[15]":"a business/professional relationship","example[26]":"Both companies want to continue their business relationship into the future.","collocation[16]":"the doctor-patient/parent-child/teacher-student etc relationship","example[27]":"A family crisis can adversely affect the developing parent-child relationship.","heading[1]":"– Meaning 2: the way in which two or more things are connected and affect each other","collocation[17]":"a close relationship","example[28]":"The evidence points to a close relationship between poverty and disease.","collocation[18]":"a strong/significant relationship","example[29]":"Studies show a significant relationship between smoking and heart disease.","collocation[19]":"a direct relationship","example[30]":"There is a direct relationship between the demand for a particular product and its price.","collocation[20]":"an inverse relationship","example[31]":"We concluded that there will be an inverse relationship between the market price of the bond and its true yield.","collocation[21]":"a causal relationship","example[32]":"the causal relationship between cigarette smoking and lung cancer","collocation[22]":"bear no/little relationship to something","example[33]":"The allegations bore no relationship to the facts.","collocation[23]":"establish a relationship","example[34]":"The book tries to establish a relationship between the war and social unrest in Europe.","collocation[24]":"a relationship exists","example[35]":"No relationship exists between the size of the prison population and the level of crime.","heading[2]":"– Meaning 3: a situation in which two people spend time together or live together, and have romantic or sexual feelings for each other","collocation[25]":"be in a relationship","example[36]":"Valerie and I have been in a relationship for five years.","collocation[26]":"end/break off a relationship","example[37]":"She was very upset when I ended the relationship.","collocation[27]":"start/begin a relationship","example[38]":"She is in no hurry to start another relationship.","collocation[28]":"a sexual relationship","example[39]":"He admitted having a sexual relationship with a patient.","collocation[29]":"a serious/steady relationship","example[40]":"It was his first serious relationship.","collocation[30]":"a long-term relationship","example[41]":"I have a seven-year-old daughter from a previous long-term relationship.","collocation[31]":"an on–off relationship","example[42]":"Their on–off relationship seemed to have come to an end two years ago.","collocation[32]":"a stormy/turbulent relationship","example[43]":"It had been a stormy relationship and there were frequent drunken rows.","definition[4]":"when two people spend time together or live together because they are romantically or sexually attracted to each other","example[44]":"After her marriage broke up, she had a series of disastrous relationships.","example[45]":"I don’t want to start a relationship with her, because I’m going back to South Africa.","example[46]":"Relationships between people of different cultures are often extremely difficult.","example[47]":"Why are all the interesting men I meet already in relationships?","example[48]":"Several of the psychiatrists admitted to having sexual relationships with patients.","example[49]":"Even at 35, Bobby seemed unable to commit to a romantic relationship.","display[0]":"affair","definition[5]":"a secret sexual relationship between two people, when one or both of them is married to someone else","example[50]":"The affair had been going on for years before her husband found out.","example[51]":"I had no idea that Mike had an affair with Carolyn!","example[52]":"Burton had been involved in a love affair with a woman who ended up taking most of his money.","display[1]":"fling","definition[6]":"a short and not very serious relationship","example[53]":"Yes, I did go out with him, but it was just a fling.","example[54]":"She wasn’t interested in anything more than a casual fling.","example[55]":"She left her husband after she learned about his fling with an exotic dancer.","example[56]":"They had a fling years ago.","display[2]":"romance","definition[7]":"an exciting and often short relationship between two people who feel very much in love with each other","example[57]":"It was a beautiful summer romance, but they knew it couldn’t last.","example[58]":"Richard and Penny had made no great secret of their romance, even though they were both married.","example[59]":"My romance with Lois did not survive our high school graduation.","definition[8]":"the way in which people, companies, countries etc that are working together behave towards each other","example[60]":"A key to success will be our relationship with our suppliers and our customers.","note[4]":"relationship with/between/among","example[61]":"Good personal relationships among office members are important."}