{"word[0]":"dash","definition[0]":"to go or run somewhere very quickly","example[0]":"Olive dashed into the room, grabbed her bag, and ran out again.","definition[1]":"to throw or push something violently against something, especially so that it breaks","example[1]":"The ship was dashed against the rocks.","note[0]":"dash something against/on something","example[2]":"Waves were dashing against the sea wall.","note[1]":"dash against","signpost[0]":"small amount","definition[2]":"a small amount of a substance that is added to something else","example[3]":"Add salt, pepper and a dash of vinegar.","note[2]":"dash of","definition[3]":"a small amount of a quality that is added to something else","example[4]":"Add a dash of romance to your life with a trip to Paris.","signpost[1]":"run quickly","definition[4]":"an occasion when someone runs somewhere very quickly in order to get away from something or someone, or in order to reach them","example[5]":"When the alarm went there was a mad dash for the exit.","example[6]":"He made a dash for the door.","note[3]":"make a dash for something","example[7]":"The prisoners made a dash for freedom.","example[8]":"It’s pouring with rain – we’ll have to make a dash for it.","definition[5]":"a line ( – ) used in writing to separate two closely related parts of a sentence, as for example, in the sentence ‘Go home – they’re waiting for you.’","definition[6]":"a long sound or flash of light used for sending messages in Morse code","definition[7]":"a dashboard","signpost[2]":"style","definition[8]":"style, energy, and courage in someone such as a soldier","heading[0]":"– Meaning 2: an occasion when someone runs somewhere very quickly in order to get away from something or someone, or in order to reach them","example[9]":"The rain had almost stopped so we decided to make a dash for home.","collocation[0]":"make a dash for it","example[10]":"He turned and made a dash for it but the police officer caught him.","collocation[1]":"a quick dash","example[11]":"Have I got time to make a quick dash to the shops?","collocation[2]":"a sudden dash","example[12]":"He made a sudden dash for the door.","collocation[3]":"a mad/frantic dash","example[13]":"‘Something’s burning’, she said, making a mad dash for the kitchen.","collocation[4]":"a headlong dash","example[14]":"I made a headlong dash up the street but just missed the bus.","collocation[5]":"a last-minute dash","example[15]":"We only just caught our plane, after a last-minute dash to the airport."}