{"word[0]":"this","plural[0]":"these","definition[0]":"used to refer to a person, thing, idea etc that has just been mentioned or to something that has just happened","example[0]":"We must make sure this doesn’t happen again.","example[1]":"Is there any way of solving these problems?","example[2]":"If young Daly continues to improve at this rate, he’ll soon be in the A Team.","example[3]":"This will be discussed in the next chapter.","example[4]":"This boyfriend of yours – how old is he?","definition[1]":"used to talk about the present time or a time that is close to the present","example[5]":"There will be another meeting later this week.","example[6]":"This has been the worst year of my life.","example[7]":"I thought he would have been back before this.","example[8]":"We’ll be seeing Malcolm this Friday  (=on Friday of the present week).","example[9]":"I’m sorry I was late this morning  (=today in the morning).","example[10]":"Everyone seems to be in a hurry these days (=at the present period).","example[11]":"I want to see you in my office this minute (=immediately).","definition[2]":"used to talk about the present situation","example[12]":"I hate this cold damp weather.","example[13]":"Things have never been as bad as this before.","definition[3]":"used to talk about a thing or person that is near you, the thing you are holding, or the place where you are","example[14]":"These are your gloves, aren’t they?","example[15]":"You have to park on this side of the road.","example[16]":"I can’t bear the atmosphere in this house much longer.","definition[4]":"used to refer to something that you are going to say or that is just about to happen","example[17]":"Now, listen to this.","example[18]":"Wait till you hear this joke.","example[19]":"This is going to surprise you.","definition[5]":"used in stories, jokes etc when you mention a person or thing for the first time","example[20]":"I met this really weird guy last night.","example[21]":"Suddenly, there was this tremendous bang.","definition[6]":"used to introduce someone to someone else","example[22]":"Sam, this is my sister, Liz.","definition[7]":"used to give your name when you are speaking on the telephone","example[23]":"‘Can I speak to Joan, please?’ ‘This is Joan speaking.’","definition[8]":"used to say how big, how much etc, when you are showing the size, amount etc with your hands","example[24]":"The table’s about this high and this wide.","example[25]":"You need to cut about this much off the end of the pipe.","type[0]":"usually in questions and negatives","definition[9]":"as good, bad, much etc as in the present situation","example[26]":"I hadn’t realised that things had got this bad.","example[27]":"I’ve never had this much money before."}