{"word[0]":"loan","definition[0]":"an amount of money that you borrow from a bank etc","example[0]":"I had to take out a loan to buy my car.","example[1]":"It’ll be years before we’ve paid off the loan.","example[2]":"a loan of £60,000","note[0]":"loan of","definition[1]":"when you lend something to someone","example[3]":"Thanks for the loan of your camera.","collocation[0]":"take out a loan","example[4]":"Most home buyers take out a loan.","collocation[1]":"repay/pay off/pay back a loan","example[5]":"You can repay the loan early without a penalty.","collocation[2]":"give somebody a loan","example[6]":"I hoped to persuade my bank manager to give us a loan.","collocation[3]":"make a loan","example[7]":"Banks are cautious about making new loans.","collocation[4]":"ask for/apply for a loan","example[8]":"He asked his father for a loan.","collocation[5]":"get a loan","example[9]":"She got a loan from the bank.","collocation[6]":"secure a loan (on something)","example[10]":"The loan was secured on his home.","form[0]":"ADJECTIVES/NOUN + loan","collocation[7]":"a £20,000/$5,000 etc loan","example[11]":"The company asked for a £100,000 loan.","collocation[8]":"a bank loan","example[12]":"What is the interest you will pay on a bank loan?","collocation[9]":"a home/car loan","example[13]":"They took out a thirty-year home loan.","collocation[10]":"a personal loan","example[14]":"If you want money for a specific purchase, you can get a personal loan.","collocation[11]":"a business loan","example[15]":"The bank offers a range of business loans to meet the needs of small businesses.","collocation[12]":"a student loan","example[16]":"Many college graduates are paying off huge student loans.","collocation[13]":"a long-term/short-term loan","example[17]":"I intended the money as a short-term loan.","collocation[14]":"an interest-free loan","example[18]":"They offer an interest-free loan for two years.","collocation[15]":"a low-interest loan","example[19]":"a low-interest loan to the country from the International Development Association","form[1]":"loan + NOUN","collocation[16]":"a loan repayment","example[20]":"your monthly loan repayments","collocation[17]":"a loan agreement","example[21]":"Read the terms of your loan agreement carefully.","definition[2]":"an amount of money that is borrowed, especially from a bank or company, which you agree to pay back by the end of a period of time","example[22]":"We took out a loan to buy a new car.","example[23]":"He is paying back a $50,000 loan.","display[0]":"mortgage","definition[3]":"a large amount of money that someone borrows from a bank or company to buy a house","example[24]":"Nick told me the mortgage on his apartment is worth about $90,000.","example[25]":"Anyone taking out a mortgage should be aware that interest rates can go up at any time.","example[26]":"It took my parents nearly thirty years to pay off  their mortgage.","display[1]":"interest","definition[4]":"money that you pay for borrowing money, especially that you pay every year or every month at a fixed rate","example[27]":"Credit companies charge huge amounts of interest.","example[28]":"What’s the interest on the loan?","display[2]":"overdraft","definition[5]":"the amount of money that you owe to bank when you have spent more money than you had in your account","example[29]":"I left university with no job and a big overdraft.","example[30]":"20% of the bank’s customers regularly use their overdraft facility.","example[31]":"You have to pay a fee for unauthorized overdrafts.","display[3]":"debt","definition[6]":"an amount of money that a person or organization owes","example[32]":"The company now has debts of almost £2 million.","example[33]":"A lot of the money went towards paying his debts.","example[34]":"The family were $100,000 in debt  (=they owed $100,000).","display[4]":"credit","definition[7]":"an arrangement with a shop or bank that allows you to buy something and pay for it later","example[35]":"We bought the furniture on credit.","example[36]":"He had a credit limit of £7,000.","definition[8]":"to lend someone something, especially money","example[37]":"Can you loan me $5?","note[1]":"loan somebody something","example[38]":"Jeff’s loaned us his car for the weekend.","definition[9]":"to lend something valuable to someone","example[39]":"The National Library has loaned several manuscripts.","example[40]":"Two of the steam trains have been loaned to other railways.","note[2]":"loan something to somebody/something","definition[10]":"money borrowed from a bank, financial institution, person etc on which interest is usually paid to the lender until the loan is repaid","example[41]":"The couple took out and repaid several loans (=obtained them and paid them back) to build up their business.","example[42]":"The bank recently made a loan to the company for a new warehouse.","example[43]":"Citibank will provide loans of $50,000 to $250,000 to small contractors.","example[44]":"More than 40 financial institutions have extended loans (=given loans) to the real estate firm.","definition[11]":"to make repayments on a loan","example[45]":"With rising sales, he saw no problem servicing the loans.","definition[12]":"to collect repayments on a loan for another organization","example[46]":"Many lenders continue to service loans they have sold into the secondary market.","definition[13]":"to replace an old loan with a new one","example[47]":"Homeowners rushed to refinance and prepay their loans at lower interest rates.","example[48]":"The IMF has already loaned the country $11 billion.","note[3]":"loan somebody something/loan something to somebody"}