{"word[0]":"custody","definition[0]":"the right to take care of a child, given to one of their parents when they have divorced","example[0]":"The mother is usually awarded custody  (=legally allowed to have custody).","example[1]":"a dispute over who should have custody of the children","example[2]":"The couple will retain joint custody  (=they will both have custody) of their daughters.","example[3]":"Allen is fighting a bitter custody battle over his three children.","example[4]":"He got custody of his son after the divorce.","note[0]":"custody of","definition[1]":"when someone is kept in prison until they go to court, because the police think they have committed a crime","example[5]":"The committee is looking at alternatives to custody.","example[6]":"She was taken into custody as a suspect.","example[7]":"A man is being held in police custody in connection with the murder.","note[1]":"hold/keep somebody in custody","example[8]":"A man has been remanded in custody charged with the murder of a schoolgirl.","note[2]":"remand somebody in custody","example[9]":"the death of a man in custody","note[3]":"in custody","definition[2]":"when someone is responsible for keeping and looking after something","example[10]":"Managers are responsible for the safe custody and retention of records.","example[11]":"The collection of art books is now in the custody of the university.","heading[0]":"– Meaning 1: the right to take care of a child, given to one of their parents when they have divorced","collocation[0]":"have custody of somebody","example[12]":"Anna has custody of their six-year-old daughter.","collocation[1]":"get custody","example[13]":"She was determined to prevent Mike getting custody of Adam.","collocation[2]":"seek custody","example[14]":"Allen is seeking custody of his two children.","collocation[3]":"be given/awarded custody","example[15]":"The court will decide who will be given custody.","collocation[4]":"win custody","example[16]":"Their mother is likely to win custody.","collocation[5]":"claim custody","example[17]":"Henry has claimed custody of his son.","form[0]":"ADJECTIVES/NOUN + custody","collocation[6]":"joint custody","example[18]":"After the breakup, the parents were awarded joint custody.","collocation[7]":"sole custody","example[19]":"The mother got sole custody because of the father's violence.","collocation[8]":"child custody","example[20]":"Matters of child custody are dealt with by the courts.","form[1]":"custody + NOUN","collocation[9]":"a custody battle/dispute","example[21]":"He is fighting a bitter  custody battle for his children.","heading[1]":"– Meaning 2: when someone is kept in prison until they go to court, because the police think they have committed a crime","collocation[10]":"be held/kept in custody","example[22]":"The men have been held in custody since they were arrested.","collocation[11]":"be remanded in custody","example[23]":"Davis has been remanded in custody on a burglary charge.","collocation[12]":"take somebody into custody","example[24]":"Three armed FBI agents took Coleman into custody.","collocation[13]":"place somebody in custody","example[25]":"Few young people are placed in custody.","collocation[14]":"remain in custody","example[26]":"The judge ruled that Marsh should remain in custody until his sentence.","collocation[15]":"be released from custody","example[27]":"Seventy-five percent of young people released from custody re-offend within two years.","collocation[16]":"police/military custody","example[28]":"There have been several cases in which people have died in police custody.","collocation[17]":"protective custody","example[29]":"The rebel leader has been placed in protective custody.","definition[3]":"kept in prison by police until you go to court, because the police think you are guilty","example[30]":"He was arrested and taken into custody.","definition[4]":"when a financial institution looks after someone’s share certificates, money, assets etc, or invests money for them","example[31]":"The new subsidiary will offer custody services.","example[32]":"The shares are in a custody account."}