{"word[0]":"demonstration","definition[0]":"an event at which a large group of people meet to protest or to support something in public","example[0]":"Supporters staged a demonstration outside the US embassy.","example[1]":"Police opened fire on a peaceful demonstration.","example[2]":"a demonstration against the government’s educational policies","note[0]":"demonstration against","definition[1]":"an act of explaining and showing how to do something or how something works","example[3]":"a cookery demonstration","example[4]":"He gave a practical demonstration of the boat’s military potential.","note[1]":"demonstration of","definition[2]":"an action that proves that someone or something has a particular ability, quality, or feeling","example[5]":"The high level of calls is a clear demonstration of the need for this service.","example[6]":"a physical demonstration of affection","collocation[0]":"hold/stage a demonstration","example[7]":"In April, students began holding demonstrations to demand more freedom.","collocation[1]":"organize a demonstration","example[8]":"A large demonstration was organized by the opposition.","collocation[2]":"take part in a demonstration","example[9]":"As many as 400,000 people took part in the demonstration.","collocation[3]":"go on a demonstration","example[10]":"I've never been on a demonstration before.","collocation[4]":"join a demonstration","example[11]":"They were prevented by police from joining the demonstration.","collocation[5]":"break up a demonstration","example[12]":"Police moved in to break up the demonstration.","collocation[6]":"provoke/spark a demonstration","example[13]":"The incident sparked a demonstration of 2,000 people.","collocation[7]":"a demonstration takes place","example[14]":"Violent street demonstrations took place in the capital.","form[0]":"ADJECTIVES/NOUN + demonstration","collocation[8]":"a big/large demonstration","example[15]":"Opponents of the new law are planning a big demonstration next week.","collocation[9]":"a huge/massive demonstration","example[16]":"a series of massive demonstrations against the war","collocation[10]":"a mass demonstration","example[17]":"There have been mass demonstrations in some American cities.","collocation[11]":"a peaceful demonstration","example[18]":"Everyone has the right to take part in peaceful demonstrations.","collocation[12]":"a violent demonstration","example[19]":"Nine people have been killed during violent demonstrations.","collocation[13]":"a street demonstration","example[20]":"A street demonstration completely blocked the centre of the city.","collocation[14]":"a student demonstration","example[21]":"In France, student demonstrations were disrupting university teaching.","collocation[15]":"a public demonstration","example[22]":"A series of public demonstrations have been held in cities across the country.","collocation[16]":"a protest demonstration","example[23]":"The price increases were met by a series of strikes and protest demonstrations.","collocation[17]":"a political demonstration","example[24]":"She was arrested twice for her part in political demonstrations.","collocation[18]":"an anti-government/pro-democracy etc demonstration","example[25]":"There have been further violent anti-government demonstrations this week.","collocation[19]":"a demonstration in support of something/somebody","example[26]":"public demonstrations in support of the rebels","collocation[20]":"a demonstration in protest at something","example[27]":"There were demonstrations in protest at the food shortages.","definition[3]":"an act of explaining and showing how a product works or how something is done","example[28]":"He gave a demonstration of how the program works.","example[29]":"a sales demonstration (=one done in order to sell something) of vacuum cleaners"}