{"word[0]":"zone","definition[0]":"a large area that is different from other areas around it in some way","example[0]":"San Francisco and Tokyo are both located in earthquake zones.","example[1]":"The government has set up a special economic zone to promote private enterprise.","form[0]":"ADJECTIVES/NOUN + zone","collocation[0]":"a danger zone","example[2]":"Civilians were told to leave the danger zone.","collocation[1]":"a war/battle/combat zone","example[3]":"Planes were diverted to avoid flying over the war zone.","collocation[2]":"an earthquake zone","example[4]":"It’s not advisable to build nuclear reactors in an earthquake zone.","collocation[3]":"a disaster zone","example[5]":"The damage is so serious that the government has declared the city a disaster zone.","collocation[4]":"an economic zone","example[6]":"The area has been made a special economic zone.","collocation[5]":"an enterprise zone","example[7]":"Small businesses predominated in the enterprise zone.","collocation[6]":"a no-parking zone","example[8]":"You can’t leave your car here – it’s a no-parking zone.","collocation[7]":"a pedestrian zone","example[9]":"The main part of the city centre is a pedestrian zone.","collocation[8]":"a 20 mph/30 mph etc zone","example[10]":"He was doing 42 mph in a 30 mph zone.","collocation[9]":"a demilitarized zone","example[11]":"The demilitarized zone between Iraq and Kuwait was created after the first Gulf war.","collocation[10]":"a no-fly zone","example[12]":"the no-fly zone over Iraq","collocation[11]":"a nuclear-free/smoke-free etc zone","example[13]":"The county council offices are a smoke-free zone.","collocation[12]":"set up/establish/create a zone","example[14]":"The government intends to set up an enterprise zone in the region.","collocation[13]":"enter a zone","example[15]":"He didn’t see the sign saying he’d entered a 20 mph zone.","definition[1]":"if an area of land is zoned, it is officially kept to be used for a particular purpose","example[16]":"The land is currently zoned for residential use.","note[0]":"be zoned for something","explanation[0]":"Zone is usually passive in this meaning","definition[2]":"a large area that is different from others around it in some way","example[17]":"This is a no-parking zone.","example[18]":"90% of non-smokers want smoke-free zones at work and in public places.","definition[3]":"a group of countries where you do not need a licence to import goods, you do not need special documents to travel etc","definition[4]":"an area of a city that is used for a particular purpose or activity, such as houses or shops","example[19]":"The trucks are limited by federal law to the commercial zone.","example[20]":"The company’s five factories are situated in a new industrial zone outside the city.","definition[5]":"to divide a town or city into different areas for different purposes","example[21]":"The privately owned land is currently zoned for residential use  (=for houses) ."}