{"word[0]":"halt","definition[0]":"a stop or pause","example[0]":"Heavy snowfalls brought traffic to a halt (=made it stop moving).","example[1]":"The World Championship was brought to a temporary halt (=was stopped from continuing).","example[2]":"The president has called for a halt to the wave of emigration.","example[3]":"The whole peace process seems to have ground to a halt.","note[0]":"come/grind/screech etc to a halt","example[4]":"The car skidded to a halt.","definition[1]":"a place in the countryside where a train stops to let passengers get off, but where there is no station","collocation[0]":"bring something to a halt","example[5]":"Paris was brought to a halt by striking transport workers.","collocation[1]":"something/somebody comes to a halt","example[6]":"In front of them, the truck gradually slowed down and came to a halt.","collocation[2]":"something grinds to a halt","example[7]":"Just ahead, he could see traffic grinding to a halt.","collocation[3]":"something screeches/shudders/skids/jolts to a halt","example[8]":"The car skidded to a halt and three men jumped out.","collocation[4]":"something draws to a halt","example[9]":"As the train drew to a halt, people started to get off.","collocation[5]":"call for a halt to something","example[10]":"The government has called for a halt to the violence.","collocation[6]":"order a halt to something","example[11]":"Judge Marquez ordered a halt to logging on Indian lands.","collocation[7]":"demand a halt to something","example[12]":"Irish farmers demanded a halt to imports of British cattle.","collocation[8]":"put a halt to something","example[13]":"The news put a halt to our celebrations.","collocation[9]":"an abrupt halt","example[14]":"His career came to an abrupt halt when he was seriously injured in a road accident.","collocation[10]":"a sudden halt","example[15]":"My happiness was brought to a sudden halt by the death of my father.","collocation[11]":"a premature halt","example[16]":"Bad weather brought the game to a premature halt.","collocation[12]":"a temporary halt","example[17]":"The game was brought to a temporary halt when the floodlights failed.","collocation[13]":"an immediate halt","example[18]":"The government called for an immediate halt to the fighting.","collocation[14]":"a complete halt","example[19]":"Wendy had slowed down, almost to a complete halt.","collocation[15]":"a grinding halt","example[20]":"One accident can bring the whole road system to a grinding halt.","collocation[16]":"a shuddering halt","example[21]":"He slammed his foot on the brake pedal, bringing the truck to a shuddering halt.","definition[2]":"to prevent someone or something from continuing – used especially in news reports","example[22]":"The government has failed to halt economic decline.","example[23]":"Safety concerns have led them to halt work on the dam.","explanation[0]":"Halt is mainly used in journalism. In everyday English, people usually say stop:","example[24]":"They had to stop the building work.","definition[3]":"to stop moving","example[25]":"The parade halted by a busy corner.","definition[4]":"used as a military order to tell someone to stop moving or soldiers to stop marching","example[26]":"Company halt!","example[27]":"Halt! Who goes there?"}