{"word[0]":"satisfying","definition[0]":"making you feel pleased and happy, especially because you have got what you wanted","opposite[0]":"unsatisfying","example[0]":"a deeply satisfying feeling","example[1]":"It can be very satisfying to work in the garden.","note[0]":"it is satisfying (to do something)","definition[1]":"food that is satisfying makes you feel that you have eaten enough","example[2]":"a satisfying meal","definition[2]":"making you feel satisfied, because you have got or achieved something you wanted","example[3]":"There’s something very satisfying about baking your own bread.","example[4]":"Teaching can be immensely satisfying.","display[0]":"rewarding","definition[3]":"satisfying, because you feel you are doing something useful for yourself or for other people","example[5]":"Nursing is a very rewarding job.","example[6]":"It's been hard work, but very rewarding.","display[1]":"fulfilling","definition[4]":"making you feel satisfied and happy with your life, because you are using your abilities in a useful way. Fulfilling and rewarding are very close in meaning. Fulfilling is used more about your feelings about your life in general, and that something makes you feel a happier person","example[7]":"We want to provide a more fulfilling life for people who are mentally ill.","example[8]":"a happier and more fulfilling relationship","example[9]":"What should be a happy and fulfilling experience all too often is not.","display[2]":"pleasing","definition[5]":"making you feel pleased and satisfied, because something is good","example[10]":"The results of the training scheme were very pleasing.","display[3]":"gratifying","definition[6]":"making you feel pleased and satisfied, especially because people like what you have done, or you feel that you were right about something","example[11]":"Their enthusiastic reception of his paintings was very gratifying.","example[12]":"It's gratifying to know that these videos are appreciated.","example[13]":"It is extremely gratifying to hear that something I did affected someone's life in such a positive way."}