{"word[0]":"suspect","definition[0]":"to think that something is probably true, especially something bad","example[0]":"She’s not going to be very happy about this, I suspect.","example[1]":"I suspected that there was something wrong with the engine.","note[0]":"suspect (that)","example[2]":"She strongly suspected he was lying to her.","definition[1]":"to think that something bad has happened or is happening","example[3]":"The doctors suspected pneumonia.","example[4]":"The position of the body led the police to suspect murder.","note[1]":"suspect murder/foul play","example[5]":"He never suspected anything.","note[2]":"suspect something/nothing/anything","definition[2]":"to think that someone is probably guilty of a crime","example[6]":"Who do you suspect?","example[7]":"He’s suspected of murder.","note[3]":"suspect somebody of (doing) something","example[8]":"Pilcher was suspected of giving away government secrets to the enemy.","definition[3]":"to think that something is not honest or true","example[9]":"I began to suspect his motives in inviting me.","explanation[0]":"You suspect that someone does, did, or has done something","example[10]":"I suspect she knows","example[11]":"I suspect he took the money","example[12]":"I suspect they have met before","explanation[1]":"You suspect that something may or might be true","example[13]":"We suspect that he may know something about the robbery","example[14]":"The police suspect that he might be a terrorist","explanation[2]":"You suspect that someone may or might have  done something","example[15]":"Police suspect Foster may have been involved in a fraud","example[16]":"I suspect he might have exaggerated a lot of the things in the book","explanation[3]":"You suspected that something would happen","example[17]":"He suspected that the problem would only get worse","example[18]":"I suspected that I would not enjoy the meeting","explanation[4]":"In all the above patterns, ‘that’ is optional  I suspect that or just I suspect","explanation[5]":"Suspect is not used in the progressive You say","example[19]":"I suspect he’s lying","bad_example[0]":"I am suspecting he’s lying","definition[4]":"someone who is thought to be guilty of a crime","example[20]":"Two suspects were arrested today in connection with the robbery.","example[21]":"Police have issued a description of the murder suspect.","example[22]":"Davies is still the chief suspect.","note[4]":"main/prime/chief suspect","example[23]":"the two suspects for the robbery","note[5]":"suspect for","example[24]":"a suspect in a burglary case","note[6]":"suspect in","form[0]":"ADJECTIVES/NOUN + suspect","collocation[0]":"the prime/chief/main suspect","example[25]":"She didn’t realise he was the prime suspect in a murder case.","collocation[1]":"the number one suspect","example[26]":"I was the one who found her. And that makes me the number one suspect for her murder.","collocation[2]":"a murder/burglary etc suspect","example[27]":"The murder suspect is described as in his early 20s, wearing a baseball type cap and a dark jacket.","collocation[3]":"a possible suspect","example[28]":"The police drew up a list of possible suspects.","collocation[4]":"arrest/detain a suspect","example[29]":"Detectives arrested the suspect after a five-day undercover operation.","collocation[5]":"question/interrogate/interview a suspect","example[30]":"Police confirmed that six suspects are being questioned.","definition[5]":"not likely to be completely honest","synonym[0]":"dodgy","example[31]":"I’ve always thought he was a bit of a suspect character.","example[32]":"The company was involved in some highly suspect business dealings.","definition[6]":"not likely to be completely true","example[33]":"The two men were convicted on the basis of some highly suspect evidence.","definition[7]":"likely to have problems and not work well","example[34]":"The engine sounded a bit suspect.","definition[8]":"likely to contain a bomb or something illegal or dangerous","example[35]":"Police were called in to check out a suspect van."}