{"word[0]":"client","definition[0]":"someone who gets services or advice from a professional person, company, or organization","synonym[0]":"customer","example[0]":"a meeting with an important client","definition[1]":"a computer on a network that receives information from a server (=large powerful computer)","form[0]":"ADJECTIVES/NOUN + client","example[1]":"Most firms are desperate for new clients.","example[2]":"This is an important client and we do not want to lose her.","collocation[0]":"a major client","example[3]":"Some of our major clients have not taken the news of the merger well.","collocation[1]":"a potential/prospective client","example[4]":"Make sure potential clients know about all of your services.","collocation[2]":"an existing client","example[5]":"We are very keen to keep our existing clients happy.","collocation[3]":"a private client","example[6]":"There are more than 200 stockbroking firms eager to take on private clients.","collocation[4]":"a business client","example[7]":"Competition for business clients between travel companies is keen.","collocation[5]":"a corporate client","example[8]":"Our law firm represents numerous corporate clients.","collocation[6]":"advise a client","example[9]":"The surveyor will advise his client on the value of the property.","collocation[7]":"act for/on behalf of a client","example[10]":"The lawyer will write confirming that he agrees to act for his client.","collocation[8]":"represent a client","example[11]":"Mead was a top attorney representing major corporate clients.","collocation[9]":"deal with a client","example[12]":"They receive training to help them deal with difficult clients.","form[1]":"client + NOUN","collocation[10]":"a client base","example[13]":"The company quickly expanded its client base in the US.","definition[2]":"someone who pays for services or advice from a professional person or organization","example[14]":"It is one of the stockbroking firm’s biggest corporate clients (=clients that are companies).","example[15]":"Defence lawyer Ronald Cole said his client was suffering from deep depression.","definition[3]":"someone who buys something from a seller","synonym[1]":"CUSTOMER","example[16]":"Most of the shop’s regular clients are men.","definition[4]":"a computer connected to another computer that controls it, for example in a NETWORK"}