{"word[0]":"typical","definition[0]":"having the usual features or qualities of a particular group or thing","example[0]":"typical British weather","example[1]":"This advertisement is a typical example of their marketing strategy.","example[2]":"This painting is typical of his work.","note[0]":"typical of","definition[1]":"happening in the usual way","example[3]":"On a typical day, our students go to classes from 7.30 am to 1 pm.","example[4]":"Try calculating your budget for a typical week.","definition[2]":"behaving in the way that you expect","example[5]":"Bennett accepted the award with typical modesty.","example[6]":"Mr Stevens’ appointment was a typical case of promoting a man beyond his level of competence.","example[7]":"It’s not typical of Gill to be so critical.","note[1]":"it is typical of somebody to do something","definition[3]":"a typical person or thing is a good example of that type of person or thing","example[8]":"With his camera around his neck, he looked like a typical tourist.","example[9]":"The windows are typical of houses built during this period.","display[0]":"classic","definition[4]":"used to describe a very typical and very good example of something","example[10]":"It was a classic case of the cure being worse than the disease.","example[11]":"a classic mistake","example[12]":"The book is a classic example of great teamwork.","display[1]":"archetypal","definition[5]":"the archetypal  person or thing is the most typical example of that kind of person or thing, and has all their most important qualities","example[13]":"the archetypal English village","example[14]":"Indiana Jones is the archetypal adventure hero.","display[2]":"quintessential","definition[6]":"used when you want to emphasize that someone or something is the very best example of something – used especially when you admire them very much","example[15]":"the quintessential guide to New York","example[16]":"Robert Plant is the quintessential rock ‘n’ roll singer.","display[3]":"stereotypical","definition[7]":"having the characteristics that many people believe a particular type of person or thing has – used when you think these beliefs are not true","example[17]":"Hollywood films are full of stereotypical images of women as wives and mothers.","example[18]":"He challenges stereotypical ideas about people with disabilities.","display[4]":"representative","definition[8]":"containing the most common types of people or things that are found in something, and showing what it is usually like","example[19]":"a representative sample of college students","display[5]":"characteristic","definition[9]":"very typical of a particular type of thing, or of someone’s character or usual behaviour","example[20]":"Each species of bird has its own characteristic song.","example[21]":"What gives Paris its characteristic charm?","example[22]":"He played with his characteristic skill.","example[23]":"the characteristic symptoms of the disease","display[6]":"be the epitome of something","definition[10]":"to be the best possible example of a particular type of person or thing or of a particular quality","example[24]":"His house was thought to be the epitome of good taste.","definition[11]":"used to show that you are annoyed when something bad happens again, or when someone does something bad again"}