{"word[0]":"keep","past_tense[0]":"kept","type[0]":"linking verb, transitive","signpost[0]":"not change","definition[0]":"to stay in a particular state, condition, or position, or to make someone or something do this","note[0]":"keep left/right (=stay to the left or right of a path or road as you move)","example[0]":"You won’t be able to keep it secret forever.","example[1]":"Peter cycles to work to keep fit.","example[2]":"Don’t keep us in suspense any longer!","example[3]":"How can I cut your hair if you won’t keep still!","example[4]":"We huddled around the fire to keep warm.","note[1]":"keep (somebody/something) warm/safe/dry etc","example[5]":"I was struggling to keep awake.","note[2]":"keep calm/awake/sane etc","example[6]":"Keep your room tidy.","note[3]":"keep something clean/tidy","example[7]":"some toys to keep the kids amused","note[4]":"keep somebody busy/amused/occupied","example[8]":"The police put up barriers to keep the crowds back.","note[5]":"keep (somebody/something) away/back/off/out etc","example[9]":"If I were you, I’d keep away from that area at night.","example[10]":"a sign saying ‘Danger: Keep Out’","example[11]":"The little boy kept close to his mother.","example[12]":"Keep him out of trouble.","note[6]":"keep (somebody) out of something","example[13]":"You keep out of this, Mother  (=do not get involved). It’s no concern of yours.","example[14]":"Jane kept the engine running.","note[7]":"keep somebody/something doing something","explanation[0]":"Keep is used as a linking verb in this meaning It links the subject of the sentence with an adjective","example[15]":"I try to keep busy","example[16]":"The fruit will keep fresh for several weeks","signpost[1]":"continue doing something","definition[1]":"to continue doing something or to do the same thing many times","example[17]":"I keep thinking about Joe, all alone in that place.","note[8]":"keep (on) doing something","example[18]":"I keep telling you, but you won’t listen!","example[19]":"She pretended not to hear, and kept on walking.","explanation[1]":"Keep is followed by an -ing form, not an infinitive You say","example[20]":"He kept talking to me","bad_example[0]":"He kept to talk to me","signpost[2]":"not give back","definition[2]":"to have something and not give it back to the person who had it before","example[21]":"You can keep it. I don’t need it anymore.","signpost[3]":"not lose","definition[3]":"to continue to have something and not lose it or get rid of it","example[22]":"We decided to keep our old car instead of selling it.","example[23]":"I kept his letters for years.","example[24]":"In spite of everything, Robyn’s managed to keep her sense of humor.","signpost[4]":"store something","definition[4]":"to leave something in one particular place so that you can find it easily","example[25]":"Where do you keep your teabags?","example[26]":"George kept a bottle of whiskey under his bed.","signpost[5]":"make somebody stay in a place","definition[5]":"to make someone stay in a place, especially a prison or hospital","example[27]":"He was kept in prison for a week without charge.","signpost[6]":"delay somebody","definition[6]":"to delay someone","example[28]":"He should be here by now. What’s keeping him?","signpost[7]":"do what you promised","definition[7]":"to do what you have promised or agreed to do","example[29]":"patients who fail to keep their appointments","example[30]":"How do I know you’ll keep your word?","note[9]":"keep your word/promise","definition[8]":"if food keeps, it stays fresh enough to be eaten","example[31]":"Eat the salmon because it won’t keep till tomorrow.","definition[9]":"to own and look after animals","example[32]":"We keep chickens and a couple of pigs.","signpost[8]":"stop other people from using something","definition[10]":"to stop other people from using something, so that it is available for someone","example[33]":"Will you keep a seat for me?","signpost[9]":"shop","definition[11]":"to own a small business and work in it","signpost[10]":"provide somebody with things","definition[12]":"to provide someone with money, food etc","example[34]":"He did not earn enough to keep a wife and children.","example[35]":"There’s enough money there to keep you in champagne for a year!","note[10]":"keep somebody in something","signpost[11]":"protect","definition[13]":"to guard or protect someone","example[36]":"The Lord bless you and keep you.","example[37]":"His only thought was to keep the child from harm.","example[38]":"Where do you keep the scissors?","example[39]":"The keys are kept in my office.","display[0]":"store","definition[14]":"to put things away and keep them until you need them","example[40]":"Villagers have begun storing wood for the winter.","definition[15]":"to keep something so that you can use or enjoy it in the future","example[41]":"He had been saving the bottle of champagne for a special occasion.","example[42]":"We can save the rest of the pie for later.","display[1]":"file","definition[16]":"to store papers or information in a particular order or a particular place","example[43]":"All the contracts are filed alphabetically.","display[2]":"collect","definition[17]":"to get and keep objects of the same type because you think they are attractive or interesting","example[44]":"Kate collects old postcards.","definition[18]":"to keep something to be used when it is needed, especially something that many different people may need to use","example[45]":"Medical records are now usually held on computers.","display[3]":"reserve","definition[19]":"to keep part of something for use at a later time during a process such as cooking","example[46]":"Reserve some of the chocolate so that you can use it for decorating the cake.","display[4]":"hoard","definition[20]":"to keep large amounts of food, money etc because you think you may not be able to get them in the future – used when you do not approve of people doing this because it is not necessary or not fair to other people","example[47]":"People have been hoarding food and fuel in case there is another attack.","example[48]":"Rationing of basic food products was introduced to prevent hoarding.","definition[21]":"a large strong tower, usually in the centre of a castle","definition[22]":"to store something that will be useful","example[49]":"The Credit Reference Agency keeps files on individuals’ debt records.","example[50]":"You shouldkeep a supply of forms.","definition[23]":"to regularly record written information somewhere"}