{"word[0]":"practical","definition[0]":"relating to real situations and events rather than ideas, emotions etc","example[0]":"Candidates should have training and practical experience in basic electronics.","example[1]":"the practical problems of old age","example[2]":"They provide financial and practical help for disabled students.","example[3]":"a combination of theoretical and practical training","example[4]":"They haven’t thought about the practical consequences of the new regulations.","example[5]":"In practical terms, this means spending more time with each student.","signpost[0]":"effective","definition[1]":"practical plans, methods etc are likely to succeed or be effective in a situation","opposite[0]":"impractical","example[6]":"It doesn’t sound like a very practical solution.","example[7]":"a practical way of achieving greater efficiency","example[8]":"Unfortunately, there’s no practical alternative to driving.","example[9]":"a practical guide to buying and selling a house","signpost[1]":"clear thinking","definition[2]":"a practical person is good at dealing with problems and making decisions based on what is possible and what will really work","example[10]":"She’s a very practical person.","example[11]":"I was very shocked, but tried to be practical and think what to do.","definition[3]":"useful or suitable for a particular purpose or situation","example[12]":"Skirts aren’t very practical in my kind of work.","signpost[2]":"using your hands","definition[4]":"good at repairing or making things","example[13]":"I’m not very practical – I can’t even change a light bulb.","collocation[0]":"practical experience","example[14]":"You have to gain practical experience before you qualify as a solicitor.","collocation[1]":"practical work","example[15]":"Archaeology students are required to do a certain amount of practical work.","collocation[2]":"practical problems/difficulties","example[16]":"The local Social Services Department may be able to help with practical problems.","collocation[3]":"practical help/support","example[17]":"There will be trained people available to listen and to provide practical help.","collocation[4]":"practical advice","example[18]":"The booklets offer clear, practical advice on running your business.","collocation[5]":"practical use","example[19]":"Knowledge without understanding is of little practical use.","collocation[6]":"practical considerations","example[20]":"There are a number of practical considerations that must be taken into account when choosing a car.","collocation[7]":"practical implications","example[21]":"He was well aware of the practical implications of his theory.","collocation[8]":"in practical terms","example[22]":"In practical terms, the experiment is going to be difficult.","definition[5]":"a lesson or examination in science, cooking etc in which you have to do or make something yourself rather than write or read about it","example[23]":"a chemistry practical"}