{"word[0]":"exhibition","definition[0]":"a show of paintings, photographs, or other objects that people can go to see","example[0]":"The museum is staging an exhibition of Picasso’s work.","note[0]":"stage/mount/hold etc an exhibition","example[1]":"an exhibition of black and white photographs","note[1]":"exhibition of","definition[1]":"when something such as a painting is shown in a public place","example[2]":"She never agreed to the public exhibition of her sculptures while she was still alive.","example[3]":"A collection of paintings by David Hockney is on exhibition at the Museum of Art.","note[2]":"on exhibition","collocation[0]":"have an exhibition","example[4]":"The college is having an exhibition of the students’ work in April.","collocation[1]":"hold/mount/stage an exhibition","example[5]":"Hayward Gallery is mounting an impressive exhibition of new British artists.","collocation[2]":"put on an exhibition","example[6]":"Last summer the museum put on some wonderful exhibitions for children.","collocation[3]":"host an exhibition","example[7]":"Boston’s Museum of Fine Art hosts temporary exhibitions alongside its permanent collection.","collocation[4]":"go to an exhibition","example[8]":"We went to an exhibition of Russian art at the National Gallery.","collocation[5]":"see an exhibition","example[9]":"We also saw an exhibition of paintings by Sydney Lough Thompson, a New Zealand artist.","collocation[6]":"arrange/organize an exhibition","example[10]":"The trust arranged an exhibition of his drawings in New York.","collocation[7]":"promote an exhibition","example[11]":"Our press officer contacted the local radio and TV stations to promote the exhibition.","collocation[8]":"a big/large exhibition","example[12]":"This is the largest exhibition of its kind that we have ever seen in London.","collocation[9]":"an important exhibition","example[13]":"an important exhibition of twentieth century art","collocation[10]":"a major exhibition","example[14]":"His work is the subject of a major exhibition at the National Gallery.","collocation[11]":"a small exhibition","example[15]":"The library held a small exhibition showcasing the work of local artists.","collocation[12]":"a permanent exhibition","example[16]":"The museum hosts a permanent exhibition of Boston’s history.","collocation[13]":"a temporary exhibition","example[17]":"Temporary exhibitions are usually held in the basement.","collocation[14]":"a touring/travelling exhibition","example[18]":"The touring exhibition is scheduled to be in Dallas from March until June.","collocation[15]":"a retrospective exhibition","example[19]":"a retrospective exhibition celebrating 150 years of photography","form[0]":"exhibition + NOUN","collocation[16]":"an exhibition centre","example[20]":"The exhibition will be held in the National Exhibition Centre in Birmingham.","collocation[17]":"an exhibition hall","example[21]":"There’s a large exhibition hall on the ground floor.","collocation[18]":"an exhibition stand","example[22]":"He took up his position at the exhibition stand.","collocation[19]":"exhibition space","example[23]":"The building provides 125,000 square metres of exhibition space in 12 halls.","collocation[20]":"an exhibition venue","example[24]":"We are still looking for suitable exhibition venues.","definition[2]":"an event at which a collection of paintings, interesting objects etc are shown to the public for a period of time","example[25]":"All the photographs in the exhibition are for sale.","example[26]":"The Great Outdoors Exhibition is a great place to find out about new outdoors activities.","definition[3]":"an exhibition. Show is less formal than exhibition. It can be used about small events as well as big public ones","example[27]":"The artist is preparing a show at the Museum of Modern Art.","example[28]":"He is putting on a one-man show in a local gallery.","example[29]":"a trade show","example[30]":"the London Motor Show at Earl’s Court","display[0]":"exhibit","definition[4]":"an exhibition","example[31]":"an exhibit of Western paintings and sculptures","definition[5]":"an event at which people or businesses show or sell their products, which is often not open to the public","example[32]":"the Frankfurt Book Fair for publishers and the media","display[1]":"exposition","definition[6]":"a large and important public event at which people or businesses show or sell their products","example[33]":"177 galleries from nineteen countries will take part in the Chicago International Art Exposition.","definition[7]":"a public event where businesses and other organizations show their products and services so that people can go and see them","example[34]":"Exhibitions and trade shows are expensive but good ways to promote a message or an image.","example[35]":"the Expo 99 exhibition"}