{"word[0]":"qualify","signpost[0]":"have a right","definition[0]":"to have the right to have or do something, or to give someone this right","example[0]":"Free school lunches are given to children who qualify.","example[1]":"You may qualify for unemployment benefit.","note[0]":"qualify for","example[2]":"Membership qualifies you for a discount on purchases.","note[1]":"qualify somebody/something for something","signpost[1]":"pass exam","definition[1]":"to pass an examination or finish a course of study that you need in order to do something","example[3]":"After qualifying, doctors spend at least two years working in hospitals.","example[4]":"I finally qualified as a pilot.","note[2]":"qualify as","signpost[2]":"be considered something","definition[2]":"to have all the necessary qualities to be considered to be a particular thing","example[5]":"It doesn’t qualify as a date if you bring your children with you.","signpost[3]":"give somebody skills/knowledge","definition[3]":"if something qualifies you to do something, you have the necessary skills, knowledge, ability etc to do it","example[6]":"Fluency in three languages qualifies her for work in the European Parliament.","note[3]":"qualify somebody for something","example[7]":"The certificate qualifies you to work as a dental assistant.","note[4]":"qualify somebody to do something","definition[4]":"to reach the necessary standard to enter or continue in a competition or sports event","example[8]":"She qualified for a spot on the U.S. Olympic speed skating team.","signpost[4]":"add something","definition[5]":"to add to something that has already been said, in order to limit its effect or meaning","example[9]":"Could I just qualify that last statement?","definition[6]":"if a word or phrase qualifies another word or phrase, it limits or adds to the meaning of it","past_tense[0]":"qualified","definition[7]":"to gain the qualifications needed for a particular profession etc","example[10]":"She recently qualified as a pilot.","definition[8]":"to have the right to claim something","example[11]":"You may be able to qualify for unemployment benefit.","definition[9]":"if your knowledge or ability qualifies you to do something, it makes you a suitable person to do it","example[12]":"Our three-week course will qualify you to teach English overseas.","definition[10]":"to reach a particular stage in the process of competing for the right to do something, for example in a BID (=an occasion when someone offers to buy something, or build or make something)","example[13]":"Three multinational groups have qualified to bid for Emetel, the Ecuadorean telephone company."}