{"word[0]":"stuck","definition[0]":"the past tense and past participle of stick1","definition[1]":"impossible or unable to move from a particular position","example[0]":"Sara tried to open the window but it was stuck.","example[1]":"They got stuck in a traffic jam.","example[2]":"I’ve got something stuck in my throat.","example[3]":"The boat was stuck in the mud.","note[0]":"stuck in","definition[2]":"unable to escape from a bad or boring situation","example[4]":"Mum resented being stuck at home with two young kids.","note[1]":"stuck in/at","example[5]":"We could be stuck in this place for days.","definition[3]":"unable to do any more of something that you are working on because it is too difficult","example[6]":"Can you help me with my homework, Dad? I’m stuck.","example[7]":"If you get stuck on a difficult word, just ask for help.","note[2]":"stuck on","definition[4]":"fixed or trapped in a particular position or place and unable to move or be moved","example[8]":"I can’t open this drawer – it’s stuck.","example[9]":"Sorry I’m late – I got stuck in traffic.","display[0]":"jammed","definition[5]":"stuck and impossible to move – used especially about parts of a machine, or something trapped between two surfaces","example[10]":"The photocopier is jammed again.","example[11]":"I put in a 50p coin but it got jammed in the slot.","display[1]":"entangled","definition[6]":"twisted together and unable to be separated – used especially about things such as hair, wire, or string getting caught around something","example[12]":"The chain of her necklace was entangled in her hair.","example[13]":"Swimming in the river is dangerous because you might get entangled in the weeds.","display[2]":"stranded","definition[7]":"stuck and unable to move from or leave a place – used about people, vehicles, and animals","example[14]":"Hundreds of motorists were left stranded by the snowstorms.","example[15]":"We were stranded at Moscow airport.","example[16]":"The jellyfish were stranded on the beach.","display[3]":"beached","definition[8]":"stuck in shallow water or on the shore, and unable to move – used about whales, sea creatures, and boats","example[17]":"They helped push the beached whale back into the sea.","example[18]":"the owner of the beached vessel"}