{"word[0]":"sanction","definition[0]":"official permission, approval, or acceptance","synonym[0]":"approval","example[0]":"Apparently, the aide had acted without White House sanction.","definition[1]":"a form of punishment that can be used if someone disobeys a rule or law","synonym[1]":"punishment","example[1]":"the harshest possible sanction which could be imposed","form[0]":"ADJECTIVES/NOUN + sanctions","collocation[0]":"economic/trade sanctions","example[2]":"The United Nations is considering new economic sanctions.","collocation[1]":"international sanctions","example[3]":"International sanctions were imposed on Iraq after it invaded Kuwait in 1990.","collocation[2]":"tough/strict sanctions","example[4]":"Due to strict sanctions, the country is unable to import the medicines it needs.","collocation[3]":"impose sanctions","example[5]":"The US imposed economic sanctions on Panama.","collocation[4]":"lift sanctions","example[6]":"Washington has since refused to lift sanctions.","collocation[5]":"ease sanctions","example[7]":"The last administration decided to ease sanctions against Cuba.","collocation[6]":"enforce sanctions","example[8]":"The UN will have the job of enforcing the sanctions.","collocation[7]":"break/violate sanctions","example[9]":"Several companies broke trade sanctions by continuing to export weapons to the country.","definition[2]":"to officially accept or allow something","synonym[2]":"approve","example[10]":"The church refused to sanction the king’s second marriage.","definition[3]":"official orders or laws stopping trade, communication etc with another country as a way of forcing political changes","example[11]":"The UN security council unanimously refused to lift economic sanctions.","example[12]":"The US imposed tough trade sanctions against Cuba.","note[0]":"sanctions against","definition[4]":"a punishment for disobeying a rule or law","example[13]":"The most severe sanction the panel could recommend is expulsion from the Senate.","definition[5]":"official permission or approval","example[14]":"The proposals are subject to the official sanction of the Council."}