{"word[0]":"item","definition[0]":"a single thing, especially one thing in a list, group, or set of things","note[0]":"item of clothing/furniture/jewellery etc (=a single piece of clothing, furniture, jewellery etc)","example[0]":"He opened the cardboard box and took out each item.","example[1]":"The store is having a sale on furniture and household items.","example[2]":"luxury items such as exotic spices and perfumes","example[3]":"The original 1965 bottle is now a collector’s item (=one of a set of objects people like to collect because they are interesting or valuable).","example[4]":"We went on to the next item on the agenda.","note[1]":"item on the agenda/list/menu","definition[1]":"a single, usually short, piece of news in a newspaper or magazine, or on television","example[5]":"I also saw that news item in the Sunday Times.","heading[0]":"– Meaning 1 : a single thing, especially one thing in a list, group, or set of things","form[0]":"ADJECTIVES/NOUN + item","collocation[0]":"a particular item","example[6]":"A local authority can decide whether a particular item of expenditure should be cut.","collocation[1]":"a single/individual item","example[7]":"This is the largest amount ever paid for a single item of jewellery.","collocation[2]":"an essential/important item","example[8]":"Salt was an important item in the Roman economy.","collocation[3]":"a household item","example[9]":"The shop stocks a wide variety of household items.","collocation[4]":"a consumer item","example[10]":"Import controls have been lifted on hundreds of consumer items.","collocation[5]":"a luxury item","example[11]":"Tea and coffee, once luxury items, became standard drinks for every social class.","collocation[6]":"a collector’s item","example[12]":"This record is so rare that it has become a collector’s item.","collocation[7]":"stolen items","example[13]":"The police have recovered most of the stolen items.","collocation[8]":"the offending item","example[14]":"Replacement of the offending item should solve the problem.","collocation[9]":"miscellaneous items","example[15]":"The cardboard box contained a number of miscellaneous items.","collocation[10]":"an item of clothing","example[16]":"She’d bought a few items of clothing for her trip.","collocation[11]":"an item of jewellery","example[17]":"Expensive items of jewellery should be insured.","collocation[12]":"an item of furniture","example[18]":"A few items of furniture had not yet been delivered.","collocation[13]":"an item of food/a food item","example[19]":"Ice cream was probably her favourite item of food.","collocation[14]":"an item of vocabulary/a vocabulary item","example[20]":"Students are encouraged to write down useful vocabulary items in their notebooks.","collocation[15]":"an item on the agenda/list/menu","example[21]":"The next item on the agenda is next month’s sales conference.","collocation[16]":"a range of items","example[22]":"Clay was used to make an impressive range of items.","definition[2]":"a single thing, especially something that is for sale","example[23]":"The CD used to be considered a luxury item.","example[24]":"stores selling non-food items","definition[3]":"a piece of information written in a set of accounts","example[25]":"Carry costs can include such items as insurance and storage.","definition[4]":"one of the subjects that is to be discussed in a meeting, written on a list called an AGENDA","example[26]":"What’s the first item on the agenda?"}