{"definition[0]":"information about something that has happened recently","example[0]":"I hope to have some good news for you soon.","example[1]":"We are delighted at the news that our daughter is expecting a baby.","note[0]":"news that","example[2]":"What’s the latest news on your university application?","note[1]":"news on","example[3]":"Everyone is shocked by the news of the arrests.","note[2]":"news of/about","definition[1]":"reports of recent events in the newspapers or on the radio or television","note[3]":"local/regional/national/international news","example[4]":"a late evening news broadcast","example[5]":"We’ve got the news headlines coming up at half past twelve.","example[6]":"a news and current affairs programme","example[7]":"Here’s the sports news from Jane Murray.","example[8]":"the latest news from the Olympic stadium","example[9]":"Twenty years ago environmental issues rarely made the news (=were rarely considered important enough to be in the news).","example[10]":"His resignation was front page news (=was important news).","example[11]":"Never before has a news story triggered such sensational sales of the newspaper.","note[4]":"news story/report/item","example[12]":"news on the latest developments in the talks","note[5]":"news about/on/of","example[13]":"Several evening papers carried the news that a cabinet minister was about to resign.","example[14]":"Hong Kong is in the news this morning.","note[6]":"be in the news","collocation[0]":"good news","example[15]":"He’s feeling much better, so that’s good news.","collocation[1]":"great/wonderful news","example[16]":"They’re getting married? That’s wonderful news!","collocation[2]":"welcome news","example[17]":"The lower interest rates will be welcome news to home owners.","collocation[3]":"bad/terrible news","example[18]":"‘I’m afraid I have bad news, ’ said Jackson.","example[19]":"Have you heard the terrible news about Simon?","collocation[4]":"the latest news","example[20]":"Mom sent a letter with all the latest news.","collocation[5]":"old news","example[21]":"She wasn’t surprised; it was old news to her.","collocation[6]":"important news","example[22]":"I’ve got some important news to tell you.","collocation[7]":"the big news","example[23]":"The big news is that Polly and Richard are going to get married.","collocation[8]":"have some news (for somebody)","example[24]":"I could tell by his face that he had some news.","collocation[9]":"tell somebody the news","example[25]":"Jack called him to tell him the good news.","collocation[10]":"break the news (to somebody)","example[26]":"Two policemen came to the door to break the news about her husband.","collocation[11]":"spread the news","example[27]":"After she had the baby, her husband made phone calls to spread the happy news.","collocation[12]":"hear the news","example[28]":"She was really upset when she heard the news.","collocation[13]":"welcome the news","example[29]":"Environmental groups welcomed the news that the area would be protected.","collocation[14]":"greet the news with surprise/delight etc","example[30]":"Fans greeted the news of the victory with a loud cheer.","collocation[15]":"news spreads","example[31]":"News spreads fast in a small town.","collocation[16]":"a piece of news","example[32]":"Leo thought about this piece of news carefully.","collocation[17]":"the good news is …/the bad news is ...","example[33]":"The good news is that most stores have the game in stock; the bad news is that it’s not cheap.","explanation[0]":"News is an uncountable noun and is followed by a singular verb","example[34]":"The news was not very good","explanation[1]":"News is used with the singular form of words such as this and that","example[35]":"He was shocked when he heard this news","bad_example[0]":"these news","explanation[2]":"If someone or something is on the news, they appear or there is a report about them on a television or radio news programme","example[36]":"The minister was on the 10 o’clock news","example[37]":"I saw the pictures of the crash on the news","explanation[3]":"If someone or something is in the news, they are being discussed in newspapers and on news programmes","example[38]":"Education has been in the news a lot this week"}