{"word[0]":"plug","definition[0]":"a small object at the end of a wire that is used for connecting a piece of electrical equipment to the main supply of electricity","example[0]":"The plug on my iron needs changing.","example[1]":"an electric plug","definition[1]":"a place on a wall where electrical equipment can be connected to the main electricity supply","signpost[0]":"bath","definition[2]":"a round flat piece of rubber used for stopping the water flowing out of a bath or sink","example[2]":"the bath plug","signpost[1]":"advertisement","definition[3]":"a way of advertising a book, film etc by mentioning it publicly, especially on television or radio","example[3]":"During the show she managed to put in a plug for her new book.","note[0]":"put/get in a plug (for something)","signpost[2]":"in an engine","definition[4]":"the part of a petrol engine that makes a spark, which makes the petrol start burning","synonym[0]":"spark plug","example[4]":"Change the plugs every 10,000 miles.","signpost[3]":"to fill a hole","definition[5]":"an object or substance that is used to fill or block a hole, tube etc","example[5]":"You can fill any holes with plugs of matching wood.","note[1]":"plug of","signpost[4]":"for holding screws","definition[6]":"a small plastic tube put in a hole to hold a screw tightly","signpost[5]":"a piece of something","definition[7]":"a piece of something pressed tightly together","example[6]":"a plug of tobacco","definition[8]":"to fill or block a small hole","example[7]":"We used mud to plug up the holes in the roof.","definition[9]":"to advertise a book, film etc by mentioning it on television or radio","example[8]":"Arnie was on the show to plug his new movie.","definition[10]":"to shoot someone","definition[11]":"an attempt to persuade people to buy a book, see a film etc by talking about it publicly, especially on television or radio","example[9]":"She appeared on all the talk shows to give her new show a plug.","example[10]":"The authorput in a plug for his new book.","note[2]":"plug for","definition[12]":"to prevent a plan or business from being able to continue, especially by not providing any more money","example[11]":"We were doing fine until the bank pulled the plug on us.","definition[13]":"to try to persuade people to buy a book, see a film etc by talking about it publicly, especially on television or radio","example[12]":"He was on the show to plug his new movie.","example[13]":"The insurance company is plugging the advantages of mortgage protection insurance."}