{"word[0]":"exchange","signpost[0]":"giving/receiving","definition[0]":"the act of giving someone something and receiving something else from them","example[0]":"Four of my cassettes for your Madonna CD is a fair exchange.","example[1]":"an exchange of political prisoners","note[0]":"exchange of","example[2]":"I’ve offered to paint the kitchen in exchange for a week’s accommodation.","note[1]":"in exchange for something","signpost[1]":"argument/discussion","definition[1]":"a short conversation, usually between two people who are angry with each other","example[3]":"a quiet exchange between the judge and the clerk","example[4]":"The DJ was fired after a heated exchange  (=a very angry conversation) on air with a call-in listener.","signpost[2]":"something you buy","definition[2]":"the act of giving something you have bought back to the store where you bought it, for example because it does not work, fit etc, and taking something else instead","example[5]":"The store’s policy is not to allow returns or exchanges.","definition[3]":"a process in which you change money from one currency to another","example[6]":"Most capital cities have extensive exchange facilities.","signpost[3]":"students/teachers","definition[4]":"an arrangement in which a student, teacher etc visits another school or university to work or study","example[7]":"I’m here for one term, on an exchange with Dr. Fisher.","note[2]":"on an exchange (with somebody)","signpost[4]":"jobs/homes etc","definition[5]":"an arrangement in which you stay in someone’s home, do someone’s job etc for a short time while that person stays in your home, does your job etc","example[8]":"Kate’s in New York on an employee exchange so she can get some more training.","signpost[5]":"fight","definition[6]":"an event during a war or fight when two people, armies etc shoot or fire missiles at each other","note[3]":"exchange of fire/gunfire","heading[0]":"– Meaning 2: a short conversation, usually between two people who are angry with each other","collocation[0]":"a brief exchange","example[9]":"There followed a brief exchange between Mitti and Helga in German.","collocation[1]":"an angry exchange","example[10]":"His angry exchange with the referee earned him a yellow card.","collocation[2]":"a heated exchange","example[11]":"I overheard a heated exchange between John and his wife.","collocation[3]":"an acrimonious exchange","example[12]":"The newspaper article led to a series of acrimonious exchanges between leading scientists.","collocation[4]":"a sharp exchange","example[13]":"The proposed bill provoked some sharp exchanges in the House of Commons.","collocation[5]":"a bitter exchange","example[14]":"There were bitter exchanges between them outside the court room.","collocation[6]":"a verbal exchange","example[15]":"The two boxers recently became involved in a heated verbal exchange.","heading[1]":"– Meaning 5: a process in which you change money from one currency to another","form[0]":"ADJECTIVES/NOUN + exchange","collocation[7]":"currency exchange","example[16]":"We have seen wide fluctuations in rates of currency exchange this year.","collocation[8]":"foreign exchange","example[17]":"Timber is a vital source of foreign exchange earnings for the country.","form[1]":"exchange + NOUN","collocation[9]":"the exchange rate","example[18]":"What's the current exchange rate between the dollar and the euro?","collocation[10]":"an exchange market","example[19]":"The pound rose against the dollar on the world foreign currency exchange markets.","collocation[11]":"exchange controls","example[20]":"The government is going to impose stricter exchange controls.","heading[2]":"– Meaning 6: an arrangement in which a student, teacher etc visits another school or university to work or study","collocation[12]":"a student exchange","example[21]":"Our college arranged student exchanges with four colleges in France.","collocation[13]":"a staff exchange","example[22]":"The staff exchange programme allows the company to share personnel with partner institutions abroad.","collocation[14]":"a cultural/scientific/academic exchange","example[23]":"The mayors of Tokyo and New York signed an agreement to encourage cultural exchanges between the cities.","definition[7]":"to give someone something and receive the same kind of thing from them at the same time","example[24]":"We exchange gifts at Christmas.","example[25]":"At the end of the game, players traditionally exchange shirts with each other.","example[26]":"We exchanged phone numbers.","definition[8]":"to give someone something and receive something different from them","example[27]":"Where can I exchange my dollars for pounds?","note[4]":"exchange something for something","definition[9]":"to replace one thing with another","synonym[0]":"swap","example[28]":"He exchanged the black jacket for a blue one.","definition[10]":"to give something to someone, and receive a similar thing from them at the same time. Exchange is often used about people telling each other about their ideas, phone numbers, addresses etc","example[29]":"They exchanged photographs before they met.","example[30]":"a place where people can exchange ideas","example[31]":"We exchanged email addresses.","example[32]":"if you are unhappy with the jacket, you can always take it back and exchange it for another one.","example[33]":"These coupons can be exchanged for meals and accommodation.","definition[11]":"to exchange something, especially money. Also used in British English about exchanging something you have bought for something different","example[34]":"I need to change some dollars.","example[35]":"She changed all her money into euros.","example[36]":"We thought it was time we changed our car for something more modern.","definition[12]":"to give something to someone, who gives you something similar","example[37]":"The two schools use the Internet to swap pictures, stories, and jokes.","example[38]":"I like your room better – do you want to do a swap?","display[0]":"trade","definition[13]":"to exchange something that you have for something that someone else has","example[39]":"The stolen phones are being traded for drugs.","example[40]":"The boys trade sports cards on the playground.","example[41]":"We've got lots of plants we don't need – do you want to do a trade?","display[1]":"switch","definition[14]":"to change the places of two or more people or things, so that each one is in the place the other was before","example[42]":"Can I switch seats with you?","display[2]":"reciprocate","definition[15]":"to do or give something, because someone has done or given something similar to you – a rather formal use","example[43]":"They invited us to dinner a while ago, and I'd like to reciprocate.","display[3]":"in exchange/return (for something)","definition[16]":"if you give something in exchange or in return for something else, you give it in order to get something else back","example[44]":"Williams will plead guilty in exchange for a reduced sentence.","definition[17]":"a market where goods, services, or shares are bought and sold, in return for money","example[45]":"the London International Financial Futures Exchange","example[46]":"the London Metal Exchange","definition[18]":"a large building in a town, that was used in the past for buying and selling corn, wool etc","example[47]":"an historic old corn exchange","definition[19]":"the activity of buying and selling currencies","synonym[1]":"FOREX","example[48]":"We have recently seen the removal of exchange controls (=limits on the amount of currency you are allowed to exchange).","example[49]":"huge foreign exchange deals","example[50]":"They also made healthy profits in their foreign exchange operations.","definition[20]":"money in the currency of a foreign country, for example money obtained through exports","example[51]":"When oil prices were depressed, Mexico made a great effort to promote manufactured exports as an alternative source of foreign exchange.","example[52]":"The Suez Canal is one of Egypt’s main foreign exchange earners.","definition[21]":"when you accept one thing in return for another","example[53]":"the exchange of goods and services","example[54]":"Tickets cannot be accepted back for exchange or re-sale.","definition[22]":"an arrangement in which two people from different countries, areas etc do each other’s jobs for a period of time","example[55]":"He was on a six-month exchange at the factory where her father was works manager.","definition[23]":"to give someone something and receive something in return","example[56]":"The new system allows marketing data as well as orders and invoices to be exchanged.","example[57]":"Around £2 billion is exchanged for chips in casinos every year.","definition[24]":"if a shop or company exchanges something you have bought, they take it back and give you a new one, for example because the thing you first bought has a fault","example[58]":"The store will not exchange goods without a receipt.","definition[25]":"if you exchange money, you get money in one currency for money in another","definition[26]":"to complete the final stage of buying a house or other property by signing a contract with the person you are buying it from","example[59]":"The firm had just exchanged contracts on a nine-acre site."}