{"word[0]":"recommend","definition[0]":"to advise someone to do something, especially because you have special knowledge of a situation or subject","example[0]":"Sleeping tablets are not recommended in this case.","example[1]":"It is dangerous to exceed the recommended dose.","example[2]":"I recommend that you get some professional advice.","note[0]":"recommend (that)","example[3]":"Doctors strongly recommend that fathers should be present at their baby’s birth.","example[4]":"I would never recommend using a sunbed on a regular basis.","note[1]":"recommend doing something","example[5]":"Students are recommended to make an appointment with a counselor.","note[2]":"recommend somebody to do something","definition[1]":"to say that something or someone is good, or suggest them for a particular purpose or job","example[6]":"I recommend the butter chicken – it’s delicious.","example[7]":"Can you recommend a good lawyer?","example[8]":"The hotel is highly recommended.","note[3]":"highly/thoroughly recommend","example[9]":"I recommend this book to anyone with an interest in chemistry.","note[4]":"recommend something to somebody","example[10]":"Which type of oil do you recommend for my car?","note[5]":"recommend something for something/somebody","example[11]":"I have decided to recommend you for the directorship.","note[6]":"recommend somebody for something","heading[0]":"– Meaning 2: to say that something or someone is good, or suggest them for a particular purpose or job","collocation[0]":"highly recommend","example[12]":"This book is highly recommended by those who have used it.","collocation[1]":"heartily recommend","example[13]":"I heartily recommend the cheese sandwiches.","collocation[2]":"thoroughly recommend","example[14]":"Overall I can thoroughly recommend this film to anyone with an interest in space travel.","collocation[3]":"definitely/certainly recommend","example[15]":"We would definitely recommend these books to students in fourth to sixth grade.","collocation[4]":"personally recommend","example[16]":"Are there any hair colouring products you can personally recommend?","explanation[0]":"In everyday English, you recommend that someone does something  ‘That’ can be omitted","example[17]":"I recommend that she speaks to a lawyer","example[18]":"I recommend she speaks to a lawyer","explanation[1]":"In more formal English, you recommend that someone do something, using the base form of the verb  (=the infinitive without ‘to’)","example[19]":"I recommend that she speak to a lawyer","bad_example[0]":"I recommend her to speak to a lawyer","explanation[2]":"In more formal English, you also use the base form of the verb when talking about the past","example[20]":"I recommended that she speak to a lawyer","explanation[3]":"You recommend that someone should do something","example[21]":"I recommended that they should get insurance","explanation[4]":"it is recommended that someone (should) do something","example[22]":"It is recommended that everyone (should) take the test","explanation[5]":"You recommend something to someone","example[23]":"I recommended a book to her","bad_example[1]":"I recommended her a book","definition[2]":"to advise someone to do something, especially when you have special knowledge of a situation or subject","example[24]":"I would strongly recommend buying a good quality bicycle rather than a cheap one.","example[25]":"The report recommended stricter supervision of the trade in live animals.","definition[3]":"to tell  someone that you think they should do something, especially in order to avoid problems","example[26]":"We’ve been told that we should start revising early.","example[27]":"I told you not to drink the water here.","display[0]":"urge","definition[4]":"to strongly advise someone to do something because you think it is very important","example[28]":"Her doctor has urged her to see a specialist.","example[29]":"Police are urging drivers not to come into London this weekend.","display[1]":"advocate","definition[5]":"to say publicly that something should be done, often something that a lot of people disagree about","example[30]":"In 1984, he advocated the use of force against Nicaragua.","example[31]":"I am surprised that dentists don’t advocate the use of fluoride tablets.","display[2]":"endorse","definition[6]":"to say in an advertisement that you like a product and think that people should use it","example[32]":"A lot of companies use sports stars to endorse their products.","example[33]":"Most brokers are recommending that investors take some cash out of money funds.","definition[7]":"to say that something or someone would be a good thing or person to choose","example[34]":"I would recommend Mr Bryant for the position of Assistant Manager."}