{"word[0]":"honour","signpost[0]":"something that makes you proud","definition[0]":"something that makes you feel very proud","example[0]":"Over 100 players competed for the honour of representing the county in the National Finals.","example[1]":"It is an honor to have you here, sir.","note[0]":"it is an honour to do something","signpost[1]":"respect","definition[1]":"the respect that you, your family, your country etc receive from other people, which makes you feel proud","example[2]":"For the French team, winning tomorrow’s game is a matter of national honour.","note[1]":"national/family/personal etc honour","example[3]":"He was prepared even to die in order to defend the honour of his family.","note[2]":"honour of","signpost[2]":"given to somebody","definition[2]":"something such as a special title or medal given to someone to show how much people respect them for what they have achieved","example[4]":"Reverend Peters was nominated for the honour by colleagues at Walworth Methodist Church.","example[5]":"The medal is the highest honour the association can bestow  (=give).","note[3]":"highest honour","signpost[3]":"moral principles","definition[3]":"strong moral beliefs and standards of behaviour that make people respect and trust you","example[6]":"My father was a man of honour and great integrity.","example[7]":"Her actions were always guided by a deep sense of honour  (=strong desire to do what is morally right).","example[8]":"It had become a point of honour not to tell him about Lori.","note[4]":"matter/point/question of honour","signpost[4]":"at university/school","definition[4]":"if you pass a university degree with honours, you pass it at a level that is higher than the most basic level","definition[5]":"if you finish high school or college with honors, you get one of the highest grades","definition[6]":"the highest or second highest level of degree at a British university","definition[7]":"if a woman loses her honour, she has sex with a man she is not married to","heading[0]":"– Meaning 1: something that makes you feel very proud","collocation[0]":"a great honour","example[9]":"It was a great honour to meet my hero in person.","collocation[1]":"a rare honour","example[10]":"Being asked to paint a portrait for the queen is a rare honour for any artist.","collocation[2]":"a dubious honour","example[11]":"The city has the dubious honor of being the smoggiest city in the world.","collocation[3]":"a signal honour","example[12]":"He received the signal honour of becoming an Honorary Fellow of the college.","collocation[4]":"have the honour","example[13]":"As a young man, he had the honour of meeting Winston Churchill.","collocation[5]":"do somebody the honour","example[14]":"Will you do me the honour of becoming my wife?","heading[1]":"– Meaning 2: the respect that you, your family, your country etc receive from other people, which makes you feel proud","collocation[6]":"bring honour to somebody/something","example[15]":"The bravery of these men has brought honour to their regiment.","collocation[7]":"defend somebody's/something's honour","example[16]":"To defend his honour and his business interests, he was prepared to go to court.","collocation[8]":"save the honour of somebody/something","example[17]":"Her father fought with him to save her honour.","collocation[9]":"uphold the honour of somebody/something","example[18]":"She felt duty bound to uphold the honour of her country.","collocation[10]":"restore the honour of somebody/something","example[19]":"He would be forced to restore the honour of his family name.","form[0]":"ADJECTIVES/NOUN + honour","collocation[11]":"national honour","example[20]":"For him this is a matter of both personal and national honour.","collocation[12]":"family honour","example[21]":"Refusal of a marriage offer is seen as an attack on the family honour.","collocation[13]":"somebody's/something's honour is at stake","example[22]":"French people believed that the country's honour was at stake over the incident.","heading[2]":"– Meaning 5: strong moral beliefs and standards of behaviour that make people respect and trust you","collocation[14]":"a man of honour","example[23]":"I know Tom to be a man of honour and integrity.","collocation[15]":"a matter/point/question of honour","example[24]":"To my mum, paying bills on time is a point of honour.","collocation[16]":"a code of honour","example[25]":"We abide by a strict military code of honor.","collocation[17]":"a sense of honour","example[26]":"Is he marrying her out of some misplaced sense of honour?","collocation[18]":"somebody's word of honour","example[27]":"I give you my word of honour that you will not be harmed.","collocation[19]":"be/feel honour bound to do something","example[28]":"My father felt honour bound to help his sister.","definition[8]":"to show publicly that someone is respected and admired, especially by praising them or giving them a special title","example[29]":"He was honored with an award for excellence in teaching.","note[5]":"honour somebody with something","example[30]":"Two firefighters have been honoured for their courage.","note[6]":"honour somebody for something","definition[9]":"to treat someone with special respect","example[31]":"In a marriage, you need to honour one another.","example[32]":"I was treated like an honored guest.","definition[10]":"if a bank, store etc honours a cheque, ticket etc, it allows it to be used","example[33]":"Any cheque you write up to £50 will be honoured.","example[34]":"Carriers must honor tickets issued by airlines that go bankrupt.","definition[11]":"to do what you have agreed or promised to do","example[35]":"This company always honours its contracts.","definition[12]":"to pay money that you owe","example[36]":"Burundi was unable to honor its foreign debt commitments.","definition[13]":"the respect that people have for a person, organization etc","example[37]":"The incident damaged the company’s honour and credibility.","definition[14]":"a level of university degree that is higher than the most basic level","example[38]":"You will need a good 2.1 honours degree.","example[39]":"He passed his degreewith honours.","definition[15]":"used when speaking to a judge","example[40]":"I apologize, Your Honour."}