{"word[0]":"faithful","definition[0]":"remaining loyal to a particular person, belief, political party etc and continuing to support them","example[0]":"a faithful friend","example[1]":"years of faithful service to the company","example[2]":"our faithful family dog, Bogey","example[3]":"a faithful member of the church","example[4]":"He remained faithful to his principles to the last.","note[0]":"faithful to","definition[1]":"representing an event or an image in a way that is exactly true or that looks exactly the same","synonym[0]":"exact","example[5]":"a faithful account of what had happened","example[6]":"a faithful reproduction of the original picture","definition[2]":"if you are faithful to your wife, boyfriend etc, you do not have a sexual relationship with anyone else","example[7]":"Do you think Bob’s always been faithful to you?","definition[3]":"able to be trusted or depended on","example[8]":"my faithful old Toyota","definition[4]":"continuing to support a person, party, belief etc for a long time","example[9]":"his long and faithful service to the party","example[10]":"his faithful servant","example[11]":"He remained faithful to his fatherland right to the end.","example[12]":"She was one of the party’s most faithful and hard-working members.","display[0]":"loyal","definition[5]":"supporting a particular person, party, set of beliefs, etc – used especially about someone you can can trust and depend on to support you","example[13]":"a loyal friend","example[14]":"loyal party members","example[15]":"The women have remained loyal to the goals of the Communist Party.","example[16]":"I am not blindly loyal. If I see something that I think is a mistake which could be handled better, I will say so.","display[1]":"devoted","definition[6]":"strongly supporting someone or something because you admire them, love them, or enjoy what they do","example[17]":"the author’s devoted fans","example[18]":"her devoted husband","display[2]":"staunch","definition[7]":"a staunch supporter, defender, or ally is very loyal, in spite of problems or difficulties","example[19]":"He is a staunch supporter of the president.","example[20]":"a staunch defender of civil liberties","example[21]":"the US’s staunchest ally","display[3]":"steadfast","definition[8]":"a steadfast friend or supporter is very loyal. Also used about someone’s support or service","example[22]":"Lewis was a generous and steadfast friend.","example[23]":"the steadfast support of America's allies","example[24]":"The Queen has set a shining example of steadfast service to her country.","display[4]":"true","definition[9]":"faithful and loyal to someone, or to your beliefs, principles etc, even if there are problems","example[25]":"In times like these you find out who your true friends are.","example[26]":"He remained true to his socialist principles.","example[27]":"She promised that she would always be true to him.","display[5]":"patriotic","definition[10]":"feeling a lot of love and respect for your country","example[28]":"Americans are very patriotic.","example[29]":"His speech was full of patriotic rhetoric.","definition[11]":"a loyal follower, supporter, or member","example[30]":"A handful of old faithfuls came to the meeting."}