{"word[0]":"take up","definition[0]":"to become interested in a new activity and to spend time doing it","example[0]":"Roger took painting up for a while, but soon lost interest.","definition[1]":"to start a new job or have a new responsibility","example[1]":"Peter will take up the management of the finance department.","example[2]":"The headteacher takes up her duties in August.","note[0]":"take up a post/a position/duties etc","definition[2]":"if you take up a suggestion, problem, complaint etc, you start to do something about it","example[3]":"Now the papers have taken up the story.","example[4]":"The hospital manager has promised to take the matter up with the member of staff involved.","note[1]":"take something ↔ up with","example[5]":"I am still very angry and will be taking it up with the authorities.","definition[3]":"to fill a particular amount of time or space","example[6]":"old books that were taking up space in the office","note[2]":"take up space/room","example[7]":"The little time I had outside of school was taken up with work.","note[3]":"be taken up with something","definition[4]":"to accept a suggestion, offer, or idea","example[8]":"Rob took up the invitation to visit.","example[9]":"Rick took up the challenge and cycled the 250-mile route alone.","note[4]":"take up the challenge/gauntlet","definition[5]":"to move to the exact place where you should be, so that you are ready to do something","example[10]":"The runners are taking up their positions on the starting line.","definition[6]":"to make a piece of clothing shorter","opposite[0]":"let down","definition[7]":"to continue a story or activity that you or someone else had begun, after a short break","example[11]":"I’ll take up the story where you left off.","definition[8]":"the rate at which people accept something that is offered to them","example[12]":"Take-up for college places has been slow.","example[13]":"He is leaving to take up a position in the private sector.","definition[9]":"to do something about an idea or suggestion that you have been considering","example[14]":"I’m going to take this matter up with my lawyer.","definition[10]":"to use a particular amount of space or time","example[15]":"Computer equipment takes up about a quarter of the office space.","example[16]":"This problem is taking up too much of my time.","definition[11]":"the rate at which people buy or accept something offered by a company, government etc","example[17]":"The bank has not announced targets but it will need high take-up rates to justify its investment."}