{"definition[0]":"usual, typical, or expected","example[0]":"A normal working week is 40 hours.","example[1]":"She was assessed in the normal way, and placed on the waiting list.","example[2]":"All I want is to lead a normal life.","example[3]":"Her room was untidy, but that was quite normal.","note[0]":"quite/perfectly etc normal","example[4]":"It’s normal to feel nervous before an exam.","note[1]":"it is normal (for somebody) to do something","definition[1]":"someone who is normal is mentally and physically healthy and does not behave strangely","opposite[0]":"abnormal","example[5]":"He seems a perfectly normal little boy.","example[6]":"They can’t be normal to do something like that.","collocation[0]":"completely normal","example[7]":"The test results came back, and everything was completely normal.","collocation[1]":"perfectly normal","example[8]":"Her reaction to the news was perfectly normal.","collocation[2]":"quite normal","example[9]":"He sounded quite normal when he phoned.","collocation[3]":"fairly/pretty normal","example[10]":"His family all seem pretty normal.","collocation[4]":"a normal life","example[11]":"All I want is to lead a happy, normal life.","collocation[5]":"as normal","example[12]":"John and Liz were late as normal.","collocation[6]":"in/under normal circumstances","example[13]":"Under normal circumstances, you would have to pay to go into the exhibition.","collocation[7]":"in the normal way","example[14]":"The results will be posted to you in the normal way.","definition[2]":"usual, typical, and as you would expect it to be","example[15]":"Is this cold weather normal for the time of year?","example[16]":"It had been another normal working day in the office.","definition[3]":"not special, unusual, or different from normal","example[17]":"They lived in an ordinary three-bedroomed house.","example[18]":"It looks like an ordinary car, but it uses solar power.","example[19]":"Would you like a regular salad or a Caesar salad?","example[20]":"I just want an ordinary bicycle, not a mountain bike.","definition[4]":"around the usual level or amount","example[21]":"She is of average height.","example[22]":"He is of above average intelligence.","example[23]":"The average price of a pint of milk has gone up.","display[0]":"standard","definition[5]":"normal – used about methods of doing something, or about the size, shape, features etc of products","example[24]":"It’s standard practice to X-ray hand-baggage at most airports.","example[25]":"We stock shoes in all the standard sizes.","display[1]":"routine","definition[6]":"used about things that are done regularly as part of a series of things","example[26]":"The fault was discovered during a routine check of the plane.","example[27]":"routine tasks such as shopping and cooking","display[2]":"everyday","definition[7]":"used about things that happen or that you use as part of normal life","example[28]":"He painted scenes of everyday life in France.","example[29]":"Sally was still dressed in her everyday clothes.","display[3]":"common","definition[8]":"used about birds and plants that are of the most usual type, and in the phrase the common people (=people who are not rich and powerful)","example[30]":"the common goldfish","example[31]":"an alliance between the aristocracy and the common people","display[4]":"conventional","definition[9]":"of the kind that is usually used – used when comparing this with a different or special type","example[32]":"The engine is more efficient than a conventional diesel engine.","example[33]":"the drugs used in conventional medicine","example[34]":"conventional weapons (=not nuclear, chemical, or biological)","example[35]":"conventional ovens and microwaves","definition[10]":"the usual state, level, or amount","example[36]":"Thankfully, train services are now back to normal.","example[37]":"Slowly her heartbeat returned to normal.","example[38]":"Car sales are still below normal for the time of year.","note[2]":"above/below normal","example[39]":"The journey took longer than normal.","note[3]":"higher/larger/less etc than normal"}