{"word[0]":"rush","signpost[0]":"move quickly","definition[0]":"to move very quickly, especially because you need to be somewhere very soon","synonym[0]":"hurry","example[0]":"A small girl rushed past her.","example[1]":"Mo rushed off down the corridor.","signpost[1]":"do something too quickly","definition[1]":"to do or decide something too quickly, especially so that you do not have time to do it carefully or well","example[2]":"He does not intend to rush his decision.","example[3]":"When we first met, neither of us wanted to rush things.","note[0]":"rush it/things","example[4]":"I’m not rushing into marriage again.","note[1]":"rush into","example[5]":"She rushed through her script.","note[2]":"rush through","signpost[2]":"take/send urgently","definition[2]":"to take or send someone or something somewhere very quickly, especially because of an unexpected problem","example[6]":"Dan was rushed to hospital with serious head injuries.","example[7]":"The Red Cross rushed medical supplies to the war zone.","note[3]":"rush somebody/something to something","signpost[3]":"make somebody hurry","definition[3]":"to try to make someone do something more quickly than they want to","example[8]":"I’m sorry to rush you, but we need a decision by Friday.","example[9]":"They felt they were being rushed into choosing a new leader.","note[4]":"rush somebody into (doing) something","definition[4]":"if water or another liquid rushes somewhere, it moves quickly","example[10]":"Water rushed through the gorge.","definition[5]":"to attack a person or place suddenly and in a group","example[11]":"They rushed the guard and stole his keys.","signpost[4]":"American universities","definition[6]":"to give parties for students, have meetings etc, in order to decide whether to let them join your fraternity or sorority (=type of club)","definition[7]":"to go through the process of trying to be accepted into one of these clubs","signpost[5]":"American football","definition[8]":"to carry the ball forward","definition[9]":"to move very quickly, especially because you need to be somewhere soon","example[12]":"He was rushing out of his office in order to go to a meeting.","example[13]":"There’s no need to rush - we have plenty of time.","definition[10]":"to do something or go somewhere more quickly than usual, especially because there is not much time","example[14]":"People hurried into stores to escape the rain.","example[15]":"You ll have to hurry or we 'll be late for breakfast","example[16]":"I hurried through the rest of my workout and showered as quickly as I could.","display[0]":"race","definition[11]":"to go somewhere as fast as you can","example[17]":"She raced downstairs to tell her mother.","example[18]":"He raced back to his car and called for help.","display[1]":"tear","definition[12]":"to run very quickly and without really looking where you are going, because you are in a hurry","example[19]":"I saw two boys tearing across the field towards the tree.","example[20]":"He tore down the stairs and out of the house.","example[21]":"They tore out of the building.","display[2]":"dash","definition[13]":"to run somewhere very fast, especially only a short distance","example[22]":"Bob dashed across the road to his friend’s house.","example[23]":"Her heart was pumping furiously as she dashed through the kitchen to the front door.","example[24]":"I dashed outside to try to rescue the unfortunate creature.","display[3]":"hustle","definition[14]":"to hurry when you are doing something or going somewhere","example[25]":"You better hustle or you’re going to miss the school bus.","display[4]":"hasten","definition[15]":"to hurry somewhere, especially because you need to do something","example[26]":"Suddenly frightened, she hastened back to where her friends were standing.","example[27]":"She took a deep breath and then hastened after him.","signpost[6]":"fast movement","definition[16]":"a sudden fast movement of things or people","example[28]":"At five past twelve there was a mad rush to the dinner hall.","example[29]":"She felt a cold rush of air as she wound down her window.","note[5]":"rush of air/wind/water","example[30]":"Her words came out in a rush.","note[6]":"in a rush","definition[17]":"a situation in which you need to hurry","example[31]":"I knew there would be a last-minute rush to meet the deadline.","example[32]":"Don’t worry, there’s no rush. We don’t have to be at the station until 10.","example[33]":"I had to do my homework in a rush because I was late.","note[7]":"do something in a rush","example[34]":"I’m sorry, I can’t talk now – I’m in a rush.","note[8]":"be in a rush","signpost[7]":"people wanting something","definition[18]":"a situation in which a lot of people suddenly try to do or get something","example[35]":"There’s always a rush on swimsuits in the hot weather.","note[9]":"rush on","example[36]":"the rush to put computers in all schools","note[10]":"rush to do something","definition[19]":"a sudden strong, usually pleasant feeling that you get from taking a drug or from doing something exciting","example[37]":"The feeling of power gave me such a rush.","example[38]":"an adrenalin rush","definition[20]":"a sudden very strong feeling of anger etc","example[39]":"I felt a rush of excitement when she arrived.","example[40]":"A rush of jealousy swept through her.","definition[21]":"a type of tall grass that grows in water, often used for making baskets","signpost[8]":"american students","definition[22]":"the time when students in American universities who want to join a fraternity or sorority (=type of club) go to a lot of parties in order to try to be accepted","example[41]":"rush week","definition[23]":"to move or go somewhere very quickly and in large amounts","example[42]":"Foreign capital is rushing into Asia at an incredible rate.","definition[24]":"to do something too quickly, especially so that you do not have time to do it carefully or well","example[43]":"There’s plenty of time — we don’t need to rush.","example[44]":"The company chose not to rush development of the new engine.","definition[25]":"to do something eagerly and without delay","example[45]":"Investors are rushing to buy bonds.","definition[26]":"to take or send something somewhere very quickly, especially because of an unexpected problem","example[46]":"We had to rush the backup disk to the office.","example[47]":"Volkswagen rushed in its bid early.","example[48]":"Don’t let them rush you into signing the contract.","note[11]":"rush somebody into doing something","example[49]":"We don’t see any rush or urgency to buy right now.","example[50]":"They are in no rush to make a deal.","definition[27]":"when a lot of people suddenly try to do or get something","example[51]":"We’re going to see a big rush for Western goods.","note[12]":"rush for","example[52]":"a rush on swimsuits in the hot weather","example[53]":"The rush to buy shares did not last long.","definition[28]":"the time in the day, month, year etc when a place or group of people are particularly busy","example[54]":"The cafe is quiet until the lunchtime rush.","example[55]":"the Christmas rush"}