{"word[0]":"occupy","signpost[0]":"stay in a place","definition[0]":"to live or stay in a place","example[0]":"He occupies the house without paying any rent.","example[1]":"The building was purchased and occupied by its new owners last year.","signpost[1]":"fill time","definition[1]":"if something occupies you or your time, you are busy doing it","example[2]":"Football occupies most of my leisure time.","example[3]":"Only six percent of police time is occupied with criminal incidents.","note[0]":"occupy somebody with (doing) something","signpost[2]":"fill space","definition[2]":"to fill a particular amount of space","synonym[0]":"take up","example[4]":"Family photos occupied almost the entire wall.","explanation[0]":"In everyday English, people usually say that something takes up time or space rather than occupies it:","example[5]":"Work takes up most of her time.","example[6]":"That bed takes up almost the whole room.","signpost[3]":"control by force","definition[3]":"to enter a place in a large group and keep control of it, especially by military force","example[7]":"an occupying army","example[8]":"Students occupied Sofia University on Monday.","signpost[4]":"use","definition[4]":"to use something such as a room, seat, or bed","example[9]":"Many patients who are occupying hospital beds could be transferred to other places.","signpost[5]":"official position","definition[5]":"to have an official position or job","example[10]":"Before becoming prime minister, he had already occupied several cabinet posts.","past_tense[0]":"occupied","definition[6]":"to use a particular building to live or work in","example[11]":"a large computer company that occupies a building of some 60,000 sq ft","example[12]":"He occupies an important position in government.","definition[7]":"if something is occupying you, you are busy doing it","example[13]":"As PA to the chief executive, there is plenty to keep you occupied.","example[14]":"Mr Ball is occupied with a customer at the moment.","definition[8]":"to use a particular amount of space or time","example[15]":"Computer files occupy much less storage space than paper ones.","example[16]":"Running the business occupies nearly all of her time."}