{"word[0]":"economy","plural[0]":"economies","definition[0]":"the system by which a country’s money and goods are produced and used, or a country considered in this way","example[0]":"a successful economy","example[1]":"the slowdown in the Japanese economy","explanation[0]":"You say the economy when talking about the economic system in a particular country","example[2]":"Tourism is an important part of the economy","bad_example[0]":"Tourism is an important part of economy","definition[1]":"something that you do in order to spend less money","example[3]":"The council must make economies to meet government spending targets.","example[4]":"Not insuring your belongings is a false economy (=it is cheaper but could have bad results).","definition[2]":"the careful use of money, time, goods etc so that nothing is wasted","example[5]":"The gas fire was turned low for reasons of economy.","example[6]":"The company announced that it would cut 500 jobs as part of an economy drive (=a way to save money).","form[0]":"ADJECTIVES/NOUN + economy","collocation[0]":"strong/healthy/sound","example[7]":"The new government inherited a strong economy.","collocation[1]":"weak/ailing/depressed","example[8]":"The economy is weak and consumer confidence is low.","collocation[2]":"fragile","example[9]":"The country’s fragile economy depends almost exclusively on tourism.","collocation[3]":"stable","example[10]":"The economy has been relatively stable for the last two or three years.","collocation[4]":"stagnant","example[11]":"Measures aimed at reviving the stagnant economy are not working.","collocation[5]":"a flagging economy","example[12]":"The government must take action to boost the flagging economy.","collocation[6]":"a booming economy","example[13]":"What can we learn from China’s booming economy?","collocation[7]":"the world/global economy","example[14]":"Rising oil prices threaten the world economy.","collocation[8]":"the local/national/domestic economy","example[15]":"The new factory has given a massive boost to the local economy.","collocation[9]":"the British/American/Japanese etc economy","example[16]":"The Japanese economy is showing signs of recovery.","collocation[10]":"a large/powerful economy","example[17]":"the world’s two most powerful economies","collocation[11]":"a small economy","example[18]":"Small economies like Kenya might struggle to survive in a global recession.","collocation[12]":"a developing economy","example[19]":"Many developing economies are investing in sources of renewable energy.","collocation[13]":"an industrial economy","example[20]":"Expectations for growth in the main industrial economies remain low.","collocation[14]":"an agricultural/a rural economy","example[21]":"The early 1920s saw a rapid expansion in the American agricultural economy.","collocation[15]":"a service economy","example[22]":"Britain has shifted from a manufacturing to a service economy.","collocation[16]":"a market/free-market economy","example[23]":"Eastern European countries were gradually making the transition to a market economy.","collocation[17]":"a capitalist/socialist economy","example[24]":"the large capitalist economies of western Europe","collocation[18]":"the black economy","example[25]":"Illegal immigrants have to seek work in the black economy.","collocation[19]":"manage/handle the economy","example[26]":"Governments are judged on how well they manage the economy.","collocation[20]":"develop/expand the economy","example[27]":"The tax cut should help to expand the economy.","collocation[21]":"boost the economy","example[28]":"It is hoped that the Olympic Games will boost the country’s economy.","collocation[22]":"harm/damage the economy","example[29]":"Sanctions have damaged the economy.","collocation[23]":"destroy the economy","example[30]":"The floods last year destroyed the region’s economy.","collocation[24]":"the economy develops/expands/grows","example[31]":"The economy grew by 3% last year.","collocation[25]":"the economy booms","example[32]":"The economy is booming and share prices are at an all-time high.","collocation[26]":"the economy slows down","example[33]":"The US economy is slowing down after a long period of growth.","collocation[27]":"the economy recovers","example[34]":"The economy is beginning to recover from the recession.","heading[0]":"USAGE: Economy, economics","explanation[1]":"Don't confuse economy  (=a country's economic system) and economics  (=the study of how money is produced and used) You say","example[35]":"He is studying economics","bad_example[1]":"He is studying economy","definition[3]":"the system by which a country’s goods and services are produced and used, or a country considered in this way","example[36]":"the transformation from a centrally planned socialist economy to a market-led one","example[37]":"He expects Europe’s economies over the long run to grow faster than the US’s.","definition[4]":"the careful use of money, goods, time etc so that nothing is wasted","example[38]":"For reasons of economy, the heating had been turned down.","example[39]":"The post office was closed as part of an economy drive (=a planned effort to cut costs).","definition[5]":"a way of spending less money","example[40]":"Following the merger, the group should make economies of about FFr200 million next year.","example[41]":"As an economy measure,  the company started to cut back on training.","definition[6]":"something that seems to be a way of spending less money, but actually costs you more money in the end","example[42]":"Buying cheaper, poorer quality materials is often a false economy.","definition[7]":"an economy fare, hotel etc is cheaper than other things of the same type","example[43]":"You can choose from a range of economy and medium-priced hotels.","definition[8]":"an economy-size product or packet contains more than a normal one and is cheap compared to the normal size product","example[44]":"a large economy-size packet of detergent"}