{"word[0]":"accusation","definition[0]":"a statement saying that someone is guilty of a crime or of doing something wrong","example[0]":"The main accusation levelled against him was that he tried to avoid military service.","example[1]":"Burton’s enemies had made false accusations against him.","example[2]":"She’s made all sorts of wild accusations against me in the past.","example[3]":"They fled the country, amid accusations of corruption.","example[4]":"A number of serious accusations have been made against her.","note[0]":"accusation against","example[5]":"His administration now faces accusations of corruption.","note[1]":"accusation of","example[6]":"The organizers of the march strongly denied government accusations that they intended to cause trouble.","note[2]":"accusation that","collocation[0]":"make an accusation","example[7]":"You’ve made a lot of accusations but you haven’t got any evidence.","collocation[1]":"bring an accusation against somebody","example[8]":"The accusations against him were brought by two 18-year-old women.","collocation[2]":"level an accusation against/at somebody","example[9]":"As a result, some outrageous accusations were levelled at her.","collocation[3]":"face an accusation","example[10]":"The police faced accusations of using excessive force.","collocation[4]":"deny/dismiss an accusation","example[11]":"The government denied accusations of corruption.","collocation[5]":"prove/support an accusation","example[12]":"There were very few facts to support the accusation against him.","example[13]":"These are very serious accusations indeed.","example[14]":"There were a lot of false accusations throughout the trial.","collocation[6]":"unfounded/groundless","example[15]":"The accusation is totally unfounded.","example[16]":"The embassy denied what it called groundless accusations about its involvement in the attack.","collocation[7]":"outrageous","example[17]":"He was drunk and his accusations were becoming more and more outrageous.","collocation[8]":"a wild accusation","example[18]":"She’s made all sorts of wild accusations about him, hasn’t she?","collocation[9]":"bitter accusations","example[19]":"The dispute was marked by bitter accusations from both sides.","collocation[10]":"repeated accusations","example[20]":"Repeated accusations of neglect were made against the authorities.","collocation[11]":"renewed accusations","example[21]":"The government faced renewed accusations of corruption.","collocation[12]":"further accusations","example[22]":"There were further accusations of incompetence.","collocation[13]":"amid accusations of something","example[23]":"He fled the country amid accusations of fraud.","definition[1]":"a statement saying that you believe someone is guilty of a crime or of doing something bad","example[24]":"The army has faced accusations of racism.","display[0]":"allegation","definition[2]":"a public statement accusing someone of doing something although it has not been proved","example[25]":"He denied allegations that he received a bribe.","example[26]":"Police are investigating allegations of corruption.","display[1]":"charge","definition[3]":"an official statement by the police accusing someone of a crime and saying that they must go to court, or a statement saying that someone has done something bad, made by anyone","example[27]":"He appeared in court on a murder charge.","example[28]":"She denied the charge that the article had been misleading.","display[2]":"indictment","definition[4]":"an official written statement accusing someone of a crime so that they will be judged under the American legal system","example[29]":"He is under indictment for credit card fraud."}