{"word[0]":"excite","definition[0]":"to make someone feel happy, interested, or eager","example[0]":"His playing is technically brilliant, but it doesn’t excite me.","definition[1]":"to cause a particular feeling or reaction","synonym[0]":"arouse","example[1]":"The court case has excited a lot of public interest.","note[0]":"excite interest/curiosity/sympathy etc","example[2]":"He tried not to do anything to excite the suspicion of the police.","example[3]":"The book excited very little comment.","note[1]":"excite comment/speculation/a reaction","definition[2]":"to make someone feel sexual desire","definition[3]":"to make an organ, nerve etc in your body react or increase its activity","heading[0]":"– Meaning 2: to cause a particular feeling or reaction","collocation[0]":"excite interest","example[4]":"She is a talented young actress who has excited a lot of interest.","collocation[1]":"excite curiosity","example[5]":"Rumours of hidden treasure excited our curiosity.","collocation[2]":"excite sympathy","example[6]":"She sought to excite the jury's sympathy at every possible opportunity.","collocation[3]":"excite anger","example[7]":"The government's proposals have excited anger among teachers.","collocation[4]":"excite hatred/hostility","example[8]":"He accused sections of the media of trying to excite racial hatred.","collocation[5]":"excite a reaction","example[9]":"The figures are unlikely to excite any reaction on the money markets.","collocation[6]":"excite comments","example[10]":"The film excited a lot of favourable comments, both here and in America.","collocation[7]":"excite rumours","example[11]":"The photographs excited rumours that their marriage is over.","collocation[8]":"excite speculation","example[12]":"The cut in US interest rates excited speculation of a similar cut in the UK.","definition[4]":"to produce a lot of activity in a market, with a lot of people buying and selling stocks and shares","example[13]":"The auditors excited the market again yesterday by reporting sharply higher profits for the group."}