{"definition[0]":"the official in control of a court, who decides how criminals should be punished","note[0]":"federal judge/high court judge etc (=a judge in a particular court)","example[0]":"The trial judge specifies the number of years to be spent in prison.","definition[1]":"someone who decides on the result of a competition","example[1]":"The panel of judges included several well-known writers.","definition[2]":"to form or give an opinion about someone or something after thinking carefully about all the information you know about them","example[2]":"You should never judge a person by their looks.","example[3]":"Judge us on the improvements we make in the economy.","example[4]":"The therapist judged that Margaret had made a serious attempt to kill herself.","example[5]":"pollutants that were judged hazardous to human health","example[6]":"I am in no position to judge whether what she is doing is right or wrong.","example[7]":"The economic results of the reforms are very difficult to judge.","example[8]":"The likelihood of future bombs was impossible to judge.","example[9]":"We judge the success of a product by the number of sales it brings in.","example[10]":"His conduct, judged objectively  by what he has done, is dishonest.","example[11]":"Robert wanted to go and help him, but judged it best to stay where he was.","example[12]":"Do not judge her too harshly, as she was very young at the time.","definition[3]":"to decide on the result of a competition","example[13]":"I had the difficult task of judging the competition.","example[14]":"Competitors will be judged on speed and accuracy.","note[1]":"judge somebody on something","definition[4]":"to form an opinion about someone, especially in an unfair or criticizing way","example[15]":"He just accepts people for what they are and he doesn’t judge them.","definition[5]":"to decide whether someone is guilty of a crime in court","collocation[0]":"be difficult/hard to judge","example[16]":"The economic results of the reforms are difficult to judge.","collocation[1]":"be impossible to judge","example[17]":"How much this affected their children was impossible to judge.","collocation[2]":"judge something objectively","example[18]":"His behaviour, judged objectively by what he has done, is dishonest.","collocation[3]":"judge somebody harshly","example[19]":"Do not judge her too harshly; she was very young at the time.","collocation[4]":"judge something correctly","example[20]":"It takes a lot of experience to judge correctly what is needed.","collocation[5]":"judge something a success/failure","example[21]":"The concert was judged a success.","collocation[6]":"judge something on its merits","example[22]":"The arguments should be judged on their merits.","collocation[7]":"judge something on the basis of something","example[23]":"It is difficult to judge progress on the basis of a single day.","collocation[8]":"judge it best/better to do something","collocation[9]":"judge it safe to do something","example[24]":"He listened for some time before judging it safe to go downstairs.","definition[6]":"to form an opinion about someone or something, using your knowledge, experience, and intelligence","example[25]":"He will judge whether the project has been a success.","example[26]":"It’s difficult to judge how long the work will take.","display[0]":"assess","definition[7]":"to judge how good, bad, successful etc someone or something is, especially by using a fixed set of standards. Assess is often used about measuring students’ abilities and performance","example[27]":"Are tests and exams the best way to assess students’ progress?","example[28]":"The insurance company will send someone to assess the damage.","display[1]":"evaluate","definition[8]":"to judge how good, bad, successful etc someone or something is, especially by carefully examining all the information about them. Evaluate is often used about the work of people doing research","example[29]":"The data from the study is still being evaluated.","example[30]":"The test is used to evaluate the effects of pesticides on domestic bees.","display[2]":"gauge","definition[9]":"to judge people’s opinions or feelings about something, or to measure the effect, importance etc of something. Gauge is often used when talking about getting a general idea of what something is like","example[31]":"A meeting was arranged in order to gauge the opinions of pupils, parents and teachers.","example[32]":"It' s too early to gauge the impact of the oil price rises on people’s spending.","example[33]":"Without further information it is impossible to gauge the full extent of the problem.","display[3]":"appraise","definition[10]":"to judge how successful, effective etc someone or something is, especially by comparing their good and bad points","example[34]":"Twice a year, managers appraise the performance of employees.","example[35]":"This research aims to appraise the effectiveness of different kinds of public sector financial assistance.","example[36]":"On what basis will a teacher be appraised?","definition[11]":"the official in control of a court who decides how criminals should be punished, or makes decisions about disagreements that the court has been asked to solve","example[37]":"The case is scheduled for trial today before Judge Robert Parker.","example[38]":"a County Court judge","definition[12]":"to form or give an opinion about how good or bad something is","example[39]":"The company will be judged on its quarterly reports.","note[2]":"judge something on something","example[40]":"Analysts’ recommendations are judged against a performance index for the industry they follow.","note[3]":"judge something against something"}