{"word[0]":"resolution","signpost[0]":"decision","definition[0]":"a formal decision or statement agreed on by a group of people, especially after a vote","example[0]":"a resolution calling for a ban on dumping nuclear waste","example[1]":"They have failed to comply with the resolution.","example[2]":"The resolution was passed by a two-thirds majority.","note[0]":"pass/adopt/approve a resolution","signpost[1]":"solution","definition[1]":"when someone solves a problem, argument, or difficult situation","example[3]":"a forum for the resolution of commercial disputes","note[1]":"resolution of","signpost[2]":"promise","definition[2]":"a promise to yourself to do something","note[2]":"New Year’s resolution (=a resolution made on January 1st)","example[4]":"Carol made a resolution to work harder at school.","note[3]":"resolution to do something","signpost[3]":"determination","definition[3]":"strong belief and determination","example[5]":"Then, with sudden resolution, she stood up.","signpost[4]":"clear picture","definition[4]":"the power of a television, camera, microscope etc to give a clear picture","note[4]":"high/low resolution (=how clear or unclear the picture is)","collocation[0]":"pass/approve a resolution","example[6]":"The Security Council passed a resolution condemning the country’s aggression.","collocation[1]":"adopt a resolution","example[7]":"The resolution was adopted by 12 votes to none.","collocation[2]":"reject a resolution","example[8]":"The National Assembly rejected the resolution.","collocation[3]":"propose/introduce/put forward a resolution","example[9]":"The resolution was proposed by the chairman of the committee.","collocation[4]":"table a resolution","example[10]":"Siddall tabled a resolution asking for the Board’s approval of the Five Year Business Plan.","collocation[5]":"vote on a resolution","example[11]":"Are there any comments you wish to make before we vote on this resolution?","collocation[6]":"a resolution calling for something","example[12]":"We support the EU resolution calling for a ban on the use of these fishing nets.","collocation[7]":"a resolution condemning something","example[13]":"The UN Security Council tabled a resolution condemning the invasion.","definition[5]":"an official decision or statement agreed on by two or more people or groups of people, often after a vote","example[14]":"ashareholder resolution calling for a review of the company’s policy","definition[6]":"when a particular dispute, legal case etc is settled","example[15]":"The company wants aspeedy resolution of the matter to limit its losses.","definition[7]":"a measurement of the number of PIXELs a computer screen can show. The measurement, called DPI, is the number of dots over an inch of the screen. Screens with high resolution (=lots of dots) are clearer than those with low resolution","example[16]":"You can use the display setting to increase the resolution of the screen."}