{"word[0]":"behind","definition[0]":"at or towards the back of a thing or person","example[0]":"I turned to speak to the person standing behind me.","example[1]":"Someone could easily creep up behind us.","example[2]":"The car behind was hooting impatiently.","example[3]":"Jane shut the door behind her.","example[4]":"The manager was sitting behind a large desk.","example[5]":"He set off down the road with the rest of us following close behind.","note[0]":"close behind/not far behind","definition[1]":"not as successful or not having made as much progress as someone or something else","example[6]":"Mark’s always behind the rest of his class in mathematics.","example[7]":"This victory lifts Ferguson’s team into fifth place, nine points behind leaders Norwich.","example[8]":"Europe was falling behind in the important field of computer technology.","definition[2]":"used to say that someone is late in doing what they have to do","example[9]":"This work should have been finished yesterday. I’m getting terribly behind.","example[10]":"Victor had fallen behind with his mortgage payments after losing his job.","example[11]":"an important research project that is already two years behind schedule (=not ready at the time planned)","definition[3]":"used for talking about the hidden reason for something","example[12]":"I wonder what’s behind this change of plan.","example[13]":"Perhaps a bitter experience lay behind her anger.","definition[4]":"supporting a person, idea etc","example[14]":"The workers are very much behind these proposals.","example[15]":"I suppose I’m lucky because my parents were behind me all the way.","definition[5]":"responsible for a plan, idea etc or for organizing something","example[16]":"It was alleged that foreign agents were behind the recent violence.","example[17]":"The Rotary Club is behind the fund-raising for the new hospital.","definition[6]":"if an unpleasant experience or situation is behind you, it no longer upsets you or affects your life","example[18]":"Now you can put all these worries behind you.","example[19]":"a chance to start a new life and leave all your troubles behind","definition[7]":"if you have experience behind you, you have gained valuable skills or important qualities that can be used","example[20]":"Marjorie is one of the top designers in the business, with years of experience behind her.","definition[8]":"used when the real facts about a situation or someone’s character are hidden by the way things seem or by the way a person behaves","example[21]":"We were determined to find the truth behind this mystery.","example[22]":"You could see the burning hatred behind Graham’s calm manner.","definition[9]":"if a student stays behind after school or after a lesson, they stay after it has finished","definition[10]":"at or towards the back of something, and often hidden by it","example[23]":"The sun went behind a cloud.","example[24]":"I got stuck behind a truck on the way to the airport.","display[0]":"at the back","definition[11]":"behind something, especially a building","example[25]":"There’s a small garden at the back of the cottage.","example[26]":"Their house has a pool in the back.","display[1]":"at/to the rear","definition[12]":"behind something, especially a building. At/to the rear sounds rather formal and is used especially in written descriptions","example[27]":"They parked in a small car park at the rear of the hotel.","example[28]":"There is a small seating area to the rear.","display[2]":"in the background","definition[13]":"if someone or something is in the background, it is behind the place where the main activity is happening","example[29]":"If you look carefully at the painting, you will see several men sitting at a table in the background.","definition[14]":"to be late making a regular payment or doing work","example[30]":"Over 4% of British borrowers are likely to be a month or more behind with their repayments.","example[31]":"You may be putting your tenancy at risk if you fall behind with the rent.","example[32]":"I can’t sleep at night because I’m worried about getting behind with my work.","definition[15]":"to support a person, an idea, or the work they are doing","example[33]":"Cabinet Ministers rallied behind the Prime Minister yesterday.","definition[16]":"not as advanced or successful as someone or something else","example[34]":"Their social and economic development is so far behind the rest of the world that they can never compete on equal terms.","definition[17]":"not arriving or happening at the right time","example[35]":"Commuters were delayed for up to 35 minutes as trains ran behind schedule.","example[36]":"Contractors who fall behind schedule will incur financial penalties."}