{"signpost[0]":"true/correct","definition[0]":"a statement or piece of information that is right is correct and based on true facts","example[0]":"Yes, that’s the right answer.","example[1]":"Is that the right time?","example[2]":"I got most of the questions right.","example[3]":"His ideas have now been proved right.","definition[1]":"if you are right, you have said something that is correct and based on true facts","example[4]":"I think you’re right. We should have set out earlier.","example[5]":"I think the prime minister is only half right.","example[6]":"Am I right in thinking that you two have met before?","example[7]":"You were right about the hotel being too crowded.","note[0]":"right about","definition[2]":"the right thing, person, method etc is the one that is most suitable or effective","example[8]":"I think you’ve made the right decision.","example[9]":"I think she’s definitely the right person for the job.","example[10]":"A huge development like this isn’t right for such a small village.","note[1]":"right for","signpost[1]":"side","definition[3]":"your right side is the side with the hand that most people write with","example[11]":"He had a knife in his right hand.","example[12]":"a scar on the right side of her face","definition[4]":"on the same side of something as your right side","example[13]":"Take the next right turn.","example[14]":"the right bank of the river","signpost[2]":"problems","definition[5]":"something that is not right is not in the state it should be in","example[15]":"The engine’s not quite right.","example[16]":"This cheese doesn’t smell right.","example[17]":"Things haven’t been right between me and James for some time.","example[18]":"It didn’t take long to find the fault and put it right.","note[2]":"put/set something right","signpost[3]":"morally","definition[6]":"if someone is right to do something, their action is morally correct or sensible","example[19]":"It’s only right (=completely right) that he should get his share of the money.","example[20]":"The company wants to do the right thing and offer compensation to all the injured workers.","example[21]":"Do you think I was right to report them to the police?","note[3]":"right to do something","example[22]":"It can’t be right to keep lying to your family.","example[23]":"I think it’s right that the people who work hardest should earn the most.","note[4]":"it is right that","signpost[4]":"emphasis","definition[7]":"used to emphasize how bad someone or something is","example[24]":"He sounds like a right idiot!","example[25]":"The house was in a right mess when we got back.","signpost[5]":"health","definition[8]":"if you are not feeling right, you are not feeling completely well","example[26]":"I haven’t been feeling right all day.","example[27]":"A few days in bed will soon put you right.","example[28]":"You’ll soon be as right as rain (=completely healthy).","signpost[6]":"socially","definition[9]":"the right people, places, schools etc are considered to be the best or most important","example[29]":"Sonia’s always careful to be seen with the right people.","collocation[0]":"quite right","example[30]":"You were quite right – we should never have gone with them.","collocation[1]":"absolutely right","example[31]":"You’re absolutely right.","collocation[2]":"exactly right","example[32]":"My figures may not be exactly right.","collocation[3]":"dead right","example[33]":"You were dead right not to trust him.","collocation[4]":"half/partly right","example[34]":"That theory may still be partly right.","collocation[5]":"get something right","example[35]":"For once, he got my name right.","collocation[6]":"be proved right","example[36]":"We warned that it would not work, and we have been proved right.","collocation[7]":"be right in saying/thinking etc","example[37]":"I think I’m right in saying they once employed 2000 people.","definition[10]":"not wrong – used about something someone says, or about the person who says it","example[38]":"the right answer","example[39]":"You were right about the colour.","example[40]":"‘He’s about thirty, isn’t he?’ ‘That’s right.’","display[0]":"correct","definition[11]":"right. Correct sounds more formal than right","example[41]":"the correct answer","example[42]":"He is absolutely correct.","example[43]":"Unfortunately, this information is not correct.","definition[12]":"right – used about information, measurements, descriptions etc","example[44]":"Make sure that your measurements are accurate.","example[45]":"an accurate description of the suspect","display[1]":"exact","definition[13]":"an exact number, amount, or time is completely correct, and is no more and no less than it should be","example[46]":"The exact time is 9.28 a.m.","example[47]":"The exact weight of the baby was 3.3 kilos.","display[2]":"spot-on","definition[14]":"exactly right – used especially about guesses or things people say","example[48]":"His answer was spot-on.","example[49]":"You’re spot-on.","definition[15]":"exactly in a particular position or place","example[50]":"I left my bags right here.","note[5]":"right here/there","example[51]":"She was standing right in the middle of the room.","note[6]":"right in/in front of/by etc something","example[52]":"There’s the house, right in front of you.","definition[16]":"immediately and without any delay","example[53]":"It’s on right after the six o'clock news.","example[54]":"I’ll phone him right away (=immediately).","example[55]":"I could tell right off that something was wrong.","example[56]":"Kay answered right off the bat.","note[7]":"right off the bat","signpost[7]":"correctly","example[57]":"We guessed right; they’d gone.","example[58]":"‘I thought you’d be cross.’ ‘You thought right!’","signpost[8]":"well","definition[17]":"in a way that is good or satisfactory","example[59]":"Everything’s going right for him at the moment.","example[60]":"It’ll work out right in the end.","signpost[9]":"direction/side","definition[18]":"towards the direction or side that is on the right","opposite[0]":"left","example[61]":"Turn right at the crossroads.","signpost[10]":"allowed","definition[19]":"something that you are morally, legally, or officially allowed to do or have","example[62]":"The new charter establishes the rights and duties of citizens.","note[8]":"right of","example[63]":"Everyone should have the right to freedom of expression.","note[9]":"right to","example[64]":"You have the right to consult a lawyer.","example[65]":"The money is yours by right.","note[10]":"by right","example[66]":"You would be within your rights to sue the company for negligence.","note[11]":"within your rights","signpost[11]":"correct behaviour","definition[20]":"behaviour that is morally good and correct","example[67]":"Some kids don’t seem to know the difference between right and wrong.","example[68]":"The protesters believe that they have right on their side.","definition[21]":"a hit made with your right hand","collocation[8]":"have a right","example[69]":"People have a right to know the truth.","collocation[9]":"violate somebody’s rights","example[70]":"Imprisoning the men without trial violated their rights.","collocation[10]":"exercise a right","example[71]":"The insurance company decided not to exercise its right of appeal.","collocation[11]":"deny somebody a right","example[72]":"Women were denied the right to vote.","collocation[12]":"demand a right","example[73]":"We demand the same rights that other European workers enjoy.","collocation[13]":"defend a right","example[74]":"We should defend our right to demonstrate.","collocation[14]":"uphold somebody’s rights","example[75]":"I will uphold the rights of the people of this country.","form[0]":"ADJECTIVES/NOUN + right","collocation[15]":"human rights","example[76]":"This company always operates with respect for human rights.","collocation[16]":"civil rights","example[77]":"As a young man, he was deeply involved in the struggle for civil rights.","example[78]":"the civil rights movement","collocation[17]":"equal rights","example[79]":"Women demanded equal rights.","collocation[18]":"a fundamental/basic right","example[80]":"The law recognises a man’s fundamental right to defend his home and his property.","collocation[19]":"a legal right","example[81]":"Banks have the legal right to recover their money.","collocation[20]":"a constitutional right","example[82]":"Teachers have a constitutional right to join a union.","collocation[21]":"political rights","example[83]":"Slaves had no political rights.","collocation[22]":"women’s rights","example[84]":"New laws have been passed to protect women’s rights.","collocation[23]":"workers’ rights","example[85]":"The company’s actions are a violation of workers’ rights.","collocation[24]":"gay/lesbian rights","example[86]":"a gay rights campaigner","collocation[25]":"animal rights","example[87]":"Animal rights campaigners say the dogs are being bred in terrible conditions.","collocation[26]":"a right of appeal","example[88]":"In these circumstances, there is no right of appeal.","collocation[27]":"the right to privacy","example[89]":"The judge decided that the media’s actions violated the couple’s right to privacy.","collocation[28]":"a right of access","example[90]":"You have rights of access to data held about you.","collocation[29]":"a right of reply","example[91]":"People should have the right of reply when a magazine has published letters criticizing them.","collocation[30]":"the right to freedom of expression","example[92]":"Everyone has the right to freedom of expression.","definition[22]":"used to show that you have understood or agree with what someone has just said","example[93]":"‘You need to be there by ten o’clock.‘ ’Right.'","definition[23]":"used to get someone’s attention before starting to say or do something","example[94]":"Right, open your books on page 16.","example[95]":"Right, is everyone listening?","example[96]":"Right, I think we’re ready to go.","definition[24]":"used to check if what you have said is correct","example[97]":"So we’re meeting in the pub, right?","definition[25]":"used to check that the person you are speaking to is listening and understands what you are saying","example[98]":"So I handed him the camera, right, and asked him to take our photograph.","definition[26]":"to put something back into the state or situation that it should be in","example[99]":"We must try to right the balance between taxation and government spending.","definition[27]":"to put something, especially a boat, back into its correct upright position","example[100]":"I finally managed to right the canoe.","example[101]":"She righted herself and picked up her bag.","definition[28]":"if you have the right to do something, you are morally, legally, or officially allowed to do it","example[102]":"Like other businesses, we have a right to set competitive prices.","example[103]":"Do regions such as Champagne have the exclusive right (=a right that only they have) to the use of their names in wine labeling?","example[104]":"New legislation is gradually taking away workers’ rights.","example[105]":"Your legal rights are the same when you buy mail order as when you buy from a shop.","definition[29]":"rights offered to existing shareholders to buy more shares in a company, perhaps at a reduced price","example[106]":"The board approved a plan to raise $30 million through a stock rights offering.","definition[30]":"if a person or company has the rights to something, they are legally allowed to use it to make money","example[107]":"They were granted the movie rights to her life story.","example[108]":"Warner will have all distribution rights in the U.S. and Canada."}