{"signpost[0]":"not continue","definition[0]":"to not continue, or to make someone or something not continue","example[0]":"By midday the rain had stopped.","example[1]":"This is where the path stops.","example[2]":"The referee stopped the fight.","example[3]":"The doctor advised me to stop the medication.","example[4]":"People are fighting to stop the destruction of the rain forests.","example[5]":"I couldn’t stop her crying.","note[0]":"stop somebody doing something","definition[1]":"if you stop doing something, you do not continue to do it","example[6]":"What time do you stop work?","example[7]":"I’ve been smoking for over ten years, and I can’t stop.","example[8]":"Right, stop what you’re doing and come over here.","example[9]":"Come on, you two! Stop it!","note[1]":"stop it/that","example[10]":"I stopped digging and looked at him.","note[2]":"stop doing something","signpost[1]":"prevent","definition[2]":"to prevent someone from doing something or something from happening","example[11]":"The government tried to stop publication of the book.","example[12]":"I’m leaving now, and you can’t stop me.","example[13]":"There’s nothing to stop you applying for the job yourself.","note[3]":"there’s nothing to stop somebody (from) doing something","example[14]":"Lay the carpet on paper to stop it sticking to the floor.","note[4]":"stop somebody/something (from) doing something","example[15]":"The rain didn’t stop us from enjoying the trip.","example[16]":"I couldn’t stop myself laughing.","note[5]":"stop yourself (from) doing something","example[17]":"She grabbed the rail to stop herself from falling.","signpost[2]":"not move","definition[3]":"to not walk, move, or travel anymore, or to make someone or something do this","signpost[3]":"pause","definition[4]":"to pause in an activity, journey etc in order to do something before you continue","example[18]":"It’s time we stopped to think about our next move.","note[6]":"stop to think/consider etc","example[19]":"We stopped for a drink on the way home.","note[7]":"stop for","example[20]":"I stopped to tie my shoe.","note[8]":"stop to do something","signpost[4]":"stay","definition[5]":"to stay somewhere for a short time, especially at someone’s house","example[21]":"I won’t sit down – I’m not stopping.","example[22]":"Will you stop for a cup of tea?","definition[6]":"if you stop an amount of money, you prevent it from being paid to someone","example[23]":"Dad threatened to stop my pocket money.","example[24]":"I phoned the bank and asked them to stop the cheque (=not pay a cheque that I had written).","example[25]":"My mother called the bank to stop payment on the check.","example[26]":"£200 will be stopped from your wages next month to pay for the damage.","note[9]":"stop something from something","signpost[5]":"block","definition[7]":"to block a hole or pipe so that water, smoke etc cannot go through it","heading[0]":"GRAMMAR: Patterns with stop","explanation[0]":"If you stop doing something, you do not continue doing it","example[27]":"Stop writing and put your pens down","bad_example[0]":"Stop to write and put your pens down","explanation[1]":"If you stop to do something, you stop moving or stop what you are doing for a short time, in order to do something else","example[28]":"She stopped to look at the map","display[0]":"stop something/sth stops","explanation[2]":"Stop belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[3]":"In this sentence, ‘the car’ is the object of stop","example[29]":"He stopped the car","explanation[4]":"In this sentence, ‘the car’ is the subject of stop","example[30]":"The car stopped","heading[1]":"to stop doing something","definition[8]":"to not do something any longer","example[31]":"I wish she would stop talking.","example[32]":"He waited for them to stop.","display[1]":"quit","example[33]":"She needs to quit complaining about her life.","example[34]":"It’s too late for him to quit now.","display[2]":"give something up","definition[9]":"to stop doing something, especially something that you have been doing for a long time","example[35]":"It’s so hard to give up smoking.","example[36]":"She wants to give up her job.","example[37]":"I’ve given up trying to tell my son to clean his room.","display[3]":"pack something in","definition[10]":"to stop doing something, especially because you feel tired or annoyed","example[38]":"Sometimes I feel like packing in my job and starting again somewhere else.","example[39]":"Pack it in, will you! (=used when telling someone to stop doing something, because they are annoying you)","display[4]":"pull out of something","definition[11]":"to stop taking part in something that you have agreed to take part in","example[40]":"The unions have pulled out of the negotiations.","example[41]":"The US decided to pull out of the competition.","display[5]":"cease","example[42]":"The company has decided to cease production of its film cameras.","example[43]":"The US government ceased talks with North Korea.","heading[2]":"to stop for a short time","example[44]":"Shall we stop for coffee now?","example[45]":"I stopped to have a look at the map.","definition[12]":"to stop speaking or doing something for a short time before starting again","example[46]":"He paused for a moment to consider the question.","example[47]":"‘I think it’s going to rain, ’ she said, pausing to look up at the sky.","display[6]":"have/take a break","definition[13]":"to stop working, studying, or driving for a short time in order to rest","example[48]":"Okay, everyone. Take a ten-minute break.","example[49]":"If you’re feeling tired, you should have a break.","definition[14]":"to stop working, studying etc in order to rest or eat something – used about a group of people who are doing something together","example[50]":"After a couple of hours the committee broke for lunch.","heading[3]":"to stop happening","example[51]":"The noise suddenly stopped.","example[52]":"We waited for the rain to stop.","display[7]":"come to an end","definition[15]":"to stop – used about something that has continued for a long time","example[53]":"The war finally came to an end in 1918.","display[8]":"wear off","definition[16]":"to gradually stop – used about a pain, a feeling, or the effects of something","example[54]":"The pain will soon wear off.","example[55]":"The excitement was beginning to wear off.","example[56]":"The anaesthetic took a long time to wear off.","display[9]":"peter out","definition[17]":"to gradually stop happening or existing","example[57]":"The campaign petered out after only a few weeks.","definition[18]":"to stop","example[58]":"The fighting has ceased.","example[59]":"Production at the factory has ceased.","heading[4]":"to stop moving","example[60]":"Can we stop soon? I’m tired.","example[61]":"The bus stops right in front of the hotel.","display[10]":"come to a halt","definition[19]":"to move more slowly and then stop – used about a vehicle","example[62]":"The train slowly came to a halt just outside the station.","example[63]":"The plane came to a halt less than twenty yards away from the limousines.","display[11]":"pull over","definition[20]":"to move to the side of the road and stop – used about a vehicle or its driver","example[64]":"The bus pulled over to the side of the road, with smoke coming out of its engine.","example[65]":"The police officer was waving at him to pull over.","display[12]":"pull up","definition[21]":"to stop close to something – used about a vehicle or its driver","example[66]":"The taxi pulled up outside her house.","example[67]":"He pulled up next to our car.","display[13]":"come to a standstill","definition[22]":"to go slower and then stop moving completely","example[68]":"The road was blocked by an accident, and the traffic quickly came to a standstill.","signpost[6]":"during journey","definition[23]":"a time or place when you stop during a journey for a short time","example[69]":"Our first stop was Paris.","example[70]":"We’ll make a stop at the foot of the hill.","example[71]":"The trip includes an overnight stop in London.","signpost[7]":"bus/train","definition[24]":"a place where a bus or train regularly stops for people to get on and off","example[72]":"Our next stop will be York.","example[73]":"This is your stop, isn’t it?","definition[25]":"the action or fact of telling your bank not to pay an amount of money to someone","example[74]":"I put a stop on that check to the store.","definition[26]":"a handle that you push in or out on an organ to control the amount of sound it produces","signpost[8]":"consonant","definition[27]":"a consonant sound, like /p/ or /k/, that you make by stopping the flow of air completely and then suddenly letting it out of your mouth","example[75]":"The government should intervene to stop the takeover.","example[76]":"How can we stop the decline in sales?","example[77]":"This latest crisis did not stop the Bank of France cutting its key interest rates.","example[78]":"News of the takeover immediately stopped the company’s shares from sliding.","definition[28]":"to no longer continue to do something","example[79]":"Lack of funds forced us to stop production.","example[80]":"Japan’s four leading brokerages agreed to stop issuing new shares for a month.","example[81]":"You can stop paying premiums at any time.","definition[29]":"to tell a bank not to pay a cheque you have written","example[82]":"Staff are failing to charge customers for such services as stopping cheques or returning standing orders unpaid.","definition[30]":"to prevent money from being paid after you agree to pay it","example[83]":"Money for breakages will be stopped from your wages.","example[84]":"Production came to a virtual stop during the two-week strike.","definition[31]":"to prevent something from continuing or happening","example[85]":"These quotas put a stop to further export growth."}