{"word[0]":"book","signpost[0]":"printed pages","definition[0]":"a set of printed pages that are held together in a cover so that you can read them","example[0]":"I’ve just started reading a book by Graham Greene.","example[1]":"a cookery book","example[2]":"a book about cats","note[0]":"book about/on","signpost[1]":"to write in","definition[1]":"a set of sheets of paper held together in a cover so that you can write on them","example[3]":"a black address book","example[4]":"a notebook","signpost[2]":"set of things","definition[2]":"a set of things such as stamps, matches, or tickets, held together inside a paper cover","example[5]":"a cheque book","signpost[3]":"part of a book","definition[3]":"one of the parts that a very large book such as the Bible is divided into","example[6]":"the Book of Isaiah","note[1]":"book of","collocation[0]":"read a book","example[7]":"What book are you reading at the moment?","collocation[1]":"look through a book","example[8]":"I looked through the book until I found the right section.","collocation[2]":"write a book","example[9]":"He’s written several interesting travel books.","collocation[3]":"publish a book","example[10]":"The book is published by Penguin.","collocation[4]":"a book comes out","example[11]":"Everyone was waiting for the new Harry Potter book to come out.","collocation[5]":"borrow a book","example[12]":"You can borrow up to six books from the library.","collocation[6]":"return a book","example[13]":"Please return all your books before the end of term.","collocation[7]":"renew a book","example[14]":"If you need to renew a book, you can do it by phone.","form[0]":"book + NOUN","collocation[8]":"a book shop","example[15]":"I got it from that little book shop in the village.","collocation[9]":"a book seller","example[16]":"High street book sellers are experiencing a drop in sales.","collocation[10]":"a book token","example[17]":"She always bought me book tokens for my birthday.","collocation[11]":"a book review","example[18]":"She had a book review published in the student magazine.","collocation[12]":"a book fair","collocation[13]":"the introduction/preface/foreword to a book","example[19]":"In the introduction to this book I referred to a conversation between myself and a young student.","collocation[14]":"a section of a book","example[20]":"The most useful section of the book is the list of suppliers of artists’ materials.","collocation[15]":"the cover of a book","example[21]":"His picture is on the cover of the book.","collocation[16]":"a chapter of a book","example[22]":"The first chapter of the book is about his childhood.","heading[0]":"GRAMMAR: Patterns with book","explanation[0]":"You read something in a book","example[23]":"I read about him in a book at school","explanation[1]":"You say a book about a subject or a book on a subject","example[24]":"I like books about sport","bad_example[0]":"I like books of sport","explanation[2]":"A book of essays, poems etc is one that contains several essays, poems etc","example[25]":"It’s a book of interviews with artists","explanation[3]":"You say a book by someone","example[26]":"I’m reading a book by John Gray","bad_example[1]":"I’m reading a book of John Gray","heading[1]":"types of book","display[0]":"novel","definition[4]":"a book about imaginary people and events","example[27]":"The film is based on Nick Hornby’s best-selling novel.","example[28]":"a historical novel","display[1]":"fiction","definition[5]":"books that describe imaginary people and events","example[29]":"She reads a lot of romantic fiction.","display[2]":"literature","definition[6]":"novels and plays that are considered to be important works of art","example[30]":"I’m studying American literature at university.","display[3]":"non-fiction","definition[7]":"books that describe real people and events","example[31]":"Men tend to prefer non-fiction.","display[4]":"science fiction","definition[8]":"books about imaginary events in the future or space travel","display[5]":"reference book","definition[9]":"a book such as a dictionary or encyclopedia, which you look at to find information","display[6]":"textbook","definition[10]":"a book about a particular subject that you use in a classroom","display[7]":"set book","definition[11]":"a book that you have to study as part of your course","display[8]":"guidebook","definition[12]":"a book telling visitors about a city or country","display[9]":"picture book","definition[13]":"a book for children with many pictures in it","display[10]":"hardcover/hardback","definition[14]":"a book that has a hard stiff cover","display[11]":"paperback","definition[15]":"a book that has a paper cover","display[12]":"biography","definition[16]":"a book about a real person’s life, written by another person","display[13]":"autobiography","definition[17]":"a book that someone has written about their own life","display[14]":"recipe book/cookery book","definition[18]":"a book that tells you how to cook different meals","definition[19]":"to make arrangements to stay in a place, eat in a restaurant, go to a theatre etc at a particular time in the future","example[32]":"Have you booked a holiday this year?","example[33]":"The flight was already fully booked (=no more seats were available).","example[34]":"To get tickets, you have to book in advance.","example[35]":"The show’s booked solid (=all the tickets have been sold) until February.","definition[20]":"to arrange for someone such as a singer to perform on a particular date","example[36]":"The band was booked for a benefit show in Los Angeles.","definition[21]":"to arrange for someone to go to a hotel, fly on a plane etc","example[37]":"I’ve booked you a flight on Saturday.","example[38]":"I’ll book you in at the Hilton.","note[2]":"book somebody on/in etc","definition[22]":"to put someone’s name officially in police records, along with the charge made against them","example[39]":"Smith was booked on suspicion of attempted murder.","definition[23]":"when a referee in a sports game books a player who has broken the rules, he or she officially writes down the player’s name in a book as a punishment","collocation[17]":"book a holiday","example[40]":"People often book their holidays in January.","collocation[18]":"book a trip","example[41]":"I booked the whole trip on the Internet.","collocation[19]":"book a flight","example[42]":"He picked up the phone and booked a flight to Barcelona.","collocation[20]":"book a ticket","example[43]":"It’s cheaper if you book your train ticket in advance.","collocation[21]":"book a table","example[44]":"I’ll book a table for 7.30 tomorrow evening.","collocation[22]":"book a room/hotel","example[45]":"Ross found a good hotel and booked a room.","collocation[23]":"book a seat","example[46]":"She booked me a seat on the 9 am flight.","collocation[24]":"book a place on something","example[47]":"Students are advised to book a place on the course early.","collocation[25]":"book early","example[48]":"We recommend you book early to avoid disappointment.","collocation[26]":"book (well) in advance","example[49]":"There are only 20 places, so it is essential to book well in advance.","collocation[27]":"book online","example[50]":"It’s much easier to book tickets online.","collocation[28]":"be fully booked","example[51]":"I’m afraid that show is fully booked.","collocation[29]":"be booked solid","example[52]":"The restaurant’s  booked solid for the whole of the Christmas period.","definition[24]":"the accounting records of a business","synonym[0]":"ACCOUNT BOOKS","example[53]":"The company’s books are in such chaos that we won’t know the truth for some time.","definition[25]":"a list of a company’s clients and orders for goods","example[54]":"The company has 100 firm orders for two different aircraft on its books.","definition[26]":"a company’s records of the people working for it","example[55]":"The 206,000 employees on its books last summer have now fallen to 185,000.","definition[27]":"a book containing an official record or list","definition[28]":"a list of the bonds, shares etc that a dealer has to offer at a particular time","example[56]":"Marketmakers were running down their books ahead of the holiday.","definition[29]":"to be responsible for organizing a SECURITIES ISSUE (=when new bonds, shares etc are sold)","example[57]":"the financial services company that will run the book for the float","definition[30]":"to enter a figure in a company’s account books","example[58]":"The restructuring charge is to be booked in the company’s second-quarter accounts."}