{"word[0]":"post","definition[0]":"a job, especially an important one in a large organization","example[0]":"I applied for the post and was asked to attend an interview.","example[1]":"She was offered the post of ambassador to India.","example[2]":"He will take up his post as Head of Modern Languages in September.","example[3]":"Goddard has held the post since 1998.","example[4]":"Unfortunately they were unable to find a suitable person to fill the post.","example[5]":"Mr Thomson resigned his £50,000 a year post in April.","example[6]":"She now holds a senior post in the Department of Education.","example[7]":"the creation of 4,000 new teaching posts","signpost[0]":"letters","definition[1]":"letters, packages etc that are sent and delivered","example[8]":"Was there any post for me today?","example[9]":"Emma was opening her post.","signpost[1]":"collection/delivery","definition[2]":"when letters are collected or delivered","note[0]":"catch/miss the post (=post your letter in time for it to be collected, or not in time)","example[10]":"What time does the post go (=get collected)?","example[11]":"Applications must arrive by first post on September 23.","note[1]":"(the) first/second/last post","signpost[2]":"piece of wood/metal","definition[3]":"a strong upright piece of wood, metal etc that is fixed into the ground, especially to support something","example[12]":"a fence post","signpost[3]":"football/hockey etc","definition[4]":"one of the two upright pieces of wood between which players try to kick or hit the ball in football, hockey etc","synonym[0]":"goalpost","example[13]":"The ball hit the post and bounced off.","signpost[4]":"newspaper","definition[5]":"used in the names of some newspapers","example[14]":"the ‘Washington Post’","signpost[5]":"internet message","definition[6]":"a message sent to an Internet discussion group so that all members of the group can read it","example[15]":"There was post after post criticizing the Minister.","heading[0]":"– Meaning 1: a job, especially an important one in a large organization","collocation[0]":"hold a post","example[16]":"He had previously held the post of Foreign Minister.","collocation[1]":"apply for a post","example[17]":"I am writing to apply for the post of secretary.","collocation[2]":"take up a post","example[18]":"She will take up her new post next month.","collocation[3]":"leave a post","example[19]":"The previous ambassador left his post in June.","collocation[4]":"resign (from) a post","example[20]":"John Sargent has resigned his post as chairman.","collocation[5]":"be dismissed from a post","example[21]":"As a result of the scandal, he was dismissed from his post.","collocation[6]":"offer somebody a post","example[22]":"He was offered the post of Secretary of State for Wales.","collocation[7]":"appoint somebody to a post","example[23]":"Mr Collingwood has been appointed to the post of Headteacher.","collocation[8]":"fill a post","example[24]":"They have advertised the post but it hasn't yet been filled.","form[0]":"ADJECTIVES/NOUN + post","collocation[9]":"a senior post","example[25]":"Senior posts in industry attract very high salaries.","collocation[10]":"a junior post","example[26]":"He was offered a junior post in a bank.","collocation[11]":"a permanent/temporary post","example[27]":"I have a two-year contract, not a permanent post.","collocation[12]":"a full-time/part-time post","example[28]":"a part-time post as a university lecturer","collocation[13]":"a teaching post","example[29]":"My first teaching post was in outer London.","collocation[14]":"an administrative post","example[30]":"For the next twelve years, he held various administrative posts in Bombay.","collocation[15]":"a government post","example[31]":"I decided to apply for a local government post.","collocation[16]":"send something by post","example[32]":"They sent me the contract by post.","collocation[17]":"put something in the post","example[33]":"I put it in the post on Friday, so it should have arrived today.","collocation[18]":"get something in the post","example[34]":"Did you get anything in the post today?","collocation[19]":"something comes/arrives in the post","example[35]":"This letter came in the post this morning.","collocation[20]":"something gets lost in the post","example[36]":"I'm afraid the cheque must have got lost in the post.","collocation[21]":"first-class post","example[37]":"The package arrived by first-class post.","collocation[22]":"second-class post","example[38]":"Items sent by second-class post can take up to five days to arrive.","heading[1]":"– Meaning 4: when letters are collected or delivered","collocation[23]":"first/second/last post","example[39]":"The last post is at 5.30.","collocation[24]":"catch the post","example[40]":"He wrote the letter hurriedly because he was anxious to catch the post.","collocation[25]":"miss the post","example[41]":"If I miss the post today, the card won’t arrive on her birthday.","collocation[26]":"the post goes","example[42]":"The first post goes at 7.30 am.","definition[7]":"to send a letter, package etc by post","example[43]":"She’s just gone to post a letter.","example[44]":"Did you remember to post the card to my parents?","note[2]":"post something (off) to somebody","example[45]":"I posted Barry the cheque last Friday.","note[3]":"post somebody something","definition[8]":"if you are posted somewhere, your employer sends you to work there, usually for several years","note[4]":"be posted abroad/overseas","example[46]":"He joined the British Army and was posted to Germany.","note[5]":"be posted to France/London etc","explanation[0]":"Post is usually passive in this meaning","signpost[6]":"public notice","definition[9]":"to put up a public notice about something on a wall or notice board","example[47]":"The exam results were posted on the bulletin board yesterday.","signpost[7]":"guard","definition[10]":"to make someone be in a particular place in order to guard a building, check who enters or leaves a place, watch something etc","synonym[1]":"station","example[48]":"Guards were to be posted around nuclear power stations.","signpost[8]":"profit/loss etc","definition[11]":"to officially record and announce information about a company’s financial situation or a country’s economic situation","example[49]":"Cisco Systems posted record profits and sales for the third fiscal quarter.","definition[12]":"to put a message or computer document on the Internet so that other people can see it","example[50]":"Could you post those new flyers on David’s website?","definition[13]":"later than or after something","example[51]":"the post-war years  (=the years after a particular war)","example[52]":"the post-1979 Conservative government","definition[14]":"the Washington Post","definition[15]":"the New York Post","definition[16]":"the Sunday Post","definition[17]":"later than, after","example[53]":"developing a post-acquisition strategy","example[54]":"Its share price rocketed from its post-crash low.","definition[18]":"the official system for sending and receiving letters, parcels etc","example[55]":"items that are lost or damaged in the post","example[56]":"We’ve cut our costs by usingfirst class post only for urgent items.","example[57]":"Winners will be notified by post.","example[58]":"A copy of the document should be sent in the post.","example[59]":"Only 2% of those questioned would choose to buy a policy through the post.","definition[19]":"a time when letters are collected or delivered","example[60]":"Place items in the out-tray by 4.45 to meet the last post.","definition[20]":"if you reply to a letter by return of post, you reply almost immediately","example[61]":"Send payment by return of post.","definition[21]":"letters, parcels etc","example[62]":"She always opens her post when she arrives.","definition[22]":"a job, especially an important or well paid one","example[63]":"How long did you hold your previous post?","example[64]":"The bank chief plans to resign his post (=leave it) later this year.","example[65]":"Most of the executives interviewed had already been in post for 12 months.","synonym[2]":"posting","definition[23]":"to send a letter, parcel etc using the official service","example[66]":"the correct way to pack and protect the items you post","example[67]":"Shareholders will be sent details in a newsletter due to be posted today.","definition[24]":"to offically record and announce results for a company or information about the economy","example[68]":"The groupposted a 25%gain in second-quarter net income.","example[69]":"The company shed a point afterposting a second-quarter loss of 35 cents a share.","example[70]":"Shares closed lower as the government posted worse inflation figures than the City expected.","definition[25]":"to enter a figure in a LEDGER (=a book used by a company to record money received or spent)","example[71]":"The billing office will check that all charges have been posted to the guest’s account.","note[6]":"post something to something","example[72]":"If companies post information on a web page, everyone has access to it."}