{"word[0]":"untrue","definition[0]":"not based on facts that are correct","example[0]":"allegations that are totally untrue","example[1]":"It’s untrue to say that the situation has not changed.","explanation[0]":"In everyday English, people usually say something is not true rather than untrue:","example[2]":"It’s not true to say nothing has changed.","definition[1]":"someone who is untrue to their husband, wife etc is not faithful to them","synonym[0]":"unfaithful","definition[2]":"not true, because the person does not know the facts, or because they are lying","example[3]":"It is untrue that the college broke the terms of the contract.","example[4]":"The allegations are completely untrue.","definition[3]":"not true and not based on the facts, or not the real one","example[5]":"The article gives a totally false impression of life in Russia today.","example[6]":"He gave a false name and address to the police.","example[7]":"Decide whether these statements are true or false.","display[0]":"something is not the case","definition[4]":"if what someone says or believes is happening  is not the case, it is not happening and what they say or believe is not true","example[8]":"Recent reports suggest that violent crime is increasing, but this is simply not the case.","example[9]":"People think there’s an endless supply of fish, but unfortunately that’s not the case.","display[1]":"misleading","definition[5]":"a misleading statement or piece of information makes people believe something that is not true, especially because it does not give all the facts","example[10]":"The holiday brochure is deliberately misleading, because the hotels it shows are not the ones you actually stay in.","example[11]":"These statistics give a misleading impression of what is happening to the economy.","display[2]":"trumped-up","definition[6]":"trumped-up charges, accusations, evidence etc use information that is not true in order to make someone seem guilty of doing something wrong","example[12]":"He had been arrested by the secret police on trumped-up charges of spying.","example[13]":"Zola believed that the case against Dreyfus was trumped-up and utterly false.","heading[0]":"something that is untrue","display[3]":"myth","definition[7]":"something a lot of people believe because they want to believe it, not because it is based on fact","example[14]":"The first myth about motherhood is that new mothers instantly fall in love with their babies.","example[15]":"Contrary to popular myth, our streets are much safer now than they were 100 years ago.","display[4]":"illusion","definition[8]":"a belief or idea that is false, especially a belief in something good about yourself or about the situation you are in","example[16]":"Alcohol gives people the illusion of being witty and confident.","example[17]":"People bought the land under the illusion that the value would increase.","display[5]":"misconception","definition[9]":"an idea that is not true but which people believe because they do not have all the facts, or they have not properly understood the situation","example[18]":"It’s a common misconception that vaccinations given in childhood last for life.","example[19]":"Employers seem to share the general misconception that young people are more efficient than older workers.","display[6]":"delusion","definition[10]":"a completely mistaken idea, which affects your behaviour and what you decide to do","example[20]":"He began to suffer from paranoid delusions.","example[21]":"Many people labour under the delusion  (=have the delusion) that anything which says ‘natural ingredients’ on the label must be harmless.","example[22]":"the delusion that women control most of the world' s wealth and power","display[7]":"fallacy","definition[11]":"if you say that something is a fallacy, you mean that it is completely wrong to believe that it is true","example[23]":"The idea that a good night’s sleep will cure everything is a complete fallacy.","example[24]":"It’s a fallacy that all fat people are fat simply because they eat too much."}