{"word[0]":"excuse","signpost[0]":"forgive","definition[0]":"to forgive someone for doing something that is not seriously wrong, such as being rude or careless","example[0]":"I’ll excuse you this time, but don’t be late again.","example[1]":"Please excuse my bad handwriting.","example[2]":"Smith can be excused for his lack of interest in the course  (=his lack of interest is reasonable).","example[3]":"Please excuse me for being so late today.","note[0]":"excuse somebody for (doing) something","explanation[0]":"In informal situations, people often say sorry about …, sorry for doing ...  or sorry I … rather than asking someone to excuse something:","example[4]":"Sorry about my handwriting.","example[5]":"Sorry for being so late, or Sorry I’m so late.","signpost[1]":"from a duty","definition[1]":"to allow someone not to do something that they are supposed to do","example[6]":"Can I be excused from swimming today? I have a cold.","note[1]":"be excused from (doing) something","explanation[1]":"Excuse is usually passive in this meaning","signpost[2]":"explain","definition[2]":"to be or give a good reason for someone’s careless or offensive behaviour","example[7]":"Nothing can excuse that kind of rudeness.","signpost[3]":"from a place","definition[3]":"to give someone permission to leave a place","example[8]":"May I please be excused from the table?","definition[4]":"a reason that you give to explain careless or offensive behaviour","example[9]":"I’m tired of listening to his excuses.","example[10]":"What’s your excuse for being late this time?","note[2]":"excuse for (doing) something","definition[5]":"a reason that you invent to explain an action and to hide your real intentions","example[11]":"I need an excuse to call her.","note[3]":"excuse to do something","example[12]":"The conference is just an excuse for a holiday in New York.","note[4]":"excuse for","definition[6]":"a note written by your doctor or one of your parents saying that you were ill on a particular day","collocation[0]":"make up/think up/invent an excuse","example[13]":"I made up some excuse about my car breaking down.","example[14]":"We’d better think up an excuse, fast.","collocation[1]":"make excuses for somebody/something","example[15]":"His mother was always making excuses for her son's behaviour.","collocation[2]":"use something as an excuse","example[16]":"She never complained or used her illness as an excuse.","collocation[3]":"look for an excuse","example[17]":"I began to look for excuses to avoid seeing him.","collocation[4]":"give an excuse","example[18]":"I'll have to give my boss some kind of excuse.","collocation[5]":"believe/accept an excuse","example[19]":"She didn’t believe his excuse for one minute.","collocation[6]":"have an excuse","example[20]":"Companies have no excuse for breaking the law.","collocation[7]":"a good excuse","example[21]":"A sunny day is a good excuse to go to the beach.","collocation[8]":"a wonderful excuse","example[22]":"A wedding is a wonderful excuse to buy a new outfit.","collocation[9]":"a reasonable/plausible excuse","example[23]":"If your train was cancelled, that is a perfectly reasonable excuse.","collocation[10]":"a legitimate/valid excuse","example[24]":"He didn’t have a legitimate excuse for being late.","collocation[11]":"the perfect excuse","example[25]":"The phone call gave me the perfect excuse to leave.","collocation[12]":"a feeble/flimsy/weak excuse","example[26]":"Joe muttered some feeble excuse about having a headache.","collocation[13]":"a pathetic/lame excuse","example[27]":"That’s the most pathetic excuse I’ve ever heard.","collocation[14]":"the usual excuse/the same old excuse","example[28]":"He made the usual excuses for not coming.","example[29]":"Whenever the trains are late, it's always the same old excuse.","collocation[15]":"a convenient excuse","example[30]":"The rioting provided the government with a convenient excuse not to hold an election.","collocation[16]":"use every excuse in the book","example[31]":"He used every excuse in the book to avoid seeing the doctor.","collocation[17]":"at the slightest excuse","example[32]":"She comes to our house at the slightest excuse."}