{"word[0]":"property","plural[0]":"properties","definition[0]":"the thing or things that someone owns","example[0]":"The hotel is not responsible for any loss or damage to guests’ personal property.","example[1]":"Some of the stolen property was found in Mason’s house.","definition[1]":"a building, a piece of land, or both together","note[0]":"commercial/residential property","example[2]":"Property prices have shot up recently.","example[3]":"the property market","example[4]":"a sign saying ‘Private Property. Keep Out.’","example[5]":"property taxes","definition[2]":"a quality or power that a substance, plant etc has","synonym[0]":"quality","example[6]":"a herb with healing properties","example[7]":"the chemical properties of a substance","note[1]":"physical/chemical etc properties","heading[0]":"– Meaning 2: a building, a piece of land, or both together","collocation[0]":"buy/sell (a) property","example[8]":"Buying a property is a complicated business.","form[0]":"ADJECTIVES/NOUN + property","collocation[1]":"detached","example[9]":"It is a modern detached property with five bedrooms.","collocation[2]":"semi-detached","example[10]":"This semi-detached property is located in one of the most sought-after areas of the town.","collocation[3]":"a three-bedroom/four-bedroom etc property","example[11]":"Four-bedroom properties are usually ideal for families.","collocation[4]":"a desirable property","example[12]":"It is a desirable property with a south-facing garden.","collocation[5]":"commercial property","example[13]":"The bombs caused damage to commercial property.","collocation[6]":"residential property","example[14]":"The site proposed for the factory is too near to residential property.","collocation[7]":"private property","example[15]":"The land on the other side of the gate is private property.","form[1]":"property + NOUN","collocation[8]":"property prices","example[16]":"Property prices are much lower here than in London.","example[17]":"There were no signs of an upturn in the property market.","collocation[9]":"a property owner","example[18]":"It makes sense for property owners to extend their houses rather than move.","heading[1]":"– Meaning 3: a quality or power that a substance, plant etc has","collocation[10]":"physical properties","example[19]":"What are the physical properties of metals?","collocation[11]":"chemical properties","example[20]":"They grouped the known elements by chemical properties.","collocation[12]":"electrical properties","example[21]":"Each type of cell has distinct electrical properties.","collocation[13]":"magnetic properties","example[22]":"the magnetic properties of iron and nickel","collocation[14]":"optical properties","example[23]":"These minerals have similar optical properties.","collocation[15]":"healing/medicinal properties","example[24]":"The old women know about the healing properties of local herbs.","collocation[16]":"health-giving properties","example[25]":"They believed that the water had special health-giving properties.","collocation[17]":"antiseptic properties","example[26]":"This plant has mild antiseptic properties.","definition[3]":"the things that a person, organization etc owns","example[27]":"He left most of his property to his granddaughter.","example[28]":"They were arrested and charged with damaging school property.","display[0]":"possessions","definition[4]":"all the things that you own or have with you at a particular time","example[29]":"He sold all his possessions and left the country.","example[30]":"The prisoners were allowed to have few personal possessions.","display[1]":"belongings","definition[5]":"things you own such as clothes, books etc, especially things you take with you when travelling","example[31]":"I quickly packed a few of my belongings in an overnight bag.","display[2]":"things","definition[6]":"small things you own, such as clothes, books etc","example[32]":"Don’t leave your things all over the floor!","example[33]":"I’ve got so much stuff, I don’t know where to put it all.","display[3]":"valuables","definition[7]":"things that you own that are worth a lot of money and may get stolen, for example jewellery or cameras","example[34]":"The advice from police is: if you have valuables don’t leave them in the car.","example[35]":"Keep valuables like TVs and computer equipment out of sight.","display[4]":"personal effects","definition[8]":"small things you own – used especially when there is an accident, a robbery, or the person who owns them dies","example[36]":"The insurance policy covers baggage and personal effects – up to £1,000 per person.","example[37]":"After Turing’s death in 1954, his mother received his personal effects, including the Order of the British Empire, awarded in 1946 for his code work.","example[38]":"Sections of aircraft wreckage and personal effects were scattered all around.","display[5]":"assets","definition[9]":"houses, land, shares etc that a person or organization owns and would be able to sell if they needed money – used especially in legal or business contexts","example[39]":"Many homeowners now have assets of over £234,000 in the value of their home alone.","example[40]":"financial assets such as bonds and shares","definition[10]":"all the things that someone owns","example[41]":"The President supports a tax cut on profits from sales of property such as stocks and real estate.","example[42]":"The hotel is not responsible for damage to guests’ personal property.","definition[11]":"land and buildings, and the activity of buying, selling, and renting them","synonym[1]":"REAL ESTATE","example[43]":"Property prices have shot up  (=quickly increased) recently.","example[44]":"Homeowners around Miramar, site of a planned new airport, are worried about noise and property values.","example[45]":"The tax increase amounts to an extra $3 a month for the averageproperty owner.","definition[12]":"a building, especially a house, and the land that surrounds it","example[46]":"Several properties on this street are for sale.","definition[13]":"ownership of land, goods etc","example[47]":"a belief in the idea of communal property"}