{"word[0]":"rating","definition[0]":"a level on a scale that shows how good, important, popular etc someone or something is","example[0]":"By the end of the year the prime minister’s approval rating (=how many people agreed with his policies) had fallen as low as 12 percent.","definition[1]":"a letter that shows whether or not a film is suitable for children","example[1]":"‘The Godfather’ had an X-rating when it was first shown.","definition[2]":"a sailor in the navy who is not an officer","form[0]":"ADJECTIVES/NOUN + rating","example[2]":"His previous highest approval rating was 58 percent.","example[3]":"The rating he gave the restaurant was embarrassingly low.","collocation[0]":"an approval/popularity rating","example[4]":"His popularity rating remains high.","collocation[1]":"a performance rating","example[5]":"They received different pay increases even though their performance ratings were the same.","collocation[2]":"a credit rating","example[6]":"We can’t give you the loan because you have a bad credit rating.","collocation[3]":"a star rating","example[7]":"Each restaurant is given a star rating.","collocation[4]":"give somebody/something a rating","example[8]":"I'd only give this PC a rating of two out of five.","collocation[5]":"receive/get/achieve/score a rating","example[9]":"The Department of Computer Science received a top rating last year.","collocation[6]":"a rating rises/climbs","example[10]":"The president's approval ratings have risen considerably.","collocation[7]":"a rating falls","example[11]":"His rating fell to only 28%.","definition[3]":"a level on a scale that shows how good, important, or popular something or someone is","example[12]":"The President’s popularity rating has never been higher.","example[13]":"The show is several ratings points ahead of its nearest rival.","definition[4]":"a measurement of the risk of lending to a company etc, calculated by an independent organization called a RATINGS AGENCY","example[14]":"Standard and Poor’s downgraded (=reduced) the rating on Pacific’s commercial paper to single-A-3 from single-A-2.","example[15]":"Moody’s upgraded (=improved) its  rating on Disney’s senior debt to double-A-3 from single-A-2.","definition[5]":"an estimate of the future profitability of investing in a particular company","example[16]":"Kidder Peabody recommended Texas Instruments stock, which carries the firm’s highest investment rating.","definition[6]":"a measurement of the risk of loss, used to calculate how much will be charged for insurance","definition[7]":"a measurement of how many people watch a television programme or listen to a radio programme","example[17]":"CBS Evening News slipped to second place in the ratings.","example[18]":"NBC’s ratings dropped 3% in November.","definition[8]":"the class in which a ship or machine is placed, according to its size"}