{"word[0]":"draft","signpost[0]":"piece of writing","definition[0]":"a piece of writing or a plan that is not yet in its finished form","example[0]":"the rough draft of his new novel","example[1]":"I read the first draft and thought it was very good.","example[2]":"All parties eventually approved the final draft (=finished form) of the peace treaty.","definition[1]":"a written order for money to be paid by a bank, especially from one bank to another","definition[2]":"a system in which professional teams choose players from colleges to join their teams","signpost[1]":"cold air/beer","definition[3]":"the American spelling of draught","collocation[0]":"the first/second etc draft","example[3]":"The second draft of the agreement contained a few important changes.","collocation[1]":"the final draft","example[4]":"He showed me the final draft of his letter.","collocation[2]":"a rough draft","example[5]":"Could you let me see a rough draft of your report?","collocation[3]":"the original draft","example[6]":"The hero had a different name in the original draft of the story.","collocation[4]":"an early/earlier draft","example[7]":"In earlier drafts of the speech, he criticized the pace of political progress.","collocation[5]":"a preliminary draft","example[8]":"A preliminary draft of the charter has been issued.","collocation[6]":"write/draw up/prepare a draft","example[9]":"Always write a rough draft of your essay first.","example[10]":"He drew up a draft of the club’s rules and regulations.","collocation[7]":"approve a draft","example[11]":"The draft was approved by the Senate.","definition[4]":"to write a plan, letter, report etc that will need to be changed before it is in its finished form","example[12]":"Eva’s busy drafting her speech for the conference.","definition[5]":"to order someone to join the army, navy etc, especially during a war","synonym[0]":"conscript","example[13]":"My dad was eighteen when he got drafted into the army.","note[0]":"be drafted into something","explanation[0]":"Draft is usually passive in this meaning","definition[6]":"to choose a college player to join a professional team","example[14]":"Craigwell was drafted by the Chicago Blackhawks.","definition[7]":"a document or piece of writing that has to be checked and possibly changed, and so is not yet in its finished form","example[15]":"This is only a rough draft of the letter.","example[16]":"When can I have the first draft of your proposal?","example[17]":"a draft report, which the Committee has read and considered in detail.","definition[8]":"to write a letter, report etc that will need to be changed before it is in its finished form","example[18]":"I’ll ask our contracts department to draft an agreement."}