{"word[0]":"guess","definition[0]":"to try to answer a question or form an opinion when you are not sure whether you will be correct","example[0]":"I’d say he’s around 50, but I’m only guessing.","example[1]":"What star sign are you? No, let me guess.","example[2]":"If you guess correctly, you have another turn.","note[0]":"guess right/correctly/wrong","example[3]":"It’s hard to guess his age because he dyes his hair.","note[1]":"difficult/hard/easy etc to guess","example[4]":"You can guess what happened next.","note[2]":"guess what/who/how etc","example[5]":"We can only guess at the cause of the crash.","note[3]":"guess at","definition[1]":"to realize that something is true even though you do not know for certain","example[6]":"Can you guess the identity of this week’s special guest?","example[7]":"I guessed that you must be related because you look so similar.","note[4]":"guess (that)","example[8]":"I guessed from his expression that he already knew about the accident.","note[5]":"guess from","definition[2]":"an attempt to answer a question or make a judgment when you are not sure whether you will be correct","example[9]":"I’d say she’s about 35, but that’s only a guess.","collocation[0]":"make a guess","example[10]":"I didn't know the answer to question 7, so I just had to make a guess.","collocation[1]":"have a guess","example[11]":"Go on, have a guess at how much it cost.","example[12]":"Take a guess. How many people do you think showed up?","collocation[2]":"hazard a guess","example[13]":"No one at this stage is prepared to hazard a guess about the outcome of the elections.","collocation[3]":"a rough guess","example[14]":"This is just a rough guess, but I think it would cost about $50.","collocation[4]":"a wild guess","example[15]":"I made a wild guess and I got the answer right first time.","collocation[5]":"a lucky guess","example[16]":"‘How did you know?’ ‘It was just a lucky guess.’","collocation[6]":"a good guess","example[17]":"I'm not sure how old she is, but I can make a good guess!","collocation[7]":"somebody’s best guess","example[18]":"My best guess is that it will take around six months.","collocation[8]":"an educated/informed guess","example[19]":"Stockbrokers try to make educated guesses as to which stocks will do well.","collocation[9]":"an intelligent guess","example[20]":"Analysis of the archaeological site will help us make an intelligent guess as to what it was used for.","collocation[10]":"an inspired guess","example[21]":"It’s hard to believe he got that right with just an inspired guess.","collocation[11]":"my guess is (that)","example[22]":"My guess is there won’t be many people there.","collocation[12]":"at a guess","example[23]":"I'd say it was built around the turn of the century, at a guess.","collocation[13]":"I’ll give you three guesses","example[24]":"‘Where is he?’ ‘I’ll give you three guesses.’"}