{"word[0]":"possession","signpost[0]":"having something","definition[0]":"if something is in your possession, you own it, or you have obtained it from somewhere","example[0]":"How did the painting come into your possession  (=how did you get it)?","example[1]":"The finance company now has possession of the house.","example[2]":"We didn’t take possession of  (=get and start using) the car until a few days after the auction.","example[3]":"The house has been in the family’s possession since the 1500s.","note[0]":"in somebody’s possession","example[4]":"That information is not in our possession.","example[5]":"She was found in possession of stolen goods.","note[1]":"in possession of something","signpost[1]":"something you own","definition[1]":"something that you own or have with you at a particular time","synonym[0]":"belongings","example[6]":"He had sold all his possessions and left the country.","example[7]":"I packed my remaining possessions into the trunk.","example[8]":"Prisoners were allowed no personal possessions.","example[9]":"This old violin had been her father’s most treasured possession.","note[2]":"treasured/prized/precious possession","definition[2]":"the crime of having illegal drugs or weapons with you or in your home","example[10]":"He was arrested and charged with possession of cocaine.","note[3]":"possession of","definition[3]":"when a person or team has control of the ball in some sports","example[11]":"Pittsburgh got possession and scored.","note[4]":"win/lose/gain etc possession","signpost[2]":"country","definition[4]":"a country controlled or governed by another country","example[12]":"France’s former colonial possessions","signpost[3]":"evil spirits","definition[5]":"a situation in which someone’s mind is being controlled by something evil","example[13]":"Was it a case of demonic possession?","heading[0]":"– Meaning 1: if something is in your possession, you own it, or you have obtained it from somewhere","collocation[0]":"be in somebody's possession","example[14]":"The painting has been in the family's possession since then.","collocation[1]":"come into somebody's possession","example[15]":"You have a duty not to disclose confidential information that comes into your possession.","collocation[2]":"be in possession of something","example[16]":"Before applying for a job, make sure you are in possession of the required qualifications.","collocation[3]":"have something in your possession","example[17]":"My father had in his possession a letter written by Winston Churchill.","collocation[4]":"come into possession of something","example[18]":"How did you come into possession of this document?","collocation[5]":"take possession of something","example[19]":"At 21, he was entitled to take possession of the property.","heading[1]":"– Meaning 2: something that you own or have with you at a particular time","collocation[6]":"somebody's personal possessions","example[20]":"We were told that we could take only a few personal possessions with us.","collocation[7]":"somebody's worldly possessions","example[21]":"Over his shoulder hung a bag which contained all his worldly possessions.","collocation[8]":"material possessions","example[22]":"Many of them have lost all their material possessions as a result of the civil war.","collocation[9]":"a precious possession","example[23]":"A man was salvaging a few precious possessions from the rubble of a bombed house.","collocation[10]":"a prized/treasured possession","example[24]":"One of my most treasured possessions is a small book of prayers.","definition[6]":"something that someone owns","example[25]":"It’s vital to insure your possessions for the journey to your new home.","definition[7]":"the state of having or owning something","example[26]":"What happens if the buyer has possession of a work, but has not completely paid for it when it is stolen?","example[27]":"The creditors will take possession of assets worth the $85 million owed to them.","example[28]":"The company refused to relinquish possession of the 68-bed hospital.","definition[8]":"the crime of having illegal drugs or a gun when it is illegal to do so","example[29]":"He was sentenced to 16 months in prison for cocaine possession."}