{"word[0]":"acknowledge","signpost[0]":"admit","definition[0]":"to admit or accept that something is true or that a situation exists","example[0]":"The family acknowledge the need for change.","example[1]":"Claire acknowledged that she was guilty.","example[2]":"The government must acknowledge what is happening and do something about it.","example[3]":"‘Maybe you are right, ’ she acknowledged.","example[4]":"This is a fact that most smokers readily acknowledge.","example[5]":"He acknowledges that when he’s tired he gets bad-tempered.","note[0]":"acknowledge that","explanation[0]":"In more formal English, you say it is acknowledged that when saying what people generally agree is true","example[6]":"It is acknowledged that these letters are genuine","signpost[1]":"recognize something’s importance","definition[1]":"if people acknowledge something, they recognize how good or important it is","example[7]":"The Brazilian coach acknowledged the talent of his players.","example[8]":"The mill produces what is widely acknowledged to be the finest wool in the world.","note[1]":"be widely/generally acknowledged to be something","example[9]":"The film festival is acknowledged as an event of international importance.","note[2]":"be acknowledged as something","signpost[2]":"accept somebody’s authority","definition[2]":"to accept that someone or something has authority over people","example[10]":"Both defendants refused to acknowledge the authority of the court.","example[11]":"Many of the poor acknowledged him as their spiritual leader.","note[3]":"acknowledge somebody as something","signpost[3]":"thank","definition[3]":"to publicly announce that you are grateful for the help that someone has given you","example[12]":"We wish to acknowledge the support of the university.","signpost[4]":"show you notice somebody","definition[4]":"to show someone that you have noticed them or heard what they have said","example[13]":"Tom acknowledged her presence by a brief glance.","signpost[5]":"say you have received something","definition[5]":"to let someone know that you have received something from them","example[14]":"I would be grateful if you would acknowledge receipt of this letter.","definition[6]":"to tell someone that you have received something such as a letter they have sent to you","example[15]":"We shall be grateful if you will kindly acknowledge receipt of this letter.","definition[7]":"to admit or accept that something is true or exists","example[16]":"The government acknowledged that there had been irregularities at a number of voting centres."}