{"word[0]":"around","definition[0]":"surrounding or on all sides of something or someone","example[0]":"The whole family was sitting around the dinner table.","example[1]":"The Romans built a defensive wall around the city.","example[2]":"She wore a beautiful silk shawl around her shoulders.","example[3]":"People crowded around to see what was happening.","example[4]":"We would hear the birds singing all around us.","definition[1]":"moving in a circle","example[5]":"A helicopter was circling around, looking for somewhere to land.","example[6]":"They danced around the bonfire.","definition[2]":"in or to many places or parts of an area","example[7]":"He wandered around the streets, looking in shop windows.","example[8]":"There are over 40 radio stations dotted around the country.","example[9]":"When I finished college, I travelled around for a while.","example[10]":"Since it’s your first day here, would you like me to show you around?","example[11]":"We started looking around for somewhere to live.","definition[3]":"in an area near a place or person","example[12]":"Is there a bank around here?","example[13]":"When you’ve been around a person long enough, you start to know how they’ll react.","example[14]":"the new housing areas in and around Dublin","example[15]":"Catherine was the most beautiful girl for miles around.","definition[4]":"if someone or something is around, they are somewhere in the place where you are","example[16]":"Why is there never a policeman around when you need one?","example[17]":"Jake went down to the bar, but there was no one around that he knew.","example[18]":"Is your dad around?","example[19]":"The list is somewhere around.","definition[5]":"on the other side of something, or to the other side of it without going through it or over it","synonym[0]":"round","example[20]":"If the gate’s locked, you’ll have to go around the side of the house.","example[21]":"There’s a door around the back.","example[22]":"She ran around the corner and straight into the arms of John Delaney.","definition[6]":"used to say that someone or something turns so that they face in the opposite direction","example[23]":"Rex spun around and kicked the gun from her hand.","example[24]":"Slowly he turned the boat around towards the open sea.","definition[7]":"used when guessing a number, amount, time etc, without being exact","example[25]":"There must have been around 40,000 people in the stadium.","example[26]":"The whole project will probably cost around $3 million.","example[27]":"Most guests started to make their way home around about ten o'clock.","definition[8]":"existing","example[28]":"That joke’s been around for years.","example[29]":"Manson has a reputation as one of the most stylish designers around.","definition[9]":"if something is organized around a particular person or thing, it is organized according to their needs, wishes, ideas etc","example[30]":"Why does everything have to be arranged around what Callum wants to do?","example[31]":"Their whole society was built around their religious beliefs.","definition[10]":"used to show that someone spends time in a place without doing anything useful","example[32]":"I’ve been waiting around all morning.","example[33]":"They could be seen hanging around street corners, watching the girls go by.","definition[11]":"a way around a difficult situation or problem is a way to solve it or avoid it","example[34]":"We must find a way around these difficulties.","example[35]":"The company is expected to get around this problem by borrowing from the banks.","definition[12]":"to other people or positions","example[36]":"Write your name on this list and pass it around.","example[37]":"Someone’s been moving the furniture around.","definition[13]":"used to show the length of a line surrounding something","example[38]":"Redwood trees can measure 30 or 40 feet around."}