{"word[0]":"gender","definition[0]":"the fact of being male or female","example[0]":"people of the same gender","example[1]":"Discrimination on grounds of race or gender is forbidden.","example[2]":"There may be gender differences in attitudes to paid work.","example[3]":"traditional gender roles","example[4]":"gender biases in books","example[5]":"toys that do not reinforce gender stereotypes","example[6]":"a science fiction story dealing with gender issues","definition[1]":"males or females, considered as a group","example[7]":"differences between the genders","definition[2]":"the system in some languages of marking words such as nouns, adjectives, and pronouns as being masculine, feminine, or neuter","definition[3]":"a group such as feminine into which words are divided in this system","form[0]":"gender + NOUN","collocation[0]":"a gender difference","example[8]":"Research has shown that there are gender differences in the way alcohol affects the brain.","collocation[1]":"the gender gap","example[9]":"The gender gap was visible in the way men and women voted during the presidential elections.","collocation[2]":"gender roles","example[10]":"It is a country where gender roles have remained largely unchanged.","collocation[3]":"gender bias/inequality/discrimination","example[11]":"Her research investigates gender bias in the classroom.","collocation[4]":"gender equality","example[12]":"Organizations have a duty to promote gender equality.","collocation[5]":"gender relations","example[13]":"The best way to understand gender relations is to study children.","collocation[6]":"a gender stereotype","example[14]":"The characters in the novel were criticized for being gender stereotypes.","collocation[7]":"gender politics","example[15]":"Much of the discussion of gender politics is rather simplistic.","collocation[8]":"gender issues","example[16]":"Businesses seem to pay more attention to gender issues in senior positions.","collocation[9]":"gender identity","example[17]":"Gender identity refers to our inner feeling of being masculine or feminine.","example[18]":"Discrimination on the grounds of sex, race or gender is illegal."}