{"word[0]":"prove","past_tense[0]":"proved","signpost[0]":"show something is true","definition[0]":"to show that something is true by providing facts, information etc","example[0]":"You’re wrong, and I can prove it.","example[1]":"To prove his point  (=show that he was right), he mentioned several other experiments which had produced similar results.","example[2]":"He claims the police destroyed records that could prove the officer’s guilt.","note[0]":"prove somebody’s guilt/innocence","example[3]":"They say I’m too old, but I’m going to prove them all wrong.","note[1]":"prove somebody wrong/innocent etc","example[4]":"Tests have proved that the system works.","note[2]":"prove (that)","example[5]":"I knew he had done it, but there was no way I could prove it to Eddie.","note[3]":"prove something to somebody","explanation[0]":"You prove something to someone","example[6]":"I will prove to you that I’m right","bad_example[0]":"I will prove you that I’m right","signpost[1]":"be","definition[1]":"if someone or something proves difficult, helpful, a problem etc, they are difficult, helpful, a problem etc","example[7]":"The recent revelations may prove embarrassing to the president.","example[8]":"The design proved to be a success.","note[4]":"prove to be something","explanation[1]":"Prove is a linking verb in this meaning This type of verb links the subject of the sentence with an adjective or noun","example[9]":"The task proved difficult","example[10]":"He has proved a loyal friend","example[11]":"The task proved to be difficult","example[12]":"He has proved to be a loyal friend","signpost[2]":"bread","definition[2]":"if dough (=unbaked bread mixture) proves, it rises and becomes light because of the yeast in it","definition[3]":"to show that a will has been made in the correct way","example[13]":"There was no way she could prove her innocence.","collocation[0]":"prove the existence of something","example[14]":"These pictures do not prove the existence of water on Mars.","collocation[1]":"prove a theory","example[15]":"No evidence emerged to prove either theory.","collocation[2]":"prove your case","example[16]":"The state had failed to prove its case.","collocation[3]":"prove your point","example[17]":"To prove her point, Dr Hurdal showed her audience a scan of a patient’s brain.","collocation[4]":"prove somebody wrong/right","example[18]":"See if you can prove me wrong.","collocation[5]":"prove somebody guilty/innocent","example[19]":"The law states that you are innocent until proved guilty."}