{"definition[0]":"something that is real exists and is important","example[0]":"There is a real danger that the disease might spread.","example[1]":"We need to tackle the real problems of unemployment and poverty.","example[2]":"There is no real reason to worry.","signpost[0]":"not artificial","definition[1]":"something that is real is actually what it seems to be and not false or artificial","example[3]":"a coat made of real fur","example[4]":"She had never seen a real live elephant before.","example[5]":"Artificial flowers can sometimes look better than the real thing.","signpost[1]":"not imaginary","definition[2]":"something that is real actually exists and is not just imagined","example[6]":"The children know that Santa Claus isn’t a real person.","example[7]":"Dreams can sometimes seem very real.","example[8]":"Things don’t happen quite that easily in real life.","signpost[2]":"true","definition[3]":"actual and true, not invented","example[9]":"That’s not her real name.","example[10]":"What was the real reason you quit your job?","definition[4]":"a real feeling or emotion is one that you actually experience and is strong","synonym[0]":"genuine","example[11]":"There was a look of real hatred in her eyes.","example[12]":"I got a real sense of achievement when my work was first published.","signpost[3]":"right qualities","definition[5]":"a real thing has all the qualities you expect something of that type to have","example[13]":"I remember my first real job.","example[14]":"Simon was her first real boyfriend.","signpost[4]":"for emphasis","definition[6]":"used to emphasize how stupid, beautiful, terrible etc someone or something is","example[15]":"Thanks – you’ve been a real help.","example[16]":"The house was a real mess.","definition[7]":"a real increase or decrease in an amount of money is one you calculate by including the general decrease in the value of money over a period of time","example[17]":"a real increase of 6% in average wages","example[18]":"The average value of salaries has fallen in real terms (=calculated in this way).","example[19]":"He’s real cute.","example[20]":"It was real nice to see you again.","definition[8]":"earnings etc that are calculated after including in the calculation the effects of inflation","example[21]":"Their data show that average real earnings of men aged 20-40 in 1987 were lower than in 1974."}