{"definition[0]":"to make someone decide to do something, especially by giving them reasons why they should do it, or asking them many times to do it","example[0]":"He was fairly easily persuaded.","example[1]":"I’m trying to persuade your dad to buy some shares.","note[0]":"try/manage/fail to persuade somebody","example[2]":"Leo wouldn’t agree, despite our efforts to persuade him.","note[1]":"attempt/effort to persuade somebody","example[3]":"He took a lot of persuading to come out of retirement  (=it was hard to persuade him).","note[2]":"little/a lot of/no persuading","example[4]":"I finally managed to persuade her to go out for a drink with me.","note[3]":"persuade somebody to do something","example[5]":"Don’t let yourself be persuaded into buying things you don’t want.","note[4]":"persuade somebody into doing something","definition[1]":"to make someone believe something or feel sure about something","synonym[0]":"convince","example[6]":"I am not persuaded by these arguments.","example[7]":"She’ll only take me back if I can persuade her that I’ve changed.","note[5]":"persuade somebody (that)","example[8]":"McFadden must persuade the jury of her innocence.","note[6]":"persuade somebody of something","example[9]":"I persuaded her to change her mind.","example[10]":"Do you think you can persuade him to lend us the money?","display[0]":"talk somebody into (doing) something","definition[2]":"to persuade someone to do something, especially something they do not really want to do","example[11]":"Why did I let you talk me into this?","example[12]":"He finally talked her into going on a date with him.","display[1]":"get somebody to do something","definition[3]":"to make someone do something by persuading or asking them","example[13]":"If we can’t get a taxi I’ll get Joe to pick us up.","example[14]":"I know how to get you to kiss me.","definition[4]":"to persuade someone that they should do something, because it is the best or the right thing to do. Some British speakers think this use is incorrect, and prefer to use persuade","example[15]":"It would be difficult to convince him to move.","definition[5]":"to try to persuade someone to do something, especially because you think it will be good for them","example[16]":"Children should be encouraged to read all kinds of books.","display[2]":"influence","definition[6]":"to have an effect on what someone decides to do","example[17]":"What influences you to buy clothes?","display[3]":"coax","definition[7]":"to persuade someone to do something by talking gently and kindly","example[18]":"I tried to coax him to eat a little.","display[4]":"cajole","definition[8]":"to persuade someone to do something by praising them or making promises to them","example[19]":"He hoped to cajole her into selling her house.","display[5]":"put somebody up to something","definition[9]":"to persuade or encourage someone to do something wrong or stupid","example[20]":"Who put you up to this?","display[6]":"dissuade","definition[10]":"to persuade someone not to do something","example[21]":"How do you dissuade young people from experimenting with drugs?"}