{"word[0]":"bent","definition[0]":"the past tense and past participle of bend","definition[1]":"no longer straight","example[0]":"a bent nail","example[1]":"Stand with your knees slightly bent.","example[2]":"He breathed in deeply, bent double in pain  (=with the top part of your body leaning forward towards your legs).","example[3]":"a bent old man  (=not standing straight)","definition[2]":"financially dishonest and willing to use your official position unfairly","example[4]":"a bent policeman","definition[3]":"an insulting word meaning homosexual","example[5]":"The knife was bent in the middle.","example[6]":"She kept her head bent so that Josie couldn’t see her face.","display[0]":"twisted","definition[4]":"having a bent shape that turns around – used especially when something has been damaged or is old and has lost its natural straight shape","example[7]":"a twisted tree trunk","example[8]":"All that was left was a pile of twisted metal.","example[9]":"His knee was all twisted.","example[10]":"a twisted ankle","display[1]":"curved","definition[5]":"bent in the shape of part of a circle, especially naturally or because something has been made that way","example[11]":"The bird has a long curved bill.","example[12]":"a curved dagger","example[13]":"The plane’s wings are curved.","display[2]":"warped","definition[6]":"bent or twisted into the wrong shape because of heat or dryness","example[14]":"warped floorboards","example[15]":"The windows are warped and won’t open anymore.","display[3]":"crooked","definition[7]":"not straight, but bending sharply in one or more places, especially in a way that looks different from normal or does not look right – often used about a part of someone’s body, a path, or a picture","example[16]":"He had crooked teeth.","example[17]":"her crooked nose and long thin face","example[18]":"The boys at school used to make fun of me because I have a crooked spine.","example[19]":"The picture looks crooked - can you move it up on the left?","example[20]":"a crooked path","example[21]":"the narrow crooked streets of the financial district","display[4]":"wavy","definition[8]":"having smooth bends in it, usually in a regular pattern – used about hair or lines","example[22]":"her brown wavy hair","example[23]":"The pictures were separated by a thin wavy line.","definition[9]":"special natural skill or interest in a particular area","example[24]":"readers of a more literary bent","note[0]":"musical/artistic/literary etc bent","definition[10]":"financially dishonest","example[25]":"a bent accountant"}