{"word[0]":"misunderstanding","definition[0]":"a problem caused by someone not understanding a question, situation, or instruction correctly","example[0]":"There must have been some misunderstanding. I didn’t order all these books.","definition[1]":"an argument or disagreement that is not very serious – often used humorously","example[1]":"Terry had a little misunderstanding with the police last night.","collocation[0]":"avoid a misunderstanding","example[2]":"State clearly what you expect, to avoid misunderstandings later on.","collocation[1]":"cause/lead to a misunderstanding","example[3]":"Hearing loss can cause misunderstandings, when what you say is not correctly heard.","example[4]":"Don’t just assume that you know what he means; that can lead to misunderstandings.","collocation[2]":"a misunderstanding arises","example[5]":"Misunderstandings can easily arise when people from different cultures meet.","collocation[3]":"clear up/correct a misunderstanding","example[6]":"I want to talk to you, to try and clear up any misunderstandings.","collocation[4]":"be based on a misunderstanding","example[7]":"The whole argument was based on a misunderstanding.","collocation[5]":"there has been a misunderstanding","example[8]":"There’s been a misunderstanding about what I meant.","collocation[6]":"there must be some misunderstanding","example[9]":"I think there must be some misunderstanding - I don’t know anyone called Barry.","collocation[7]":"there is no misunderstanding","example[10]":"I am writing to make sure there is no misunderstanding between us.","collocation[8]":"something is all a misunderstanding","example[11]":"Why don’t you call him and tell him it was all a misunderstanding?","collocation[9]":"a bit of a misunderstanding","example[12]":"I’m afraid it’s all a bit of a misunderstanding.","collocation[10]":"a serious/terrible misunderstanding","example[13]":"There have been some serious misunderstandings which have led to conflict.","collocation[11]":"a little misunderstanding","example[14]":"We need to clear up this little misunderstanding.","collocation[12]":"a simple misunderstanding","example[15]":"It was a simple misunderstanding: I thought the meeting was on Wednesday, not Thursday.","collocation[13]":"a complete/total misunderstanding","example[16]":"There seems to be a complete misunderstanding of how the changes will affect us.","collocation[14]":"a fundamental misunderstanding","example[17]":"a fundamental misunderstanding of Freud’s theories","collocation[15]":"a widespread misunderstanding","example[18]":"There is a widespread misunderstanding of the purpose of the law.","collocation[16]":"a cultural misunderstanding","example[19]":"Cultural misunderstandings have led to fights between students."}