{"signpost[0]":"on a surface","definition[0]":"touching a surface or being supported by a surface","example[0]":"Leave your things on the table over there.","example[1]":"People were sunbathing on the grass.","example[2]":"The little girl was sitting on her father’s shoulders.","definition[1]":"used to say that someone or something moves so that they are then touching or supported by a surface","example[3]":"snow falling on the mountainsides","example[4]":"He threw himself on the bed.","signpost[1]":"supporting your body","definition[2]":"used to say what part of someone’s body is touching the ground or another surface and supporting their weight","example[5]":"She was on her feet in no time.","example[6]":"He was on his hands and knees searching for something.","example[7]":"Can you stand on your head?","signpost[2]":"part hit/touched","definition[3]":"used to say what part of someone or something is hit or touched","example[8]":"I wanted to punch him on the nose.","example[9]":"Matt kissed her on the cheek.","signpost[3]":"written/shown","definition[4]":"used to say where something is written or shown","example[10]":"There’s a diagram on page 25.","example[11]":"He wrote his phone number on a piece of paper.","signpost[4]":"attached","definition[5]":"attached to or hanging from something","example[12]":"She hung her coat on a hook.","example[13]":"Dogs must be kept on a lead at all times.","definition[6]":"in a particular place","example[14]":"The town is right on the border.","example[15]":"Is there a water supply on the island?","example[16]":"He grew up on a ranch in California.","example[17]":"a store on Fifth Avenue","definition[7]":"in a particular position in relation to something else","example[18]":"You’ll see the school on your left.","example[19]":"They live on the opposite side of the town.","signpost[5]":"looking/pointing","definition[8]":"looking or pointing towards something or someone","example[20]":"His eyes were on the stranger standing in the doorway.","example[21]":"She trained her binoculars on the house.","signpost[6]":"day/date","definition[9]":"during a particular day","example[22]":"They’ll be here on Tuesday.","example[23]":"I was born on July 1st.","example[24]":"We’ll see you on Christmas Eve.","explanation[0]":"Don’t use on before ‘this’, ‘last’, or ‘next’ and a day of the week You say","example[25]":"Term starts this Monday ","example[26]":"It was my birthday last Friday","bad_example[0]":"on this Monday","bad_example[1]":"on last Friday","signpost[7]":"affecting/relating to","definition[10]":"affecting or relating to someone or something","example[27]":"a tax on cigarettes","example[28]":"his influence on young people","example[29]":"There will be new restrictions on the sale of weapons.","example[30]":"What effect will these changes have on the tourist industry?","definition[11]":"about a particular subject","example[31]":"Do you have any books on India?","example[32]":"You can get information on local services by calling this number.","example[33]":"an international conference on global warming","signpost[8]":"orders/advice","definition[12]":"as a result of someone’s order, request, or advice","example[34]":"He was killed on the King’s orders.","example[35]":"I accepted the offer on the advice of my lawyer.","signpost[9]":"eat/drink","definition[13]":"used to talk about what someone usually eats or drinks","example[36]":"They live mainly on beans, lentils, and rice.","example[37]":"Is your baby on solid food yet?","signpost[10]":"transport","definition[14]":"in or into a bus, train, plane etc","example[38]":"Did you manage to sleep on the plane?","example[39]":"Tommy should be on the six o’clock train.","example[40]":"She got on the first bus that came along.","definition[15]":"riding something","example[41]":"a statue of the King on horseback","example[42]":"I’ll probably come on my bike.","definition[16]":"receiving money for a job or as a regular payment","example[43]":"He’s on quite a good salary now.","example[44]":"She must be on at least £50,000 a year.","example[45]":"the difficulties faced by families on low incomes","signpost[11]":"fuel","definition[17]":"using a particular type of fuel or power","example[46]":"Most buses run on diesel.","example[47]":"Does it work on mains electricity?","signpost[12]":"medicine/drugs","definition[18]":"taking a particular drug or medicine regularly","opposite[0]":"off","example[48]":"Are you still on antibiotics?","example[49]":"The doctor put her on Prozac.","example[50]":"A lot of these kids are on heroin by the age of 12.","signpost[13]":"using equipment","definition[19]":"using a machine or piece of equipment","example[51]":"He’s been on the computer all afternoon.","example[52]":"Is Rachel still on the phone?","signpost[14]":"musical instruments","definition[20]":"playing a musical instrument","example[53]":"He played a short piece on the piano.","example[54]":"The album features Rick Wakeman on keyboards.","signpost[15]":"radio/television","definition[21]":"being broadcast by radio or television","example[55]":"What’s on TV tonight?","example[56]":"Did you hear that programme on the radio last night?","signpost[16]":"recorded","definition[22]":"used to say in what form information is stored or music, films etc are recorded","example[57]":"The movie is now available on video and DVD.","example[58]":"I always keep a backup copy on disk.","signpost[17]":"activity/journey","definition[23]":"taking part in an activity or travelling somewhere","example[59]":"She’s on a course all this week.","example[60]":"I met him on vacation in Canada.","example[61]":"My girlfriend is often away on business trips.","signpost[18]":"included","definition[24]":"included in a group or team of people or in a list","example[62]":"Are you still on the management committee?","example[63]":"Mr Edwards is no longer on the staff here.","example[64]":"Whose team are you on?","example[65]":"There was no steak on the menu.","example[66]":"What’s the next item on the agenda?","signpost[19]":"when something happens","definition[25]":"as soon as someone has done something or as soon as something has happened","example[67]":"Couples are presented with a bottle of wine on their arrival at the hotel.","example[68]":"All patients are examined on admission to the hospital.","example[69]":"What was your reaction on seeing him?","note[0]":"on doing something","signpost[20]":"compared with something","definition[26]":"compared with another person or thing","example[70]":"This essay is a definite improvement on your last one.","example[71]":"Sales are 10% up on last year.","signpost[21]":"carrying something","definition[27]":"if you have something on you, you have it in your pocket, your bag etc","example[72]":"I don’t have any money on me.","signpost[22]":"telephone number","definition[28]":"used to say what number you should use in order to telephone someone","example[73]":"You can contact me on this number.","signpost[23]":"causing somebody problems","definition[29]":"used when something bad happens to you, for example when something you are using suddenly stops working, or someone you have a relationship with suddenly leaves you","example[74]":"Suddenly the telephone went dead on me.","example[75]":"Dorothy’s first husband walked out on her.","signpost[24]":"continuing","definition[30]":"used to say that someone continues to do something or something continues to happen, without stopping","example[76]":"We decided to play on even though it was snowing.","example[77]":"He went on and on (=talked for a very long time) about his job all evening.","signpost[25]":"further","definition[31]":"if you move, walk etc on, you move forward or further towards something","example[78]":"If you walk on a little, you can see the coast.","example[79]":"We drove on towards Manchester.","signpost[26]":"later","definition[32]":"later than or after a particular time","example[80]":"Now, 40 years on, this is one of the most successful theatres in the country.","example[81]":"From that moment on I never believed a word she said.","signpost[27]":"wearing something","definition[33]":"if you have something on, you are wearing it","example[82]":"All he had on was a pair of tattered shorts.","example[83]":"Put your coat on. It’s freezing outside.","definition[34]":"used to say that something is attached to something else, especially when it is in the correct position","example[84]":"Is the cover on properly?","example[85]":"Remember to put the lid back on.","signpost[28]":"written","definition[35]":"used to say that something is written somewhere","example[86]":"He was wearing a badge with his name on.","definition[36]":"in or into a bus, train etc","example[87]":"The train stopped and two people got on.","signpost[29]":"light/machine","definition[37]":"if a machine, light etc is on, it is operating","example[88]":"Who left all the lights on?","example[89]":"The TV’s on, but nobody seems to be watching it.","example[90]":"He sat down at the desk and switched on the computer.","signpost[30]":"being broadcast","definition[38]":"if a radio or television programme etc is on, it is being broadcast","example[91]":"What time is ‘Star Trek’ on?","signpost[31]":"events","definition[39]":"if an event is on, it has been arranged and is happening or will happen","example[92]":"The transport union has confirmed that the strike is definitely on.","example[93]":"I’d avoid the city centre – there’s some kind of procession on.","example[94]":"Is the party still on tonight or have they cancelled it?","signpost[32]":"performing/speaking","definition[40]":"performing or speaking in public","example[95]":"You’re on in two minutes.","signpost[33]":"working","definition[41]":"if you are on at a particular time, you are doing your job at that time","example[96]":"I’m not on again until two o'clock tomorrow."}