{"word[0]":"way","definition[0]":"a method that you use to do or achieve something","example[0]":"There are several different ways we can tackle this problem.","example[1]":"Make the drink with boiling water in the same way as tea.","note[0]":"in the same way/in various ways","example[2]":"Animals communicate in various ways.","example[3]":"I think you’re going about this the wrong way.","note[1]":"(in) the right/wrong way","example[4]":"There are ways and means of raising the money that we need.","note[2]":"ways and means","example[5]":"companies eager for a way into business in Europe","note[3]":"way into television/publishing/finance etc","example[6]":"Evening classes are one way of meeting new people.","note[4]":"way of doing something","example[7]":"There’s no way of knowing if the treatment will work.","example[8]":"What’s the best way to learn a language?","note[5]":"way to do something","example[9]":"One way around the problem  (=method of dealing with it) is recycling.","note[6]":"way out/out of/around","example[10]":"There seems to be no way out of the current economic crisis.","signpost[0]":"manner","definition[1]":"the manner or style in which someone does something or in which something happens","example[11]":"Look at the way he’s dressed!","example[12]":"The drugs didn’t seem to affect Anna in the same way.","example[13]":"I find it easier to work in this way  (=like this).","note[7]":"(in) this/that way","example[14]":"Sorry, I didn’t know you felt that way  (=had that feeling or opinion).","example[15]":"That’s no way to speak to your father!","note[8]":"that’s no way to do something","example[16]":"The changes will benefit the company in more ways than one.","note[9]":"in more ways than one","example[17]":"I’m sure he does love you, in his own way.","note[10]":"in somebody’s (own) way","example[18]":"‘Hello, ’ he said in a friendly way.","note[11]":"in a ... way","example[19]":"Maria got up and took a shower in a leisurely way.","signpost[1]":"direction/how to go somewhere","definition[2]":"a road, path, direction etc that you take in order to get to a particular place","example[20]":"Does anyone know the way from here?","example[21]":"I was afraid of losing my way in the dark.","example[22]":"Can you find your way back to the car park?","example[23]":"Which is the quickest way to the sea from here?","note[12]":"the way to/from/out etc","example[24]":"There are several ways through the woods.","example[25]":"Could you tell me the way to the station?","note[13]":"ask/tell/show somebody the way","example[26]":"Which is the way out?","note[14]":"the way out","example[27]":"She looked all around, but she couldn’t seem to find the way in.","note[15]":"the way in","example[28]":"Want a lift? It’s on my way.","note[16]":"on somebody’s way","example[29]":"I live miles out of your way.","note[17]":"out of somebody’s way","definition[3]":"a particular direction from where you are now","example[30]":"Which way is north?","example[31]":"Walk this way.","example[32]":"A big Mercedes was coming the other way (=from the opposite direction).","example[33]":"He left the house, looking carefully both ways.","signpost[2]":"part of something that is true","definition[4]":"used to say that there is a fact or a feature of something that makes a statement or description true","example[34]":"Ben is a perfectly normal child in every way.","example[35]":"He never got mad at me. He was great in that way.","example[36]":"In one way you’re right, I suppose.","note[18]":"in a/one way","example[37]":"Working at home makes sense, in many ways.","note[19]":"in some/many ways","example[38]":"This should in no way be seen as a defeat.","note[20]":"in no way","signpost[3]":"distance/time","definition[5]":"a distance or a length of time, especially a long one","example[39]":"I was still a long way from home.","example[40]":"I don’t want to go all that way and not see him.","example[41]":"She had to park some way from the restaurant.","note[21]":"some way/quite a way","example[42]":"A peace settlement now seems a long way off.","note[22]":"a long way off/away/ahead etc","example[43]":"Did you really swim all the way across?","note[23]":"all the way down/across/through etc (something)","example[44]":"I was awake all through the night.","example[45]":"That’s quite a ways from here, isn’t it?","note[24]":"a (long) ways","signpost[4]":"the space in front of you","definition[6]":"if someone or something is in the way, they are blocking the space in front of you, and you cannot move forward","example[46]":"A policeman yelled at the crowds to get out of the way.","example[47]":"The way ahead was blocked.","example[48]":"There was a big truck in the way.","note[25]":"be in the way/be in somebody’s way","example[49]":"Sorry, am I in your way?","signpost[5]":"state/condition","definition[7]":"a particular state or condition","example[50]":"My family was in a bad way financially.","example[51]":"The chicken’s nice and crispy – just the way I like it.","example[52]":"It’s worth thinking how you can improve the way things are.","example[53]":"He’ll always be mean – he was born that way.","note[26]":"somebody was born/made that way","signpost[6]":"fact/event","definition[8]":"used to refer to something that happens","example[54]":"I hate the way you always give in to him.","definition[9]":"someone’s typical style of behaving, especially when it seems different or unusual","note[27]":"change/mend your ways (=stop behaving badly)","example[55]":"Esther quickly changed the subject, as was her way.","example[56]":"We all have our funny little ways.","note[28]":"strange/funny/odd etc ways","example[57]":"Don’t worry if she’s quiet – that’s just her way.","note[29]":"be (just) somebody’s way","signpost[7]":"development/progress","definition[10]":"used in expressions about developing and improving","example[58]":"The team has a long way to go (=needs to develop or improve a lot) before it can match that performance.","example[59]":"Microwave ovens have come a long way (=have developed or improved a lot) since they first appeared in our kitchens.","example[60]":"Jen is now well on the way to recovery  (=she has improved and will be well soon).","signpost[8]":"choices/possibilities","definition[11]":"used when talking about two choices someone could make, or two possibilities that could happen","example[61]":"I’m not sure which way he’ll decide.","example[62]":"The election could go either way (=both results are equally possible).","example[63]":"Make your mind up one way or the other.","example[64]":"Either way, it’s going to be expensive.","note[30]":"either way","heading[0]":"– Meaning 1: a method that you use to do or achieve something","collocation[0]":"the right way","example[65]":"That’s not the right way to deal with the problem.","collocation[1]":"the wrong way","example[66]":"There is a right way and a wrong way to do it.","collocation[2]":"a good way","example[67]":"Parent and toddler groups are a good way to meet other mums.","collocation[3]":"the best way","example[68]":"Doing the job is often regarded as the best way of learning the job.","collocation[4]":"a different way","example[69]":"There are many different ways of borrowing money.","collocation[5]":"a sure way","example[70]":"Improving your diet is the surest way to lower your risk of heart disease.","collocation[6]":"a quick way","example[71]":"Wouldn’t just asking him be the quickest way to find out?","collocation[7]":"an easy way","example[72]":"Here’s an easy way to cut up a mango.","collocation[8]":"have a way","example[73]":"Do you have any way of finding out if that is true?","collocation[9]":"find a way","example[74]":"We must find a way to help them.","collocation[10]":"think of/devise a way","example[75]":"I have to think of a way to make some money.","example[76]":"We are discussing ways and means of bringing jobs to our area.","heading[1]":"– Meaning 3:","collocation[11]":"the quickest way","example[77]":"She knew the quickest way to the hospital.","example[78]":"Are you sure this is the right way?","example[79]":"He had ended up going the wrong way down a one-way street.","collocation[12]":"ask somebody the way","example[80]":"He asked me the way to the police station.","collocation[13]":"tell somebody the way","example[81]":"Can you tell me the way to the nearest post office, please?","collocation[14]":"show somebody the way","example[82]":"If you can show me the way, I’ll take you by car.","collocation[15]":"know the way","example[83]":"Do you know the way to Birkleigh?","collocation[16]":"lose your way","example[84]":"He lost his way in the fog.","collocation[17]":"find your way","example[85]":"I managed to find my way home.","heading[2]":"a way of doing something","definition[12]":"something you can do in order to achieve what you want or deal with a problem","example[86]":"Visiting a country is a great way to learn a language.","example[87]":"a good way to lose weight","definition[13]":"a way of doing something, especially one that a lot of people know about and use","example[88]":"They still use traditional methods of farming.","example[89]":"modern teaching methods","example[90]":"Different research methods are used to gather data.","display[0]":"approach","definition[14]":"a general way of dealing with a particular problem or situation, especially a way that has been carefully thought about","example[91]":"We need a whole new approach to environmental issues.","example[92]":"There will be considerable advantages to adopting this approach.","display[1]":"technique","definition[15]":"a way of doing something for which you need a skill that must be learned and practised","example[93]":"I went to a class to learn relaxation techniques.","example[94]":"new surgical techniques","example[95]":"techniques for improving staff performance","display[2]":"strategy","definition[16]":"a carefully planned way to achieve something difficult or complicated that may take a long time","example[96]":"They met to discuss the company’s business strategy.","example[97]":"the government’s long-term strategy for reducing crime","heading[3]":"how to go to a place","definition[17]":"the road, path, direction etc that you must take in order to get to a place","example[98]":"Are you sure this is the right way to the sea?","example[99]":"Will you come with me? I don’t know the way.","display[3]":"route","definition[18]":"a way from one place to another that people use regularly or that is shown on a map","example[100]":"There are two routes we could take but this is the quickest one.","example[101]":"the overland trade route between Europe and China","display[4]":"directions","definition[19]":"instructions on how to get to a place","example[102]":"Let’s stop and ask someone for directions.","example[103]":"If you follow these directions you’ll have no problem finding the house.","display[5]":"short cut","definition[20]":"a way of getting somewhere that is shorter than the usual way","example[104]":"Let’s take a short cut across the field.","example[105]":"Taxi-drivers know all the short cuts.","display[6]":"how to get to ...","definition[21]":"used especially when you ask someone to tell you which is the right way","example[106]":"Can you tell me how to get to Grand Central Station?","example[107]":"It was getting dark and I wasn’t sure how to get home.","definition[22]":"used in the names of roads","example[108]":"Church Way","definition[23]":"very far","example[109]":"The other cyclists were way behind.","note[31]":"way ahead/behind/out etc","example[110]":"She lives way out of town.","definition[24]":"by a large amount","example[111]":"The tickets were way more expensive than I thought.","note[32]":"way heavier/smarter/bigger etc","example[112]":"Her IQ is way above average.","note[33]":"way above/below/past etc","example[113]":"Your guess was way out  (=completely incorrect), he’s actually thirty-eight.","note[34]":"way out","example[114]":"We first met way back  (=a long time ago) in the seventies.","note[35]":"way back","example[115]":"I think she’s way cool, man."}