{"word[0]":"into","signpost[0]":"to the inside of something","definition[0]":"to the inside or inner part of a container, place, area etc","example[0]":"Come into the office.","example[1]":"He thrust his hand into his coat pocket.","example[2]":"There must be another way into the cave.","example[3]":"Sue got back into bed and pulled the quilt over her head.","example[4]":"I’ve got to go into town this morning.","example[5]":"We dived into the sea.","signpost[1]":"becoming involved","definition[1]":"used to say that someone becomes involved in a situation or activity, or becomes part of a group","example[6]":"At the age of 16, I went into the printing trade as an apprentice.","example[7]":"They tried to drag me into their quarrel.","example[8]":"a player who deserves to get back into the England team","signpost[2]":"changing","definition[2]":"used to say that someone or something starts being in a different state or form","example[9]":"She fell into a deep sleep.","example[10]":"The whole banking system was thrown into confusion.","example[11]":"I screwed my wet handkerchief into a ball.","example[12]":"Cut the cake into pieces.","example[13]":"Neruda’s poems have been translated into English.","signpost[3]":"hitting something","definition[3]":"used to say that a person or vehicle hits someone or something after moving towards them","example[14]":"He almost bumped into me as he rushed past.","example[15]":"The car swerved and crashed into the wall.","definition[4]":"in a particular direction","example[16]":"They rode off into the sunset.","example[17]":"Make sure you’re speaking directly into the microphone.","definition[5]":"at or until a certain time","example[18]":"Andy and I talked well into the night.","example[19]":"John was well into his forties before he got married.","signpost[4]":"finding out","definition[6]":"used to say what someone is trying to find out information about","example[20]":"an investigation into the events leading up to his death","example[21]":"I’ve been doing some research into this.","signpost[5]":"dividing numbers","definition[7]":"used when you are dividing one number by another","example[22]":"Eight into twenty-four is three."}