{"word[0]":"out","signpost[0]":"from inside","definition[0]":"from inside an object, container, building, or place","opposite[0]":"in","example[0]":"She opened her suitcase and took out a pair of shoes.","example[1]":"Lock the door on your way out.","example[2]":"Charlotte went to the window and looked out.","example[3]":"Out you go (=used to order someone to leave a room)!","example[4]":"The egg cracked open and out came a baby chick.","note[0]":"out came/jumped etc","example[5]":"The keys must have fallen out of my pocket.","example[6]":"Get out of here!","example[7]":"Someone had torn several pages out of her diary.","example[8]":"I don’t think I’d have the courage to jump out of a plane.","example[9]":"All the roads out of the city were snowbound.","definition[1]":"not inside a building","example[10]":"Many of the homeless have been sleeping out for years.","example[11]":"Children were out playing in the snow.","example[12]":"Brrr, it’s cold out there.","signpost[1]":"not at home","definition[2]":"away from your home, office etc, especially for a short time","example[13]":"Did anyone call while I was out?","example[14]":"My parents are both out at the moment.","example[15]":"He went out at 11 o'clock.","definition[3]":"to or in a place that is not your home, in order to enjoy yourself","example[16]":"You should get out and meet people.","example[17]":"Let’s eat out tonight  (=eat in a restaurant).","example[18]":"At first he was too shy to ask her out.","example[19]":"Most teenagers would rather be out and about with their friends.","note[1]":"be/get out and about","signpost[2]":"distant place","definition[4]":"in or to a place that is far away or difficult to get to","example[20]":"He went out to New Zealand.","example[21]":"They’ve rented a farmhouse right out in the country.","definition[5]":"used to say how far away something is","example[22]":"The Astra Satellite is travelling some 23,000 miles out in space.","example[23]":"a little village about five miles out of Birmingham","signpost[3]":"given to many people","definition[6]":"used to say that something is given to many people","example[24]":"The examination will start when all the question papers have been handed out.","example[25]":"Have you sent out the invitations yet?","signpost[4]":"get rid of something","definition[7]":"used to say that someone gets rid of something or makes it disappear","example[26]":"Have you thrown out yesterday’s paper?","example[27]":"Mother used washing soda to get the stains out.","signpost[5]":"not burning/shining","definition[8]":"a fire or light that is out is no longer burning or shining","example[28]":"Turn the lights out when you go to bed.","example[29]":"The firefighters arrived, and within minutes the fire was out.","signpost[6]":"sun/moon etc","definition[9]":"if the sun, moon, or stars are out, they have appeared in the sky","example[30]":"When the sun came out, a rainbow formed in the sky.","signpost[7]":"flowers","definition[10]":"if the flowers on a plant are out, they have opened","example[31]":"It’s still February and already the primroses are out.","signpost[8]":"completely/carefully","definition[11]":"used to say that something is done carefully or completely","example[32]":"I spent all morning cleaning out the kitchen cupboards.","example[33]":"In the summer months the soil dries out quickly.","signpost[9]":"not included","definition[12]":"not included in a team, group, competition etc","example[34]":"The Welsh team was surprisingly knocked out in the semi-finals.","example[35]":"Daniels will be out of the team until he recovers from his injury.","signpost[10]":"come from something","definition[13]":"used to say where something comes from or is taken from","example[36]":"A lot of good music came out of the hippy culture in the 1960s.","example[37]":"The money is automatically taken out of your bank account every month.","signpost[11]":"away from the edge of something","definition[14]":"away from the main part or edge of something","example[38]":"I swam out into the middle of the lake.","example[39]":"A long peninsula juts out into the sea.","example[40]":"She stuck her head out of the window to see what was happening.","signpost[12]":"not working","definition[15]":"if a machine, piece of equipment etc is out, it is not working","example[41]":"I don’t believe it – the elevator’s out again!","definition[16]":"used to say that a product is available to be bought","example[42]":"Is the new Harry Potter book out yet?","example[43]":"Sony have brought out a new portable music system.","signpost[13]":"not in a situation","definition[17]":"no longer in a particular state or situation","example[44]":"She’s not completely cured, but at least she’s out of danger.","example[45]":"This whole situation is getting out of control.","example[46]":"How long have you been out of work now?","example[47]":"Karen waved until the car was out of sight (=too far away to be seen).","signpost[14]":"having left an institution","definition[18]":"having left the institution where you were","example[48]":"a kid just out of college","example[49]":"His wife isn’t out of hospital yet.","definition[19]":"no longer in prison","example[50]":"Once he was out, he returned to a life of crime.","signpost[15]":"not fashionable","definition[20]":"no longer fashionable","example[51]":"You can’t wear that – maxi skirts have been out for years.","signpost[16]":"not secret","definition[21]":"no longer a secret","example[52]":"Her secret was out.","example[53]":"The word’s out that Mel Gibson is in town.","example[54]":"Eventually the truth came out.","signpost[17]":"unconscious","definition[22]":"not conscious","example[55]":"She fainted – she was out for about ten minutes.","example[56]":"How hard did you hit him? He’s out cold.","signpost[18]":"none left","definition[23]":"used to say that there is none of something left because you have used it all, sold it all etc","example[57]":"The album was sold out within minutes.","example[58]":"We’re out of milk.","example[59]":"They’ve run out of ideas.","signpost[19]":"not correct","definition[24]":"if a measurement, result etc is out, it is wrong because the numbers have not been calculated correctly","example[60]":"He was out in his calculations, so there was a lot of carpet left over.","example[61]":"The bill was out by over £10.","example[62]":"Their forecast was way out.","signpost[20]":"not in power","definition[25]":"used to say that someone, especially a political party, no longer has power or authority","example[63]":"It’s time we voted the Republicans out.","example[64]":"The party has been out of office for a long time.","signpost[21]":"on strike","definition[26]":"used to say that someone has stopped working as a way of protesting about something","example[65]":"The railway workers have come out in sympathy with the miners.","signpost[22]":"homosexual","definition[27]":"if a homosexual is out, they have told people that they are homosexual","signpost[23]":"not possible","definition[28]":"if a particular suggestion or activity is out, it is not possible","example[66]":"We don’t have enough money to rent a car, so that’s out.","signpost[24]":"sea","definition[29]":"when the tide is out, the sea by the shore is at its lowest level","example[67]":"You can walk across the sands when the tide is out.","definition[30]":"a player or team that is out in a game such as cricket  or baseball is no longer allowed to bat","example[68]":"Sussex were all out for 365.","definition[31]":"a ball that is out in a game such as tennis or basketball  is not in the area of play","definition[32]":"because of a particular feeling that you have","example[69]":"They obeyed him out of fear rather than respect.","example[70]":"Just out of curiosity, why did you take that job?","signpost[25]":"made of something","definition[33]":"used to say what substance or materials a particular thing is made of","example[71]":"a tombstone carved out of black marble","example[72]":"toy boats made out of old tin cans","signpost[26]":"how many of a group","definition[34]":"used to say how common something is, or how large a part of a group you are talking about","example[73]":"Apparently they’ve lost three games out of seven already.","example[74]":"Nine out of ten students pass the test first time.","note[2]":"nine out of ten/three out of four etc","definition[35]":"from the inside to the outside of something – many teachers of British English consider it incorrect to use ‘out’ as a preposition","example[75]":"Karen looked out the window at the back yard.","example[76]":"Get out the car and push with the rest of us!","definition[36]":"to publicly say that someone is homosexual when that person would prefer to keep it secret","example[77]":"Several politicians have been outed in recent months.","explanation[0]":"Out is usually passive in this meaning","definition[37]":"to let the public know a fact about someone that they would prefer to keep secret","example[78]":"He was outed as a supporter of the far-right party.","note[3]":"out somebody as something","definition[38]":"an excuse to avoid doing an activity or to avoid being blamed for something","example[79]":"I’m busy on Sunday, so that gives me an out.","definition[39]":"an act of making a player in baseball lose the chance to score a point","definition[40]":"used to form nouns and adjectives from verbs that are followed by ‘out’","example[80]":"an outbreak of flu  (=from ‘break out’)","example[81]":"outspoken comments  (=from ‘speak out’)","type[0]":"in nouns and adjectives","definition[41]":"outside or beyond something","example[82]":"an outbuilding  (=small building away from the main building)","example[83]":"outlying areas  (=far from the centre)","type[1]":"in verbs","definition[42]":"being or becoming bigger, further, greater etc than someone or something else","example[84]":"He’s outgrown his clothes  (=become too big for them).","example[85]":"She outlived her brother  (=he died before her).","definition[43]":"doing better than someone, so that you defeat them","example[86]":"I can out-argue you any day.","example[87]":"She outran him.","definition[44]":"available to be bought","example[88]":"His new book is due out next spring.","example[89]":"The company plans to bring out a similar product of its own.","definition[45]":"if the workers in a company, factory etc are out, they are refusing to work","synonym[0]":"ON STRIKE","example[90]":"Teachers in some places stayed out on strike for weeks against the orders of their unions.","definition[46]":"if a worker is out or out sick, they are not at work because they are sick","example[91]":"Ralph’s been out sick four times this month already.","definition[47]":"if a machine is out, it is not working","definition[48]":"if your accounts, calculations etc are out, they are wrong"}