{"word[0]":"potential","definition[0]":"likely to develop into a particular type of person or thing in the future","synonym[0]":"possible","example[0]":"new ways of attracting potential customers","note[0]":"potential customer/buyer/client","example[1]":"the potential benefits of the new system","note[1]":"potential benefit/problem","example[2]":"the potential risks to health associated with the drug","note[2]":"potential danger/threat/risk","collocation[0]":"a potential customer/buyer/client","example[3]":"Advertisers want to reach as many potential customers as possible.","collocation[1]":"a potential candidate","example[4]":"Party leaders have put together a list of 10 potential candidates.","collocation[2]":"a potential problem","example[5]":"There is a potential problem with the new equipment.","collocation[3]":"a potential danger/threat/risk","example[6]":"Tired drivers are a potential danger to other road users.","collocation[4]":"potential conflict","example[7]":"Funding is an area of potential conflict between the two departments.","collocation[5]":"a potential benefit","example[8]":"The potential benefits must be weighed up against the costs involved.","collocation[6]":"a potential source of something","example[9]":"A dirty kitchen is a potential source of infection.","definition[1]":"the possibility that something will develop in a particular way, or have a particular effect","example[10]":"The company certainly has the potential for growth.","note[3]":"potential for","example[11]":"the potential of the Internet to create jobs","note[4]":"potential of","definition[2]":"if people or things have potential, they have a natural ability or quality that could develop to make them very good","note[5]":"achieve/fulfil/realize your (full) potential (=succeed as well as you possibly can)","example[12]":"She has the potential to become a champion.","note[6]":"have/show potential","example[13]":"a young player with great potential","note[7]":"with potential","definition[3]":"the difference in voltage between two points on an electrical circuit","heading[0]":"– Meaning 2: if people or things have potential, they have a natural ability or quality that could develop to make them very good","collocation[7]":"have potential","example[14]":"When he saw I had some potential, he gave me extra coaching.","collocation[8]":"show potential","example[15]":"Nicholson soon showed great potential as an actor.","collocation[9]":"develop your potential","example[16]":"A good school aims to enable pupils to develop their potential.","collocation[10]":"achieve/fulfil/reach/realize your potential","example[17]":"A lot of athletes find it difficult to achieve their potential.","collocation[11]":"exploit somebody’s/something’s potential","example[18]":"Until now, the island has not exploited its potential as a tourist destination.","collocation[12]":"unlock/unleash somebody’s potential","example[19]":"Training is a way of unlocking the potential of the workforce.","form[0]":"ADJECTIVES/NOUN + potential","collocation[13]":"great/enormous/considerable potential","example[20]":"This is a team with great potential.","collocation[14]":"somebody’s full potential","example[21]":"We continuously seek to develop people to their full potential.","collocation[15]":"somebody’s true potential","example[22]":"Malaysia only showed glimpses of their true potential in the final stages of the tournament.","collocation[16]":"commercial/economic potential","example[23]":"They were quick to recognize the band’s commercial potential.","collocation[17]":"leadership potential","example[24]":"She always felt that I had leadership potential.","collocation[18]":"star potential","example[25]":"The woman who spotted Kate’s star potential was Sarah Doukas.","collocation[19]":"human potential","example[26]":"Mass unemployment is a shameful waste of human potential.","definition[4]":"a potential customer, market, buyer etc is not yet a customer etc, but may become one in the future","example[27]":"The company’s financial difficulties have deterred potential investors.","example[28]":"The company declined to confirm the names of the twopotential bidders.","example[29]":"The executives fear merger will expose the company to new potential losses.","definition[5]":"the possibility that something will develop in a certain way or be able to do something","example[30]":"He was eager to capitalize on the commercial potential of his designs.","example[31]":"the labor-saving potential of information technology","definition[6]":"a natural ability or quality that shows someone or something will be successful","example[32]":"a young businesswoman with great potential"}