{"word[0]":"share","signpost[0]":"use together","definition[0]":"to have or use something with other people","example[0]":"We don’t have enough books, so you’ll have to share.","example[1]":"The three of us shared a taxi.","example[2]":"I have an office that I share with some other teachers.","note[0]":"share something with somebody","signpost[1]":"let somebody use something","definition[1]":"to let someone have or use something that belongs to you","example[3]":"As a kid, he’d never share his toys.","example[4]":"Will you share your fries with me?","signpost[2]":"divide","definition[2]":"to divide something between two or more people","example[5]":"They shared the cake between them.","note[1]":"share something between/among somebody","example[6]":"On his death, his property was shared out between his children.","signpost[3]":"responsibility/blame","definition[3]":"to have equal responsibility for doing something, paying for something etc","example[7]":"We share the responsibility for the children.","example[8]":"I own the house, but we share the bills.","example[9]":"We all share some of the blame for the accident.","signpost[4]":"same","definition[4]":"to have the same opinion, quality, or experience as someone else","example[10]":"I believe my view is widely shared.","example[11]":"Other parents share her belief in the importance of reading.","note[2]":"share somebody’s view/concern/belief etc","example[12]":"Stubbornness was a characteristic he shared with his mother.","signpost[5]":"tell somebody something","definition[5]":"to tell other people about an idea, secret, problem etc","example[13]":"Students were able to share their experiences.","example[14]":"Would you like to share your feelings with the group?","heading[0]":"– Meaning 5: to have the same opinion, quality, or experience as someone else","collocation[0]":"share a belief/opinion","example[15]":"It was clear that the police did not share her opinion.","collocation[1]":"share a view","example[16]":"He shared my view of what had been going on.","collocation[2]":"share a feeling","example[17]":"I know that many people do not share my feelings.","collocation[3]":"share somebody’s values","example[18]":"The only way to change things is to elect politicians who share our values.","collocation[4]":"share somebody’s concern/enthusiasm etc","example[19]":"I share the concern of parents about the content of some of these computer games.","collocation[5]":"be widely shared","example[20]":"This view is now widely shared.","signpost[6]":"in a company","definition[6]":"one of the equal parts into which the ownership  of a company is divided","example[21]":"We’ve got shares in Allied Chemicals.","note[3]":"share in","signpost[7]":"part of something","definition[7]":"the part of something that you own or are responsible for","example[22]":"I do my share (=do my part) of the housework.","example[23]":"I gave them my share of the bill and left.","note[4]":"share of/in","example[24]":"a share in the profits","collocation[6]":"have/hold/own shares","example[25]":"A lot of the employees own shares in the company.","collocation[7]":"buy/invest in shares","example[26]":"I bought some shares in British Gas five years ago.","collocation[8]":"sell shares","example[27]":"This isn’t a good time to sell shares.","collocation[9]":"trade in/deal in shares","example[28]":"They make their money by trading in stocks and shares.","collocation[10]":"shares rise/go up","example[29]":"The company’s shares rose 5.5p to 103p.","collocation[11]":"shares fall/go down","example[30]":"Shares fell sharply on the London Stock Market yesterday.","form[0]":"share + NOUN","collocation[12]":"share price","example[31]":"The company’s share price has continued to go down.","collocation[13]":"share ownership","example[32]":"The government tried to encourage wider share ownership.","collocation[14]":"share dealing","example[33]":"He was convicted of illegal share dealing.","definition[8]":"one of the parts into which ownership of a company is divided","example[34]":"The company has the right to issue (=make available and sell) shares in two series.","example[35]":"Friendly companies and banks hold (=own) 56% of all  shares in Germany’s listed companies.","example[36]":"Top-ranking officers in the company sold a block of shares (=a large quantity, usually more than 10,000) on Monday when the price was high.","definition[9]":"different classes of a company’s shares. Each class has different characteristics, for example the right to vote at shareholders’ meetings","example[37]":"You can buy Class A shares of each of the Funds at the offering price.","example[38]":"Class B shares typically do not charge a frontend sales charge.","definition[10]":"the part of something that belongs to a particular person, organization etc","example[39]":"Corporations are being encouraged to give a share of their profits to social programs.","definition[11]":"market share that is measured by SALES REVENUE (=money obtained from sales)","example[40]":"Small electrical appliances took a 28% market share by value with sales reaching 19 billion euros.","definition[12]":"market share that is measured by the number of products sold","example[41]":"The firm leads the industry with 35% market share by volume in memory and microprocessor cards.","definition[13]":"to increase market share by charging low prices, even if they are not profitable","example[42]":"People have been competing with silly prices just to buy market share."}