{"word[0]":"guilt","definition[0]":"a strong feeling of shame and sadness because you know that you have done something wrong","example[0]":"He used to buy them expensive presents, out of guilt.","example[1]":"He felt an enormous sense of guilt when he thought about how he’d treated her.","example[2]":"I was racked with guilt at my part in making her this unhappy.","example[3]":"Sometimes I felt little pangs of guilt.","example[4]":"Don’t you have any feelings of guilt about leaving David?","note[0]":"guilt about/at/over","definition[1]":"the fact that you have broken an official law or moral rule","opposite[0]":"innocence","example[5]":"He did not deny his guilt.","definition[2]":"responsibility and blame for something bad that has happened","example[6]":"Guilt for poorly behaved children usually lies with the parents.","note[1]":"guilt for","collocation[0]":"have guilt","example[7]":"I had a lot of guilt about what had happened.","collocation[1]":"feel guilt","example[8]":"She didn’t feel any guilt; she had done nothing wrong.","collocation[2]":"be consumed with/racked with/overwhelmed by guilt","example[9]":"Later he was horrified that he had hit her, and was racked by guilt.","collocation[3]":"assuage somebody’s guilt","example[10]":"She died before I got there, and there was nothing I could do to assuage my guilt and regret.","collocation[4]":"a feeling/sense of guilt","example[11]":"I had a permanent feeling of guilt that I didn't see Mum and Dad as often as I should.","collocation[5]":"a pang/twinge/stab of guilt","example[12]":"Richard felt a pang of guilt, knowing that he had forgotten her birthday.","collocation[6]":"a burden of guilt","example[13]":"Many children feel a burden of guilt when their parents divorce, believing that they have caused the separation.","form[0]":"guilt + NOUN","collocation[7]":"a guilt complex","example[14]":"Some of the survivors developed a guilt complex. Why had they lived when others had died?","collocation[8]":"collective guilt","example[15]":"Should we feel some kind of collective guilt for what happened in the past?","definition[3]":"the feeling you have when you have done something you know is wrong","example[16]":"Divorce often leaves people with feelings of guilt.","display[0]":"shame","definition[4]":"the feeling of being guilty or embarrassed that you have after doing something that is wrong, when you feel you have lost people’s respect","example[17]":"I was too scared to help him, and I was filled with shame.","display[1]":"regret","definition[5]":"a feeling of sadness about something, especially because you wish it had not happened","example[18]":"Kate watched her go with a pang of regret.","display[2]":"remorse","definition[6]":"a strong feeling of being sorry for doing something very bad","example[19]":"a murderer who showed no remorse","display[3]":"contrition","definition[7]":"a feeling of being guilty and sorry for something wrong that you have done","example[20]":"The company CEO expressed contrition for the errors that led to the crash.","example[21]":"He sounded full of contrition.","example[22]":"They wanted to perform some kind of act of contrition (=do something that shows you feel sorry for something ).","display[4]":"penitence","definition[8]":"a feeling of being sorry for something that you have done wrong, when you do not intend to do it again","example[23]":"He expressed genuine penitence at the harm he had done her.","example[24]":"a period of reflection and penitence","display[5]":"conscience","definition[9]":"the part of your mind that tells you whether what you are doing is morally right or wrong","example[25]":"My conscience has been troubling me ever since."}