{"word[0]":"side","signpost[0]":"part of an area","definition[0]":"one of the two areas that are on the left or the right of an imaginary line, or on the left or the right of a border, wall, river etc","example[0]":"A man stood watching me from the other side of the road.","example[1]":"His friends and family were all on the other side of the world.","example[2]":"The restaurant was empty apart from another couple on the far side of the room  (=the area that is furthest away from you).","example[3]":"In Sri Lanka they drive on the left-hand side of the road.","note[0]":"the right-hand/left-hand side","example[4]":"The south side of town is pretty run down.","example[5]":"a scar on the right side of his face","note[1]":"on the ... side","example[6]":"Fuel is cheaper on the French side of the border.","example[7]":"She tilted her head to one side, pretending to consider the question.","note[2]":"to one/the side","signpost[1]":"next to","definition[1]":"a position directly next to someone or something, on the right or the left","example[8]":"Stand on this side of me so Dad can get a photo.","note[3]":"on this/one side (of somebody/something)","example[9]":"A little girl was skipping along at her side.","note[4]":"at somebody’s side/at the side of something","example[10]":"There was a card tacked to the wall at the side of the photograph.","example[11]":"Two large screens stood on either side of the stage  (=one on the left and one on the right side of it).","note[5]":"on either side (of something)","example[12]":"Maggie hurried to his side.","note[6]":"to somebody’s side","signpost[2]":"of a building/object/vehicle etc","definition[2]":"a surface of something that is not its front, back, top, or bottom","example[13]":"high-sided vehicles","note[7]":"high-sided/straight-sided etc","example[14]":"a straight-sided dish","example[15]":"He led the way round to the side of the building.","example[16]":"the side of her glass","example[17]":"Someone ran into the side of my car.","signpost[3]":"edge","definition[3]":"the part of an object or area that is furthest from the middle, at or near the edge","example[18]":"Jack sat down heavily on the side of the bed.","example[19]":"She pulled into the side of the road and stopped the car.","signpost[4]":"of a thin object","definition[4]":"one of the two surfaces of a thin flat object","example[20]":"Write on only one side of the paper.","example[21]":"I’ll paint the other side of the fence tomorrow.","example[22]":"There’s a scratch on one side of the record.","signpost[5]":"part of your body","definition[5]":"the part of your body from the top of your arm to the top of your leg","example[23]":"He had a scar running right the way down his side.","example[24]":"Betty was lying on her side on the bed.","definition[6]":"one of the flat surfaces or edges of a shape","example[25]":"A cube has six sides.","example[26]":"a seven-sided coin","note[8]":"three-sided/four-sided etc","signpost[6]":"mountain/valley","definition[7]":"one of the sloping areas of a hill, mountain etc","example[27]":"sheep grazing on the steep hillside","note[9]":"hillside/mountainside","example[28]":"a steep-sided valley","note[10]":"steep-sided/sheer-sided etc","example[29]":"Their house was on the side of the valley.","signpost[7]":"page","definition[8]":"a page of writing on one side of a piece of paper","example[30]":"How many sides have we got to write?","signpost[8]":"subject/situation","definition[9]":"one part or feature of something, especially when compared with another part","example[31]":"Look on the bright side (=see the good side of a situation) – at least you learned something from the experience.","example[32]":"It’s a children’s book about fairies and magic, but it does have a dark side.","example[33]":"She takes care of the financial side of the business.","note[11]":"technical/financial/social etc side","example[34]":"Can’t you see the funny side of all this?","note[12]":"serious/funny/negative/positive etc side","example[35]":"Environmental pollution gives great cause for concern, but, on the positive side, people are beginning to try and find solutions.","signpost[9]":"argument/war","definition[10]":"one of the people, groups, or countries opposing each other in a quarrel, war etc","note[13]":"whose side are you on? spoken (=used when someone is arguing against you when they should be supporting you)","example[36]":"He fought on the Republican side in the Spanish Civil War.","example[37]":"a peace deal that is acceptable to both sides","example[38]":"During the war, he changed sides several times.","example[39]":"He always likes to be on the winning side.","example[40]":"Well, at least someone’s on my side.","note[14]":"be on somebody’s side","definition[11]":"one person’s opinion or attitude in an argument or disagreement","synonym[0]":"point of view","example[41]":"Try and see my side of things for a change!","example[42]":"Well, I can see both sides. They both have a point.","example[43]":"We haven’t heard Mike’s side of the story yet.","note[15]":"somebody’s side of the story","definition[12]":"a sports team","example[44]":"They’re a good side, but I think we’re a better one.","signpost[10]":"part of somebody’s character","definition[13]":"one part of someone’s character, especially when compared with another part","example[45]":"There was a side to him that worried her, that seemed cold and cruel.","example[46]":"These days men are not all afraid to show their softer side.","note[16]":"somebody’s softer/feminine/emotional etc side","example[47]":"It was a side of Shari that I hadn’t seen before.","signpost[11]":"of a family","definition[14]":"a part of a family","example[48]":"My father’s side of the family are short, but my mother’s side are tall.","definition[15]":"a small amount of food that you order in a restaurant in addition to your main meal","example[49]":"a hamburger with a side of fries","signpost[12]":"tv station","definition[16]":"a television station","synonym[1]":"channel","example[50]":"What’s on the other side?","heading[0]":"– Meaning 1: one of the two areas that are on the left or the right of an imaginary line, or on the left or the right of a border, wall, river etc","collocation[0]":"one side","example[51]":"A path leads down one side of the garden to a paved area.","collocation[1]":"the other/opposite side","example[52]":"On the other side of the river are some low hills.","collocation[2]":"either side","example[53]":"There were tall hedges on either side of the lawn.","collocation[3]":"the far side","example[54]":"Nicolo was standing on the far side of the room.","collocation[4]":"the left/right side","example[55]":"He received a deep cut on the right side of his face.","collocation[5]":"the left-hand/right-hand side","example[56]":"On the left-hand side list the skills and qualifications required for the job.","collocation[6]":"the east/west etc side","example[57]":"The shop was on the west side of Culver Street.","heading[1]":"– Meaning 12: one part or feature of something, especially when compared with another part","collocation[7]":"the business/financial side","example[58]":"Geller handles the business side of things.","collocation[8]":"the technical side","example[59]":"Gregory works on the technical side, liaising with the sound and lighting people.","collocation[9]":"the social side","example[60]":"The social side of the group is very important.","collocation[10]":"the funny/serious side","example[61]":"Luckily, when I explained the situation, he saw the funny side of it.","collocation[11]":"the positive/negative side","example[62]":"On the positive side, the authors have assembled a wealth of useful material.","collocation[12]":"the bright side","example[63]":"It was her nature to look on the bright side.","collocation[13]":"the dark side","example[64]":"The book is an examination of the dark side of genius.","collocation[14]":"somebody’s creative/caring/feminine etc side","example[65]":"The art program is meant to bring out children’s creative side.","definition[17]":"in or on the side of something","example[66]":"Hannah slipped out through a side exit.","definition[18]":"from the side of something","example[67]":"Can you get a side view?","definition[19]":"to support or argue against a person or group in a quarrel, fight etc","example[68]":"Frank sided with David against their mother.","note[17]":"side with/against"}