{"word[0]":"monopoly","plural[0]":"monopolies","definition[0]":"if a company or government has a monopoly of a business or political activity, it has complete control of it so that other organizations cannot compete with it","example[0]":"They are demanding an end to the Communist Party’s monopoly of power.","note[0]":"monopoly of","example[1]":"the state monopoly of television","example[2]":"For years Bell Telephone had a monopoly on telephone services in the US.","note[1]":"monopoly on/in","example[3]":"a monopoly in copper trading","definition[1]":"a large company that controls all or most of a business activity","example[4]":"The company is a state-owned monopoly.","definition[2]":"if someone has a monopoly on something, that thing belongs to them, and no one else can share it","example[5]":"Teachers do not have a monopoly on educational debate.","definition[3]":"a very popular type of board game that has been sold since the 1930s. Players use toy money to buy streets and buildings on squares on the board, and then make other players pay rent if they move onto those squares. The squares on the board show the names of real streets in cities in the US (=in an American Monopoly set), London (=in a British Monopoly set), or other big cities around the world. People sometimes use the expression Monopoly money to mean a very large amount of money","example[6]":"You know how much it costs to buy an apartment in Tokyo? It's Monopoly money!","definition[4]":"a situation where a business activity is controlled by only one company or by the government, and other companies do not compete with it","example[7]":"The national airline is no longer a monopoly. At least 10 new airlines now compete against it.","example[8]":"For years, it enjoyed a monopoly on oil exploration and production in Argentina.","note[2]":"monopoly on","example[9]":"The company has been granted a monopoly over Italian high-speed train lines.","example[10]":"There remains the threat of monopoly.","definition[5]":"if one person, group, or organization has a monopoly on something, they have something that others do not have","example[11]":"This bank does not have a monopoly on bad loans."}