{"word[0]":"accident","definition[0]":"an event in which a car, train, plane etc is damaged and often someone is hurt","example[0]":"Over 70,000 people are seriously injured every year in road accidents.","example[1]":"The accident happened at the junction of Forest Road and Pine Walk.","example[2]":"a train accident","definition[1]":"a situation in which someone is injured or something is damaged without anyone intending them to be","example[3]":"Ken had an accident at work and had to go to hospital.","example[4]":"I’m sorry about breaking the vase – it was an accident (=I did not intend to do it).","example[5]":"She was injured in a freak accident (=an unusual accident) when a wall suddenly collapsed.","example[6]":"I had a slight accident  with your coffee.","example[7]":"They lost their lives in a tragic accident.","example[8]":"He died in a climbing accident in the Himalayas.","note[0]":"a climbing/skiing/hunting etc accident","definition[2]":"something that happens without anyone planning or intending it","note[1]":"an accident of birth/geography/history etc (=an event or situation caused by chance)","example[9]":"My third baby was an accident.","example[10]":"It is no accident that men fill most of the top jobs in nursing, while women remain on the lower grades.","heading[0]":"– Meaning 2: an event in which a car, train, plane etc is damaged and often someone is hurt","collocation[0]":"a bad/serious accident","example[11]":"There’s been a bad accident on the freeway.","example[12]":"The road is closed following a serious accident.","collocation[1]":"a major accident","example[13]":"News is coming in of a major rail accident.","collocation[2]":"a horrible/nasty/horrific accident","example[14]":"We narrowly avoided a nasty accident.","example[15]":"‘This was an absolutely horrific accident, ’ said an ambulance spokesman.","collocation[3]":"a fatal accident","example[16]":"a fatal accident involving a bus and a cyclist","collocation[4]":"a minor accident","example[17]":"The ice and poor visibility caused minor accidents all over the country.","collocation[5]":"a road/traffic accident","example[18]":"The number of traffic accidents has gone down.","example[19]":"Portugal has one of Western Europe’s worst road accident rates.","collocation[6]":"a car accident","example[20]":"He was badly injured in a car accident.","collocation[7]":"a plane accident/an airplane accident","example[21]":"Holly died in a plane accident.","collocation[8]":"a rail accident/a train accident","example[22]":"It was the country's worst ever rail accident.","collocation[9]":"a hit-and-run accident","example[23]":"A woman is fighting for her life after a hit-and-run accident.","collocation[10]":"be involved in an accident","example[24]":"Your son has been involved in a car accident.","collocation[11]":"prevent an accident","example[25]":"Steps have been taken to prevent a similar accident happening again.","collocation[12]":"an accident happens","example[26]":"No one saw the accident happen.","example[27]":"Most road accidents occur in urban areas.","collocation[13]":"have an accident","example[28]":"Young drivers are more likely to have accidents than older drivers.","form[0]":"accident + NOUN","collocation[14]":"an accident victim","example[29]":"One of the accident victims is still trapped in his vehicle.","collocation[15]":"accident rates/statistics","example[30]":"There is a relation between accident rates and the numbers of drivers on the road.","example[31]":"a survey of the latest airline accident statistics","collocation[16]":"an accident investigation/inquiry","example[32]":"The two deaths are the subject of an accident inquiry.","example[33]":"Accident investigations often take months.","collocation[17]":"an accident investigator","example[34]":"Accident investigators have been there all morning.","collocation[18]":"the scene of an accident","example[35]":"Police were at the scene of the accident within minutes.","definition[3]":"an event in which a vehicle is damaged and often someone is hurt","example[36]":"Her father died in a car accident.","example[37]":"Hugh had an accident on his way to work.","display[0]":"crash","definition[4]":"a serious accident in which a vehicle hits something else","example[38]":"Rees-Jones was the only person to survive the crash.","example[39]":"a car/plane/train crash","example[40]":"He was killed in a plane crash.","display[1]":"collision","definition[5]":"an accident in which two or more cars, trains etc hit each other","example[41]":"His car was involved in a collision with a train.","example[42]":"The actor was killed in a head-on collision while driving his new sports car.","display[2]":"disaster","definition[6]":"a serious accident involving a train, plane, or boat, in which a lot of people are killed or injured","example[43]":"It was Britain’s worst air disaster.","display[3]":"wreck","definition[7]":"an accident in which a car or train is badly damaged","example[44]":"Ben nearly died in a car wreck.","display[4]":"pileup","definition[8]":"an accident that involves several cars or trucks","example[45]":"The pileup happened in thick fog.","example[46]":"There was a 12-car pileup on the motorway.","display[5]":"fender-bender","definition[9]":"a car accident in which little damage is done","example[47]":"Atkinson was involved in a fender-bender in the hotel parking lot.","example[48]":"At 15, he borrowed his parents’ car and had a prang."}