{"word[0]":"tender","definition[0]":"tender food is easy to cut and eat, especially because it has been well cooked","example[0]":"Continue cooking until the meat is tender.","signpost[0]":"part of your body","definition[1]":"a part of your body that is tender is painful if someone touches it","example[1]":"My arm is still tender where I bruised it.","signpost[1]":"gentle","definition[2]":"gentle and careful in a way that shows love","example[2]":"Her voice was tender and soft.","example[3]":"a slow, tender kiss","signpost[2]":"easily damaged","definition[3]":"easily damaged – used especially about plants or flowers","example[4]":"tender plants that were killed by the harsh winter","definition[4]":"to formally offer or show something to someone","example[5]":"As company secretary, you must tender the proposal.","example[6]":"Minton tendered her resignation on Friday.","example[7]":"The seller has the right to keep the goods until payment is tendered to him.","note[0]":"tender something to somebody","definition[5]":"to make a formal offer to do a job or provide goods or services for a particular price","example[8]":"We are unable to tender competitively for the contract.","note[1]":"tender for","definition[6]":"a formal statement of the price you would charge for doing a job or providing goods or services","example[9]":"Our bid was the lowest tender.","example[10]":"The contract for building the houses will be put out to tender.","note[2]":"put something out to tender","definition[7]":"a small boat that takes people or supplies between the shore and a larger boat","definition[8]":"part of a steam train used for carrying coal and water for the train","definition[9]":"an offer to do a job or provide goods or services for a particular price, usually as part of a competition between several companies for the same work","example[11]":"Their bid was £150,000 more than the lowest tender.","example[12]":"Councillors agreed that the contract to build the homes should be put out to (=offered for) tender.","definition[10]":"an offer to buy shares, which will be sold to the investor who offers the highest amount","example[13]":"Some tender offers stipulate a minimum price for offers.","definition[11]":"an offer of the exact amount of money in CASH (=coins and notes) needed to pay for something","definition[12]":"to make a formal offer to do a job or provide goods or services at a particular price","example[14]":"The company said it is unable to tender competitively for contracts unless it has the flexibility of Sunday working.","definition[13]":"to make a formal offer to buy or sell shares at a particular price","example[15]":"Stockholders must tender for their shares by a specified expiration date.","example[16]":"The company has agreed to tender for two million of the shares at $4 a share.","definition[14]":"to offer or show something to someone","example[17]":"She will tender a proposal at the meeting.","example[18]":"The company vice-president had tendered his resignation (=officially said he wanted to leave his job).","definition[15]":"to give money as payment","example[19]":"She tendered a £10 note."}