{"word[0]":"trustworthy","definition[0]":"able to be trusted and depended on","definition[1]":"if someone is trustworthy, you can trust them because they are honest","example[0]":"Many people do not see politicians as trustworthy.","definition[2]":"someone who is reliable  can be trusted to do what they say they will do and not make any mistakes","example[1]":"a reliable employee","example[2]":"We need someone who is 100% reliable.","display[0]":"responsible","definition[3]":"someone who is responsible can be trusted to behave in a sensible way","example[3]":"Sam’s a good babysitter – he’s responsible and the kids like him.","example[4]":"a responsible adult","display[1]":"dependable","definition[4]":"someone who is dependable can be trusted to do what you need or expect","example[5]":"Britain is our most dependable ally.","display[2]":"steady","definition[5]":"someone who is steady is sensible and you can depend on them","example[6]":"He’s only sixteen, but he’s steady and reliable.","display[3]":"loyal","definition[6]":"someone who is loyal  can be trusted to always give help or support to their friends, their country, their political party etc","example[7]":"She is fiercely loyal to her family.","example[8]":"He is one of the party’s most loyal supporters.","display[4]":"faithful","definition[7]":"someone who is faithful stays loyal to a person, belief, political party etc, and continues to support them, even in difficult situations","example[9]":"Daniel had been a faithful friend.","example[10]":"a faithful member of the Communist Party","display[5]":"can rely/depend on somebody","definition[8]":"if you can rely or depend on someone, you can be sure that they will do what you want or need them to do","example[11]":"Don’t worry about a thing – you can depend on me.","example[12]":"Patients rely on doctors to help them make the right decisions about their health care.","heading[0]":"things","display[6]":"reliable/dependable","definition[9]":"able to be trusted to do what you want, or to be accurate","example[13]":"The Boeing is a very reliable plane.","example[14]":"a dependable supply of oil","example[15]":"reliable economic forecasts","example[16]":"How can we be sure that his evidence is reliable?","definition[10]":"if something is trustworthy, you know that it is true or accurate","example[17]":"a trustworthy source of information","example[18]":"a trustworthy guide","display[7]":"can rely/depend on something","definition[11]":"if you can rely or depend on something, you can be sure that they will do what you want or need them to do","example[19]":"I need a car that I can rely on in all weathers.","definition[12]":"a person or organization that is trustworthy can be trusted and depended upon","example[20]":"The staff are honest, trustworthy, intensely loyal and hard-working."}