{"word[0]":"question","signpost[0]":"asking for information","definition[0]":"a sentence or phrase that is used to ask for information or to test someone’s knowledge","example[0]":"Can I ask you a question?","example[1]":"I’m afraid I can’t answer that question.","example[2]":"They asked me quite a lot of difficult questions about my job.","note[0]":"question about/on","example[3]":"The survey included questions on age and smoking habits.","example[4]":"In answer to your last question, ‘Yes’.","note[1]":"in answer to somebody’s question","signpost[1]":"subject/problem","definition[1]":"a subject or problem that needs to be discussed or dealt with","synonym[0]":"issue","example[5]":"This raises the question of government funding.","example[6]":"an urgent need to address the question of crime","example[7]":"Several questions have still not been resolved.","example[8]":"The question is should I take the job in Japan, or should I stay here?","example[9]":"Some important questions remain unanswered (=still have not been dealt with or explained).","example[10]":"We discussed the question of confidentiality.","note[2]":"question of","signpost[2]":"doubt","definition[2]":"if there is some question about something, there is doubt about it, or people feel uncertain about it","example[11]":"The exact cause of death is still open to question (=not certain).","example[12]":"He’s by far the best candidate, there’s no question about it (=it is completely certain).","example[13]":"There is no question that (=it is completely certain that) the government knew about the deal.","example[14]":"This has called into question people’s right to retire at 60.","note[3]":"call/bring/throw something into question","example[15]":"Her efficiency and intelligence are beyond question.","note[4]":"beyond question","example[16]":"There are questions about the system’s practicality.","note[5]":"questions about/over something","heading[0]":"– Meaning 1: a sentence or phrase that is used to ask for information or to test someone’s knowledge","collocation[0]":"ask (somebody) a question","example[17]":"Don’t be afraid to ask questions.","collocation[1]":"have a question","example[18]":"I just have one question: is the treatment effective?","collocation[2]":"pose a question","example[19]":"He poses the question, ‘What should we teach our children?’","collocation[3]":"put a question to somebody","example[20]":"I recently put some of these questions to a psychologist.","collocation[4]":"answer a question","example[21]":"You haven’t answered my question.","collocation[5]":"avoid/evade/dodge a question","example[22]":"He had skilfully evaded Margie’s questions.","collocation[6]":"set a question","example[23]":"He used to set the questions for a TV quiz show.","collocation[7]":"rephrase a question","example[24]":"He didn’t answer, so I rephrased my question.","collocation[8]":"bombard somebody with questions","example[25]":"They bombarded him with questions about the case.","collocation[9]":"field questions","example[26]":"He fielded questions from reporters about the announcement.","form[0]":"ADJECTIVES/NOUN + question","collocation[10]":"difficult/hard","example[27]":"Some of the questions in the last section were very difficult.","collocation[11]":"easy","example[28]":"These questions should be easy for you.","collocation[12]":"a good question","example[29]":"That’s a good question.","collocation[13]":"a stupid/silly question","example[30]":"Did you win, or is that a stupid question?","collocation[14]":"an awkward question","example[31]":"How can we keep the press from asking awkward questions?","collocation[15]":"a tricky/tough question","example[32]":"That’s a really tricky question.","collocation[16]":"an embarrassing question","example[33]":"The media began to ask embarrassing questions about MPs' expenses.","collocation[17]":"a personal question","example[34]":"Can I ask you a personal question?","collocation[18]":"a simple question","example[35]":"All you have to do is answer the three simple questions below.","collocation[19]":"a searching/probing question","example[36]":"The immigration officer asked me some searching questions.","collocation[20]":"a direct question","example[37]":"She was startled by the direct question.","collocation[21]":"an exam/a test question","example[38]":"You have to answer twenty exam questions.","collocation[22]":"an impertinent question","example[39]":"She did not answer the maid’s impertinent question.","collocation[23]":"a rhetorical question","collocation[24]":"a multiple choice question","heading[1]":"– Meaning 2: a subject or problem that needs to be discussed or dealt with","collocation[25]":"raise a question","example[40]":"This study raises several important questions.","collocation[26]":"address a question","example[41]":"Two questions need to be addressed.","collocation[27]":"discuss a question","example[42]":"They discussed the question of the possible use of the atomic bomb.","collocation[28]":"consider a question","example[43]":"We must also consider the question of compensation.","collocation[29]":"deal with a question","example[44]":"This question will be dealt with in Chapter 4.","collocation[30]":"tackle a question","example[45]":"Who has the ability to tackle the tough questions facing the nation?","collocation[31]":"resolve a question","example[46]":"We will proceed just as soon as we can resolve the question of the fee.","collocation[32]":"an important/big question","example[47]":"The book raises important questions about nationality and the role of a citizen.","collocation[33]":"a fundamental question","example[48]":"Their experiences have highlighted fundamental questions of human rights.","collocation[34]":"serious questions","example[49]":"The incident has raised serious questions about police conduct.","collocation[35]":"a vexed/thorny question","example[50]":"Finally, there’s the thorny question of money.","collocation[36]":"a burning question","example[51]":"Little progress was made on the burning question of Africa’s debt.","collocation[37]":"a moral/ethical question","example[52]":"This area of medical research poses serious ethical questions that doctors alone cannot answer.","collocation[38]":"unanswered/open","example[53]":"At this point a key question remains unanswered.","heading[2]":"– Meaning 3: if there is some question about something, there is doubt about it, or people feel uncertain about it","collocation[39]":"be open to question","example[54]":"Whether he will survive politically is open to question.","collocation[40]":"be beyond question","example[55]":"Her loyalty is beyond question.","example[56]":"He brought into question all the principles on which the Soviet system was based.","collocation[41]":"come into question","example[57]":"The special protection given to these animals has come into question in recent years.","collocation[42]":"there’s no question","example[58]":"There’s no question that they have done an outstanding job.","definition[3]":"something that you ask someone, either when speaking or when writing","example[59]":"Would anyone like to ask any questions?","example[60]":"I’ve emailed the hotel with one or two questions.","display[0]":"query","definition[4]":"a question that you ask when you are not sure you have understood something or that the information you have is correct","example[61]":"If you have any queries, please contact your travel agent.","example[62]":"Our staff are always available to answer customers’ queries.","display[1]":"inquiry","definition[5]":"a question you ask in order to get information or find out the details about something","example[63]":"We’ve advertised the house, and we’ve already received lots of enquiries.","example[64]":"The police have been making some inquiries in the area.","display[2]":"request","definition[6]":"a polite or formal question asking for something that you want or need","example[65]":"The bank said ‘no’ to our request for more money.","example[66]":"You must make your request in writing.","definition[7]":"to ask someone questions in order to get information about something such as a crime","example[67]":"Two men have been arrested and questioned.","example[68]":"She hates being questioned about her past.","note[6]":"question somebody about something","example[69]":"Joseph questioned the doctors closely (=asked them a lot of questions).","definition[8]":"to have or express doubts about whether something is true, good, necessary etc","example[70]":"Are you questioning what I’m saying?","note[7]":"question what/how/when etc","example[71]":"No one dared to question his decisions.","example[72]":"One questions whether he’s telling the truth.","note[8]":"question whether","example[73]":"The police questioned him for three hours before releasing him without charge.","example[74]":"When questioned by reporters, he denied all knowledge about the affair.","display[3]":"interrogate","definition[9]":"to keep asking a lot of questions for a long time, sometimes using threats, in order to get information","example[75]":"He was interrogated by US agents about his alleged links to al-Qaeda.","display[4]":"interview","definition[10]":"to ask someone questions for a newspaper, TV programme etc, or to ask someone questions to find out if they are suitable for a job, course etc","example[76]":"Did you hear him being interviewed on ‘the Today Programme’?","example[77]":"The woman who interviewed me offered me the job.","display[5]":"grill","definition[11]":"to ask someone a lot of difficult questions about something, in a way that is tiring or annoying","example[78]":"She started grilling me about why I was so late coming home.","display[6]":"cross-examine","definition[12]":"to ask someone a series of questions in court about their previous statements, in order to find out whether they have been telling the truth","example[79]":"The defence lawyer cross-examined the witness in order to test his evidence.","display[7]":"be helping police with their inquiries","definition[13]":"to be questioned by the police about a crime – used especially in news reports when the police think that this person may be guilty of the crime","example[80]":"Last night, a 21-year-old woman was helping police with their inquiries.","definition[14]":"a sentence or phrase that asks for information","example[81]":"They asked me a lot of questions about my work experience.","example[82]":"Don’t hesitate to contact me if you have any questions.","definition[15]":"a subject or problem that needs to be settled, discussed, or dealt with","example[83]":"The real question is whether the employee has any power over customers.","example[84]":"This whole question of measuring risk has became a mess.","definition[16]":"a feeling of doubt about something","example[85]":"This incident raises further questions about airport security.","example[86]":"He is by far the best candidate. There is no question about it.","example[87]":"The wisdom of this policy is open to question (=it will be doubted by some people).","definition[17]":"the things, people etc in question are the ones that are being discussed or talked about","example[88]":"Is the information in question really a business secret?","definition[18]":"not possible or allowed","example[89]":"The idea of merging with another company was now out of the question.","definition[19]":"to ask someone questions to find out what they know about something","example[90]":"None of the defendants was questioned by the police before their arrest.","example[91]":"We have questioned many of our customers about the new services.","definition[20]":"to have doubts about whether something is true or if it is the right thing to do","example[92]":"The report questioned ISC’s heavy reliance on three international customers."}