{"word[0]":"duck","definition[0]":"a very common water bird with short legs and a wide beak, used for its meat, eggs, and soft feathers","definition[1]":"a female duck","definition[2]":"the meat of a duck used as food","example[0]":"roast duck with orange sauce","definition[3]":"used to speak to someone, especially a woman, in a friendly way","example[1]":"What can I get you, ducks?","definition[4]":"a score of zero by a batsman in a game of cricket","collocation[0]":"a duck quacks","example[2]":"The ducks on the river started quacking.","collocation[1]":"a duck waddles","example[3]":"Ducks were waddling across the grass.","collocation[2]":"a duck paddles","example[4]":"Ducks and swans paddled towards us.","collocation[3]":"a duck dives","example[5]":"A single wild duck was swimming and diving.","collocation[4]":"a duck bobs","example[6]":"They watched the ducks bobbing up and down on the waves.","form[0]":"duck + NOUN","collocation[5]":"a duck pond","example[7]":"The park has a duck pond which the children like.","definition[5]":"to lower your head or body very quickly, especially to avoid being seen or hit","example[8]":"If she hadn’t ducked, the ball would have hit her.","example[9]":"Tim ducked down to comb his hair in the mirror.","example[10]":"She ducked her head to look more closely at the inscription.","example[11]":"Jamie saw his father coming and ducked quickly behind the wall.","note[0]":"duck behind/under etc","definition[6]":"to move somewhere very quickly, especially to avoid being seen or to get away from someone","example[12]":"The two men ducked into a block of flats and disappeared.","note[1]":"duck into","example[13]":"She ducked out of the door before he could stop her.","note[2]":"duck out of","example[14]":"‘Wait a minute’, he called, ducking back inside.","note[3]":"duck back","definition[7]":"to avoid something, especially a difficult or unpleasant duty","synonym[0]":"dodge","example[15]":"The ruling body wanted to duck the issue of whether players had been cheating.","example[16]":"Glazer ducked a question about his involvement in the bank scandal.","definition[8]":"to push someone under water for a short time as a joke","example[17]":"Tom grabbed him from behind to duck him under the surface.","note[4]":"duck somebody under something"}