{"word[0]":"plate","definition[0]":"a flat and usually round dish that you eat from or serve food on","example[0]":"The plates were piled high with rice.","example[1]":"a dinner plate","definition[1]":"the amount of food that is on a plate","example[2]":"He’s eaten a whole plate of french fries.","note[0]":"plate of","signpost[0]":"sign","definition[2]":"a flat piece of metal with words or numbers on it, for example on a door or a car","example[3]":"The brass plate on the door said ‘Dr Rackman’.","example[4]":"Did anyone see the car’s license plate?","note[1]":"number/license/registration plate","signpost[1]":"protective covering","definition[3]":"one of the thin sheets of bone, horn etc that covers and protects the outside of some animals","definition[4]":"a thin sheet of metal used to protect something","example[5]":"The shoes had metal plates attached to the heels.","note[2]":"metal/steel/iron plates","signpost[2]":"earth’s surface","definition[5]":"one of the very large sheets of rock that form the surface of the Earth","signpost[3]":"gold/silver","definition[6]":"ordinary metal with a thin covering of gold or silver","definition[7]":"things such as plates, cups, forks, or knives made of gold or silver","signpost[4]":"pictures/photos","definition[8]":"a sheet of metal that has been cut or treated in a special way so that words or pictures can be printed from its surface","example[6]":"copper printing plates","definition[9]":"a picture in a book, printed on good-quality paper and usually coloured","definition[10]":"a thin sheet of glass used especially in the past in photography, with chemicals on it that are sensitive to light","signpost[5]":"baseball","definition[11]":"the place where the person hitting the ball stands","signpost[6]":"teeth","definition[12]":"a thin piece of plastic shaped to fit inside a person’s mouth, into which false teeth are fixed","definition[13]":"a thin piece of plastic with wires fixed to it, that some people wear in their mouth to make their teeth straight"}