{"word[0]":"first","signpost[0]":"in a series","definition[0]":"coming before all the other things or people in a series","example[0]":"Ella was his first girlfriend.","example[1]":"The first and last mountain I climbed was Mount Rundle  (=it was the only mountain I ever climbed).","example[2]":"The first time I flew on a plane I was really nervous.","note[0]":"the first thing/time/day etc","example[3]":"In the first year, all students take five courses.","example[4]":"He said the first thing that came into his head.","example[5]":"the first step towards achieving a peace agreement","example[6]":"There’s a meeting on the first Monday of every month.","example[7]":"I only read the first two chapters of the book.","note[1]":"the first two/three/few etc","example[8]":"It rained during the first few days of the trip.","signpost[1]":"main","definition[1]":"most important","example[9]":"Our first priority is to maintain the standard of work.","example[10]":"As I see it, my first responsibility is to my family.","signpost[2]":"job title","definition[2]":"used in the title of someone’s job or position to show that they have a high rank","example[11]":"the first officer","example[12]":"the First Lord of the Admiralty","definition[3]":"before anything or anyone else","example[13]":"Cindy and Joe arrived first.","example[14]":"An extra five points will be given to the team that finishes first.","example[15]":"First of all we’d better make sure we’ve got everything we need.","definition[4]":"before doing anything else, or before anything else happens","example[16]":"I’ll join you in a minute but I need to make a phone call first.","definition[5]":"done for the first time","example[17]":"The book was first published in 2000.","definition[6]":"at the beginning of a situation or activity","example[18]":"When we were first married we lived in Toronto.","example[19]":"We first became friends when we worked together.","definition[7]":"used before saying the first of several things you want to say","synonym[0]":"firstly","example[20]":"First, I’d like to thank everyone for coming.","explanation[0]":"First is used with the simple past","example[21]":"We first met in 2005","bad_example[0]":"We have first met in 2005","explanation[1]":"First usually comes before a main verb","example[22]":"I first went to Paris two years ago","explanation[2]":"First comes after ‘be’ when it is the main verb","example[23]":"I was first in Paris two years ago","explanation[3]":"First comes after the first auxiliary","example[24]":"When did you first realize you wanted to be a doctor?","display[0]":"first/firstly","definition[8]":"used when mentioning the first in a list of reasons, arguments, or questions to consider","example[25]":"I want you to consider these three points in your essay: first, what is the writer’s attitude to the war in this poem ...","example[26]":"There are several reasons for this conclusion. Firstly ...","display[1]":"first of all","definition[9]":"used especially to emphasize that the first of several things you are going to say is the most important thing","example[27]":"The content of the article must, first of all, be accurate.","example[28]":"First of all, a huge thank you to everyone who has supported us over the last two years.","display[2]":"in the first place","definition[10]":"used when giving the first and most important reason or example, especially when you are arguing or discussing something with someone","example[29]":"Our main priority should be better public transport – in the first place to reduce the amount of traffic on our roads.","example[30]":"He’s not the right person for the job. For a start he’s too young.","display[3]":"to begin with/to start with","definition[11]":"used when telling someone the first and most important thing that you want to say","example[31]":"There are numerous activities on offer. To start with there are over 60 miles of walks with splendid views.","example[32]":"Let me tell you something about him. To begin with, he is the most difficult man that I know.","definition[12]":"something that has never happened or been done before","example[33]":"These results are firsts in the history of women’s athletics.","example[34]":"‘I think he’ll agree to it.’ ‘That will be a first.’","example[35]":"The 3–0 defeat was a first for the team.","note[2]":"first for","definition[13]":"the highest mark you can get in a university degree in Britain","example[36]":"Helen got a first in Law.","definition[14]":"the lowest gear in a car or other vehicle, that you use when moving slowly","synonym[1]":"first gear","example[37]":"He put the car into first and roared away.","example[38]":"You should be in first on a hill like this.","note[3]":"in first"}