{"word[0]":"complaint","definition[0]":"a statement in which someone complains about something","example[0]":"If you wish to make a complaint, you should see the manager.","example[1]":"The sales assistants are trained to deal with customer complaints in a friendly manner.","example[2]":"Keating was dismissed after complaints about the quality of his work.","note[0]":"complaint about","example[3]":"complaints of police brutality","note[1]":"complaint of","example[4]":"complaints from local residents","note[2]":"complaint from/to","example[5]":"a complaint to the Advertising Standards Authority","example[6]":"All complaints against police officers are carefully investigated.","note[3]":"complaint against","example[7]":"We are concerned by complaints that children are being bullied.","note[4]":"complaint that","definition[1]":"something that you complain about","example[8]":"Our main complaint was the poor standard of service.","example[9]":"My only complaint is that the price is rather high.","definition[2]":"an illness that affects a particular part of your body","example[10]":"He is having treatment for a chest complaint.","collocation[0]":"make a complaint","example[11]":"The manager of the team decided to make a complaint about the referee.","collocation[1]":"file/lodge a complaint","example[12]":"She filed a complaint against several of her colleagues.","collocation[2]":"have a complaint","example[13]":"Please let us know if you have any complaints about our service.","collocation[3]":"bring a complaint against somebody","example[14]":"Higgins brought a complaint against his former manager.","collocation[4]":"receive a complaint","example[15]":"Our department has received a number of complaints from the public.","collocation[5]":"deal with/handle a complaint","example[16]":"Police officers came to the house to deal with a complaint about noise.","collocation[6]":"investigate a complaint","example[17]":"The dog was rescued after officials investigated a complaint of neglect.","collocation[7]":"uphold a complaint","example[18]":"The complaint was upheld and the advertisement was withdrawn.","collocation[8]":"a complaint concerns something/relates to something","example[19]":"We have received a number of complaints concerning faulty goods.","form[0]":"ADJECTIVES/NOUN + complaint","collocation[9]":"a formal/official complaint","example[20]":"The man has lodged a formal complaint against the police.","collocation[10]":"a common/widespread/frequent complaint","example[21]":"A common complaint of children is that parents do not listen to them.","collocation[11]":"a serious complaint","example[22]":"Serious complaints of negligence have been made.","collocation[12]":"a customer/consumer complaint","example[23]":"As a result of the improvements, customer complaints went down by 70%.","collocation[13]":"a bitter complaint","example[24]":"The people are full of bitter complaints about their government.","collocation[14]":"a familiar complaint","example[25]":"A lack of good public transport is a familiar complaint.","collocation[15]":"cause/grounds for complaint","example[26]":"I do not think that he has any cause for complaint.","collocation[16]":"a letter of complaint","example[27]":"I wrote a letter of complaint to the hospital manager.","collocation[17]":"a complaints procedure","example[28]":"There is a very straightforward complaints procedure you must follow.","definition[3]":"something that you say or write when you are complaining, especially to someone in an official position","example[29]":"If you have any complaints, please contact our customer relations department.","example[30]":"Our main complaint is the poor standard of service.","example[31]":"If you have a complaint, you should write to the manager.","example[32]":"Some employees are worried about what will happen to them if they make a complaint.","example[33]":"Mr Kelly has made a formal complaint against the police.","example[34]":"The commission has so far received nearly 10,000 letters of complaint.","display[0]":"protest","definition[4]":"when someone complains publicly about something that they think is wrong or unfair and should not be allowed to happen","example[35]":"Despite their protests, the students’ fees were increased.","example[36]":"When two members of the team were dismissed, the rest of them walked out in protest.","example[37]":"The ambassador lodged a formal protest against the proposals.","example[38]":"Ignoring my protests, he took off his jacket and wrapped it around my shoulders.","display[1]":"grievance","definition[5]":"something that you feel unhappy about because you think that you have been treated unfairly – use this especially about an official complaint you make about the place where you work","example[39]":"She filed a grievance last year after her supervisor refused to promote her.","example[40]":"Anyone who has a legitimate grievance against the company can take it to the arbitration committee.","example[41]":"The meetings give employees the opportunity to express their views or air grievances.","definition[6]":"a written or spoken statement by someone complaining about something","example[42]":"Our sales assistants are trained to deal with customer complaints in a friendly manner.","example[43]":"Thousands of customers have made complaints about the bank’s Internet banking service.","definition[7]":"a statement made by a person bringing a case or making a claim in a court of law, stating the facts upon which the case or claim is based","definition[8]":"a statement made by one person against another in a legal case, either in a court or to an officer of the court","example[44]":"The defence counsel pointed out that the complaint had not been served until 14 February this year."}