{"definition[0]":"used when emphasizing that something is no more and no less than a number or amount, or is completely correct in every detail","example[0]":"It’s exactly half past five.","example[1]":"The figures may not be exactly right, but they’re close enough.","example[2]":"I can’t remember exactly what she said.","note[0]":"exactly where/what/when etc","example[3]":"It’s a tragic situation and no one will ever know exactly what happened.","example[4]":"Where exactly did you stay in Portugal?","note[1]":"why/what/where etc exactly ...?","definition[1]":"used to emphasize that something is the same or different","synonym[0]":"precisely","example[5]":"That’s exactly what we’ve been trying to tell you.","example[6]":"It’s exactly the kind of work I’ve been looking for.","example[7]":"She tries to be exactly like her older sister.","example[8]":"Kevin’s teachers saw him as quiet and serious, but with his friends he was exactly the opposite.","example[9]":"The two candidates responded to the question in exactly the same way.","definition[2]":"used as a reply to show that you think what someone has said is completely correct or true","example[10]":"‘So you think we should sell the house?’ ‘Exactly.’","example[11]":"The bill came to exactly $1,000.","example[12]":"Police are still trying to find out exactly how the accident happened.","definition[3]":"exactly – used when it is important to be sure that something is completely correct in every detail","example[13]":"We need to know precisely how much this is going to cost.","example[14]":"Can you tell us precisely where he is?","example[15]":"What precisely do you mean by ‘relativity’?","display[0]":"just","definition[4]":"exactly – used especially when saying that things are exactly right, exactly the same, or exactly in a particular position","example[16]":"The frame is just the right size for the picture.","example[17]":"He and his brother are just the same.","example[18]":"The hotel is just next to the station.","example[19]":"A new handbag! That’s just what I wanted.","definition[5]":"exactly in a particular position or direction","example[20]":"The ball hit me right in the eye!","example[21]":"There’s the house, right in front of you.","example[22]":"I got a mosquito bite right on the end of my nose.","example[23]":"He sat down right beside her.","display[1]":"directly","definition[6]":"exactly in a particular position or direction Directly is more formal than right","example[24]":"Amy was sitting directly opposite me.","display[2]":"on the dot","definition[7]":"at exactly a particular time, and no earlier or later than that time","example[25]":"She always leaves the office at 5.30 p.m. on the dot.","display[3]":"bang","definition[8]":"exactly – used especially in the following very informal expressions","example[26]":"The train was bang on time.","example[27]":"The shot was bang on target.","example[28]":"Cockatoo Island is right bang in the middle of Sydney harbour."}