{"word[0]":"forest","definition[0]":"a large area of land that is covered with trees","example[0]":"a tropical forest","example[1]":"the danger of forest fires","example[2]":"Much of Scandinavia is covered in dense forest.","note[0]":"thick/dense forest","form[0]":"ADJECTIVES/NOUN + forest","collocation[0]":"a thick/dense forest","example[3]":"The country we passed through was once thick forest.","collocation[1]":"a pine/beech/birch etc forest","example[4]":"A narrow path led through the pine forest.","example[5]":"South East Asia’s topical rain forests","collocation[2]":"a deciduous forest","example[6]":"a deciduous forest of red oak trees","collocation[3]":"a coniferous forest","example[7]":"We entered a dark coniferous forest.","collocation[4]":"virgin forest","example[8]":"Here virgin forest remains that is at least a thousand years old.","collocation[5]":"a primeval forest","example[9]":"One of Europe’s last areas of primeval forest is threatened with destruction.","collocation[6]":"plant a forest","example[10]":"Large areas of forest have been planted.","collocation[7]":"clear a forest","example[11]":"Huge areas of forest have been cleared since 1960.","collocation[8]":"cut down a forest","example[12]":"The forest was cut down to make way for housing.","collocation[9]":"be covered in forest","example[13]":"The mountain slopes were covered in forest.","form[1]":"forest + NOUN","collocation[10]":"a forest fire","example[14]":"Forest fires have broken out across the region.","collocation[11]":"the forest floor","example[15]":"The forest floor was carpeted with leaves.","collocation[12]":"the forest canopy","example[16]":"He could see the sky through the gaps in the forest canopy.","collocation[13]":"forest management","example[17]":"The main aim of forest management is timber production.","definition[1]":"a very large area of land with a lot of trees growing closely together","example[18]":"In 1500, most of the country was forest.","example[19]":"the Black Forest in Germany","display[0]":"woods","definition[2]":"an area of land covered with a lot of trees, that is smaller than a forest","example[20]":"Behind the house were the woods that we used to play in.","example[21]":"Follow the path through a small wood.","display[1]":"woodland","definition[3]":"an area of land that is covered with trees – used especially for describing the type of land in an area","example[22]":"The site covers 74 acres of beautiful ancient woodland.","display[2]":"rainforest","definition[4]":"a thick forest with tall trees, in tropical parts of the world that have a lot of rain","example[23]":"Tropical rainforests are home to over half of the planet’s plant and animal species.","example[24]":"the Indonesian rainforest","display[3]":"jungle","definition[5]":"an area of tropical forest where trees and large plants grow very closely together","example[25]":"the jungles of Borneo","example[26]":"The palace was hidden for centuries in Guatemala’s dense jungle.","display[4]":"grove","definition[6]":"a small group of trees, or an area of land planted with a particular type of fruit tree","example[27]":"The temple was built in the centre of a small grove of trees.","example[28]":"the olive groves of southern Spain","display[5]":"copse","definition[7]":"a small area of trees or bushes growing closely together","example[29]":"At the top of the field was a copse full of rabbits.","display[6]":"plantation","definition[8]":"a large area of trees planted for their wood, fruit etc","example[30]":"a rubber plantation","display[7]":"thicket","definition[9]":"a small group of bushes, plants, or small trees growing closely together","example[31]":"Tall bamboo thickets fringed the narrow river."}