{"word[0]":"modification","definition[0]":"a small change made in something such as a design, plan, or system","synonym[0]":"alteration","example[0]":"They have used the same process for almost 50 years with only minor modifications.","example[1]":"We’ve made one or two modifications to the original design.","note[0]":"modification to","definition[1]":"the act of modifying something, or the process of being modified","example[2]":"The review resulted in the modification of our security procedures.","note[1]":"modification of","example[3]":"Knowledge of the ill effects of tobacco has led to a modification in smoking behaviour.","note[2]":"modification in","collocation[0]":"make a modification","example[4]":"I made some modifications to the filing system.","collocation[1]":"need modification","example[5]":"Some of the older power stations urgently needed modification.","collocation[2]":"undergo modification","example[6]":"The policy has undergone considerable modification since it was first introduced.","collocation[3]":"incorporate a modification","example[7]":"I've incorporated a few modifications into the program.","form[0]":"ADJECTIVES/NOUN + modification","collocation[4]":"a minor/slight modification","example[8]":"The document needed a few slight modifications.","collocation[5]":"a major modification","example[9]":"They made major modifications to the house to allow him to use his wheelchair.","collocation[6]":"extensive modifications","example[10]":"They had made extensive modifications to the script.","collocation[7]":"considerable/substantial modification","example[11]":"The existing system needed substantial modification.","collocation[8]":"genetic modification","example[12]":"the genetic modification of plants and animals","collocation[9]":"behaviour modification","example[13]":"A star chart, in which you give a star to a child as a reward, is a simple behaviour modification technique.","collocation[10]":"lifestyle modification","example[14]":"Lifestyle modification is the best way of dealing with moderately high blood pressure."}