{"word[0]":"evolution","definition[0]":"the scientific idea that plants and animals develop and change gradually over a long period of time","example[0]":"the theory of evolution","example[1]":"the evolution of mammals","note[0]":"evolution of","definition[1]":"the gradual change and development of an idea, situation, or object","example[2]":"the evolution of the computer","heading[0]":"– Meaning 1: the scientific idea that plants and animals develop and change gradually over a long period of time","collocation[0]":"evolution happens/takes place","example[3]":"We can see signs of evolution taking place in the world around us.","collocation[1]":"trace something's evolution","example[4]":"Anthropologists can trace the evolution of plants and animals by examining fossils.","collocation[2]":"human evolution","example[5]":"Our ancestors reached a key stage in human evolution when they began to stand up straight.","collocation[3]":"biological evolution","example[6]":"Every living creature has been formed by the slow process of biological evolution.","collocation[4]":"physical evolution","example[7]":"The environment plays a large part in the physical evolution of the species.","collocation[5]":"Darwinian evolution","example[8]":"He expounded the theory that language is the product of Darwinian evolution.","example[9]":"Many Christians find it impossible to accept Darwin's theory of evolution.","heading[1]":"– Meaning 2: the gradual change and development of an idea, situation, or object","collocation[6]":"gradual/continuous evolution","example[10]":"The social system is undergoing continuous evolution to adapt to these rapid changes.","collocation[7]":"cultural/social evolution","example[11]":"Neither cultural or social evolution is any guarantee that we are moving towards a better world.","collocation[8]":"political evolution","example[12]":"Prime Minister Nehru played a significant role in the political evolution of India.","collocation[9]":"technological evolution","example[13]":"The pace of technological evolution is getting faster all the time.","collocation[10]":"evolution takes place","example[14]":"A similar evolution was taking place in other great American cities.","example[15]":"The show traced the evolution of black American music from gospel through soul to hip-hop"}