{"word[0]":"personality","plural[0]":"personalities","definition[0]":"someone’s character, especially the way they behave towards other people","example[0]":"Despite their different personalities, they became the best of friends.","example[1]":"Unfortunately, the illness can lead to changes in personality.","definition[1]":"someone who is very famous and often appears in the newspapers, on television etc, especially an entertainer or sports person","example[2]":"one of the most well-liked TV personalities","note[0]":"TV/radio/sports personality","definition[2]":"the qualities of character that make someone interesting or enjoyable to be with","example[3]":"He’s honest but he lacks personality.","definition[3]":"someone who has a very strong character and is very different from other people","example[4]":"He was a dynamic personality in the business world.","definition[4]":"the qualities which make a place or thing different and interesting","example[5]":"It’s partly the architecture which gives the town its personality.","collocation[0]":"a strong personality","example[6]":"Mercer has a strong personality and always tells you his opinion.","collocation[1]":"a forceful personality","example[7]":"The architect’s forceful personality ensured that the work progressed rapidly.","collocation[2]":"a dominant personality","example[8]":"He had a dominant personality and could be a bit of a bully.","collocation[3]":"a warm personality","example[9]":"Everyone who knew Roseanne will miss her warm personality.","collocation[4]":"an outgoing/extrovert personality","example[10]":"The job requires someone with an outgoing personality.","collocation[5]":"an engaging personality","example[11]":"He is strikingly handsome with a very engaging personality.","collocation[6]":"a bubbly personality","example[12]":"Her bright and bubbly personality made her one of the most popular girls in her year.","collocation[7]":"a lively/vivacious personality","example[13]":"Her lively personality won her many admirers.","collocation[8]":"a charismatic personality","example[14]":"Like many other people, I was attracted by his charismatic personality.","form[0]":"personality + NOUN","collocation[9]":"a personality trait","example[15]":"She shares many of her mother’s personality traits.","collocation[10]":"a personality disorder","example[16]":"The hospital treats patients with severe personality disorders.","collocation[11]":"a personality clash","example[17]":"The band eventually split because of personality clashes.","collocation[12]":"a personality test","example[18]":"Employers are increasingly using personality tests to help them select staff.","definition[5]":"an organization that from a legal point of view is separate from the people who own it or manage it","example[19]":"A company has a separate legal personality, and its members are not liable for its debts.","definition[6]":"a product’s personality is the qualities that people think it has, considered as a whole","example[20]":"Gasoline has always been a tough sell, without much product personality."}