{"word[0]":"case","signpost[0]":"example","definition[0]":"an example of a particular situation or of something happening","example[0]":"Tom’s career is a case in point (=a clear example of something that you are discussing or explaining).","example[1]":"a classic case (=typical example) of poor design","example[2]":"There were 16 cases of damage to cars in the area.","note[0]":"case of","example[3]":"The amount of fruit in fruit juices must be 6% in the case of berries and 10% in the case of other fruits.","note[1]":"in the case of something","example[4]":"In many cases standards have improved.","note[2]":"in some/many/most etc cases","signpost[1]":"situation","definition[1]":"a situation that exists, especially as it affects a particular person or group","example[5]":"Like the others, he produced a written explanation, but in Scott’s case this was a 30-page printed booklet.","note[3]":"in somebody’s case","example[6]":"Changing men’s and women’s traditional roles is not easy, but in our case it has been helpful.","example[7]":"It may be the case that the scheme will need more money.","note[4]":"it is the case (that)","example[8]":"We tend to think of these people as untrustworthy, but that is not the case.","example[9]":"In this case, several solutions could be tried.","note[5]":"in this case","example[10]":"He won’t want to eat it unless he’s really hungry, in which case he’ll eat almost anything.","note[6]":"in which case","signpost[2]":"reason/argument","definition[2]":"a set of reasons why something should happen or be done","example[11]":"Let me research the facts before I put forward a case.","example[12]":"A group of us met to make our case for more women in the cabinet.","note[7]":"case for","example[13]":"There is a strong case (=very good set of reasons) for getting parents more involved in the school’s activities.","signpost[3]":"law/crime","definition[3]":"a question or problem that will be dealt with by a law court","example[14]":"She is keen to avoid a court case.","example[15]":"The lawyers will only be paid if they win the case.","example[16]":"Marshall has dropped the case against us.","note[8]":"case against","definition[4]":"all the reasons that one side in a legal argument can give against the other side","example[17]":"The evidence does not support the prosecution’s case.","example[18]":"The court ruled that we had a case (=had enough evidence or good arguments).","definition[5]":"an event or set of events that need to be dealt with by the police in order to find out if a crime has been committed and who committed it","example[19]":"a case of armed robbery","example[20]":"Around 50 police officers are on the case.","note[9]":"on the case","signpost[4]":"box/container","definition[6]":"a large box or container in which things can be stored or moved","example[21]":"a packing case","example[22]":"a case of wine","definition[7]":"a special box used as a container for holding or protecting something","example[23]":"a jewellery case","example[24]":"Jim put his violin back in its case.","definition[8]":"a suitcase","example[25]":"Polly carried her cases upstairs to the bedroom.","signpost[5]":"disease","definition[9]":"an example of a disease or a person who has a disease","example[26]":"There are thousands of new cases of AIDS in Africa every year.","definition[10]":"the way in which the form of a word changes, showing its relationship to other words in a sentence","example[27]":"case endings","definition[11]":"someone who is being dealt with by a doctor, a social worker, the police etc","heading[0]":"– Meaning 7a:","form[0]":"ADJECTIVES/NOUN + case","collocation[0]":"a court case","example[28]":"There was a lot of publicity surrounding the court case.","collocation[1]":"a murder case","example[29]":"He had been a witness in a murder case.","collocation[2]":"a libel case","example[30]":"damages awarded by juries in libel cases","collocation[3]":"a criminal case","example[31]":"It was the longest and most expensive criminal case in US history.","collocation[4]":"a civil case","example[32]":"He is involved with civil cases, not criminal ones.","collocation[5]":"a test case","example[33]":"If the dispute goes to court it could be an important test case.","collocation[6]":"a landmark case","example[34]":"a landmark case about copyright protection for computer software","collocation[7]":"a high-profile case","example[35]":"a defense lawyer who has handled some high-profile cases","collocation[8]":"bring a case (against somebody)","example[36]":"There was not enough evidence to bring a case against him.","collocation[9]":"hear/try a case","example[37]":"The case will be heard by a federal judge.","collocation[10]":"win/lose a case","example[38]":"Lomax was a brilliant lawyer who had never lost a case.","collocation[11]":"settle a case","example[39]":"He paid a $15,000 fine to settle the case.","collocation[12]":"adjourn a case","example[40]":"The case was adjourned until next month for further reports.","collocation[13]":"dismiss/throw out a case","example[41]":"The case was thrown out by New York state’s highest court.","collocation[14]":"drop a case","example[42]":"The case was dropped because of a lack of evidence.","collocation[15]":"a case comes/goes to court","example[43]":"When the case finally came to court, they were found not guilty.","collocation[16]":"a case comes/goes to trial","example[44]":"By the time her case went to trial, her story had changed.","collocation[17]":"a case comes before a judge/court","example[45]":"The case came before the federal courts.","example[46]":"packing cases full of equipment","example[47]":"a case of 10,000 cigarettes and several cases of spirits","definition[12]":"a question or problem that will be dealt with by a court of law","example[48]":"those claiming damages in personal injury cases","example[49]":"The Council appealed to them to drop the case (=stop investigating it).","example[50]":"The prosecution case was that the victim was stabbed by Reid during a general disturbance.","example[51]":"The plaintiff needed legal representation in order to present her case properly."}