{"word[0]":"email","definition[0]":"a system that allows you to send and receive messages by computer","synonym[0]":"electronic mail","example[0]":"It’s usually best to contact him by email.","definition[1]":"a message that is sent from one person to another using the email system","example[1]":"Send me an e-mail when you have any news.","collocation[0]":"send (somebody) an email","example[2]":"Can you send me an email with all the details?","collocation[1]":"get/receive an email","example[3]":"Within seconds, I got an email confirming the booking.","collocation[2]":"read an email","example[4]":"It took most of the morning to read my emails.","collocation[3]":"write an email","example[5]":"Jack spent the evening writing emails and surfing the Internet.","collocation[4]":"answer/reply to an email","example[6]":"She did not bother replying to his email.","collocation[5]":"check your email(s)","example[7]":"The first thing I do every morning is check my email.","collocation[6]":"delete an email","example[8]":"I accidentally deleted your email.","collocation[7]":"forward an email","example[9]":"Can you please forward this email on to Chris?","collocation[8]":"fire off an email","example[10]":"I fired off an email to the hotel, saying how disgusted I was with their level of service.","collocation[9]":"a group email","example[11]":"Those group emails telling you who is leaving and joining the company are so boring.","form[0]":"email + NOUN","collocation[10]":"an email address","example[12]":"What’s your email address?","collocation[11]":"an email message","example[13]":"I can send email messages on my phone.","collocation[12]":"an email attachment","example[14]":"Don’t open an email attachment unless you know who sent it.","definition[2]":"a message sent using the email system","example[15]":"Did you get my email?","example[16]":"There were about 20 emails in my inbox that morning.","display[0]":"message","definition[3]":"an email – used when it is obvious that you are talking about a message sent by email, rather than a message sent by some other method","example[17]":"I deleted your message by mistake.","display[1]":"attachment","definition[4]":"a document or file that is sent with an email","example[18]":"You can email the photo to me as an attachment.","display[2]":"spam","definition[5]":"unwanted email messages from advertisers","example[19]":"I was getting so much spam that I changed my email address.","display[3]":"phishing","definition[6]":"the activity of sending emails in order to trick someone into giving away information such as their bank account number or their computer password. This information is then used to get money or goods","example[20]":"Yahoo announced new measures to protect users from phishing.","definition[7]":"to send someone an email","example[21]":"Will you e-mail me about it?","definition[8]":"to send someone a document using email","example[22]":"Can you email me the proposal by the end of today?","definition[9]":"electronic mail; a system that allows people to send messages and documents to each other by computer","example[23]":"Do you have email (=is your computer set up to send and receive email) at home?","example[24]":"The file had been sent by email and saved to the hard disk.","example[25]":"We automatically delete all email messages more than three months old.","definition[10]":"a message or document sent by e-mail","example[26]":"Send me an e-mail telling me how many books you want to buy.","example[27]":"I had just finishedreading my email.","example[28]":"I haven’t had time to check my emails yet this morning.","definition[11]":"to send someone a message or a computer file by e-mail","example[29]":"You can phone, fax, or e-mail me.","example[30]":"I emailed you with my order six weeks ago.","note[0]":"email somebody with something","example[31]":"Please will you email me the latest set of accounts?","note[1]":"email somebody something"}