{"word[0]":"might","definition[0]":"if something might happen or might be true, there is a possibility that it may happen or may be true, but you are not at all certain","example[0]":"I might be a few minutes late.","example[1]":"She might not want to come with us.","example[2]":"He might have missed the train.","example[3]":"This might well be her last public performance  (=it is fairly likely).","example[4]":"One of the guards might easily panic and shoot someone  (=it is likely).","definition[1]":"used as the past tense of ‘may’ when reporting that someone talked or thought about the possibility of something","example[5]":"He might be able to help you.","example[6]":"I thought they might have gone home.","example[7]":"She was worried that we might get hurt.","definition[2]":"used to say that something was a possibility in the past but did not actually happen","example[8]":"It was terrifying. We might have been killed.","signpost[0]":"suggesting","definition[3]":"used to suggest politely what someone should do","example[9]":"If you need more information, you might try the Internet.","example[10]":"I thought we might go to the new Chinese restaurant on the High Street.","example[11]":"It might be a good idea to put those plants in the shade.","example[12]":"We’re going to a concert. You might like to come with us.","signpost[1]":"asking permission","definition[4]":"used to politely ask for permission to do something","example[13]":"Might I borrow your pen?","example[14]":"I wonder if I might speak to your son.","definition[5]":"used when reporting that someone asked for permission to do something","example[15]":"He asked if he might come in and look around.","signpost[2]":"somebody should have done something","definition[6]":"used when you are annoyed because someone has not done something that you think they should do","example[16]":"You might at least say thank you.","example[17]":"They might have cleaned up before they left.","signpost[3]":"past purpose","definition[7]":"used after ‘so that’ or ‘in order that’ to say that someone did something in order to make something else happen or be possible","example[18]":"I asked for names and addresses so that I might pass on details to the police.","signpost[4]":"although","definition[8]":"used to say that even though something is perhaps true, something different or opposite is also true","example[19]":"He might be nearly seventeen but he’s still very immature.","example[20]":"Surprising as it might seem, some tourists actually enjoy the British weather.","example[21]":"Although she might understand his beliefs, she could not accept them.","example[22]":"Try as I might  (=although I tried hard), I couldn’t work out the answer.","signpost[5]":"formal question","definition[9]":"used to ask a question in a formal and rather unfriendly way","example[23]":"And who might you be, young man?","definition[10]":"great strength and power","example[24]":"two individuals who took on the might of the English legal system","example[25]":"He swung the axe again with all his might."}