{"definition[0]":"feeling calm, comfortable, and not worried or annoyed","example[0]":"Gail was lying in the sun looking very relaxed and happy.","example[1]":"I feel more relaxed about my career than I used to.","note[0]":"relaxed about","definition[1]":"a situation that is relaxed is comfortable and informal","example[2]":"There’s a very relaxed atmosphere in the school.","definition[2]":"not strict, or not feeling that you have to do something in the way that other people think you should do it","example[3]":"She has a fairly relaxed approach to housework.","note[1]":"a relaxed attitude/manner/style etc","example[4]":"I was feeling relaxed after my holiday.","example[5]":"Looking relaxed and confident, the president answered questions from the press.","example[6]":"He seems very relaxed about the whole situation.","display[0]":"easy-going","definition[3]":"relaxed and not getting annoyed or angry with people – used when this is a part of someone’s character. An easy-going person likes to have good friendly relationships with other people, and is not strict about rules","example[7]":"Fred MacMurray was very easy-going and a pleasure to work with.","example[8]":"The hotel owner was an easy-going woman who let visitors come and go pretty well when they pleased.","example[9]":"The children were brought up in an easy-going atmosphere at home.","display[1]":"laid-back","definition[4]":"relaxed and not getting worried or annoyed about things – used when this is part of someone’s character. A laid-back person likes to take life slowly","example[10]":"He seemed like a cool laid-back kind of a guy.","example[11]":"Life on the farm was more laid-back compared to life in the big city.","display[2]":"comfortable","definition[5]":"feeling happy and not worried about doing something, talking about something, or being with someone","example[12]":"The teachers were comfortable with the new technology and the students loved it.","example[13]":"Some female patients are not comfortable with the idea of seeing a male doctor.","example[14]":"This is an emotional issue, which most people aren’t comfortable talking about.","display[3]":"at ease","definition[6]":"feeling relaxed in a situation – used especially when someone feels less worried than before, or when many other people would not feel relaxed in that situation","example[15]":"After a few weeks at college, I started to feel more at ease.","example[16]":"He looked completely at ease on a horse.","example[17]":"He was surprised to find himself so at ease with her father.","display[4]":"feel at home","definition[7]":"to feel relaxed in a place or with a person","example[18]":"I’ve always felt at home in Tokyo.","example[19]":"He felt instantly at home with her."}