{"word[0]":"old-fashioned","definition[0]":"not considered to be modern or fashionable anymore","opposite[0]":"fashionable","example[0]":"She wears really old-fashioned clothes!","example[1]":"old-fashioned farming methods","example[2]":"The idea seems rather old-fashioned now.","definition[1]":"someone who is old-fashioned has ideas, attitudes etc that were more usual in the past than now","synonym[0]":"conservative","example[3]":"He’s very old-fashioned when it comes to music.","definition[2]":"not considered modern or fashionable – used about styles of clothes, furniture etc, or about words and ideas","example[4]":"The room was full of big old-fashioned furniture.","example[5]":"I can’t wear that dress – it’s too old-fashioned.","example[6]":"He had a lot of good old-fashioned values.","display[0]":"out-of-date","definition[3]":"not containing the most recent information and therefore not useful","example[7]":"This guidebook is completely out-of-date.","definition[4]":"used about machines, equipment, or methods that are old-fashioned and have been replaced by better, more recent ones","example[8]":"In today’s world, technology rapidly becomes outdated.","example[9]":"The accident was blamed on an outdated rail network.","display[1]":"dated","definition[5]":"used about styles etc that were fashionable until recently but now look old-fashioned","example[10]":"The pictures in this book already look a bit dated.","example[11]":"I liked the food but the decor in the restaurant was very dated.","display[2]":"unfashionable","definition[6]":"not fashionable and not popular with people anymore","example[12]":"They lived in an unfashionable part of London.","example[13]":"The word ‘patriotic’ has become rather unfashionable these days.","display[3]":"obsolete","definition[7]":"old-fashioned – used about machines and equipment that are no longer being produced because better ones have been invented","example[14]":"These days, you buy a computer and it’s almost immediately obsolete.","example[15]":"Many laboratories use obsolete equipment and do not receive enough funding.","display[4]":"antiquated","definition[8]":"old and not suitable for modern needs and conditions","example[16]":"antiquated ideas about the constitution","example[17]":"an antiquated central heating system","example[18]":"antiquated technology"}