{"word[0]":"benefit","signpost[0]":"advantage","definition[0]":"an advantage, improvement, or help that you get from something","example[0]":"I never had the benefit of a university education.","example[1]":"The new credit cards will be of great benefit to our customers.","example[2]":"I hope that the decision taken today will be to the benefit of the whole nation.","example[3]":"the benefits of contact lenses","note[0]":"benefit of","example[4]":"Could you just explain again for Mark’s benefit?","note[1]":"for somebody’s benefit","example[5]":"Most motorists manage without the benefit of four-wheel drive.","note[2]":"without the benefit of something","signpost[1]":"money from government","definition[1]":"money provided by the government to people who are sick, unemployed, or have little money","example[6]":"those people eligible to claim benefit","example[7]":"You might be entitled to housing benefit.","note[3]":"unemployment/housing/child etc benefit","example[8]":"families on benefit","note[4]":"on benefit","signpost[2]":"extra things","definition[2]":"extra money or other advantages that you get as part of your job or from insurance that you have","example[9]":"We offer an excellent benefits package.","example[10]":"medical benefits","collocation[0]":"have the benefit of something","example[11]":"All the hotel rooms have the benefit of a balcony.","collocation[1]":"get a benefit","example[12]":"In this way, students will gain maximum benefit from their classes.","collocation[2]":"enjoy the benefits","example[13]":"You’ll enjoy all the benefits of being a member.","collocation[3]":"reap the benefits","example[14]":"He was looking forward to reaping the benefits of all his hard work.","collocation[4]":"bring/provide benefits","example[15]":"The new bridge has brought considerable benefits.","collocation[5]":"something outweighs the benefits","example[16]":"Make sure that the risks don’t outweigh the benefits.","form[0]":"ADJECTIVES/NOUN + benefit","collocation[6]":"a great/major/substantial benefit","example[17]":"The new system will be a great benefit to the company.","collocation[7]":"a real benefit","example[18]":"To get some real benefit from the exercise, you should continue for at least half an hour.","collocation[8]":"a direct benefit","example[19]":"The money sent has been of direct benefit to the islanders.","collocation[9]":"a lasting benefit","example[20]":"These plans are likely to result in lasting benefit to the whole of our district.","collocation[10]":"the full benefit of something","example[21]":"They will have the full benefit of our facilities.","collocation[11]":"economic/social/environmental etc benefits","example[22]":"Tourism has brought considerable economic benefits to the island.","collocation[12]":"health benefits","example[23]":"Just 30 minutes of moderate daily activity yields health benefits.","collocation[13]":"mutual benefit","example[24]":"Our two companies are working together for mutual benefit.","collocation[14]":"potential benefits","example[25]":"The potential benefits of the scheme must be weighed against the costs involved.","collocation[15]":"for your own benefit","example[26]":"He used the money for his own benefit, instead of using it to help other people.","definition[3]":"if you benefit from something, or it benefits you, it gives you an advantage, improves your life, or helps you in some way","example[27]":"They are working together to benefit the whole community.","example[28]":"I’m sure you’ll benefit greatly from the visit.","note[5]":"benefit greatly/enormously/considerably etc","example[29]":"Many thousands have benefited from the new treatment.","note[6]":"benefit from/by","example[30]":"They would benefit by reducing their labour costs.","definition[4]":"a good effect or advantage that something has, for example a product or service","example[31]":"We will focus our marketing message on the environmental benefits of the product.","example[32]":"The system offers real benefits to the consumer.","definition[5]":"money provided by the government to people who are old and no longer work, or to people who are unemployed, ill, or on a low income etc","example[33]":"the number of people out of work and receiving benefit","example[34]":"Two thirds of lone parents on benefit receive income support.","definition[6]":"money paid out on certain insurance policies, especially health insurance","example[35]":"In the event of a justified claim, permanent total disablement benefit will be payable from the date of the claimant’s disablement.","definition[7]":"something, especially money, that an employer gives to workers in addition to their normal pay, to encourage them to work harder or be satisfied where they work","example[36]":"The company offers an excellent salary and benefits package, including relocation costs.","definition[8]":"to get help or an advantage from something","example[37]":"The taxpayer benefits because we do not have to borrow public money from the Treasury.","example[38]":"This sector will benefit from lower borrowing costs.","note[7]":"benefit from","definition[9]":"to give someone help or advantage","example[39]":"The increase in house prices in the past 30 years has mainly benefited the comfortably-off."}