{"word[0]":"disappointed","definition[0]":"unhappy because something you hoped for did not happen, or because someone or something was not as good as you expected","example[0]":"Dad seemed more disappointed than angry.","example[1]":"disappointed customers","example[2]":"Visitors were disappointed to find the museum closed.","note[0]":"disappointed to hear/see/find etc","example[3]":"The girl’s parents were bitterly disappointed at the jury’s verdict.","note[1]":"bitterly/deeply/terribly disappointed","example[4]":"I was disappointed that we played so well yet still lost.","note[2]":"disappointed (that)","example[5]":"Local residents were disappointed with the decision.","note[3]":"disappointed at/with/about something","example[6]":"People are disappointed by the lack of political change.","note[4]":"disappointed by something","example[7]":"I’m very disappointed in you.","note[5]":"disappointed in somebody","definition[1]":"unhappy because something you hoped for did not happen, or because something was not as good as you expected","example[8]":"Hundreds of disappointed fans were unable to get tickets for the game.","example[9]":"I was disappointed with the grade I got in my Maths exam.","display[0]":"feel let down","definition[2]":"to feel disappointed because something was not as good as you expected, or someone did not do what you expected them to do for you – a rather informal use","example[10]":"I felt let down when I saw the film.","example[11]":"Nurses feel badly let down – they were promised a pay increase months ago.","display[1]":"disillusioned","definition[3]":"disappointed because you have lost your belief that an idea is right, or that something or someone is good","example[12]":"Their leaders are deeply disillusioned with the peace process.","example[13]":"Disillusioned voters are turning against the government.","display[2]":"disenchanted","definition[4]":"no longer feeling enthusiastic, especially so that you do not think you should be involved in something, or give someone your support","example[14]":"Americans have grown increasingly disenchanted with politics.","example[15]":"a disenchanted workforce","display[3]":"be/feel sorry","definition[5]":"used when telling someone that you feel disappointed and wish that the situation was different","example[16]":"I’m sorry you can’t come to the party.","example[17]":"She always felt sorry that she hadn’t got to know him better.","heading[0]":"very disappointed","display[4]":"gutted","definition[6]":"extremely disappointed, especially because you were unsuccessful","example[18]":"I was gutted when we lost the game.","display[5]":"crestfallen","definition[7]":"looking very disappointed and sad, especially when you suddenly realise that something you want cannot happen","example[19]":"Gary looked crestfallen as they calculated how much money they would need.","example[20]":"a crestfallen look"}