{"word[0]":"store","signpost[0]":"shop","definition[0]":"a place where goods are sold to the public. In British English, a store is large and sells many different things, but in American English, a store can be large or small, and sell many things or only one type of thing.","example[0]":"At Christmas the stores stay open late.","example[1]":"She worked in a grocery store before going to college.","note[0]":"shoe/clothing/grocery etc store","example[2]":"I need to go to the store for some milk.","note[1]":"go to the store","signpost[1]":"supply","definition[1]":"a supply of something that you keep to use later","example[3]":"fat stores in the body  (=that your body keeps)","example[4]":"a store of wood","note[2]":"store of","signpost[2]":"place to keep things","definition[2]":"a large building in which goods are kept so they can be used or sold later","example[5]":"a grain store","definition[3]":"to put things away and keep them until you need them","example[6]":"Store the beans in an airtight jar.","example[7]":"Squirrels are storing up nuts for the winter.","note[3]":"store something away/up","definition[4]":"to keep facts or information in your brain or a computer","example[8]":"Standard letters can be stored on floppy discs.","definition[5]":"a large place that sells many different kinds of goods on several different floors, or goods in large quantities","example[9]":"Most high street stores hold sales in January.","example[10]":"The firm has over 800 stores in Britain.","example[11]":"a London furniture store","example[12]":"He left the company to join a US stores group.","definition[6]":"a place where goods are sold to the public","synonym[0]":"SHOP","example[13]":"a liquor store","example[14]":"a book store","definition[7]":"a large building in which goods are stored so they can be used or sold later","synonym[1]":"WAREHOUSE","example[15]":"A 600-million barrel store of crude oil rests underground in Texas and Louisiana.","example[16]":"Stationery should be stored in a clear and dry cupboard or stockroom.","example[17]":"Goods are also stored on the warehouse floor, by high-rise stackings.","definition[8]":"to keep information on a computer or DISK","example[18]":"Standard letters can be stored on floppy disks.","example[19]":"All the sales data is stored on a CD-Rom."}