{"definition[0]":"extremely severe in a way that causes harm or damage","example[0]":"Their son had been injured in a terrible accident.","example[1]":"We’re worried that something terrible might have happened to Greg.","example[2]":"a terrible storm","synonym[0]":"awful","example[3]":"The hotel was absolutely terrible.","example[4]":"I’d better write this down; I have a terrible memory.","definition[1]":"making you feel afraid or shocked","example[5]":"There was a terrible noise and the roof caved in.","example[6]":"She wept when she heard the terrible news.","definition[2]":"to a very great degree","synonym[1]":"grave","example[7]":"You’re making a terrible mistake.","explanation[0]":"Terrible is not used with ‘very’ You say","example[8]":"I feel absolutely terrible today","bad_example[0]":"I feel very terrible today","display[0]":"terrible/awful","example[9]":"The journey was terrible – it took six hours.","example[10]":"The food was good but we had terrible service.","example[11]":"It’s such an awful programme! How can you watch it?","example[12]":"He looked dreadful.","definition[3]":"very bad and unpleasant – used especially when something has a strong effect on you and you feel shocked, annoyed, or sick","example[13]":"This soup tastes horrible.","example[14]":"I got a horrible shock when I saw the bill.","example[15]":"a horrible accident","example[16]":"a horrible thing to say to someone","display[1]":"appalling","definition[4]":"terrible – especially in a way that is shocking. Appalling is stronger and a little more formal than terrible or horrible","example[17]":"The refugees are living in appalling conditions.","example[18]":"The teacher said my handwriting was appalling.","definition[5]":"terrible – used about a taste, smell, habit etc, often one that makes you feel sick","example[19]":"The smell was disgusting and I had to go out.","example[20]":"Do you have to bite your nails? It’s a disgusting habit.","display[2]":"lousy","definition[6]":"terrible – used especially to express annoyance","example[21]":"I’ve had a lousy day at the office.","example[22]":"This area is a lousy place to live.","display[3]":"hopeless","definition[7]":"very bad and difficult – used when there is no chance of success or improvement","example[23]":"We were trying to pay off our debts but it was a hopeless situation.","example[24]":"He was given the almost hopeless task of trying to negotiate a ceasefire.","display[4]":"diabolical","definition[8]":"extremely bad – used to express great disapproval of an action or event","example[25]":"The prices are diabolical.","example[26]":"a diabolical waste of money","example[27]":"McAndrew gave a diabolical performance on Saturday."}