{"word[0]":"therefore","definition[0]":"as a result of something that has just been mentioned","example[0]":"Their car was bigger and therefore more comfortable.","example[1]":"Progress so far has been very good. We are, therefore, confident that the work will be completed on time.","explanation[0]":"In everyday English, people usually use so rather than therefore:","example[2]":"It was late, so I didn’t stay long.","definition[1]":"for this reason","example[3]":"She already had a lot of experience and therefore seemed the best candidate for the job.","display[0]":"so","definition[2]":"therefore. So is less formal than therefore, and is more common in everyday English","example[4]":"They had not eaten all day, so they were very hungry.","display[1]":"thus","definition[3]":"as a result of what you have just mentioned","example[5]":"The program is very simple and thus easy to run.","display[2]":"hence","example[6]":"This material is highly poisonous, hence the importance of careful handling.","display[3]":"as a result","definition[4]":"used when saying that because of a particular situation, something else happens or is true","example[7]":"Some people suffer from stress at work and become ill  as a result.","example[8]":"Economic growth slowed down as a result of inflation.","display[4]":"consequently/as a consequence","definition[5]":"used when saying that because of a particular situation, something else happens or is true. Consequently and as a consequence are more formal than as a result","example[9]":"The disease attacks the plant, the flower does not open, and consequently  no seeds are produced.","example[10]":"As a consequence of global warming, our climate is already starting to change.","display[5]":"this means that","definition[6]":"used when saying what the result of something is","example[11]":"If students arrive late, this means that lesson time is wasted.","definition[7]":"used when explaining the reason for something","example[12]":"Spell check programs do not recognize when you have used the wrong word. For this reason, you must still read over your work carefully."}