{"word[0]":"burn","past_tense[0]":"burnt","signpost[0]":"produce flames and heat","definition[0]":"if a fire burns, it produces heat and flames","example[0]":"There was a fire burning in the fireplace.","example[1]":"An average household candle will burn for about six hours.","definition[1]":"if something is burning, it is producing flames and being damaged or destroyed by fire","example[2]":"Parts of the building are still burning.","signpost[1]":"destroy something with fire","definition[2]":"to destroy or damage something with fire","example[3]":"I burnt all his old letters.","example[4]":"Cars were burned and shops were looted during the rioting.","example[5]":"The Grand Hotel had burnt to the ground.","example[6]":"Make sure the iron isn’t too hot or you’ll burn the cloth.","example[7]":"He dropped his cigarette and burnt a hole in the carpet.","signpost[2]":"injure/kill somebody with fire","definition[3]":"to hurt yourself or someone else with fire or something hot","example[8]":"I burned my hand on the oven door.","example[9]":"She was badly burned in a road accident.","example[10]":"Sixteen passengers were burned to death (=died in a fire).","example[11]":"A family of five were burned alive in their home last night  (=died in a fire).","example[12]":"Heretics were burnt at the stake (=burnt in a fire as a punishment).","signpost[3]":"sun","definition[4]":"if the sun burns your skin, or if your skin burns, it becomes red and painful from the heat of the sun","example[13]":"I burn quite easily.","example[14]":"Don’t forget you can still get burnt when you’re swimming or when it’s cloudy.","example[15]":"Her face and neck were quite badly burned.","definition[5]":"to spoil food by cooking it for too long, or to become spoiled in this way","example[16]":"I’m afraid I’ve burnt the pizza.","example[17]":"The meat was burned to a crisp.","note[0]":"burn something to a crisp/cinder","signpost[4]":"chemicals","definition[6]":"to damage or destroy something by a chemical action","example[18]":"Quite a lot of household chemicals can burn your skin.","signpost[5]":"fuel","definition[7]":"if you burn a fuel, or if it burns, it is used to produce power, heat, light etc","example[19]":"The boiler burns oil to produce heat.","example[20]":"greenhouse gases caused by the burning of fossil fuels","signpost[6]":"fat/energy","definition[8]":"if you burn fat or calories, you use up energy stored in your body by being physically active","example[21]":"Taking a brisk walk every morning is a great way to burn calories.","example[22]":"a fat-burning exercise","definition[9]":"if a light or lamp burns, it shines or produces light","example[23]":"A lamp was burning in the kitchen window.","example[24]":"The hall light was still burning.","signpost[7]":"feel hot and painful","definition[10]":"if a part of your body burns, or if something burns it, it feels unpleasantly hot","example[25]":"The whisky burned my throat as it went down.","example[26]":"My eyes were burning from the smoke.","signpost[8]":"face/cheeks","definition[11]":"if your face or cheeks are burning, they feel hot because you are embarrassed or upset","example[27]":"I could feel my cheeks burning as I spoke.","signpost[9]":"CD","definition[12]":"if you burn a CD or DVD, you record music, images, or other information onto it using special computer equipment","signpost[10]":"go fast","definition[13]":"to travel very fast","example[28]":"a sports car burning up the motorway","note[1]":"burn along/up etc","heading[0]":"– Meaning 3: to hurt yourself or someone else with fire or something hot","collocation[0]":"be badly/severely burned","example[29]":"His face had been badly burned in the fire.","collocation[1]":"be burned alive","example[30]":"The animals were burned alive when a farm building caught fire.","collocation[2]":"be burned to death","example[31]":"Anyone inside the truck would have been burned to death.","collocation[3]":"be burned at the stake","example[32]":"In those days witches were burned at the stake.","explanation[0]":"Burn belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[1]":"In this sentence, ‘the toast’ is the object of burn","example[33]":"You’re burning the toast!","explanation[2]":"In this sentence, ‘the toast’ is the subject of burn","example[34]":"The toast is burning!","heading[1]":"to be burning","definition[14]":"to produce heat and flames","example[35]":"The fire was still burning.","example[36]":"A pile of branches was burning in the yard.","display[0]":"be on fire","definition[15]":"if a building, car, piece of clothing etc is on fire, it is burning and being damaged","example[37]":"Before long, the neighbouring houses were on fire too.","display[1]":"be alight","definition[16]":"if something is alight, it is burning","example[38]":"By the time the fire engines got there, the whole building was already alight.","example[39]":"The candle was still alight.","display[2]":"be ablaze","definition[17]":"if something is ablaze, it is burning with a lot of flames, so that it is seriously damaged","example[40]":"Twelve hours after the bombing raid, many parts of the city were still ablaze.","example[41]":"The two hundred tonnes of straw were now ablaze and firefighters struggled to get the fire under control.","display[3]":"blaze","definition[18]":"to burn very brightly with a lot of flames and heat","example[42]":"A big log fire was blazing in the fireplace.","display[4]":"smoulder","definition[19]":"to burn slowly and continuously, producing smoke but no flames","example[43]":"A cigarette smouldered in the ashtray.","example[44]":"The fire in the chemical factory was so intense that it was still smouldering a week later.","display[5]":"flicker","definition[20]":"if a fire or flame flickers, it burns with an unsteady light that appears and disappears quickly","example[45]":"A welcoming fire flickered in the grate.","example[46]":"Inside the shrine candles flicker next to statues of saints.","heading[2]":"to start burning","display[6]":"catch fire","definition[21]":"to start burning accidentally","example[47]":"We were worried the house would catch fire.","example[48]":"Two farm workers died when a barn caught fire yesterday.","display[7]":"burst into flames","definition[22]":"to suddenly start burning and produce a lot of flames that cause serious damage","example[49]":"The plane crashed into the side of the mountain and burst into flames.","display[8]":"ignite","definition[23]":"if a chemical or gas ignites, it starts burning","example[50]":"The compound ignites at 450 degrees Celsius.","example[51]":"Scientists could not explain why the gas had suddenly ignited.","heading[3]":"to burn something","definition[24]":"to damage or destroy something with fire or heat","example[52]":"She lit a fire and burned his letters one by one.","display[9]":"set fire to something","definition[25]":"to make something start burning so that it gets damaged","example[53]":"Vandals set fire to an empty warehouse.","example[54]":"Teresa wondered if the burning log might set fire to the curtains.","example[55]":"The Vikings attacked villages along the coast and set them on fire.","example[56]":"Sparks from the fireplace could easily set the curtains on fire.","display[10]":"scorch","definition[26]":"to damage the surface of something by burning it so that a dark mark is left on it","example[57]":"Having the iron on a very high heat can scorch the fabric.","example[58]":"The heater was left on all night and it scorched the wall.","display[11]":"singe","definition[27]":"to damage hair, wool, paper etc by burning it slightly so that the ends or edges are burnt","example[59]":"The flames were hot enough to singe your eyebrows.","display[12]":"scald","definition[28]":"to burn your skin with very hot liquid or steam","example[60]":"The coffee was so hot it nearly scalded his tongue.","example[61]":"It’s easy to knock a pan off the stove and scald yourself.","example[62]":"He was scalded by steam escaping from the broken pipe.","definition[29]":"to make something start to burn, especially something that burns easily such as a gas or chemical","example[63]":"The gas is ignited by an electrical spark.","example[64]":"It appears he threw away a lit cigarette which ignited the petrol spilt on the ground.","heading[4]":"to make something stop burning","display[13]":"put out","definition[30]":"to make something such as a fire, cigarette, or candle stop burning","example[65]":"It took firefighters four hours to put out the blaze.","example[66]":"She threw sand on the fire to put it out.","example[67]":"I put out my cigarette and went back into the house.","display[14]":"extinguish","example[68]":"He managed to extinguish the flames with his coat.","example[69]":"Customers who smoke will be asked to extinguish their cigarettes or leave the premises.","display[15]":"blow out","definition[31]":"to make a flame or fire stop burning by blowing on it","example[70]":"He blew out the candle and went to sleep.","example[71]":"The wind blew out the fire.","definition[32]":"an injury caused by fire, heat, the light of the sun, or acid","example[72]":"His body was covered in cigarette burns.","example[73]":"She is being treated for minor burns.","example[74]":"She was taken to the hospital with serious burns.","note[2]":"severe/serious burns","example[75]":"Several of the survivors suffered severe burns.","definition[33]":"a mark on something caused by fire or heat","example[76]":"The desk was covered with graffiti and burn marks.","definition[34]":"a painful mark on the skin caused by it rubbing hard against something rough","definition[35]":"a small stream","past_tense[1]":"burned","definition[36]":"to copy information held on a computer’s HARD DRIVE onto a CD ROM","definition[37]":"to lose a lot of money in a business deal, usually because it involves a high risk","example[77]":"A lot of investors got burned buying junk bonds which turned out to be worthless.","definition[38]":"to suffer from the results of an unsuccessful business activity","example[78]":"Since burning their fingers on 100% lending that turned into bad debt, lenders have been limiting borrowing to 75% of the property’s value."}