{"comparative[0]":"angrier","superlative[0]":"angriest","definition[0]":"feeling strong emotions which make you want to shout at someone or hurt them because they have behaved in an unfair, cruel, offensive etc way, or because you think that a situation is unfair, unacceptable etc","example[0]":"I was angry because he hadn’t told me his plans.","example[1]":"He was beginning to get angry.","example[2]":"His comments brought an angry response from opposition politicians.","example[3]":"‘Calm down, ’ she said, looking at his angry face.","example[4]":"Jesse laughed, which made me even angrier.","example[5]":"‘Please don’t be angry with me, ’ she said.","note[0]":"angry with","example[6]":"They are angry at the way they have been treated.","note[1]":"angry at","example[7]":"Kate’s still so angry about the whole thing.","note[2]":"angry about/over","example[8]":"The workers are angry that they haven’t been paid for the week.","note[3]":"angry (that)","definition[1]":"an angry sky or cloud looks dark and stormy","definition[2]":"an angry wound etc is painful and red and looks infected","synonym[0]":"inflamed","heading[0]":"GRAMMAR: Patterns with angry","explanation[0]":"You say that someone is angry with another person","example[9]":"My parents were very angry with me","bad_example[0]":"My parents were angry to me","display[0]":"angry about","explanation[1]":"You say that someone is  angry about something","example[10]":"I was really angry about what had happened ","display[1]":"angry at ","explanation[2]":"that someone is angry at someone, or angry at something","example[11]":"Please don’t get angry at me ","example[12]":"I was really angry at what had happened ","definition[3]":"feeling strong emotions because you think someone has behaved badly, or because a situation seems bad or unfair","example[13]":"He gets really angry if people keep him waiting.","example[14]":"a crowd of angry protesters","display[2]":"mad","example[15]":"Dad was mad at me for damaging the car.","display[3]":"cross","definition[4]":"rather angry – used when speaking to people you know well","example[16]":"She was cross with me for being late.","display[4]":"annoyed","definition[5]":"a little angry","example[17]":"I was annoyed no one had told me the class was cancelled.","display[5]":"irritated","definition[6]":"annoyed and impatient, especially by something that keeps happening or something someone keeps saying","example[18]":"I was irritated by their stupid questions.","example[19]":"an irritated voice","definition[7]":"becoming annoyed or angry easily","example[20]":"a bad-tempered old man","example[21]":"He’s always bad-tempered when he doesn’t get what he wants.","display[6]":"in a bad/foul mood","definition[8]":"feeling a little angry for a period of time, often for no particular reason","example[22]":"I woke up in a bad mood.","example[23]":"She’s been in a foul mood all morning.","display[7]":"in a huff","definition[9]":"in an angry mood for a short time, especially because someone has just said something to offend or annoy you","example[24]":"He walked off in a huff when they refused to let him join in their game.","display[8]":"somebody has got up on the wrong side of the bed","definition[10]":"used when you think someone has been in an angry mood all day, for no particular reason – often used humorously","example[25]":"I don’t know what’s wrong – she must have got up on the wrong side of the bed today.","heading[1]":"extremely angry","display[9]":"furious/livid","example[26]":"She was furious when she found out he’d been lying to her.","example[27]":"He looked absolutely livid.","display[10]":"outraged","definition[11]":"very angry and shocked by something you think is unfair or wrong","example[28]":"Most people were outraged by the 9/11 attacks.","example[29]":"complaints from outraged viewers","display[11]":"incandescent with rage","definition[12]":"extremely angry – used mainly in writing, for example in newspaper reports","example[30]":"Gordon Brown was reported to be incandescent with rage over the article.","display[12]":"lose your temper","definition[13]":"to suddenly become very angry and start shouting at someone","example[31]":"It was the first time I’d seen her lose her temper."}