{"word[0]":"focus","signpost[0]":"give attention to something","definition[0]":"to give special attention to one particular person or thing, or to make people do this","synonym[0]":"concentrate","example[0]":"She tried to focus her mind on her work.","note[0]":"focus your attention/mind/efforts on something","example[1]":"We need to focus public attention on this issue.","note[1]":"focus (somebody’s) mind/attention (on something)","example[2]":"He needs to focus more on his career.","note[2]":"focus on","example[3]":"We focused on two main issues","bad_example[0]":"We focused in two main issues","signpost[1]":"camera/telescope","definition[1]":"to point a camera or telescope at something, and change the controls slightly so that you can see that thing clearly","example[4]":"She turned the camera and focussed on Martin’s face.","example[5]":"He focused his binoculars on the building opposite.","note[3]":"focus something on something","definition[2]":"if your eyes focus, or if you focus your eyes, you look at something and can see it clearly","example[6]":"His eyes were focussed straight ahead.","example[7]":"All eyes focussed on her.","definition[3]":"if you focus beams of light, you aim them onto a particular place","definition[4]":"the thing, person, situation etc that people pay special attention to","example[8]":"The focus of recent research has been on environmental issues.","example[9]":"The focus of interest in the series is what goes on in everyday life.","example[10]":"Another focus of feminist debate has been the film industry.","example[11]":"I shall now turn to the main focus of this essay.","example[12]":"Eggs became the focus for the food poisoning scare.","example[13]":"The focus of the conference shifted from population growth to the education of women.","example[14]":"The war in Afghanistan had become the focus of media attention.","note[4]":"focus of","definition[5]":"if your focus is on something, that is the thing you are giving most attention to","example[15]":"a shift of focus","example[16]":"Our main focus is on helping people get back into work.","definition[6]":"the clearness of the picture seen through an instrument such as a camera","example[17]":"He raised his binoculars and adjusted the focus.","collocation[0]":"the main focus","example[18]":"The main focus of our attention will be on providing an efficient service.","collocation[1]":"the central focus","example[19]":"The film’s central focus is the relationship between the two women.","collocation[2]":"the primary focus","example[20]":"The economic situation is likely to be the primary focus of the discussion.","collocation[3]":"become the focus","example[21]":"When you give a talk you become the focus of attention.","collocation[4]":"provide a focus","example[22]":"The church provided a focus for the community.","collocation[5]":"change the focus","example[23]":"He changed the focus from general to specific issues.","collocation[6]":"shift the focus","example[24]":"Opposition MPs accused the prime minister of trying to shift the focus onto other issues.","collocation[7]":"the focus changes/shifts","example[25]":"The focus of the negotiations shifted to working conditions.","collocation[8]":"the focus is on something","example[26]":"The focus is now on improving students’ communication skills.","collocation[9]":"the focus of attention","example[27]":"In this section of the talk the focus of attention will be on statistics.","collocation[10]":"a focus of interest","example[28]":"Animal behaviour has long been a focus of interest for scientists.","collocation[11]":"the focus of debate","example[29]":"The strike became the focus of debate in the media.","collocation[12]":"the focus of concern","example[30]":"The spread of the disease has become the main focus of concern.","collocation[13]":"a change/shift in focus","example[31]":"Over the years, there has been a change of focus from treatment to prevention.","definition[7]":"when a company tries to serve particular groups of customers in a market with particular needs, rather than trying to serve the whole market"}