{"word[0]":"spare","signpost[0]":"not used/needed","definition[0]":"not being used or not needed at the present time","example[0]":"Have you got any spare boxes?","example[1]":"You could sleep in the spare bedroom.","example[2]":"Do you have any spare cash?","example[3]":"I’ll go and see if there are any spare seats.","example[4]":"A decline in beer sales had left the industry with spare capacity  (=the ability to produce more than can be sold).","signpost[1]":"plain","definition[1]":"a spare style of writing, painting etc is plain or basic and uses nothing unnecessary","definition[2]":"someone who is spare is tall and thin","definition[3]":"to make something such as time, money, or workers available for someone, especially when this is difficult for you to do","example[5]":"Sorry, I can’t spare the time.","example[6]":"I’d like you to come over when you can spare a couple of hours.","example[7]":"Can you spare £5?","example[8]":"It’s very kind of you to spare me so much of your time.","example[9]":"Could you possibly spare me a few moments in private  (=used to ask someone if they have time to quickly talk to you)?","note[0]":"spare somebody ten minutes/an hour etc","example[10]":"We’re too busy to spare anyone to help you right now.","note[1]":"spare somebody/something to do something","signpost[2]":"not damage or harm","definition[4]":"to not damage or harm someone or something, even though other people or things are being damaged, killed, or destroyed","example[11]":"I could not understand why I had been spared and they had not.","example[12]":"the soldier who had spared his life","example[13]":"Today we will hear whether the school is to be spared from closure.","note[2]":"spare somebody/something from something","definition[5]":"an additional thing, for example a key, that you keep so that it is available","example[14]":"If you forget the key, Mrs Jones over the road has a spare.","example[15]":"The batteries are dead. Have you got any spares?","definition[6]":"a spare tyre"}