{"word[0]":"pin","signpost[0]":"for joining/fastening","definition[0]":"a short thin piece of metal with a sharp point at one end, used especially for fastening together pieces of cloth while making clothes","definition[1]":"a thin piece of metal used to fasten things together, especially broken bones","signpost[1]":"jewellery","definition[2]":"a piece of metal, sometimes containing jewels, that you fasten to your clothes to wear as a decoration","signpost[2]":"electrical","definition[3]":"one of the pieces of metal that sticks out of an electric plug","example[0]":"a three-pin plug","signpost[3]":"bowling","definition[4]":"one of the bottle-shaped objects that you try to knock down in a game of bowling","signpost[4]":"part of bomb","definition[5]":"a short piece of metal which you pull out of a hand grenade to make it explode a short time later","signpost[5]":"golf","definition[6]":"a metal stick with a flag at the top which marks the holes on a golf course","definition[7]":"to fasten something somewhere, or to join two things together, using a pin","example[1]":"Can you pin this to the notice board?","note[0]":"pin something to/on something","example[2]":"He pinned the name tag on his jacket.","example[3]":"She had photos of her kids pinned up next to her desk.","note[1]":"pin something up","definition[8]":"to make someone unable to move by putting a lot of pressure or weight on them","example[4]":"He pinned her arms to her sides.","note[2]":"pin somebody/something to something","example[5]":"Albert got him pinned against the wall.","note[3]":"pin somebody against something","example[6]":"They managed to pin him down until the police arrived.","note[4]":"pin somebody down","example[7]":"Her body was pinned under the weight of the car.","note[5]":"be pinned under/beneath something","definition[9]":"a number that you use when you get money from a machine using a plastic card","definition[10]":"personal identification number; a secret number given to you by your bank that you use when getting money from a cash machine with a card","synonym[0]":"PIN number","example[8]":"We will notify you of your PIN shortly after the account is opened.","example[9]":"Never tell anyone your PIN number."}