{"word[0]":"rather","pos[0]":"predeterminer","definition[0]":"fairly or to some degree","example[0]":"I was rather surprised to see him with his ex-wife.","example[1]":"He was limping rather badly.","example[2]":"My own position is rather different.","example[3]":"Abigail’s always been rather a difficult child. British English","example[4]":"Isn’t it rather late  (=a little too late) to start changing all the arrangements?","example[5]":"Actually I rather like the new style of architecture. British English","example[6]":"It was a nice house, but rather too small for a family of four. British English","example[7]":"The task proved to be rather more difficult than I had expected. British English","heading[0]":"GRAMMAR: Patterns with rather","explanation[0]":"You say that you would rather do something","example[8]":"I would rather play than study","bad_example[0]":"I would rather to play than study","explanation[1]":"You say that you would rather be something","example[9]":"I would rather be rich than poor","bad_example[1]":"I would rather to be rich than poor","explanation[2]":"You say that you would rather someone did something","example[10]":"I would rather you came in spring","explanation[3]":"You say that you would rather someone did not do something, when you don’t want them to do it in the future","example[11]":"I would rather you didn’t say that ","explanation[4]":"You say that you would rather someone had not done something, when criticizing them for something they have done in the past","example[12]":"I would rather you hadn’t said that ","display[0]":"rather/quite","definition[1]":"more than a little, but less than very. British people often use these words before adjectives in conversation. In many cases they do not intend to change the meaning – it is just something that people say","example[13]":"She seemed rather unhappy.","example[14]":"It’s rather a difficult question.","example[15]":"It’s getting quite late.","example[16]":"Malaria is rather common in this area.","display[1]":"fairly","definition[2]":"rather. Fairly is used in both British and American English","example[17]":"The test was fairly easy.","example[18]":"It’s a fairly long way to the next town.","display[2]":"pretty","definition[3]":"rather. Pretty is more informal than the other words and is used in spoken English","example[19]":"Her French is pretty good.","example[20]":"We’re in a pretty strong position.","display[3]":"reasonably","definition[4]":"to a satisfactory level or degree","example[21]":"He plays reasonably well.","example[22]":"Let’s just say that I am reasonably confident we’ll win.","display[4]":"moderately","definition[5]":"more than a little, but not very","example[23]":"Her family was moderately wealthy.","example[24]":"The food was moderately good, but not as good as the food in the other restaurants.","example[25]":"Use a moderately high heat.","example[26]":"a moderately difficult climb","display[5]":"somewhat","definition[6]":"fairly or to a small degree. Somewhat is used especially when talking about the size or degree of something. It is often used in comparatives","example[27]":"The celebrations were somewhat larger than last year’s.","example[28]":"He looked somewhat irritated.","example[29]":"a somewhat surprising decision","definition[7]":"used to agree with someone"}