{"word[0]":"boast","definition[0]":"to talk too proudly about your abilities, achievements, or possessions","example[0]":"‘I wouldn’t be afraid, ’ she boasted.","example[1]":"Amy boasted that her son was a genius.","note[0]":"boast that","example[2]":"He’s boasting about how much money he has made.","note[1]":"boast about","example[3]":"The company is inclined to boast of its success.","note[2]":"boast of","definition[1]":"if a place, object, or organization boasts something, it has something that is very good","example[4]":"The city boasts two excellent museums.","example[5]":"The Society boasts 3,000 members worldwide.","definition[2]":"to talk too proudly about your abilities, achievements, or possessions because you want other people to admire you","example[6]":"She’s always boasting about how good she is at languages.","display[0]":"brag","definition[3]":"to boast in a way that annoys other people. Brag is more informal than boast","example[7]":"He was bragging about how many girlfriends he had had.","example[8]":"I don’t think they have anything to brag about.","example[9]":"The rebels have repeatedly bragged that their fighters have been responsible for the mounting attacks on policemen, 226 of whom were killed last year.","display[1]":"blow your own trumpet","definition[4]":"to talk a lot about your achievements – used especially when you want to mention your achievements but do not want to sound as if you are boasting","example[10]":"I don’t want to blow my own trumpet, but it was me who came up with the idea for the project in the first place.","display[2]":"crow","definition[5]":"to boast about something you have achieved, when other people have been less lucky or successful","example[11]":"Nordstrom and his supporters are still crowing about winning the lawsuit.","display[3]":"gloat","definition[6]":"to behave in a way that shows that you are proud of your own success and happy about someone else’s failure","example[12]":"The Australians are still gloating over their victory over England.","example[13]":"The liberals are gloating and celebrating all over town.","example[14]":"I haven’t come to gloat! We all have to lose sometimes.","display[4]":"be full of yourself","definition[7]":"to show by your words and behaviour that you are very proud of your abilities and achievements – used when you dislike someone because of this","example[15]":"‘He’s so full of himself, ’ Constance complained. ‘He thinks he can get away with anything.’","example[16]":"After the game she was really full of herself.","definition[8]":"something that you like telling people because you are proud of it","example[17]":"It is the company’s proud boast that it can deal with all a customer’s needs in one phone call.","example[18]":"Philip’s boast is that he started out without any outside financial backing.","example[19]":"‘Making knowledge work’ is the university’s phrase, and it is no idle boast  (=not a boast, but true).","note[3]":"an empty/idle/vain boast"}