{"word[0]":"rank","signpost[0]":"position in army/organization","definition[0]":"the position or level that someone holds in an organization, especially in the police or the army, navy etc","example[0]":"He was sentenced to prison and stripped of his rank  (=had his rank taken from him).","example[1]":"During the war Harold had risen to the rank of major.","note[0]":"rise to/be promoted to/attain the rank of something","example[2]":"an officer of junior rank","note[1]":"high/senior/low/junior rank","example[3]":"officers below the rank of Colonel","note[2]":"rank of","example[4]":"He held  (=had) the  rank of Chief Inspector.","definition[1]":"a rank of people or things is a line or row of them","example[5]":"Everyone lines up in ranks, all facing the instructor.","example[6]":"On the shelves were rank after rank of liquor bottles.","note[3]":"rank after rank/rank upon rank","example[7]":"Silently, ranks of police edged closer to the crowds.","signpost[1]":"quality","definition[2]":"the degree to which something or someone is of high quality","example[8]":"While none of these pictures is of the first rank  (=of the highest quality), some are of interest.","signpost[2]":"social class","definition[3]":"someone’s position in society","example[9]":"people of all ranks in society","example[10]":"He came from a family of rank  (=one from a high social class).","signpost[3]":"taxi","definition[4]":"a place where taxis wait in a line to be hired","example[11]":"I called a taxi from the rank outside.","collocation[0]":"hold a rank","example[12]":"From 1 Dec 1914 to 31 Oct 1915 he held the rank of captain.","collocation[1]":"rise to/achieve/reach a rank","example[13]":"He rose to the rank of colonel.","collocation[2]":"be promoted to a rank","example[14]":"He was promoted to the rank of Captain.","collocation[3]":"be stripped of your rank","example[15]":"The officer was stripped of his rank for his part in affair.","collocation[4]":"high/low/middle rank","example[16]":"Her father had been an army officer of fairly high rank.","collocation[5]":"senior/junior rank","example[17]":"He held a junior rank in the infantry.","collocation[6]":"cabinet/ministerial rank","example[18]":"As promised, a minister of cabinet rank has now been appointed to supervise its operation","type[0]":"intransitive always + adverb/preposition, not in progressive","definition[5]":"to have a particular position in a list of people or things that have been put in order of quality or importance","example[19]":"He ranked high among the pioneers of 20th century chemical technology.","note[4]":"rank high/low","example[20]":"Today’s match ranks as one of the most exciting games that these two have ever played.","note[5]":"rank as/among","example[21]":"We rank among the safest countries in the world.","example[22]":"Cuvier wanted to turn natural history into a science that would rank with physics and chemistry.","note[6]":"rank with/alongside","definition[6]":"to decide the position of someone or something on a list based on quality or importance","example[23]":"It is not always easy to rank the students in order of ability.","example[24]":"Agassi was at that time ranked sixth in the world.","note[7]":"be ranked fourth/number one etc","definition[7]":"to have a higher rank than someone else","synonym[0]":"outrank","example[25]":"A general ranks a captain.","definition[8]":"to arrange objects in a line or row","example[26]":"There were several pairs of riding boots ranked neatly in the hall.","definition[9]":"if something is rank, it has a very strong unpleasant smell","example[27]":"the rank odour of sweat and urine","note[8]":"rank smell/odour","definition[10]":"used to emphasize a bad or undesirable quality","example[28]":"an example of this government’s rank stupidity","example[29]":"They make us look like rank amateurs  (=not at all good or professional).","definition[11]":"rank plants are too thick and have spread everywhere","example[30]":"rank grass and weeds","definition[12]":"a particular level of job in an organization, especially a government organization or the army","example[31]":"His father retired with the rank of major.","example[32]":"Knight-Ridder named Maxwell King, 46, to succeed Mr. Roberts, but at a lower rank.","example[33]":"The companies have been trying to reduce the number of management ranks in a bid to be more cost-efficient.","definition[13]":"a particular position in a list that has been put in order of quality or importance","example[34]":"No US airline broke the top 10 rank (=no US airline was higher than 10th) in an airline survey released yesterday.","definition[14]":"to have a particular position in a list that has been put in order of quality or importance","example[35]":"It ranks in the top 3% of all mutual funds.","definition[15]":"to decide the position of something or someone in a list in order of quality or importance","example[36]":"The firm was ranked the number five underwriter of US bond and stock issues.","example[37]":"The real estate executives ranked the Northeast as the least attractive area for development.","note[9]":"rank something as something"}