{"word[0]":"get through","signpost[0]":"do work","definition[0]":"to do an amount of work","example[0]":"We got through half the application forms this morning.","example[1]":"We’ve got a lot of work to get through.","signpost[1]":"use something","definition[1]":"to use a lot of something","example[2]":"You wouldn’t believe the amount of food children can get through in a week!","signpost[2]":"spend money","definition[2]":"to spend a lot of money","example[3]":"He can get through £100 in one evening.","signpost[3]":"difficult time","definition[3]":"to come successfully to the end of an unpleasant experience or period of time, or to help someone do this","example[4]":"I don’t know how we’re going to get through the winter.","example[5]":"It was their love that got me through those first difficult months.","signpost[4]":"test/competition","definition[4]":"to be successful in a test or competition, or to make sure that someone or something is successful","example[6]":"I finally managed to get through my driving test.","example[7]":"I knew it was going to be difficult to get the car through its MOT test.","example[8]":"Liverpool have got through to the final of the FA Cup.","note[0]":"get (somebody/something) through (something) to","signpost[5]":"reach a person/place","definition[5]":"to reach a place or person that is difficult to reach","example[9]":"Aid agencies have been unable to get through to the thousands of refugees stranded on the border.","signpost[6]":"by telephone","definition[6]":"to succeed in speaking to someone on the telephone","example[10]":"I tried phoning her office, but I couldn’t get through.","example[11]":"At last I managed to get through to one of the managers.","signpost[7]":"new law","definition[7]":"if a new law gets through parliament, or if someone gets it through, it is officially approved","example[12]":"Anti-hunting legislation will never get through the House of Lords.","example[13]":"Once again we failed to get the Bill through Parliament.","definition[8]":"to succeed in making someone understand something, especially when this is difficult","example[14]":"Including a joke gives your message impact and more chance of getting through.","example[15]":"The party seems unable to get through to young voters.","definition[9]":"to succeed in having a plan, law etc approved by an official group","example[16]":"His deficit reduction plan eventually got through Congress.","definition[10]":"to succeed in reaching someone by telephone","example[17]":"The brokers received so many phone calls that many investors couldn’t get through.","example[18]":"It could take a client up to half an hour to get through to his dealer.","definition[11]":"to deal with a large number of things in a particular order","example[19]":"We never seem to get through all the items on the agenda.","definition[12]":"to manage to come to the end of a difficult situation or experience","example[20]":"The company got through a major restructuring without making any redundancies.","definition[13]":"to use a lot of something or spend a lot of money","example[21]":"He got through at least $500 every weekend.","definition[14]":"if the price of something gets through a particular level on a financial market, it rises above that level","example[22]":"The failure of the dollar to get through 79.15 yen prompted the sudden sell-off."}