{"word[0]":"economically","definition[0]":"in a way that is related to systems of money, trade, or business","example[0]":"In economically advanced countries, women marry later.","definition[1]":"in a way that uses money, goods, time etc without wasting any","example[1]":"We produce food as economically as possible.","example[2]":"Small trees use space in the garden economically.","collocation[0]":"economically developed/advanced","example[3]":"the economically developed countries of Western Europe","collocation[1]":"economically successful","example[4]":"an economically successful area","collocation[2]":"economically powerful","example[5]":"economically powerful countries like the US","collocation[3]":"economically depressed","example[6]":"Economically depressed areas in the northeast will receive extra EU funding.","collocation[4]":"economically dependent on","example[7]":"The country is still economically dependent on agriculture.","collocation[5]":"economically viable/feasible","example[8]":"Most of the coal mines in the area are no longer economically viable.","collocation[6]":"economically active","example[9]":"A lot of older women are not economically active.","collocation[7]":"economically independent","example[10]":"Societies change when women become economically independent.","collocation[8]":"economically disadvantaged","example[11]":"Many of our students are from economically disadvantaged backgrounds.","collocation[9]":"develop economically","example[12]":"China is continuing to develop economically and politically.","definition[2]":"in a way that is related to systems of trade, money, business, industry etc","example[13]":"The country is in danger of collapsing economically and politically.","example[14]":"an economically depressed area","definition[3]":"in a way that makes a profit","example[15]":"Electric cars are not yet economically viable (=possible to produce and sell with a profit).","example[16]":"They are seeking new ways to produce the oil economically.","definition[4]":"in a way that uses time, money, goods etc carefully and without wasting any","example[17]":"We must use these resources economically."}