{"word[0]":"chance","definition[0]":"the possibility that something will happen, especially something you want","example[0]":"There’s always the chance that something will go wrong.","example[1]":"If we did move to London, I’d stand a much better chance (=have a much better chance) of getting a job.","example[2]":"There is little chance of her being found alive.","example[3]":"Chances are (=it is likely that) you’ll be fine.","example[4]":"What are the team’s chances of success?","note[0]":"chance of","signpost[0]":"opportunity","definition[1]":"a time or situation which you can use to do something that you want to do","example[5]":"I’m sorry, I haven’t had a chance to look at it yet.","example[6]":"If someone invited me over to Florida, I’d jump at the chance (=use the opportunity eagerly).","example[7]":"Ralph was waiting for a chance to introduce himself.","note[1]":"chance to do something","example[8]":"our only chance of escape","signpost[1]":"luck","definition[2]":"the way some things happen without being planned or caused by people","example[9]":"As chance would have it, the one time I wanted to see her, she wasn’t in.","example[10]":"Dave had thought of every possibility, he was leaving nothing to chance.","note[2]":"leave something to chance","example[11]":"It was pure chance that they ended up working in the same office in the same town.","note[3]":"pure/sheer/blind chance","example[12]":"I bumped into her quite by chance in Oxford Street.","note[4]":"by chance","heading[0]":"– Meaning 1: the possibility that something will happen, especially something you want","collocation[0]":"have/stand a chance (of something)","example[13]":"I think you have a good chance of getting the job.","collocation[1]":"give somebody a chance of doing something","example[14]":"He has been given a fifty-fifty chance of being fit for Sunday’s match.","collocation[2]":"increase the chance of something","example[15]":"Certain foods increase the chance of heart disease.","collocation[3]":"improve the chance of something","example[16]":"The book shows you how to improve your chance of success.","collocation[4]":"reduce/lessen the chance of something","example[17]":"The talks were aimed at reducing the chance of war.","collocation[5]":"ruin any chance of something","example[18]":"Drinking alcohol can ruin any chance of weight loss.","collocation[6]":"jeopardize any chance of something","example[19]":"This could jeopardize any chance of a ceasefire.","collocation[7]":"a good chance","example[20]":"I think there is a good chance that he will say yes.","collocation[8]":"every chance","example[21]":"There’s every chance that the baby will survive.","collocation[9]":"some chance","example[22]":"There’s some chance of snow later this week.","collocation[10]":"a small/slight/slim chance","example[23]":"He only has a very small chance of being elected.","example[24]":"There’s a slight chance of some sunshine in the west.","collocation[11]":"no/little/not much chance","example[25]":"The prisoners knew there was little chance of escape.","collocation[12]":"a one in three/four/ten etc chance","example[26]":"People in their 30s have a one in 3,000 chance of getting the disease.","collocation[13]":"a fair chance","example[27]":"If you work, you have a fair chance of passing the test.","collocation[14]":"a sporting chance","example[28]":"The proposals had at least a sporting chance of being accepted.","collocation[15]":"a fighting chance","example[29]":"The Republican Party has a fighting chance at the next election.","collocation[16]":"a fifty-fifty chance","example[30]":"I’d say there is a 50–50 chance that the deal will go through.","collocation[17]":"an outside/a remote chance","example[31]":"He still has an outside chance of winning the championship.","collocation[18]":"a million-to-one chance/a one in a million chance","example[32]":"It must have been a million-to-one chance that we’d meet.","heading[1]":"– Meaning 2: a time or situation which you can use to do something that you want to do","collocation[19]":"get/have a chance to do something","example[33]":"I’d like a job in which I get the chance to travel.","collocation[20]":"give somebody/offer/provide a chance","example[34]":"I was given the chance to play the main part in the play.","example[35]":"Sport provides a chance for you to get outside with friends.","collocation[21]":"take a chance","example[36]":"If I was offered the chance to be in the team, I’d take it.","collocation[22]":"jump at a chance","example[37]":"Ed jumped at the chance to earn some extra money.","collocation[23]":"grab/seize a chance","example[38]":"As soon as she stopped speaking, I grabbed the chance to leave.","collocation[24]":"miss/lose a chance","example[39]":"He missed a chance to score just before half time.","collocation[25]":"throw away/pass up/turn down a chance","example[40]":"Imagine throwing up a chance to go to America!","collocation[26]":"welcome the chance to do something","example[41]":"I’d welcome the chance to discuss the problem with someone.","collocation[27]":"deserve a chance","example[42]":"Every kid deserves a chance in life.","collocation[28]":"blow a chance","example[43]":"He thought he’d blown his chance of happiness.","collocation[29]":"a second chance/another chance","example[44]":"The interview went badly, so I didn’t think they would give me a second chance.","collocation[30]":"somebody’s last chance","example[45]":"This is my last chance to try and pass the exam.","collocation[31]":"the chance of a lifetime","example[46]":"If you don’t decide soon, you’ll have missed the chance of a lifetime.","collocation[32]":"now’s your chance","example[47]":"You’re not working so now’s your chance to write a book.","collocation[33]":"given the chance/given half a chance","example[48]":"Goats will eat anything, given half a chance.","definition[3]":"to do something that you know involves a risk","example[49]":"I wasn’t sure if I’d got quite enough petrol to get me home, but I decided to chance it.","example[50]":"We decided not to chance our luck in the storm.","example[51]":"She’d never played before, but she was ready to chance her arm (=take a risk by doing something which may fail).","example[52]":"I decided to stay where I was. I couldn’t chance being seen.","note[5]":"chance doing something","definition[4]":"to happen in a way which is not expected and not planned","example[53]":"It chanced that we both went to Paris that year.","example[54]":"She chanced to be passing when I came out of the house.","definition[5]":"not planned or expected","synonym[0]":"accidental","example[55]":"A chance remark by one of his colleagues got him thinking.","example[56]":"A chance meeting with a journalist changed everything.","note[6]":"chance meeting/encounter/event etc","definition[6]":"the risk always present in certain business activities and accepted by business people","example[57]":"Every commercial business is subject to chance or risk."}