{"word[0]":"equipment","definition[0]":"the tools, machines etc that you need to do a particular job or activity","example[0]":"a shop selling camping equipment","example[1]":"some brand new computer equipment","example[2]":"a very useful piece of equipment","explanation[0]":"Equipment is an uncountable noun and is not used in the plural You say","example[3]":"The laboratory has all the latest equipment","bad_example[0]":"The laboratory has all the latest equipments","explanation[1]":"Equipment is always followed by a singular verb","example[4]":"All our equipment has  been carefully tested","explanation[2]":"When talking about one machine or tool, you say a piece/an item of equipment","example[5]":"A good compass is an essential piece of equipment when you are hiking","definition[1]":"the process of equipping someone or something","example[6]":"A lot of money was spent on the equipment of the new hospital.","note[0]":"equipment of","collocation[0]":"a piece of equipment","example[7]":"When you buy an expensive piece of equipment, you need to insure it.","form[0]":"ADJECTIVES/NOUN + equipment","collocation[1]":"new/modern/up-to-date","example[8]":"The factory has some of the most up-to-date equipment available.","collocation[2]":"military equipment","example[9]":"The sale of military equipment to the regime is banned.","collocation[3]":"medical equipment","example[10]":"life-saving medical equipment","collocation[4]":"electrical/electronic equipment","example[11]":"The store sells a wide range of electrical equipment.","collocation[5]":"computer/video/stereo etc equipment","example[12]":"Ageing computer equipment should be replaced, not upgraded.","collocation[6]":"essential/necessary/vital equipment","example[13]":"A compass is essential equipment when hiking.","collocation[7]":"standard equipment","example[14]":"Standard equipment on this model includes airbags, climate control and cruise control.","collocation[8]":"special equipment","example[15]":"You don’t need any special equipment, just a pair of running shoes.","collocation[9]":"office equipment","example[16]":"office equipment, such as photocopiers and printers","collocation[10]":"heavy equipment","example[17]":"The truck has to be able to carry tanks and other heavy equipment.","collocation[11]":"safety/protective equipment","example[18]":"Employers must provide safety equipment, and make sure it is used.","collocation[12]":"sporting/camping/skiing etc equipment","example[19]":"Can you help me load the camping equipment into the boot, please?","collocation[13]":"use equipment","example[20]":"Mr Gomez will now demonstrate how to use the equipment safely.","collocation[14]":"provide/supply equipment","example[21]":"a contract to supply drilling equipment to the mine","collocation[15]":"install equipment","example[22]":"We are installing new computerized equipment in place of the old machines.","collocation[16]":"need/require equipment","example[23]":"For scuba diving, you’ll need specialized equipment.","definition[2]":"the machines, tools, or objects that you use for doing something","example[24]":"All the camping equipment is in the garage.","example[25]":"You’ll do a better job if you have the right equipment.","example[26]":"We are raising money for equipment for our playgroup.","display[0]":"gear","definition[3]":"equipment and clothes for an activity that you do in your spare time","example[27]":"We loaded all our gear into the boat, and set off to go fishing.","example[28]":"I’ve decided to sell my climbing gear.","example[29]":"camping gear","display[1]":"kit","definition[4]":"things for a particular purpose or activity, especially ones kept together in their own container","example[30]":"You’ll find a hammer in my tool kit.","example[31]":"Do you have a first aid kit?","example[32]":"You can buy a special kit for damp-proofing your home.","display[2]":"apparatus","definition[5]":"tools and machines used for scientific, medical, and technical purposes","example[33]":"This experiment can be performed using the apparatus shown in the diagram.","example[34]":"Astronauts have special breathing apparatus.","display[3]":"stuff","definition[6]":"equipment that you use to do something","example[35]":"The builders have left all their stuff round the back of the house.","example[36]":"Where’s the decorating stuff?","display[4]":"things","definition[7]":"the equipment or clothes that you need for a particular activity","example[37]":"She went into the shed where her father kept his gardening things.","example[38]":"They got all the Christmas things out of the loft.","display[5]":"paraphernalia","definition[8]":"a lot of small things that are used for a particular purpose","example[39]":"All the paraphernalia for making tea and coffee stood on the bedside table.","example[40]":"The police found drug paraphernalia all over the house.","definition[9]":"all the special machines, tools etc that you need for a particular activity","example[41]":"The company has invested heavily in new equipment."}