{"word[0]":"style","signpost[0]":"way of doing something","definition[0]":"a particular way of doing, designing, or producing something, especially one that is typical of a particular place, period of time, or group of people","example[0]":"an attempt to use Japanese management style in a European business","example[1]":"The dinner will be served buffet-style.","example[2]":"Cuban-style black beans and rice","note[0]":"Baroque-/Swedish-/country- etc style","example[3]":"a Colonial-style house","example[4]":"different styles of handwriting","note[1]":"style of","signpost[1]":"somebody’s way of behaving","definition[1]":"the particular way that someone behaves, works, or deals with other people","example[5]":"Children have different styles of learning: some learn by seeing, some by hearing, some by doing.","example[6]":"I like your style (=approve of the way you do things), Simpson.","example[7]":"I can’t ask a man out – it’s not my style (=it is not the way I usually behave).","example[8]":"I don’t think the parachuting weekend is for me – the art class is more my style.","note[2]":"be more somebody’s style","signpost[2]":"art/literature/music","definition[2]":"a typical way of writing, painting etc that is used by a particular person or during a particular period of time","example[9]":"The paintings are in an expressionistic style.","example[10]":"Hemingway’s direct style","example[11]":"a play in the style of classical Greek tragedy","note[3]":"in the style of somebody/something","signpost[3]":"fashion/design","definition[3]":"a particular design or fashion for something such as clothes, hair, furniture etc","example[12]":"Car styles have changed radically in the past 20 years.","example[13]":"The rooms are furnished in a modern style.","note[4]":"traditional/modern style","definition[4]":"the quality of being fashionable","example[14]":"young women interested in style rather than comfort","example[15]":"Long skirts are back in style.","note[5]":"in/out of style","signpost[4]":"attractive quality","definition[5]":"a confident and attractive quality that makes people admire you, and that is shown in your appearance, or the way you do things","example[16]":"You may not like her, but she certainly has style.","example[17]":"The team played with style.","signpost[5]":"correct writing","definition[6]":"a way of using words or spelling that is considered correct","example[18]":"It’s not good style to use abbreviations in an essay.","definition[7]":"to design clothing, furniture, or the shape of someone’s hair in a particular way","example[19]":"These shoes have been styled for maximum comfort.","example[20]":"She has her hair styled by Giorgio.","definition[8]":"a way of doing something, designing something, or producing something, especially one that is typical of a particular time, place, or group of people","example[21]":"the Japanese style of stock investment","example[22]":"1980s-style excessive spending","example[23]":"American-style shopping malls","definition[9]":"the particular way that someone does something or deals with other people","example[24]":"an authoritarian style of leadership","example[25]":"His tough management style has upset some executives.","definition[10]":"a product with a particular design, shape, and appearance","example[26]":"Each diaper comes in ‘girl’ and ‘boy’ styles.","example[27]":"This is one of our new styles, a $135 dress shoe with a rubber sole.","definition[11]":"the official name or title of a company","example[28]":"The company traded under the style of Macron Ltd."}