{"word[0]":"so","definition[0]":"used to emphasize how great a feeling or quality is, or how large an amount is","example[0]":"It was so embarrassing!","example[1]":"Why didn’t you call? We were so worried.","example[2]":"I love her so much.","example[3]":"They’re being ever so quiet.","note[0]":"ever so","definition[1]":"as great, nice, many etc as this","example[4]":"Why are you being so horrible to me?","example[5]":"I’ve never seen so many people here before!","example[6]":"How had they achieved it in so short a time?","definition[2]":"used when emphasizing the degree or amount of something by saying what the result is","example[7]":"He was so weak that he could hardly stand up.","note[1]":"so ... (that)","example[8]":"There was so much smoke that they couldn’t see across the hallway.","example[9]":"Everything happened so quickly I hadn’t time to think.","example[10]":"The particles are so small as to be almost invisible.","note[2]":"so ... as to be","definition[3]":"used before or after a verb to emphasize that someone does something a lot or to a great degree","example[11]":"I wish you wouldn’t fuss so  (=as much as you do). It makes me nervous.","example[12]":"He does so enjoy reading your letters.","definition[4]":"used before a noun phrase to emphasize what you are saying – used especially by young people","example[13]":"He is just so not the right person for her.","type[0]":"not used with negative verbs","definition[5]":"used to add that what has just been said is also true about someone or something else","example[14]":"Joe was a little upset, and so was I.","note[3]":"so do I/so is he/so would Peter etc","example[15]":"He’s been ill, and so has his wife.","example[16]":"As the demand rises, so do prices.","definition[6]":"used to refer back to an idea, action, quality, situation etc that has just been mentioned","example[17]":"The troops will not advance until ordered to do so.","example[18]":"Did Luke sell them? And, if so, what happened to the money?","example[19]":"‘Has he lost a fortune?’ ‘So they say.’","example[20]":"‘Look – I’ve even cleaned the windows.’ ‘So I see.’","example[21]":"Parents can withdraw their child from school if they so wish.","example[22]":"‘Will I need my umbrella?’ ‘I don’t think so.’","note[4]":"hope so/think so/say so etc","example[23]":"If you want to go home, just say so.","example[24]":"The band is popular and likely to become more so.","note[5]":"be more so/less so/too much so","example[25]":"Jerry is very honest, perhaps too much so.","definition[7]":"used to get someone’s attention, especially in order to ask them a question","example[26]":"So, how was school today?","definition[8]":"used to check that you have understood something","example[27]":"So this is just a copy?","definition[9]":"used when asking a question about what has just been said","example[28]":"‘He’s going to Paris on business.’ ‘So when is he coming back?’","definition[10]":"used with a movement of your hand to show how big, high etc something or someone is","example[29]":"Oh, he’s about so tall, with brown hair and eyes.","definition[11]":"used to show that you have found something out about someone","example[30]":"So! You’ve got a new girlfriend?","definition[12]":"in the way that is described","example[31]":"Dorothy and Sarah continued to write to each other, and so began a lifelong friendship.","example[32]":"The furniture is so arranged that the interviewee and the interviewer are not physically separated by a desk.","note[6]":"so ... that","definition[13]":"used to say that a person’s behaviour or action is typical of that person","example[33]":"‘He was about half an hour late.’ ‘That is just so Chris.’","definition[14]":"used to say that something suits someone or is the type of thing they like","example[34]":"You must buy that jacket – it’s so you!","definition[15]":"used to introduce the next part of a story you are telling someone","example[35]":"So anyway, he goes in and his boots get stuck in the mud.","definition[16]":"used to tell someone that something does not matter","example[36]":"So what if we’re a little late?","example[37]":"‘She might tell someone.’ ‘So? No one will believe her.’","definition[17]":"used to say that someone does something because of the reason just stated","example[38]":"I was feeling hungry, so I made myself a sandwich.","explanation[0]":"In written English, people often prefer to use therefore or consequently rather than so, because they sound more formal:","example[39]":"She had previous experience, therefore she seemed the best candidate.","definition[18]":"the fifth note in a musical scale according to the sol-fa system"}