{"word[0]":"invest","definition[0]":"to buy shares, property, or goods because you hope that the value will increase and you can make a profit","example[0]":"I’ve got a few thousand dollars I’m looking to invest.","example[1]":"He had invested heavily (=invested a lot of money) in the bond market.","example[2]":"Oliver made a fortune by investing in antique furniture.","note[0]":"invest (something) in something","example[3]":"Williams invested a large sum of money in Swiss stocks.","definition[1]":"if a government, business, or organization invests in something, they spend a large amount of money to improve it or help it succeed","example[4]":"The city has invested millions of dollars in the museum.","example[5]":"The factory plans to invest in new computers.","explanation[0]":"In everyday English, people often say put money in/into something rather than invest in something:","example[6]":"He put money into his brother’s business.","example[7]":"The government put in millions of pounds.","definition[2]":"to use a lot of time, effort etc or spend money in order to make something succeed","example[8]":"It was very difficult to leave a home we had invested so much in.","note[1]":"invest something in something","definition[3]":"to buy shares or property, in order to make a profit","example[9]":"Why don’t you invest the money on the stock market?","example[10]":"He invested £50,000 in his brother’s business.","example[11]":"Investing in property is probably not a good idea right now.","display[0]":"put money into something","definition[4]":"to give money to a business, organization, activity etc, in order to help it develop and be successful","example[12]":"We’re looking for an investor who will put money into our business.","example[13]":"Every year the charity puts millions of dollars into research to find ways to treat cancer.","definition[5]":"to invest in a project or business, especially when the fact that you do this shows you support it","example[14]":"The scheme has been backed by several major companies.","example[15]":"The movie is backed by a powerful state-owned bank.","display[1]":"interest","definition[6]":"if you have an interest in a particular company, you own shares in it","example[16]":"In 1986 GM acquired a controlling interest (=enough shares to control what decisions are taken) in the sports car maker Lotus.","example[17]":"He has business interests throughout Europe.","definition[7]":"to buy shares, bonds, property etc in order to make a profit","example[18]":"People are so pessimistic about the future that they won’t invest at the moment.","example[19]":"The Singapore government is interested in investing abroad.","example[20]":"The fund hadinvested heavily in risky assets like junk bonds.","note[2]":"invest in","definition[8]":"to save money in a high interest bank account or to buy an insurance policy that pays BONUSES","example[21]":"Before investing, investors should ask about the financial soundness of the company that issues the annuity.","definition[9]":"to spend money on things that will make a business more successful and profitable","example[22]":"It is investing some $60 million to maintain its edge in technology.","example[23]":"The company has been investing hundreds of millions of dollars in new production facilities."}