{"word[0]":"advance","signpost[0]":"development/improvement","definition[0]":"a change, discovery, or invention that brings progress","example[0]":"a major advance","example[1]":"the advances made in the understanding of mental handicap","example[2]":"one of the great technological advances of the 20th century","note[0]":"technological/scientific/medical etc advance","example[3]":"Recent advances in genetics have raised moral questions.","note[1]":"advance in","example[4]":"an advance on previous treatments","note[2]":"advance on","signpost[1]":"forward movement","definition[1]":"forward movement or progress of a group of people – used especially to talk about soldiers","example[5]":"the enemy’s advance on St. Petersburg","definition[2]":"money paid to someone before the usual time, especially someone’s salary","example[6]":"a $500 advance","example[7]":"Krebs decided to ask for an advance on his salary.","definition[3]":"an increase in the price or value of something – used especially when talking about the stock exchange","signpost[2]":"move forward","definition[4]":"to move towards someone or something, especially in a slow and determined way – used especially to talk about soldiers","example[8]":"A line of US tanks slowly advanced.","example[9]":"Troops advanced on the rebel stronghold  (=moved towards it in order to attack it).","example[10]":"The army advanced across the plain.","note[3]":"advance across/through/towards","signpost[3]":"develop","definition[5]":"if scientific or technical knowledge advances, or if something advances it, it develops and improves","example[11]":"Our understanding of human genetics has advanced considerably.","example[12]":"The group’s research has done much to advance our knowledge of the HIV virus.","definition[6]":"to give someone money before they have earned it","example[13]":"Will they advance you some money until you get your first paycheck?","note[4]":"advance somebody something","example[14]":"I advanced $1,500 to Kramer last Thursday.","note[5]":"advance something to somebody","signpost[4]":"price","definition[7]":"if the price or value of something advances, it increases – used especially when talking about the stock exchange","signpost[5]":"time/date","definition[8]":"to change the time or date when an event should happen to an earlier time or date","example[15]":"The meeting has been advanced to ten o'clock.","definition[9]":"if you advance a film, clock, musical recording etc, or if it advances, it goes forward","definition[10]":"done before an event happens","example[16]":"A small fee is charged for this service and advance notice of at least two weeks is required.","example[17]":"A fair-minded employer will usually give employees plenty ofadvance warning of possible redundancies.","definition[11]":"an amount of money paid to someone before the usual time, or before a piece of work has been completed","example[18]":"We could offer you an advance of £1,000 and the rest on satisfactory completion of the book.","note[6]":"advance of","example[19]":"He had received an advance on his wages.","definition[12]":"an increase in the amount, level, or price of something","example[20]":"UK stocks have risen sharply, with further advances expected.","example[21]":"Analysts forecast a 6% decline in Italian car sales and an 8% advance in French sales.","definition[13]":"if you advance someone money, you lend it to them or give it to them, perhaps before they have earned it","example[22]":"Patrons advanced sums of money for building an art gallery.","example[23]":"Random House had advanced him the money to write a book.","definition[14]":"when the price of shares, currencies, goods etc advances, it increases","example[24]":"Gold prices advanced slightly in early trading.","example[25]":"Crude oil advanced $2.88 a barrel.","example[26]":"The dollar advanced against the yen.","note[7]":"advance against","definition[15]":"when profits or sales advance, they increase","example[27]":"Pre-tax profits advanced 4% to £8.4 million.","example[28]":"First-quarter sales advanced 36%.","definition[16]":"when a company advances, its profit increases","example[29]":"The company advanced 19.5%, lifting net profits to 1.25 billion rupees."}