{"word[0]":"correspondent","definition[0]":"someone who is employed by a newspaper or a television station etc to report news from a particular area or on a particular subject","example[0]":"Our correspondent in South Africa sent this report.","example[1]":"the political correspondent for ‘The Times’","note[0]":"political/foreign/legal etc correspondent","definition[1]":"someone who writes letters","example[2]":"I’m not a very good correspondent, I’m afraid.","form[0]":"ADJECTIVES/NOUN + correspondent","collocation[0]":"a foreign correspondent","example[3]":"He became a top BBC foreign correspondent.","collocation[1]":"our Beijing/Cairo/Washington etc correspondent","example[4]":"This report comes direct from our Tel Aviv correspondent.","collocation[2]":"a political correspondent","example[5]":"As our political correspondent wrote last week, this decision is welcome.","collocation[3]":"a newspaper correspondent","example[6]":"During the war he was employed as a newspaper correspondent.","collocation[4]":"a war correspondent","example[7]":"Being a war correspondent is a dangerous job.","collocation[5]":"an education/health/sports etc correspondent","example[8]":"Here is our sports correspondent with all the details.","collocation[6]":"a special correspondent","example[9]":"He was a special correspondent for animals and the environment.","definition[2]":"a person or organization, especially one in a foreign country, that you regularly do business with","example[10]":"Among a wide circle of friends and correspondents, Cayley seems to have been recognized as a generous and modest man.","definition[3]":"a bank in one country that acts for a bank in another country","example[11]":"Banks, by overseas representation and correspondents, are able to provide advice on economic, financial and commercial conditions in other countries.","example[12]":"Instructions are sent by airmail to a correspondent bank requesting it to credit the exporter or his bank with an appropriate amount in the exporter’s domestic currency."}