{"word[0]":"admit","signpost[0]":"accept truth","definition[0]":"to agree unwillingly that something is true or that someone else is right","example[0]":"‘Okay, so maybe I was a little bit scared, ’ Jenny admitted.","example[1]":"I must admit, I didn’t actually do anything to help her.","example[2]":"Admit it! I’m right, aren’t I?","example[3]":"Phillips openly admits to having an alcohol problem.","note[0]":"freely/openly/frankly etc admit","example[4]":"You may not like her, but you have to admit that she’s good at her job.","note[1]":"admit (that)","example[5]":"Paul admitted to me that he sometimes feels jealous of my friendship with Stanley.","note[2]":"admit to somebody (that)","example[6]":"Dana admitted feeling hurt by what I had said.","note[3]":"admit (to) doing something","signpost[1]":"accept blame","definition[1]":"to say that you have done something wrong, especially something criminal","synonym[0]":"confess","opposite[0]":"deny","example[7]":"No organization has admitted responsibility for the bombing.","example[8]":"Greene admitted causing death by reckless driving.","note[4]":"admit doing something","example[9]":"A quarter of all workers admit to taking time off when they are not ill.","note[5]":"admit to (doing) something","example[10]":"After questioning, he admitted to the murder.","signpost[2]":"allow to enter","definition[2]":"to allow someone to enter a public place to watch a game, performance etc","example[11]":"Only ticket-holders will be admitted into the stadium.","note[6]":"admit somebody to/into something","explanation[0]":"In everyday English, people usually say let someone in rather than admit someone:","example[12]":"They won’t let you in without a ticket.","signpost[3]":"allow to join","definition[3]":"to allow someone to join an organization, club etc","example[13]":"Drake was admitted into the club in 1997.","signpost[4]":"hospital","definition[4]":"if people at a hospital admit someone, that person is taken in to be given treatment, tests, or care","example[14]":"What time was she admitted?","collocation[0]":"refuse to admit something","example[15]":"He refused to admit that it was his fault.","collocation[1]":"be forced to admit something","example[16]":"The government was forced to admit that the policy had never really worked.","collocation[2]":"somebody has to admit something","example[17]":"In the end, he had to admit I was right.","collocation[3]":"freely/readily/openly admit something","example[18]":"I freely admit I’m hopeless at maths.","collocation[4]":"grudgingly/reluctantly admit something","example[19]":"He grudgingly admitted that I was a better swimmer than him.","collocation[5]":"be willing/prepared/happy/ready to admit something","example[20]":"She was willing to admit that she’d made a mistake.","collocation[6]":"be ashamed/loath to admit something","example[21]":"He was ashamed to admit that he had lied to her.","collocation[7]":"I must admit something","example[22]":"I must admit I hate camping.","collocation[8]":"I hate to admit it but …","example[23]":"I hate to admit it but it looks like we’ve failed.","collocation[9]":"be the first to admit something","example[24]":"I know I’m lazy – I’m the first to admit it!","collocation[10]":"I don’t mind admitting something","example[25]":"I’m scared and I don’t mind admitting it.","explanation[1]":"You admit that you did something","example[26]":"He admitted that he had made a mistake","explanation[2]":"You admit to someone that  you did something","example[27]":"He admitted to me that he had made a mistake","bad_example[0]":"He admitted me that he had made a mistake","explanation[3]":"You admit doing something","example[28]":"He admitted making a mistake","bad_example[1]":"He admitted to make a mistake","explanation[4]":"You  confess that you did something","example[29]":"He confessed that he had stolen the money","explanation[5]":"You  confess to someone that you did something","example[30]":"He confessed to the police that he had stolen the money","heading[0]":"admit something is true","definition[5]":"to agree unwillingly that something is true","example[31]":"He admitted that the company was having financial difficulties.","example[32]":"I must admit I was disappointed by their reaction.","display[0]":"concede","definition[6]":"to admit something in a discussion or argument","example[33]":"‘You may be right, ’ Bridget conceded.","example[34]":"It was a decision which he now concedes was incorrect.","display[1]":"acknowledge","definition[7]":"to say that something is true or that a situation exists","example[35]":"The report acknowledges that research on animals is not always a reliable guide when it comes to humans.","example[36]":"They do not want to acknowledge the fact that things have changed.","definition[8]":"to admit something that you feel embarrassed or ashamed about","example[37]":"Bradley confessed that he struggled to finish the race.","example[38]":"I must confess I don’t like his wife at all.","display[2]":"Granted/I grant you","definition[9]":"used when admitting that something is true, although you do not think it makes much difference to the main point. Granted is usually used at the beginning of a sentence, or on its own","example[39]":"She has a lot of experience, I grant you, but she’s not good at managing people.","example[40]":"Granted he did play well in the last game, but generally his form hasn't been very good recently.","heading[1]":"admit you have done something wrong","example[41]":"He admitted charges of theft and false accounting.","example[42]":"Bennett admitted killing his wife.","definition[10]":"to tell the police or someone in authority that you have done something bad, especially when they have persuaded you to do this","example[43]":"He finally confessed that he had stolen the money.","example[44]":"They told him that if he confessed he would get a lighter sentence.","display[3]":"own up","definition[11]":"to admit that you have done something wrong, usually something that is not very serious. Own up is more informal than admit or confess","example[45]":"He owned up to the mistake straight away.","display[4]":"fess up","definition[12]":"to admit that you have done something wrong that is not very serious","example[46]":"Come on, fess up! Where were you last night?","display[5]":"come clean","definition[13]":"to finally admit something bad that you have been trying to hide","example[47]":"They want the government to come clean on where all the money has gone.","definition[14]":"to allow someone to enter a place or become a member of a group, organization, school etc","example[48]":"Both republics are now hoping to be admitted to the IMF.","note[7]":"admit somebody/something to something","definition[15]":"to accept legal liability for something","example[49]":"The multinational has now admitted liability for its negligence."}