{"word[0]":"divide","signpost[0]":"separate","definition[0]":"if something divides, or if you divide it, it separates into two or more parts","example[0]":"Scientists traditionally divide the oceans into zones.","note[0]":"divide something into something","example[1]":"The book is divided into six sections.","example[2]":"Here, the river divides into three channels.","note[1]":"divide into","signpost[1]":"keep separate","definition[1]":"to keep two areas separate from each other","example[3]":"The Wall used to divide East and West Berlin.","example[4]":"Only a thin curtain divided her cabin from his.","note[2]":"divide something from something","signpost[2]":"share","definition[2]":"to separate something into parts and share them between people","example[5]":"The money will be divided equally among the charities.","note[3]":"divide something between/among somebody/something","signpost[3]":"spend time/energy","definition[3]":"if you divide your time, energy etc between different activities or places, you spend part of your time doing each activity or in each place","example[6]":"She divides her time between New York and Paris.","note[4]":"divide something between something/somebody","definition[4]":"to calculate how many times one number contains a smaller number","example[7]":"If you divide 21 by 3, you get 7.","note[5]":"divide something by something","example[8]":"‘What’s six divided by three?’ ‘Two’.","definition[5]":"to be contained exactly in a number one or more times","example[9]":"8 divides into 64.","signpost[4]":"disagree","definition[6]":"to make people disagree so that they form groups with different opinions","example[10]":"The issue of cloning has sharply divided voters.","definition[7]":"a strong difference between the beliefs or way of life of groups of people, that may make them hate each other","example[11]":"The North/South divide is characteristic of Britain.","example[12]":"people on both sides of the political divide","note[6]":"cultural/political/racial etc divide","definition[8]":"a line of high ground between two river systems","synonym[0]":"watershed"}