{"word[0]":"squeeze","definition[0]":"to press something firmly together with your fingers or hand","example[0]":"She smiled as he squeezed her hand.","example[1]":"He squeezed the trigger, but nothing happened.","signpost[0]":"press out liquid","definition[1]":"to get liquid from something by pressing it","example[2]":"Squeeze the oranges.","example[3]":"Try to squeeze a bit more out.","note[0]":"squeeze something out","example[4]":"Squeeze a bit of lemon juice onto the fish.","note[1]":"squeeze something on/onto something","signpost[1]":"small space","definition[2]":"to try to make something fit into a space that is too small, or to try to get into such a space","synonym[0]":"squash","example[5]":"Five of us squeezed into the back seat.","note[2]":"squeeze into","example[6]":"He had squeezed through a gap in the fence.","note[3]":"squeeze through/past","example[7]":"We could probably squeeze in a few more people.","note[4]":"squeeze somebody/something in","signpost[2]":"just succeed","definition[3]":"to succeed, win, or pass a test by a very small amount so that you only just avoid failure","example[8]":"Greece just squeezed through into the next round.","signpost[3]":"limit money","definition[4]":"to strictly limit the amount of money that is available to a company or organization","example[9]":"The government is squeezing the railways’ investment budget.","definition[5]":"an act of pressing something firmly with your fingers or hand","example[10]":"Marty gave her hand a little squeeze.","definition[6]":"a situation in which wages, prices, borrowing money etc are strictly controlled or reduced","example[11]":"a credit squeeze","example[12]":"All manufacturers are feeling the squeeze  (=noticing the effects of a difficult financial situation).","example[13]":"cuts due to the squeeze on public sector spending","note[5]":"squeeze on","example[14]":"Health care spending is being squeezed.","example[15]":"The firm says that its profit margin is gettingsqueezed by rising costs for its primary raw material.","definition[7]":"to get the most you possibly can from something","example[16]":"Johnson was known to squeeze every dollar out of every contract.","example[17]":"Company managers can squeeze more from their capital assets if they choose markets carefully and set clearer goals.","definition[8]":"a situation in which wages, prices, borrowing money etc are strictly limited, especially by a government in order to control inflation","example[18]":"The union is protesting against the 1.5% pay squeeze.","example[19]":"a squeeze on gross margins"}