{"word[0]":"sum","definition[0]":"an amount of money","example[0]":"He owes me a large sum of money.","example[1]":"Bill wants to spend a large sum on modernizing the farm.","note[0]":"large/substantial/considerable etc sum","example[2]":"We should be happy to buy it for a modest sum.","note[1]":"small/modest/trifling etc sum","example[3]":"the sum of £4,000","note[2]":"sum of","signpost[0]":"calculation","definition[1]":"a simple calculation by adding, multiplying, dividing etc, especially one done by children at school","collocation[0]":"a sum of money","example[4]":"We urge people not to keep large sums of money in their houses.","collocation[1]":"a large/considerable/substantial sum","example[5]":"He lost a substantial sum of money on the deal.","collocation[2]":"a huge/enormous/vast sum","example[6]":"The company has invested huge sums in research.","collocation[3]":"a five-figure/six-figure/seven-figure etc sum","example[7]":"The newspaper paid a six-figure sum for the photograph of the princess.","collocation[4]":"a small sum","example[8]":"Each year the inhabitants had to pay a small sum for the use of the pasture.","collocation[5]":"a modest sum","example[9]":"She had paid a modest sum for the paintings.","collocation[6]":"an undisclosed sum","example[10]":"He sold the company for an undisclosed sum.","collocation[7]":"a tidy sum","example[11]":"I had managed to save a tidy sum.","collocation[8]":"the total sum","example[12]":"The total sum lost is believed to be around £2 million.","collocation[9]":"the princely sum of ...","example[13]":"They were surviving on the princely sum of £50 a week.","example[14]":"For the princely sum of $8 million you too could live in a mansion like this.","example[15]":"Large sums of money are spent on advertising campaigns.","example[16]":"The company was sold for a sum estimated at $2.3 billion.","definition[2]":"the total produced when you add two or more numbers together","example[17]":"The sum of the loans was nearly 360 billion yen.","definition[3]":"a simple calculation done by adding, multiplying, dividing etc","example[18]":"You will have to do your sums (=calculate all the amounts involved), because interest-free credit may not be the cheapest way to buy."}