{"word[0]":"sale","definition[0]":"when you sell something","example[0]":"Harvey gets a $50 commission every time he makes a sale  (=sells something as part of his job).","example[1]":"Car salesmen will often bring down the price rather than lose a sale  (=fail to sell something).","example[2]":"arms sales to Iran","example[3]":"The use and sale of marijuana remains illegal.","note[0]":"sale of","definition[1]":"a period of time when shops sell their goods at lower prices than usual","example[4]":"Marsdon’s department store is having a sale this week.","example[5]":"I picked up some real bargains in the January sales this year.","note[1]":"the sales","definition[2]":"an event at which things are sold to the person who offers the highest price","synonym[0]":"auction","example[6]":"a sale of 17th-century paintings","heading[0]":"– Meaning 1: when you sell something","collocation[0]":"make a sale","example[7]":"A salesman may communicate perfectly well with a customer but fail to make a sale.","collocation[1]":"lose a sale","example[8]":"Harry lost the sale because he was not persistent enough.","collocation[2]":"a quick sale","example[9]":"He wants a quick sale, so he might reduce the price.","form[0]":"ADJECTIVES/NOUN + sales","example[10]":"The company has reported continuing strong sales.","collocation[3]":"disappointing","example[11]":"Sales for the first three months of this year were disappointing.","collocation[4]":"record sales","example[12]":"The Ford Fiesta has achieved record sales in Italy.","collocation[5]":"car/ticket/book etc sales","example[13]":"Car sales have fallen every month for the past two years.","collocation[6]":"annual sales","example[14]":"The company has annual sales of over $300 million.","collocation[7]":"worldwide sales","example[15]":"Worldwide sales of wine are increasing.","collocation[8]":"retail sales","example[16]":"The volume of retail sales was 0.3 percent higher than in the previous quarter.","collocation[9]":"export sales","example[17]":"Export sales rose for the sixth consecutive month.","collocation[10]":"high-street sales","example[18]":"Last month saw record high-street sales.","collocation[11]":"sales increase/rise/grow/go up","example[19]":"Sales rose by 9% last year.","collocation[12]":"sales fall/drop/go down","example[20]":"European sales have fallen by 12%.","collocation[13]":"sales improve","example[21]":"Sales are expected to improve over the coming year.","collocation[14]":"sales soar","example[22]":"Computer sales soared as prices continued to come down.","collocation[15]":"sales slump","example[23]":"Meat sales have slumped following the most recent health scare.","form[1]":"sales + NOUN","collocation[16]":"sales figures","example[24]":"The company said its sales figures continued to show growth.","collocation[17]":"a sales target","example[25]":"It achieved only 20% of its sales target.","collocation[18]":"the sales force","example[26]":"The sales force had grown from 40 to 270.","collocation[19]":"sales performance","example[27]":"There has been an encouraging improvement in sales performance.","collocation[20]":"the sales forecast","example[28]":"The sales forecast is for a 12% increase in sales over the current year.","collocation[21]":"an increase/growth in sales","example[29]":"The company is expecting a 20% increase in sales next year.","collocation[22]":"a fall/drop in sales","example[30]":"Some jobs may be cut following a big drop in sales.","collocation[23]":"the volume of sales","example[31]":"Because of its high volume of sales, the company can keep prices low.","definition[3]":"the act of selling someone property, food, or other goods","example[32]":"Tickets go on sale (=become available to buy) later this week.","example[33]":"The public protested at the sale of land for industrial development.","example[34]":"A house sale may be completed in four weeks.","example[35]":"Every time we make a sale, I get $50 commission.","example[36]":"Rather than lose a sale, car salesmen will often bring down the price.","definition[4]":"available to be bought","example[37]":"Executives said the firm may be for sale.","example[38]":"We don’t have a for sale sign up outside the building.","example[39]":"She recently put her house up for sale.","definition[5]":"available for a short time at a reduced price","example[40]":"I bought a set of iron skillets on sale for $8.99.","definition[6]":"a period of time when a shop sells its goods at lower prices than usual","example[41]":"The drugstore downtown is having a sale, and some things are down to half price.","definition[7]":"when shops are selling their goods at lower prices than usual","example[42]":"You might be able to get a cheap bed in the sales.","example[43]":"The cost of footwear was reduced by 12% at the January sales.","definition[8]":"an event at which things are sold, especially to the person who offers the highest price","example[44]":"a sale of 17th century paintings","definition[9]":"the total number of products that a company sells during a particular period of time","example[45]":"We grossed more than £500,000 in sales last year.","example[46]":"The rate of sales growth slowed in the second half of the year.","example[47]":"They’ve already reached their sales targets for this year.","example[48]":"Do you have this month’s sales figures?","definition[10]":"the part of a company that deals with selling products","example[49]":"I’d like to work in sales.","example[50]":"She is director of sales and marketing.","example[51]":"a sales manager"}