{"word[0]":"incentive","definition[0]":"something that encourages you to work harder, start a new activity etc","example[0]":"As an added incentive, there’s a bottle of champagne for the best team.","example[1]":"Awards provide an incentive for young people to improve their skills.","note[0]":"create/provide/give somebody an incentive","example[2]":"a recycling drive backed with financial incentives","note[1]":"economic/financial/tax etc incentives","example[3]":"Farmers lack any incentive to manage their land organically.","note[2]":"incentive to do something","collocation[0]":"have an incentive","example[4]":"Companies have an incentive to maximize efficiency.","collocation[1]":"give/offer somebody an incentive","example[5]":"If you want people to change their behaviour, it's a good idea to offer them some kind of incentive.","collocation[2]":"provide somebody with an incentive","example[6]":"Good teachers provide their students with incentives to learn.","collocation[3]":"create an incentive","example[7]":"We need to create an incentive for people to recycle their rubbish.","collocation[4]":"act as an incentive","example[8]":"The chance of promotion acts as an incentive for many employees.","collocation[5]":"a strong/powerful incentive","example[9]":"The possibility of acquiring wealth acts as a strong incentive in many people's lives.","collocation[6]":"a significant incentive","example[10]":"The high financial rewards provide a significant incentive.","collocation[7]":"a greater incentive","example[11]":"The scheme gives industry a greater incentive to tackle pollution.","collocation[8]":"the main incentive","example[12]":"What is the main incentive for people to join the army?","collocation[9]":"an extra/added incentive","example[13]":"The cash prize gives contestants an added incentive to do well.","collocation[10]":"economic/financial incentives","example[14]":"Doctors are encouraged through financial incentives to work in poor areas.","form[0]":"NOUN + incentive","collocation[11]":"cash incentives","example[15]":"The scheme gives farmers cash incentives to manage the countryside for wildlife.","collocation[12]":"tax incentives","example[16]":"Tax incentives are provided for employees to buy shares in their own companies.","collocation[13]":"price incentives","example[17]":"The strong December sales were attributed to attractive price incentives.","form[1]":"incentive + NOUN","collocation[14]":"an incentive scheme/system","example[18]":"The incentive scheme was introduced to encourage companies to use renewable energy sources.","collocation[15]":"have little/no incentive to do something","example[19]":"Poor farmers have little incentive to grow crops for export.","definition[1]":"something which is used to encourage people to do something, especially to make them work harder, produce more or spend more money","example[20]":"tax incentives for first-time home buyers","example[21]":"The company proposed a package of incentive-based pay raises."}