{"word[0]":"keen","signpost[0]":"want something","definition[0]":"wanting to do something or wanting something to happen very much","synonym[0]":"eager","example[0]":"He told me that he was keen to help.","note[0]":"keen to do something","example[1]":"I wasn’t keen on going there on my own.","note[1]":"keen on doing something","example[2]":"The government is keen for peace talks to start again.","note[2]":"keen for something to happen","example[3]":"The chairman is keen that the company should expand its product range.","note[3]":"keen that","signpost[1]":"hobby/interest","definition[1]":"someone who is keen on something is very interested in it or enjoys doing it very much","example[4]":"a keen photographer","example[5]":"keen golfers","example[6]":"She takes a keen interest in politics and current affairs.","example[7]":"I was mad keen on dinosaurs when I was little.","note[4]":"mad keen on something","example[8]":"Daniel’s very keen on tennis.","note[5]":"keen on","signpost[2]":"eager to work/learn","definition[2]":"someone who is keen is eager to work or learn, and enjoys doing it","example[9]":"keen students","example[10]":"The kids in my class are all very keen.","example[11]":"She was new in the job and keen as mustard  (=very keen).","signpost[3]":"sight/smell/hearing","definition[3]":"a keen sense of smell or keen sight or hearing is an extremely good ability to smell etc","example[12]":"Dogs have a very keen sense of smell.","example[13]":"She has a keen eye for  (=is good at noticing) talent.","signpost[4]":"mind","definition[4]":"someone with a keen mind is quick to understand things","example[14]":"a keen understanding of commerce","example[15]":"With her keen mind and good business sense, she soon became noticed.","definition[5]":"a keen feeling is one that is strong and deep","example[16]":"As she walked away, Joe felt a keen sense of loss.","definition[6]":"used to describe a situation in which people compete strongly","example[17]":"We won the contest in the face of keen competition.","definition[7]":"a keen knife or blade is extremely sharp","definition[8]":"a keen wind is cold and strong","signpost[5]":"prices","definition[9]":"keen prices are low","explanation[0]":"You are keen on something or keen on doing something","example[18]":"We’re all very keen on sports","bad_example[0]":"We’re all very keen of sports","definition[10]":"to sing a loud sad song for someone who has died","definition[11]":"if competition is keen, people are trying very hard to get an advantage over others doing the same thing","example[19]":"Business has become scarcer, competition keener and profit margins slimmer.","example[20]":"These properties are likely to attractkeen bidding in a buoyant property market.","definition[12]":"keen prices, rates etc are low when compared to competitors’ prices etc","example[21]":"London’s present system provideskeen prices for actively traded stocks.","example[22]":"the opportunity to achieve the keenest interest rates","definition[13]":"if someone is keen, they are very eager or interested in doing something","example[23]":"Investors already have shown keen interest in the $100 million issue.","example[24]":"Japanese investors are keen on obtaining more foreign assets.","example[25]":"The Swiss group is said to be keen to buy a stake in the company."}