{"word[0]":"advertise","definition[0]":"to tell the public about a product or service in order to persuade them to buy it","example[0]":"They no longer advertise alcohol or cigarettes at sporting events.","example[1]":"Colleges and universities have found that it pays to advertise  (=advertising brings good results).","example[2]":"Many companies will only advertise in the Sunday paper.","note[0]":"advertise (something) on television/in a newspaper etc","example[3]":"The inn is advertised as being from the early 16th century.","note[1]":"be advertised as something","definition[1]":"to make an announcement, for example in a newspaper or on a poster, that a job is available, an event is going to happen etc","example[4]":"a poster advertising the concert","example[5]":"I see they’re advertising for a new Sales Director.","note[2]":"advertise for","definition[2]":"to tell people about a product or service and try to persuade them to buy it, for example in a newspaper, television, or Internet advertisement","example[6]":"Some universities advertise on television.","example[7]":"She has signed a deal to advertise the company's haircare products.","display[0]":"promote","definition[3]":"to try to increase the sales or popularity of a product or event, for example by selling it at a lower price or talking about it on television","example[8]":"He's in London to promote his new album.","display[1]":"market","definition[4]":"to try to sell a product or service by deciding which type of people are likely to buy it and by making it interesting to them","example[9]":"The collection is being marketed as clothing for climbers and skiers.","example[10]":"Most companies have agreed not to market products to children under 12.","display[2]":"publicize","definition[5]":"to tell the public about something by writing about it in newspapers, speaking about it on television etc","example[11]":"He had done a lot of interviews to publicize his new book.","example[12]":"The hostages' case has been widely publicized.","display[3]":"hype","definition[6]":"to try to make people think something is good or important by advertising or talking about it a lot on television, the radio etc. Hype is often used when you do not trust the information","example[13]":"The boxing match was being hyped as the biggest fight of the decade.","display[4]":"plug","definition[7]":"to advertise a book, film etc by talking about it on television or radio","example[14]":"Marc was on the show to plug his new play.","definition[8]":"to tell people publicly about a product or service in order to persuade them to buy it","example[15]":"Beer and wine are both advertised on TV.","example[16]":"They were among the most heavily advertised cigarettes in the US.","example[17]":"The cars are advertised as being more economical to run.","note[3]":"advertise as","definition[9]":"to inform people publicly, for example in a newspaper or magazine, that a job is available and invite them to apply for it","example[18]":"They have advertised for two engineers."}