{"word[0]":"mandate","definition[0]":"if a government or official has a mandate to make important decisions, they have the authority to make the decisions because they have been elected by the people to do so","example[0]":"Sometimes a president thinks he has more of a mandate than he really does.","note[0]":"have/be given a mandate","example[1]":"The president was elected with a clear mandate to tackle violent crime.","note[1]":"mandate to do something","example[2]":"a popular mandate for election reform","note[2]":"mandate for","example[3]":"I sought a mandate from my constituents to oppose this tax.","note[3]":"mandate from","definition[1]":"an official instruction given to a person or organization, allowing them to do something","example[4]":"Matters debated in meetings do not become a mandate automatically.","definition[2]":"the power given to one country to govern another country","collocation[0]":"a clear mandate","example[5]":"The vote gave the trade union a clear mandate to pursue a better settlement.","collocation[1]":"a popular mandate","example[6]":"He called the election in the hope of receiving a popular mandate.","collocation[2]":"an electoral mandate","example[7]":"Ford took over when Nixon resigned, and thus did not have an electoral mandate of his own.","collocation[3]":"have a mandate","example[8]":"In Venezuela, Chavez said he had a mandate for reform.","collocation[4]":"give somebody a mandate","example[9]":"He hoped that signs of economic recovery would persuade voters to give him a mandate in the election.","collocation[5]":"win a mandate","example[10]":"He won his mandate to continue his premiership.","collocation[6]":"receive/obtain/get a mandate","example[11]":"On this issue he does seem to have received a clear mandate from the electorate.","collocation[7]":"seek a mandate","example[12]":"The government was seeking a mandate to continue the war.","definition[3]":"to tell someone that they must do a particular thing","example[13]":"These measures were mandated by the IMF.","example[14]":"Justice mandates that we should treat all candidates equally.","note[4]":"mandate that","definition[4]":"to give someone the right or power to do something","example[15]":"The committee was mandated to co-ordinate measures to help Poland.","note[5]":"be mandated to do something","explanation[0]":"Mandate is usually passive in this meaning","definition[5]":"the right and the power to do something that is given to a government or elected official as the result of a vote","example[16]":"The re-election of the present board of directors gives them a clear mandate to go forward with current corporate plans.","example[17]":"The board has acted with a clear shareholder mandate (=authority given by shareholders).","example[18]":"States are under a federal mandate (=a right given by the central US government) to increase fines for violation of worker safety and health rules.","definition[6]":"the period of time that a politician or elected official has their position","example[19]":"the day the President’s mandate came to an end","definition[7]":"an official document giving a bank or other financial institution the authority to deal with your account","definition[8]":"to give an official order that something must be done","example[20]":"The German system shows that it is possible to mandate universal health insurance through a variety of individual plans.","example[21]":"economists mandated to produce periodic reports on the state of the economy","note[6]":"mandate somebody to do something","example[22]":"The Securities and Exchange Commission is mandated by Congress to set accounting rules for US corporations.","definition[9]":"to make something mandatory","example[23]":"legislation that mandates employers to provide time off","example[24]":"Amendments to the Fair Housing Law mandated that all new housing must be accessible to the handicapped."}