{"word[0]":"careful","definition[0]":"trying very hard to avoid doing anything wrong or to avoid damaging or losing something","opposite[0]":"careless","example[0]":"a careful driver","example[1]":"Be careful to dispose of your litter properly.","note[0]":"careful to do something","example[2]":"He was being very careful with the coffee so as not to spill it.","note[1]":"careful with","example[3]":"I’ll be more careful what I say in the future.","note[2]":"careful who/what/how etc","example[4]":"Mara was careful about what she ate.","note[3]":"careful about","example[5]":"We were very careful that he didn’t find out.","note[4]":"careful (that)","heading[0]":"GRAMMAR: Prepositions with careful","explanation[0]":"You are careful with something","example[6]":"You must be careful with the knife","explanation[1]":"You are careful about what you do","example[7]":"I was careful about how I spoke to him","definition[1]":"paying a lot of attention to details, so that something is done correctly and thoroughly","example[8]":"Any school trip requires careful planning.","example[9]":"Careful consideration has been given to all applications.","note[5]":"careful consideration/attention/thought","example[10]":"careful analysis of the data","note[6]":"careful analysis/examination/study etc","definition[2]":"trying to avoid mistakes and do everything correctly by paying a lot of attention to details","example[11]":"Try to be more careful with your punctuation.","example[12]":"A careful inspection showed cracks in the foundation of the building.","display[0]":"methodical","definition[3]":"always doing things in a careful and well-organized way","example[13]":"He is very methodical in his work and likes to plan everything in advance.","example[14]":"This time the researchers used a more methodical approach to the problem.","display[1]":"thorough","definition[4]":"careful to examine or deal with every part of something, so that you do not miss anything important","example[15]":"There will be a thorough investigation into the circumstances of her death.","example[16]":"Our mechanics will check everything – they’re very thorough.","display[2]":"meticulous","definition[5]":"very careful about every small detail in order to make sure everything is done correctly","example[17]":"She keeps meticulous records of the students’ progress.","example[18]":"He was meticulous about keeping the place clean and tidy.","display[3]":"systematic","definition[6]":"using a fixed plan in a careful and well-organized way in order to do everything that you should","example[19]":"a systematic review of the scientific evidence","example[20]":"We need a systematic way to evaluate employees.","display[4]":"painstaking","definition[7]":"using a lot of time and effort to do something in a very careful and thorough way","example[21]":"The book is the result of ten years of painstaking research.","example[22]":"They began the long and painstaking task of translating his work into English."}