{"word[0]":"ideal","definition[0]":"the best or most suitable that something could possibly be","example[0]":"advice on how to reach your ideal weight","example[1]":"The scheme offers an ideal opportunity for youngsters to get training.","example[2]":"With so much rain, conditions are far from ideal.","example[3]":"an ideal place for a walk","example[4]":"An elastic waist makes these jeans ideal for the larger woman.","note[0]":"ideal for","definition[1]":"an ideal world, job, system etc is one that you imagine to be perfect, but that is not likely to really exist","example[5]":"In an ideal world there would be no need for a police force.","definition[2]":"a principle about what is morally right or a perfect standard that you hope to achieve","example[6]":"the long-vanished ideals of the 1950s","example[7]":"the ideal of a free and democratic society","note[1]":"ideal of","definition[3]":"a perfect example of what something should be like","example[8]":"Are our ideals of beauty changing?","collocation[0]":"a high ideal","example[9]":"Most politicians start out with high ideals.","collocation[1]":"a noble ideal","example[10]":"He was willing to sacrifice his life for this noble ideal.","collocation[2]":"a romantic ideal","example[11]":"I gave up my romantic ideal of love at the age of nineteen.","collocation[3]":"political ideals","example[12]":"Are you willing to fight for your political ideals?","collocation[4]":"revolutionary ideals","example[13]":"He still believed in the revolutionary ideals of equality and justice.","collocation[5]":"socialist/democratic/liberal ideals","example[14]":"He is committed to democratic ideals such as majority rule.","collocation[6]":"artistic ideals","example[15]":"His father had given up artistic ideals in pursuit of money.","collocation[7]":"believe in an ideal","example[16]":"We believe in the ideal of justice for all.","collocation[8]":"be committed to an ideal","example[17]":"Everyone in the party is committed to the same socialist ideals.","collocation[9]":"meet/live up to your ideals","example[18]":"The regime is not living up to its supposed democratic ideals.","collocation[10]":"fall short of your ideals","example[19]":"In appearance, she fell somewhat short of his ideals.","collocation[11]":"be true to your ideals","example[20]":"Stick to your principles and be true to your ideals.","collocation[12]":"cling to your ideals","example[21]":"He is a man who still clings to ideals of loyalty and friendship.","collocation[13]":"abandon your ideals","example[22]":"Have these young people abandoned the ideals of the Civil Rights Movement?","collocation[14]":"betray your ideals","example[23]":"He argues that Lenin betrayed his revolutionary ideals."}