{"word[0]":"crew","definition[0]":"all the people who work on a ship or plane","example[0]":"The plane crashed, killing two of the crew and four passengers.","example[1]":"a crew member","example[2]":"He joined the crew of a large fishing boat.","note[0]":"crew of","definition[1]":"a group of people working together with special skills","example[3]":"a TV camera crew","definition[2]":"a team of people who compete in rowing races","example[4]":"Who will be on the college crew?","definition[3]":"a group of people or friends – often used to show disapproval","example[5]":"The volunteers were a motley crew (=very mixed group of people).","example[6]":"Do you still hang out with the same crew?","definition[4]":"a group of musicians, especially ones playing hip hop, rap, or garage music","definition[5]":"a group of hip hop dancers","definition[6]":"a group of young people who spend time together, often one that is involved in crime, drugs, or violence","synonym[0]":"gang","heading[0]":"– Meaning 2: a group of people working together with special skills","form[0]":"types of crew","collocation[0]":"a film crew","example[7]":"The film crew were making a political documentary.","collocation[1]":"a camera crew","example[8]":"a BBC camera crew","collocation[2]":"a television/TV crew","example[9]":"Journalists and TV crews were waiting outside their house.","collocation[3]":"a stage crew","example[10]":"There is a cast of 100 and a stage crew of twenty.","collocation[4]":"a production crew","example[11]":"She’s a member of the production crew for a new television series.","collocation[5]":"a fire crew","example[12]":"Fire crews took more than three hours to bring the blaze under control.","collocation[6]":"an ambulance crew","example[13]":"The woman had to be rescued from her car by an ambulance crew.","collocation[7]":"the ground crew","example[14]":"The ground crew were refueling the plane.","collocation[8]":"the cabin crew","example[15]":"I was impressed by the polite and efficient cabin crew.","definition[7]":"to be part of the crew on a boat","example[16]":"The boat is crewed by ten men.","definition[8]":"all the people working on a ship or plane","example[17]":"These planes carry over 300 passengers and crew.","definition[9]":"all the people working on a ship or plane except the most important officers","example[18]":"The captain instructed the cabin crew to prepare for take-off."}