{"word[0]":"many","definition[0]":"a large number of people or things","opposite[0]":"few","example[0]":"Many people have to use a car to travel to work.","example[1]":"I don’t have many friends.","example[2]":"She has lived in Spain for many years.","example[3]":"Do you get many visitors?","example[4]":"Some of the houses have bathrooms but many do not.","example[5]":"His third novel is regarded by many  (=a lot of people) as his best.","example[6]":"There are so many things we disagree about.","example[7]":"Not many (=only a few) people can afford my services.","example[8]":"You’ve been reading too many romantic novels  (=more than you should).","example[9]":"One job loss is one too many (=one more than is acceptable, needed etc).","example[10]":"We should like to thank the many people who have written to us offering their support.","note[0]":"the many people/things etc","example[11]":"military equipment worth many millions of dollars","note[1]":"many hundreds/thousands/millions","example[12]":"Most of the young men went off to the war, and a great many never came back.","note[2]":"a great many/a good many/very many","example[13]":"It all happened a good many years ago.","example[14]":"Many of our staff work part-time.","note[3]":"many of","example[15]":"There are plenty of bars, many of them serving excellent food.","explanation[0]":"Many sounds formal in positive statements. In everyday English, people usually say a lot of.","example[16]":"A lot of people use a car to get to work.","example[17]":"There were a lot of people at the wedding.","heading[0]":"GRAMMAR: Patterns with many","explanation[1]":"You use many before plural nouns to talk about people or things in general","example[18]":"Many people were against the decision","explanation[2]":"You say many of the","example[19]":"Many of the houses are empty","bad_example[0]":"many of houses","explanation[3]":"You say many of my/her/his etc or many of them/us/you","example[20]":"Many of her friends have already left home","example[21]":"Many of them are excellent","explanation[4]":"You use many directly before an adjective","example[22]":"We saw many interesting things","bad_example[1]":"We saw many and interesting things","definition[1]":"a large number of people or things – used in everyday English in questions and negative sentences, and after ‘too’ and ‘so’. In formal or written English, you can also use it in other sentences","example[23]":"There weren’t many people at the meeting.","example[24]":"Did you get many birthday presents?","example[25]":"Many people voted against the proposal.","display[0]":"a lot","definition[2]":"many. A lot is less formal than many and is the usual phrase to use in everyday English","example[26]":"A lot of tourists visit Venice in the summer.","example[27]":"The club has a lot more members now.","display[1]":"dozens/hundreds/thousands/millions","definition[3]":"many – used when you cannot be exact but the number is two dozen or more, two hundred or more etc","example[28]":"At least five people died and dozens more were injured in a gas explosion.","example[29]":"They’ve wasted thousands of pounds on the project.","display[2]":"a large number of","definition[4]":"a lot of a particular type of person or thing","example[30]":"China plans to build a large number of nuclear power plants.","display[3]":"numerous","definition[5]":"many – used especially when saying that something has happened many times","example[31]":"We’ve contacted him on numerous occasions.","example[32]":"Numerous studies have shown a link between smoking and lung cancer.","display[4]":"countless/innumerable","definition[6]":"many – used when it is impossible to count or imagine how many. Innumerable is more formal than countless","example[33]":"He spent countless hours in the gym.","example[34]":"They had been given innumerable warnings.","display[5]":"a host of","definition[7]":"many – used especially when something seems surprising or impressive","example[35]":"Age is the biggest risk factor in a host of diseases.","example[36]":"People leave jobs for a whole host of reasons.","display[6]":"a raft of","definition[8]":"many – used especially when talking about ideas, suggestions, changes in business or politics","example[37]":"The report made a raft of recommendations.","example[38]":"The new government is planning a whole raft of  changes.","display[7]":"quite a few","definition[9]":"a fairly large number of people or things","example[39]":"We’ve had quite a few problems with the software.","example[40]":"I’ve met quite a few of his friends.","display[8]":"lots","example[41]":"I’ve invited lots of people.","example[42]":"‘How many cats has she got?’ ‘Lots!’","display[9]":"tons/loads","definition[10]":"many – a very informal use","example[43]":"I’ve got tons of books.","example[44]":"Have a strawberry – there are loads here."}