{"word[0]":"oath","plural[0]":"oaths","definition[0]":"a formal and very serious promise","example[0]":"The president took the oath of office  (=made the official public promises that every president makes when starting their job).","example[1]":"She could not break her oath.","example[2]":"an oath of allegiance to the Queen","note[0]":"oath of loyalty/allegiance/obedience etc","example[3]":"Servicemen have to swear an oath of loyalty to their country.","note[1]":"swear/take an oath","definition[1]":"a formal promise to tell the truth in a court of law","example[4]":"Witnesses are required to take the oath  (=make this promise).","example[5]":"The evidence was given under oath.","note[2]":"on/under oath","definition[2]":"an offensive word or phrase that expresses anger, surprise, shock etc","example[6]":"He was shouting out oaths as they led him away.","example[7]":"As children, they took an oath of friendship.","collocation[0]":"violate/break an oath","example[8]":"I do not expect you to violate your oath.","collocation[1]":"be bound by an oath","example[9]":"These chiefs were bound to him by oaths of loyalty.","collocation[2]":"an oath of loyalty/allegiance/obedience","example[10]":"They swore an oath of allegiance to the crown.","collocation[3]":"an oath of secrecy","example[11]":"Anyone who joined had to swear an oath of secrecy.","collocation[4]":"the oath of office","form[0]":"ADJECTIVES/NOUN + oath","collocation[5]":"a solemn oath","example[12]":"He swore a solemn oath never to tell.","collocation[6]":"a sacred oath","example[13]":"Stephen swore a sacred oath to recognise Matilda as Queen.","collocation[7]":"the presidential oath","example[14]":"the oldest person ever to take the presidential oath for the first time","collocation[8]":"the coronation oath","definition[3]":"a formal promise to do something","example[15]":"The president has taken an oath to support and defend the Constitution.","example[16]":"The new president will take the oath of office next week.","definition[4]":"to have made a formal promise to tell the truth in a court of law","example[17]":"The defendant acknowledged that he lied under oath.","example[18]":"The witnesses should be examined on oath.","definition[5]":"to make a formal promise to tell the truth in a court of law"}