{"word[0]":"go down","signpost[0]":"get lower","definition[0]":"to become lower in level, amount etc","example[0]":"His income went down last year.","example[1]":"Computers have gone down in price.","example[2]":"Spending has gone down by 2%.","note[0]":"go down by 10%/250/$900 etc","signpost[1]":"standard","definition[1]":"if something goes down, its quality or standard gets worse","example[3]":"This neighbourhood has really gone down in the last few years.","definition[2]":"to get a particular reaction from someone","example[4]":"His suggestion did not go down very well.","example[5]":"The movie went down very well in America.","example[6]":"The speech went down a treat with members  (=members liked it very much).","example[7]":"The idea went down like a lead balloon (=was not popular or successful).","definition[3]":"if food or drink goes down well, you enjoy it","example[8]":"I’m not that hungry so a salad would go down nicely.","signpost[2]":"go from one place to another","definition[4]":"to go from one place to another, especially to a place that is further south","example[9]":"We’re going down to Bournemouth for the weekend.","example[10]":"He’s gone down to the store to get some milk.","definition[5]":"to go to the shops, a club etc","example[11]":"Does anyone want to go down the pub tonight?","definition[6]":"if a ship goes down, it sinks","example[12]":"Ten men died when the ship went down.","definition[7]":"if a plane goes down, it suddenly falls to the ground","example[13]":"An emergency call was received shortly before the plane went down.","signpost[3]":"become less swollen","definition[8]":"to become less swollen","example[14]":"The swelling will go down if you rest your foot.","signpost[4]":"lose air","definition[9]":"if something that is filled with air goes down, air comes out and it becomes smaller and softer","example[15]":"Your tyre’s gone down.","signpost[5]":"be remembered","definition[10]":"to be recorded or remembered in a particular way","example[16]":"The carnival will go down in history (=be remembered for many years) as one of the best ever.","example[17]":"The talks went down as a landmark in the peace process.","signpost[6]":"competition/sport","definition[11]":"to lose a game, competition, or election","example[18]":"The Hawkers went down 5–9.","example[19]":"The government went down by 71 votes.","note[1]":" by","example[20]":"Liverpool went down to Juventus.","definition[12]":"to move down to a lower position in an official list of teams or players","example[21]":"United went down to the second division.","definition[13]":"if a computer goes down, it stops working for a short time","example[22]":"If one of the file servers goes down, you lose the whole network.","signpost[7]":"lights","definition[14]":"if lights go down, they become less bright","example[23]":"The lights went down and the curtain rose on an empty stage.","signpost[8]":"sun","definition[15]":"when the sun goes down, it appears to move down until you cannot see it anymore","definition[16]":"if the wind goes down, it becomes less strong","example[24]":"The wind had gone down but the night had turned chilly.","definition[17]":"to be sent to prison","example[25]":"He went down for five years.","definition[18]":"to happen","example[26]":"the type of guy who knows what’s going down","example[27]":"What’s going down?","signpost[9]":"leave university","definition[19]":"to leave Oxford or Cambridge University at the end of a period of study","definition[20]":"if a computer or machine goes down, it stops working because of a fault"}