{"word[0]":"avoid","definition[0]":"to prevent something bad from happening","example[0]":"Road safety is taught to young children to avoid road accidents.","example[1]":"It is important to take measures to avoid the risk of fire.","example[2]":"Alan narrowly avoided an accident.","example[3]":"The refugees left to avoid getting bombed.","note[0]":"avoid doing something","definition[1]":"to stay away from someone or something, or not use something","example[4]":"Everyone seemed to be avoiding Nick.","example[5]":"She carefully avoided his eyes  (=did not look directly at his face).","example[6]":"Pregnant women should avoid certain foods such as raw eggs.","example[7]":"Why did you speak to him? You usually avoid him like the plague (=try hard to avoid him).","definition[2]":"to deliberately not do something, especially something wrong, dangerous, or harmful","example[8]":"There are ways of legally avoiding taxes.","example[9]":"You should avoid over-spending in the first half of the year.","explanation[0]":"Avoid is followed by an -ing form, not an infinitive You say","example[10]":"They are able to avoid paying taxes","bad_example[0]":"They are able to avoid to pay taxes","heading[0]":"to avoid a person or place","definition[3]":"to deliberately not go near a person or place","example[11]":"Why have you been avoiding me?","example[12]":"We avoided Park Street because of the traffic.","display[0]":"stay away/keep away","definition[4]":"to avoid a person or place, especially a dangerous one","example[13]":"She walked along the path, keeping well away from the edge of the cliff.","example[14]":"That man is trouble – I’d stay away from him.","display[1]":"steer clear of somebody/something","definition[5]":"to avoid a person or place, because there could be problems if you do not","example[15]":"I usually steer clear of the kitchen when Alan’s cooking.","example[16]":"I’d steer clear of Matthew if I were you.","display[2]":"make a detour","definition[6]":"to avoid a place by travelling around it instead of through the centre","example[17]":"We had to make a long detour because of the floods.","heading[1]":"to avoid doing something","definition[7]":"to find a way of not doing something that you should do","example[18]":"Some people will do anything to avoid work.","display[3]":"get out of something","definition[8]":"to avoid doing something you should do or something you promised to do. Get out of  is more common than avoid in everyday spoken English","example[19]":"We promised we’d go – we can’t get out of it now.","display[4]":"wriggle out of something","definition[9]":"to avoid doing something you should do by making up excuses – used to show disapproval","example[20]":"He always seems to wriggle out of helping with the kids.","display[5]":"evade","definition[10]":"to avoid doing something that legally or morally you should do – used especially about taxes or responsibilities","example[21]":"It is an offence to evade taxes.","example[22]":"The US cannot evade its responsibility for the war.","definition[11]":"if you avoid tax, you manage to not pay it legally, for example by the way that you enter profits or losses into your accounts","example[23]":"Investing in this way allows savers to avoid tax upon withdrawal."}