{"definition[0]":"without delay","synonym[0]":"at once","example[0]":"Mix in the remaining ingredients and serve immediately.","example[1]":"The telephone rang, and he answered it immediately.","explanation[0]":"In everyday English, people usually say right away or, in British English, straight away rather than immediately:","example[2]":"Yes, I’ll do it right away.","definition[1]":"very soon before or after something","example[3]":"He retired immediately after the end of the war.","note[0]":"immediately after/following something","example[4]":"I can’t remember what happened immediately before the crash.","note[1]":"immediately before/preceding something","definition[2]":"very near to something","example[5]":"the seat immediately behind the driver","note[2]":"immediately behind/above/below/in front of etc something","definition[3]":"very soon after something else happens, and without any delay","example[6]":"Sam immediately offered to help.","definition[4]":"immediately – used especially for emphasis","example[7]":"Remove the pie from the oven and serve at once.","example[8]":"He came home at once when he heard his wife was ill.","display[0]":"right away","definition[5]":"immediately, especially because something is urgent. Right away and straightaway are less formal than immediately, and are very common in everyday spoken English","example[9]":"If this happens, let us know right away.","example[10]":"I apologized straightaway.","display[1]":"instantly","definition[6]":"if something happens instantly, it happens immediately after something else, with almost no time between","example[11]":"The boy was killed instantly.","example[12]":"The message is sent instantly from your computer.","display[2]":"right now/this minute","definition[7]":"if someone orders you to do something right now, they want you to do it immediately, especially because they are annoyed with you","example[13]":"The head teacher wants to see you right now.","definition[8]":"immediately, because it is important that you do something as soon as possible","example[14]":"If you lose your passport, you should contact the embassy without delay.","definition[9]":"as soon as","example[15]":"Immediately you begin to speak, he gives you his full attention."}