{"word[0]":"island","definition[0]":"a piece of land completely surrounded by water","example[0]":"The Cayman Islands","example[1]":"the Greek island of Crete","example[2]":"No cars are allowed on the island.","note[0]":"on an island","collocation[0]":"large/big","example[3]":"Novaya Zemlja is a large island in the Russian Arctic.","collocation[1]":"small/little","example[4]":"It’s a small island, barely twenty miles long.","collocation[2]":"uninhabited","example[5]":"There are over a thousand uninhabited islands in the seas around Greece.","collocation[3]":"remote","example[6]":"I remember visiting a remote island off the west coast of Ireland.","example[7]":"The islands were so remote that they could only be reached at certain times of the year.","collocation[4]":"volcanic","example[8]":"More than 3,500 years ago, the volcanic island of Thera erupted.","example[9]":"The island is volcanic and has very little vegetation.","collocation[5]":"a desert island","example[10]":"He was shipwrecked on a desert island.","collocation[6]":"a tropical island","example[11]":"What could be more romantic than a wedding on a tropical island?","collocation[7]":"a Greek/Spanish/Caribbean etc island","example[12]":"Chris told me he was sailing to the Greek islands.","collocation[8]":"an offshore island","example[13]":"The turtles lay their eggs on the beaches of offshore islands.","form[0]":"island + NOUN","collocation[9]":"island life","example[14]":"He had become used to the slow pace of island life.","collocation[10]":"an island paradise","example[15]":"She had booked a beach house on the island paradise of Phuket.","collocation[11]":"somebody’s island home","example[16]":"He had invited her back to his island home on Grand Cayman.","collocation[12]":"a chain/group of islands","example[17]":"Our destination was a chain of islands, sixty miles east of Taiwan.","collocation[13]":"the tip of an island","example[18]":"We live on the northernmost tip of the island of Barbados.","example[19]":"We visited the Greek island of Kos.","example[20]":"In the centre of a lake is a small island.","display[0]":"isle","definition[1]":"an island – used in poetry or in names of islands","example[21]":"The horse carried him to the windswept isle of Bujan.","example[22]":"It is the most southerly point in the British Isles.","example[23]":"the Windward Isles","example[24]":"the Isle of Wight","display[1]":"peninsula","definition[2]":"a piece of land almost completely surrounded by water but joined to a large area of land","example[25]":"There is a coastal path around the peninsula.","example[26]":"the Korean peninsula","display[2]":"archipelago","definition[3]":"a group of small islands that are in a line","example[27]":"He lives on an island at the eastern end of the Indonesian archipelago."}