{"word[0]":"final","definition[0]":"last in a series of actions, events, parts of a story etc","note[0]":"final demand British English (=the last bill you receive for money you owe before court action is taken against you)","example[0]":"The final episode will be shown tonight.","example[1]":"students preparing for their final examinations","example[2]":"Stone is filming the final instalment of his Vietnam trilogy.","example[3]":"the final stages in their relationship","example[4]":"They scored in the final minutes of the game.","example[5]":"The final whistle (=blown at the end of a game) was only seconds away when Redknapp equalised.","definition[1]":"being the result at the end of a process","example[6]":"the quality of the final product","example[7]":"Does anyone know the final score?","example[8]":"I do not know what the final outcome will be.","note[1]":"final result/outcome","definition[2]":"if a decision, offer, answer etc is final, it cannot or will not be changed","example[9]":"The judge’s decision is final.","example[10]":"We can advise the client, but in the end it is he who has the final say.","note[2]":"final decision/say/approval etc","example[11]":"Is that your final answer?","example[12]":"She’s not coming with us, and that’s final!","note[3]":"and that’s final!","definition[3]":"happening at or near the end of an event or process","synonym[0]":"last","example[13]":"In the final years of his life, Hervey achieved high office in the church.","definition[4]":"used to emphasize that the last thing in a series of events is very severe or damaging","synonym[1]":"ultimate","example[14]":"The vote of no confidence was the final humiliation for a government that had been clinging to office.","note[4]":"final indignity/humiliation","definition[5]":"the last and most important game, race, or set of games in a competition","example[15]":"He’s through to the men’s tennis final for the first time.","note[5]":"be through to/reach the final","example[16]":"the NBA finals","note[6]":"the finals","definition[6]":"an important test that you take at the end of a particular class in high school or college","definition[7]":"the last in a series of things, actions, or events","example[17]":"An official announcement was expected following a final meeting at the tyre manufacturer’s Milan headquarters.","example[18]":"The US-based company is still arguing with several contractors over thefinal bill.","example[19]":"foreign currency receipts from the final instalment of the sale of British Steel shares","definition[8]":"a decision, offer, agreement etc that is final cannot be changed","example[20]":"Members must vote in favor again next year for thedecision to becomefinal.","example[21]":"District Court judge Thomas Jackson issued a final ruling, calling for the company to be split into two parts.","definition[9]":"a final piece of writing or set of figures has been prepared in several stages, and is now considered to be correct","example[22]":"The changes agreed at our meeting of 25 March have been incorporated in the final draft.","example[23]":"The provisional estimate of retail sales volume for October was 119.0; thefinal estimate is closer to 116.9.","definition[10]":"a legal judgement or decision which is final and binding has to be obeyed because it has been decided in a court of law","example[24]":"Some contracts refer technical disputes to an expert whose decision isfinal and binding."}