{"word[0]":"development","signpost[0]":"growth","definition[0]":"the process of gradually becoming bigger, better, stronger, or more advanced","example[0]":"child development","example[1]":"opportunities for professional development","note[0]":"professional/personal development","example[2]":"a course on the development of Greek thought","note[1]":"development of","signpost[1]":"economic activity","definition[1]":"the process of increasing business, trade, and industrial activity","example[3]":"economic development in Russia","note[2]":"economic/industrial/business etc development","definition[2]":"a new event or piece of news that changes a situation","example[4]":"recent political developments in the former Soviet Union","example[5]":"We will keep you informed of developments.","signpost[2]":"new plan/product","definition[3]":"the process of working on a new product, plan, idea etc to make it successful","example[6]":"The funds will be used for marketing and product development.","example[7]":"Spielberg has several interesting projects under development.","note[3]":"under/in development","signpost[3]":"improvement","definition[4]":"a change that makes a product, plan, idea etc better","example[8]":"There have been significant computer developments during the last decade.","signpost[4]":"building process","definition[5]":"the process of planning and building new houses, streets etc on land","example[9]":"The land was sold for development.","note[4]":"for development","signpost[5]":"houses/offices etc","definition[6]":"a group of new buildings that have all been planned and built together on the same piece of land","example[10]":"a new housing development","heading[0]":"– Meaning 2: the process of increasing business, trade, and industrial activity","example[11]":"The US has been keen to encourage economic development in Egypt.","collocation[0]":"regional development","example[12]":"a programme of regional development in Eastern Europe","collocation[1]":"sustainable development","example[13]":"The government is committed to sustainable development and the protection of the environment.","collocation[2]":"overseas development","example[14]":"The Overseas Development Minister announced a £7,000,000 emergency aid programme for Somalia.","collocation[3]":"support/assist development","example[15]":"We need to facilitate development and economic activity that provides jobs.","form[0]":"development + NOUN","collocation[4]":"a development programme/plan/project","example[16]":"the United Nations Development Programme","collocation[5]":"a development agency","example[17]":"international development agencies","collocation[6]":"development work","example[18]":"Further funds are required to allow the development work to continue.","collocation[7]":"development aid","example[19]":"Education made up 22.5 percent of development aid last year.","definition[7]":"the growth or improvement of something, so that it becomes bigger or more advanced","example[20]":"promises of economic development and thousands of new jobs","example[21]":"development of the hand-held dictionary market in Japan","example[22]":"She saw the qualification as a part of her professional development.","example[23]":"helping staff with their career development","definition[8]":"the process of planning and making new products or providing new services","example[24]":"The new phone is the result of two years of development by AT&T units.","example[25]":"The Japanese approach to product development is spreading around Detroit.","definition[9]":"the process of planning and building new houses, offices etc, or improving existing ones","example[26]":"the development of office buildings, shopping centers and apartment complexes","example[27]":"low-income families living in high-rise housing developments","definition[10]":"the process of creating a plan, policy, or idea","example[28]":"the development of a coherent transport policy","definition[11]":"the using of a natural substance or product in order to make a profit","example[29]":"This includes $370 million for the development of the East Brae Field in the United Kingdom North Sea.","definition[12]":"a new event or piece of news that will have an effect on the present situation","example[30]":"The G-8 will discuss international financial developments, including the continued weakness of the yen."}