{"word[0]":"try","past_tense[0]":"tried","third_person_singular[0]":"tries","signpost[0]":"attempt","definition[0]":"to take action in order to do something that you may not be able to do","example[0]":"Let’s have a rest and then we’ll try again.","example[1]":"I tried everything to lose weight with no success.","example[2]":"I tried and tried (=kept making an effort) and eventually I was offered a job.","example[3]":"Try as he might (=as hard as he could), he could not get the incident out of his mind.","example[4]":"She dabbed at her face and tried hard not to sniff.","note[0]":"try hard/desperately (to do something)","example[5]":"I tried my best to comfort her.","note[1]":"try your best/hardest (to do something)","example[6]":"They didn’t get any goals, but it wasn’t for lack of trying.","note[2]":"it wasn’t for lack/want of trying","example[7]":"She couldn’t speak French if she tried.","note[3]":"you couldn’t do something if you tried","example[8]":"He tried to control his voice.","note[4]":"try to do something","example[9]":"She was trying not to cry.","example[10]":"Try and take some form of daily exercise.","note[5]":"try and do something","signpost[1]":"test/use","definition[1]":"to do or use something for a short while to discover if it is suitable, successful, enjoyable etc","example[11]":"It works really well – you should try it.","example[12]":"If I’m going out for a meal, I prefer to try something different.","note[6]":"try something new/different","example[13]":"Always try a sleeping bag for size before you buy it.","note[7]":"try something for size","example[14]":"They decided they would try living in America for a while.","note[8]":"try doing something","example[15]":"Try logging off and logging on again.","example[16]":"We tried the machine on hardwood and soft wood.","note[9]":"try something on somebody/something","example[17]":"Petra’s trying the baby on solid foods.","note[10]":"try somebody on something","signpost[2]":"food/drink","definition[2]":"to taste food or drink to find out if you like it","example[18]":"Would you like to try some crisps?","signpost[3]":"try to find somebody/something","definition[3]":"to go to a place or person, or call them, in order to find something or someone","example[19]":"Sorry, he’s not in. Would you like to try again later?","example[20]":"Let’s try Mouncy Street. He could be there.","signpost[4]":"door/window","definition[4]":"to attempt to open a door, window etc in order to see if it is locked","example[21]":"She tried the door and it opened.","example[22]":"He tried the handle but the door was locked.","definition[5]":"to examine and judge a legal case, or someone who is thought to be guilty of a crime in a court","example[23]":"The defence argued that a regional court was not competent to try their case.","example[24]":"He was tried for attempting to murder his wife.","note[11]":"be tried for something","explanation[0]":"Try is often passive in this meaning","example[25]":"She was trying hard not to show her impatience.","collocation[0]":"desperately","example[26]":"They try desperately to please other people.","collocation[1]":"unsuccessfully/in vain","example[27]":"He has tried unsuccessfully to quit smoking.","collocation[2]":"try your best/hardest","example[28]":"Try your best to block out other distractions.","explanation[1]":"If you try to do something, you attempt to do it","example[29]":"We must try to prevent this from happening again","explanation[2]":"If you try doing something, you do it in order to find out if it is enjoyable or produces the result you want","example[30]":"I’ve never tried bungee jumping","example[31]":"Try using margarine instead of butter","example[32]":"I tried to explain what was wrong.","example[33]":"He tries hard in class, but he’s finding the work difficult.","definition[6]":"to try to do something, especially something difficult. Attempt is more formal than try  and is used especially in written English","example[34]":"Any prisoner who attempts to escape will be shot.","example[35]":"He was attempting to climb one of the world’s highest mountains.","display[0]":"do your best","definition[7]":"to try as hard as you can to do something","example[36]":"We will do our best to help them.","display[1]":"make an effort to do something","definition[8]":"to try to do something, when you find this difficult","example[37]":"It is worth making an effort to master these skills.","example[38]":"She made a big effort to be nice to him.","display[2]":"struggle","definition[9]":"to try very hard to do something that is very difficult, especially for a long time","example[39]":"She’s still struggling to give up smoking.","example[40]":"Many of these families are struggling to survive.","display[3]":"strive","definition[10]":"to try very hard to achieve something","example[41]":"The company must constantly strive for greater efficiency.","display[4]":"endeavour","definition[11]":"to try hard to do something","example[42]":"Each employee shall endeavour to provide customers with the best service possible.","display[5]":"have a go/try","definition[12]":"to try to do something, especially when you are not sure that you will succeed","example[43]":"I’m not very good at fixing taps, but I’ll have a go.","example[44]":"Do you want to have another try?","display[6]":"see if you can do something","definition[13]":"to try to do something – used when offering to do something, or suggesting that someone should do something","example[45]":"I’ll see if I can get you a ticket.","example[46]":"See if you can persuade her to come.","definition[14]":"an attempt to do something","example[47]":"She didn’t manage to break the record, but it was a good try.","example[48]":"‘You really think you can do that?’ ‘I’m going to have a try.’","example[49]":"‘What are the chances for getting tickets now?’ ‘I guess I could give it a try.’","example[50]":"It might sound a ludicrous excuse but he thought it was worth a try.","example[51]":"Only half the students passed the test on their first try.","note[12]":"on the first/second etc try","definition[15]":"a test of something to see if it is suitable or successful or to find out if you like it","example[52]":"I decided to give modelling a try.","example[53]":"Wines from Apulia’s ancient vineyards are well worth a try.","definition[16]":"four points won by putting the ball on the ground behind the opponents’ goal line in  rugby","collocation[3]":"have a try","example[54]":"I decided to have one last try.","collocation[4]":"give it a try","example[55]":"If your instinct is telling you to give it a try, then go ahead.","collocation[5]":"be worth a try","example[56]":"It’s worth a try – we’ve nothing to lose.","collocation[6]":"a good try","example[57]":"‘Do you really think you can win?’ ‘I’m going to have a darn good try.’","collocation[7]":"a nice try","example[58]":"Nice try, Claudia, but not good enough, I’m afraid.","collocation[8]":"somebody’s first/second try","example[59]":"This is his first try at directing.","example[60]":"Savings-and-loan directors are being tried for fraud."}