{"word[0]":"strict","comparative[0]":"stricter","superlative[0]":"strictest","definition[0]":"expecting people to obey rules or to do what you say","opposite[0]":"lenient","example[0]":"a strict teacher","example[1]":"This company is very strict about punctuality.","note[0]":"strict about","example[2]":"The Stuarts are very strict with their children.","note[1]":"strict with","definition[1]":"a strict order or rule is one that must be obeyed","example[3]":"You had strict instructions not to tell anybody.","example[4]":"There are strict limits on presidential campaign contributions.","example[5]":"He’s under strict orders from his doctor to quit smoking.","example[6]":"I’m telling you this in the strictest confidence (=it must be kept completely secret).","definition[2]":"exact and correct, often in a way that seems unreasonable","example[7]":"Amy was attractive, although not beautiful in the strictest sense of the word.","definition[3]":"obeying all the rules of a religion or set of principles","example[8]":"He was raised a strict Catholic.","example[9]":"a strict vegetarian","heading[0]":"– Meaning 2: a strict order or rule is one that must be obeyed","collocation[0]":"strict rules/regulations/guidelines","example[10]":"There are strict rules and regulations regarding conduct.","collocation[1]":"a strict code","example[11]":"The club has a strict dress code.","example[12]":"Doctors have a strict code of conduct.","collocation[2]":"strict limits","example[13]":"Many airlines impose strict limits on the weight of baggage.","collocation[3]":"strict orders/instructions","example[14]":"He’s left strict instructions not to be disturbed.","collocation[4]":"strict control","example[15]":"There must be strict control of local government spending.","collocation[5]":"strict discipline","example[16]":"The head teacher insists upon strict discipline throughout the school.","collocation[6]":"strict requirements","example[17]":"Landlords must comply with strict safety requirements.","collocation[7]":"strict criteria","example[18]":"The supermarket’s suppliers must meet strict criteria.","collocation[8]":"a strict diet","example[19]":"He went on a strict diet and lost a lot of weight.","collocation[9]":"in strict confidence/in the strictest confidence","example[20]":"Any information you give will be treated in the strictest confidence.","definition[4]":"expecting people to obey rules or to do what you say – used especially about parents, teachers, or organizations","example[21]":"Our teachers were very strict.","example[22]":"Most schools are quite strict about the way students dress.","display[0]":"firm","definition[5]":"showing that you are in control of the situation and will not change your opinion, especially when you are telling someone what to do","example[23]":"You have to be firm with young children.","example[24]":"I’ll be firm with him and tell him he can’t have any more money.","definition[6]":"determined that your orders or decisions will be obeyed, especially in order to make sure that a situation improves – used especially when you think that someone is right to be strict","example[25]":"We need a government that is tough on crime.","example[26]":"She can be quite tough with her students, but they respect her for it.","example[27]":"The chancellor has got to be tough and keep government spending down.","display[1]":"stern","definition[7]":"strict in a serious, disapproving, and rather unfriendly way","example[28]":"Her grandfather was a stern man who rarely smiled.","example[29]":"Sheila walked into the museum, under the stern gaze of the curator.","definition[8]":"punishing or criticizing someone in a way that seems very severe, often too severe","example[30]":"Don’t be too harsh on her – she’s only a child.","example[31]":"It may seem harsh to punish him, but he has to learn that this kind of behaviour is unacceptable.","example[32]":"Her reaction to the child’s bad behaviour was unnecessarily harsh.","display[2]":"authoritarian","definition[9]":"very strict about forcing people to obey rules or laws, and punishing them very severely if they fail to do this – used about people and governments","example[33]":"Her father was very authoritarian and insisted on total obedience.","example[34]":"an authoritarian government","heading[1]":"rule/law/system","example[35]":"There are strict rules about keeping tax records.","example[36]":"He had strict instructions to return the key to me.","display[3]":"tight","definition[10]":"tight  controls or limits are very strict about what is allowed and what is not allowed","example[37]":"The report recommends tighter controls on the advertising of alcohol.","example[38]":"There are tight regulations governing waste disposal.","definition[11]":"tough laws or rules are very strict","example[39]":"They want tougher laws against drinking and driving.","example[40]":"The federal government is introducing tough new rules on immigration.","definition[12]":"harsh punishments or laws are very severe, often too severe","example[41]":"There are harsh penalties for drug trafficking.","example[42]":"The government has brought in harsh measures to combat the rioting taking place in many cities.","display[4]":"stringent","definition[13]":"controlling what people can do with rules that have very high standards","example[43]":"There are now stringent controls on pollution from all power stations.","example[44]":"stringent new food safety regulations"}