{"word[0]":"page","definition[0]":"one side of a piece of paper in a book, newspaper, document etc, or the sheet of paper itself","example[0]":"The full address is given on page 15.","example[1]":"You will find the answers over the page.","example[2]":"a 400-page novel","example[3]":"We took out a full page advertisement in the ‘Village Voice’.","definition[1]":"all the writing etc that you can see at one time on a computer screen","example[4]":"a web page (=a single screen of writing, pictures etc on a website)","signpost[0]":"young person","definition[2]":"a student or young person who works as a helper to a member of the US Congress","signpost[1]":"boy","definition[3]":"a boy who served a knight during the Middle Ages as part of his training","definition[4]":"a pageboy(2)","signpost[2]":"servant","definition[5]":"a boy who in the past served a person of high rank","collocation[0]":"the next/previous page","example[5]":"I glanced back to the previous page.","example[6]":"What’s on the next page?","collocation[1]":"the opposite/facing page","example[7]":"See the diagram on the opposite page.","collocation[2]":"the left-hand/right-hand page","example[8]":"The answers are on the right-hand page.","collocation[3]":"the front/back page","example[9]":"Her picture was on the front page of every newspaper.","collocation[4]":"the sports/arts/financial etc pages","example[10]":"He only ever reads the sports pages.","collocation[5]":"a blank page","example[11]":"There were a couple of blank pages at the back of the book.","collocation[6]":"a new/fresh page","example[12]":"Start each section of your essay on a new page.","collocation[7]":"a full page","example[13]":"The article went on for a full page.","collocation[8]":"turn a page","example[14]":"I turned the page in order to find out what happened next.","collocation[9]":"turn to/see page 22/45 etc","example[15]":"Turn to page 8 for more details.","collocation[10]":"flick/flip/leaf through the pages of something","example[16]":"She was flicking through the pages of a magazine.","collocation[11]":"jump/leap off the page","example[17]":"One mistake jumped off the page.","collocation[12]":"the top of the page","example[18]":"Write your name at the top of the page.","collocation[13]":"the bottom/foot of the page","example[19]":"See the note at the bottom of page 38.","heading[0]":"GRAMMAR: Patterns with page","explanation[0]":"Something is on a page","example[20]":"I stared at the words on the page","explanation[1]":"Something is on the first/last/next etc page","example[21]":"The answer is on the next page","bad_example[0]":"The answer is in the next page","explanation[2]":"Something is on page 1/10 etc","example[22]":"There is a diagram on page 35","bad_example[1]":"There is a diagram on the page 35","bad_example[2]":"There is a diagram in page 35","definition[6]":"to call someone’s name out in a public place, especially using a loudspeaker, in order to find them","example[23]":"She hurried to the reception desk and asked the girl to page her husband.","definition[7]":"to send a message to someone’s pager asking them to go somewhere or telephone someone","example[24]":"He was constantly being paged during meetings.","example[25]":"the paging network","example[26]":"The sales figures are on page 15 of the report.","definition[8]":"the pages in magazines, newspapers etc that are used to advertise goods and services","example[27]":"Fortune magazine will show a 13% increase in ad pages for the first quarter.","definition[9]":"the pages in magazines, newspapers etc that deal with business, sport etc","example[28]":"The format could make 'The Wall Street Journal’s financial-markets pages easier to read.","definition[10]":"the first page at the front of a newspaper, where the most important news is","example[29]":"The newspaper carried the item on its front page.","example[30]":"Mr. Guerin was profiled in a front-page story in the ‘FT’.","definition[11]":"a piece of writing or pictures on a computer screen that will fill one side of a piece of paper when printed","example[31]":"Print Preview displays the layout of the pages you are about to print.","definition[12]":"part of a website which you can see on a computer screen at any one time","example[32]":"A hit counter measures and displays the number of times visitors have viewed a single page on a website.","definition[13]":"a message that you receive on a pager","definition[14]":"to contact someone, using a pager","example[33]":"The customer is paged automatically every time a new fax or email arrives.","example[34]":"You could try paging him over the public address system."}