{"word[0]":"expansion","definition[0]":"when something increases in size, range, amount etc","synonym[0]":"growth","example[0]":"The rapid expansion of cities can cause social and economic problems.","note[0]":"expansion of","example[1]":"an expansion in student numbers","note[1]":"expansion in","definition[1]":"when a company, business etc becomes larger by opening new shops, factories etc","example[2]":"The industry underwent a period of rapid expansion.","definition[2]":"an idea, story etc that is based on one that is simpler or more general","example[3]":"The novel is an expansion of a short story he wrote about forty years ago.","form[0]":"ADJECTIVES/NOUN + expansion","collocation[0]":"a big expansion","example[4]":"Last year saw a big expansion at the company.","collocation[1]":"a great/huge/massive expansion","example[5]":"There are plans for a massive expansion of the oil and gas industries.","collocation[2]":"a major/significant expansion","example[6]":"The company is planning a major expansion of its retail outlets.","collocation[3]":"a rapid expansion","example[7]":"During the 1990s, there was a rapid expansion in student numbers.","collocation[4]":"a steady expansion","example[8]":"There has been a steady expansion of the self-employed sector of the economy.","collocation[5]":"further expansion","example[9]":"Investors think the hotel chain is ripe for further expansion.","collocation[6]":"economic expansion","example[10]":"Economic expansion in India and China is set to continue.","collocation[7]":"business/commercial expansion","example[11]":"These new measures could limit business expansion.","collocation[8]":"urban expansion","example[12]":"We are seeing uncontrolled urban expansion in many African cities.","collocation[9]":"expansion takes place","example[13]":"The biggest expansion occurred in the volume of small issue government bonds.","form[1]":"expansion + NOUN","collocation[10]":"an expansion plan","example[14]":"The city’s ambitious expansion plans will require major investment.","collocation[11]":"an expansion programme","example[15]":"Such an aggressive expansion programme could double the business in five years.","definition[3]":"when something increases or is increased in size, amount, or number","example[16]":"An expansion of demand can give rise to inflationary pressures","example[17]":"There was enormous expansion of credit to finance cumulative budget deficits of $1,400 billion.","definition[4]":"when an economy becomes more successful, and there is increased economic activity, more jobs etc","example[18]":"the continued expansion of the Japanese economy","example[19]":"The study was carried out at a time of economic expansion and three out of four of the firms had experienced growth in the year prior to the study.","definition[5]":"when an industry or company becomes bigger or more successful","example[20]":"a strategy of modest but steady expansion","example[21]":"Many small businesses are already benefiting from lower interest rates as they accelerate their expansion plans.","example[22]":"More expansion into Europe is likely, but the company will not be hurried."}