{"word[0]":"departure","definition[0]":"an act of leaving a place, especially at the start of a journey","opposite[0]":"arrival","example[0]":"I saw Simon shortly before his departure for Russia.","note[0]":"departure for","example[1]":"There was a delay in the departure of our plane.","note[1]":"departure of","example[2]":"Mozart’s departure from Paris in September 1778","note[2]":"departure from","definition[1]":"an act of leaving an organization or position","example[3]":"He refused to discuss his departure from the government.","definition[2]":"a flight, train etc that leaves at a particular time","example[4]":"There are several departures for New York every day.","definition[3]":"a way of doing something that is different from the usual, traditional, or expected way","example[5]":"This would be a radical departure from the subsidy system.","note[3]":"radical/major/significant etc departure","example[6]":"Their new designs represent a departure from their usual style.","form[0]":"ADJECTIVES/NOUN + departure","collocation[0]":"sudden/abrupt","example[7]":"I didn't know how I was going to explain his abrupt departure to the others.","example[8]":"Their departure seemed rather sudden.","collocation[1]":"a hasty/speedy departure","example[9]":"I was surprised by her hasty departure.","collocation[2]":"a flight/train/coach departure","example[10]":"I'm afraid your flight departure has been delayed.","collocation[3]":"delay somebody's departure","example[11]":"I decided to delay my departure by a few days.","form[1]":"departure + NOUN","collocation[4]":"a departure date","example[12]":"You cannot make a change to your booking within six weeks of your departure date.","collocation[5]":"a departure time","example[13]":"Do you know your exact departure time?","collocation[6]":"a departure point","example[14]":"Luxor is one departure point for boat trips down the Nile.","collocation[7]":"a departure gate","example[15]":"It was a long walk with all our luggage to the departure gate.","collocation[8]":"a departure lounge","collocation[9]":"the departures board","example[16]":"I scanned the departures board for details of my flight.","example[17]":"His sudden departure from the political scene took everyone by surprise.","example[18]":"There are several departures a day for New York."}