{"word[0]":"surprise","definition[0]":"an unexpected or unusual event","example[0]":"What a surprise to find you here!","example[1]":"We had a big surprise when we found out the truth.","definition[1]":"the feeling you have when something unexpected or unusual happens","example[2]":"The man had a look of surprise on his face.","example[3]":"Bill looked at him in surprise.","note[0]":"in/with surprise","example[4]":"Much to his surprise, she gave him her phone number.","note[1]":"to somebody’s surprise","example[5]":"To my surprise, the whole family was there ","bad_example[0]":"for my surprise","signpost[0]":"gift/party etc","definition[2]":"an unexpected present, trip etc which you give to someone or organize for them, often on a special occasion","example[6]":"‘I’ve got a surprise for you, ’ she said.","note[2]":"surprise for","definition[3]":"used when saying in a joking way that you expected something to happen or be true","example[7]":"The American TV networks are, surprise, surprise, full of stories about the election.","definition[4]":"used when you suddenly appear in front of someone who you know is not expecting to see you","definition[5]":"the use of methods which are intended to cause surprise","example[8]":"An element of surprise is important to any attack.","collocation[0]":"be a surprise","example[9]":"His decision to marry was a complete surprise.","collocation[1]":"come as a surprise","example[10]":"The announcement came as a surprise to most people.","collocation[2]":"get/have a surprise","example[11]":"We got a surprise when we got home and found him waiting for us.","collocation[3]":"give somebody a surprise","example[12]":"She wanted to give him a surprise.","collocation[4]":"have a surprise for somebody","example[13]":"I think Jenny might have a surprise for you.","collocation[5]":"spring a surprise (on somebody)","example[14]":"The chairman sprang a surprise this week by announcing his intention to quit.","collocation[6]":"a big/great surprise","example[15]":"The results were a big surprise.","collocation[7]":"a complete/total surprise","example[16]":"The news came as a complete surprise.","collocation[8]":"a nice/pleasant/lovely surprise","example[17]":"It’s a lovely surprise to see you.","collocation[9]":"an unpleasant/nasty surprise","example[18]":"We don’t want any unpleasant surprises.","collocation[10]":"come as no surprise","example[19]":"It came as no surprise when Lester got the job.","collocation[11]":"be in for a surprise","example[20]":"Compare our prices. You’ll be in for a pleasant surprise.","collocation[12]":"there’s a surprise in store (for somebody)","example[21]":"There were plenty more surprises in store for him.","form[0]":"surprise + NOUN","collocation[13]":"a surprise visit","example[22]":"Environmental health inspectors made a surprise visit to the restaurant.","collocation[14]":"a surprise party","example[23]":"His friends had planned a surprise party for him.","collocation[15]":"a surprise announcement","example[24]":"In a surprise announcement the company said they were withdrawing their planning application.","collocation[16]":"a surprise victory","example[25]":"She came to power in 1977, after a surprise victory in the general election.","collocation[17]":"a surprise attack","example[26]":"Instead they launched a successful surprise attack on the castle.","collocation[18]":"a surprise move","example[27]":"In a surprise move, the government lifted the ban on arms exports to the country.","definition[6]":"used when you are just about to show someone something that you know will surprise them","definition[7]":"to make someone feel surprised","example[28]":"His strange question surprised her.","example[29]":"I didn’t know you two knew each other. Mind you, it doesn’t surprise me.","example[30]":"What surprised me most was that she didn’t seem to care.","example[31]":"It wouldn’t surprise me if he married Jo.","example[32]":"It had surprised me to find how fussy he was about some things.","note[3]":"it surprises somebody to see/find/know etc","example[33]":"Looking back, does it surprise you that she left?","note[4]":"it surprises somebody that/how/what","definition[8]":"to find, catch, or attack someone when they are not expecting it, especially when they are doing something they should not be doing","example[34]":"A security guard surprised the burglars in the storeroom.","definition[9]":"to make someone feel surprised, especially because they did not expect something","example[35]":"Her reaction surprised me – I didn’t realize how strongly she felt.","example[36]":"What surprised me was how cheap everything was compared to at home.","display[0]":"amaze","definition[10]":"to greatly surprise someone, for example because something is very good, unusual, or hard to believe","example[37]":"He amazed everyone with his skill.","example[38]":"It amazes me that no one has thought of the idea before.","display[1]":"astonish","definition[11]":"to greatly surprise someone","example[39]":"Myra astonished her doctors by recovering so quickly.","display[2]":"astound","definition[12]":"to greatly surprise or shock someone. Astound sounds a little more formal and a little stronger than astonish","example[40]":"What astounded him was their inefficiency.","display[3]":"take somebody by surprise","definition[13]":"to happen at an unexpected time, so that people are surprised or unprepared","example[41]":"Security men were taken by surprise as the man ran onto the stage.","example[42]":"His resignation took us by surprise.","display[4]":"startle","definition[14]":"to make someone feel surprised or slightly frightened by doing something they did not expect","example[43]":"The wind made the door shut with a crash, which startled her.","example[44]":"Sudden movements may startle the horse."}