{"word[0]":"pause","definition[0]":"to stop speaking or doing something for a short time before starting again","example[0]":"She paused for a moment.","note[0]":"pause for","example[1]":"He paused for breath, then continued up the hill.","example[2]":"‘No, ’ he replied, without pausing for thought.","example[3]":"Joe paused to consider his answer.","note[1]":"pause to do something","definition[1]":"to push a button on a CD player, DVD player etc in order to make a CD, DVD etc stop playing for a short time","collocation[0]":"briefly","example[4]":"At the doorway she paused briefly.","collocation[1]":"momentarily","example[5]":"He paused momentarily, then knocked twice more.","collocation[2]":"dramatically","example[6]":"'They have offered us a lot of money.' She paused dramatically.","collocation[3]":"pause (for) a moment","example[7]":"He paused for a moment, seemingly overcome by emotion.","collocation[4]":"pause for breath","example[8]":"She had to pause for breath after every two or three steps.","collocation[5]":"pause for thought","example[9]":"'Of course, ' she replied, without pausing for thought.","collocation[6]":"pause for effect","example[10]":"'Now I know what to do, ' Brown said, pausing for effect.","collocation[7]":"pause only to do something","example[11]":"He paused only to make a few notes, and left.","definition[2]":"to stop speaking or stop doing something for a very short time before starting again. Pause is used especially in written descriptions. In everyday spoken English, people usually just say stop","example[12]":"She paused at the bottom of the stairs and looked up at the clock.","example[13]":"He paused, waiting for Larry to say something.","display[0]":"hesitate","definition[3]":"to stop for a moment and wait before doing something, because you feel unsure or nervous about it","example[14]":"She hesitated for a moment before replying.","display[1]":"have/take a break","definition[4]":"to stop working for a short time in order to rest, eat etc","example[15]":"We’re all getting tired. Let’s take a break for ten minutes.","display[2]":"adjourn","definition[5]":"if a meeting or court adjourns or is adjourned, it stops for a short time","example[16]":"If there are no more questions, the committee will adjourn until tomorrow morning.","example[17]":"The trial was adjourned because one of the defendants was ill.","display[3]":"take five","definition[6]":"to stop for a short time in order to rest","example[18]":"Let’s take five and get some coffee.","display[4]":"break off","definition[7]":"to suddenly stop speaking, especially because you see, hear, or think of something","example[19]":"He broke off his conversation when he saw Mary running towards him.","example[20]":"She broke off and looked embarrassed, then said, ‘I’ll explain later.’","definition[8]":"a short time during which someone stops speaking or doing something before starting again","example[21]":"There was a pause while Alice changed the tape.","example[22]":"After a long pause, she went on.","example[23]":"an awkward pause in the conversation","note[2]":"pause in","definition[9]":"a control which allows you to stop a CD player, DVD player etc for a short time and start it again","definition[10]":"a mark ( ) over a musical note, showing that the note is to be played or sung longer than usual","collocation[8]":"a long pause","example[24]":"There was a long pause before anyone spoke.","collocation[9]":"a brief/short/slight pause","example[25]":"\"Well, that was a surprise, \" he said after a brief pause.","collocation[10]":"a momentary pause","example[26]":"There was a momentary pause during which Mr Hammond glanced at his wife.","collocation[11]":"an awkward pause","example[27]":"After an awkward pause, Ray began to answer my question.","collocation[12]":"a dramatic pause","example[28]":"In the dramatic pause before she replied, you could feel the tension in the room.","collocation[13]":"a pregnant pause","example[29]":"‘OK. Let’s move on, ’ said the president after a pregnant pause."}