{"word[0]":"size","signpost[0]":"how big","definition[0]":"how big or small something is","example[0]":"He’s a small boy, about John’s size.","example[1]":"The Jensens’ house is about the same size as ours.","example[2]":"I saw a spider the size of (=the same size as) my hand in the backyard.","example[3]":"He’s quite a big dog, but he’s still not full size yet.","example[4]":"These phones come in all shapes and sizes.","note[0]":"in all/different/various (shapes and) sizes","example[5]":"The breakfast room is a good size.","note[1]":"good/fair/nice size","example[6]":"The firm underestimated the size of the market for their new product.","note[2]":"size of","example[7]":"The apartment is roughly 360 square feet in size.","note[3]":"in size","example[8]":"In a class this size, there are bound to be a few troublemakers.","note[4]":"(of) that/this size","example[9]":"We can’t give loans of that size to just anyone.","signpost[1]":"very big","definition[1]":"used to say that something is very big","example[10]":"The sheer size of the classes makes learning difficult for students.","example[11]":"I can’t believe the size of her car!","signpost[2]":"clothes/goods","definition[2]":"one of a set of standard measures according to which clothes and other goods are produced and sold","example[12]":"These shoes are one size too big.","example[13]":"The shirts come in three sizes: small, medium, and large.","example[14]":"Do you have these pants in a size 12?","signpost[3]":"paste","definition[3]":"a thick sticky liquid used for giving stiffness and a shiny surface to cloth, paper etc, or used to prepare walls for wallpaper","collocation[0]":"the same size","example[15]":"The water vole is about the same size as a rat.","collocation[1]":"a different size","example[16]":"Six towns of different sizes were selected for the research.","collocation[2]":"a good/fair/nice size","example[17]":"The garden is a good size.","collocation[3]":"the small size of something","example[18]":"One problem was the very small size of the department.","collocation[4]":"the large size of something","example[19]":"They are very peaceful fish, despite their large size.","collocation[5]":"the sheer size of something","example[20]":"The sheer size of some dinosaurs is amazing.","collocation[6]":"something’s original size","example[21]":"The lake has already shrunk to half its original size.","collocation[7]":"full size","example[22]":"Is this violin full size?","collocation[8]":"be twice the size of something","example[23]":"The creature was about twice the size of a small dog.","collocation[9]":"be half the size of something","example[24]":"Kosovo is about half the size of Wales.","definition[4]":"how big someone or something is","example[25]":"What size is that shirt?","example[26]":"The price will depend on the size and quality of the carpet.","example[27]":"Your desk is exactly the same size as mine.","example[28]":"Fire has destroyed an area of forest the size of Luxembourg.","example[29]":"The seeds are very small, about half the size of a grain of salt.","example[30]":"There were several pieces of wood of different sizes.","example[31]":"Cover the dough and allow it to rise until it has doubled in size.","example[32]":"The black spots on her skin seemed to be slowly increasing in size.","example[33]":"The American states vary enormously in size, from very large to very small.","example[34]":"In a class this size, there will always be a few problems.","display[0]":"dimensions","definition[5]":"the length, width, and height of an object, room, building etc","example[35]":"What are the dimensions of the table?","display[1]":"measurements","definition[6]":"the length, width, or height of something, or of someone’s body","example[36]":"I need to check the measurements of the window.","example[37]":"Your waist measurement is 31 inches.","example[38]":"The nurse took my measurements.","display[2]":"proportions","definition[7]":"the relative sizes of the different parts of an object, room, building etc","example[39]":"The proportions don’t look right to me.","example[40]":"You can sit in the Plaza and admire the proportions of the cathedral.","definition[8]":"the amount of space that a flat surface such as a floor or field covers","example[41]":"To measure the area of a room, you need to multiply the length by the width.","display[3]":"extent","definition[9]":"the size of a large area","example[42]":"The extent of the ranch is enormous.","example[43]":"The island measured about 1,600 kilometres in extent.","display[4]":"bulk","definition[10]":"the very large size of something","example[44]":"The statue’s massive bulk made it difficult to move.","example[45]":"his enormous bulk","example[46]":"The view was dominated by the huge bulk of the power station.","display[5]":"capacity","definition[11]":"the amount that a container will hold","example[47]":"The capacity of the tank is around 500 gallons.","example[48]":"The computer’s memory has a capacity of over 200 megabytes.","example[49]":"All the storage units were filled to capacity.","display[6]":"volume","definition[12]":"the amount of space that a substance fills, or that an object contains","example[50]":"The average domestic swimming pool has a volume of 45,000 litres.","example[51]":"This instrument measures the volume of air in your lungs.","example[52]":"Help me figure out the volume of this fish tank.","example[53]":"The shifting of continents has an impact on the volume of water the oceans can contain.","definition[13]":"to sort things according to their size","example[54]":"Shrimp are sized and selected for canning.","definition[14]":"to make something into a particular size or sizes","example[55]":"Most costume patterns are sized for children.","explanation[0]":"Size is usually passive in this meaning","definition[15]":"to put size1(7) on a wall before decorating"}