{"word[0]":"rest","signpost[0]":"relaxing","definition[0]":"a period of time when you are not doing anything tiring and you can relax or sleep","example[0]":"You look exhausted! Why don’t you take a rest?","definition[1]":"a period of silence of a particular length in a piece of music","definition[2]":"a written sign that shows how long the period of silence should be","collocation[0]":"have/take a rest","example[1]":"I’m going upstairs to have a rest.","collocation[1]":"get some rest","example[2]":"You’d better get some rest if you’re driving back tonight.","collocation[2]":"deserve a rest","example[3]":"I think we deserve a rest after all that hard work.","collocation[3]":"a well-earned/well-deserved rest","example[4]":"Our players are taking a well-earned rest before the start of the new season.","collocation[4]":"a complete rest","example[5]":"The doctor had advised a complete rest for a fortnight.","collocation[5]":"a little/short rest","example[6]":"He decided to stop and take a short rest.","collocation[6]":"a long rest","example[7]":"What I need is a nice long rest.","collocation[7]":"a good rest","example[8]":"I’m sure you need a good rest.","form[0]":"rest + NOUN","collocation[8]":"a rest day/period","example[9]":"The crew had a three hour rest period before their next flight.","signpost[1]":"relax","definition[3]":"to stop working or doing an activity for a time and sit down or lie down to relax","example[10]":"If you’re tired, we’ll stop and rest for a while.","signpost[2]":"support something","definition[4]":"to support an object or part of your body by putting it on or against something, or to be supported in this way","example[11]":"Rest your head on my shoulder.","note[0]":"rest (something) against/on something","example[12]":"Brassard rested his elbows on the table and leaned forward.","example[13]":"Their bikes were resting against the wall.","signpost[3]":"dead person","definition[5]":"if a dead person rests somewhere, they are buried there","note[1]":"rest in peace (=often written on a grave)","example[14]":"My mother rests beside my father in the family graveyard.","definition[6]":"to stop working or stop being active, and sit down or lie down so that you become less tired","example[15]":"The doctor told me to take some time off work and try to rest.","display[0]":"take a rest","definition[7]":"to stop what you are doing for a period of time so that you can relax","example[16]":"Murray will now take a rest before the competition next month.","example[17]":"There was a TV in the hotel room, and sometimes I escaped up there to have a rest.","example[18]":"A spokesman said that the Senator needed to take a rest from the campaign activity.","display[1]":"take a break","definition[8]":"to stop what you are doing for a short time, so that you can rest or do something else – often used about stopping a meeting, class etc for a short time","example[19]":"Is it all right if we have a short break at about 10:30?","example[20]":"I spoke to the actor as he was taking a break from rehearsals.","example[21]":"Let’s take a break now for coffee.","display[2]":"take it easy","definition[9]":"to do things gently and with less effort than usual, in order to avoid becoming worried or tired, especially because you are not feeling strong or healthy","example[22]":"After the operation, she decided to take things easy for a month or two.","example[23]":"I thought I’d take it easy tonight.","display[3]":"put your feet up","definition[10]":"to rest for a short time after a tiring activity, especially by sitting with your feet resting on something","example[24]":"Kate poured herself a drink and put her feet up.","example[25]":"When you’re pregnant and doing a full-time job, you must find time to put your feet up.","display[4]":"chill/chill out","definition[11]":"to spend time relaxing and doing things that do not need a lot of effort – used by young people","example[26]":"We chilled out in front of the TV with a couple of beers.","example[27]":"I like chilling with the guys and playing pool or watching movies."}