{"word[0]":"rate","definition[0]":"the number of times something happens, or the number of examples of something within a certain period","example[0]":"Immediately his heart rate (=the number of beats per minute) increased.","example[1]":"Australia’s unemployment rate rose to 6.5% in February.","note[0]":"birth/unemployment/crime etc rate","example[2]":"a rapid increase in the divorce rate","example[3]":"areas with high rates of crime","note[1]":"high/low rate of something","example[4]":"It’s a new technique and the failure rate is quite high.","note[2]":"success/failure rate","example[5]":"Asylum seekers were entering Britain at a rate of 1,600 per day.","note[3]":"at a rate of something","definition[1]":"a charge or payment that is set according to a standard scale","example[6]":"$20 an hour is the going rate (=the usual amount paid) for private tuition.","example[7]":"another reduction in the mortgage rate","note[4]":"interest/exchange/mortgage etc rate","example[8]":"Nurses are demanding higher rates of pay.","note[5]":"rate of pay/tax/interest etc","example[9]":"Some hotels offer special rates for children.","note[6]":"special/reduced/lower rate","example[10]":"What’s the hourly rate for cleaning?","note[7]":"hourly/weekly rate","example[11]":"people who pay tax at the highest rate","note[8]":"at (a) ... rate","example[12]":"They only pay tax at a rate of 5%.","signpost[0]":"speed","definition[2]":"the speed at which something happens over a period of time","example[13]":"an attempt to slow down the rate of economic growth","note[9]":"rate of","example[14]":"Children learn at different rates.","example[15]":"Our money was running out at an alarming rate.","example[16]":"Iceland is getting wider at a rate of about 0.5 cm per year.","heading[0]":"– Meaning 1: the number of times something happens, or the number of examples of something within a certain period","form[0]":"ADJECTIVES/NOUN + rate","example[17]":"Rates of adult illiteracy are still too high.","example[18]":"The hospital’s death rate is the lowest in the region.","collocation[0]":"a rising/falling rate","example[19]":"A falling mortality rate led to a gradual increase in the proportion of the aged in the population.","collocation[1]":"the unemployment rate","example[20]":"In April, the unemployment rate fell to 4.9 percent, a 23-year low.","collocation[2]":"the death/mortality rate","example[21]":"The death rate among the homeless is three times higher than the rest of the population.","collocation[3]":"the birth rate","example[22]":"In many developing countries, birth rates are falling.","collocation[4]":"the crime rate","example[23]":"Our crime rate is one of the lowest in the country.","collocation[5]":"the divorce rate","example[24]":"The UK has one of the highest divorce rates in Europe.","collocation[6]":"the success/failure rate","example[25]":"The success rate is still extremely low.","collocation[7]":"the survival rate","example[26]":"The survival rate of twins and triplets has increased in recent years.","collocation[8]":"somebody’s heart/pulse rate","example[27]":"A miner’s resting heart rate can be between 40 and 60 beats a minute.","collocation[9]":"metabolic rate","example[28]":"Metabolic rate rises with any form of activity.","collocation[10]":"the rate goes up","example[29]":"The crime rate just keeps going up.","collocation[11]":"the rate goes down","example[30]":"We are expecting unemployment rates to fall.","heading[1]":"– Meaning 2: a charge or payment that is set according to a standard scale","example[31]":"You ought to switch to an account that pays a higher rate of interest.","example[32]":"Wage rates in the industry are still too low, he says.","collocation[12]":"a special/reduced rate","example[33]":"Reduced rates are available for groups of 10 or more visitors.","collocation[13]":"the hourly/weekly rate","example[34]":"Women have lower hourly rates of pay than men.","collocation[14]":"the going rate","example[35]":"She could not afford to pay them the going rate.","collocation[15]":"a flat/fixed rate","example[36]":"Profits were taxed at a flat rate of 45 percent.","collocation[16]":"the interest rate","example[37]":"Interest rates have remained high.","collocation[17]":"a mortgage rate","example[38]":"Higher mortgage rates should slow down the rapid rise in house prices.","collocation[18]":"a tax rate","example[39]":"People objected to higher property tax rates.","collocation[19]":"the exchange rate","example[40]":"the exchange rate between the dollar and sterling","collocation[20]":"the wage rate","example[41]":"What is the hourly wage rate?","collocation[21]":"the base rate","example[42]":"The interest charged on your overdraft changes in line with bank base rates.","collocation[22]":"the prime rate","example[43]":"The amount above the prime rate is determined by the bank’s assessment of the risk involved in making the loan.","collocation[23]":"the rate of interest/pay/tax etc","example[44]":"They believe that Labour would raise the basic rate of tax.","collocation[24]":"at a rate of","example[45]":"Some customers are paying interest at a rate of over 15%.","collocation[25]":"raise/put up the rate","example[46]":"If the banks raise interest rates, this will reduce the demand for credit.","collocation[26]":"cut/reduce/lower a rate","example[47]":"The Halifax Building Society is to cut its mortgage rate by 0.7 percent.","heading[2]":"– Meaning 3: the speed at which something happens over a period of time","collocation[27]":"a faster/slower rate","example[48]":"The urban population has grown at a faster rate than the rural population.","collocation[28]":"a rapid rate","example[49]":"The plant’s ability to thrive in these conditions is partly due to its rapid rate of growth.","collocation[29]":"an alarming rate","example[50]":"The alarming rate of increase in pollution levels has concerned environmentalists.","collocation[30]":"a tremendous/phenomenal rate","example[51]":"He started to produce movies at a tremendous rate.","collocation[31]":"an unprecedented rate","example[52]":"We are losing species at an unprecedented rate.","collocation[32]":"a constant/steady rate","example[53]":"The process takes place at a constant rate.","definition[3]":"to think that someone or something has a particular quality, value, or standard","example[54]":"The company seems to rate him very highly (=think he is very good).","example[55]":"Rhodes is currently rated the top junior player in the country.","note[10]":"be rated (as) something","definition[4]":"to be considered as having a particular quality, value, or standard","example[56]":"That rates as one of the best meals I’ve ever had.","note[11]":"rate as","definition[5]":"if you rate someone or something, you think they are very good","example[57]":"I never rated him.","definition[6]":"to deserve something","example[58]":"They rate a big thank-you for all their hard work.","example[59]":"a local incident that didn’t rate a mention in the national press","definition[7]":"a charge or payment fixed according to a standard scale","example[60]":"We have advised  (=informed) our client of your  hourly rate.","example[61]":"The councils have powers to set minimum rates of pay.","example[62]":"I’m told $25 an hour is the going rate (=the usual amount paid) for private tuition.","definition[8]":"the number of examples of something or the number of times something happens, often expressed as a percentage","example[63]":"Canada’s unemployment rate rose to 8.3% of the working population in August.","example[64]":"The pension finding service has an 87% success rate.","example[65]":"The failure rate of small businesses is notoriously high.","definition[9]":"the speed at which something happens","example[66]":"Companies have been going out of business at an incredible rate (=very fast).","definition[10]":"the part of your income or the part of the price of something that you pay in tax","example[67]":"Those who earn $180,000 to $280,000 will see their tax rates drop to 31% from 33% this year.","definition[11]":"the percentage charged for borrowing money, or a percentage you receive when you put money in a bank, make an investment etc","example[68]":"Interest rates are falling and now is the time to buy property.","example[69]":"The rate on the bank’s standard credit cards will be 18.9%.","example[70]":"Mortgage rates will fall; corporate bond rates will fall; municipal bonds rates will also fall.","example[71]":"the most recent changes in the short and long rates (=the rates for borrowing over short and long periods of time)","definition[12]":"the amount you have to pay for insurance","example[72]":"Women drivers get cheaper insurance rates because their accident records are better.","definition[13]":"a payment for a public service, usually based on the value of the property owned by the person who uses the service","example[73]":"a non-domestic water rate of 3.4 pence in the pound","example[74]":"The Salzburg Sheraton is rated as one of the city’s best hotels.","example[75]":"His employer rates him very highly.","example[76]":"It rates as one of the most comfortable PC keyboards I’ve tried.","example[77]":"The SLR can hardly be rated as a precision piece of equipment.","definition[14]":"to measure the risk of investing in or lending to a company, local authority etc","example[78]":"Moody’s Investors Service Inc. has rated the bonds single-A-1.","example[79]":"Richard Simon of Goldman Sachs has rated Paramount stock a ‘hold’ for the past year.","definition[15]":"to measure the performance of a ship or machine so it can be put in a particular class"}