{"word[0]":"approximately","definition[0]":"more or less than a number or amount","synonym[0]":"roughly","example[0]":"The plane will be landing in approximately 20 minutes.","example[1]":"How much do you think it will cost, approximately?","definition[1]":"more or less than a number or amount – used especially in technical or scientific contexts","example[2]":"The company had total revenues of approximately $2 million.","example[3]":"The disease affects approximately 10% of the adult population.","definition[2]":"more or less than a number or amount. ‘About’ is the usual word to use in everyday English","example[4]":"It costs about $30 to get a visa.","example[5]":"There were about 50 people at the meeting.","definition[3]":"about – used when you are trying to give someone a general idea of the size, amount, or number of something","example[6]":"The two countries are roughly the same size.","example[7]":"Roughly how many miles do you travel a year?","display[0]":"around","definition[4]":"about a number or time – used when you are guessing","example[8]":"I’ll be there around 5 o’clock.","example[9]":"The BBC broadcasts around 2,000 radio dramas every year.","display[1]":"somewhere/something in the region of","definition[5]":"about – used with very large numbers or amounts","example[10]":"Last year he earned something in the region of $60 million.","example[11]":"It costs somewhere in the region of £100,000 to train a new doctor.","display[2]":"or so","definition[6]":"about – used after a period of time, a number, or an amount","example[12]":"The journey takes an hour or so.","display[3]":"circa","definition[7]":"about – used with dates a long time ago in the past","example[13]":"The house was built circa 1530.","display[4]":"or more","definition[8]":"used after a number or amount, when the total may be a lot more","example[14]":"A thirty-second commercial can cost £60,000 or more.","display[5]":"upwards of","definition[9]":"more than a number or amount","example[15]":"The aircraft can carry upwards of 400 passengers."}