{"word[0]":"city","plural[0]":"cities","definition[0]":"a large important town","example[0]":"The nearest big city was St. Louis.","definition[1]":"a large town that has been given an official title by a king or queen","example[1]":"the city of Oxford","definition[2]":"a town of any size that has definite borders and powers that were officially given by the state government","example[2]":"The city of Cleveland celebrated its 200th birthday with fireworks and an outdoor concert.","definition[3]":"the people who live in a city","example[3]":"The city has been living in fear since last week’s earthquake.","collocation[0]":"a big/large/major city","example[4]":"They have stores in Houston, Dallas, and other big cities.","collocation[1]":"a great city","example[5]":"Cairo is one of the world's great cities.","collocation[2]":"a capital city","example[6]":"Cuba's capital city is Havana.","collocation[3]":"somebody's home/native city","example[7]":"He said that he never wanted to leave his home city.","collocation[4]":"a cosmopolitan city","example[8]":"San Francisco is a very cosmopolitan city.","collocation[5]":"an industrial city","example[9]":"Sheffield is an industrial city in the north of England.","collocation[6]":"a provincial city","example[10]":"There have been protests in the capital and in provincial cities.","collocation[7]":"an ancient city","example[11]":"the ancient city of Jerusalem","collocation[8]":"a historic city","example[12]":"Budapest is a beautiful and historic city.","collocation[9]":"a cathedral city","example[13]":"He went to university in the cathedral city of Durham.","collocation[10]":"a university city","example[14]":"Uppsala is a university city.","collocation[11]":"a walled city","example[15]":"the old walled city of Alghero","collocation[12]":"a twin city","example[16]":"Strasbourg is Leicester's twin city in France.","form[0]":"city + NOUN","collocation[13]":"the city centre","example[17]":"The hotel is in the city centre.","collocation[14]":"the city limits","example[18]":"rural areas south of the city limits","collocation[15]":"city life","example[19]":"the advantages of city life","collocation[16]":"a city dweller","example[20]":"In the summer, city dwellers escape to the sea.","collocation[17]":"a city street","example[21]":"Traffic was moving slowly along the city streets.","collocation[18]":"in the heart of a city","example[22]":"The cathedral is right in the heart of the city.","collocation[19]":"the outskirts of a city","example[23]":"There were several bombings on the outskirts of the city.","collocation[20]":"found a city","example[24]":"He founded the city of Baghdad in the 8th century.","heading[0]":"place with houses, shops, and offices","definition[4]":"a large area with houses, shops, offices etc that is often the centre of government for an area. A city is bigger than a town","example[25]":"The nearest big city is San Francisco.","display[0]":"town","definition[5]":"a large area with houses, shops, offices etc. A town is smaller than a city","example[26]":"La Coruña is a pretty seaside town.","display[1]":"capital","definition[6]":"the city where the government of a country or state is","example[27]":"We travelled to Budapest, the capital of Hungary.","display[2]":"metropolis","definition[7]":"a big busy city that is full of people and activity","example[28]":"After 1850 Paris grew quickly into a busy metropolis.","display[3]":"urban","definition[8]":"relating to towns and cities","example[29]":"Air pollution is particularly bad in urban areas.","example[30]":"urban development","heading[1]":"outside part of city","display[4]":"the outskirts","definition[9]":"the area around the edge of a city or just outside it","example[31]":"Disneyland is on the outskirts of Paris.","display[5]":"suburb","definition[10]":"an area around the edges of a city, where many people live","example[32]":"He lives in a suburb of London.","example[33]":"More and more people are moving to the suburbs.","definition[11]":"an area in central London where there are many large banks and financial organizations, including the Bank of England and the stock exchange. The City has an area of about one square mile (about 2.5 square kilometres), and it is sometimes called ‘the Square Mile’, especially in newspapers. Its name is sometimes used to mean people who work there and make financial decisions. There is a similar area in New York City called Wall Street","example[34]":"The City is optimistic about the outlook for inflation.","example[35]":"a firm of City stockbrokers","definition[12]":"London’s financial institutions, for example the INTERNATIONAL STOCK EXCHANGE and other markets, banks, and insurance companies considered together as a financial centre","example[36]":"The City will keep its position as a leading financial centre whether the UK joins the single currency or not.","definition[13]":"the area of London where most financial institutions are based","example[37]":"The investment banking firm left the City for brand new premises in Canary Wharf."}