{"word[0]":"nerve","signpost[0]":"body part","definition[0]":"nerves are parts inside your body which look like threads and carry messages between the brain and other parts of the body","note[0]":"trapped nerve British English,  pinched nerve American English (=a nerve that has been crushed between two muscles etc, causing pain)","example[0]":"a condition which affects the nerves in the back","signpost[1]":"courage","definition[1]":"courage and confidence in a dangerous, difficult, or frightening situation","example[1]":"It takes a lot of nerve to report a colleague for sexual harassment.","example[2]":"Jensen would’ve won if he hadn’t lost his nerve.","note[1]":"lose your nerve","example[3]":"It’s hard to keep your nerve when people keep interrupting you.","note[2]":"hold/keep your nerve","example[4]":"Not many people have the nerve to stand up and speak in front of a large audience.","note[3]":"the nerve to do something","example[5]":"She finally found the nerve to tell him she wanted a divorce.","signpost[2]":"lack of respect","definition[2]":"if you say someone has a nerve, you mean that they have done something unsuitable or impolite, without seeming to be embarrassed about behaving in this way","synonym[0]":"cheek","example[6]":"He’s got a nerve asking for more money.","example[7]":"‘She didn’t say sorry or anything.’ ‘What a nerve!’","example[8]":"She lets me do all the work, and then she has the nerve to criticize my cooking.","note[4]":"have the nerve to do something","collocation[0]":"calm/steady somebody's nerves","example[9]":"She took a few deep breaths, trying to calm her nerves.","collocation[1]":"settle/soothe somebody's nerves","example[10]":"She hoped that a cup of tea would soothe her nerves.","collocation[2]":"suffer from nerves","example[11]":"He suffered from nerves and could no longer perform on stage.","collocation[3]":"your nerves jangle","example[12]":"Suddenly she was wide awake, her nerves jangling.","form[0]":"NOUN + nerves","collocation[4]":"exam nerves","example[13]":"Quite a few of the students suffered from exam nerves.","collocation[5]":"first-night nerves","example[14]":"She always suffered from first-night nerves.","collocation[6]":"somebody's nerves are on edge","example[15]":"His nerves were on edge as he entered the dark room.","collocation[7]":"somebody's nerves are tattered/frayed/shattered","example[16]":"Everyone's nerves were frayed by the end of the week.","collocation[8]":"somebody's nerves are stretched (to breaking point)","example[17]":"Her nerves were stretched almost to breaking point as she waited.","collocation[9]":"be a bag/bundle of nerves","example[18]":"I was a bag of nerves during the interview.","collocation[10]":"be shaking with nerves","example[19]":"Just before the audition he was shaking with nerves.","collocation[11]":"be in a state of nerves","example[20]":"She was in such a state of nerves that she jumped at every noise.","collocation[12]":"an attack of nerves","example[21]":"Harrison had an attack of nerves before the match.","heading[0]":"– Meaning 3: courage and confidence in a dangerous, difficult, or frightening situation","example[22]":"I just didn't have the nerve to tell them the truth.","collocation[13]":"find the nerve to do something","example[23]":"He couldn't find the nerve to ask her out.","example[24]":"The team held their nerve and went on to win.","example[25]":"I wanted to ask him the question, but I lost my nerve.","collocation[14]":"test somebody's nerve","example[26]":"The next few days would test their nerve to the limit.","collocation[15]":"somebody's nerve fails (him/her)","example[27]":"At the last moment, her nerve failed her.","collocation[16]":"somebody's nerve breaks","example[28]":"The police hoped his nerve would break and he'd give himself away.","collocation[17]":"it takes nerve to do something","example[29]":"It takes nerve to stand up for what you believe.","collocation[18]":"a failure/loss of nerve","example[30]":"They accused the government of a loss of nerve."}