{"word[0]":"factor","signpost[0]":"cause/influence","definition[0]":"one of several things that influence or cause a situation","example[0]":"The rise in crime is mainly due to social and economic factors.","example[1]":"The weather could be a crucial factor in tomorrow’s game.","note[0]":"important/major/key/crucial factor","example[2]":"We liked both houses, but price was the deciding factor.","note[1]":"deciding/decisive/determining factor","example[3]":"The vaccination program has been a major factor in the improvement of health standards.","note[2]":"factor in","signpost[1]":"level on a scale","definition[1]":"a particular level on a scale that measures how strong or effective something is","example[4]":"factor 15 suntan oil","example[5]":"Even in July the wind chill factor (=the degree to which the air feels colder because of the wind) can be intense.","definition[2]":"a number that divides into another number exactly","example[6]":"3 is a factor of 15.","form[0]":"ADJECTIVES/NOUN + factor","collocation[0]":"an important factor","example[7]":"Human influence has been an important factor as regards climate change.","collocation[1]":"a major/minor factor","example[8]":"The country’s huge mineral reserves are a major factor behind its economic strength.","collocation[2]":"a key/crucial factor","example[9]":"A key factor in a company’s success is knowing its customers.","collocation[3]":"the deciding factor","example[10]":"The closeness of the river was probably the deciding factor when the site was chosen.","collocation[4]":"the decisive/determining factor","example[11]":"The support of middle-income voters was the decisive factor in the election.","collocation[5]":"a contributing factor","example[12]":"Stress is a contributing factor in many illnesses.","collocation[6]":"economic factors","example[13]":"Economic factors limit our options.","collocation[7]":"environmental factors","example[14]":"Various environmental factors affect the growth of grapes.","collocation[8]":"social factors","example[15]":"Social factors have played their part in the decline in family sizes.","collocation[9]":"a risk factor","example[16]":"The highest risk factor for coronary heart disease was found to be smoking.","collocation[10]":"depend on certain factors","example[17]":"Success depends on certain factors.","collocation[11]":"factors influence something","example[18]":"Various factors influenced the government’s decision.","collocation[12]":"factors determine something","example[19]":"The final cost of the product was determined by a combination of factors.","collocation[13]":"factors are responsible for something","example[20]":"These underlying factors were responsible for his death.","collocation[14]":"a combination/variety/number of factors","example[21]":"A combination of factors led to the closure of the factory.","collocation[15]":"take certain factors into account","example[22]":"You should take all these factors into account.","definition[3]":"to divide a number into factors","definition[4]":"one of many things that influence or affect a situation","example[23]":"The council will take a number of factors into account when making its decision.","example[24]":"The law should not be concerned solely with economic factors.","definition[5]":"the most important thing that affects a decision","example[25]":"The chancellor’s achievements on exchange and interest rates could be the deciding factor in the election.","example[26]":"The size of the firm is likely to be the determining factor as to whether decisions should be unanimous or taken by majority vote.","definition[6]":"when people have positive feelings about the economy and their own financial situation, and the way that this influences the popularity of the government","example[27]":"An opinion poll of voters showed a big drop in the feelgood factor.","definition[7]":"a financial institution that pays a business the money that suppliers owe it immediately, in return for a small percentage. The business benefits by getting the money immediately, improving its CASH FLOW. Factoring is a form of finance that can be cheaper than bank loans or OVERDRAFTs","example[28]":"New technology used by modern factors shows what cheques have been paid in and whether there are disputed invoices.","example[29]":"a member of the Association of Invoice Factors","definition[8]":"one of two or more numbers which divide into another number exactly. For example, 5 and 7 are factors of 35","definition[9]":"if an amount increases or decreases by a factor of five, ten etc, it increases or decreases by five times, ten times etc","example[30]":"A computer system can speed up administration by a factor of about 4.","definition[10]":"to buy debts that are owed to another company for less than the debts are worth, and then obtain payment directly from those who owe these debts","example[31]":"Some companies prefer not to disclose cashflow details, making it impossible to know how much merchandise in stores is factored."}