{"word[0]":"untidy","definition[0]":"not neat","synonym[0]":"messy","example[0]":"an untidy desk","example[1]":"untidy hair","example[2]":"Her clothes were in an untidy heap on the floor.","explanation[0]":"In American English and in everyday British English, people usually say messy rather than untidy:","example[3]":"His room is always so messy.","definition[1]":"someone who is untidy does not keep their house, possessions etc neat","definition[2]":"not tidy – used especially when things have not been put back in their correct place","example[4]":"an untidy bedroom","example[5]":"The house was cramped and untidy.","definition[3]":"untidy or dirty. American people use this word instead of untidy. British people use this word, but it sounds less formal than untidy","example[6]":"a messy kitchen","example[7]":"You’ve made the table all messy.","display[0]":"be a mess","definition[4]":"to be very untidy or dirty","example[8]":"The whole house is in a mess, but I didn’t have time to clean it up.","example[9]":"Sorry everything’s such a mess.","display[1]":"cluttered","definition[5]":"untidy because there are too many things in a small space","example[10]":"She gazed around the cluttered kitchen.","example[11]":"The office was cluttered with books.","example[12]":"Her desk was too cluttered.","display[2]":"unkempt","definition[6]":"untidy and not well-looked after – used about gardens or land","example[13]":"unkempt lawns","example[14]":"They walked into a wild and unkempt garden.","example[15]":"an unkempt plot in the cemetery","display[3]":"be a pigsty/pit","definition[7]":"used when saying that a place is very untidy and dirty, and someone should clean it","example[16]":"This place is a pigsty! Clean it up.","example[17]":"I don’t know how you can stand living in a pigsty like this.","example[18]":"My room’s a total pit, but I’m too lazy to clean it.","definition[8]":"an untidy person does not do things in a neat way, for example they leave things lying around instead of putting them back in the correct place. Also used about someone’s appearance, when they do not comb their hair, take care of their clothes etc","example[19]":"She was always very untidy – her clothes lay on the floor where she had dropped them.","example[20]":"He had obviously been sleeping; his hair was untidy and his chin unshaven.","example[21]":"You’ve made my hair all messy.","example[22]":"a messy eater","display[4]":"scruffy","definition[9]":"wearing old and untidy clothes","example[23]":"My parents think I look scruffy in these jeans, but I like them.","example[24]":"She’s wearing that scruffy old sweater again.","display[5]":"slovenly","definition[10]":"untidy and lazy","example[25]":"The servants were old and slovenly.","example[26]":"his slovenly appearance","example[27]":"The work was done in a slow, slovenly way.","display[6]":"bedraggled","definition[11]":"used when someone looks untidy because they have got wet or dirty","example[28]":"A rather bedraggled crowd waited outside in the pouring rain.","example[29]":"The children walked along the path, looking miserable and bedraggled.","display[7]":"dishevelled","definition[12]":"if someone’s hair or clothes look dishevelled, they look untidy, for example because they have just been in bed or in a windy place","example[30]":"Her hair was uncombed and her clothes were dishevelled.","example[31]":"a dishevelled old man","example[32]":"The singer was photographed looking ill and dishevelled.","definition[13]":"if someone has unkempt hair or an unkempt appearance, they look untidy and have not been taking care of the way they look","example[33]":"a rough-looking youth with long black unkempt hair","example[34]":"The man looked tired and unkempt.","display[8]":"slob","definition[14]":"someone who is extremely untidy but does not seem to care that they are","example[35]":"Jo’s such a slob – how can you live like that?","example[36]":"If you keep dressing like a slob, no one’s ever going to ask you for a date."}