{"word[0]":"expose","definition[0]":"to show something that is usually covered or hidden","example[0]":"He lifted his T-shirt to expose a jagged scar across his chest.","example[1]":"Potatoes turn green when exposed to light.","note[0]":"expose something to something","signpost[0]":"to something dangerous","definition[1]":"to put someone in a situation where they are not protected from something dangerous or unpleasant","note[1]":"expose yourself to ridicule/criticism etc (=say or do something that may make people laugh at you, criticize you etc)","example[2]":"The report revealed that workers had been exposed to high levels of radiation.","note[2]":"expose somebody to something","signpost[1]":"tell the truth","definition[2]":"to show the truth about someone or something, especially when it is bad","example[3]":"The film exposes the utter horror of war.","example[4]":"The report exposes the weaknesses of modern medical practice.","example[5]":"The baron was exposed as a liar and a cheat.","note[3]":"expose somebody as something","signpost[2]":"see/experience","definition[3]":"to make it possible for someone to experience new ideas, ways of life etc","example[6]":"Some children are never exposed to classical music.","definition[4]":"to allow light onto a piece of film in a camera in order to take a photograph","definition[5]":"to show other people feelings that you usually hide, especially when this is not planned","example[7]":"I’m afraid I might expose my real feelings for him.","definition[6]":"a story in a newspaper or on television that shows the truth about something, especially something dishonest or shocking","example[8]":"an exposé of corrupt practices by lawyers","note[4]":"exposé of","definition[7]":"a newspaper article or a television programme which tells people the truth for the first time about something bad, or someone who has done something illegal, dishonest, or wrong","example[9]":"a sensational exposé of insider dealing and corruption in the City","definition[8]":"to reveal the truth about someone or something that was hidden, especially when it involves something illegal, dishonest, or wrong","example[10]":"He achieved political prominence by exposing high-level corruption.","definition[9]":"to put goods in a place where people can see them or buy them","example[11]":"The products do not have to be exposed at the supplier’s premises.","example[12]":"Instead of displaying so many high-definition TVs, they could expose the cheaper sets."}