{"word[0]":"resolve","definition[0]":"to find a satisfactory way of dealing with a problem or difficulty","synonym[0]":"solve","example[0]":"The crisis was resolved by negotiations.","note[0]":"resolve a dispute/conflict/problem etc","example[1]":"Barnet was desperate for money to resolve his financial problems.","definition[1]":"to make a definite decision to do something","example[2]":"After the divorce she resolved never to marry again.","note[1]":"resolve to do something","example[3]":"Mary resolved that she would stop smoking.","note[2]":"resolve that","definition[2]":"to make a formal decision, especially by voting","example[4]":"The Senate resolved to accept the president’s proposals.","definition[3]":"to separate something into its different parts","example[5]":"DNA samples were extracted and resolved.","collocation[0]":"resolve a problem/crisis/situation","example[6]":"Action is being taken to resolve the problem.","collocation[1]":"resolve a dispute/conflict","example[7]":"Negotiation is the only way to resolve the dispute.","collocation[2]":"resolve an issue/matter/question","example[8]":"Has the issue been resolved yet?","collocation[3]":"resolve your differences","example[9]":"She and Rose had finally resolved their differences.","collocation[4]":"satisfactorily","example[10]":"Some problems still hadn’t been satisfactorily resolved.","collocation[5]":"fully/completely","example[11]":"It is a row that may never be fully resolved.","collocation[6]":"peacefully","example[12]":"We wanted to resolve the situation peacefully.","collocation[7]":"amicably","example[13]":"We will always do our best to resolve complaints amicably.","collocation[8]":"quickly","example[14]":"The matter was resolved quite quickly.","definition[4]":"strong determination to succeed in doing something","example[15]":"Recent events strengthened her resolve to find out the truth.","definition[5]":"to find a satisfactory way of settling a disagreement, dispute etc","example[16]":"Most pensiondisputes will beresolved within a year.","definition[6]":"to make an official decision, especially by voting","example[17]":"The directors have resolved to ask the company to appoint a receiver."}