{"word[0]":"environment","definition[0]":"the people and things that are around you in your life, for example the buildings you use, the people you live or work with, and the general situation you are in","example[0]":"The company had failed to provide a safe environment for its workers.","definition[1]":"the natural features of a place, for example its weather, the type of land it has, and the type of plants that grow in it","example[1]":"a forest environment","example[2]":"a very adaptable creature that will eat different foods in different environments","collocation[0]":"protect the environment","example[3]":"We need to take drastic steps to protect the environment.","collocation[1]":"conserve the environment","example[4]":"People need to live in harmony with nature and conserve the environment.","collocation[2]":"harm/damage the environment","example[5]":"The government insists that the dam will not harm the environment.","collocation[3]":"destroy the environment","example[6]":"We need to find ways of producing energy without destroying the environment.","collocation[4]":"pollute the environment","example[7]":"Nuclear waste will pollute the environment for centuries.","collocation[5]":"clean up the environment","example[8]":"It’s about time that we started cleaning up the environment.","collocation[6]":"the natural environment","example[9]":"Current methods of farming are damaging the natural environment.","collocation[7]":"the marine environment","example[10]":"Fish farming poses a threat to the marine environment.","collocation[8]":"be good/bad for the environment","example[11]":"Plastic bags are bad for the environment.","collocation[9]":"be harmful to the environment","example[12]":"Emissions from cars are harmful to the environment.","collocation[10]":"protection of the environment","example[13]":"In developing countries, protection of the environment is not a primary concern.","collocation[11]":"conservation of the environment","example[14]":"There are many organizations dedicated to conservation of the environment.","collocation[12]":"damage/harm to the environment","example[15]":"A lot of chemicals used in industry cause harm to the environment.","collocation[13]":"the destruction of the environment","example[16]":"Logging has led to the destruction of the natural environment.","collocation[14]":"pollution of the environment","example[17]":"The waste material must be stored safely to avoid pollution of the environment.","collocation[15]":"the effect/impact on the environment","example[18]":"The building’s design will minimize its impact on the environment.","heading[0]":"– Meaning 2: the people and things that are around you in your life, for example the buildings you use, the people you live or work with, and the general situation you are in","form[0]":"ADJECTIVES/NOUN + environment","collocation[16]":"the physical environment","example[19]":"Improvements to the physical environment range from removing graffiti to planting trees.","collocation[17]":"the immediate environment","example[20]":"Most accidents happen to young children within the immediate environment of their home.","collocation[18]":"a safe environment","example[21]":"The playground provides a safe environment for children.","collocation[19]":"a stable environment","example[22]":"They argued that being married helps provide a stable environment for bringing up children.","collocation[20]":"a friendly/pleasant environment","example[23]":"The restaurant offers a stylish and friendly environment with first-class service.","collocation[21]":"a clean/dirty environment","example[24]":"People who live in a very clean environment may have a lower immunity to germs.","collocation[22]":"a competitive environment","example[25]":"Our business has to operate in an increasingly competitive environment.","collocation[23]":"a working/learning environment","example[26]":"Most people prefer a quiet working environment.","collocation[24]":"the home/domestic/family environment","example[27]":"A lot of children suffer because of problems in their home environment.","collocation[25]":"the economic environment","example[28]":"The economic environment has changed, and many countries are sliding into recession.","collocation[26]":"the business environment","example[29]":"In today’s fast-moving business environment, companies must be flexible.","collocation[27]":"the political environment","example[30]":"Ministers are having to make these decisions in a difficult political environment.","collocation[28]":"the cultural/social environment","example[31]":"Changes in the cultural environment affect people’s attitudes and values.","heading[1]":"– Meaning 3: the natural features of a place, for example its weather, the type of land it has, and the type of plants that grow in it","collocation[29]":"a coastal/desert/mountain etc environment","example[32]":"The storm caused significant damage to the coastal environment.","collocation[30]":"an inhospitable/harsh environment","example[33]":"The freezing climate makes this one of the most inhospitable environments on the planet.","collocation[31]":"a hostile environment","example[34]":"It is difficult to see how anything can survive in such a hostile environment.","collocation[32]":"a fragile environment","example[35]":"Many people are worried about the impact of tourism on the region’s fragile environment.","display[0]":"the environment","definition[2]":"the air, water, and land on Earth, which is affected by man’s activities","example[36]":"We need to do more to protect the environment.","example[37]":"How much does air travel damage the environment?","display[1]":"ecosystem","definition[3]":"all the animals and plants that exist in a place, considered as a single system with parts that depend on each other","example[38]":"the island’s fragile ecosystem","example[39]":"The rapid decline in the number of great sharks is disrupting the marine ecosystem.","display[2]":"habitat","definition[4]":"the natural home of an animal or plant","example[40]":"The tree can grow to be 120 feet tall in its natural habitat.","display[3]":"the biosphere","definition[5]":"the Earth’s surface and atmosphere where animals and plants can live","example[41]":"Scientists are monitoring changes in the global biosphere.","display[4]":"ecology","definition[6]":"the scientific study of the way in which the animals, plants, and natural features of a place affect and depend on each other","example[42]":"She’s studying marine ecology.","display[5]":"green","definition[7]":"relating to the environment or to protecting the environment","example[43]":"Voters are becoming more concerned about green issues.","example[44]":"The party is keen to demonstrate its green credentials  (=show that it thinks the environment is important).","display[6]":"eco-","definition[8]":"relating to the environment and protecting the environment","example[45]":"eco-friendly products (=which do not harm the environment)","example[46]":"eco-tourism (=which does not harm the environment)","example[47]":"eco-warrior (=someone who protests to try to save the environment)","example[48]":"eco-sensitive land (=where the environment is easily damaged)","definition[9]":"the air, water, and land in which people, animals, and plants live","example[49]":"Since these chemicals were banned, pesticide levels in the environment have been declining.","definition[10]":"the general conditions that influence something","example[50]":"Moving forward in a changing environment is never easy.","example[51]":"In the new global business environment the exchange of information is the key to success.","example[52]":"The new company will be operating in a competitive environment.","example[53]":"The results were in line with what we expected, in spite of the difficult economic environment.","example[54]":"Despite the poor retail environment, the company is doing well.","definition[11]":"the kind of OPERATING SYSTEM used by a computer","example[55]":"the Windows environment"}