{"word[0]":"contact","signpost[0]":"communication","definition[0]":"communication with a person, organization, country etc","example[0]":"The town is cut off from contact with the outside world.","example[1]":"We stay in contact by email.","note[0]":"in contact","example[2]":"There is very little contact between the two tribes.","note[1]":"contact with/between","example[3]":"Many of us have no direct contact with elderly people.","definition[1]":"when two people or things touch each other","example[4]":"When water comes into contact with air, carbon dioxide is released.","example[5]":"Children need physical contact with a caring adult.","example[6]":"The disease spreads by sexual contact between infected animals.","example[7]":"For a second, his hand was in contact with mine.","note[2]":"in contact with something","example[8]":"The bomb exploded on contact  (=at the moment it touched something).","note[3]":"on contact (with something)","definition[2]":"when you meet someone or experience a particular kind of thing","example[9]":"Everyone who came into contact with Di felt better for knowing her.","example[10]":"Pat’s job brings her into contact with the problems people face when they retire.","definition[3]":"a person you know who may be able to help or advise you","note[4]":"business/personal contacts","example[11]":"He has a lot of contacts in the media.","example[12]":"a worldwide network of contacts","signpost[1]":"electrical","definition[4]":"an electrical part that completes a circuit when it touches another part","definition[5]":"a contact lens","collocation[0]":"have contact with somebody","example[13]":"I haven’t had any contact with her for at least two years.","collocation[1]":"be in contact","example[14]":"He’s been in contact with his lawyer about the situation.","collocation[2]":"get in contact","example[15]":"Where can I get in contact with you while you are away?","collocation[3]":"stay/keep in contact","example[16]":"We’ve stayed in contact since we met on holiday.","collocation[4]":"lose contact","example[17]":"She moved to Spain and I lost contact with her.","collocation[5]":"make contact","example[18]":"We’d like to make contact with other schools in the area.","collocation[6]":"put somebody in contact with somebody","example[19]":"I can put you in contact with a friend of mine in Paris.","collocation[7]":"come into contact with somebody","example[20]":"It’s good to come into contact with people from different  cultures.","collocation[8]":"bring somebody into contact with someone","example[21]":"The job brought me into contact with a lot of interesting people.","collocation[9]":"establish contact","example[22]":"The police are trying to establish contact with the kidnappers.","collocation[10]":"avoid contact","example[23]":"She doesn’t give interviews and avoids contact with the media.","collocation[11]":"sever contact with somebody","example[24]":"After the divorce, she severed all contact with her husband.","form[0]":"ADJECTIVES/NOUN + contact","collocation[12]":"direct contact","example[25]":"Our volunteers work in direct contact with people who need help.","collocation[13]":"close contact","example[26]":"I like to stay in close contact with my parents.","collocation[14]":"personal contact","example[27]":"She never comes into personal contact with senior managers.","collocation[15]":"social/human contact","example[28]":"He lived alone and had little human contact.","collocation[16]":"regular contact","example[29]":"All students have regular contact with their tutor.","collocation[17]":"day-to-day/daily contact","example[30]":"I like my job because it involves day-to-day contact with clients.","collocation[18]":"face-to-face contact","example[31]":"Certain types of jobs do not need face-to-face contact.","collocation[19]":"one-to-one contact","example[32]":"Children with learning difficulties may need one-to-one contact.","collocation[20]":"radio contact","example[33]":"Air traffic control had lost radio contact with the pilot.","definition[6]":"to write to or telephone someone","example[34]":"Give the name of someone who we can contact in an emergency.","example[35]":"Please do not hesitate to contact me if you have any queries.","explanation[0]":"You contact someone","example[36]":"Contact the sales department for details","bad_example[0]":"Contact with the sales department for details","display[0]":"make contact/get in contact","explanation[1]":"You make contact with someone","example[37]":"I’ve been trying to make contact with him","bad_example[1]":"make a contact with someone","explanation[2]":"You get in contact with someone","example[38]":"You can get in contact with us on this number","bad_example[2]":"get in contact to someone","explanation[3]":"that two or more people make contact or get in contact","example[39]":"They made contact as soon as they landed","display[1]":"get in touch","explanation[4]":"You get in touch with someone","example[40]":"I managed to get in touch with the owner","explanation[5]":"that two or more people get in touch","example[41]":"We got in touch and arranged to meet","explanation[6]":"In everyday English, people often say get in touch with someone rather than contact someone: ","example[42]":"Is there a number where I can get in touch with you?","definition[7]":"contact explosives or chemicals become active when they touch something","example[43]":"contact poisons","definition[8]":"a person you know who may be able to help or advise you, especially because of the work they do","example[44]":"There are some excellent opportunities around, if you ask friends and business contacts."}