{"word[0]":"recommendation","definition[0]":"official advice given to someone, especially about what to do","example[0]":"We will review the case and make a recommendation to the client.","example[1]":"recommendations for school reform","note[0]":"recommendation for","example[2]":"the main recommendations of the report","note[1]":"recommendation of","example[3]":"We are making no recommendation that children should use Standard English.","note[2]":"recommendation that","example[4]":"a recommendation to replace the existing system","note[3]":"recommendation to do something","definition[1]":"a suggestion to someone that they should choose a particular thing or person that you think is very good","example[5]":"Academic staff are appointed on the recommendation of a committee.","note[4]":"on somebody’s recommendation","definition[2]":"a formal letter or statement saying that someone would be a suitable person to do a job, take a course of study etc","example[6]":"Try to get letters of recommendation from bosses and colleagues.","collocation[0]":"make a recommendation","example[7]":"The inspectors will make their recommendations to the Environment Secretary.","collocation[1]":"accept a recommendation","example[8]":"The president accepted the report’s recommendations.","collocation[2]":"approve/adopt a recommendation","example[9]":"The council approved the committee’s recommendation.","collocation[3]":"implement recommendations","example[10]":"We will implement the recommendations of the Woolf Report to improve prison conditions.","collocation[4]":"the main recommendation","example[11]":"One of the main recommendations in the report is more parental involvement in education.","collocation[5]":"specific/detailed recommendations","example[12]":"We made a large number of specific recommendations for improving women’s mental health.","collocation[6]":"a clear recommendation","example[13]":"The report offered no clear recommendations or policy guidelines.","definition[3]":"official advice given to someone about what to do","example[14]":"His office will review the proposal and make a recommendation to the commission.","example[15]":"The plant was closed on the recommendation of regulators.","definition[4]":"a suggestion that someone should choose a particular thing or person because they are very good or suitable","example[16]":"He was offered the job on Johnson’s recommendation."}