{"word[0]":"form","signpost[0]":"type","definition[0]":"a particular type of something that exists in many different varieties","example[0]":"the art forms of the twentieth century","example[1]":"a severe form of cancer","note[0]":"form of","example[2]":"The bicycle is an environment-friendly form of transport.","signpost[1]":"way something is/appears","definition[1]":"the way something is or appears to be","example[3]":"We oppose racism in all its forms.","example[4]":"Vitamin C can be taken in capsule or tablet form.","example[5]":"A typical training programme takes the form of a series of workshops.","example[6]":"People are bombarded with information in the form of TV advertising.","note[1]":"in the form of something","definition[2]":"a shape","example[7]":"The female form is a thing of beauty.","example[8]":"the shadowy forms of the divers swimming below the boat","example[9]":"The main staircase was in the form of a big ‘S’.","signpost[2]":"document","definition[3]":"an official document with spaces where you write information, especially about yourself","example[10]":"Application forms are available from the college.","example[11]":"Just complete the entry form (=write the answers to the questions on a form) and return it.","example[12]":"Fill in the form and send it back with your cheque.","note[2]":"fill in/out a form","signpost[3]":"art/literature","definition[4]":"the structure of a work of art or piece of writing, rather than the ideas it expresses, events it describes etc","example[13]":"the distinction between form and content","signpost[4]":"performance","definition[5]":"how well a sports person, team, musician etc is performing, or has performed recently","example[14]":"I have been greatly encouraged by the team’s recent form.","example[15]":"He had no qualms about dropping players he thought were off form  (=not performing well).","example[16]":"On current form he’s one of the top three players in the country.","note[3]":"on present/current/past etc form","example[17]":"He’s been in good form all this season.","note[4]":"in good/fine/great form","definition[6]":"a class in a school","example[18]":"examinations taken in the fourth form","note[5]":"first/second/sixth etc form","definition[7]":"a way of writing or saying a word that shows its number, tense etc. For example, ‘was’ is a past form of the verb ‘to be’.","signpost[5]":"criminal record","definition[8]":"if someone has form, they are known to the police because they have committed crimes in the past","signpost[6]":"establish","definition[9]":"to establish an organization, committee, government etc","example[19]":"The winning party will form the government.","example[20]":"CARE was formed in 1946 and helps the poor in 38 countries.","signpost[7]":"be part of something","definition[10]":"to be the thing, or one of the things, that is part of something else, often having a particular use","example[21]":"Love and trust should form the basis of a marriage.","example[22]":"The project forms part of a larger project investigating the history of the cinema.","example[23]":"The river formed a natural boundary between the two countries.","explanation[0]":"Form is a linking verb that links the subject of the sentence with a noun","example[24]":"The changes form part of a new curriculum","signpost[8]":"start to exist","definition[11]":"to start to exist, or make something start to exist, especially as the result of a natural process","example[25]":"The rocks were formed more than 4,000 million years ago.","example[26]":"By midnight ice was already forming on the roads.","example[27]":"Sulphur dioxide and nitrogen oxide combine to form acid rain.","signpost[9]":"make/produce","definition[12]":"to make something by combining two or more parts","example[28]":"In English the past tense of a verb is usually formed by adding ‘ed’.","signpost[10]":"shape/line","definition[13]":"to come together in a particular shape or line, or to make something have a particular shape","example[29]":"Film-goers began to form a line outside the cinema.","example[30]":"Cut off the corners of the square to form a diamond.","definition[14]":"to establish and develop a relationship with someone","example[31]":"She seemed incapable of forming any relationships.","example[32]":"On returning to Boston, she formed a close friendship with her aunt.","signpost[11]":"influence","definition[15]":"to have a strong influence on how someone’s character develops and the type of person they become","synonym[0]":"mould","example[33]":"Events in early childhood often help to form our personalities in later life.","definition[16]":"an official document with spaces to answer questions and add information","example[34]":"a Medicare Benefits form","example[35]":"We need to receive your application form by July 31.","example[36]":"There was no delivery address on the order form.","example[37]":"If you would just like to fill in a form we will process your request as quickly as possible.","example[38]":"You must complete the entry form and return it to us.","definition[17]":"to establish a company, an organization, or a committee","example[39]":"Coca-Cola Amatil formed a joint venture with Tirtalina Group of Indonesia.","example[40]":"A committee was formed to look at the whole issue of bonuses for staff.","example[41]":"North American Vehicle Imports is a newly formed company with two principal partners.","definition[18]":"when a company, organization, or committee forms, it is established","example[42]":"This was something that was not considered when the United Nations first formed.","definition[19]":"to establish a relationship of working together","example[43]":"Electronic Data Systems Corp. and Australian-based Mincom formed an alliance to jointly market computer services and software to the mining industry."}