{"word[0]":"discharge","signpost[0]":"send somebody away","definition[0]":"to officially allow someone to leave somewhere, especially the hospital or the army, navy etc, or to tell them that they must leave","note[0]":"discharge yourself British English (=leave hospital before your treatment is complete)","example[0]":"Hospitals now tend to discharge patients earlier than in the past.","example[1]":"The judge discharged the jury.","example[2]":"Dunning was conditionally discharged for two years.","note[1]":"conditionally discharge somebody","example[3]":"Several of the recruits were discharged from the Army due to medical problems.","note[2]":"discharge somebody from something","signpost[1]":"gas/liquid/smoke etc","definition[1]":"to send out gas, liquid, smoke etc, or to allow it to escape","example[4]":"Sewage is discharged directly into the sea.","note[3]":"discharge something into something","example[5]":"Rainwater collects here and then discharges into the river Kennett.","note[4]":"discharge into","signpost[2]":"shoot","definition[2]":"to fire a gun or shoot an arrow etc","example[6]":"A soldier accidentally discharged his weapon.","signpost[3]":"duty/responsibility/debt etc","definition[3]":"to do or pay what you have a duty to do or pay","example[7]":"The trustees failed to discharge their duties properly.","note[5]":"discharge your duties/responsibilities/obligations etc","definition[4]":"if a piece of electrical equipment discharges, or if it is discharged, it sends out electricity","signpost[4]":"a wound","definition[5]":"if a wound or body part discharges a substance such as pus (=infected liquid), the substance slowly comes out of it","signpost[5]":"goods/passengers","definition[6]":"to take goods or passengers off a ship, plane etc","definition[7]":"when you officially allow someone to leave somewhere, especially the hospital or their job in the army, navy etc","example[8]":"Nurses visit the mother and baby for two weeks after their discharge from the hospital.","note[6]":"discharge from","definition[8]":"when gas, liquid, smoke etc is sent out, or the substance that is sent out","example[9]":"the discharge of toxic waste into the sea","note[7]":"discharge of","definition[9]":"when a substance slowly comes out of a wound or part of your body, or the substance that comes out","definition[10]":"electricity that is sent out by a piece of equipment, a storm etc","definition[11]":"when someone performs a duty or pays a debt","example[10]":"the discharge of the college’s legal responsibilities","definition[12]":"when someone shoots a gun","definition[13]":"to officially allow or tell someone to leave hospital, the army, a job etc","example[11]":"The men were treated for minor injuries and discharged.","example[12]":"He was discharged from the RAF last August.","definition[14]":"to remove someone from their job","example[13]":"In December, the airline discharged 49 employees and said it might need to make further cuts.","definition[15]":"to do properly everything that is part of a particular duty etc","example[14]":"The committee said that the Bank had failed to discharge its supervisory duties.","definition[16]":"to completely pay an amount that is owed","example[15]":"The payment of £4,000 together with the monthly sum of £1,000 was not enough to discharge in full the invoice for January’s work.","definition[17]":"to send out gas, liquid, smoke etc, or allow it to escape","example[16]":"Gas leaked from the tanker as it discharged crude oil at the refinery.","example[17]":"pollutants being discharged into the atmosphere","definition[18]":"to take goods off a ship, plane etc","synonym[0]":"UNLOAD","example[18]":"The ship discharged the 2,911-tonne cargo of 330 concrete-coated steel pipes in less than a day.","definition[19]":"to state officially that someone who was bankrupt has obeyed the court and can do business again","definition[20]":"when someone is officially allowed or told to leave hospital, the army, a job etc","example[19]":"The organization helps ex-servicemen and their dependants following discharge from the forces.","definition[21]":"when someone is removed from their job","example[20]":"He threatened to sue the firm for wrongful discharge.","definition[22]":"when someone performs a duty, responsibility etc properly and thoroughly","example[21]":"Although we do not consider Mr Gray’s conduct to have been dishonest, the discharge of his responsibilities as company secretary was most unsatisfactory.","definition[23]":"when an amount such as a debt or money claimed on an insurance policy is completely paid","example[22]":"the residue of the estate after the discharge of all debts and liabilities","definition[24]":"when gas, liquid, smoke etc is sent out or allowed to escape","example[23]":"£1 billion has been spent to control sewage discharges.","definition[25]":"when goods are taken off a ship, plane etc","synonym[1]":"UNLOADING","example[24]":"Checking the discharge of cargo is part of my job."}