{"signpost[0]":"not wide","definition[0]":"measuring only a small distance from one side to the other, especially in relation to the length","opposite[0]":"wide","example[0]":"his narrow bed","example[1]":"The stairs were very narrow.","example[2]":"a long, narrow band of cloud","example[3]":"a long narrow road","note[0]":"narrow street/road/path etc","example[4]":"the narrow passage between the cottage and the house","signpost[1]":"ideas/attitudes","definition[1]":"a narrow attitude or way of looking at a situation is too limited and does not consider enough possibilities","opposite[1]":"broad","example[5]":"You’ve got a very narrow view of life.","example[6]":"Some teachers have a narrow vision of what art is.","signpost[2]":"limited","definition[2]":"limited in range or number of things","example[7]":"The company offered only a narrow range of financial services.","definition[3]":"to make something narrower, or to become narrower","opposite[2]":"widen","example[8]":"He narrowed his eyes and gazed at the horizon.","example[9]":"The track divided into two and narrowed.","definition[4]":"if a range, difference etc narrows, or if something narrows it, it becomes less","example[10]":"The choice of goods available is narrowing.","example[11]":"The economic gap between the two halves of the country was beginning to narrow.","definition[5]":"small in amount","example[12]":"The polls give Mr. Edwards a narrow lead.","example[13]":"Analysts had expected a narrow decline in pretax earnings.","example[14]":"The Senate rejected the bid by a narrow margin (=it was almost accepted).","definition[6]":"including only a small number of parts or things","example[15]":"firms that make a narrow range of goods","example[16]":"the country’s weak and narrow economic base","definition[7]":"if shares, currencies etc trade in a narrow range, their price does not go up or down very much","example[17]":"The dollar had been trading in a narrow range against the yen.","definition[8]":"a narrow market is one in which the buying or selling of shares has a great effect on their price, for example because there are only a small number of them available","example[18]":"Cobalt is traded in a narrow market which means speculators can drive prices up or down rapidly.","definition[9]":"to become less or to make something less in range, difference etc","example[19]":"Growing competition for contracts will narrow profit margins.","example[20]":"The gap between the two companies is clearly narrowing.","example[21]":"The choice was quickly narrowed down to Luxembourg or Dublin."}