{"definition[0]":"if you increase something, or if it increases, it becomes bigger in amount, number, or degree","example[0]":"The population increased dramatically in the first half of the century.","example[1]":"political tensions that might increase the likelihood of war","example[2]":"Visits to the site have increased threefold since May.","example[3]":"Investments are certain to increase in value.","note[0]":"increase in value/price/importance etc","example[4]":"Food prices increased by 10% in less than a year.","note[1]":"increase (something) by something","example[5]":"The salary is £18,600 a year, increasing to £23,000.","note[2]":"increase (something) from/to something","explanation[0]":"In everyday English, people usually say that an amount or level goes up rather than increases:","example[6]":"The population has gone up a lot.","example[7]":"Her investments all went up in value.","explanation[1]":"Increase belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[2]":"In this sentence, ‘the price of gas’ is the object of increase","example[8]":"They increased the price of gas","explanation[3]":"In this sentence, ‘the price of gas’ is the subject of increase","example[9]":"The price of gas increased","heading[0]":"to increase","definition[1]":"to become larger in number, amount, or degree","example[10]":"Sales increased by 25%.","example[11]":"The level of violence has increased.","display[0]":"go up","definition[2]":"to increase. Go up is less formal than increase, and is the usual verb to use in everyday English","example[12]":"The price of coffee has gone up.","definition[3]":"to increase. Rise sounds a little formal and is often used when talking about the level of something increasing","example[13]":"The demand for oil has been rising steadily.","example[14]":"Living standards have risen dramatically.","display[1]":"grow","definition[4]":"to increase, especially gradually over a period of time – used about numbers or amounts","example[15]":"Since 1990, US imports of foreign goods have grown at a rate of 7.7% per year.","example[16]":"The number of people working from home has grown substantially.","display[2]":"escalate","definition[5]":"to increase to a high level – used about things that you do not want to increase such as costs, crimes, or violence","example[17]":"Fuel prices are escalating.","example[18]":"The fighting has escalated.","display[3]":"double/triple","definition[6]":"to become twice as much or three times as much","example[19]":"Since 1950, the number of people dying from cancer has almost doubled.","example[20]":"The company’s profits tripled last quarter.","display[4]":"expand","definition[7]":"to become larger in size, or to include a wider range of activities","example[21]":"The business has expanded at a rate of 15% per year.","example[22]":"We are hoping to expand into mobile phone services.","display[5]":"soar","definition[8]":"to increase and reach a very high level – used about numbers and amounts, or about feelings","example[23]":"The temperature soared to 36.6 degrees Centigrade.","example[24]":"His confidence soared.","example[25]":"The singer’s popularity has soared.","display[6]":"shoot up","definition[9]":"to increase very quickly and suddenly – used about prices, numbers, or temperatures","example[26]":"Share prices shot up 30% over the last week.","heading[1]":"to make something increase","definition[10]":"to make something larger in number, amount, or degree","example[27]":"Being overweight increases the risk of having a heart attack.","example[28]":"We need to increase the number of police officers on the streets.","display[7]":"put something up","definition[11]":"to increase prices, taxes etc. Put something up is less formal than increase, and is the usual verb to use in everyday English","example[29]":"The landlord has put the rent up again.","example[30]":"They’re always putting up gas prices.","definition[12]":"to increase something such as prices or taxes, or levels or standards","example[31]":"The bank has raised interest rates for the third time this year.","example[32]":"The school aims to raise students’ levels of achievement.","definition[13]":"to increase the amount of something so that it is twice or three times as large","example[33]":"The airline plans to double the number of passengers it carries by 2015.","example[34]":"High blood pressure triples the risk of strokes.","display[8]":"boost","definition[14]":"to increase sales, profits, production etc, especially when they have been lower than you want them to be","example[35]":"Growing affluence has boosted sales.","example[36]":"Oil exports boosted the economy.","definition[15]":"to increase something so that it contains a wider range of things, or to increase the size of a business","example[37]":"The company plans to expand its retail operations.","example[38]":"Supermarkets have expanded their ranges to include non-food items.","display[9]":"extend","definition[16]":"to increase something such as your power or influence, or the number of things you are involved in","example[39]":"We are hoping to extend the range of services that we offer.","example[40]":"The company plans to extend its dominance of the world car market.","display[10]":"step up something","definition[17]":"to increase your efforts or activities, especially to change a situation","example[41]":"Security has been stepped up following the bombing.","example[42]":"Local people have stepped up their campaign to prevent a prison being built in their neighbourhood.","display[11]":"heighten","definition[18]":"to increase a feeling or effect","example[43]":"The attack has heightened concerns about racism in schools.","example[44]":"Hunger can heighten the effect that alcohol has on you.","display[12]":"maximize","definition[19]":"to increase something as much as possible","example[45]":"Businesses try to maximize efficiency and cut costs.","example[46]":"To maximize the chances of a successful pregnancy, you should make sure that you eat well.","definition[20]":"a rise in amount, number, or degree","example[47]":"Recent tax increases have affected the poor more than the rich.","example[48]":"the dramatic increase in the population aged over 65","example[49]":"There has been a marked increase in the use of firearms.","example[50]":"Cases of tuberculosis are on the increase.","example[51]":"an increase in the crime rate","note[3]":"increase in","collocation[0]":"big/large","example[52]":"The company has announced a big increase in its profits for last year.","collocation[1]":"slight/small","example[53]":"Doctors have reported a slight increase in the number of deaths caused by the disease.","example[54]":"The temperature increase was quite small.","example[55]":"There has been a great increase in air traffic in the last twenty years.","collocation[2]":"huge/massive","example[56]":"There was a huge increase in emigration after the war.","collocation[3]":"substantial/considerable","example[57]":"He negotiated a substantial increase in pay for the workers.","collocation[4]":"significant/marked","example[58]":"Over the last few years, there has been a marked increase in tourism to developing countries.","collocation[5]":"dramatic/sharp","example[59]":"What has led to this dramatic increase in prices?","example[60]":"Recently there has been a rapid increase in fish farming.","example[61]":"The figures reveal a modest increase in the birth rate.","collocation[6]":"gradual","example[62]":"Her temperature chart showed a gradual increase over the preceding six hours.","collocation[7]":"steady","example[63]":"The university has benefited from a steady increase in student numbers.","collocation[8]":"a threefold/fourfold/fivefold etc increase","example[64]":"The figures show a threefold increase in incidents of car theft.","collocation[9]":"a 10%/50% etc increase","example[65]":"A 5% increase in petrol prices is predicted.","collocation[10]":"an annual increase","example[66]":"The company reported a 10% increase in pre-tax profits.","collocation[11]":"lead to an increase","example[67]":"They argue that the abolition of the death penalty has led to an increase in the number of murders.","collocation[12]":"cause/bring about an increase","example[68]":"The heat wave brought about a massive increase in water consumption.","form[0]":"NOUN + increase","collocation[13]":"a price increase","example[69]":"We expect a price increase of 1.4% this year.","collocation[14]":"a fare increase","example[70]":"The airline instituted a 10% fare increase.","collocation[15]":"a wage/pay/salary increase","example[71]":"Canadian workers received a 5.4% wage increase.","collocation[16]":"a tax increase","example[72]":"The government had no choice but to impose a tax increase.","collocation[17]":"be on the increase","example[73]":"Knife attacks are on the increase.","collocation[18]":"the rate of increase","example[74]":"The rate of increase in the number of violent crimes is much higher than under the previous government.","definition[21]":"an occasion when the amount or number of something becomes bigger","example[75]":"There has been a significant increase in violent crime over the past year.","example[76]":"price increases","display[13]":"growth","definition[22]":"an increase in the number, size, or importance of something. Growth  is also used when saying that a company or a country’s economy becomes more successful","example[77]":"The astonishing growth of the Internet has had a dramatic effect on people’s lives.","example[78]":"Japan experienced a period of rapid economic growth.","example[79]":"Many people are concerned about the enormous growth in the world’s population.","definition[23]":"an increase in the amount of something, or in the standard or level of something","example[80]":"The latest figures show a sharp rise (=a sudden big rise) in unemployment in the region.","example[81]":"There was a 34 percent rise in the number of armed robberies.","example[82]":"The majority of families experienced a rise in living standards.","display[14]":"surge","definition[24]":"a sudden increase in something such as profits, demand, or interest","example[83]":"There has been a big  surge in  demand for organically grown food.","example[84]":"We have seen a tremendous surge of interest in Chinese medicine.","display[15]":"gain","definition[25]":"an increase in the amount or level of something – used especially in business or political contexts, or when talking about an increase in someone’s weight","example[85]":"sales gains","example[86]":"The December job figures show a net gain of 81,000 jobs.","example[87]":"The party has experienced a gain in popularity.","example[88]":"The amount of weight gain during pregnancy varies.","display[16]":"hike","definition[26]":"a large or sudden increase in prices or taxes – often used in newspaper reports","example[89]":"Despite a 25% hike in fuel costs, the airline made a profit last year.","example[90]":"tax hikes","example[91]":"wage hikes","heading[2]":"a very big increase","display[17]":"explosion","definition[27]":"a sudden very large increase in the amount or number of something","example[92]":"There has been an explosion in the number of fast food restaurants.","example[93]":"The country experienced a population explosion.","example[94]":"The book caused an explosion of interest in Renaissance Italy.","display[18]":"boom","definition[28]":"a sudden large increase in trade, profits or sales, with the result that a country, company, or industry becomes very successful. Boom is also used about a sudden increase in interest in something, with the result that it becomes very popular","example[95]":"the German  economic boom of the 1960s","example[96]":"the Internet boom","example[97]":"There has been a boom in sales of diet books and videos.","definition[29]":"to become larger in amount, number, or degree","example[98]":"Manufacturing output increased 0.6% in July.","example[99]":"Sales increased to 11.5 million tons from 11 million tons.","example[100]":"The yen is forecast to increase in value over the next year.","example[101]":"The oil that it uses has increased in price to $13 a barrel.","definition[30]":"to make something larger in amount, number, or degree","example[102]":"The rail company increased the number of passengers it carried last year by 14%.","example[103]":"He has increased the number of his licensing agreements.","example[104]":"There was an increase in delays of deliveries of supplies.","example[105]":"Demand for low-cost housing is on the increase  (=is increasing).","definition[31]":"when an amount is increased by a company or government","example[106]":"Tobacco use in the state fell mostly because of the rise in the cost of cigarettes as a result of the tax increase."}