{"word[0]":"later","definition[0]":"after the time you are talking about or after the present time","example[0]":"I’m going out for a bit – I’ll see you later.","example[1]":"He became Senator two years later.","note[0]":"two years/three weeks etc later","example[2]":"The baby died later that night.","note[1]":"later that day/morning/week etc","example[3]":"The dentist could fit you in later in the week.","note[2]":"later in the day/week/year","definition[1]":"coming in the future or after something else","opposite[0]":"earlier","example[4]":"The role of marketing is dealt with in a later chapter.","example[5]":"The launch was postponed to a later date.","definition[2]":"more recent","example[6]":"The engine has been greatly improved in later models.","definition[3]":"happening or existing at some time in the future after something or someone else","example[7]":"We will discuss this at a later time.","example[8]":"Later historians have cast doubt on the truth of his story.","example[9]":"They say that they may need to review the case at a later stage.","display[0]":"following","definition[4]":"happening or coming immediately after something – used about periods of time, or parts of a piece of writing","example[10]":"He resigned the following year.","example[11]":"The following day he was back to normal.","example[12]":"Gandhi 's attitude to religion is dealt with in the following chapter.","display[1]":"future","definition[5]":"likely to happen or exist at some time in the future","example[13]":"What influence will this have on future developments?","display[2]":"subsequent","definition[6]":"happening or coming at some time after something else","example[14]":"a subsequent decision by the Supreme Court","example[15]":"Subsequent events proved him wrong.","example[16]":"In subsequent years, the number of patients became smaller and smaller.","display[3]":"succeeding","definition[7]":"coming after someone or something else – used about a series of groups of people, periods of time, or parts of a book","example[17]":"His work was admired by succeeding generations.","example[18]":"Over the succeeding months, the stitches were carefully removed.","example[19]":"These problems are further discussed in the succeeding chapters."}