{"word[0]":"write off","definition[0]":"to write a letter to a company or organization asking them to send you goods or information","synonym[0]":"send off","example[0]":"Are you going to write off for that free poster?","definition[1]":"to decide that someone or something is useless, unimportant, or a failure","synonym[1]":"dismiss","example[1]":"After six months of work, we eventually wrote the project off as a non-starter.","note[0]":"write somebody/something ↔ off as","definition[2]":"to officially say that a debt no longer has to be paid, or officially accept that you cannot get back money you have spent or lost","example[2]":"The United States agreed to write off debts worth billions of dollars.","example[3]":"The Inland Revenue wrote off £900 million in unpaid taxes.","definition[3]":"to make an official record of the amount of money that you have spent on things relating to your business, in order to reduce the amount of tax that you have to pay","example[4]":"The costs of setting up a business can be written off against tax.","note[1]":"write something ↔ off against","definition[4]":"to damage a vehicle so badly that it can never be used again","example[5]":"At thirteen he stole a car and wrote it off.","definition[5]":"a vehicle that has been so badly damaged that it can never be used again","example[6]":"The car was a complete write-off.","definition[6]":"a period of time when you fail to achieve anything","example[7]":"This morning was a complete write-off.","definition[7]":"an official agreement that someone does not have to pay a debt","example[8]":"We’ve written the project off as a non-starter.","definition[8]":"to officially say that someone does not have to pay a debt","example[9]":"As part of the deal, all their debts were written off.","definition[9]":"to reduce the value of an asset to nothing, for example in the case of a bad debt (=money you have lent but that will never be repaid)","example[10]":"Businesses write off capital assets over a period of years.","definition[10]":"if an insurance company writes off a vehicle, it decides that it has been damaged so badly that it is not worth repairing","example[11]":"The car has been written off, so they have to pay out for a new one.","definition[11]":"an official agreement stating that someone does not have to pay a debt","example[12]":"The 20% write-off of Argentinian debt had been expected.","definition[12]":"when all or part of the value of an asset as shown in a company’s accounts is reduced","example[13]":"a write-off of obsolete or redundant stock","definition[13]":"a vehicle that an insurance company decides has been so badly damaged that it is not worth repairing"}