{"word[0]":"defend","definition[0]":"to do something in order to protect someone or something from being attacked","example[0]":"a struggle to defend our homeland","example[1]":"the need to defend democracy against fascism","note[0]":"defend something against/from something","example[2]":"advice on how women can defend themselves from sex attackers","note[1]":"defend yourself (against/from somebody/something)","example[3]":"We need to defend against military aggression.","note[2]":"defend against","definition[1]":"to use arguments to protect something or someone from criticism, or to prove that something is right","example[4]":"She was always defending her husband in front of their daughter.","example[5]":"Students should be ready to explain and defend their views.","example[6]":"Cooper wrote to the journal immediately, defending himself.","example[7]":"He defended his wife against rumours and allegations.","note[3]":"defend somebody against/from somebody/something","explanation[0]":"In everyday English, people usually say stand up for someone rather than defend someone:","example[8]":"She was the only person who stood up for me at the meeting.","definition[2]":"to do something in order to stop something from being taken away or in order to make it possible for something to continue","example[9]":"the workers’ attempts to defend their interests","example[10]":"We are defending the right to demonstrate.","definition[3]":"to protect your own team’s end of the field in a game such as football, in order to prevent your opponents from getting points","example[11]":"Bournemouth defended well throughout the game.","definition[4]":"to take part in a competition that you won the last time it was held, and try to win it again","example[12]":"The world champion was defending his title.","example[13]":"the defending champion","example[14]":"He is defending a Labour majority of 5,000.","definition[5]":"to be a lawyer for someone who has been charged with a crime","opposite[0]":"prosecute","example[15]":"He had top lawyers to defend him.","example[16]":"Howard, defending, said Thompson had been drinking heavily.","definition[6]":"to say something to support an idea or person when other people are criticizing them","example[17]":"The mayor defended the action, saying that it was the best option.","display[0]":"stand up for somebody/something","definition[7]":"to strongly defend someone who is being criticized, or strongly defend your ideas or your rights","example[18]":"My grandfather would always stand up for what was right.","example[19]":"I don't want him fighting, but I do want him to stand up for himself.","display[1]":"stick up for somebody","definition[8]":"to strongly defend someone who is being criticized, especially when no one else will defend them","example[20]":"The other kids tease her, but Sarah often sticks up for her.","display[2]":"come to somebody's defence","definition[9]":"to say something to defend someone who is being criticized","example[21]":"Aitken's colleagues quickly came to his defence.","definition[10]":"if a lawyer defends someone charged with a crime, he or she represents that person and argues that they are not guilty of the charge","definition[11]":"to do something in order to stop something being taken away or to make sure that something continues","example[22]":"The union said that they would take strike action to defend their members’ jobs."}