{"word[0]":"scale","signpost[0]":"size/level","definition[0]":"the size or level of something, or the amount that something is happening","example[0]":"A structural survey revealed the full scale of the damage.","example[1]":"I was shocked by the sheer scale (=very big scale) of the destruction.","example[2]":"Large firms benefit from economies of scale (=ways of saving money because they are big).","example[3]":"There has been housing development on a massive scale since 1980.","note[0]":"on a large/small/grand etc scale","example[4]":"Most alternative technologies work best on a small scale.","example[5]":"Pollution could cause changes to weather patterns on a global scale.","note[1]":"on a global/international/world scale","example[6]":"We had underestimated the scale of the problem.","note[2]":"scale of","signpost[1]":"range","definition[1]":"a whole range of different types of people or things, from the lowest level to the highest","example[7]":"Some rural schools have 50 pupils, while at the other end of the scale are city schools with nearly 5,000 pupils.","example[8]":"She gradually made her way up the social scale.","note[3]":"up/down the scale","example[9]":"animals which are lower down the evolutionary scale (=the range of animals that have developed gradually over a long time)","signpost[2]":"measuring system","definition[2]":"a system of numbers that is used for measuring the amount, speed, quality etc of something","example[10]":"changes to the company’s pay scale","example[11]":"Your performance will be judged on a scale of 1 to 10.","example[12]":"We use a sliding scale (=in which prices are not firmly fixed) for charges.","example[13]":"The earthquakes measured 7 on the Richter scale.","note[4]":"on a scale","signpost[3]":"measuring marks","definition[3]":"a set of marks with regular spaces between them on a tool that is used for measuring, or on the side of a mathematical drawing","example[14]":"a ruler with a metric scale","signpost[4]":"map/model","definition[4]":"the relationship between the size of a map, drawing, or model and the actual size of the place or thing that it represents","example[15]":"a map with a scale of 1:250,000","example[16]":"a scale drawing of the Eiffel Tower","note[5]":"scale model/drawing etc","example[17]":"All our models are made to scale.","note[6]":"to scale","definition[5]":"a series of musical notes that become higher or lower, with fixed distances between each note","example[18]":"the scale of G major","signpost[5]":"fish","definition[6]":"one of the small flat pieces of skin that cover the bodies of fish, snakes etc","signpost[6]":"teeth","definition[7]":"a white substance that forms on your teeth","signpost[7]":"water pipes","definition[8]":"a white substance that forms around the inside of hot water pipes or containers in which water is boiled","heading[0]":"– Meaning 1: the size or level of something, or the amount that something is happening","collocation[0]":"on a large scale","example[19]":"This technology has been developed on a large scale in the US.","collocation[1]":"on a massive/huge scale","example[20]":"The drug is produced on a massive scale.","collocation[2]":"on a grand scale","example[21]":"The Romans built on a grand scale.","collocation[3]":"on a small scale","example[22]":"They started by producing and selling on a small scale.","collocation[4]":"on a human scale","example[23]":"Architects have been asked to redesign some of the buildings on a more human scale.","collocation[5]":"on a national scale","example[24]":"The survey was carried out on a national scale.","collocation[6]":"on an international scale","example[25]":"Preparations to deal with an outbreak of the disease are being made on an international scale.","collocation[7]":"on a global/world scale","example[26]":"This is a product that can be sold in high volumes on a global scale.","collocation[8]":"on an unprecedented scale","example[27]":"Propaganda techniques were used on an unprecedented scale.","collocation[9]":"economies of scale","example[28]":"Merging these departments will create economies of scale.","collocation[10]":"the full scale of something","example[29]":"He acknowledged that the full scale of the problem was not known.","collocation[11]":"the sheer scale of something","example[30]":"He was shocked by the sheer scale of the suffering he witnessed.","heading[1]":"– Meanings 2 & 4","collocation[12]":"the top of a scale","example[31]":"At the top of the scale come the predators.","collocation[13]":"the bottom of a scale","example[32]":"He started at the bottom of the pay scale.","collocation[14]":"the end of a scale","example[33]":"At the other end of the scale, the youngest competitor was just sixteen years old.","collocation[15]":"further/higher up a scale","example[34]":"Peasants managed their land as skilfully as some people higher up the social scale.","collocation[16]":"further/lower down a scale","example[35]":"Bonuses are not paid to people lower down the salary scale.","form[0]":"ADJECTIVES/NOUN + scale","collocation[17]":"the social scale","example[36]":"At the other end of the social scale, life is a constant struggle to get enough to eat.","collocation[18]":"the evolutionary scale","example[37]":"Birds are much lower on the evolutionary scale than dogs.","collocation[19]":"a pay/salary scale","example[38]":"As a senior teacher, she has reached the top of her pay scale.","collocation[20]":"move up/down a scale","example[39]":"Some farmers prospered and moved up the social scale.","definition[9]":"to climb to the top of something that is high and difficult to climb","example[40]":"Rescuers had to scale a 300-metre cliff to reach the injured climber.","definition[10]":"to make writing or a picture the right size for a particular purpose","example[41]":"The writing can be scaled to any size, depending on the paper.","note[7]":"scale something to something","definition[11]":"if something will scale, it will continue to work well even if it is made bigger or comes to include more things","example[42]":"Will this way of networking scale?","definition[12]":"the size or level of something, especially when this is large","example[43]":"We need to recycle plastics on a much bigger scale.","example[44]":"No-one had anticipated the scale of the redundancies  (=that there would be so many).","definition[13]":"the disadvantages that a big factory, shop etc has compared with a smaller one, for example because it is more difficult to run a larger production unit","example[45]":"Over a period of decades, output becomes less profitable as diseconomies of scale arise.","definition[14]":"the advantages that a big factory, shop etc has over a smaller one because it can spread its FIXED COSTs over a larger number of units and therefore produce or sell things more cheaply","example[46]":"Joint production ventures allow for greater economies of scale.","definition[15]":"a list of figures used for measuring and comparing amounts","example[47]":"Managers gave their opinion of the bond markets, ranked on a scale of one to ten.","example[48]":"the company pay scale","example[49]":"a progressive scale of tax rates"}