{"word[0]":"penalty","plural[0]":"penalties","definition[0]":"a punishment for breaking a law, rule, or legal agreement","example[0]":"No littering. Penalty $500.","example[1]":"Withdrawing the money early will result in a 10% penalty.","example[2]":"If he is convicted, he could receive the death penalty (=be killed as a punishment).","example[3]":"Drug dealers face severe penalties.","note[0]":"severe/stiff/heavy penalty","example[4]":"The penalty for a first offense is a fine.","note[1]":"penalty for","definition[1]":"something bad that happens to you because of something you have done or because of the situation you are in","example[5]":"If you don’t do the job right, you will pay the penalty.","example[6]":"One of the penalties of being famous is the loss of privacy.","note[2]":"penalty of (doing) something","definition[2]":"a disadvantage in sports given to a player or team for breaking a rule","example[7]":"Woodson received a penalty.","definition[3]":"a chance to kick the ball or hit the puck into the goal in a game of football, rugby, or ice hockey, given because the other team has broken a rule","example[8]":"Townsend kicked a penalty (=in a rugby game) in the last minute.","example[9]":"Leeds were awarded a penalty.","heading[0]":"– Meaning 1: a punishment for breaking a law, rule, or legal agreement","form[0]":"ADJECTIVES/NOUN + penalty","collocation[0]":"a severe/stiff/heavy/tough/harsh penalty","example[10]":"There were calls for stiffer penalties for killers of police officers.","collocation[1]":"the maximum penalty","example[11]":"The maximum penalty for the offence is now three years’ imprisonment.","collocation[2]":"a financial penalty","example[12]":"Parents who fail to prevent their children committing crimes are to face heavy financial penalties.","collocation[3]":"the death penalty","example[13]":"If convicted, they face the death penalty.","collocation[4]":"a crime carries a penalty","example[14]":"Murder carries a minimum penalty of 15 years in prison.","collocation[5]":"impose a penalty","example[15]":"Severe penalties are imposed for election fraud.","collocation[6]":"face a penalty","example[16]":"He faces a maximum penalty of 10 years’ imprisonment.","heading[1]":"– Meaning 4: a chance to kick the ball or hit the puck into the goal in a game of football, rugby, or ice hockey, given because the other team has broken a rule","collocation[7]":"take a penalty","example[17]":"Why did they let Jones take the penalty?","collocation[8]":"kick a penalty","example[18]":"Jon Bland kicked a penalty to make it 6–3.","collocation[9]":"miss a penalty","example[19]":"He missed that penalty against France.","collocation[10]":"score a penalty","example[20]":"Billy Dodds scored a penalty for Rangers after 55 minutes.","collocation[11]":"award/give (a team) a penalty","example[21]":"The referee awarded Bradford a penalty in the final minute.","definition[4]":"a punishment for breaking a law or rule","example[22]":"The offence carries a maximum penalty of two years’ imprisonment.","example[23]":"The stiff penalties (=severe penalties) facing the eight racketeers are likely to act as a strong deterrent.","example[24]":"There will be increased penalties for dumping oil at sea.","definition[5]":"an amount of money someone has to pay if they do not keep to a legal agreement, especially an agreement with a bank or an insurance company","example[25]":"There is a 10% penalty for withdrawing funds in the first three years."}