{"word[0]":"pool","signpost[0]":"for swimming","definition[0]":"a hole or container that has been specially made and filled with water so that people can swim or play in it","synonym[0]":"swimming pool","example[0]":"They have a nice pool in their backyard.","example[1]":"a shallow pool suitable for children","signpost[1]":"area of water","definition[1]":"a small area of still water in a hollow place","example[2]":"pools of water with tiny fish in them","example[3]":"Mosquitoes breed in stagnant pools of water.","definition[2]":"a game in which you use a stick to hit numbered balls into holes around a table, which is often played in bars","example[4]":"We went to the pub and played pool.","note[0]":"shoot/play pool","definition[3]":"a group of people who are available to work or to do an activity when they are needed","example[5]":"The region has a large and talented labour pool.","example[6]":"a pool of talented applicants to choose from","note[1]":"pool of","signpost[2]":"shared money/things","definition[4]":"a number of things that are shared or an amount of money that is shared by a group of people","example[7]":"Both partners put money into a common pool.","definition[5]":"a game in which people try to win money by guessing the result of a sports game, or the money that is collected from these people for this","example[8]":"the office basketball pool","definition[6]":"to combine your money, ideas, skills etc with those of other people so that you can all use them","example[9]":"Investors agreed to pool their resources to develop the property.","example[10]":"The students worked together, pooling their knowledge.","definition[7]":"an amount of money or a number of things shared by a group of people","example[11]":"Both partners put money into a common pool, and both may spend this money.","definition[8]":"a group of people who are available to do a particular job, if they are needed","example[12]":"Taiwan offered a pool of cheap labour.","example[13]":"There is a considerable pool of experience within our own organization.","definition[9]":"an association of insurance companies organized to UNDERWRITE (=be responsible for) a particular risk, each member sharing any costs or losses","example[14]":"the state-run pool for high-risk drivers","example[15]":"Meetings enable people to pool ideas.","example[16]":"More and more firms are pooling their resources and going into joint ventures."}