{"word[0]":"commitment","definition[0]":"a promise to do something or to behave in a particular way","example[0]":"Are you ready to make a long-term commitment?","example[1]":"Our company has a commitment to quality and customer service.","note[0]":"commitment to","definition[1]":"the hard work and loyalty that someone gives to an organization, activity etc","example[2]":"I was impressed by the energy and commitment shown by the players.","example[3]":"Her commitment to work is beyond question.","definition[2]":"something that you have promised you will do or that you have to do","example[4]":"Will the job fit in with your family commitments?","definition[3]":"an amount of money that you have to pay regularly","example[5]":"I had a lot of financial commitments.","definition[4]":"the use of money, time, people etc for a particular purpose","example[6]":"commitments of food and medical aid of over $4 billion","collocation[0]":"make a commitment","example[7]":"Getting married involves making a serious commitment.","collocation[1]":"give a commitment","example[8]":"The government gave a commitment to withdraw all its forces.","collocation[2]":"something requires/demands (a) commitment","example[9]":"Nursing as a profession demands genuine commitment.","collocation[3]":"honour/meet a commitment","example[10]":"Will they honour their commitment to a ceasefire?","collocation[4]":"show/demonstrate commitment","example[11]":"Throughout her life she demonstrated her deep commitment to the needs of the poor.","collocation[5]":"lack commitment","example[12]":"I never get promoted because they think I lack commitment.","collocation[6]":"reaffirm/restate/reiterate a commitment","example[13]":"They reaffirmed their commitment to abandon nuclear power.","collocation[7]":"real/genuine commitment","example[14]":"The job demands real commitment to teaching.","collocation[8]":"personal commitment","example[15]":"As a company, we expect a personal commitment from our staff to do their best.","collocation[9]":"strong commitment","example[16]":"She's known for her strong commitment to women's rights.","collocation[10]":"long-term commitment","example[17]":"Having a child together involves a long-term commitment.","collocation[11]":"a lifelong commitment","example[18]":"Marriage is a lifelong commitment.","collocation[12]":"full/total commitment","example[19]":"Such therapies demand full commitment from the patient.","collocation[13]":"political commitment","example[20]":"There was no local political commitment to the proposal.","collocation[14]":"religious commitment","example[21]":"Many people have ceased to have any active religious commitment.","collocation[15]":"a lack of commitment","example[22]":"His lack of commitment to the project was easy to see.","collocation[16]":"a level of commitment","example[23]":"This post demands a high level of commitment.","example[24]":"He’s made a commitment to improve the quality of life for people in Gloucestershire.","example[25]":"a commitment to equal pay and opportunities","definition[5]":"the hard work and loyalty that someone gives to an organization or activity","example[26]":"Sue will be greatly missed for her enthusiasm and commitment.","example[27]":"The Group’s success is a direct result of commitment by staff to high standards of service.","definition[6]":"something that you have to do that prevents you from doing something else","example[28]":"Mr Reid has a previous commitment and is unable to attend the meeting.","example[29]":"part time work for people with family commitments","definition[7]":"an amount of money that you have to pay regularly and that prevents you from spending your money on other things","example[30]":"A mortgage may be the largest financial commitment you will make in your life.","example[31]":"The plan involves commitment of large amounts of money and staff time."}