{"word[0]":"glory","plural[0]":"glories","definition[0]":"the importance, honour, and praise that people give someone they admire a lot","example[0]":"She dreamt of future glory as an Olympic champion.","example[1]":"Goran’s moment of glory came when he defeated Rafter.","example[2]":"He began the season in a blaze of glory, scoring seven goals in as many games.","definition[1]":"an achievement that is greatly admired or respected, or makes you very proud","example[3]":"monuments to past glories","example[4]":"Becoming a Supreme Court judge was the crowning glory  (=most successful part) of her career.","example[5]":"one of the finest artistic glories of Florence","note[0]":"glory of","definition[2]":"when something is beautiful and impressive in appearance","example[6]":"They spent $10 million restoring the theatre to its former glory.","example[7]":"The sun emerged from behind the clouds in all its glory.","note[1]":"in all its/their etc glory","collocation[0]":"a blaze of glory","example[8]":"The film opened in a blaze of glory with rave reviews from critics.","collocation[1]":"somebody's moment of glory","example[9]":"The team's only moment of glory came in the second half of the game.","collocation[2]":"somebody's dream of glory","example[10]":"His dreams of glory were shattered when he lost to Federer.","collocation[3]":"bask/bathe in the glory of something","example[11]":"Challenor basked in the glory of his achievement.","collocation[4]":"cover yourself in glory","example[12]":"As team captain, he hasn't covered himself in glory.","collocation[5]":"steal somebody's glory","example[13]":"Collins is wonderful, but Shaw steals all the glory with his magnificent performance.","collocation[6]":"win glory","example[14]":"He wanted to win glory in battle.","collocation[7]":"bring glory to somebody/something","example[15]":"Locals hope the discovery will bring prosperity and glory to the town.","collocation[8]":"reflected glory","example[16]":"She basked in the reflective glory of her daughter's marriage to such a famous actor.","collocation[9]":"personal glory","example[17]":"He put the team's interests above any chance of personal glory.","collocation[10]":"greater glory","example[18]":"He aimed to bring greater glory to France."}