{"word[0]":"sensitive","signpost[0]":"understanding people","definition[0]":"able to understand other people’s feelings and problems","opposite[0]":"insensitive","example[0]":"a sensitive and intelligent young man","example[1]":"It’s made me much more sensitive to the needs of the disabled.","note[0]":"sensitive to","signpost[1]":"easily offended","definition[1]":"easily upset or offended by events or things that people say","note[1]":"sensitive soul British English (=someone who is easily upset by small or unimportant things)","example[2]":"a very sensitive child","example[3]":"Laura’s sensitive about her weight.","note[2]":"sensitive about","example[4]":"Throughout her career she remained very sensitive to criticism.","signpost[2]":"easily affected","definition[2]":"easily affected or damaged by something such as a substance or temperature","example[5]":"Wetlands are environmentally sensitive areas.","example[6]":"a baby’s sensitive skin","example[7]":"Older people tend to be very sensitive to cold.","example[8]":"Increasing numbers of people are sensitive to cow’s milk.","signpost[3]":"situation/subject","definition[3]":"a situation or subject that is sensitive needs to be dealt with very carefully, because it is secret or because it may offend people","example[9]":"Abortion is a very sensitive issue.","example[10]":"sensitive matters such as national security","example[11]":"highly sensitive information","signpost[4]":"reacting to changes","definition[4]":"reacting to very small changes in light, temperature, position etc","example[12]":"a highly sensitive electronic camera","example[13]":"light-sensitive photographic paper","note[3]":"light-sensitive/heat-sensitive etc","signpost[5]":"art/music etc","definition[5]":"able to understand or express yourself through art, music, literature etc","example[14]":"a very sensitive performance","definition[6]":"very easily and quickly affected by changes","example[15]":"Many economically sensitive companies have closed factories and cut their staff.","example[16]":"We face fierce competition from imports and price-sensitive consumers (=customers who are likely to buy a product if the price goes down, and not buy it if the price rises).","example[17]":"A fall in bond prices discouraged investors from buying stocks that aresensitive to interest rates.","definition[7]":"something that is sensitive is kept secret because it might be used to gain an advantage","example[18]":"During the trial, the company argued that the documents containedsensitive trade secrets and should be kept confidential.","example[19]":"Modern telecommunications technology means there is a greater risk thatsensitive information will be misused or stolen.","definition[8]":"able to understand other people’s needs or particular problems etc","example[20]":"Local authorities will have to become morecustomer sensitive.","example[21]":"Waste must be disposed of in an environmentally sensitive way.","example[22]":"We’re sensitive to consumers’ needs and opinions."}