{"word[0]":"register","signpost[0]":"official list","definition[0]":"an official list of names of people, companies etc, or a book that has this list","note[0]":"call/take the register British English old-fashioned (=say the names of the students in a class, to check who is there)","example[0]":"Have you signed the hotel register?","example[1]":"Police want a national register of DNA samples.","example[2]":"the official register of births, deaths, and marriages","note[1]":"register of","signpost[1]":"language style","definition[1]":"the words, style, and grammar used by speakers and writers in a particular situation or in a particular type of writing","example[3]":"letters written in a formal register","note[2]":"formal/informal register","definition[2]":"the range of musical notes that someone’s voice or a musical instrument can reach","example[4]":"the upper register of the cello","note[3]":"the upper/middle/lower register","definition[3]":"a cash register","signpost[2]":"heating control","definition[4]":"a movable metal plate that controls the flow of air in a heating or cooling system","synonym[0]":"vent","signpost[3]":"on a list","definition[5]":"to put someone’s or something’s name on an official list","note[4]":"be registered (as) unemployed/disabled etc British English (=be on an official list of a particular group)","example[5]":"The tanker is registered in Rotterdam.","example[6]":"The baby’s birth was registered this morning.","note[5]":"register a birth/death/marriage","example[7]":"How many students have registered for English classes?","note[6]":"register for","example[8]":"You must bring your insurance card with you when you register with a dentist or doctor.","note[7]":"register with","signpost[4]":"state your opinion","definition[6]":"to officially state your opinion about something so that everyone knows what you think or feel","example[9]":"The delegation registered a formal protest with US embassy officials Wednesday.","type[0]":"intransitive usually in negatives, transitive","signpost[5]":"realize","definition[7]":"if something registers, or if you register it, you realize or notice it, and then remember it","example[10]":"She had told me her name before, but I guess it didn’t register.","example[11]":"I’d been standing there for several minutes before he registered my presence.","definition[8]":"if an instrument registers an amount or if something registers on it, the instrument shows that amount","example[12]":"The thermometer registered 98.6°.","example[13]":"The earthquake registered 7.2 on the Richter scale.","signpost[6]":"show a feeling","definition[9]":"to show or express a feeling","example[14]":"Her face registered shock and anger.","definition[10]":"to send a package, letter etc by registered post","example[15]":"Did you register the parcel?","definition[11]":"an official list containing the names of all the people, organizations etc of a particular type","example[16]":"The Secretary of State maintains a register of those who have been disqualified from being company directors.","definition[12]":"to record a name or details about someone or something in an official list","example[17]":"Transfers of shares will not normally be registered after the close of business on the record date.","example[18]":"people who are registered as unemployed","note[8]":"be registered (as something)","example[19]":"Are you registered for VAT?","note[9]":"register somebody/something for something","example[20]":"A new share issue must be registered with the Securities and Exchange Commission.","note[10]":"register somebody/something with something","definition[13]":"to show or record an amount","example[21]":"Hays Allen registered a 2.7% drop in fee income to £6.8 million for the year to 30 April."}