{"definition[0]":"the regular paid work that you do for an employer","example[0]":"Do you enjoy your job?","example[1]":"It was the first paid job I ever had.","example[2]":"He’s been in the job for six years.","example[3]":"I’m looking for a new job.","example[4]":"Your pension can be affected if you change jobs.","signpost[0]":"duty","definition[1]":"something that you are responsible for doing","example[5]":"Raising kids can be a difficult job.","example[6]":"It’s my job to make sure that the work is finished on time.","example[7]":"All too often councils fall down on the job (=not do what they should) of keeping the streets clean.","example[8]":"The job of the jury is to assess the credibility of the witness.","note[0]":"the job of somebody/something","example[9]":"I was given the job of making sure that everyone had enough to drink.","note[1]":"the job of doing something","explanation[0]":"In written English, people often prefer to use task or duty rather than job, as they sound more formal:","example[10]":"Our first task was to prepare the agenda for the meeting.","signpost[1]":"something you must do","definition[2]":"a particular thing you have to do, considered as work","synonym[0]":"task","example[11]":"My parents were always finding little jobs for me to do.","example[12]":"Filleting fish can be quite a fiddly job.","example[13]":"Tiling the bathroom is going to be a big job.","example[14]":"Sam does odd jobs (=small jobs in the house or garden) for friends and neighbours.","example[15]":"We need to get on with the job of finding someone to replace him.","example[16]":"Whoever did the plastering did a brilliant job.","note[2]":"do a good/great/marvellous etc job","example[17]":"She hates doing the cleaning, but she always makes a good job of it.","note[3]":"make a good/bad etc job of (doing) something","example[18]":"The job of choosing the right computer for you is made easy by this magazine.","definition[3]":"an action done by a computer","example[19]":"a print job","definition[4]":"a crime in which money is stolen from a bank, company etc","example[20]":"a bank job","example[21]":"Police believe it was an inside job (=done by someone who works for the company where the crime happens).","signpost[2]":"type of thing","definition[5]":"used to say that something is of a particular type","example[22]":"Jack’s got a new car – a red two-seater job.","collocation[0]":"have a job","example[23]":"Mark doesn’t have a job right now.","collocation[1]":"apply for a job","example[24]":"I’ve applied for a job at the university.","collocation[2]":"offer somebody a job","example[25]":"Well, Miss Taylor, we’d like to offer you the job.","collocation[3]":"get/find a job","example[26]":"Eventually, Mary got a job as a waitress.","collocation[4]":"land a job","example[27]":"My husband finally landed a job in marketing.","collocation[5]":"take a job","example[28]":"I was so desperate that I took the first job that came along.","collocation[6]":"hold down a job","example[29]":"He had never been able to hold down a job.","collocation[7]":"lose your job","example[30]":"At least there’s no danger of you losing your job.","collocation[8]":"leave/quit your job","example[31]":"Oh, Rick, you didn’t quit your job, did you?","collocation[9]":"be out of a job","example[32]":"If the project fails, we’re all out of a job.","collocation[10]":"temporary/permanent","example[33]":"The job is only temporary, but I’m hoping it will be made permanent.","collocation[11]":"part-time/full-time","example[34]":"He had a part-time job at the pet shop.","collocation[12]":"a steady job","example[35]":"I haven’t had a steady job since last March.","collocation[13]":"a dead-end job","example[36]":"He had a series of dead-end jobs.","form[0]":"job + NOUN","collocation[14]":"job satisfaction","example[37]":"Levels of job satisfaction vary between departments.","collocation[15]":"job security","example[38]":"As an actor, he has very little job security.","collocation[16]":"job losses/cuts","example[39]":"The factory is closing, with 600 job losses.","example[40]":"a full-time job","example[41]":"John got a job in a car factory.","definition[6]":"activities that you are paid for doing – used either when you work for an employer or when you work in your own business","example[42]":"I started work when I was 18.","example[43]":"He graduated from college last year and is still looking for work.","display[0]":"profession","definition[7]":"a job for which you need special education and training","example[44]":"There are now a lot more women in the legal profession.","example[45]":"Many teachers are leaving the profession.","display[1]":"occupation","definition[8]":"a job, or a type of job – often used on official documents","example[46]":"Please give your name, age, and occupation.","example[47]":"a traditionally male occupation","display[2]":"career","definition[9]":"the work you do or plan to do for most of your life","example[48]":"I’m interested in a career in journalism.","definition[10]":"a particular job within an organization","example[49]":"I am writing to apply for the position of technical assistant.","example[50]":"We regret that the position has already been filled.","example[51]":"Please state the position which you are applying for.","display[3]":"post","definition[11]":"a job, especially an important one in a large organization","example[52]":"She has held the post of managing director for two years.","example[53]":"He applied for the post of Senior Manager.","display[4]":"vacancy/opening","definition[12]":"a job that is available for someone to do","example[54]":"The hospital has been unable to fill the vacancy.","example[55]":"There are very few openings in scientific research.","display[5]":"appointment","definition[13]":"an important job which someone is asked to do","example[56]":"He took an appointment as US trade ambassador in Geneva.","display[6]":"posting","definition[14]":"a situation in which someone is sent somewhere to do a job for a period of time by the organization they work for","example[57]":"This was his first posting outside the UK.","example[58]":"an overseas posting","example[59]":"His next posting took him to the Ministry of Defence.","display[7]":"trade","definition[15]":"a job that involves using your hands, and for which you need special training","example[60]":"Most of the men had worked in skilled trades such as carpentry and printing.","display[8]":"employment","definition[16]":"the fact of having a job","example[61]":"The factory will provide employment for local people.","example[62]":"She was offered employment in the sales office.","definition[17]":"in the Old Testament of the Bible, a man who continued to have faith in God even though God destroyed his property and his family","example[63]":"What job do you do?","example[64]":"I’ve applied for a job with the BBC.","example[65]":"1,200 employees could lose their jobs.","example[66]":"tests to measure employees’ levels of job satisfaction (=how satisfied they are with their jobs)","example[67]":"The government would also assist the private sector in job creation for school leavers.","definition[18]":"while doing a particular job","example[68]":"Workers are not allowed to drink on the job.","example[69]":"on-the-job training","definition[19]":"jobs that a powerful person has given to their friends","definition[20]":"a particular project or piece of work being done or planned to be done","example[70]":"The company lost out on several jobs because of the newspaper article.","example[71]":"Some firms charge by the hour, others by the job.","definition[21]":"an operation performed by a computer","example[72]":"You can cancel any print job in the queue."}