{"word[0]":"intend","definition[0]":"to have something in your mind as a plan or purpose","example[0]":"I fully intend (=definitely intend) to return home next year.","example[1]":"I intend to spend the night there.","note[0]":"intend to do something","example[2]":"I didn’t intend her to see the painting until it was finished.","note[1]":"intend somebody/something to do something","example[3]":"I never intended things to turn out the way they did.","example[4]":"It is intended that these meetings will become a regular event.","note[2]":"intend that","example[5]":"We intend looking at the situation again.","note[3]":"intend doing something","explanation[0]":"In everyday English, people usually say plan to do something or plan on doing something, rather than intend to do something or intend doing something:","example[6]":"I plan to spend the night there.","example[7]":"I didn’t plan on things taking so long. OR I didn’t plan for things to take so long.","definition[1]":"to have decided that you want to do something at some time in the future","example[8]":"He intends to appeal against the decision.","display[0]":"be going to do something","definition[2]":"to intend to do something – used when you have made definite arrangements to do it","example[9]":"We’re going to have a meeting about it next week.","example[10]":"I’m going to start karate lessons.","display[1]":"mean to do something","definition[3]":"to intend to do something – used especially when you forget to do something or when something does not happen in the way you intended","example[11]":"I’ve been meaning to call you for ages.","example[12]":"Sorry, I didn’t mean to scare you.","display[2]":"plan to do something","definition[4]":"to intend to do something – used especially when you have thought carefully about how and when you will do it","example[13]":"The airline plans to start flights to Thailand in July.","example[14]":"Jane and Rob are planning to get married next year.","display[3]":"set out to do something","definition[5]":"to intend to do something – used when someone is very determined and knows clearly what they want to do","example[15]":"He set out to make a movie that would challenge people’s prejudices.","display[4]":"aim to do something","definition[6]":"to intend to do something – used when saying what someone hopes to achieve","example[16]":"We aim to finish the work by next week.","example[17]":"The film aims to explain global warming and what people can do about it.","display[5]":"propose to do something","definition[7]":"to intend to do something – used when saying what someone suggests doing","example[18]":"How do you propose to deal with the situation?","display[6]":"have somebody/something in mind","definition[8]":"to imagine that something is the kind of thing that you want to happen, or that someone is the person you want to choose","example[19]":"‘How about going out for a pizza?’ ‘That wasn’t exactly what I had in mind.’","example[20]":"Who do you have in mind?","display[7]":"have no intention of doing something","definition[9]":"to have decided that you will definitely not do something","example[21]":"Tom has no intention of retiring just yet.","example[22]":"The government has no intention of lifting the ban."}