{"word[0]":"hedge","definition[0]":"a row of small bushes or trees growing close together, usually dividing one field or garden from another","definition[1]":"something that protects you against possible problems, especially financial loss","example[0]":"Buying a house will be a hedge against inflation.","note[0]":"hedge against","definition[2]":"to avoid giving a direct answer to a question","example[1]":"You’re hedging again – have you got the money or haven’t you?","example[2]":"‘That depends on my partner, ’ she hedged.","definition[3]":"something that gives you protection against a financial risk, for example FUTURES (=agreements to buy or sell currencies etc on a fixed date in the future at a fixed price) or OPTIONs (=rights to buy or sell currencies etc at a particular price within a particular period of time or on a particular date in the future)","example[3]":"They decided that diesel fuel for the company’s trucks would rise by at least 10 cents a gallon, and have done some forward buying as a hedge.","example[4]":"Investors often buy precious metals as a hedge against inflation.","definition[4]":"if you hedge a financial risk, you protect yourself against it, for example with FUTURES (=agreements to buy or sell currencies etc on a fixed date in the future at a fixed price) or OPTIONs (=rights to buy or sell currencies etc at a particular price within a particular period of time or on a particular date in the future)","example[5]":"I’ve never hedged currencies before. But I could see the dollar was getting lower, and I hedged for the first time, betting that the dollar would rise.","example[6]":"Northwest Airlines saved more than $7 million in fuel costs because it hedged 4.2 million gallons of its fuel purchases for each month by buying futures contracts.","definition[5]":"to reduce your chances of failure or loss by having several choices available to you","example[7]":"Promoters, uncertain whether losing weight was going to stay popular, hedged their bets by advertising that their products could help you add weight or reduce it."}