{"word[0]":"spending","definition[0]":"the amount of money spent, especially by a government or organization","synonym[0]":"expenditure","example[0]":"a plan to increase military spending","note[0]":"government/public/defence etc spending","form[0]":"ADJECTIVES/NOUN + spending","collocation[0]":"public/government/state spending","example[1]":"The government is determined to keep public spending under control.","example[2]":"They called for increased government spending on education.","collocation[1]":"federal spending","example[3]":"He said his goal could be reached by slashing federal spending.","collocation[2]":"consumer spending","example[4]":"There are some signs that consumer spending is beginning to pick up.","collocation[3]":"defence/welfare/education etc spending","example[5]":"Further cuts in defence spending are being considered.","collocation[4]":"campaign spending","example[6]":"Should there be stricter limits on campaign spending?","collocation[5]":"increase/raise spending","example[7]":"He has increased public spending and raised taxes.","collocation[6]":"cut/reduce spending","example[8]":"The alternative is to cut spending.","definition[1]":"the amount of money that is spent, especially by a government or other organization","example[9]":"Company spending on staff benefits has been cut dramatically in recent years.","example[10]":"There has been a huge increase in government spending.","example[11]":"military spending","definition[2]":"the amount of money that a government, organization, or person spends during a particular period of time – used especially in official documents or reports","example[12]":"British defence expenditure was consistently high during this period.","example[13]":"military expenditure","example[14]":"Expenditure on advertising has gone down.","display[0]":"costs","definition[3]":"the money that a person or organization has to spend on heating, rent, wages etc","example[15]":"What are your annual fuel costs?","example[16]":"Falling sales have forced companies to cut costs.","display[1]":"expenses","definition[4]":"the money that you spend on things that you need, for example on food, rent, and travel","example[17]":"Living expenses are much higher in New York.","example[18]":"I kept a record of all my travel expenses so that I could claim them back.","display[2]":"outgoings","definition[5]":"the money that someone has to spend regularly on rent, bills, food etc for their home or business","example[19]":"The outgoings on a house this size are very high.","display[3]":"outlay","definition[6]":"the amount of money that someone must spend when they first start a new business or activity","example[20]":"The initial outlay on machinery was quite high.","display[4]":"overheads","definition[7]":"the money that a business spends regularly on rent, insurance, and other things that are needed to keep the business operating","example[21]":"In London, small businesses often have high overheads.","example[22]":"The slump in high street spending could reduce imports.","example[23]":"a rise in consumer spending","example[24]":"Spending cuts are being imposed to keep the currency stable.","example[25]":"The Dallas-based firm says it plans capital spending of $650m.","example[26]":"the need to control public spending (=money spent by the government)","example[27]":"Spending on goods and services is down.","note[1]":"spending on"}