{"word[0]":"emotional","definition[0]":"relating to your feelings or how you control them","example[0]":"She provided emotional support at a very distressing time for me.","example[1]":"Ann suffered from depression and a number of other emotional problems.","example[2]":"the physical and emotional state of the patient","definition[1]":"making people have strong feelings","example[3]":"Abortion is a very emotional issue.","example[4]":"The funeral was a very emotional experience for all of us.","definition[2]":"having strong feelings and showing them to other people, especially by crying","example[5]":"He became very emotional when we had to leave.","note[0]":"get/become emotional","definition[3]":"influenced by what you feel, rather than what you know","example[6]":"an emotional response to the problem","heading[0]":"causing strong feelings","definition[4]":"causing people to have strong feelings – used especially about experiences, speeches, or subjects that people have strong feelings about","example[7]":"Returning home after a year in hospital was an emotional experience for Katy.","example[8]":"He gave an emotional speech at the funeral.","example[9]":"It was a very emotional moment.","example[10]":"Abortion rights is a highly emotional issue.","display[0]":"emotive","definition[5]":"used about issues or language that make people have strong feelings","example[11]":"Fox hunting is a very emotive issue in Britain.","example[12]":"‘Indoctrination’ is rather an emotive word.","display[1]":"moving","definition[6]":"making you feel strong feelings of sadness or sympathy","example[13]":"Kelly’s book about her illness is deeply moving.","example[14]":"a moving film","display[2]":"touching","definition[7]":"making you feel slightly emotional – used especially when someone does something that shows how much they care about another person","example[15]":"Your loyalty is very touching.","example[16]":"My son phoned me to wish me good luck, which was a touching gesture.","display[3]":"poignant","definition[8]":"making you feel strong feelings of sadness or pity, especially when you remember something in the past","example[17]":"Her youthful expression is a poignant reminder of the passing of time.","display[4]":"sentimental","definition[9]":"dealing with emotions such as love and sadness in a way that seems silly","example[18]":"He found the film too sentimental.","example[19]":"a schmaltzy comedy"}