{"comparative[0]":"higher","superlative[0]":"highest","signpost[0]":"from bottom to top","definition[0]":"measuring a long distance from the bottom to the top","example[0]":"This is the highest mountain in Japan.","example[1]":"The camp was surrounded by a high fence.","example[2]":"How high is the Eiffel Tower?","example[3]":"waves up to 40 metres high","note[0]":"100 feet/30 metres etc high","example[4]":"a ten-foot high statue","example[5]":"The grass was knee-high.","note[1]":"chest/waist/knee etc high","signpost[1]":"above ground","definition[1]":"in a position that is a long way, or a longer way than usual, above the ground, floor etc","example[6]":"The apartment had spacious rooms with high ceilings.","example[7]":"a high shelf","example[8]":"high altitudes","example[9]":"The sun was already high in the sky.","example[10]":"High up among the clouds, we saw the summit of Everest.","signpost[2]":"large number","definition[2]":"a high amount, number, or level is large, or larger than usual","example[11]":"Temperatures remained high for the rest of the week.","example[12]":"Lower-paid workers often cannot afford the high cost of living in the capital.","example[13]":"The train was approaching at high speed.","example[14]":"High levels of car use mean our streets are more congested than ever.","note[2]":"high level/degree/rate etc (of something)","example[15]":"high crime rates","example[16]":"high interest rates","example[17]":"If you want better public services, you’ll have to pay higher taxes – it’s as simple as that.","note[3]":"high price/charge/tax etc","example[18]":"A high proportion of women with children under five work full-time.","note[4]":"high proportion/percentage etc (of something)","signpost[3]":"good standard","definition[3]":"a high standard, quality etc is very good","example[19]":"a high-performance computer","example[20]":"Our aim is to provide the highest quality service to all our customers.","example[21]":"a range of high-quality goods at low prices","note[5]":"high quality","example[22]":"The general standard of the entries was very high.","note[6]":"high standard","example[23]":"Our guests expect us to maintain high standards.","signpost[4]":"containing a lot","definition[4]":"containing a lot of a particular substance or quality","example[24]":"Choose foods that are high in fiber and low in calories.","note[7]":"high in something","example[25]":"Red meat tends to have a high fat content.","note[8]":"a high sugar/salt/fibre etc content","signpost[5]":"rank/position","definition[5]":"having an important position in society or within an organization","note[9]":"high society (=rich people of the highest social class)","example[26]":"a high rank in the US Navy","example[27]":"the City’s highest honour","example[28]":"someone high up in the CIA","note[10]":"high up","example[29]":"Both of them held high office in the Anglican Church.","note[11]":"high office","signpost[6]":"advanced","definition[6]":"advanced and often complicated","note[12]":"the higher animals/mammals/organisms etc (=animals etc that are more intelligent or advanced than others)","example[30]":"We can offer all the benefits of the latest high technology.","example[31]":"the world of high finance","definition[7]":"near or above the top of the range of sounds that humans can hear","example[32]":"I always had difficulty reaching the high notes  (=when singing).","example[33]":"a high squeaky voice","signpost[7]":"happy/excited","definition[8]":"happy and excited","example[34]":"I was still high from the applause.","definition[9]":"behaving in a strange and excited way as the result of taking drugs","note[13]":"get high (=take a drug to make yourself high)","example[35]":"Steve was as high as a kite (=strongly affected by drugs or alcohol).","example[36]":"Most people there were high on cocaine.","note[14]":"high on","signpost[8]":"sea/river","definition[10]":"having risen to a high level","example[37]":"The river is at its highest in spring.","definition[11]":"the middle or the most important part of a particular period of time","note[15]":"high noon (=12 o'clock in the middle of the day)","example[38]":"high summer","definition[12]":"cheese, meat etc that is high is not fresh and has a strong smell or taste","definition[13]":"a very formal style of language, especially used in literature","definition[14]":"a form of a language used for formal purposes that is often different from the ordinary form used by most people","heading[0]":"buildings/mountains etc","definition[15]":"measuring a long distance from the bottom to the top – used about mountains, walls, and buildings","example[39]":"the highest mountain in the world","example[40]":"The castle was surrounded by high walls.","example[41]":"a high cliff","example[42]":"The council told the architects the tower was too high.","display[0]":"tall","definition[16]":"high – used about people, trees, plants, and buildings. Tall is used especially about things that are high and narrow","example[43]":"tall marble columns","example[44]":"A cat was hiding in the tall grass.","example[45]":"a tall modern building","display[1]":"majestic","definition[17]":"very impressive because of being very big and tall – used about mountains, buildings, trees, and animals","example[46]":"the majestic mountains of the Himalayas","example[47]":"The abbey is noted for its majestic arches, fine doorways and elegant windows.","example[48]":"The cathedral looked majestic in the evening light.","display[2]":"soaring","definition[18]":"used about a building or mountain that looks extremely tall and impressive","example[49]":"a soaring skyscraper","example[50]":"the soaring towers of the palace","display[3]":"towering","definition[19]":"extremely high, in a way that seems impressive but also often rather frightening","example[51]":"The sky was shut out by the towering walls of the prison.","example[52]":"towering trees","display[4]":"lofty","definition[20]":"very high and impressive – used in literature","example[53]":"the lofty peaks in the far distance","display[5]":"high-rise","definition[21]":"a high-rise building is a tall modern building with a lot of floors containing apartments or offices","example[54]":"a high-rise apartment block","example[55]":"He works in a high-rise office in New York.","heading[1]":"sounds","display[6]":"high-pitched","definition[22]":"higher than most sounds or voices","example[56]":"He has a rather high-pitched voice.","example[57]":"Bats make high-pitched squeaks.","example[58]":"the high-pitched whine of a dentist's drill","display[7]":"shrill","definition[23]":"high and unpleasant","example[59]":"Her voice became more shrill.","example[60]":"The bird has rather a shrill cry.","display[8]":"piercing","definition[24]":"extremely high and loud, in a way that is unpleasant","example[61]":"a piercing scream","example[62]":"Suddenly I heard a piercing whistle.","display[9]":"squeaky","definition[25]":"making very high noises that are not loud","example[63]":"a squeaky gate","example[64]":"squeaky floorboards","example[65]":"a squeaky little voice","signpost[9]":"above the ground","definition[26]":"at or to a level high above the ground, the floor etc","example[66]":"He kicked the ball high into the air, over the heads of the crowd.","example[67]":"Hotel Miramar is situated high above the bay.","note[16]":"high above/into etc","example[68]":"A ski lift whisks you high into the mountains.","signpost[10]":"value/cost/amount","definition[27]":"at or to a high value, cost, amount etc","example[69]":"If prices shoot up any higher, no one will be able to afford to live in the area.","example[70]":"Tom scored higher than anyone else in the class.","definition[28]":"with a high sound","example[71]":"A strange cry rang high into the night.","signpost[11]":"achievement","definition[29]":"at or to a high rank or level of achievement, especially within a company","example[72]":"It seems that the higher you rise, the less time you have to actually do your job.","example[73]":"My parents always encouraged me to aim high.","signpost[12]":"number/amount","definition[30]":"the highest price, number, temperature etc that has ever been recorded, or that has been recorded within a particular period of time","example[74]":"Highs of 40°C were recorded in the region last summer.","example[75]":"The price of oil reached a new high this week.","note[17]":"a new/record/ten-year etc high","signpost[13]":"excitement","definition[31]":"a feeling of great happiness or excitement","example[76]":"They’re bound to be on a high after such an incredible victory.","example[77]":"the emotional highs and lows of a new romance","definition[32]":"a feeling of pleasure or excitement produced by some drugs","definition[33]":"an area of high pressure that affects the weather","definition[34]":"a short form of high school, used in the name of a school","example[78]":"Benjamin Franklin High","definition[35]":"of a particular height","example[79]":"The wall was about chest-high  (=as high as your chest).","example[80]":"a 7,000 metre-high mountain","definition[36]":"the largest amount, figure, value etc in a particular period of time","example[81]":"Advancing stocks again led as 162 issues reached new highs and only 14 dropped to new lows.","definition[37]":"a high amount, number, or level is more than normal, more than average, or more than it was before","example[82]":"Property prices remain high.","example[83]":"A high proportion of female directors are in the 35-to-55 age range.","example[84]":"Sales to rental car companies made up a high percentage of the vehicles sold by General Motors.","example[85]":"There is still a high risk that the US currency will fall back during the year.","definition[38]":"a high position in an organization is an important one","example[86]":"He rose swiftly to high office.","definition[39]":"at or to a high amount, number, level etc","example[87]":"Prices could go even higher early this year.","example[88]":"Western-educated technocrats high up in powerful bureaucracies"}