{"word[0]":"consideration","definition[0]":"careful thought and attention, especially before making an official or important decision","example[0]":"proposals put forward for consideration","example[1]":"After due consideration, I have decided to tender my resignation.","note[0]":"due/serious/proper etc consideration","example[2]":"We would have to give serious consideration to banning it altogether.","note[1]":"give something careful/full etc consideration","example[3]":"These plans definitely merit further consideration.","note[2]":"deserve/merit consideration","example[4]":"There are several amendments under consideration.","note[3]":"under consideration","definition[1]":"a fact that you think about when you are making a decision","example[5]":"Political rather than economic considerations influenced the location of the new factory.","definition[2]":"the quality of thinking about other people’s feelings and being careful not to upset them","example[6]":"Show some consideration!","example[7]":"The murdered woman’s name has not been released, out of consideration for her parents.","note[4]":"consideration for","example[8]":"They’ve got no consideration for others.","definition[3]":"a payment for something, especially a service","example[9]":"I might be able to help you, for a small consideration.","example[10]":"a payment in consideration of (=as payment for) their services","collocation[0]":"give something consideration","example[11]":"It’s an interesting idea and I’ll give it some consideration.","example[12]":"He made a number of proposals that deserve consideration.","collocation[1]":"need/require consideration","example[13]":"Money is usually the first issue that needs consideration.","collocation[2]":"receive consideration","example[14]":"All applications for a university place receive consideration.","collocation[3]":"careful consideration","example[15]":"After careful consideration I have decided not to accept your offer.","collocation[4]":"serious consideration","example[16]":"At the time, I didn’t give his suggestion serious consideration.","collocation[5]":"further consideration","example[17]":"The meeting was adjourned to allow time for further consideration.","collocation[6]":"special consideration","example[18]":"Two other major difficulties need special consideration.","collocation[7]":"detailed consideration","example[19]":"Each of these matters requires detailed consideration.","collocation[8]":"due/proper consideration","example[20]":"A lot of building took place without due consideration for the effect it would have on the area.","collocation[9]":"full consideration","example[21]":"Our decision must be based on full consideration of the long-term consequences.","collocation[10]":"urgent consideration","example[22]":"I would be grateful if you would give this matter urgent consideration.","definition[4]":"something of value given by one person or group signing a contract in exchange for something given by the other","example[23]":"The rent-free period is consideration for the tenant’s building work.","example[24]":"The seller transfers the property in goods to the buyer for a money consideration, called the price.","example[25]":"The guarantee was void as having been made for an illegal consideration (=payment that was against the law)."}