{"word[0]":"gross","definition[0]":"a gross sum of money is the total amount before any tax or costs have been taken away","example[0]":"a gross profit of $5 million","example[1]":"a family with gross earnings of just £75 per week","note[0]":"gross income/salary/pay etc","definition[1]":"a gross weight is the total weight of something, including its wrapping","definition[2]":"clearly wrong and unacceptable","note[1]":"gross indecency (=the crime of doing something that is sexually offensive)","example[2]":"soldiers accused of gross violations of human rights","note[2]":"gross negligence/misconduct etc","example[3]":"The company described reports of environmental disaster as gross exaggeration.","signpost[0]":"nasty","definition[3]":"very unpleasant to look at or think about","example[4]":"Ooh, gross! I hate spinach!","signpost[1]":"fat","definition[4]":"extremely fat and unattractive","definition[5]":"to gain an amount as a total profit, or earn it as a total amount, before tax has been taken away","example[5]":"The movie has already grossed over $10 million.","definition[6]":"a quantity of 144 things","example[6]":"two gross of candles","note[3]":"gross of","definition[7]":"a gross amount of money is the total amount before any costs or taxes have been taken away","example[7]":"Mortgage payments often account for up to 30% of people’s gross earnings.","example[8]":"Last year, their travel and tourism business generated upwards of $400 million in gross revenues.","definition[8]":"a gross weight is the total weight of something, including the container or wrapping and the contents","example[9]":"Coaches with a gross weight of less than 3.5 tons must be fitted with seat belts that comply with EU regulations.","definition[9]":"gross behaviour is seriously wrong and unacceptable","example[10]":"The inquiry uncovered gross mismanagement at the Department.","definition[10]":"the amount paid by people to go and see a film in a particular period of time","synonym[0]":"GROSS RECEIPTS","example[11]":"During its first weekend, the film had a box office gross of $95 million.","definition[11]":"the amount earned by a person or a business before costs and taxes are taken away","example[12]":"While album sales once accounted for only a tiny share of his revenue, they now account for the majority of his annual gross of about $100,000.","example[13]":"a cardboard box containing two gross of packets of Maltesers","definition[12]":"if a film grosses a particular amount, people pay that total amount of money to see it","example[14]":"The film grossed $18.5 million in its opening weekend.","definition[13]":"if a person or business grosses a particular amount, they earn that total amount of money before costs and tax have been taken away","example[15]":"He has never grossed over $50,000 dollars a year.","definition[14]":"if a person, business, or investment earns a particular amount gross, they earn that amount before tax has been taken away","example[16]":"Leading shares now earn just 6% gross and pay dividends of 4% after tax."}