{"word[0]":"countryside","definition[0]":"land that is outside cities and towns","synonym[0]":"the country","example[0]":"The house had lovely views over open countryside.","example[1]":"people who live in the countryside","note[0]":"in the countryside","collocation[0]":"beautiful/stunning","example[2]":"The countryside between the Alpine villages is stunning.","collocation[1]":"open countryside","example[3]":"The farmhouse has views over open countryside.","collocation[2]":"the surrounding countryside","example[4]":"Both the town and the surrounding countryside are worth exploring.","collocation[3]":"rolling countryside","example[5]":"a valley surrounded by rolling countryside","collocation[4]":"green countryside","example[6]":"Our train was passing through rolling green countryside.","collocation[5]":"unspoilt countryside","example[7]":"This area is ideal for a weekend break in unspoilt countryside.","collocation[6]":"rugged countryside","example[8]":"Uzbekistan is an area known for its  rugged countryside and tough people.","collocation[7]":"protect/conserve the countryside","example[9]":"How can we protect the countryside for future generations?","collocation[8]":"spoil/ruin the countryside","example[10]":"Too many tourists can spoil the countryside.","definition[1]":"an area away from towns and cities, where there are fields, forests etc – used especially when talking about the natural beauty of this kind of area","example[11]":"The walk takes you through some beautiful countryside.","example[12]":"The countryside changes in winter.","definition[2]":"the area away from towns and cities, where there are fields, forests etc","example[13]":"Tired of city life, they moved to the country.","example[14]":"I've always wanted to live in the country.","display[0]":"landscape","definition[3]":"a large area of countryside that you see from somewhere","example[15]":"The house looks out over a peaceful rural landscape.","example[16]":"Adams is famous for his photographs of the American landscape.","display[1]":"scenery","definition[4]":"the natural features of part of a country, such as mountains, forests etc, especially when these are attractive","example[17]":"New Zealand has some spectacular scenery.","display[2]":"wilderness","definition[5]":"a large area of land that has never been developed or farmed","example[18]":"Yukon is a vast wilderness of mountains, lakes, and forests.","display[3]":"the bush","definition[6]":"wild country that has not been cleared, especially in Australia or Africa","example[19]":"The camp is popular with tourists wishing to experience the African bush.","display[4]":"rural","definition[7]":"relating to the country","example[20]":"People are moving away from rural areas.","example[21]":"rural communities"}