{"word[0]":"reserve","definition[0]":"to arrange for a place in a hotel, restaurant, plane etc to be kept for you to use at a particular time in the future","example[0]":"Do you have to reserve tickets in advance?","example[1]":"I’d like to reserve a table for two.","note[0]":"reserve something for somebody/something","definition[1]":"to keep something so that it can be used by a particular person or for a particular purpose","synonym[0]":"set aside","example[2]":"reserved parking spaces","example[3]":"A separate room is reserved for smokers.","definition[2]":"to keep part of something for use at a later time during a process – used especially when describing how to cook something","synonym[1]":"keep","example[4]":"Reserve a little of the mixture to sprinkle over the top of the pie.","definition[3]":"to use or show something only in one particular situation","example[5]":"She spoke in a tone of voice she usually reserved for dealing with officials.","signpost[0]":"supply","definition[4]":"a supply of something kept to be used if it is needed","example[6]":"$10 million in cash reserves","example[7]":"oil reserves","example[8]":"Somehow Debbie maintained an inner reserve of strength.","note[1]":"reserve of","signpost[1]":"personal quality","definition[5]":"a quality in someone’s character that makes them not like expressing their emotions or talking about their problems","example[9]":"She overcame her own natural reserve.","signpost[2]":"player","definition[6]":"an extra player who plays in a team if one of the other players is injured or ill","signpost[3]":"for animals/plants","definition[7]":"an area of land where wild animals and plants are protected","example[10]":"a wildlife reserve","signpost[4]":"for native americans","definition[8]":"a reservation","signpost[5]":"price","definition[9]":"a price below which something will not be sold, especially in an auction","definition[10]":"to arrange for a place on a plane, in a hotel, in a restaurant etc to be kept for a customer who will arrive later","example[11]":"He reserved two rooms at the hotel.","definition[11]":"to keep or restrict something so that it can be used only by a particular person or for a particular purpose","example[12]":"Of the total capital, 19% is expected to be reserved for strategic investors.","example[13]":"The local road was to be reserved for traffic which had business in the locality.","definition[12]":"to state in an agreement, contract etc that you want the opportunity to do something or change something","example[14]":"The company reserved the right to invest directly in some of the movies.","definition[13]":"a statement put onto printed, recorded, or electronic material to show it is illegal to copy it without special permission","definition[14]":"to delay a decision or opinion about something until a later date","example[15]":"The five-judge panel will reserve judgement until they see further evidence.","definition[15]":"a minimum price that a seller will accept, usually in an auction","synonym[2]":"reserve price","example[16]":"The painting failed to reach its reserve (=was not sold because the minimum price was not offered)."}