{"word[0]":"ease","definition[0]":"the ability to feel relaxed or behave in a natural relaxed way","example[0]":"He had a natural ease which made him very popular.","collocation[0]":"with great/considerable ease","example[1]":"The car handles these mountain roads with great ease.","collocation[1]":"with apparent ease","example[2]":"I was amazed by the apparent ease with which she got through the security system.","collocation[2]":"with comparative/relative ease","example[3]":"Most modern laptops can store large amounts of data with comparative ease.","collocation[3]":"with consummate ease","example[4]":"It was a beautiful goal, scored with consummate ease.","definition[1]":"if something unpleasant eases, or if you ease it, it gradually improves or becomes less","example[5]":"measures to ease congestion in the city","example[6]":"Her breathing had eased.","example[7]":"He’ll give you something to ease the pain.","note[0]":"ease the pain/stress/tension","example[8]":"This should ease the burden on busy teachers.","note[1]":"ease the pressure/burden","signpost[0]":"make easier","definition[2]":"to make a process happen more easily","example[9]":"The agreement will ease the way for other countries to join the EU.","definition[3]":"to move yourself or something slowly and carefully into another place or position","example[10]":"She eased her shoes off.","example[11]":"Jean eased back on the pillows and relaxed.","example[12]":"He eased himself into a chair.","note[2]":"ease yourself into/through etc something","example[13]":"He eased his way through the crowd.","note[3]":"ease your way past/through etc something","definition[4]":"if limits, rules, restrictions etc are eased, or someone eases them, they become less strict","example[14]":"India is easing rules for joint ventures with foreign concerns.","definition[5]":"if interest rates ease, or if a government or central bank eases them, they fall slightly","example[15]":"The central bank is prepared to ease interest rates further.","definition[6]":"if prices on a financial market ease, they fall slightly","example[16]":"Stock prices eased in a slow trading session.","example[17]":"Shares in Tokyo Gas eased 2 to 565, and Marubeni lost 5 to 660."}