{"word[0]":"serve","signpost[0]":"food/drink","definition[0]":"to give someone food or drink, especially as part of a meal or in a restaurant, bar etc","example[0]":"The waiter was serving another table.","example[1]":"Sprinkle with cheese and serve immediately.","example[2]":"Breakfast is served until 9 am.","note[0]":"serve breakfast/lunch/dinner","example[3]":"Teacakes should be served hot with butter.","note[1]":"serve something hot/cold etc","example[4]":"Serve the soup with crusty bread.","note[2]":"serve something with something","example[5]":"Meals can be served to you in your room.","note[3]":"serve something to somebody","signpost[1]":"shop","definition[1]":"to help the customers in a shop, especially by bringing them the things that they want","example[6]":"There was only one girl serving customers.","signpost[2]":"be useful/helpful","definition[2]":"to be useful or helpful for a particular purpose or reason","example[7]":"research projects that serve the needs of industry","note[4]":"serve the needs/interests of somebody/something","example[8]":"The sofa had to serve as a bed.","note[5]":"serve as","example[9]":"The reforms served as a model for the rest of the Communist world.","example[10]":"A large cardboard box will serve the purpose.","example[11]":"Her talent for organization should serve her well.","signpost[3]":"do useful work","definition[3]":"to spend a period of time doing useful work or official duties for an organization, country, important person etc","example[12]":"the women who served their country in the war","example[13]":"He returned to Greece to serve in the army.","note[6]":"serve in the army/air force/navy etc","example[14]":"Lord Herbert served as ambassador to France.","example[15]":"Ann serves on various local committees.","note[7]":"serve on","signpost[4]":"have an effect","definition[4]":"to have a particular effect or result","example[16]":"Her death should serve as a warning to other young people.","example[17]":"A single example serves to illustrate what I mean.","note[8]":"serve to do something","signpost[5]":"provide something","definition[5]":"to provide an area or a group of people with something that is necessary or useful","example[18]":"Paris is served by two airports.","explanation[0]":"Serve is usually passive in this meaning","definition[6]":"to spend a particular period of time in prison","example[19]":"He served an 18-month sentence for theft.","example[20]":"Did you know that Les is serving time  (=is in prison)?","definition[7]":"to start playing in a game such as tennis or volleyball by throwing the ball up in the air and hitting it over the net","definition[8]":"the action in a game such as tennis or volleyball when you throw the ball in the air and hit it over the net","definition[9]":"to supply customers with a particular product or service or with something they need","example[21]":"The firm plans to open a London office toserve clients with investments and businesses in Europe.","example[22]":"JAL Group airlines serve 208 airports in 35 countries and territories.","definition[10]":"to give the customers in a shop, restaurant etc the things they want to buy","example[23]":"Free wine will be served on flights.","definition[11]":"to spend a period of time doing a particular job, often an important one that helps the organization","example[24]":"If elected, she will serve a four-year term.","example[25]":"He had toserve an apprenticeship (=a period of training) with an accounting firm.","example[26]":"He has proved to be valuable in several of the companies he has served as a board member.","definition[12]":"to officially send or give someone a written order to appear in a court of law","example[27]":"The manufacturing company served a writ on him after he failed to register the patent.","note[9]":"serve a summons/writ/notice etc on"}