{"word[0]":"keep up","definition[0]":"to continue doing something","note[0]":"keep up the good work! (=continue to work hard and well)","example[0]":"I don’t think I can keep this up any longer.","definition[1]":"if a situation keeps up, it continues without stopping or changing","synonym[0]":"continue","example[1]":"How long can the economic boom keep up?","definition[2]":"to go as quickly as someone else","example[2]":"I had to walk fast to keep up with him.","definition[3]":"to manage to do as much or as well as other people","opposite[0]":"fall behind","note[1]":"keep up with the Joneses (=try to have the same new impressive possessions that other people have)","example[3]":"Jack’s having trouble keeping up with the rest of the class.","definition[4]":"to continue to read and learn about a particular subject, so that you always know about the most recent facts, products etc","example[4]":"Employees need to keep up with the latest technical developments.","definition[5]":"to make something continue at its present level or amount, instead of letting it decrease","example[5]":"NATO kept up the pressure on the Serbs to get out of Kosovo.","definition[6]":"if one process keeps up with another, it increases at the same speed and by the same amount","example[6]":"Food production is not keeping up with population growth.","definition[7]":"to continue to practise a skill so that you do not lose it","example[7]":"I used to speak French, but I haven’t kept it up.","definition[8]":"to prevent someone from going to bed","example[8]":"I hope I’m not keeping you up.","definition[9]":"to stay happy, strong, confident etc by making an effort","example[9]":"We sang as we marched, to keep our spirits up.","definition[10]":"to pretend that everything in your life is normal and happy even though you are in trouble, especially financial trouble","definition[11]":"to prevent something from falling to a lower level","example[10]":"The high demand for cereals was responsible for keeping agricultural wages up with prices.","definition[12]":"to continue to make payments such as rent etc on time","example[11]":"Your home is at risk if you do notkeep up repayments on a mortgage.","definition[13]":"to achieve the same rate of progress as other people, organizations etc, so that they do not have an advantage over you","example[12]":"Some firms have used technical agreements with foreign enterprises to keep up technologically.","example[13]":"We have to move fast to keep up with our competitors."}