{"word[0]":"luck","signpost[0]":"success","definition[0]":"good things that happen to you by chance","example[0]":"You’re not having much luck today, are you?","example[1]":"He’s had good luck with his roses this year.","example[2]":"It was an incredible piece of luck.","example[3]":"It was only by luck that they managed to avoid hitting the rocks near the shore.","note[0]":"by luck","signpost[1]":"chance","definition[1]":"when good or bad things happen to people by chance","example[4]":"Roulette is a game of luck.","collocation[0]":"good luck","example[5]":"These birds are said to bring good luck.","collocation[1]":"bad luck","example[6]":"His bad luck continued.","collocation[2]":"sheer/pure luck","example[7]":"She managed to catch hold of the rope by sheer luck.","collocation[3]":"dumb luck","example[8]":"Sometimes I think my success was really just dumb luck.","collocation[4]":"beginner’s luck","example[9]":"He’d hit the center of the target. ‘Beginner’s luck, I guess, ’ he said.","collocation[5]":"have good/bad luck","example[10]":"I’ve had a bit of bad luck.","collocation[6]":"have more/less luck","example[11]":"I hope you have more luck in the next competition.","collocation[7]":"have no luck","example[12]":"I’d been looking for a job for weeks, but had had no luck.","collocation[8]":"can’t believe your luck","example[13]":"I couldn’t believe my luck as my number was called out!","collocation[9]":"have the (good/bad) luck to do something","example[14]":"He had the good luck to meet a man who could help him.","collocation[10]":"somebody’s luck holds","example[15]":"Our luck held, and the weather remained fine.","collocation[11]":"somebody’s luck runs out","example[16]":"Finally my luck ran out and they caught me.","collocation[12]":"bring somebody (good/bad) luck","example[17]":"He always carried the stone in his pocket; he reckoned it brought him luck.","collocation[13]":"a piece/stroke of luck","example[18]":"What a piece of luck that he arrived when he did!","collocation[14]":"a run of good/bad luck","example[19]":"The team has had a run of bad luck lately, losing their last five games.","collocation[15]":"a matter of luck","example[20]":"Winning is a matter of luck.","collocation[16]":"an element of luck","example[21]":"There is always an element of luck when hiring someone for a job.","example[22]":"The game involves an element of luck as well as skill.","definition[2]":"the way that some things happen without being planned or caused by people","example[23]":"I met her by chance on a plane to Tokyo.","example[24]":"Like all top athletes, he leaves nothing to chance, and trains harder than anybody.","display[0]":"fortune","definition[3]":"luck and the effect it has on your life","example[25]":"I had the good fortune to work with some great people.","example[26]":"The tour was dogged by ill fortune  (=it had a lot of bad luck) from the start.","example[27]":"Fortune has shone on the team so far this season  (=they have been lucky).","display[1]":"fate","definition[4]":"a power that some people believe controls what happens to people and which cannot be changed or stopped","example[28]":"Fate dealt him a cruel blow with the death of his wife at the age of 32.","example[29]":"It must have been fate that brought them together, and fate that tore them apart.","example[30]":"We can’t just leave it to fate.","display[2]":"providence","definition[5]":"a power which some people believe controls what happens in our lives and protects us","example[31]":"Do you believe in divine providence  (=God’s power to make things happen)?","example[32]":"Her life was mapped out for her by providence.","display[3]":"fluke","definition[6]":"something good that happens because of luck","example[33]":"Their second goal was a fluke.","example[34]":"They won by a fluke."}