{"word[0]":"loss","definition[0]":"the fact of no longer having something, or of having less of it than you used to have, or the process by which this happens","example[0]":"The company is closing down two of its factories, leading to 430 job losses.","example[1]":"Weight loss should be gradual.","example[2]":"a type of hearing loss that affects language development","example[3]":"The court awarded Ms Dixon £7,000 for damages and loss of earnings.","note[0]":"loss of","example[4]":"a disease which causes fever and a loss of appetite","example[5]":"This did not explain his apparent loss of interest in his wife.","example[6]":"her loss of confidence in herself","example[7]":"a certain feeling of loss of control","example[8]":"a temporary loss of memory","example[9]":"The animal was weak through loss of blood.","definition[1]":"if a business makes a loss, it spends more than it earns","example[10]":"The company made a loss of $250,000 last year.","example[11]":"The magazine’s losses totaled almost $5 million.","example[12]":"profit and loss","example[13]":"a loss-making rural railway","example[14]":"Two of the mines are running at a loss.","note[1]":"run/operate etc at a loss","definition[2]":"the death of someone","example[15]":"I’m sorry to hear of your family’s sad loss (=the death of someone you love).","example[16]":"US forces withdrew after suffering heavy losses (=many deaths).","example[17]":"The war has led to a tragic loss of life.","example[18]":"She must be feeling very lonely after the loss of her husband.","definition[3]":"a feeling of being sad or lonely because someone or something is not there anymore","example[19]":"the deep sense of loss I felt after my divorce","definition[4]":"a disadvantage caused by someone or something leaving or being removed","example[20]":"We see your going as a great loss to the company.","note[2]":"loss to","definition[5]":"the fact of no longer having something that you used to have, or having less of it","example[21]":"loss of earnings through illness","definition[6]":"when a business spends more money than it receives in a particular period of time, or loses money in some other way","example[22]":"The toy company blamed the losses on poor retail sales.","example[23]":"The companymade a loss of £670,000 last year.","example[24]":"British banks hit by heavy losses on bad loans","example[25]":"There’s no reason for us to operate at a loss.","definition[7]":"to lose money and make a record of this in the accounts","example[26]":"The unit posted losses for the past two years, hurt by the economic slump.","definition[8]":"an event that causes a person or organization to make a claim on an insurance contract","definition[9]":"when a person or organization suffers or loses money because of the mistakes or NEGLIGENCE of another"}