{"word[0]":"gamble","definition[0]":"to risk money or possessions on the result of something such as a card game or a race, when you do not know for certain what the result will be","example[0]":"Their religion forbids them to drink or gamble.","example[1]":"Jack loves gambling on the horses.","note[0]":"gamble on","definition[1]":"to do something that involves a lot of risk, and that will not succeed unless things happen the way you would like them to","example[2]":"They’re gambling on Johnson being fit for Saturday’s game.","example[3]":"Potter gambled everything on his new play being a hit.","note[1]":"gamble something on something","example[4]":"She was gambling that he wouldn’t read it too carefully.","note[2]":"gamble that","example[5]":"We can’t relax our safety standards – we’d be gambling with people’s lives.","note[3]":"gamble with","definition[2]":"to try to win money, for example by playing cards or guessing which horse will win a race","example[6]":"Eddie loved to gamble, and would spend most evenings at the roulette table.","example[7]":"A growing number of people are gambling online.","display[0]":"bet/have a bet","definition[3]":"to try to win money by guessing who will win a race or game","example[8]":"He liked to smoke, drink, and bet on horses.","example[9]":"Jerry bet $1000 on the game.","example[10]":"We had a bet on the Irish team to win.","display[1]":"put £10/$20 etc on something","definition[4]":"to gamble £10, $20 etc on the horse or team that you think will win a race or competition","example[11]":"I put $100 on the Cowboys to win.","display[2]":"have a flutter","definition[5]":"to gamble a small amount of money, especially on the result of a horse race – used especially when someone does not gamble very often","example[12]":"I’m not a heavy gambler, but I like to have a flutter from time to time.","example[13]":"I had a little flutter on the Grand National and won £5.","display[3]":"play for money","definition[6]":"to gamble money on the result of a game which you are playing","example[14]":"‘Are we playing for money here, gentlemen?’ he said as he approached the pool table.","example[15]":"You’re allowed to play cards in the bar, but not for money.","definition[7]":"to gamble money on a particular horse, team etc that you think will win a race or competition","example[16]":"When I back a horse, it always seems to finish second.","definition[8]":"an action or plan that involves a risk but that you hope will succeed","example[17]":"It was a big gamble for her to leave the band and go solo.","example[18]":"Ellen had to admit the gamble had paid off (=succeeded).","example[19]":"In a depressed market, we cannot afford to take a gamble on a new product.","example[20]":"The gamble on the harvest had paid off  (=succeeded).","collocation[0]":"take a gamble","example[21]":"The publishers took a gamble on an unknown author, and the books have sold well.","collocation[1]":"a gamble pays off","example[22]":"She gave up a career in law to become an actor, but the gamble has paid off.","collocation[2]":"a big gamble","example[23]":"It's a big gamble for any presenter to leave such a successful show.","collocation[3]":"a huge gamble","example[24]":"Giving him the job seemed like a huge gamble at the time.","collocation[4]":"a calculated gamble","example[25]":"He made a calculated gamble that an early election would return his party to power.","collocation[5]":"a desperate gamble","example[26]":"The parents took a desperate gamble by throwing their baby out of the burning building.","collocation[6]":"a political gamble","example[27]":"His determination to go ahead with the plan, despite the unrest, was a huge political gamble.","collocation[7]":"be a bit of a gamble","example[28]":"It was a bit of a gamble putting him on the field, but he played well.","collocation[8]":"be something of a gamble","example[29]":"A few years ago, launching a weekly magazine for men would have been something of a gamble.","definition[9]":"to risk money on the stockmarket or a new business activity in the hope of making a profit","example[30]":"The company is gambling on a new clothing line expanding its business.","example[31]":"The Hollywood studio gambled £20 million on making the most expensive black-and-white film ever.","example[32]":"The two men gambled with £6,000 of their savings to establish a research company.","definition[10]":"to risk money on the result of something uncertain such as a card game or race","example[33]":"While on Madeira, he gambled at the island’s casino.","example[34]":"All stock exchange investment is a gamble.","example[35]":"The board decided to embark on aggressive overseas expansion, the biggest gamble it had ever taken."}