{"signpost[0]":"stone","definition[0]":"the hard substance that forms the main surface of the Earth","example[0]":"To build the tunnel, they had to cut through 500 feet of solid rock.","example[1]":"Most of the country is desert and bare rock.","example[2]":"massive rock formations (=shapes made naturally from rock)","example[3]":"ancient dark volcanic rock","definition[1]":"a piece of rock, especially a large one that sticks up from the ground","example[4]":"Jack stood on a rock for a better view.","example[5]":"During the storm a ship had been driven onto the rocks (=a line of rocks under or next to the sea).","definition[2]":"a type of popular modern music with a strong loud beat, played using guitars and drums","example[6]":"the late rock star, Freddie Mercury","example[7]":"The stadium has hosted numerous rock concerts.","example[8]":"Komuro formed a rock band with some friends while in college.","note[0]":"rock band/group","definition[3]":"someone who always gives you support and who you can depend on","example[9]":"My sister has always been my rock.","signpost[1]":"sweet food","definition[4]":"a hard sweet made in long round pieces","example[10]":"a stick of rock","definition[5]":"a very pure form of the illegal drug cocaine that some people use for pleasure","definition[6]":"a small amount of this drug","signpost[2]":"jewel","definition[7]":"a diamond or other jewel","collocation[0]":"solid rock","example[11]":"Steps had been carved out of the solid rock.","collocation[1]":"bare rock","example[12]":"Here there was only bare rock and gravel.","collocation[2]":"volcanic rock","example[13]":"The fossils are sandwiched between two layers of volcanic rock.","collocation[3]":"molten rock","example[14]":"Molten rock flowed into these cracks.","form[0]":"rock + NOUN","collocation[4]":"a rock formation","example[15]":"There are marvellous views of impressive rock formations.","collocation[5]":"rock forms/is formed","example[16]":"From the texture of the rock we can tell how it was formed.","collocation[6]":"something erodes rock","example[17]":"Rainwater drained away, forming streams and rivers that began to erode the rock.","collocation[7]":"rock erodes (away)","example[18]":"The rocks had eroded away over the years.","collocation[8]":"a lump/piece of rock","example[19]":"His leg was trapped under a large lump of rock.","collocation[9]":"a layer of rock","example[20]":"You can see six layers of rock in the cliff.","collocation[10]":"an outcrop of rock","example[21]":"The gulls nested on a outcrop of rock.","definition[8]":"a piece of the hard substance that forms the main surface of the Earth. In British English, rocks are too large to pick up, but in American English, they can either be large or small","example[22]":"the rocks along the riverbanks","definition[9]":"a small piece of rock, found on the ground or near the surface of the ground. Speakers of American English are more likely to use the word rock than stone","example[23]":"The children were throwing stones into the water.","display[0]":"boulder","definition[10]":"a large round piece of rock","example[24]":"She climbed over a few boulders at the edge of the sea.","display[1]":"pebble","definition[11]":"a small smooth stone found especially on a beach or on the bottom of a river","example[25]":"The beach was covered with smooth white pebbles.","display[2]":"fossil","definition[12]":"a rock which has the shape of an animal or plant that lived many thousands of years ago","example[26]":"fossils of early reptiles","definition[13]":"to move gently backwards and forwards or from side to side, or to make something do this","example[27]":"She covered her face, rocking to and fro in her grief.","example[28]":"The waves rocked the boat from side to side.","example[29]":"Paul sat gently rocking the child in his arms.","example[30]":"Jim rocked with laughter when he heard what had happened.","definition[14]":"to make the people in a place or organization feel very shocked – used in news reports","example[31]":"The scandal rocked the nation.","definition[15]":"to make the future of something seem less certain or steady than it was before, especially because of problems or changes","example[32]":"Another financial blow has rocked the industry.","example[33]":"The theory rocked the foundations of social and moral life.","definition[16]":"if an explosion or earthquake rocks an area, it makes it shake","example[34]":"Residents had only a few minutes to escape before the blast rocked their houses."}