{"word[0]":"solution","definition[0]":"a way of solving a problem or dealing with a difficult situation","example[0]":"The best solution would be for them to separate.","example[1]":"There are no simple solutions to the problem of overpopulation.","note[0]":"solution to/for","definition[1]":"the correct answer to a problem in an exercise or competition","example[2]":"The solution to last week’s puzzle is on page 12.","note[1]":"solution to","definition[2]":"a liquid in which a solid or gas has been mixed","example[3]":"a weak sugar solution","example[4]":"saline solution","collocation[0]":"a good solution","example[5]":"A good solution is to harvest the crop early in September.","collocation[1]":"the best/perfect/ideal solution","example[6]":"Locking people in prison is not necessarily the ideal solution.","collocation[2]":"an effective solution","example[7]":"The government has failed to come up with an effective solution.","collocation[3]":"a satisfactory solution","example[8]":"We will not rest until a satisfactory solution is found.","collocation[4]":"a neat solution","example[9]":"This sounded like a neat solution to the skills shortage.","collocation[5]":"the only solution","example[10]":"The only solution is to greatly reduce our use of water.","collocation[6]":"the real solution","example[11]":"The real solution to the waste problem is to produce much less waste.","collocation[7]":"a possible solution","example[12]":"There are three possible solutions to this problem.","collocation[8]":"an alternative solution","example[13]":"We need to look for alternative solutions.","collocation[9]":"a simple/easy solution","example[14]":"There is no easy solution to this problem.","collocation[10]":"a quick/speedy solution","example[15]":"We need to find a quick solution.","collocation[11]":"a practical/workable solution","example[16]":"They've had to find practical solutions to practical problems.","collocation[12]":"a long-term solution","example[17]":"A long-term solution to the problem will not be possible until that conflict is resolved.","collocation[13]":"a quick-fix solution","example[18]":"He has accused the government of looking for quick-fix solutions.","collocation[14]":"a peaceful/political solution","example[19]":"We will continue to work strenuously for a political solution acceptable to all parties.","collocation[15]":"find/come up with a solution","example[20]":"We are working together to find the best solution we can.","collocation[16]":"seek/look for a solution","example[21]":"The company is still seeking a solution to its financial problems.","collocation[17]":"provide/offer a solution","example[22]":"I don't think that tourism will provide a long-term solution to rural employment problems.","collocation[18]":"suggest/put forward a solution","example[23]":"The chairman put forward a possible solution."}