{"word[0]":"inferior","definition[0]":"not good, or not as good as someone or something else","opposite[0]":"superior","example[0]":"I felt very inferior among all those academics.","example[1]":"wine of inferior quality","example[2]":"inferior goods","example[3]":"Their performance was inferior to that of other teams.","example[4]":"I always felt slightly inferior to her.","note[0]":"inferior to","definition[1]":"lower in rank","example[5]":"an inferior court of law","example[6]":"He refused to accept a job of inferior status.","collocation[0]":"greatly inferior","example[7]":"Iron is greatly inferior to steel in many ways.","collocation[1]":"far inferior","example[8]":"He easily defeated a far inferior opponent.","collocation[2]":"considerably inferior","example[9]":"They have the same number of points as the league leaders, but a considerably inferior goal difference.","collocation[3]":"vastly/grossly inferior","example[10]":"The quality of service was vastly inferior in that other restaurant.","collocation[4]":"slightly inferior","collocation[5]":"markedly inferior","example[11]":"Our equipment was markedly inferior to that of the enemy forces.","collocation[6]":"socially inferior","example[12]":"She felt socially inferior to her husband's wealthy friends.","collocation[7]":"morally inferior","example[13]":"Non-believers were considered morally inferior by people who adopted the new religion.","collocation[8]":"intellectually inferior","example[14]":"Students from working-class families were made to feel intellectually inferior.","collocation[9]":"intrinsically inferior","example[15]":"Recorded music is intrinsically inferior to the real thing.","collocation[10]":"feel inferior","example[16]":"Women are made to feel inferior by men's violence towards them.","collocation[11]":"consider somebody/something inferior","example[17]":"The poor are considered inferior by some people.","collocation[12]":"inferior quality","example[18]":"The poor soil produces wine of inferior quality.","collocation[13]":"an inferior position","example[19]":"He argued that capitalism requires some people to be kept in an inferior position in society.","collocation[14]":"inferior status","example[20]":"As a slave, he was aware of his inferior status.","collocation[15]":"inferior service","example[21]":"He wrote a letter to complain about inferior service at the hotel.","collocation[16]":"inferior goods/products","example[22]":"The public are being deceived into buying inferior goods.","definition[2]":"someone who has a lower position or rank than you in an organization"}