{"word[0]":"guest","signpost[0]":"at an event","definition[0]":"someone who is invited to an event or special occasion","example[0]":"a banquet for 250 distinguished guests","example[1]":"Among the invited guests were Jerry Brown and Elihu Harris.","example[2]":"The actress was guest of honour (=the most important guest) at the launch.","example[3]":"I’ve nearly finished the guest list for the wedding.","example[4]":"Most of the wedding guests had left.","note[0]":"dinner/wedding etc guests","example[5]":"You are here as my guests.","note[1]":"as somebody’s guest","explanation[0]":"In everyday English, people usually talk about having friends/people over (for a meal, short visit etc) or having friends/people to stay rather than saying that they have guests:","example[6]":"We’re having some people over for dinner this evening.","signpost[1]":"in a house","definition[1]":"someone you have invited to stay in your home for a short time","example[7]":"We have guests staying right now.","signpost[2]":"in a hotel","definition[2]":"someone who is paying to stay in a hotel","example[8]":"Use of the sauna is free to guests.","signpost[3]":"on a show","definition[3]":"someone famous who is invited to take part in a show, concert etc, in addition to those who usually take part","example[9]":"We have some great guests for you tonight.","example[10]":"Fontaine appeared as a guest on the show.","form[0]":"ADJECTIVES/NOUN + guest","collocation[0]":"the main/chief/principal guest","example[11]":"The prime minister was one of the main guests at the event.","collocation[1]":"an honoured guest","example[12]":"They were the honoured guests of the Queen at the Royal Garden Party.","collocation[2]":"a distinguished guest","example[13]":"Many distinguished guests were invited to the opening ceremony.","collocation[3]":"dinner guests","example[14]":"How much meat do I need to buy for 15 dinner guests?","collocation[4]":"wedding guests","example[15]":"We need to send out invitations to all the wedding guests.","collocation[5]":"a house guest","example[16]":"There was a constant stream of house guests at their country estate.","collocation[6]":"invited guests","example[17]":"Celebrations continued with a dinner for 100 invited guests.","collocation[7]":"an unwelcome guest","example[18]":"Security guards were employed to keep out unwelcome guests.","collocation[8]":"an uninvited guest","example[19]":"She was surprised when an uninvited guest turned up at the door.","collocation[9]":"a regular/frequent guest","example[20]":"The Johnsons were regular guests at Eric’s house in Notting Hill.","form[1]":"guest + NOUN","collocation[10]":"the guest list","example[21]":"The guest list included many friends from his university days.","collocation[11]":"a guest speaker/lecturer","example[22]":"The guest speaker at the conference was Dr. Kim.","collocation[12]":"the guest of honour","example[23]":"The senator was guest of honour at a reception held at the American Embassy.","collocation[13]":"invite a guest","example[24]":"The guests were invited to a dinner at his country house.","collocation[14]":"greet the guests","example[25]":"Roger was busy greeting the guests as they arrived.","collocation[15]":"entertain guests","example[26]":"Their garden is a wonderful place to entertain guests.","definition[4]":"for guests to use","example[27]":"He was still asleep in the guest bedroom.","definition[5]":"a guest star, speaker etc is someone famous or important who is invited to take part in an event, in addition to the people who usually take part","example[28]":"Camfield was lucky in getting Cage and Rampling as guest stars.","example[29]":"He will make a special guest appearance on next week’s show.","definition[6]":"to take part in a show, concert etc as a guest","example[30]":"She guested on a comedy show last year.","note[2]":"guest on","example[31]":"The hotel still prepares guests’ bills by hand."}