{"signpost[0]":"last part","definition[0]":"the last part of a period of time, event, activity, or story","opposite[0]":"beginning","example[0]":"Hooker’s death marked the end of an era.","example[1]":"I played the tape from beginning to end.","example[2]":"Costs are expected to double by the end of 2012.","note[0]":"end of","example[3]":"What would she find at the end of her journey?","note[1]":"at the end","signpost[1]":"finished","definition[1]":"a situation in which something is finished or no longer exists","example[4]":"At last it seemed the war might be coming to an end.","example[5]":"The spacecraft is nearing the end of its useful life.","example[6]":"Well, I hope that’s the end of the matter.","example[7]":"Another year has passed, with no end in sight to the suffering.","example[8]":"It’s hoped the talks may bring an end to the violence.","note[2]":"put/bring an end to something","example[9]":"The EU is demanding an end to the ivory trade.","note[3]":"call for/demand an end to something","example[10]":"He rose to indicate that the conversation was at an end.","note[4]":"be at an end","signpost[2]":"furthest part","definition[2]":"the part of a place or object that is furthest from its beginning or centre","example[11]":"The channel measures 20 feet from end to end.","example[12]":"He stood the box on end to open it.","note[5]":"stand/place something on end","example[13]":"bricks laid end to end","note[6]":"lay/place something end to end","example[14]":"We sat at opposite ends of the table.","example[15]":"He wore spectacles perched on the very end of his nose.","example[16]":"The end of the pencil snapped.","example[17]":"Jo joined the end of the line.","example[18]":"the far end (=furthest from you) of the room","signpost[3]":"scale","definition[3]":"one of the two points that begin or end a scale","example[19]":"Some teenagers are just a nuisance, but at the other end of the scale there are kids who pose a real threat.","example[20]":"the cheaper end of the price range","note[7]":"lower/cheaper etc end","example[21]":"At the opposite end of the political spectrum are the Marxist theories.","signpost[4]":"connection","definition[4]":"one of two places that are connected by a telephone call, journey etc","example[22]":"We’ll get a bus connection at the other end.","example[23]":"Any problems at your end  (=where you are)?","example[24]":"Sometimes, all you need is a calm voice on the end of the phone.","note[8]":"the end of the phone/line","signpost[5]":"remaining piece","definition[5]":"a small piece of something that is left after you have finished with it","example[25]":"cigarette ends","signpost[6]":"aim","definition[6]":"an aim or purpose, or the result you hope to achieve","note[9]":"the end justifies the means (=used to say that doing bad things is acceptable if they achieve an important result)","example[26]":"She’ll do anything to achieve her own ends.","example[27]":"Every task has a clear end in view.","example[28]":"40% of all research is undertaken for military ends.","note[10]":"political/military etc ends","example[29]":"He wants to cut costs, and to that end is looking at ways of cutting the company’s operations.","note[11]":"to that end","example[30]":"IT is a tool for learning, not merely an end in itself.","note[12]":"an end in itself","signpost[7]":"part of an activity","definition[7]":"part of a job, activity, or situation that involves or affects one person or group of people","example[31]":"She works in the sales end of things.","definition[8]":"one of the two halves of a sports field","signpost[8]":"death","definition[9]":"a word meaning death – used to avoid saying this directly","example[32]":"He met his end (=died) in a car accident.","heading[0]":"– Meaning 1: the last part of a period of time, event, activity, or story","collocation[0]":"the end of the day/week/month etc","example[33]":"Karen’s returning to the States at the end of the month.","collocation[1]":"the end of March/July/December etc","example[34]":"My licence runs out at the end of May.","collocation[2]":"the end of the war","example[35]":"The two men met once again before the end of the war.","collocation[3]":"be/mark the end of an era","example[36]":"The principal’s death marked the end of an era at the college.","collocation[4]":"from beginning to end","example[37]":"Michael Jordon led the race from beginning to end.","heading[1]":"– Meaning 2: a situation in which something is finished or no longer exists","collocation[5]":"come to an end","example[38]":"Arsenal’s ten-match unbeaten run came to an end with a 3–2 defeat at United.","collocation[6]":"draw to an end","example[39]":"My holiday was drawing to an end.","collocation[7]":"get to/reach the end of something","example[40]":"The 40 year-old power station has now reached the end of its operating life.","collocation[8]":"put an end to something","example[41]":"A shoulder injury put an end to his baseball career.","collocation[9]":"bring an end to something/bring something to an end","example[42]":"They began peace talks aimed at bringing an end to the civil war.","example[43]":"The union is calling for an end to discrimination.","collocation[10]":"a sudden/abrupt end","example[44]":"After the news leaked out, his political career came to a sudden end.","collocation[11]":"an early end","example[45]":"Hopes of an early end to the conflict are fading.","collocation[12]":"a fitting end to something","example[46]":"The fireworks display was a fitting end to the celebrations.","collocation[13]":"the end of the matter","example[47]":"If you think that’s the end of the matter, you’re mistaken.","collocation[14]":"the end is in sight","example[48]":"After a three year wait, the end is finally in sight.","heading[2]":"– Meaning 3: the part of a place or object that is furthest from its beginning or centre","collocation[15]":"the opposite/other end (of something)","example[49]":"Jon and his girlfriend were sitting at the opposite end of the bar.","collocation[16]":"the far end (of something)","example[50]":"He walked to the far end of the room and sat at his desk.","collocation[17]":"deep/shallow end","example[51]":"The kids were splashing about in the shallow end.","example[52]":"The roof tiles are laid end to end.","heading[3]":"– Meaning 8: part of a job, activity, or situation that involves or affects one person or group of people","collocation[18]":"political/military financial etc ends","example[53]":"The government exploited the situation for political ends.","collocation[19]":"achieve your own ends","example[54]":"Some people would do almost anything to achieve their own ends.","example[55]":"Our first priority is safety, and the airline is working to that end.","example[56]":"The programme is not an end in itself, but rather the first step the prisoner takes towards a new life.","collocation[20]":"the end justifies the means","example[57]":"Their defence, that the end justifies the means, is not acceptable.","collocation[21]":"a means to an end","example[58]":"To Joe, work was a means to an end, nothing more.","collocation[22]":"with this end in view","example[59]":"We need to reduce costs, so with this end in view, the company is switching supplier.","heading[4]":"GRAMMAR: Prepositions with end","explanation[0]":"You use at the end when talking about the last part of a story, book, film, game etc","example[60]":"At the end, the hero dies ","example[61]":"There is a summary at the end of the chapter","explanation[1]":"You often use at the end of when talking about the last part of a period of time","example[62]":"Marco Polo travelled through Asia at the end of the 13th century","bad_example[0]":"in the end of the 13th century","explanation[2]":"In the end means the same as ‘eventually’ You use it when saying that something happens or after a long period of time or a lot of other things have happened","example[63]":"In the end, she got her money back","example[64]":"I’m sure we’ll win in the end","definition[10]":"the part of a place or object that is furthest from the centre or the beginning","example[65]":"the end of the table","example[66]":"the end of the street","definition[11]":"the end of something, especially something pointed","example[67]":"the tip of your nose","example[68]":"an arrow tip","definition[12]":"the sharp end of something","example[69]":"The point of the pencil broke.","definition[13]":"if an event, activity, or story ends, it stops happening","example[70]":"World War II ended in 1945.","example[71]":"The festival will end with a spectacular laser show.","note[13]":"end with","definition[14]":"to make something stop happening","example[72]":"The talks are aimed at ending the conflict.","definition[15]":"to finish what you are doing","opposite[1]":"start","example[73]":"I think we'll end there for today.","example[74]":"I’d like to end by inviting questions from the audience.","note[14]":"end by doing something","definition[16]":"if a road, path, line etc ends, it reaches its final point","example[75]":"This is where the line ends. ","definition[17]":"to reach the final point in a period of time in a particular condition","example[76]":"They ended the game with a score of 63-42. ","example[77]":"The company ended the year with record profits.","explanation[3]":"End belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[4]":"In this sentence, ‘the session’ is the object of end","example[78]":"We will end the session with questions","explanation[5]":"In this sentence, ‘the session’ is the subject of end","example[79]":"The session will end with questions","definition[18]":"if a event, activity, or story ends, it stops happening","example[80]":"How does the story end?","example[81]":"The school year ends in June.","display[0]":"finish","definition[19]":"to end – use this about an organized event such as a meeting, party, or lesson, especially when saying what time it ends","example[82]":"The meeting will finish at 5.30.","example[83]":"What time does your Spanish class finish?","display[1]":"be over","definition[20]":"if an event, activity, or period of time is over, it has ended","example[84]":"I can’t wait for our exams to be over.","example[85]":"The long summer vacation was almost over.","definition[21]":"to finally end – used about a period of time, a situation, or an activity that has continued for a long time","example[86]":"The war finally came to an end six years later.","display[2]":"draw to an end/to a close","definition[22]":"to end gradually over a period of time – used in written descriptions","example[87]":"These problems still remained as the twentieth century drew to an end.","display[3]":"time is up","definition[23]":"if time is up, you are not allowed any more time to do something","example[88]":"I wasn’t able to finish the test before the time was up.","display[4]":"time runs out","definition[24]":"if time runs out, there is no more time available to do something, especially something important","example[89]":"The desperate search for survivors continues, but time is running out.","display[5]":"expire","definition[25]":"if a ticket, bank card, legal document etc expires, the period of time during which you can use it has ended","example[90]":"I’m afraid we can’t accept this credit card – it expired last week.","definition[26]":"if something is at an end, it has ended","example[91]":"We both knew that our marriage was at an end.","example[92]":"The long wait was at an end.","definition[27]":"a figure that is at the top or bottom end of a range is high or low in the range of possible figures that were expected","example[93]":"The results were at the top end of previous market forecasts.","definition[28]":"a product that is at the top or bottom end of a range is the most expensive or cheapest in the range","example[94]":"It won’t be easy competing at the top end of the market.","example[95]":"Bombay dealers are the main suppliers of the cheap end of the US diamond jewelry market."}