{"word[0]":"aim","definition[0]":"something you hope to achieve by doing something","example[0]":"The main aim of the course is to improve your writing.","example[1]":"Teamwork is required in order to achieve these aims.","example[2]":"a policy which sets out the school’s aims and objectives","example[3]":"The aim of the research is to find new food sources.","note[0]":"aim of","example[4]":"a campaign with the aim of helping victims of crime","note[1]":"with the aim of doing something","definition[1]":"someone’s ability to hit what they are aiming at when they throw or shoot something","example[5]":"Val’s aim was very good.","collocation[0]":"the main/primary/principal aim","example[6]":"The country’s main aim was to slow inflation.","collocation[1]":"the ultimate/eventual/long-term aim","example[7]":"The ultimate aim is to replace gasoline with non-polluting energy sources.","collocation[2]":"the immediate/initial/short-term aim","example[8]":"The immediate aim is to develop the travel business.","collocation[3]":"the overall/general/broad aim","example[9]":"The overall aim of the project is to encourage young people to stay in higher education.","example[10]":"Guided by the general aim of the project, we aimed to reach a number of key objectives.","collocation[4]":"a specific aim","example[11]":"What are the specific aims of the course?","collocation[5]":"the underlying aim","example[12]":"The games all have an underlying aim: survival.","collocation[6]":"a political aim","example[13]":"We utterly condemn any acts of violence in pursuit of political aims.","collocation[7]":"a strategic aim","example[14]":"The broader strategic aims were to safeguard the Dutch East Indies against attack.","collocation[8]":"an educational aim","example[15]":"the educational aims of the school","collocation[9]":"somebody’s declared/stated aim","example[16]":"The Department’s declared aim is targeting benefits where they are most needed.","collocation[10]":"a common aim","example[17]":"We know the value of working closely together to pursue our common aims.","collocation[11]":"have an aim","example[18]":"His trip to Milan, his third in two weeks, had a precise aim.","collocation[12]":"achieve/fulfil your aim","example[19]":"The Internet bank achieved its aim of attracting 50,000 customers last year.","example[20]":"Once she had decided to go into publishing, she set out to fulfil her aim.","collocation[13]":"pursue your aims","example[21]":"We worked closely together to pursue our common aims.","collocation[14]":"further your aims","example[22]":"The group is prepared to use violence to further its political aims.","collocation[15]":"set out the aims of something","example[23]":"Is there a set of guidelines setting out the aims of study?","collocation[16]":"a set of aims","example[24]":"The organization has a set of aims which are listed on its website.","collocation[17]":"aims and objectives","example[25]":"These aims and objectives are set out in chapters two and three.","example[26]":"The main aim of the plan was to provide employment for local people.","display[0]":"goal","definition[2]":"something important that you hope to achieve in the future, even though it may take a long time","example[27]":"The country can still achieve its goal of reducing poverty by a third.","display[1]":"target","definition[3]":"a particular amount or total that you want to achieve","example[28]":"The company is on track to meet its target of increasing profits by 10%.","display[2]":"objective","definition[4]":"the specific thing that you are trying to achieve – used especially about things that have been officially discussed and agreed upon in business, politics etc","example[29]":"Their main objective is to halt the flow of drugs.","example[30]":"We met to set the business objectives for the coming year.","display[3]":"ambition","definition[5]":"something that you very much want to achieve in your future career","example[31]":"Her ambition was to go to law school and become an attorney.","example[32]":"Earlier this year, he achieved his ambition of competing in the Olympic Games.","definition[6]":"to try or intend to achieve something","example[33]":"We aim to finish by Friday.","note[2]":"aim to do something","example[34]":"an initiative aimed at reducing road accidents","note[3]":"be aimed at doing something","example[35]":"We’re aiming for a big improvement.","note[4]":"aim for something","definition[7]":"to choose the place, person etc that you want to hit or reach and point a weapon or another object towards them","example[36]":"Denver aimed his gun but did not shoot.","example[37]":"The pilot was aiming for the runway but came down in a nearby field.","note[5]":"aim at/for","heading[0]":"GRAMMAR: Patterns with aim","explanation[0]":"You aim to do something","example[38]":"I aim to study medicine","bad_example[0]":"I aim at studying medicine","explanation[1]":"An action is aimed at doing something","example[39]":"Our policies are aimed at encouraging economic growth","bad_example[1]":"Our policies are aimed to encourage economic growth","definition[8]":"Alternative Investment Market; a stock market in Britain for new small companies, part of the London Stock Exchange"}