{"word[0]":"remove","signpost[0]":"take away","definition[0]":"to take something away from, out of, or off the place where it is","example[0]":"Remove the old wallpaper and fill any holes in the walls.","example[1]":"Reference books may not be removed from the library.","note[0]":"remove something from something","signpost[1]":"get rid of","definition[1]":"to get rid of something so that it does not exist any longer","example[2]":"a cleaner that will remove wine stains","example[3]":"The college removed rules that prevented women from enrolling.","signpost[2]":"from a job","definition[2]":"to force someone out of an important position or dismiss them from a job","example[4]":"Congress could remove the president from office.","note[1]":"remove somebody from something","definition[3]":"to take off a piece of clothing","example[5]":"He removed his hat and gloves.","explanation[0]":"In everyday English, people usually say that someone takes clothing off rather than removes it: ","example[6]":"Is it OK if I take my coat off?","definition[4]":"to make something no longer exist, especially something that was causing problems","example[7]":"Some stains are difficult to remove with ordinary washing powder.","example[8]":"All the obstacles to an agreement have now been removed.","display[0]":"get rid of somebody/something","definition[5]":"to remove someone or something that you do not want. Get rid of  is much more common than remove in everyday English, but is usually only used in active sentences","example[9]":"They managed to get rid of all the weeds.","example[10]":"It was almost impossible to get rid of him.","display[1]":"eliminate","definition[6]":"to completely get rid of something that you do not want, especially because it is unnecessary or causing problems","example[11]":"If you book online, this eliminates the need for a ticket.","example[12]":"The new system will help to eliminate costly delays.","display[2]":"eradicate","definition[7]":"to completely get rid of a disease or a problem","example[13]":"The disease has been eradicated from most of Europe.","example[14]":"Street crime has almost been eradicated.","display[3]":"delete","definition[8]":"to remove something that has been written on a computer, or stored in a computer","example[15]":"Do you want to delete this file?","example[16]":"Press 3 to delete the messages on your answerphone.","display[4]":"erase","definition[9]":"to remove recorded sounds or pictures from a tape, or writing from paper","example[17]":"Shall I erase this video?","example[18]":"It’s better to cross out a mistake than to try to erase it.","definition[10]":"to remove a part from a film, book, speech etc","example[19]":"The most violent scenes were cut.","example[20]":"Parts of his original speech were cut.","definition[11]":"a distance or amount by which two things are separated","example[21]":"The X-ray operator works at a safe remove in a separate room.","note[2]":"at a remove","definition[12]":"to take something away","example[22]":"We need to consider the trade implications before border controls are removed.","example[23]":"an injunction removing the vote from 80,000 shareholders","note[3]":"remove something from somebody/something","example[24]":"The committee is recommending that the drug be removed from the market altogether.","definition[13]":"to force someone to leave an important job or position","example[25]":"The new directors intend to meet on Monday to remove the company’s chief executive.","example[26]":"The governor was removed from office following allegations of misconduct."}