{"word[0]":"break up","definition[0]":"if something breaks up, or if you break it up, it breaks into a lot of small pieces","example[0]":"It seems that the plane just broke up in the air.","example[1]":"Use a fork to break up the soil.","note[0]":"break something ↔ up","definition[1]":"to separate something into several smaller parts","example[2]":"There are plans to break the company up into several smaller independent companies.","example[3]":"You need a few trees and bushes to break up the lawn.","definition[2]":"to stop a fight","example[4]":"Three policemen were needed to break up the fight.","definition[3]":"to make people leave a place where they have been meeting or protesting","example[5]":"Government soldiers broke up the demonstration.","example[6]":"Police moved in to break up the meeting.","definition[4]":"if a marriage, group of people, or relationship breaks up, the people in it separate and do not live or work together anymore","example[7]":"He lost his job and his marriage broke up.","example[8]":"The couple broke up last year.","example[9]":"Many bands break up because of personality clashes between the musicians.","example[10]":"Has Sam really broken up with Lucy?","definition[5]":"if a meeting or party breaks up, people start to leave","example[11]":"The party didn’t break up until after midnight.","example[12]":"The meeting broke up without any agreement.","definition[6]":"when a school breaks up, it closes for a holiday","example[13]":"School breaks up next week.","example[14]":"When do you break up for Easter?","definition[7]":"to make someone laugh by saying or doing something funny","example[15]":"He breaks me up!","definition[8]":"if a company or group breaks up or is broken up, it is divided into smaller companies","example[16]":"The new chairman plans to break up the group into more autonomous subsidiaries.","definition[9]":"if someone breaks up an arrangement or agreement, or if it is broken up, it ends","example[17]":"Japan’s Fair Trade Commission ordered 13 ink makers to break up a price-fixing cartel.","definition[10]":"an occasion when a company or group is broken up into smaller units","example[18]":"Break-ups create added tax, interest and management costs."}