{"word[0]":"shore","definition[0]":"the land along the edge of a large area of water such as an ocean or lake","note[0]":"rocky/sandy shore","example[0]":"We could see a boat about a mile from shore.","example[1]":"Only a few survivors reached the shore.","example[2]":"She began to swim to shore.","example[3]":"a holiday resort on the shores of the Adriatic","note[1]":"on the shores of something","example[4]":"We had a couple of hours on shore  (=not on a ship).","note[2]":"on shore","example[5]":"The island is about three miles off shore  (=away from the coast).","note[3]":"off shore","definition[1]":"the area of sand, mud, or low land along the edge of the sea, a lake etc","example[6]":"I went down to the shore to meet him.","example[7]":"The fish is commonly found off the shores of Australia.","example[8]":"They had planned to take a picnic on the shores of Lake Havel.","display[0]":"coast","definition[2]":"the land next to the sea","example[9]":"He lives on the Sussex coast.","example[10]":"one of the most luxurious hotels on the south coast","example[11]":"the Draugen oil field, off the West coast of Norway","example[12]":"the East Coast of the United States","display[1]":"beach","definition[3]":"an area of sand or small stones at the edge of the sea","example[13]":"Let's go to the beach.","example[14]":"Brighton beach","display[2]":"the seashore","definition[4]":"the land at the edge of the sea, consisting of sand or rocks","example[15]":"He walked with her along the seashore.","example[16]":"You can hear the waves breaking on the seashore.","display[3]":"the seaside","definition[5]":"the areas or towns next to the sea where people go to enjoy themselves","example[17]":"We went on day trips to the seaside.","example[18]":"Oh I do love to be beside the seaside  (=a line from a well-known song).","example[19]":"a seaside town","example[20]":"a seaside resort","display[4]":"bank","definition[6]":"the land along the side of a river","example[21]":"a journey along the banks of the River Ganges","example[22]":"He swam over to the other bank.","example[23]":"The river burst its banks.","display[5]":"the waterfront","definition[7]":"the part of a town or an area of land next to the sea, a river etc – used especially when talking about buildings near the water","example[24]":"The restaurant is down on the waterfront.","example[25]":"a waterfront bar in Montreal called The Neptune","display[6]":"the waterside","definition[8]":"the area at the edge of a lake, river etc","example[26]":"The mountains almost come down to the waterside.","example[27]":"a rented villa on the lakeside","example[28]":"A number of barges were hidden in the trees along the riverside.","example[29]":"beautiful riverside views"}