{"word[0]":"pop","signpost[0]":"come out/off","definition[0]":"to come suddenly or unexpectedly out of or away from something","example[0]":"The lid popped open and juice spilled all over the floor.","example[1]":"The top button popped off my shirt.","note[0]":"pop out/off/up etc","example[2]":"The ball popped out of Smith’s hands and onto the ground.","example[3]":"The egg cracked open and out popped a tiny head.","note[1]":"out/up popped something","signpost[1]":"go quickly","definition[1]":"to go somewhere for a short time","example[4]":"Why don’t you pop by the next time you’re in town?","note[2]":"pop in/out/by etc","example[5]":"I need to pop into the drugstore for a second.","example[6]":"Could you pop round to the shop for some bread?","note[3]":"pop round","signpost[2]":"quickly put something","definition[2]":"to quickly put something somewhere, usually for a short time","example[7]":"I’ll just pop these cookies into the oven.","note[4]":"pop something in/around/over etc","example[8]":"Barry popped his head round the door to say hello.","note[5]":"pop something round something","signpost[3]":"short sound","definition[3]":"to make a short sound like a small explosion, or to make something do this","example[9]":"The wood sizzled and popped in the fire.","signpost[4]":"burst","definition[4]":"to burst, or to make something burst, with a short explosive sound","example[10]":"A balloon popped.","signpost[5]":"ears","definition[5]":"if your ears pop, you feel the pressure in them suddenly change, for example when you go up or down quickly in a plane","definition[6]":"to hit someone","example[11]":"If you say that again, I’ll pop you one.","signpost[6]":"popcorn","definition[7]":"to cook popcorn until it swells and bursts open, or to be cooked in this way","definition[8]":"modern music that is popular, especially with young people, and usually consists of simple tunes with a strong beat","example[12]":"a new pop record","example[13]":"a pop star","example[14]":"a pop festival","definition[9]":"a sudden short sound like a small explosion","example[15]":"the pop of a champagne cork","example[16]":"The balloon went pop (=made a sudden short sound).","definition[10]":"a sweet drink with bubbles but no alcohol, or a glass or can of this drink","synonym[0]":"soda","example[17]":"a bottle of pop","example[18]":"Can you get me a pop while you’re up?","signpost[7]":"father","definition[11]":"father – used especially when you are talking to your father","definition[12]":"written abbreviation for POINT OF PURCHASE"}