{"word[0]":"pressure","definition[0]":"an attempt to persuade someone by using influence, arguments, or threats","example[0]":"They are putting pressure on people to vote yes.","example[1]":"He exerts pressure on his kids to get them to do as he wants.","example[2]":"You must never give in to pressure.","example[3]":"The minister was under pressure to resign.","note[0]":"be/come under pressure to do something","example[4]":"I was under pressure from my parents to become a teacher.","note[1]":"be/come under pressure from somebody (to do something)","example[5]":"The Labour government came under pressure from the trade unions.","example[6]":"Pressure for change has become urgent.","note[2]":"pressure for","example[7]":"the pressure on all of us to keep slim","note[3]":"pressure on","signpost[0]":"anxiety/overwork","definition[1]":"a way of working or living that causes you a lot of anxiety, especially because you feel you have too many things to do","example[8]":"The pressures of work can make you ill.","example[9]":"a high pressure job","example[10]":"athletes who show grace under pressure (=who behave well when they are anxious)","example[11]":"I feel I’m not able to cope well with the pressures of life.","note[4]":"pressure of","example[12]":"The pressure on doctors is increasing steadily.","example[13]":"I’m under constant pressure at work.","note[5]":"under pressure","signpost[1]":"causing change","definition[2]":"events or conditions that cause changes and affect the way a situation develops, especially in economics or politics","example[14]":"inflationary pressures","example[15]":"Analysts expect the pound to come under pressure.","example[16]":"The 1990s brought increased economic pressure to bear on all business activities.","example[17]":"Slowing the arms race relieved pressure on the Soviet economic system.","note[6]":"relieve/reduce pressure (on somebody/something)","definition[3]":"the force or weight that is being put on to something","example[18]":"The pressure of the water turns the wheel.","example[19]":"the pressure of his hand on my arm","signpost[2]":"gas/liquid","definition[4]":"the force produced by the quantity of gas or liquid in a place or container","example[20]":"The gas containers burst at high pressure.","definition[5]":"a condition of the air in the Earth’s atmosphere, which affects the weather","example[21]":"A ridge of high pressure is building up strongly over the Atlantic.","note[7]":"high/low pressure","collocation[0]":"put pressure on somebody","example[22]":"We’ve decided to set up a campaign to put pressure on the Government.","collocation[1]":"exert pressure on somebody","example[23]":"They exerted pressure on their colleagues to vote for the change.","collocation[2]":"bring pressure to bear on somebody","example[24]":"These groups have brought pressure to bear on the government.","collocation[3]":"put somebody under pressure","example[25]":"They were put under pressure to sign confessions.","collocation[4]":"be under pressure","example[26]":"Apple growers are under pressure from the public to use fewer chemicals.","collocation[5]":"come under pressure","example[27]":"The new prime minister has already come under pressure from the opposition to call an election.","collocation[6]":"bow to pressure","example[28]":"He eventually gave in to pressure and resigned.","collocation[7]":"respond to pressure","example[29]":"The government responded to this pressure and modified the Bill.","collocation[8]":"strong/intense pressure","example[30]":"There was strong pressure for a statement from the president.","collocation[9]":"considerable pressure","example[31]":"Shopkeepers are under considerable pressure to work on Sundays.","collocation[10]":"increasing/mounting pressure","example[32]":"There was increasing pressure on the Chancellor to cut petrol tax.","collocation[11]":"public/popular pressure","example[33]":"He faces mounting public pressure to resign.","collocation[12]":"political pressure","example[34]":"We did not make this recommendation because of political pressure.","collocation[13]":"diplomatic pressure","example[35]":"The announcement of a ceasefire came after intense diplomatic pressure from the US.","definition[6]":"to try to make someone do something by making them feel it is their duty to do it","example[36]":"You want to enjoy food, not to be pressured into eating the right things.","note[8]":"pressure somebody into doing something","example[37]":"Don’t feel we are pressuring you to give what you can’t afford.","note[9]":"pressure somebody to do something"}