{"definition[0]":"the group of people who govern a country or state","example[0]":"The Government are planning further cuts in public spending.","example[1]":"The US government has tightened restrictions on firearms.","example[2]":"Neither party had the majority necessary to form a government.","example[3]":"Structural reforms are unlikely under the present government.","note[0]":"under a government","explanation[0]":"In this meaning, government is usually followed by a singular verb","example[4]":"The government is planning to increase taxes","example[5]":"The government are planning to increase taxes","definition[1]":"a form or system of government","example[6]":"Most people in the country support the return to democratic government.","definition[2]":"the process or way of governing","example[7]":"the importance of good government in developing countries","example[8]":"What would the opposition do if they were in government  (=governing the country)?","note[1]":"in government","definition[3]":"the degree to which the government controls economic and social activities","example[9]":"The protest march was really about big government (=when the government controls many activities).","form[0]":"ADJECTIVES/NOUN + government","collocation[0]":"the UK/French/Thai etc government","example[10]":"The UK government has offered to send aid.","collocation[1]":"the Labour/Conservative/Social Democratic etc government","example[11]":"In August 1931, the Labour government collapsed.","collocation[2]":"the Thatcher/Blair etc government","example[12]":"Did the Blair government do more for Africa than previous ones?","collocation[3]":"a coalition government","example[13]":"The country has had a succession of weak coalition governments.","collocation[4]":"a minority government","example[14]":"His party had gained only enough seats to form a minority government.","collocation[5]":"a left-wing/right-wing government","example[15]":"The new left-wing government restructured the economy.","collocation[6]":"central/national government","example[16]":"Funding will continue to be available from central government for further education for adults.","collocation[7]":"federal government","example[17]":"The state, rather than the federal government, would have to pay the extra cost.","collocation[8]":"local/state/city government","example[18]":"The interference in local government by central government is not just financial, but political.","form[1]":"government + NOUN","collocation[9]":"government spending","example[19]":"Government spending on health care totals about $60 billion a year.","collocation[10]":"a government minister","example[20]":"A government minister said that there would be an inquiry.","collocation[11]":"a government official","example[21]":"He had a meeting with French scientists and government officials.","collocation[12]":"a government body","example[22]":"Patents are granted by the U.K. Patent Office, a government body.","collocation[13]":"a government department","example[23]":"the government department responsible for policing","collocation[14]":"elect a government","example[24]":"A new government was elected last October.","collocation[15]":"form a government","example[25]":"The party attained the majority of seats it needed to form a government.","collocation[16]":"bring down a government","example[26]":"It was a major scandal that nearly brought down the government.","definition[4]":"the group of people who govern a country or the system they use to govern it","example[27]":"The French government did not sign the agreement.","example[28]":"a democratic system of government","display[0]":"administration","definition[5]":"the government of a country, especially one such as the US, which is led by a president","example[29]":"the Kennedy administration","example[30]":"the problems left by the previous administration","display[1]":"regime","definition[6]":"a government, especially one that was not elected fairly or that you disapprove of","example[31]":"Most people opposed the apartheid regime.","display[2]":"the executive","definition[7]":"the part of the government that makes sure that laws and decisions work well","example[32]":"the separation of powers between the executive, the legislature, and the judiciary","display[3]":"democracy","definition[8]":"a political system in which everyone can vote to choose the government, or a country that has this system","example[33]":"The transition to democracy has not been easy.","example[34]":"In a democracy, people have freedom of speech.","display[4]":"republic","definition[9]":"a country that has an elected government, and is led by a president, not a king or queen","example[35]":"Mauritius became a republic in 1992.","display[5]":"monarchy","definition[10]":"the system of having a king or queen as the head of state, or a country that has this system","example[36]":"Some monarchies have elected governments.","example[37]":"controversy about the institution of monarchy","heading[0]":"an undemocratic government","display[6]":"dictatorship","definition[11]":"a political system or country that has a dictator (=a leader who has complete power and who has not been elected)","example[38]":"Argentina was a military dictatorship until 1983.","example[39]":"Hungary’s years of dictatorship","display[7]":"totalitarian","definition[12]":"used for describing countries in which ordinary people have no power and the government has complete control over everything","example[40]":"totalitarian states such as Nazi Germany","example[41]":"a totalitarian dictatorship","display[8]":"police state","definition[13]":"a country where the government strictly controls people’s freedom, for example to travel or to talk about politics","example[42]":"It’s like living in a police state.","definition[14]":"the group of people responsible for running a country or state and making decisions about taxes, laws, public services etc","example[43]":"The Government is planning further cuts in public spending."}