{"word[0]":"strip","definition[0]":"a long narrow piece of paper, cloth etc","example[0]":"a strip of paper","definition[1]":"a long narrow area of land","example[1]":"A strip of sand between the cliffs and the sea.","definition[2]":"a road with a lot of shops, restaurants etc along it","example[2]":"the Las Vegas strip","definition[3]":"the clothes worn by a sports team","example[3]":"Liverpool’s famous red strip","definition[4]":"a strip cartoon","signpost[0]":"take off clothes","definition[5]":"to take off your clothes or take off someone else’s clothes","example[4]":"Jack stripped and jumped into the shower.","example[5]":"The prisoner was stripped and beaten.","example[6]":"Eric stood in the hot sun, stripped to the waist (=not wearing any clothes on the top half of his body).","example[7]":"Terry stripped down to her bra and pants  (=removed all her clothes except her bra and pants) and tried on the dress.","example[8]":"The boys stripped naked and jumped in the pond.","example[9]":"He stripped off his sweater and threw it onto the couch.","note[0]":"strip off something","definition[6]":"to take off your clothes in a sexually exciting way as entertainment for someone else","signpost[1]":"remove","definition[7]":"to remove something that is covering the surface of something else","example[10]":"Strip the beds and wash the sheets.","example[11]":"We need to strip the wallpaper off the walls first.","note[1]":"strip something off/from something","example[12]":"tall windows stripped of curtains","note[2]":"strip something of something","signpost[2]":"engines/equipment","definition[8]":"to separate an engine or piece of equipment into pieces in order to clean or repair it","synonym[0]":"dismantle","signpost[3]":"building/ship etc","definition[9]":"to remove everything that is inside a building, all the equipment from a car etc so that it is completely empty","example[13]":"The apartment had been stripped bare.","definition[10]":"to damage or break the gears of something or the thread (=raised line) on a screw so that it does not work correctly anymore","definition[11]":"a SECURITY that has been created by separating a bond into the right to interest payments and the right to the repayment of the PRINCIPAL (=the original capital amount). For example, a 30-year bond would create 61 strips, 60 giving the right to receive interest payments every six months and one giving the right to have the capital repaid after 30 years","example[14]":"The principal strips yield 8.25% in 2009, and the interest strips mature in February and August of each year.","definition[12]":"an OPTION contract consisting of two PUT OPTIONs and one CALL OPTION on the same shares and with the same price and date","definition[13]":"to separate a bond into strips","example[15]":"When a bond is stripped, its corpus, or principal due upon maturity, is sold separately without interest payments."}