{"word[0]":"A","plural[0]":"A’s","definition[0]":"the first letter of the English alphabet","definition[1]":"the sixth note in the musical scale of C major or the musical key based on this note","definition[2]":"the highest mark that a student can get in an examination or for a piece of work","example[0]":"I got an A in French.","example[1]":"Julia got straight A’s (=all A’s) in high school.","definition[3]":"used to refer in a short way to one of two different things or people. You can call the second one B","example[2]":"A demands £500, B offers £100.","definition[4]":"a common type of blood","definition[5]":"the written abbreviation of amp or  amps","pos[0]":"indefinite article","definition[6]":"used to show that you are talking about someone or something that has not been mentioned before, or that your listener does not know about","example[3]":"We have a problem.","example[4]":"There was a hole in the fence.","example[5]":"Suddenly they heard a loud bang.","definition[7]":"used to show that you are referring to a general type of person or thing and not a specific person or thing","example[6]":"Would you like a sandwich?","example[7]":"I want to train to be an engineer.","example[8]":"He’s a really nice man.","example[9]":"Take a look at this.","example[10]":"It needs a good clean.","definition[8]":"used before someone’s family name to show that they belong to that family","example[11]":"One of his daughters had married a Rothschild.","definition[9]":"one","example[12]":"a thousand pounds","example[13]":"a dozen eggs","example[14]":"You’ll have to wait an hour or two.","definition[10]":"used in some phrases that say how much of something there is","example[15]":"There were a lot of people at the party.","example[16]":"A few weeks from now I’ll be in Venice.","example[17]":"You have caused a great deal of trouble.","definition[11]":"used to mean ‘each’ when stating prices, rates, or speeds","example[18]":"I get paid once a month.","example[19]":"The eggs cost $2 a dozen.","definition[12]":"used before singular nouns to mean all things of a particular type","example[20]":"A square has four sides  (=all squares have four sides).","example[21]":"A child needs love and affection.","definition[13]":"used once before two nouns that are mentioned together very often","example[22]":"I’ll fetch you a cup and saucer.","example[23]":"Does everyone have a knife and fork?","definition[14]":"used before the -ing forms of verbs when they are used as nouns referring to an action, event, or sound","example[24]":"There was a beating of wings overhead.","example[25]":"Bernice became aware of a humming that seemed to come from all around her.","definition[15]":"used before nouns that are usually uncountable when other information about the quality, feeling etc is added by an adjective, phrase, or clause","example[26]":"Candidates must have a good knowledge of chemistry.","definition[16]":"used before the name of a substance, food etc to refer to a particular type of it","example[27]":"Use a good cheese to make the sauce.","example[28]":"plants that grow well in a moist soil","definition[17]":"used before the name of a drink to refer to a cup or glass of that drink","example[29]":"Can I get you a coffee?","example[30]":"Renwick went to the bar and ordered a beer.","definition[18]":"used before the name of a famous artist to refer to a painting by that artist","example[31]":"an early Rembrandt","definition[19]":"used before a name to mean someone or something that has the same qualities as that person or thing","example[32]":"She was hailed as a new Marilyn Monroe.","definition[20]":"used before someone’s name when you do not know who they are","example[33]":"There is a Mr Tom Wilkins on the phone.","definition[21]":"used before the names of days, months, seasons, and events in the year to refer to a particular one","example[34]":"We arrived in England on a cold wet Sunday in 1963.","example[35]":"I can’t remember a Christmas like it.","heading[0]":"USAGE: A, an","explanation[0]":"Before a word beginning with a vowel sound, use an","explanation[1]":"Use an before an 'h' that is not pronounced","explanation[2]":"Use a before a 'u' that is pronounced like 'you'","explanation[3]":"Use an before an abbreviation that is pronounced with a vowel sound at the start","definition[22]":"in a particular condition or way","example[36]":"aloud","example[37]":"alive  (=living)","example[38]":"with nerves all a-tingle  (=tingling)","definition[23]":"in, to, at, or on something","example[39]":"abed  (=in bed)","example[40]":"afar  (=far away)","definition[24]":"not or without","example[41]":"amoral  (=not moral)","example[42]":"atypically  (=not typically)","definition[25]":"the highest mark that a student can get in a GCSE examination"}