{"definition[0]":"a situation in which people or organizations try to be more successful than other people or organizations","example[0]":"There is fierce competition between the three leading soap manufacturers.","note[0]":"fierce/stiff/intense etc competition","example[1]":"Small grocery stores are going out of business in the face of stiff competition from the large supermarket chains.","note[1]":"in the face of competition (from somebody/something)","example[2]":"Competition for the job was intense.","note[2]":"competition for","example[3]":"Sometimes there’s a lot of competition between children for their mother’s attention.","note[3]":"competition between/among","example[4]":"This price reduction is due to competition among suppliers.","example[5]":"competition in the automobile industry","note[4]":"competition in","example[6]":"Government departments are in direct competition with each other for limited resources.","note[5]":"be in competition with somebody/something","definition[1]":"the people or groups that are competing against you, especially in business or in a sport","example[7]":"Going to trade fairs is an ideal opportunity to size up the competition.","example[8]":"Jones is certain to win the race; there’s just no competition.","note[6]":"no/not much/little etc competition","example[9]":"The team overcame fierce competition for their place in the finals.","note[7]":"a lot of/considerable/fierce etc competition","example[10]":"Japanese PC makers now face foreign competition in their home market.","note[8]":"foreign/international competition","definition[2]":"an organized event in which people or teams compete against each other","example[11]":"a photography competition","example[12]":"Teams from high schools all over the state have entered the competition.","example[13]":"With France out of the competition, England have a great chance to win.","example[14]":"a competition to find a designer for the new building","note[9]":"competition to do something","heading[0]":"– Meaning 1: a situation in which people or organizations try to be more successful than other people or organizations","collocation[0]":"face competition (from somebody)","example[15]":"Website designers face increasing competition.","collocation[1]":"beat off/fight off competition","example[16]":"She beat off competition from dozens of other candidates to get the job.","collocation[2]":"strong/serious competition","example[17]":"The company is facing strong competition in the market.","collocation[3]":"stiff//tough/fierce/intense/keen competition","example[18]":"There is stiff competition for places at the best universities.","collocation[4]":"cut-throat competition","example[19]":"The cutthroat competition in the airline industry kept prices low for many years.","collocation[5]":"increasing/growing competition","example[20]":"the growing competition between banks","collocation[6]":"fair competition","example[21]":"Fair competition offers the best guarantee of good services and low prices.","collocation[7]":"unfair competition","example[22]":"This will protect the industry from unfair competition from abroad.","collocation[8]":"open competition","example[23]":"We welcome open competition in the software market.","collocation[9]":"in the face of competition","example[24]":"They won the contract in the face of tough competition.","heading[1]":"– Meaning 3: an organized event in which people or teams compete against each other","collocation[10]":"take part in a competition","example[25]":"Ten schools took part in the competition.","collocation[11]":"enter a competition","example[26]":"You must be over 16 to enter the competition.","collocation[12]":"win a competition","example[27]":"Lucy was thrilled to hear that she had won the short-story competition.","collocation[13]":"come first/second/third etc in a competition","example[28]":"Stuart came second in the swimming competition.","collocation[14]":"have/hold a competition","example[29]":"Each year the school holds a painting competition.","collocation[15]":"run a competition","example[30]":"The company is running an inventions competition with a first prize of £1,000.","collocation[16]":"launch a competition","example[31]":"We’re launching a competition to find the best young designer.","collocation[17]":"judge a competition","example[32]":"A panel of five will judge the competition.","collocation[18]":"withdraw from a competition","example[33]":"He had to withdraw from the competition because of an injury.","collocation[19]":"be out of a competition","example[34]":"Our team scored the fewest points so we were out of the competition.","collocation[20]":"put/knock somebody out of a competition","example[35]":"They put us out of the competition in the semi-final last year.","form[0]":"ADJECTIVES/NOUN + competition","collocation[21]":"a football/music/essay etc competition","example[36]":"There’s a music competition in the town on June 12th.","collocation[22]":"a writing/painting/dancing etc competition","example[37]":"Greg won the school public-speaking competition.","collocation[23]":"a sporting/sports competition","example[38]":"There is an increasing demand to watch sporting competitions.","collocation[24]":"a national/international/European etc competition","example[39]":"Her oldest daughter has taken part in national competitions.","collocation[25]":"an annual competition","example[40]":"Last year he won the magazine’s annual photo competition.","collocation[26]":"an open competition","example[41]":"An open competition is to be held at the tennis club.","collocation[27]":"a knock-out competition","collocation[28]":"a newspaper competition","example[42]":"I entered a newspaper competition for young photographer of the year.","collocation[29]":"the result of a competition","example[43]":"The result of the competition will be announced on April 3rd.","collocation[30]":"the winner of a competition","example[44]":"Jane was the clear winner of the competition.","collocation[31]":"the rules of a competition","example[45]":"Make sure you understand the rules of the competition.","collocation[32]":"a competition is open to somebody","example[46]":"The competition is open to artists between 16 and 25 years old.","definition[3]":"an organized event in which people or teams compete against each other, especially in order to win a prize","example[47]":"My sister entered a dance competition.","example[48]":"The winner of the competition will be announced in June.","display[0]":"contest","definition[4]":"a competition in which people do an activity, and a group of judges decide the winner","example[49]":"a beauty contest","example[50]":"a contest to find America’s strongest man","display[1]":"championship","definition[5]":"an important sports competition to find the best player or team in the world or in a particular area","example[51]":"the European Athletics Championship","example[52]":"Brazil went on to win the world championship.","display[2]":"tournament","definition[6]":"a competition in a sport or game, in which many players or teams compete against each other until there is one winner","example[53]":"a golf tournament","display[3]":"quiz","definition[7]":"a competition in which people have to answer questions","example[54]":"a TV quiz show","heading[2]":"part of a competition","display[4]":"round","definition[8]":"one of the parts of a competition that you have to finish or win before you can go on to the next part","example[55]":"Henman lost in the second round of the competition.","display[5]":"heat","definition[9]":"one of several races or competitions whose winners then compete against each other","example[56]":"She came second in her heat, with a time of 23.2 seconds.","definition[10]":"a situation in which businesses are trying to be more successful than others by selling more goods and services and making more profit","example[57]":"Competition between the two cable companies has driven down the price for program services.","example[58]":"They sell everything from food to furniture to fashion, often in direct competition with nearby stores.","example[59]":"The company faces stiff competition from Japanese luxury brands.","definition[11]":"all the businesses that compete with a particular business, seen as a group","example[60]":"In the past, Honda has kept ahead of the competition because it was small and fast."}