{"word[0]":"means","definition[0]":"a way of doing or achieving something","example[0]":"For most people, the car is still their main means of transport.","example[1]":"The only means of communication was sign language.","example[2]":"The window was our only means of escape.","example[3]":"Do you have any means of identification?","example[4]":"art as a means of expression","example[5]":"Homework should not be used as a means of controlling children.","example[6]":"I had no means of telling him I would be late.","example[7]":"Brian was prepared to use any means  to get what he wanted.","example[8]":"They had entered the country by unlawful means.","example[9]":"the means by which performance is assessed","definition[1]":"the money or income that you have","example[10]":"Paying for your children to go to a private school is beyond the means of most people  (=too expensive for most people).","example[11]":"Try to live within your means (=only spending what you can afford).","example[12]":"His father was a man of means (=a rich man).","example[13]":"I don’t have the means to support a family.","note[0]":"have the means to do something","collocation[0]":"an effective/efficient means","example[14]":"Speed bumps are an effective means of stopping cars from going too fast.","collocation[1]":"a useful means","example[15]":"Local radio is a useful means of advertising.","collocation[2]":"the only means","example[16]":"Then, horses and carts were the only means of transport available.","collocation[3]":"the best means","example[17]":"Is this really the best means of achieving our goal?","collocation[4]":"an important means","example[18]":"Surveys are an important means of gathering information.","collocation[5]":"lawful/legal  means","example[19]":"Their protests will continue, but only by legal means.","collocation[6]":"unlawful/illegal means","example[20]":"He was accused of attempting to overthrow the government using unlawful means.","collocation[7]":"unfair means","example[21]":"Anyone trying to use unfair means in an examination will be reported to the University.","collocation[8]":"a means of transport","example[22]":"The tram is an efficient means of transport.","collocation[9]":"a means of communication","example[23]":"Newspapers are still an important means of communication.","collocation[10]":"a means of expression","example[24]":"Music and art are important means of expression.","collocation[11]":"a means of identification","collocation[12]":"the means of production","example[25]":"the class of people which owns the means of production","collocation[13]":"the end justifies the means","example[26]":"It’s too bad if people get hurt - the end justifies the means.","collocation[14]":"a means to an end","example[27]":"Many of the students saw the course as a means to an end:  a way of getting a good job.","collocation[15]":"(whether) by fair means or foul","example[28]":"They were determined to achieve victory, by fair means or foul.","collocation[16]":"have no/any/some means of doing something","example[29]":"There was no path, and they had no means of knowing where they were.","collocation[17]":"use any/every means to do something","example[30]":"He will use any means to get what he wants.","definition[2]":"the money and resources that a person or organization has available","example[31]":"Large corporations have the means to pay large fines without suffering hardship.","note[1]":"means to do something","example[32]":"The group has limited means.","example[33]":"young families and people of modest means","example[34]":"Improving the lot of the poor was beyond the city’s financial means."}