{"word[0]":"objective","definition[0]":"something that you are trying hard to achieve, especially in business or politics","synonym[0]":"goal","example[0]":"He vowed to achieve certain objectives before the end of his presidency.","example[1]":"the best way to accomplish your objectives","example[2]":"The degree program has two main objectives.","example[3]":"Managers should set specific performance objectives for their teams.","example[4]":"The main objective was to improve children’s knowledge of geography.","example[5]":"A clear objective was set and adhered to.","example[6]":"One of your first business objectives should be to get your own office.","definition[1]":"a place that you are trying to reach, especially in a military attack","example[7]":"The 4th Division’s objective was a town 20 miles to the east.","collocation[0]":"have an objective","example[8]":"Our main objective is to reduce road accidents.","collocation[1]":"set an objective","example[9]":"Pupils should be encouraged to set their own objectives.","collocation[2]":"achieve/accomplish an objective","example[10]":"The policy should help us achieve our objective of reducing paper waste.","collocation[3]":"reach/meet an objective","example[11]":"We need to control spending in order to meet our financial objectives.","collocation[4]":"pursue an objective","example[12]":"War has always been a means of pursuing national objectives.","collocation[5]":"the main/principal objective","example[13]":"This research project has three main objectives.","collocation[6]":"the primary/prime objective","example[14]":"The primary objective of training is to improve performance.","collocation[7]":"a key objective","example[15]":"Their economic strategy was based on a number of key objectives.","collocation[8]":"a clear objective","example[16]":"A manager must give his team clear objectives to work towards.","collocation[9]":"a specific objective","example[17]":"Most classroom activities have a specific learning objective.","collocation[10]":"a stated objective","example[18]":"The city’s stated objective was to improve housing in the area.","collocation[11]":"a common objective","example[19]":"Our employees have a sense of common objectives and their commitment is high.","collocation[12]":"an economic/military/business/political etc objective","example[20]":"We have made good progress towards meeting our business objectives.","collocation[13]":"aims and objectives","example[21]":"The department should clearly state its aims and objectives.","definition[2]":"based on facts, or making a decision that is based on facts rather than on your feelings or beliefs","opposite[0]":"subjective","example[22]":"Scientists need to be objective when doing research.","example[23]":"It’s hard to give an objective opinion about your own children.","note[0]":"objective assessment/measurement/description etc","example[24]":"the importance of a completely objective, independent press","note[1]":"purely/totally/completely objective","definition[3]":"existing outside the mind as something real, not only as an idea","example[25]":"The world has an objective reality.","definition[4]":"something that you are trying to achieve","synonym[1]":"AIM","example[26]":"Our objective is to grow earnings at about 6% a year.","example[27]":"An estimated 86% of products failed to reach their business objectives.","example[28]":"a client’s investment objectives","definition[5]":"not influenced by your own needs, wishes, or situation","example[29]":"An analyst’s role is to provide an informed, objective opinion regarding the future of a company."}