{"word[0]":"Hello!","definition[0]":"a British magazine with pictures and articles about famous people, such as film actors, fashion models, and members of the aristocracy. It typically describes how happy these people are and shows what beautiful houses they live in.","definition[1]":"used as a greeting when you see or meet someone","example[0]":"Hello, John! How are you?","example[1]":"Stanley, come and say hello to your nephew.","example[2]":"Well, hello there! I haven’t seen you for ages.","explanation[0]":"In everyday English, in informal situations, people often say hi rather than hello:","example[3]":"“Hi, Karen.” “Hi, Richard. How are things with you?”","definition[2]":"used when answering the telephone or starting a telephone conversation","example[4]":"Hello – may I speak to Anne?","definition[3]":"used when calling to get someone’s attention","example[5]":"Hello! Is there anybody home?","definition[4]":"used when you think someone is not acting sensibly or has said something stupid","example[6]":"You didn’t remember her birthday? Hello!","definition[5]":"used to show that you are surprised or confused by something","example[7]":"Hello! What’s happened here?","display[0]":"hello","definition[6]":"used when you meet someone, or when you start a telephone conversation. In everyday English, most people usually say hi because it sounds more friendly. You use hello especially when talking to people you do not know well, or to older people","example[8]":"Hello. Could I speak to someone in customer service, please?","example[9]":"Hello, Mrs Jones. How are you?","display[1]":"hi","definition[7]":"used as a friendly greeting when you meet someone start a telephone conversation, or at the beginning of an email","example[10]":"Hi, Gwen – did you have a nice weekend?","example[11]":"Hi everybody.","display[2]":"hey","definition[8]":"used as a friendly greeting when you see someone you know well and you want to start talking to them","example[12]":"Hey, Scott! What’s up, buddy?","display[3]":"hiya","definition[9]":"used as a very informal greeting when speaking to someone you know well","example[13]":"Hiya, Jake. How’s it going?","display[4]":"good morning/good afternoon/good evening","definition[10]":"used when meeting someone at a particular time of day. In everyday English, people usually just say Morning!, Afternoon! etc","example[14]":"Good morning, class!","example[15]":"Morning everyone. Sorry I’m late.","example[16]":"Good afternoon, Mr Smith.","display[5]":"how are you?","definition[11]":"used when you are greeting someone and starting a conversation","example[17]":"How’s it going Tom? I haven’t seen you for ages.","example[18]":"Hi Helen. How are you doing? Is the new job going well?","display[6]":"how do you do?","definition[12]":"used when you meet someone for the first time, especially after you have just been told their name. How do you do sounds very formal. These days in everyday English, people often say hi when meeting someone for the first time","example[19]":"‘John, I’d like you to meet our new project manager, Nisha Patel.’ ‘How do you do?’","display[7]":"pleased/good/nice to meet you","definition[13]":"used when you meet someone for the first time and have just been told their name","example[20]":"‘Richard, this is my brother Ronnie.’ ‘Nice to meet you, Ronnie.’","example[21]":"‘My name is Lena Curtis.’ ‘Pleased to meet you, I’m David Bennet.’","example[22]":"Mrs Parrish, it’s good to meet you after hearing Lynn talk so much about you."}