{"word[0]":"pitch","signpost[0]":"sports field","definition[0]":"a marked out area of ground on which a sport is played","synonym[0]":"field","example[0]":"He ran the length of the pitch and scored.","example[1]":"the world-famous Wembley football pitch","note[0]":"football/cricket/rugby etc pitch","example[2]":"Jack was on the pitch for his school in the Senior Cup Final.","note[1]":"on the pitch","signpost[1]":"strong feelings/activity","definition[1]":"a strong level of feeling about something or a high level of an activity or a quality","example[3]":"The controversy reached such a pitch (=become so strong) that the paper devoted a whole page to it.","example[4]":"The goal roused the crowd to fever pitch (=a very excited level).","example[5]":"He screamed at her in a pitch of fury.","note[2]":"a pitch of excitement/excellence/perfection etc","definition[2]":"how high or low a note or other sound is","example[6]":"Ultrasonic waves are at a higher pitch than the human ear can hear.","definition[3]":"the ability of a musician to play or sing a note at exactly the correct level","example[7]":"She’s got perfect pitch.","signpost[2]":"persuading","definition[4]":"the things someone says to persuade people to buy something, do something, or accept an idea","example[8]":"an aggressive salesman with a fast-talking sales pitch","example[9]":"He made his strongest pitch yet for standardized testing in schools.","note[3]":"make a/somebody’s pitch (for something)","signpost[3]":"baseball","definition[5]":"a throw of the ball, or a way in which it can be thrown","example[10]":"His first pitch was high and wide.","signpost[4]":"black substance","definition[6]":"a black sticky substance that is used on roofs, the bottoms of ships etc to stop water coming through","example[11]":"The night was as black as pitch (=very dark).","signpost[5]":"ship/aircraft","definition[7]":"an up and down movement of a ship or an aircraft","example[12]":"the pitch and roll of the ship","signpost[6]":"slope","definition[8]":"the degree to which a roof slopes or the sloping part of a roof","example[13]":"the steep pitch of the roof","signpost[7]":"street/market","definition[9]":"a place in a public area where someone goes to sell things or where an entertainer goes to perform","example[14]":"We found the boy at his usual pitch at the bottom of the Acropolis.","definition[10]":"to throw something with a lot of force, often aiming carefully","example[15]":"She crumpled up the page and pitched it into the fire.","signpost[8]":"ball games","definition[11]":"to aim and throw a ball in baseball","example[16]":"Stanton pitched to two batters in the ninth inning.","note[4]":"pitch to","definition[12]":"if a ball pitches in cricket or golf, it hits the ground","definition[13]":"to hit the ball in a high curve in golf","definition[14]":"to make the ball hit the ground when you are bowling in cricket","definition[15]":"to fall or be moved suddenly in a particular direction, or to make someone or something do this","example[17]":"She slipped and pitched forward onto the ground.","note[5]":"pitch (somebody/something) forward/backward/over etc","example[18]":"Without a seat belt, you can easily be pitched right through the windscreen.","note[6]":"pitch somebody/something into/onto/through etc something","signpost[9]":"ship/plane","definition[16]":"if a ship or an aircraft pitches, it moves up and down in an uncontrolled way with the movement of the water or air","signpost[10]":"set a level","definition[17]":"to set a speech, examination, explanation etc at a particular level of difficulty","example[19]":"Some questions were pitched too high for intermediate students.","example[20]":"You have to pitch your writing at the right level.","note[7]":"pitch something at a high level/the right level etc","definition[18]":"to set prices at a particular level","example[21]":"Room rates are pitched at £69 for a single.","note[8]":"be pitched at something","signpost[11]":"aim product","definition[19]":"to aim a product at a particular type of organization, group of people etc, or to describe it in a particular way, in order to sell it","example[22]":"The new machine will be pitched at users in the hotel and air reservation business.","note[9]":"be pitched at somebody/something","example[23]":"It is pitched as a cheaper alternative to other workstations.","note[10]":"be pitched as something","explanation[0]":"Pitch is usually passive in this meaning","signpost[12]":"business deals","definition[20]":"to try to persuade someone to do business with you, buy something etc","example[24]":"sales reps pitching new gadgets","example[25]":"Booksellers are keen to pitch for school business.","note[11]":"pitch for business/contracts/custom etc","example[26]":"For many companies, pitching to investors has become almost a full-time job.","signpost[13]":"voice/music","definition[21]":"if you pitch your voice or another sound at a particular level, the sound is produced at that level","example[27]":"Her voice is pitched a little too high.","note[12]":"pitch something high/low etc","definition[22]":"to slope down","example[28]":"The roof pitches sharply to the rear of the house.","note[13]":"pitch gently/steeply etc","definition[23]":"what a sales person says about a product to persuade people to buy it","definition[24]":"an attempt by an ADVERTISING AGENCY to persuade a company to use its services to advertise a product","example[29]":"Each agency made its pitch.","definition[25]":"a place in a public area where a street trader goes to sell things","example[30]":"Prices for the new trucks are pitched very competitively.","definition[26]":"to try to make a business agreement, or to sell something in a particular way","example[31]":"sales reps pitching the latest gadgets","example[32]":"The resort is being pitched as a conference venue.","example[33]":"The luxury clothing retailer has invited a number of agencies to pitch for its estimated £1.5 million international business.","note[14]":"pitch for"}