{"word[0]":"partnership","definition[0]":"the state of being a partner in business","example[0]":"She’s gone into partnership with two local doctors.","example[1]":"I’ve been in partnership with her for five years.","note[0]":"be/work in partnership (with somebody)","definition[1]":"a business owned by two or more people","example[2]":"It’s one of the most successful partnerships in the country.","definition[2]":"a relationship between two people, organizations, or countries","example[3]":"Several youth charities have formed a partnership to help these homeless teenagers.","example[4]":"The close partnership between Britain and the US will continue.","note[1]":"partnership between","heading[0]":"– Meaning 3: a relationship between two people, organizations, or countries","collocation[0]":"form a partnership","example[5]":"They formed a partnership solely to enter the competition.","collocation[1]":"forge a partnership","example[6]":"He has forged a highly successful partnership with the Dublin singer Frances Black.","collocation[2]":"develop a partnership","example[7]":"Developing international partnerships is vital to our continued success.","collocation[3]":"a working partnership","example[8]":"Theirs is one of the most fruitful working partnerships in modern science.","collocation[4]":"a close partnership","example[9]":"The two companies have built up a close partnership over the past four years.","collocation[5]":"an effective partnership","example[10]":"The agency tries to forge effective partnerships with communities and private businesses.","collocation[6]":"a successful partnership","example[11]":"We are looking forward to a successful partnership.","collocation[7]":"a good partnership","example[12]":"It’s a good partnership and we think it’s going to get better.","collocation[8]":"an equal partnership","example[13]":"They regard marriage as an equal partnership.","definition[3]":"a relationship between two people, organizations, or countries that work together","example[14]":"the partnership between US capital and Mexican labor","definition[4]":"the situation of working together in business","example[15]":"Biogen developed the drug, which is marketed in partnership with another company.","example[16]":"He went into partnership with the owner of a cement factory.","definition[5]":"a business organization made up of a group of accountants, lawyers etc who work together, or of a group of investors","example[17]":"the Canadian partnership of the accounting firm PriceWaterhouseCooper","example[18]":"Prime sold a 65% stake in Howard Johnson to aninvestment partnership for $200 million."}