{"word[0]":"exile","definition[0]":"a situation in which you are forced to leave your country and live in another country, especially for political reasons","example[0]":"He spent many years in enforced exile.","example[1]":"The house was raided and the family was forced into exile.","note[0]":"force/drive somebody into exile","example[2]":"She had been in voluntary exile since 1990.","note[1]":"voluntary/self-imposed exile","example[3]":"a writer now living in exile","note[2]":"in exile","example[4]":"He went into exile to escape political imprisonment.","definition[1]":"someone who has been forced to live in exile","example[5]":"political exiles","collocation[0]":"go into exile","example[6]":"Napoleon's wife and sons also went into exile.","collocation[1]":"live in exile","example[7]":"The Guatemalan writer has lived in exile in Mexico for over 40 years.","collocation[2]":"be sent into exile","example[8]":"The old leaders were removed from power and sent into exile.","collocation[3]":"be forced/driven into exile","example[9]":"Many of his political opponents have been forced into exile.","collocation[4]":"flee/escape into exile","example[10]":"Hundreds of people fled into exile or were jailed.","collocation[5]":"die in exile","example[11]":"He never returned to his own country, but died in exile.","collocation[6]":"return from exile","example[12]":"Martinez returned from exile to the islands in May 1990 and was later elected president.","collocation[7]":"long exile","example[13]":"The first of many refugees have finally returned home from a long exile in Senegal.","collocation[8]":"permanent exile","example[14]":"The King threatened her with permanent exile.","collocation[9]":"self-imposed/voluntary exile","example[15]":"He spoke to the media from his self-imposed exile in the United States.","collocation[10]":"enforced exile","example[16]":"After 12 years of enforced exile abroad, Almeyda returned home to Salvador.","collocation[11]":"internal exile","example[17]":"The governor has the power to send people into internal exile in other regions.","definition[2]":"to force someone to leave their country, especially for political reasons","example[18]":"the exiled former president","example[19]":"Several of the leaders were arrested and exiled to France.","note[3]":"be exiled to something","example[20]":"a dictator who was exiled from his home country","note[4]":"be exiled from something","explanation[0]":"Exile is usually passive"}