{"word[0]":"separate","definition[0]":"different","example[0]":"Use separate knives for raw and cooked meat.","example[1]":"My wife and I have separate bank accounts.","definition[1]":"not related to or not affected by something else","example[2]":"That’s a separate issue.","example[3]":"He was attacked on two separate occasions.","example[4]":"He tries to keep his professional life completely separate from his private life.","note[0]":"separate from","definition[2]":"not joined to or touching something else","example[5]":"The gym and the sauna are in separate buildings.","example[6]":"Keep the fish separate from the other food.","signpost[0]":"be between","definition[3]":"if something separates two places or two things, it is between them so that they are not touching each other","example[7]":"The lighthouse is separated from the land by a wide channel.","note[1]":"separate something from something","signpost[1]":"divide","definition[4]":"to divide or split into different parts, or to make something do this","example[8]":"This will keep your dressing from separating.","example[9]":"First, separate the eggs (=divide the white part from the yellow part).","example[10]":"At this point, the satellite separates from its launcher.","example[11]":"Separate the students into four groups.","note[2]":"separate something into something","signpost[2]":"stop living together","definition[5]":"if two people who are married or have been living together separate, they start to live apart","example[12]":"Jill and John separated a year ago.","example[13]":"I decided to separate from my partner.","explanation[0]":"Separate is a reciprocal verb This type of verb is used when saying that two or more people or things do something that involves both or all of them","example[14]":"She and her husband separated","example[15]":"She separated from her husband","example[16]":"She and her husband separated from each other","signpost[3]":"recognize difference","definition[6]":"to recognize that one thing or idea is different from another","example[17]":"She finds it difficult to separate fact from fantasy.","signpost[4]":"move apart","definition[7]":"if people separate, or if someone or something separates them, they move apart","example[18]":"Ed stepped in to separate the two dogs.","example[19]":"In the fog, they got separated from the group.","note[3]":"separate somebody from somebody/something","signpost[5]":"make somebody/something different","definition[8]":"to be the quality or fact that makes someone or something different from other people or things","example[20]":"The capacity to think separates humans from animals.","signpost[6]":"better/older","definition[9]":"if an amount separates two things, one thing is better or older than the other by that amount","example[21]":"Three points now separate the two teams.","heading[0]":"to make something separate","definition[10]":"to divide something into two or more parts or groups, or to divide one type of thing from another. You use separate especially when saying that the parts are different from each other","example[22]":"Motorola is planning to separate the company into two public companies.","example[23]":"The items are separated into recyclable and non-recyclable waste.","definition[11]":"to make something become two or more parts or groups","example[24]":"The teacher divided us into groups.","example[25]":"The money was divided between them.","example[26]":"The house is divided into three apartments.","definition[12]":"to separate something into two or more groups, parts etc – used especially when each part is equal in size","example[27]":"The class was split into groups of six.","display[0]":"break something up","definition[13]":"to separate something into several smaller parts, especially to make it easier to deal with","example[28]":"The phone company was broken up to encourage competition.","example[29]":"Police used tear gas to break up the crowd.","display[1]":"segregate","definition[14]":"to separate one group of people from others because of race, sex, religion etc","example[30]":"Schools were racially segregated.","example[31]":"Some prisons segregate prisoners who are infected with HIV.","heading[1]":"to become separate","definition[15]":"to divide into different parts, especially in a natural way","example[32]":"A watery liquid separates from the milk during cheesemaking.","definition[16]":"to separate into two or more parts or groups – used especially when each part is equal in size","example[33]":"What happens when an atom splits?","display[2]":"break up","definition[17]":"to separate into several smaller parts","example[34]":"In spring, the icebergs begin to break up.","definition[18]":"things that are separate are not connected or related to each other in any way","example[35]":"The finance team left to start aseparate company.","example[36]":"Many advertisers are running ads for two or more separate products.","definition[19]":"if something is sent under separate cover, it is sent through the post in a different envelope from other documents","example[37]":"The information you requested is being sent under separate cover.","definition[20]":"to divide something into two or more parts, or to cause something to be divided into two parts","example[38]":"The decision toseparate the business reflects the management’s current marketing strategy.","example[39]":"Rising competition separates the strong from the weak."}