{"word[0]":"booking","definition[0]":"an arrangement to travel by train, use a hotel room etc at a particular time in the future","note[0]":"block booking (=a booking for a large number of dates, seats, rooms etc)","example[0]":"bookings on cruise ships","example[1]":"I made a booking for two double rooms.","example[2]":"I’m calling to confirm my booking  (=say definitely that I want to travel etc).","example[3]":"If you cancel your booking, there will be a small charge.","example[4]":"Places on the course are limited and advance booking is essential.","definition[1]":"an arrangement made by a performer to perform at a particular time in the future","definition[2]":"the act of writing a football player’s name in a book as a punishment for breaking the rules","collocation[0]":"make a booking","example[5]":"Your travel agent will make your booking for you.","collocation[1]":"confirm a booking","example[6]":"Please confirm your booking 48 hours before your flight.","collocation[2]":"cancel a booking","example[7]":"If you wish to cancel your booking, you must do it in writing.","collocation[3]":"accept a booking","example[8]":"Bookings can only be accepted on receipt of a deposit.","form[0]":"ADJECTIVES/NOUN + booking","collocation[4]":"advance booking","example[9]":"The cinema charges 50p a ticket for advance booking.","collocation[5]":"early booking","example[10]":"Early booking is recommended because places are limited.","collocation[6]":"late booking","example[11]":"There are cash penalties for late booking.","collocation[7]":"a holiday booking","example[12]":"I had an email confirming our holiday booking.","collocation[8]":"a group booking/block booking","example[13]":"There's a 20% discount for group bookings.","form[1]":"booking + NOUN","collocation[9]":"a booking form","example[14]":"You can complete the booking form online.","collocation[10]":"a booking fee","example[15]":"Ticket agencies may charge a booking fee.","collocation[11]":"booking conditions","example[16]":"In the event of a cancellation, a refund will be offered according to the terms of our booking conditions.","collocation[12]":"a booking hall/office","example[17]":"There were long queues in the booking hall.","definition[3]":"an arrangement in which a place on a plane, in a hotel, restaurant etc is kept for a customer who will arrive later","synonym[0]":"RESERVATION","example[18]":"There’s a problem over a double booking (=one where two people have been given the same booking) and you’re being offered a different room."}