{"word[0]":"race","definition[0]":"a competition in which people or animals compete to run, drive etc fastest and finish first","example[0]":"He will be the youngest runner in the race.","note[0]":"in a race","example[1]":"Over 80 cars will take part in the race.","example[2]":"the annual boat race between Oxford and Cambridge Universities","note[1]":"race between","definition[1]":"one of the main groups that humans can be divided into according to the colour of their skin and other physical features","example[3]":"The school welcomes children of all races.","example[4]":"a person of mixed race","example[5]":"The law forbids discrimination on the grounds of race or religion.","definition[2]":"a group of people who are similar in some way","example[6]":"The 1960s produced a new race of young novelists.","note[2]":"race of","example[7]":"Are schools breeding  (=producing) a race of children incapable of making decisions for themselves?","signpost[0]":"get/do something first","definition[3]":"a situation in which one group of people tries to obtain or achieve something before another group does","example[8]":"The race is on to develop more environmentally friendly forms of energy.","example[9]":"More and more drug companies are joining the race to beat cancer.","note[3]":"the race to do something","signpost[1]":"do something quickly","definition[4]":"a situation in which you have to do something very quickly because you have very little time available","example[10]":"The pilot then began a desperate race against time to land the plane before it ran out of fuel.","note[4]":"race against time/against the clock","example[11]":"It is now a race to find the killer.","note[5]":"a race to do something","signpost[2]":"prize/power","definition[5]":"a situation in which people are competing with each other to win a prize or obtain a position of power","example[12]":"Mr Bird has now officially joined the race for the White House.","note[6]":"race for","example[13]":"He is no longer in the race for academic awards.","example[14]":"the race to host the next Olympic Games","note[7]":"race to do something","heading[0]":"– Meaning 1: a competition in which people or animals compete to run, drive etc fastest and finish first","collocation[0]":"compete in a race","example[15]":"He is competing in his first race this year.","example[16]":"Runners from all over the world will take part in the race.","collocation[1]":"have a race","example[17]":"Let’s have a race!","collocation[2]":"hold a race","example[18]":"The race will be held on February 25th.","collocation[3]":"win/lose a race","example[19]":"He did not win another race that season.","collocation[4]":"come first/last etc in a race","example[20]":"She came third in the race.","collocation[5]":"lead the race","example[21]":"He led the race from start to finish.","collocation[6]":"finish the race","example[22]":"Congratulations to Matthew, who finished the race in three hours 17 minutes.","collocation[7]":"run a race","example[23]":"I thought I ran a good race.","collocation[8]":"enter somebody/something in a race","example[24]":"The horse is entered in a race at Worcester the day after tomorrow.","form[0]":"ADJECTIVES/NOUN + race","collocation[9]":"tough/hard","example[25]":"He said he expected the race to be tough.","collocation[10]":"the big race","example[26]":"There are only three days to go until the big race.","collocation[11]":"a 3000 metres/10 km etc race","example[27]":"He finished first in the 100 metres race.","collocation[12]":"a horse/boat/bike etc race","example[28]":"It’s legal to gamble on horse races.","collocation[13]":"a road race","example[29]":"She regularly competes in 10 kilometre road races.","heading[1]":"– Meaning 5: a situation in which people are competing with each other to win a prize or obtain a position of power","collocation[14]":"enter/join the race","example[30]":"There was speculation that another candidate might enter the race.","collocation[15]":"drop out of/withdraw from the race","example[31]":"He dropped out of the presidential race three weeks ago.","collocation[16]":"stay in the race","example[32]":"Forbes has the money to stay in the mayoral race as long as he likes.","collocation[17]":"win a race","example[33]":"It looks as though he will win the race to be the Democratic presidential candidate.","collocation[18]":"close/tight","example[34]":"Most people were predicting a close race.","collocation[19]":"a three-horse/three-way race","example[35]":"In a three-way race, Clinton received 47 percent, Dole 35 percent, Perot 10 percent.","collocation[20]":"a two-horse/two-way race","example[36]":"It soon became clear that it would be a two-horse race.","collocation[21]":"a one-horse race","example[37]":"This is turning into a one-horse race.","collocation[22]":"a presidential/Senate/mayoral race","example[38]":"He put $12 million of his own money into a Senate race.","collocation[23]":"be still in the race","example[39]":"Swindon Town is still in the race, despite losing to Manchester City on Saturday.","definition[6]":"one of the main groups of people in the world, who have the same colour of skin and other physical features","example[40]":"Everybody should be treated equally regardless of their race or sex.","example[41]":"race relations (=the relationship between people of different races)","display[0]":"nation","definition[7]":"a country and its people, or a group of people with the same history and language","example[42]":"Japan has become one of the richest nations in the world.","example[43]":"Our dream is for a united Arab nation.","definition[8]":"the people who belong to a particular country, race, or area. The plural of this meaning of people is peoples","example[44]":"the American people","example[45]":"the native peoples of the islands","display[1]":"tribe","definition[9]":"a group of people in a country who are the same race, with the same traditional way of life and the same leader","example[46]":"a tribe in Papua New Guinea","example[47]":"Bedouin tribes","display[2]":"ethnic group","definition[10]":"a group of people of the same race, nation, or tribe","example[48]":"Within Namibia there are more than a dozen different ethnic groups.","example[49]":"the needs of minority ethnic groups","definition[11]":"to compete against someone or something in a race","example[50]":"She’ll be racing against some of the world’s top athletes.","note[8]":"race against","example[51]":"Stevens will not be racing in the final due to a knee injury.","note[9]":"race in","example[52]":"I’ll race you to the end of the road.","note[10]":"race somebody up/down something etc","definition[12]":"to use an animal or a vehicle to compete in a race","example[53]":"He will be racing a Ferrari in this year’s Formula One championships.","signpost[3]":"move quickly","definition[13]":"to move very quickly or take someone or something to a place very quickly","example[54]":"He raced into the village on his bike.","example[55]":"I had to race home for my bag.","example[56]":"She was raced to hospital.","note[11]":"race somebody to something etc","example[57]":"He raced to meet her.","definition[14]":"to try to do something very quickly because you want to be the first to do it, or because there is very little time available","example[58]":"The astronauts are racing against time to repair the spaceship.","note[12]":"race against time/the clock","example[59]":"Investors are racing to buy shares in the new hi-tech companies.","signpost[4]":"heart/mind","definition[15]":"if your heart or mind races, it works harder and faster than usual, for example because you are afraid or excited","example[60]":"My heart was racing and my knees shook uncontrollably.","example[61]":"My mind was racing, trying to think where I had seen him before.","signpost[5]":"engine","definition[16]":"if an engine races, it runs too fast"}