{"word[0]":"sign","signpost[0]":"gives information","definition[0]":"a piece of paper, metal, or wood with words or a picture that gives people information, warnings, or instructions","example[0]":"a sign on the door","example[1]":"road signs","example[2]":"a no smoking sign","example[3]":"Don’t ignore the fog warning signs.","signpost[1]":"shows something is true","definition[1]":"an event, fact etc that shows that something is happening or that something is true or exists","synonym[0]":"indication","example[4]":"A paw print in the dust was a sign that a tiger was close.","example[5]":"There are signs that the situation is improving.","example[6]":"There were no signs of forced entry into the house.","example[7]":"A red morning sky is a sign of an impending storm.","note[0]":"sign of","example[8]":"Crying is seen as a sign of weakness.","signpost[2]":"movement or sound","definition[2]":"a movement, sound etc that you make in order to tell someone something","example[9]":"the thumbs-up sign  (=a sign that you make with your hand to show that something is successful)","example[10]":"Wait until I give the sign.","note[1]":"give/make a sign","example[11]":"Bruce made a sign that he was ready to leave.","note[2]":"sign that","example[12]":"Three short blasts on the whistle was the sign to begin.","note[3]":"sign (for somebody) to do something","signpost[3]":"symbol","definition[3]":"a mark or shape that has a particular meaning","example[13]":"the dollar sign","example[14]":"a minus sign","signpost[4]":"star sign","definition[4]":"a group of stars, representing one of 12 parts of the year, that some people believe influences your behaviour and your life","example[15]":"What sign are you?","definition[5]":"a language that uses hand movements instead of spoken words, used by people who cannot hear","synonym[1]":"sign language","heading[0]":"– Meaning 2: an event, fact etc that shows that something is happening or that something is true or exists","form[0]":"ADJECTIVES/NOUN + sign","collocation[0]":"a clear/obvious/unmistakable sign","example[16]":"There are clear signs of a slowdown in economic growth.","collocation[1]":"a sure sign","example[17]":"He was walking up and down, a sure sign that he was worried.","collocation[2]":"a good/positive/encouraging/hopeful sign","example[18]":"If she can move her legs, that’s a good sign.","collocation[3]":"a bad/ominous sign","example[19]":"The jury was taking ages to make up its mind, which he felt was probably a bad sign.","collocation[4]":"an outward/visible sign","example[20]":"Kim received the news without showing any visible sign of emotion.","collocation[5]":"a warning sign","example[21]":"In this case, social workers missed the warning signs and failed to protect the children.","collocation[6]":"a telltale/tell-tale sign","example[22]":"She would not look at me directly, a tell-tale sign that she was embarrassed.","collocation[7]":"the first sign of something","example[23]":"They ran off at the first sign of trouble.","collocation[8]":"an early sign","example[24]":"an early sign of spring","collocation[9]":"there are signs","example[25]":"There are now signs of an improvement in the economy.","collocation[10]":"have signs","example[26]":"It had all the signs of a crime of passion.","collocation[11]":"show signs of something","example[27]":"Did she show any signs of distress?","collocation[12]":"bear signs of something","example[28]":"The bed was neatly made and bore no signs of having been slept in.","collocation[13]":"see/detect signs of something","example[29]":"I could see some signs of improvement in her health.","example[30]":"The curtains were still drawn and there was no sign of activity.","example[31]":"A score of 80 or more is a sign that you are doing very well.","definition[6]":"a sign. Indication is more formal than sign","example[32]":"Recently there have been several indications of improving relations.","example[33]":"There was no indication the killings were related to the drug trade.","display[0]":"evidence","definition[7]":"facts or signs that show clearly that something exists or is true, especially something that you are trying to prove","example[34]":"Scientists are hoping to find evidence that there was once life on Mars.","example[35]":"There was not enough evidence to convict him of the murder.","display[1]":"symptom","definition[8]":"a sign that someone has an illness or that a serious problem exists","example[36]":"The first symptoms are tiredness and loss of weight.","example[37]":"Is this a symptom of the decay of Western civilization?","display[2]":"indicator","definition[9]":"a sign that shows you what is happening or what is true – used about a process, or about the state or level of something","example[38]":"There are a number of indicators of economic slowdown.","example[39]":"The tests are considered a good indicator of intelligence.","display[3]":"signal","definition[10]":"a sign that shows that you should do something, or that you have a particular attitude","example[40]":"Severe chest pain is a warning signal that cannot be ignored.","example[41]":"Legalizing drugs could send the wrong signal to young people.","definition[11]":"a sign, especially that you respect or honour someone","example[42]":"People stood in silence as a mark of respect.","example[43]":"It was a mark of her popularity that so many colleagues and friends attended the presentation.","signpost[5]":"name","definition[12]":"to write your signature on something to show that you wrote it, agree with it, or were present","example[44]":"Sign here, please.","example[45]":"The artist had signed his name in the corner of the painting.","example[46]":"You forgot to sign the cheque.","example[47]":"Over a hundred people have signed the petition.","example[48]":"Serena signs her autograph every time she’s asked.","example[49]":"a signed photo of Paul McCartney","signpost[6]":"music/sport","definition[13]":"if a football team or music company signs someone, or if someone signs for them, that person signs a contract in which they agree to work for them","example[50]":"CBS Records had signed her back in 1988 on a three-album contract.","example[51]":"Miller worked in the shipyards before signing for Rangers.","note[4]":"sign for/to/with","example[52]":"Before long, they had signed with Virgin.","signpost[7]":"use movements","definition[14]":"to try to tell someone something or ask them to do something by using signs and movements","example[53]":"He signed to the maid to leave the room.","note[5]":"sign to somebody to do something","example[54]":"She signed for us to go inside.","note[6]":"sign for somebody to do something","definition[15]":"to use, or translate something into, sign language","definition[16]":"to write your SIGNATURE on a letter, document, or CHEQUE","example[55]":"The customer must sign the traveller’s cheque in front of the cashier.","definition[17]":"to show formally that you agree to do something, by signing a legal document","example[56]":"In September, the company signed a contract to produce two million doses of the vaccine.","definition[18]":"with all the necessary legal documents agreed and signed","example[57]":"The agreement is not signed and sealed yet.","definition[19]":"a piece of paper, metal etc in a public place, with words or drawings on it that give people information, warn them not to do something etc","definition[20]":"a picture, shape etc that has a particular meaning","example[58]":"For some reason the computer can’t display the dollar sign."}