{"word[0]":"that","plural[0]":"those","definition[0]":"used to refer to a person, thing, idea etc that has already been mentioned or is already known about","example[0]":"‘You never cared about me.’ ‘That’s not true.’","example[1]":"I wish you wouldn’t say things like that.","example[2]":"What did you do with those sandwiches?","example[3]":"Victoria Street? That’s where my sister lives.","example[4]":"Do you remember that nice Mr Hoskins who came to dinner?","example[5]":"I’ve got that pain in my back again.","example[6]":"He killed a man once and that’s why he had to leave Ireland.","example[7]":"‘We’ve been cheated, ’ she said. Those were her exact words.","example[8]":"‘I have to go, ’ she said, and with that (=after saying that) she hung up the phone.","definition[1]":"/ðət/ used after a noun as a relative pronoun like ‘who’, ‘whom’, or ‘which’ to introduce a clause","example[9]":"There are lots of things that I need to buy before the trip.","example[10]":"the people that live next door","example[11]":"They’ve got a machine that prints names on badges.","example[12]":"the greatest boxer that ever lived","example[13]":"Who was it that said ‘The Law’s an Ass’?","example[14]":"The day that my father died, I was on holiday in Greece.","explanation[0]":"In everyday English, that is often omitted when it is the object of the relative clause","example[15]":"I like the clothes that she wears","example[16]":"I like the clothes she wears","explanation[1]":"You do not omit that when it is the subject of the clause","example[17]":"The family that lives downstairs is Polish","bad_example[0]":"The family lives downstairs is Polish","definition[2]":"used to refer to a particular person or thing of the general type that has just been mentioned","example[18]":"In my opinion, the finest wines are those from France.","example[19]":"His own experience was different from that of his friends.","note[0]":"that of","definition[3]":"used to refer to a person or thing that is not near you","example[20]":"Is that my pen you’ve got there?","example[21]":"That’s Eileen’s house across the road.","example[22]":"Look at those men in that car. What on earth are they doing?","example[23]":"Our tomatoes never get as big as that.","definition[4]":"used when you are not sure who is answering the telephone","example[24]":"Hello, is that Joan Murphy?","heading[0]":"USAGE: That, who, which","explanation[2]":"You use that as a relative pronoun when saying which person or thing you are talking about","example[25]":"This is the friend that I told you about","example[26]":"They didn't have the book that I wanted","explanation[3]":"That can be omitted","example[27]":"This is the friend I told you about","example[28]":"They didn't have the book I wanted","explanation[4]":"You use who or which when adding extra information about the person or thing","example[29]":"She looked after her husband, who was ill","example[30]":"I did it myself, which was difficult","explanation[5]":"In clauses like this, who or which can not be omitted","bad_example[1]":"She looked after her husband, that was ill","explanation[6]":"You use who when talking about a person  Don't use which about people","example[31]":"There's the man who I saw yesterday","bad_example[2]":"She looked after her husband, which was ill","explanation[7]":"You can also use that when talking about a person That is used about both people and things","example[32]":"There's the man that I saw yesterday","explanation[8]":"In clauses like this, both that and who can be omitted","example[33]":"There's the man I saw yesterday","definition[5]":"used after verbs, nouns, and adjectives to introduce a clause which shows what someone says or thinks, or states a fact or reason","example[34]":"If she said that she’d come, she’ll come.","example[35]":"I can’t believe that he’s only 17.","example[36]":"Are you sure that they live in Park Lane?","example[37]":"allegations that he is guilty of war crimes","example[38]":"The fact that he is your brother-in-law should not affect your decision.","example[39]":"He might have left the money for the simple reason that he didn’t know it was there.","explanation[9]":"In everyday English, that is often omitted Instead of saying , you say","example[40]":"I’m not surprised that you were upset","example[41]":"I’m not surprised you were upset","explanation[10]":"In formal English, that is used more often in this situation","definition[6]":"used after a phrase with ‘so’ or ‘such’ to introduce a clause that shows the result of something","example[42]":"I was so tired that I fell asleep.","example[43]":"The school was so badly damaged that it had to be pulled down.","example[44]":"We had been away for such a long time that I had forgotten her name.","definition[7]":"used to introduce a clause that refers to a fact, when describing it","example[45]":"It’s odd that I haven’t heard of you.","example[46]":"That anyone should want to kill her was unthinkable.","example[47]":"The problem is that no-one knows what will happen.","definition[8]":"in order that something may happen or someone may do something","example[48]":"Give us strength that we may stand against them.","definition[9]":"used to express a wish for something to happen or be true, especially when this is not possible","example[49]":"Oh, that she were alive to see this!","definition[10]":"used to say how big, how much etc, especially when you are showing the size, amount etc with your hands","example[50]":"It was quite a large fish – about that long.","example[51]":"He missed hitting the car in front by that much.","definition[11]":"as much as in the present situation or as much as has been stated","example[52]":"I’m sorry, I hadn’t realized the situation was that bad.","example[53]":"No one expected it to cost that much.","example[54]":"The advanced exam is more difficult, but not many students progress that far.","definition[12]":"used to emphasize how big, bad, much etc something is","example[55]":"I was that embarrassed I didn’t know what to say."}