{"word[0]":"conversation","definition[0]":"an informal talk in which people exchange news, feelings, and thoughts","example[0]":"a telephone conversation","example[1]":"Children quickly get bored by adult conversation.","example[2]":"They had a short conversation in German and seemed to be disagreeing about something.","example[3]":"It’s impossible to carry on a conversation with all this noise in the background.","example[4]":"‘Did you have a good journey?’ he said, trying to make conversation.","example[5]":"He was silent, no matter how hard Sofia tried to engage him in conversation.","example[6]":"After a while, the conversation turned to a friend’s coming wedding.","example[7]":"They were deep in conversation, relaxed and smiling.","example[8]":"He could hear snatches of conversation from across the room.","example[9]":"a short conversation with the teacher","note[0]":"conversation with","example[10]":"a conversation about family and friends","note[1]":"conversation about","example[11]":"I was having a conversation with a friend the other day.","example[12]":"Conversation wasn’t easy because of all the noise.","example[13]":"He overheard our conversation about the children.","display[0]":"discussion","definition[1]":"a conversation about something important","example[14]":"There was a lot of discussion about where the money was going to come from.","example[15]":"The two companies have been having discussions about a possible takeover.","definition[2]":"a long conversation, especially about a problem or about what you plan to do","example[16]":"We had a long talk about our relationship.","display[1]":"chat","definition[3]":"an informal friendly conversation","example[17]":"I’ve just had a chat with Vinnie.","display[2]":"natter","definition[4]":"a conversation with a friend about unimportant things","example[18]":"Mary and Jean were having a cup of tea and a natter.","definition[5]":"conversations in which people talk about things they have heard, especially about other people’s private lives, which may well not be true","example[19]":"She always enjoyed going to friends’ houses and having a gossip.","example[20]":"It’s all just gossip.","display[3]":"small talk","definition[6]":"polite friendly conversation about unimportant subjects, especially when you do not know someone very well and feel a little nervous","example[21]":"We stood around making small talk about the weather.","display[4]":"banter","definition[7]":"friendly conversation in which people joke with each other and gently make fun of each other","example[22]":"She enjoyed the friendly banter with her colleagues at the office."}