{"word[0]":"play","signpost[0]":"children","definition[0]":"when children play, they do things that they enjoy, often with other people or with toys","example[0]":"Kids were playing and chasing each other.","example[1]":"Parents need to spend time just playing with their children.","example[2]":"Outside, the children were playing cowboys and Indians.","note[0]":"play catch/house/tag/school etc","example[3]":"Did you like to play with dolls when you were little?","note[1]":"play with","signpost[1]":"sports/games","definition[1]":"to take part or compete in a game or sport","example[4]":"Karen began playing basketball when she was six.","example[5]":"If you feel any pain, you shouldn’t play.","example[6]":"Men were sitting in the park, playing cards.","example[7]":"She’s playing Helen Evans in the semi-final (=playing against her).","example[8]":"Bristol will play against Coventry next week.","note[2]":"play against","example[9]":"Moxon played for England in ten test matches.","note[3]":"play for","definition[2]":"to use a particular piece, card, person etc in a game or sport","example[10]":"Harrison played a ten of spades.","example[11]":"The Regents played Eddie at center  (=used him as a player in that position) in the game against Arizona.","definition[3]":"to take a particular position on a team","example[12]":"Garvey played first base for the Dodgers.","definition[4]":"to hit a ball in a particular way or to a particular place in a game or sport","example[13]":"She played the ball low, just over the net.","definition[5]":"to perform a piece of music on a musical instrument","example[14]":"He’s learning to play the piano.","example[15]":"She played a Bach prelude.","example[16]":"Haden has played with many jazz greats.","example[17]":"A small orchestra was playing.","signpost[2]":"radio/cd etc","definition[6]":"if a radio, CD etc plays, or if you play it, it produces sound, especially music","example[18]":"The bedside radio played softly.","example[19]":"DJs playing the latest house and techno tracks","note[4]":"play a record/CD/tape etc","signpost[3]":"theatre/film","definition[7]":"to perform the actions and say the words of a particular character in a theatre performance, film etc","example[20]":"Streep plays a shy, nervous woman.","example[21]":"Playing a character so different from herself was a challenge.","note[5]":"play a role/part/character etc","definition[8]":"if a play or film is playing at a particular theatre, it is being performed or shown there","example[22]":"‘Macbeth’ is playing at the Theatre Royal in York.","definition[9]":"if actors play a theatre, they perform there in a play","signpost[4]":"pretend","definition[10]":"to behave as if you are a particular kind of person or have a particular feeling or quality, even though it is not true","example[23]":"the accusation that scientists are playing God","example[24]":"Some snakes fool predators by playing dead.","example[25]":"‘What do you mean?’ ‘Don’t play dumb (=pretend you do not know something).'","example[26]":"Don’t play the innocent  (=pretend you do not know about something) with me – we both know what happened.","example[27]":"He played the fool (=behaved in a silly way) at school instead of working.","example[28]":"Susan felt she had to play the good wife.","note[6]":"play the idiot/the teacher etc","signpost[5]":"behave","definition[11]":"to behave in a particular way in a situation, in order to achieve the result or effect that you want","example[29]":"How do you want to play this meeting?","example[30]":"Play it safe (=avoid risks) and make sure the eggs are thoroughly cooked.","example[31]":"If you like him, play it cool, or you might scare him off.","note[7]":"play it carefully/cool etc","signpost[6]":"smile","definition[12]":"if a smile plays about someone’s lips, they smile slightly","definition[13]":"if light plays on something, it shines on it and moves on it","example[32]":"the sunlight playing on the water","definition[14]":"if a fountain plays, water comes from it","signpost[7]":"theatre","definition[15]":"a story that is written to be performed by actors, especially in a theatre","example[33]":"a play by Chekhov","example[34]":"This is a major theme of Miller’s plays.","example[35]":"Edward Bond’s play about class war","note[8]":"play about","signpost[8]":"amusement","definition[16]":"things that people, especially children, do for amusement rather than as work","example[36]":"Play is very important to a child’s development.","example[37]":"a play area","example[38]":"The program aims to teach road safety through play.","note[9]":"through play","example[39]":"the happy shouts of children at play","note[10]":"at play","signpost[9]":"effect","definition[17]":"the effect or influence of something","example[40]":"the free play of competition in the building industry","example[41]":"Political considerations do come into play (=have an effect) when making policy.","example[42]":"A complex system of muscles is brought into play for each body movement.","note[11]":"bring/put something into play","example[43]":"There are a number of factors at play  (=having an effect) in the current recession.","signpost[10]":"action in a game or sport","definition[18]":"the actions of the people who are playing a game or sport","example[44]":"Rain stopped play after only an hour.","definition[19]":"one particular action or set of actions during a game","example[45]":"On the next play, Johnson ran 15 yards for a touchdown.","signpost[11]":"looseness","definition[20]":"if there is some play in something, it is loose and can be moved","example[46]":"There’s too much play in the rope.","collocation[0]":"write a play","example[47]":"So far, he has written three plays.","collocation[1]":"go to (see) a play","example[48]":"While we were in New York, we went to a play.","collocation[2]":"see a play","example[49]":"I’ve never seen the play.","collocation[3]":"watch a play","example[50]":"Some of the audience were talking instead of watching the play.","collocation[4]":"perform a play","example[51]":"The play was performed by Brighton Youth Theatre.","collocation[5]":"act/perform/appear in a play","example[52]":"She acted in many plays on the London stage.","collocation[6]":"be in a play","example[53]":"Michael is currently in a play on Broadway.","collocation[7]":"do a play","example[54]":"Bob asked if I would do this play, and I agreed.","collocation[8]":"put on a play","example[55]":"The school puts on a Nativity play every Christmas.","collocation[9]":"direct a play","example[56]":"The play is directed by Paulette Randall.","collocation[10]":"produce/stage a play","collocation[11]":"rehearse a play","example[57]":"We spent weeks rehearsing the play.","collocation[12]":"a play opens","example[58]":"The play opens in San Francisco on Wednesday for a three-week run.","collocation[13]":"a play runs","example[59]":"The play ran for five months.","collocation[14]":"a play closes","example[60]":"The play closes on Sunday, so don’t miss it!","form[0]":"ADJECTIVES/NOUN + play","collocation[15]":"a stage play","example[61]":"I occasionally write reviews of local stage plays.","collocation[16]":"a TV/radio play","example[62]":"This horror story would make a good radio play.","collocation[17]":"a school play","example[63]":"I got a small part in the school play.","collocation[18]":"a Nativity play","example[64]":"She was chosen to play Mary in the nativity play.","definition[21]":"if you play the market, you buy and sell shares on the stockmarket, especially to make a quick profit rather than as an investment for the future","example[65]":"Unless you can afford to lose money occasionally, it’s foolish to play the market in later life.","definition[22]":"to use the rules of a system in a clever way in order to gain an advantage","example[66]":"These accountants know how to play the tax system.","definition[23]":"to have extra money which you can use for a particular purpose","example[67]":"If you do get a severance check  (=money you get from your employer when you lose your job) and land a job immediately, you’ll have some extra money to play with.","definition[24]":"an occasion when someone risks money on a financial market","example[68]":"In stock options, the biggest play of the day was in BP.","definition[25]":"if a company is in play, it may be bought in a TAKEOVER","example[69]":"The company has strongly denied it’s in play."}