{"word[0]":"cheat","definition[0]":"to behave in a dishonest way in order to win or to get an advantage, especially in a competition, game, or examination","example[0]":"He had cheated in the test by using a calculator.","example[1]":"Don’t look at my cards – that’s cheating.","example[2]":"She claimed that I cheated at chess.","note[0]":"cheat at","definition[1]":"to trick or deceive someone so that they do not get or keep something they have a right to have","example[3]":"Illegal workers are often cheated by employers.","example[4]":"She cheated her aged aunt out of her fortune.","note[1]":"cheat somebody (out) of something","heading[0]":"to get money or possessions dishonestly from someone","definition[2]":"to deceive someone so that they do not get or keep something they have a right to","example[5]":"He used his charm to cheat the old lady out of everything he could get.","example[6]":"He’s afraid they’ll cheat him after he hands over the money.","display[0]":"con","definition[3]":"to get money from someone by telling them lies","example[7]":"They conned her into spending thousands of pounds on useless equipment.","example[8]":"He conned money out of the public by pretending to collect for charity.","display[1]":"swindle","definition[4]":"to get money from a person or organization by cheating them in a clever way","example[9]":"The painting has been stolen and the art gallery has been swindled out of a large sum of money.","example[10]":"A City businessman who swindled investors out of millions of pounds was jailed for four years.","display[2]":"defraud","definition[5]":"to commit the crime of getting money from an organization by deceiving them","example[11]":"He admitted attempting to defraud his former employer of $1 million.","example[12]":"Johnson is accused of conspiring to defraud the taxman of hundreds of thousands of pounds.","display[3]":"do somebody out of something","definition[6]":"to dishonestly stop someone from getting or keeping something, especially something they have a right to have","example[13]":"They’ve done me out of three weeks wages!","definition[7]":"someone who is dishonest and cheats","example[14]":"His addiction has turned him into a cheat and a liar.","definition[8]":"a set of instructions given to a computer that make it easier for someone who is playing a computer game to win","definition[9]":"to deceive someone, break rules, or behave dishonestly, especially in order to make money for yourself","example[15]":"Not all publishers want to cheat authors.","example[16]":"There are stiff penalties for stockbrokers who cheat customers.","example[17]":"These new rules could lead more people to cheat on their taxes.","note[2]":"cheat on something","example[18]":"He accused his employer of deliberately trying to cheat him out of his redundancy money.","note[3]":"cheat somebody out of something"}