{"word[0]":"unrest","definition[0]":"a political situation in which people protest or behave violently","example[0]":"There is growing unrest throughout the country.","example[1]":"The protests were the biggest show of social unrest since the government came to power.","note[0]":"political/social/industrial etc unrest","form[0]":"ADJECTIVES/NOUN + unrest","collocation[0]":"social unrest","example[2]":"The policy led to rising unemployment and social unrest.","collocation[1]":"political unrest","example[3]":"A month of political unrest followed the killing of 12 protesters by the police.","collocation[2]":"industrial unrest","example[4]":"The wave of nation-wide strikes and industrial unrest continued throughout the winter.","collocation[3]":"civil unrest","example[5]":"Our country is being ripped apart by civil unrest.","collocation[4]":"student unrest","example[6]":"Anti-war demonstrations became the focus of student unrest in the early 1970s.","collocation[5]":"urban unrest","example[7]":"Unemployment and poor housing were significant causes of urban unrest.","collocation[6]":"growing/mounting unrest","example[8]":"Rocketing unemployment led to growing unrest in the country.","collocation[7]":"serious unrest","example[9]":"We are receiving reports of serious unrest in areas of northern India.","collocation[8]":"widespread unrest","example[10]":"As prices soared, there was widespread unrest.","collocation[9]":"an outbreak of unrest","example[11]":"Troops usually respond to outbreaks of unrest with force.","collocation[10]":"a wave of unrest","example[12]":"A wave of unrest had resulted in seven deaths.","collocation[11]":"a period of unrest","example[13]":"The election results were followed by a long period of unrest.","collocation[12]":"cause/provoke/spark unrest","example[14]":"The introduction of new working practices provoked severe industrial unrest.","collocation[13]":"lead to unrest","example[15]":"Food shortages led to widespread social unrest.","collocation[14]":"quell unrest","example[16]":"Troops were brought in to quell the unrest."}