{"word[0]":"boss","definition[0]":"the person who employs you or who is in charge of you at work","example[0]":"I’ll have to ask my boss for a day off.","example[1]":"Since I’m my own boss  (=I work for myself, rather than for an employer), my hours are flexible.","definition[1]":"someone with an important position in a company or other organization","example[2]":"the new boss at Paramount Pictures","example[3]":"union bosses","definition[2]":"the person who is the strongest in a relationship, who controls a situation etc","example[4]":"When you first start training a dog, it’s important to let him see that you’re the boss.","example[5]":"You’ve got to show the kids who’s boss.","definition[3]":"a round decoration on the surface of something, for example on the ceiling of an old building","definition[4]":"the person who is in charge of you at work. Boss sounds rather informal. The usual word to use in more formal English is manager","example[6]":"Does your boss know you're looking for another job?","display[0]":"manager","definition[5]":"the person in charge of a business such as a shop, a bank, or a hotel, or of a part of a business","example[7]":"I'd like to speak to the hotel manager.","example[8]":"the sales manager","example[9]":"the manager of an Italian restaurant","display[1]":"head","definition[6]":"the person who is in charge of an organization or a department within that organization","example[10]":"the head of the CIA","example[11]":"My wife's head of the French department at the university.","example[12]":"He was the former head of the American Cancer Society.","display[2]":"chief","definition[7]":"the most important person or one of the most important people in an organization such as the police, the fire department, or the army","example[13]":"the chief of police","example[14]":"police/army/fire chiefs","example[15]":"Health chiefs have secured cash to build two new hospitals.","display[3]":"president","definition[8]":"the person who is in charge of a large company or a department within a company","example[16]":"the president of CBS news","example[17]":"Angry shareholders called for the resignation of the company president.","display[4]":"managing director","definition[9]":"the person who is in charge of the daily management of a company or organization","example[18]":"He's the managing director of a small printing firm.","display[5]":"chief executive","definition[10]":"the person who is in charge of the daily management of a company","example[19]":"the CEO of General Motors","example[20]":"Universal Studios is looking for a new chief executive.","display[6]":"supervisor","definition[11]":"someone who is in charge of a group of workers, whose job is to make sure that the workers do what the manager wants","example[21]":"He was employed as a warehouse supervisor.","display[7]":"line manager","definition[12]":"the manager who is directly in charge of you in a company","example[22]":"If you want to take a holiday, first ask your line manager.","display[8]":"report to somebody","definition[13]":"if you report to someone in a company, that person is directly in charge of you","example[23]":"Jan is based in Birmingham and reports to the Head of Marketing.","definition[14]":"to tell people to do things, give them orders etc, especially when you have no authority to do it","example[24]":"Five-year-old girls love to boss people around.","note[0]":"boss somebody about","definition[15]":"very good, attractive, or fashionable","example[25]":"a boss car","definition[16]":"a manager with an important position in an organization","example[26]":"What they need to do is lobby strongly for more women bosses.","example[27]":"Prison bosses launched an investigation into major security lapses.","definition[17]":"to work for yourself rather than being employed by someone else","example[28]":"He’s looking forward to the day when he will be his own boss."}