{"word[0]":"prejudice","definition[0]":"an unreasonable dislike and distrust of people who are different from you in some way, especially because of their race, sex, religion etc – used to show disapproval","example[0]":"Women still face prejudice in the workplace.","example[1]":"It takes a long time to overcome these kinds of prejudices.","example[2]":"Asian pupils complained of racial prejudice at the school.","note[0]":"racial/sexual prejudice","example[3]":"a cultural prejudice against fat people","note[1]":"prejudice against","definition[1]":"strong and unreasonable feelings which make you like some things but not others","example[4]":"irrational prejudices","example[5]":"Interviewers are often influenced too much by their personal prejudices.","collocation[0]":"racial prejudice","example[6]":"a novel about a young white boy who is forced to confront his racial prejudice","collocation[1]":"class prejudice","example[7]":"Those old class prejudices haven’t gone away.","collocation[2]":"blind prejudice","example[8]":"I tried to show him he was just talking out of blind prejudice.","collocation[3]":"strong prejudice","example[9]":"Women who want to work in broadcasting often encounter strong prejudice.","collocation[4]":"deep-seated prejudice","example[10]":"All these attitudes are based on deep-seated prejudice.","collocation[5]":"experience/encounter prejudice","example[11]":"Students with learning difficulties often encounter prejudice.","collocation[6]":"overcome prejudice","example[12]":"the story of how a poor kid from the ghetto overcomes poverty and prejudice","collocation[7]":"prejudice against women/black people etc","example[13]":"There is still a lot of prejudice against women in positions of authority.","definition[2]":"an unreasonable dislike and distrust of people who are different from you in some way, especially because of their race, sex, religion etc","example[14]":"prejudice against women","display[0]":"discrimination","definition[3]":"the practice of treating one group of people differently from another in an unfair way","example[15]":"There is widespread discrimination against older people.","example[16]":"the laws on sex discrimination","display[1]":"intolerance","definition[4]":"an unreasonable refusal to accept beliefs, customs, and ways of thinking that are different from your own","example[17]":"religious intolerance","example[18]":"There is an atmosphere of intolerance in the media.","display[2]":"bigotry","definition[5]":"a completely unreasonable hatred for people of a different race, religion etc, based on strong and fixed opinions","example[19]":"religious bigotry","example[20]":"the bigotry directed at Jews and other ethnic groups","display[3]":"racism/racial prejudice","definition[6]":"unfair treatment of people because they belong to a different race","example[21]":"Many black people have been the victims of racism in Britain.","example[22]":"Some immigrant groups faced racism, for example Jews and Italians, while others, such as Scandinavians, did not.","display[4]":"sexism","definition[7]":"the belief that one sex, especially women, is weaker, less intelligent etc than the other, especially when this results in someone being treated unfairly","example[23]":"sexism in language","example[24]":"She accused him of sexism.","display[5]":"ageism","definition[8]":"unfair treatment of people because they are old","example[25]":"The new law aims to stop ageism in the workplace.","display[6]":"homophobia","definition[9]":"prejudice towards or hatred of gay people","example[26]":"homophobia in the armed forces","display[7]":"xenophobia","definition[10]":"hatred and fear of foreigners","example[27]":"the xenophobia of the right-wing press","display[8]":"anti-Semitism","definition[11]":"a strong feeling of hatred toward Jewish people","example[28]":"Is anti-Semitism on the increase?","display[9]":"Islamophobia","definition[12]":"hatred and fear of Muslims","example[29]":"the rise of Islamophobia and right-wing extremism in Europe","display[10]":"gay/union/America etc bashing","definition[13]":"unfair public criticism of gay people, union members, the American government etc","example[30]":"The minister was accused of union bashing.","example[31]":"There's so much America-bashing in the liberal press.","heading[0]":"people who are prejudiced","display[11]":"racist","definition[14]":"someone who treats people of other races unfairly or badly","example[32]":"When he expressed his opinion, he was branded a racist.","display[12]":"bigot","definition[15]":"someone who has strong unreasonable opinions, especially about race or religion","example[33]":"a racist bigot","display[13]":"sexist","definition[16]":"someone, especially a man, who believes that their sex is better, more intelligent, more important etc than the other","example[34]":"Will the sexists ever support a female president?","definition[17]":"to influence someone so that they have an unfair or unreasonable opinion about someone or something","example[35]":"There was concern that reports in the media would prejudice the jury.","example[36]":"My own schooldays prejudiced me against all formal education.","note[2]":"prejudice somebody against something","definition[18]":"to have a bad effect on the future success or situation of someone or something","example[37]":"A criminal record will prejudice your chances of getting a job.","example[38]":"He refused to comment, saying he did not wish to prejudice the outcome of the talks.","definition[19]":"an unreasonable dislike of people because they are different from you in some way, especially because of their race, sex, or religious beliefs","example[39]":"prejudice in the workplace","example[40]":"the staff’s awareness of their own prejudices","definition[20]":"an unreasonable opinion about something or dislike of it","example[41]":"There’s still a great deal of prejudice against direct marketing.","definition[21]":"if a legal case is settled with prejudice, it will not be possible to open the case again. If it is settled without prejudice, it will be possible to bring the case to court at a later date","example[42]":"All pending lawsuits between the two companies will be dismissed with prejudice.","example[43]":"The findings were accepted without prejudice.","definition[22]":"to influence someone so they have an unfair opinion about someone or something, and therefore do not treat them equally","example[44]":"She argued that the publicity will endanger her client’s right to a fair trial by prejudicing future jurors.","example[45]":"Her domineering managerial techniques must have prejudiced employees against her still more.","note[3]":"prejudice somebody against somebody/something","definition[23]":"to have a bad effect on the future of someone or something"}