{"word[0]":"customer","definition[0]":"someone who buys goods or services from a shop, company etc","note[0]":"best/biggest/largest customer (=the person or company who uses a shop or company the most)","example[0]":"We aim to offer good value and service to all our customers.","example[1]":"We’ve had several letters from satisfied customers.","example[2]":"He’s one of our regular customers.","example[3]":"Many of the banks offer a poor level of customer service.","note[1]":"customer service/care","form[0]":"ADJECTIVES/NOUN + customer","collocation[0]":"a regular customer","example[4]":"My business quickly built up a base of regular customers.","collocation[1]":"a good customer","example[5]":"Good products attract good customers.","collocation[2]":"a major/big/large customer","example[6]":"America is a big customer for Japanese goods.","collocation[3]":"a loyal customer","example[7]":"Some of our loyal customers have been coming here since the store opened.","collocation[4]":"a satisfied customer","example[8]":"Satisfied customers will return again and again.","collocation[5]":"a potential/prospective customer","example[9]":"It’s very important to establish contact with potential customers.","collocation[6]":"a business customer","example[10]":"the bank’s major business customers","collocation[7]":"existing customers","example[11]":"We want to improve our service for both new and existing customers.","collocation[8]":"deal with a customer","example[12]":"He has a lot of experience in dealing with customers.","collocation[9]":"serve a customer","example[13]":"Every day the shop serves around 800 customers.","collocation[10]":"attract customers","example[14]":"The Internet is a great way to attract new customers.","collocation[11]":"keep/retain customers","example[15]":"Keeping prices low helps to retain customers.","collocation[12]":"lose a customer","example[16]":"The company has lost some big customers in the last two years.","form[1]":"customer + NOUN","example[17]":"Our aim is always to raise the level of customer service.","collocation[13]":"customer relations","example[18]":"Staff are given training in customer relations.","collocation[14]":"customer satisfaction","example[19]":"The firm carried out a survey of customer satisfaction.","collocation[15]":"customer demand","example[20]":"It’s important to respond quickly to changing customer demand.","collocation[16]":"customer complaints","example[21]":"My job is to handle customer complaints and enquiries.","definition[1]":"someone who buys goods or services from a shop or company","example[22]":"Customers were waiting for the shop to open.","example[23]":"The bank is one of our biggest customers.","display[0]":"client","definition[2]":"someone who pays for a service from a professional person or company","example[24]":"He has a meeting with one of his clients.","example[25]":"The company buys and sells shares on behalf of their clients","display[1]":"shopper","definition[3]":"someone who goes to the shops looking for things to buy","example[26]":"The streets were full of Christmas shoppers.","display[2]":"guest","definition[4]":"someone who pays to stay in a hotel","example[27]":"Guests must leave their rooms by 10 am.","display[3]":"patron","definition[5]":"a customer of a particular shop, restaurant, or hotel – usually written on signs","example[28]":"The notice said ‘Parking for Patrons Only’.","display[4]":"patient","definition[6]":"someone who is getting medical treatment from a doctor, or in a hospital","example[29]":"He is a patient of Dr Williams.","display[5]":"consumer","definition[7]":"anyone who buys goods or uses services – used when considering these people as a group who have particular rights, needs, or behaviour","example[30]":"Consumers are demanding more environmentally-friendly products.","example[31]":"the rights of the consumer","example[32]":"The law is designed to protect consumers who buy goods on the Internet.","display[6]":"market","definition[8]":"the number of people who want to buy a product, or the type of people who want to buy it","example[33]":"The market for organic food is growing all the time.","example[34]":"a magazine aimed at the youth market","display[7]":"clientele","definition[9]":"the type of customers that a particular shop, restaurant etc gets","example[35]":"The hotel has a very upmarket clientele.","example[36]":"They have a wealthy international clientele.","definition[10]":"a person or organization that buys goods or services from a shop or company","example[37]":"We try to keep regular customers happy.","example[38]":"the customer complaints department"}