{"word[0]":"injury","plural[0]":"injuries","definition[0]":"a wound or damage to part of your body caused by an accident or attack","example[0]":"She was taken to hospital with serious head injuries. ","example[1]":"The driver of the truck suffered injuries to his legs and arms.","note[0]":"injury to","example[2]":"Beckham has missed several games through injury  (=because of injury).","example[3]":"He’s a lawyer who specializes in personal injury claims.","definition[1]":"damage to someone’s reputation, career, or feelings","example[4]":"He says that the allegations caused serious injury to his reputation.","form[0]":"ADJECTIVES/NOUN + injury","example[5]":"The injury wasn’t serious.","example[6]":"Some of the victims suffered terrible injuries.","collocation[0]":"fatal","example[7]":"Fortunately, his injuries weren’t fatal.","example[8]":"A man was treated in hospital for minor injuries.","collocation[1]":"permanent","example[9]":"The brain can be affected by permanent injury after a serious accident.","collocation[2]":"a nasty injury","example[10]":"Fairground rides can cause some nasty injuries.","collocation[3]":"a head/leg/shoulder etc injury","example[11]":"He suffered a shoulder injury while playing rugby.","collocation[4]":"a spinal injury","example[12]":"The injured boy is being treated for a spinal injury.","collocation[5]":"a facial injury","example[13]":"I was offered treatment for my facial injuries.","collocation[6]":"a sports injury","example[14]":"She has vast knowledge of treating sports injuries.","collocation[7]":"an industrial injury","example[15]":"He was the victim of an industrial injury.","collocation[8]":"internal injuries","example[16]":"He was coughing blood, a sign that he had internal injuries.","collocation[9]":"multiple injuries","example[17]":"She had multiple injuries and a fractured skull.","collocation[10]":"have an injury","example[18]":"Tom was OK, and had just a few minor injuries.","collocation[11]":"suffer an injury","example[19]":"He suffered a serious leg injury in a motorcycle accident.","collocation[12]":"get an injury","example[20]":"He couldn’t take the chance of getting an injury.","collocation[13]":"sustain/receive an injury","example[21]":"She sustained an injury to her hip.","collocation[14]":"treat an injury","example[22]":"The injury was treated at the local hospital.","collocation[15]":"recover from an injury","example[23]":"It took her six months to recover from the injury.","collocation[16]":"escape/avoid injury","example[24]":"Two workmen narrowly escaped injury when a wall collapsed.","collocation[17]":"cause an injury","example[25]":"The injury was caused by flying glass from the car windscreen.","collocation[18]":"inflict an injury on somebody","example[26]":"Jenkins was accused of inflicting a head injury on one of his former colleagues.","collocation[19]":"do yourself an injury","example[27]":"Be careful with that knife or you’ll do yourself an injury.","collocation[20]":"an injury happens/occurs","example[28]":"The injury occurred five minutes into the game.","collocation[21]":"be prone to injury","example[29]":"She was rather prone to injury and often missed matches as a result.","form[1]":"injury + NOUN","collocation[22]":"injury problems","example[30]":"He suffered injury problems throughout his career as a footballer.","definition[2]":"damage to part of your body caused by an accident or an attack","example[31]":"The passengers were taken to hospital with minor injuries.","definition[3]":"an injury, especially a deep cut in your skin made by a knife, bullet, or bomb","example[32]":"He died of a gunshot wound to the head.","definition[4]":"a small injury made when a sharp object cuts your skin","example[33]":"Blood was running from a cut on his chin.","display[0]":"bruise","definition[5]":"a dark mark on your skin that you get when you fall or get hit","example[34]":"Jack often comes home from playing rugby covered in bruises.","display[1]":"graze/scrape","definition[6]":"a small injury that marks your skin or breaks the surface slightly","example[35]":"She fell off her bike and got a few grazes on her legs and knees.","display[2]":"gash","definition[7]":"a long deep cut","example[36]":"He had a deep gash across his forehead.","display[3]":"bump","definition[8]":"an area of skin that is swollen because you have hit it against something","example[37]":"How did you get that bump on your head?","display[4]":"sprain","definition[9]":"an injury to your ankle, wrist, knee etc, caused by suddenly twisting it","example[38]":"It’s a slight sprain – you should rest your ankle for a week.","display[5]":"strain","definition[10]":"an injury to a muscle caused by stretching it or using it too much","example[39]":"a muscle strain in his neck","display[6]":"fracture","definition[11]":"a crack or broken part in a bone","example[40]":"a hip fracture","definition[12]":"physical harm to a person, for example in an accident","example[41]":"Mr. Lewis was awarded $75,000 as compensation for injuries suffered in the accident.","example[42]":"absence from work due to illness or injury","definition[13]":"when a person or organization is made to suffer in some way","example[43]":"Donovan claimed he suffered serious injury to his professional and personal reputation."}