{"word[0]":"far","comparative[0]":"farther","superlative[0]":"farthest","definition[0]":"a long distance","example[0]":"Have you driven far?","example[1]":"Since I changed jobs, I have to travel further to get to work.","example[2]":"Let’s see who can jump the furthest!","example[3]":"The lake is about 4 miles away, but we probably won’t get that far (=won’t go as far as that place).","example[4]":"If you want to go further afield, there are bicycles for hire.","note[0]":"further afield","example[5]":"The children don’t go far from home.","note[1]":"far from","example[6]":"She wants to move as far away from here as possible.","note[2]":"far away","example[7]":"They could hear the sound of water not far away.","example[8]":"He lives further down the street.","note[3]":"far down","example[9]":"Many birds fly further south in the autumn.","note[4]":"further north/south etc","example[10]":"The plains stretched for as far as the eye could see (=all the distance you could see).","definition[1]":"used when asking the distance between two places, or when talking about the distance between two places","example[11]":"How far is it to the station?","example[12]":"The man didn’t say how far it was to the next town.","definition[2]":"to a place or point, but not beyond it","example[13]":"They managed to get as far as the Spanish border.","signpost[0]":"a lot/very much","definition[3]":"very much, or to a great degree","example[14]":"We’ve kept the original features of the house as far as possible (=as much as possible).","example[15]":"How far do those old, outdated laws affect today’s legislation?","example[16]":"His style was far removed (=very different) from that of Picasso.","example[17]":"The new system is far better than the old one.","note[5]":"far better/easier etc","example[18]":"There are a far greater number of women working in television than twenty years ago.","example[19]":"I enjoyed it far more than I expected.","note[6]":"far more/less","example[20]":"That’s far too much to pay.","note[7]":"far too much/long/busy etc","example[21]":"It would take me far too long to explain.","example[22]":"I guessed it would cost $100 and it was $110, so I was not far out.","note[8]":"not far off/out/wrong","example[23]":"He bought it for a price that was far beyond  (=much more than) its real value.","note[9]":"far above/below/beyond","example[24]":"The teacher said that her writing skills were far below average.","definition[4]":"used to talk about how much progress someone makes, or how much effect something has","example[25]":"He started to explain, but he didn’t get far (=he did not succeed in saying very much) before Mary interrupted him.","example[26]":"Many people felt that the new law did not go far enough (=did not have a big enough effect, so that more needed to be done).","example[27]":"They had got as far as painting the kitchen.","note[10]":"get as far as doing something","definition[5]":"a long time in the past or the future, or a long time into a particular period","example[28]":"The first petrol-driven car was produced as far back as 1883.","example[29]":"We talked far into the night.","note[11]":"far into","example[30]":"They want to plan much further ahead than the next few years.","note[12]":"far ahead","definition[6]":"a long distance – used mainly in negatives and questions, or after ‘too’, ‘so’, and ‘as’","example[31]":"It’s not far to the airport from here.","example[32]":"The ship was so far away we could hardly see it.","display[0]":"a long way","definition[7]":"a long distance from somewhere. This is the most common way of talking about long distances, except in negatives and questions when far is also common","example[33]":"You must be tired – you’ve come a long way.","example[34]":"It’s a long way down from the top of the cliff.","example[35]":"I can’t see things that are a long way away.","display[1]":"miles","definition[8]":"a very long way","example[36]":"We hiked miles.","example[37]":"The school is miles away from where I live.","display[2]":"in the distance","definition[9]":"a long way from where you are now – used when talking about things that seem small or sounds that seem quiet because they are a long way away","example[38]":"Dogs were barking somewhere in the distance.","display[3]":"distant","definition[10]":"used about something that is a long distance from where you are now, and looks small or sounds quiet","example[39]":"By now, the plane was just a distant speck in the sky.","example[40]":"the rumble of distant thunder","display[4]":"faraway","definition[11]":"a very long distance from where you are now","example[41]":"a traveller from a faraway land","example[42]":"His voice sounded faraway.","example[43]":"He told us stories about the faraway countries he had visited.","display[5]":"remote","definition[12]":"a remote place is a long distance from other places, and few people go there","example[44]":"The helicopter crashed in a remote part of the country.","example[45]":"remote holiday destinations","display[6]":"isolated","definition[13]":"an isolated place is a long distance from other towns, buildings, or people, and there is very little communication with surrounding places","example[46]":"isolated rural areas of Nepal","example[47]":"Occasionally we passed through a small isolated village.","example[48]":"If you travel to isolated areas, make sure you have a good guide.","display[7]":"off the beaten track","definition[14]":"a place that is off the beaten track is a long distance from the places where people usually go, and often seems interesting and different because of this","example[49]":"She likes to go to places that are a bit off the beaten track.","definition[15]":"a long distance away","example[50]":"We can walk to my house from here. It isn’t far.","example[51]":"You could see the mountains in the far distance."}