{"word[0]":"dictionary","plural[0]":"dictionaries","definition[0]":"a book that gives a list of words in alphabetical order and explains their meanings in the same language, or another language","example[0]":"a German – English dictionary","definition[1]":"a book that explains the words and phrases used in a particular subject","example[1]":"a science dictionary","collocation[0]":"use a dictionary","example[2]":"We advise all our students to use a good dictionary.","collocation[1]":"look something up in a dictionary","example[3]":"If you don’t understand the meaning of a word, look it up in a dictionary.","collocation[2]":"check a dictionary","example[4]":"I often check the dictionary for spelling and pronunciation.","collocation[3]":"consult a dictionary","example[5]":"Consult the dictionary for examples of how a word is used.","form[0]":"ADJECTIVES/NOUN + dictionary","collocation[4]":"a pocket dictionary","example[6]":"Pocket dictionaries don't always give you enough information.","collocation[5]":"an electronic dictionary","example[7]":"Electronic dictionaries are very popular in Japan.","collocation[6]":"a bilingual dictionary","example[8]":"A bilingual dictionary is an essential purchase for anybody learning a foreign language.","collocation[7]":"a monolingual dictionary","example[9]":"Monolingual dictionaries tend to have more examples than bilingual ones.","collocation[8]":"a picture dictionary","example[10]":"The advantage of a picture dictionary is that you don't have lengthy definitions.","collocation[9]":"an online dictionary","example[11]":"There are plenty of online dictionaries available free on the Internet.","collocation[10]":"an etymological dictionary","example[12]":"Etymological dictionaries show how languages borrow words from each other.","form[1]":"dictionary + NOUN","collocation[11]":"a dictionary definition","example[13]":"Clear dictionary definitions are what students look for.","collocation[12]":"a dictionary entry","example[14]":"The introduction explains the functions of the different parts of a dictionary entry."}