{"word[0]":"few","comparative[0]":"fewer","superlative[0]":"fewest","type[0]":"no comparative","definition[0]":"a small number of things or people","example[0]":"I could suggest many different methods, but anyway, here are just a few.","example[1]":"There are only a very few (=not many) exceptions.","example[2]":"I have to buy a few things at the supermarket.","example[3]":"Pam called to say she’s going to be a few minutes late.","example[4]":"There were a few people sitting at the back of the hall.","example[5]":"There are a few more things I’d like to discuss.","example[6]":"The office has been closed for the last few days.","note[0]":"the last/next few","example[7]":"The plants need to be watered every few days.","note[1]":"every few days/weeks etc","example[8]":"She had enjoyed her few days in Monaco.","note[2]":"the/somebody’s few days/weeks etc","example[9]":"I’ve read a few of her books.","note[3]":"few of","definition[1]":"not many or hardly any people or things","opposite[0]":"many","example[10]":"low-paid jobs that few people want","example[11]":"Many people expressed concern, but few were willing to help.","example[12]":"The team that makes the fewest mistakes usually wins.","example[13]":"The cathedral was one of the few buildings not destroyed in the war.","note[4]":"the few","example[14]":"This hospital is one of the few that are equipped to provide transplant surgery.","example[15]":"I gathered together my few possessions.","note[5]":"somebody’s few belongings/friends etc","example[16]":"Very few of the staff come from the local area.","example[17]":"Mr Wingate was full of explanations, but precious few (=hardly any) of them made sense.","explanation[0]":"A few means ‘a small number, for example two or three people or things’","explanation[1]":"You use a few before plural nouns","example[18]":"A few people were waiting","example[19]":"He called me a few days later ","explanation[2]":"You say a few of the","example[20]":"A few of the people were getting annoyed","bad_example[0]":"A few of people were getting annoyed","explanation[3]":"You say a few of my/her/his etc or a few of them/us/you","example[21]":"A few of my friends came too","example[22]":"A few of us left early","explanation[4]":"Few means ‘not many or hardly any’ It emphasizes how small the number is","explanation[5]":"In formal English, you use few before plural nouns, without ‘a’","example[23]":"Few people knew he was ill","explanation[6]":"In everyday English, people usually say not many instead","example[24]":"Not many people knew he was ill"}