{"word[0]":"fail","signpost[0]":"not succeed","definition[0]":"to not succeed in achieving something","example[0]":"It looks likely that the peace talks will fail.","example[1]":"Millions of people have tried to quit smoking and failed miserably (=been completely unsuccessful).","example[2]":"his efforts to save his failing marriage","example[3]":"If all else fails, you may be advised to have an operation.","example[4]":"He failed in his attempt to regain the world title.","note[0]":"fail in","example[5]":"Doctors failed to save the girl’s life.","note[1]":"fail to do something","signpost[1]":"not do something","definition[1]":"to not do what is expected, needed, or wanted","example[6]":"The government are failing in their duty to protect people.","example[7]":"The letter failed to arrive.","example[8]":"Firms that fail to take advantage of the new technology will go out of business.","explanation[0]":"Fail to do something is used mainly in writing and in formal contexts. In everyday English, people usually say do not do something instead:","signpost[2]":"exam/test","definition[2]":"to not pass a test or examination","example[9]":"I failed my driving test the first time I took it.","example[10]":"He failed maths but passed all his other subjects.","definition[3]":"to decide that someone has not passed a test or examination","example[11]":"Her work was so bad that I had no choice but to fail her.","signpost[3]":"company/business","definition[4]":"if a company or business fails, it is unable to continue because of a lack of money","signpost[4]":"machine/body part","definition[5]":"if a part of a machine or an organ in your body fails, it stops working","example[12]":"The engine failed on take-off.","example[13]":"The hospital said that his kidneys were failing.","signpost[5]":"health","definition[6]":"if your sight, memory, health etc is failing, it is gradually getting weaker or is not as good as it was","example[14]":"Failing eyesight forced him to retire early.","signpost[6]":"crops","definition[7]":"if crops fail, they do not grow or produce food, for example because of bad weather","signpost[7]":"rains","definition[8]":"if the rains (=a lot of rain that falls at a particular time each year) fail, they do not come when expected or it does not rain enough","definition[9]":"to not succeed – used about people, plans, methods etc","example[15]":"The plan failed.","example[16]":"They failed to persuade her to change her mind.","example[17]":"This method never fails.","display[0]":"go wrong","definition[10]":"if something you do goes wrong, it fails after starting well","example[18]":"The experiment went wrong when the chemicals combined to form a poisonous gas.","display[1]":"not work","definition[11]":"if something does not work, it does not do what you want it to do","example[19]":"The drugs don’t work.","example[20]":"I tried to fix it with glue, but that didn’t work.","display[2]":"be unsuccessful","definition[12]":"to not have the result you wanted","example[21]":"His first attempt to get a teaching job was unsuccessful.","example[22]":"The search was unsuccessful.","display[3]":"be a failure","definition[13]":"to be unsuccessful, with the result that you have wasted your efforts","example[23]":"The government’s 5-year plan to modernize the economy was a complete failure.","display[4]":"backfire","definition[14]":"if a plan or action backfires, it does the opposite of what it was intended to do","example[24]":"His plan to get attention backfired, and instead of being promoted he lost his job.","display[5]":"in vain","definition[15]":"if you try to do something in vain, you fail to do it","example[25]":"They tried in vain to save him.","example[26]":"All her efforts had been in vain.","definition[16]":"an unsuccessful result in a test or examination","example[27]":"I got a fail in history.","definition[17]":"an occasion when someone is not successful or does something badly","example[28]":"My parenting has included some spectacular fails.","definition[18]":"used for saying that someone has failed or done something badly","definition[19]":"if a business fails, it is not successful and loses so much money that it has to close","example[29]":"The company failed amid charges that the chairman had stolen $17 million.","example[30]":"More than 10,000 companies failed with debts of more than 10 million yen.","definition[20]":"if something you try to do fails, it is not successful","example[31]":"A move to vote the chairman off the Bell Resources board failed.","example[32]":"A salesman may communicate perfectly well with a customer but fail to make a sale.","definition[21]":"if something fails to happen, it does not happen, although you expected or wanted it to","example[33]":"The new projects have failed to gain general acceptance from the board.","example[34]":"If the recovery fails to cut the deficit sharply, a rise in taxes will be needed.","definition[22]":"if equipment or a machine fails, it stops working because there is a fault","definition[23]":"if crops fail, they do not grow or produce any food","example[35]":"The corn harvest failed after a terrible drought.","definition[24]":"to not pass an examination, test or INSPECTION","example[36]":"The railway line failed its Board of Trade inspection earlier this year."}