{"word[0]":"camp","signpost[0]":"in the mountains/forest etc","definition[0]":"a place where people stay in tents, shelters etc for a short time, usually in the mountains, a forest etc","note[0]":"mining/logging etc camp (=a camp where people stay when they are doing these kinds of jobs)","example[0]":"Let’s go back to camp – it’s getting dark.","example[1]":"a camp near Lake Ellen Wilson","example[2]":"The soldiers broke camp (=took down their tents etc) and left before dawn.","example[3]":"We set up camp (=made the camping place ready) at nearby Icicle Lake.","example[4]":"The expedition’s base camp (=main camp) was 6,000 feet below the summit.","example[5]":"It was dark by the time we pitched camp.","note[1]":"pitch/make camp","signpost[1]":"for children","definition[1]":"a place where young people go to take part in activities, and where they usually stay for several days or weeks","note[2]":"tennis/football etc camp (=a camp where you can do one particular activity)","example[6]":"The camp offers hiking, fishing, canoeing, and boating.","example[7]":"scout camp","example[8]":"Two years ago, she started a summer camp for girls aged eight and older.","definition[2]":"a group of people or organizations who have the same ideas or principles, especially in politics","example[9]":"the extreme right-wing camp of the party","example[10]":"At least Lynne is definitely in your camp (=supports you rather than someone else, and agrees with your ideas).","definition[3]":"a permanent place where soldiers live or train","example[11]":"Donny is stationed at Camp Pendleton.","collocation[0]":"make/pitch camp","example[12]":"We made camp in a clearing in the woods.","collocation[1]":"set up camp","example[13]":"The soldiers set up camp outside the city.","collocation[2]":"break camp","example[14]":"In the morning it was time to break camp.","definition[4]":"to set up a tent or shelter and stay there for a short time","example[15]":"We’ll camp by the river for the night, and move on tomorrow.","example[16]":"camping gear such as a sleeping bag, tent, and backpack","note[3]":"camping gear/equipment","definition[5]":"a man who is camp moves or speaks in the way that people used to think was typical of homosexuals","definition[6]":"clothes, decorations etc that are camp are very strange, bright, or unusual"}