{"word[0]":"gift","definition[0]":"something that you give someone, for example to thank them or because you like them, especially on a special occasion","synonym[0]":"present","example[0]":"The earrings were a gift from my aunt.","example[1]":"The clock was given as a retirement gift when he left the police.","example[2]":"expensive wedding gifts","example[3]":"Enjoy a free gift with any purchase of $20 or more.","example[4]":"This excellent cookbook would make an ideal gift for anyone just going away to college.","example[5]":"a generous gift of £50","note[0]":"gift of","explanation[0]":"In everyday English, especially in British English, people usually say present rather than gift:","example[6]":"These were a present from my boyfriend.","definition[1]":"a natural ability","example[7]":"a gift for languages","note[1]":"gift for","example[8]":"He was a kind man, with a gift for forming lasting friendships.","example[9]":"She has the rare gift of being able to laugh at herself.","definition[2]":"an ability that is given to you by God","example[10]":"the use of spiritual gifts","example[11]":"He was said to have possessed the gift of prophecy.","collocation[0]":"give somebody a gift","example[12]":"We gave her a gift on her birthday.","collocation[1]":"receive a gift","example[13]":"He received a gift from his aunt.","collocation[2]":"accept a gift","example[14]":"Sam accepted the gift on behalf of the school.","collocation[3]":"make somebody a gift of something","example[15]":"Johnson made her a gift of a book.","collocation[4]":"wrap (up) a gift","example[16]":"She had bought and wrapped gifts for children in hospital.","collocation[5]":"shower somebody with gifts","example[17]":"He showered her with gifts and exotic holidays.","collocation[6]":"exchange gifts","example[18]":"We exchange gifts on Christmas Day.","form[0]":"ADJECTIVES/NOUN + gift","collocation[7]":"a birthday gift","example[19]":"The camera had been a 21st birthday gift from his parents.","collocation[8]":"a wedding gift","example[20]":"Some people prefer to give cash as a wedding gift.","collocation[9]":"a Christmas gift","example[21]":"Before 1940, most people did not wrap Christmas gifts.","collocation[10]":"a free gift","example[22]":"If you spend over £50, you get a free gift.","collocation[11]":"the perfect/ideal gift for somebody","example[23]":"This book is the perfect gift for anybody who’s interested in birds.","collocation[12]":"a suitable gift","example[24]":"What do you think would be a suitable gift for a 10-year-old boy?","collocation[13]":"a small gift","example[25]":"Here’s a small gift to show our appreciation for all your hard work.","collocation[14]":"a generous gift","example[26]":"Her colleagues presented her with a generous gift when she retired.","collocation[15]":"an expensive gift","example[27]":"He was always showering Louise with expensive gifts.","collocation[16]":"a lavish gift","example[28]":"She received lavish gifts of jewellery and clothes.","collocation[17]":"a parting gift","example[29]":"She brought him a parting gift.","collocation[18]":"an unwanted gift","example[30]":"You can take any unwanted gifts to charity shops.","form[1]":"gift + NOUN","collocation[19]":"a gift idea","example[31]":"Here is another gift idea with children in mind.","collocation[20]":"a gift shop","example[32]":"The gift shop was well stocked with souvenirs.","definition[3]":"to give something to someone as or like a present","example[33]":"The local team was gifted victory as their opponents made a series of errors.","note[2]":"gift somebody something","example[34]":"The painting was gifted to the nation by its owner.","note[3]":"gift something to somebody","definition[4]":"something given to someone on a special occasion or to thank them","synonym[1]":"PRESENT","example[35]":"Sales of Christmas gifts are expected to grow about 20%.","definition[5]":"something given free of charge to a customer by an organization in return for buying their products or using their services","example[36]":"Your free gift will be sent to you once your first month’s premium has been paid.","definition[6]":"money or property given to someone with nothing expected in return. For a gift to be recognized by law, it must be clear that the giver intended to give it and that he or she did give it","example[37]":"Pension contributions or charitable gifts are deducted from pay for tax purposes.","example[38]":"You might want to make a gift of your whole estate to your partner."}