{"signpost[0]":"short distance away","definition[0]":"only a short distance from a person or thing","example[0]":"They live near London.","example[1]":"I’m sure they live somewhere near here.","example[2]":"They moved house to be nearer the school.","example[3]":"She told the children not to go near the canal.","example[4]":"I’m warning you – don’t come any nearer!","example[5]":"We heard voices as we drew near the village.","example[6]":"a hotel near to the beach","note[0]":"near to","signpost[1]":"short time before","definition[1]":"soon before a particular time or event","example[7]":"I didn’t remember to phone until near the end of the week.","example[8]":"They should send us more details nearer the time of the concert.","example[9]":"I’ll give you a ring a bit nearer to Christmas.","signpost[2]":"almost doing something","definition[2]":"almost doing something or almost in a particular state","example[10]":"The work is now near completion.","example[11]":"A lot of the women were near tears.","example[12]":"We are no nearer an agreement than we were six months ago.","example[13]":"He was near to panic as he scrambled out of the building.","example[14]":"She was near to crying.","example[15]":"He seemed to know that he was near to death.","signpost[3]":"amount or level","definition[3]":"almost at a particular amount or level","example[16]":"Inflation is now near 10%.","example[17]":"He looked nearer fifty than forty.","example[18]":"Unemployment is now near to its all-time low.","example[19]":"Strawberries are near the top of the list.","signpost[4]":"similar","definition[4]":"if something is near something else, it is similar to it","example[20]":"His story was near enough the truth for people to believe it.","example[21]":"It may not be an exact replica but it’s pretty damn near.","example[22]":"They say that love is very near to hate.","definition[5]":"only a short distance from something or someone","example[23]":"I live near Salzburg in Austria.","example[24]":"If we moved to Dallas, we’d be near my parents.","definition[6]":"very near something or someone, or almost touching them","example[25]":"The hotel is close to the beach.","example[26]":"Nancy came and sat close beside me on the bed.","display[0]":"not far (away)","definition[7]":"not a long distance away – used when saying that a place is near enough to be easy to get to","example[27]":"The station’s not far away from here.","display[1]":"nearby","definition[8]":"near here or near a particular place","example[28]":"Is there a post office nearby?","example[29]":"A group of reporters were waiting nearby.","display[2]":"within walking distance (of something)","definition[9]":"easy to walk to from somewhere, or near enough to something for you to walk there","example[30]":"There’s a good school within walking distance.","example[31]":"The house is within walking distance of shopping facilities.","display[3]":"be convenient for something","definition[10]":"to be near a place that people want to get to, so that the place is easy to reach","example[32]":"The area is very convenient for Gatwick airport.","example[33]":"I want a hotel that’s convenient for the city centre.","display[4]":"locally","definition[11]":"in or near the area where you are or the area you are talking about","example[34]":"I prefer to buy fruit and vegetables that are grown locally.","display[5]":"around here","definition[12]":"in the general area near here","example[35]":"Parking is impossible around here.","example[36]":"Is there a garage round here?","display[6]":"in the neighbourhood","definition[13]":"living or existing in the area where you are or the area you are talking about","example[37]":"We grew up knowing all the other kids in the neighbourhood.","example[38]":"There’s very little crime in the neighborhood.","display[7]":"in the vicinity","definition[14]":"in the area around and near a particular place – used especially in news reports","example[39]":"A white van was seen in the vicinity at the time the murder took place.","display[8]":"neighbouring","definition[15]":"used about towns, countries etc that are very near a particular place","example[40]":"discussions between Egypt and neighbouring states","example[41]":"The rioting quickly spread to neighbouring areas.","definition[16]":"only a short distance away from someone or something","example[42]":"It’s a beautiful house but it’s 20 miles away from the nearest town.","example[43]":"We can meet at the pub or in the restaurant, whichever’s nearer for you.","heading[0]":"GRAMMAR: Patterns with near","explanation[0]":"You usually use near as a preposition You say","example[44]":"The hotel is near the airport","example[45]":"The hotel is near to the airport","bad_example[0]":"near from the airport","explanation[1]":"Near is not usually used on its own as an adjective You don’t usually say ‘The village is near’ You usually say","example[46]":"The village is not far away","explanation[2]":"You use nearby before a noun","example[47]":"We went to a nearby park","bad_example[1]":"We went to a near park","explanation[3]":"You can use the forms nearer and nearest as adjectives","example[48]":"My house is nearer","explanation[4]":"You can use nearest before a noun","example[49]":"They headed for the nearest beach","definition[17]":"a relative who is very closely related to you such as a parent","example[50]":"The death of a near relative is a terrible trauma for a child.","definition[18]":"someone’s family – used humorously","definition[19]":"used to describe the side of something that is closest to where you are","example[51]":"the near bank of the river","definition[20]":"used when talking about the parts of a vehicle to mean the one that is closest to the side of the road when you drive","example[52]":"The headlight on the near side isn’t working.","definition[21]":"to come closer to a place","synonym[0]":"approach","example[53]":"She began to feel nervous as she neared the house.","example[54]":"The ship was nearing the harbour.","definition[22]":"to come closer to being in a particular state","example[55]":"The work is nearing completion.","example[56]":"He’s 55 now, and nearing retirement.","definition[23]":"to come closer to a particular time","example[57]":"He was nearing the end of his stay in India.","definition[24]":"if a time nears, it gets closer and will come soon","example[58]":"He got more and more nervous as the day of his departure neared."}