{"word[0]":"embarrassed","definition[0]":"feeling uncomfortable or nervous and worrying about what people think of you, for example because you have made a silly mistake, or because you have to talk or sing in public","example[0]":"Lori gets embarrassed if we ask her to sing.","example[1]":"He looked embarrassed when I asked him where he’d been.","example[2]":"There was an embarrassed silence.","example[3]":"Michelle was acutely embarrassed (=very embarrassed) at having to ask for money.","note[0]":"very/deeply/highly/acutely embarrassed","example[4]":"Ken gave her an embarrassed grin.","note[1]":"embarrassed smile/laugh/grin etc","example[5]":"He was embarrassed to admit making a mistake.","note[2]":"embarrassed to do something","example[6]":"I felt embarrassed about how untidy the house was.","note[3]":"embarrassed about/at","collocation[0]":"terribly/deeply embarrassed","example[7]":"I was deeply embarrassed to see my mother arrive in a very short skirt.","collocation[1]":"acutely/highly embarrassed","example[8]":"The government must be acutely embarrassed by the minister’s behaviour.","collocation[2]":"slightly/a little embarrassed","example[9]":"Tom looked slightly embarrassed when his name was called out.","collocation[3]":"somewhat embarrassed","example[10]":"His family seemed somewhat embarrassed to be there.","collocation[4]":"clearly/obviously embarrassed","example[11]":"He was clearly embarrassed about what had happened.","collocation[5]":"feel embarrassed","example[12]":"I felt embarrassed that he had seen me cry.","collocation[6]":"seem/look/sound embarrassed","example[13]":"The judge seemed embarrassed to be asking her such personal questions.","collocation[7]":"get/become embarrassed","example[14]":"Sometimes I get embarrassed, and I start to stutter.","collocation[8]":"an embarrassed silence","example[15]":"There was an embarrassed silence, then Gina laughed loudly.","collocation[9]":"an embarrassed smile/laugh/grin","example[16]":"Lucy gave an embarrassed smile and looked down at her feet.","example[17]":"I was really embarrassed when I arrived at the party an hour early.","example[18]":"There’s no need to be embarrassed – you’ve got a lovely voice.","display[0]":"self-conscious","definition[1]":"embarrassed about your body or the way you look or talk","example[19]":"Paul had always been self-conscious about his big feet.","display[1]":"uncomfortable","definition[2]":"unable to relax because you are embarrassed and not sure what to say or do","example[20]":"There was a long silence and everyone at the table looked uncomfortable.","display[2]":"awkward","definition[3]":"feeling embarrassed because you are in a situation in which it is difficult to behave naturally","example[21]":"Teenagers often feel awkward in formal social situations.","example[22]":"There were some awkward moments when neither of us knew what to say to each other.","display[3]":"sheepish","definition[4]":"slightly embarrassed because you know that you have done something silly or because you feel a little guilty","example[23]":"Nigel came in late looking sheepish and apologetic.","display[4]":"red-faced","definition[5]":"embarrassed or ashamed – used mainly in newspaper reports","example[24]":"A judge was left red-faced when his mobile phone rang in court.","display[5]":"mortified","definition[6]":"extremely embarrassed and ashamed because you realize that you have done something very silly or wrong","example[25]":"He said he was mortified at the way his comments had been reported in the papers."}