{"word[0]":"cope","definition[0]":"to succeed in dealing with a difficult problem or situation","example[0]":"Sometimes I find it hard to cope.","example[1]":"He coped quite well as manager while still captaining the team.","example[2]":"She feared she wouldn’t be able to cope with two new babies.","note[0]":"cope with","example[3]":"Local authorities have to cope with the problems of homelessness.","definition[1]":"if a system or machine copes with a particular type or amount of work, it does it","example[4]":"No system is designed to cope with the floods we have had this year.","example[5]":"My computer can cope with huge amounts of data.","collocation[0]":"can/can't cope","example[6]":"Older people can't cope so well with the heat.","collocation[1]":"be able/unable to cope","example[7]":"Some young mothers feel that they aren't able to cope on their own.","collocation[2]":"struggle to cope","example[8]":"Hospital wards are struggling to cope with the injured.","collocation[3]":"learn to cope","example[9]":"In this job, you'll have to learn to cope with pressure.","collocation[4]":"cope well","example[10]":"Most schools coped well with the change.","collocation[5]":"cope easily","example[11]":"The exam was tough but she coped easily.","collocation[6]":"cope successfully","example[12]":"Careful planning will help you to cope successfully.","collocation[7]":"cope admirably","example[13]":"She coped admirably with a very demanding schedule.","collocation[8]":"it is difficult/hard to cope","example[14]":"We were finding it difficult to cope financially.","collocation[9]":"somebody's ability to cope","example[15]":"The bears' survival will depend on their ability to cope with a changing environment.","collocation[10]":"a way of coping","example[16]":"Working hard was a way of coping with his grief.","collocation[11]":"coping skills","example[17]":"We help people learn coping skills to deal with these pressures.","collocation[12]":"a coping strategy","example[18]":"Some people use humour as a coping strategy.","definition[2]":"a long loose piece of clothing worn by priests on special occasions"}