{"definition[0]":"having the right qualities for a particular person, purpose, or situation","opposite[0]":"unsuitable","example[0]":"We are hoping to find a suitable school.","example[1]":"a suitable place to rear young children","note[0]":"suitable place/time etc to do something","example[2]":"These crayons are not suitable to use in very hot weather.","note[1]":"suitable to use/be shown etc","example[3]":"The house is not really suitable for a large family.","note[2]":"suitable for somebody/something","explanation[0]":"In everyday English, people usually say that someone or something is the right person or thing for them, instead of using suitable:","example[4]":"We think this is the right school for our child.","collocation[0]":"very/highly suitable","example[5]":"This exercise is very suitable for back pain sufferers.","collocation[1]":"particularly/especially suitable","example[6]":"The resort is particularly suitable for families.","collocation[2]":"equally suitable","example[7]":"I wanted a shoe that was equally suitable for both racing and training.","collocation[3]":"perfectly suitable","example[8]":"The programme is perfectly suitable for children of all ages.","definition[1]":"having the right qualities for a particular purpose or person","example[9]":"a suitable place for a picnic","example[10]":"They don’t consider him a suitable husband for their daughter.","definition[2]":"completely suitable in every way","example[11]":"It’s a nice house, but it isn’t right for us.","example[12]":"We’ll tell her when the time is right.","display[0]":"appropriate","definition[3]":"suitable for a particular purpose. Appropriate is more formal than suitable","example[13]":"She filled out all the appropriate forms.","example[14]":"It may not be an appropriate time to ask him about it.","example[15]":"It’s not appropriate to wear a short skirt for an interview.","example[16]":"the appropriate way to end a business letter","display[1]":"proper","definition[4]":"the proper tool, piece of equipment, or way of doing something is the one that most people think is most suitable","example[17]":"You can’t change a wheel without the proper tools.","example[18]":"the proper procedure for hiring staff","display[2]":"suited to something","definition[5]":"if someone is suited to something, he or she has the right qualities to do it","example[19]":"He’d be well suited to the job."}