{"word[0]":"warm up","signpost[0]":"make warm","definition[0]":"to become warm, or to make someone or something warm","example[0]":"With the fire on, the room should soon warm up.","example[1]":"Once the weather warms up, you can move the plants outdoors.","example[2]":"I turned on the grill to warm it up.","note[0]":"warm something ↔ up","example[3]":"Come inside and have a drink. It’ll warm you up.","note[1]":"warm somebody up","definition[1]":"to heat food, especially food that has already been cooked, so that it is hot enough to eat, or to become hot enough to eat","example[4]":"I’ll put the lasagne in the oven to warm it up.","signpost[1]":"do exercises","definition[2]":"to do gentle physical exercises to prepare your body for dancing, sport etc","example[5]":"The runners began warming up.","signpost[2]":"machine/engine","definition[3]":"if a machine or engine warms up, or if you warm it up, it becomes ready to work properly after being switched on","example[6]":"He waited for the photocopier to warm up.","example[7]":"He started to warm up the aircraft’s engines.","definition[4]":"if a party, election etc warms up, it starts to become enjoyable or interesting, especially because more is happening","example[8]":"The race for governor is beginning to warm up.","signpost[3]":"practise","definition[5]":"if musicians, singers, or performers warm up, they practise just before a performance","example[9]":"The band had little time to warm up before going on stage.","signpost[4]":"perform/speak first","definition[6]":"to perform or speak first at an event, so that the people listening are relaxed or excited before the main singer, speaker etc comes on","example[10]":"He warmed up the audience by telling them a few jokes.","note[2]":"warm somebody ↔ up","example[11]":"They warmed up for U2 on one of their early tours.","definition[7]":"a set of gentle exercises you do to prepare your body for sport, dancing etc","definition[8]":"a warm-up match, game, or race is held to give the sportsmen or players practice before a big event","definition[9]":"warm-up exercises are done to prepare your body before playing a sport or dancing","definition[10]":"a warm-up jacket is worn to keep you warm when you are doing exercises","definition[11]":"a warm-up man or band prepares the people at an event for the main speaker, singer etc by singing, telling jokes etc"}