{"word[0]":"pit","signpost[0]":"hole","definition[0]":"a hole in the ground, especially one made by digging","example[0]":"The female digs a pit in which to lay the eggs.","example[1]":"a five-foot deep pit","definition[1]":"a large hole in the ground from which stones or minerals are obtained by digging","note[0]":"gravel/sand/chalk pit","signpost[1]":"mine","definition[2]":"a coal mine","example[2]":"Dad first went down the pit (=worked in a coal mine) when he was 15 years old.","example[3]":"a national strike against pit closures","definition[3]":"a small hollow mark in the surface of something, especially on your skin as the result of a disease","example[4]":"the deep pits left by smallpox","signpost[2]":"untidy place","definition[4]":"a house or room that is dirty, untidy, or in bad condition","signpost[3]":"in a theatre","definition[5]":"an orchestra pit","signpost[4]":"in a garage","definition[6]":"a hole in the floor of a garage that lets you get under a car to repair it","example[5]":"an inspection pit","signpost[5]":"in fruit","definition[7]":"the single large hard seed in some fruits","example[6]":"a peach pit","signpost[6]":"body part","definition[8]":"an armpit","definition[9]":"the area of a stock exchange where people buy and sell shares","definition[10]":"to put small marks or holes in the surface of something","example[7]":"The whole street was pitted with potholes.","note[1]":"be pitted with something","explanation[0]":"Pit is usually passive in this meaning","definition[11]":"to take out the single hard seed inside some fruits","synonym[0]":"stone","example[8]":"Peel and pit two avocados.","definition[12]":"to stop in a car race to get petrol or have your car repaired","definition[13]":"an area of the floor of a financial market where buying and selling takes place and dealers speak directly to each other","synonym[1]":"FLOOR","example[9]":"the currency pit of the Chicago Commodity Exchange","example[10]":"the most active trader in the world’s most active futures-trading pit","definition[14]":"a mine, especially a coal mine","example[11]":"We have no choice but to close unprofitable pits."}