{"word[0]":"abuse","type[0]":"plural, uncountable","definition[0]":"cruel or violent treatment of someone","example[0]":"several cases of child abuse","example[1]":"An independent committee will look into alleged human rights abuses.","example[2]":"Many children suffer racial abuse at school.","note[0]":"physical/sexual/racial abuse","definition[1]":"the use of something in a way that it should not be used","synonym[0]":"misuse","note[1]":"alcohol/drug abuse (=the practice of drinking too much or taking illegal drugs)","example[3]":"A self-monitoring tax system is clearly open to abuse  (=able to be used wrongly).","example[4]":"government officials’ abuse of power","note[2]":"abuse of","definition[2]":"rude or offensive things that someone says when they are angry","note[3]":"a torrent/stream of abuse (=a series of rude or angry words)","example[5]":"vandalism and verbal abuse directed at old people","example[6]":"The other driver started hurling abuse at me.","note[4]":"shout/hurl/scream abuse at somebody","definition[3]":"to treat someone in a cruel and violent way, often sexually","example[7]":"She was sexually abused as a child.","note[5]":"sexually/physically abused","definition[4]":"to deliberately use something for the wrong purpose or for your own advantage","example[8]":"Williams abused his position as mayor to give jobs to his friends.","example[9]":"Morris abused the trust the firm had shown in him.","example[10]":"people who abuse the system","example[11]":"The proportion of drinkers who abuse alcohol is actually quite small.","note[6]":"abuse alcohol/drugs","definition[5]":"to say rude or offensive things to someone","synonym[1]":"insult","example[12]":"Many soldiers in Belfast are verbally abused.","example[13]":"He came to the help of another driver who was being racially abused by three white passengers.","definition[6]":"to treat something so badly that you start to destroy it","example[14]":"James abused his body for years with heroin and cocaine."}