{"word[0]":"join","signpost[0]":"group/organization","definition[0]":"to become a member of an organization, society, or group","example[0]":"When did you join the Labour Party?","example[1]":"I decided to join the army.","example[2]":"You can enjoy a sport without joining a club or belonging to a team.","signpost[1]":"activity","definition[1]":"to begin to take part in an activity that other people are involved in","example[3]":"Many sacrificed their weekend to join the hunt for the missing girl.","example[4]":"the benefits of joining our pension scheme","example[5]":"Church leaders have joined the campaign to end foxhunting.","signpost[2]":"go to somebody","definition[2]":"to go somewhere in order to be with someone or do something with them","example[6]":"She joined her aunt in the sitting room.","example[7]":"The immigrants were soon joined by their wives and children.","signpost[3]":"do something together","definition[3]":"to do something together with someone else, or as a group","example[8]":"I invited them to join us for a glass of wine.","note[0]":"join somebody for something","example[9]":"I’m sure you’ll all join me in thanking today’s speaker.","note[1]":"join (with) somebody in doing something","example[10]":"Parents have joined with health experts to produce a video for bereaved families.","note[2]":"join (with) somebody to do something","example[11]":"Three police forces have joined together to buy a helicopter.","note[3]":"join together","definition[4]":"to connect or fasten things together","example[12]":"Join the two pieces of wood with strong glue.","example[13]":"The island is joined to the mainland by a causeway.","note[4]":"join something to something","definition[5]":"if two roads, rivers etc join, they come together and become connected at a particular point","example[14]":"Finally, we arrived at Dartmouth, where the River Dart joins the sea.","example[15]":"the point where the two roads join","heading[0]":"to join things together","definition[6]":"to make two things come together and stay in that position. Join is used about fixing two things together permanently, so that they form a single thing","example[16]":"Doctors used a metal rod to join the two pieces of bone together.","display[0]":"attach","definition[7]":"to join one thing to another, so that it stays in position. Attach  is often used when you can separate the two things later","example[17]":"She attached the photo to the letter with a paper clip.","example[18]":"The boards are attached with nails.","example[19]":"On the wall, attached with adhesive tape, was a New York City subway map.","definition[8]":"to join pieces of equipment together, especially with a wire or pipe, so that electricity, gas, water etc can pass from one to another","example[20]":"Have you connected up the speakers to the stereo?","example[21]":"The hoses that connect the radiator to the engine are leaking.","display[1]":"link","definition[9]":"to connect machines, systems, computers etc, so that electronic signals can pass from one to another","example[22]":"All the office PCs are linked to the main server.","definition[10]":"a place where two parts of an object are connected or fastened together","example[23]":"It’s been glued back together so well you can hardly see the join.","definition[11]":"to become a member of a group, team, or organization","example[24]":"She was invited to join the company’s board.","example[25]":"Turkey is not a member of the EU, but wants to join.","definition[12]":"to start working for a company or an organization","example[26]":"He first joined Allianz as a salesman.","example[27]":"She left in 1995, the year I joined.","definition[13]":"to take action together in order to achieve something","example[28]":"AT&T and NEC agreed to join forces to develop a new mobile telephone system.","example[29]":"Many small insurance companies are joining forces with other insurers.","note[5]":"join forces with","definition[14]":"to do something with another person, company, or organization","example[30]":"Eight Japanese and two American companies are joining together to design communications equipment."}