{"word[0]":"quota","definition[0]":"an official limit on the number or amount of something that is allowed in a particular period","example[0]":"The government has decided to scrap quotas on car imports.","example[1]":"There are plans to introduce strict immigration quotas.","example[2]":"The government has imposed quotas on the export of timber.","note[0]":"quota on","example[3]":"Several countries have now set quotas for cod fishing.","note[1]":"quota for","definition[1]":"an amount of something that someone is expected to do or achieve","example[4]":"Workers only get paid if they make their quota.","note[2]":"meet/make/achieve a quota","example[5]":"They’re worried that they won’t achieve this year’s sales quota.","note[3]":"sales/production quota","example[6]":"Each person was given a quota of tickets to sell.","note[4]":"quota of","example[7]":"In the 1990s the Navy couldn’t fill its quota for new recruits.","definition[2]":"an amount of something that you think is fair, right, or normal","synonym[0]":"fair share","example[8]":"The committee has had more than its quota of problems.","example[9]":"I think I’ve had my quota of coffee for the day.","definition[3]":"a particular number of votes that someone needs to get to be elected in an election","collocation[0]":"impose/introduce a quota","example[10]":"In 1993 the European Union imposed quotas on banana imports.","collocation[1]":"set a quota","example[11]":"They have the right to set fishing quotas.","collocation[2]":"lift/scrap a quota","example[12]":"The minister for trade lifted all quotas on imports and exports.","collocation[3]":"exceed a quota","example[13]":"The fishermen were accused of exceeding their quotas.","form[0]":"ADJECTIVES/NOUN + quota","collocation[4]":"a national quota","example[14]":"Five countries maintained national quotas on imports of Japanese cars.","collocation[5]":"fishing quotas","example[15]":"The fishing quotas are strictly enforced.","collocation[6]":"production quotas","example[16]":"With an excess of milk in the European Union, production quotas were imposed on dairy farmers.","collocation[7]":"import/export quotas","example[17]":"British industry was sheltered from foreign competition by higher tariffs and import quotas.","collocation[8]":"an annual quota","example[18]":"The US immigration laws imposed a strict annual quota for each country of origin.","definition[4]":"an amount of something that is officially allowed or expected in a particular period of time","example[19]":"The U.S. has for years imposed quotas on Chinese garment imports.","example[20]":"France enforces an import quota of 3% of total car sales.","example[21]":"a meeting of OPEC to discuss production quotas","example[22]":"Salesmen selling over their quota receive a $1000 bonus."}