{"word[0]":"fit","past_tense[0]":"fitted","definition[0]":"if a piece of clothing fits you, it is the right size for your body","example[0]":"His clothes did not fit him very well.","example[1]":"The uniform fitted her perfectly.","example[2]":"The jacket’s fine, but the trousers don’t fit.","example[3]":"I know this dress is going to fit you like a glove (=fit you very well).","definition[1]":"to try a piece of clothing on someone to see if it is the right size for them, or to make sure a special piece of equipment is right for them","example[4]":"I’m being fitted for a new suit tomorrow.","note[0]":"be fitted for something","example[5]":"He may need to be fitted with a hearing aid.","note[1]":"be fitted with something","signpost[0]":"right size/shape","definition[2]":"if something fits in a place, it is the right size or shape to go there","example[6]":"I couldn’t find a key which fitted the lock.","example[7]":"Most cookers are designed to fit level with your worktops.","example[8]":"The plastic cover fits neatly over the frame.","note[2]":"fit in/into/under etc","definition[3]":"to put something carefully into a place that is the right size or shape for it","example[9]":"She fitted the last piece into the jigsaw puzzle.","signpost[1]":"enough space","definition[4]":"if something fits into a place, there is enough space for it","example[10]":"I wanted to put the wardrobe behind the door, but I don’t think it’ll fit.","example[11]":"You might be able to fit some small flowering plants between the larger bushes.","example[12]":"I don’t think we’ll be able to fit any more people into the car.","note[3]":"fit somebody/something in/into something","example[13]":"We should be able to fit one more in.","signpost[2]":"equipment/part","definition[5]":"to put a piece of equipment into a place, or a new part onto a machine, so that it is ready to be used","example[14]":"I need to fit a lock on the door.","note[4]":"fit something on/to etc something","example[15]":"Anti-theft devices are fitted to all our cars.","example[16]":"The windows are all fitted with security locks.","signpost[3]":"match/be suitable","definition[6]":"if something fits another thing, it is similar to it or suitable for it","example[17]":"The punishment should fit the crime.","example[18]":"Police said the car fits the description of the stolen vehicle.","example[19]":"Scientists often select facts to fit their theories.","example[20]":"He didn’t fit the conventional image of a banker.","example[21]":"The rhythm should fit with the meaning of a poem.","note[5]":"fit with","comparative[0]":"fitter","superlative[0]":"fittest","definition[7]":"someone who is fit is strong and healthy, especially because they exercise regularly","opposite[0]":"unfit","example[22]":"You must be very fit if you do so much running.","example[23]":"He was young, good-looking, and physically fit.","example[24]":"I swim twice a week to try and keep fit.","example[25]":"She’s over eighty now, but still as fit as a fiddle (=very fit).","example[26]":"I had just come back from holiday and was fighting fit.","note[6]":"fighting fit","example[27]":"He may not be fit for Saturday’s match.","note[7]":"fit for","example[28]":"I don’t know if I’ll be fit enough to take part in the race.","note[8]":"fit to do something","example[29]":"Psychiatrists said he was fit to stand trial  (=he was mentally healthy enough).","definition[8]":"suitable or good enough for something","example[30]":"We made sure the land was fit for drilling.","example[31]":"The food was not fit for human consumption.","example[32]":"This book is not fit for publication!","example[33]":"He is not fit to govern this country!","example[34]":"This room is not fit to be seen!","definition[9]":"sexually attractive","definition[10]":"a time when you feel an emotion very strongly and cannot control your behaviour","example[35]":"She killed him in a fit of temper.","note[9]":"fit of","example[36]":"He quit his job in a fit of drunken depression.","signpost[4]":"lose consciousness","definition[11]":"a short period of time when someone loses consciousness and cannot control their body because their brain is not working properly","example[37]":"She used to have fits as a baby.","example[38]":"people who suffer from epileptic fits","signpost[5]":"laugh/cough","definition[12]":"a short time during which you laugh or cough a lot in a way that you cannot control","example[39]":"He had a violent coughing fit.","example[40]":"We were all in fits of laughter trying to clear up the mess.","example[41]":"Carl had us all in fits (=made us laugh a lot) with his stories.","example[42]":"The girls collapsed into a fit of the giggles.","signpost[6]":"right size","definition[13]":"the way in which something fits on your body or fits into a space","example[43]":"The dress was a perfect fit.","example[44]":"I managed to get everything into the suitcase, but it was a tight fit.","definition[14]":"if there is a fit between two things, they are similar to each other or are suitable for each other","example[45]":"We must be sure that there’s a fit between the needs of the children and the education they receive.","note[10]":"fit between","definition[15]":"to have a seizure (=a sudden condition in which someone cannot control the movements of their body)","example[46]":"The patient was fitting.","definition[16]":"to put a piece of equipment into place, or a new part on a machine","example[47]":"Interactive entertainment systems have been fitted on all the airline’s 747s.","note[11]":"fit something on/to something","example[48]":"Insurance is cheaper for homes fitted with alarms.","note[12]":"fit something with something","definition[17]":"if there is a fit between a company’s different activities, they go well together and can be managed together profitably","example[49]":"The fit between the two merged supermarket chains is excellent."}