{"word[0]":"kind","definition[0]":"one of the different types of a person or thing that belong to the same group","synonym[0]":"sort, type","example[0]":"The flowers attract several different kinds of insects.","example[1]":"Greg was working on some kind of deal in Italy.","example[2]":"Get me a sandwich – any kind will do.","example[3]":"They sell all kinds of things.","note[0]":"kind of","collocation[0]":"all kinds/every kind","example[4]":"He’s done all kinds of work.","collocation[1]":"the same kind","example[5]":"I’d like to see you make the same kind of effort in practice that you make in the game.","collocation[2]":"a different kind","example[6]":"Fossils of many different kinds have been found in this site.","collocation[3]":"the right/wrong kind","example[7]":"It wasn’t the right kind of holiday for me.","collocation[4]":"the best/worst kind","example[8]":"Not knowing what had happened to her was the worst kind of torture.","collocation[5]":"some kind","example[9]":"Carved into the stone was some kind of design.","collocation[6]":"any kind","example[10]":"There was no television, no radio – no technology of any kind.","collocation[7]":"various kinds","example[11]":"The students had to read various kinds of academic materials.","collocation[8]":"a certain/particular kind","example[12]":"A ‘besom’ is a particular kind of broom.","collocation[9]":"of its/their kind","example[13]":"It is the biggest centre of its kind.","collocation[10]":"of this kind","example[14]":"How can we be sure a disaster of this kind will not happen again?","collocation[11]":"of the worst/best etc kind","example[15]":"This is hypocrisy of the worst kind.","collocation[12]":"what kind (of something)?","example[16]":"What kind of milk shake would you like?","collocation[13]":"that kind of thing","example[17]":"He usually wears trainers and jeans, that kind of thing.","collocation[14]":"in a funny/strange etc kind of way","example[18]":"In a funny kind of way, the bullying made me a stronger person.","collocation[15]":"precisely/exactly the kind","example[19]":"This was precisely the kind of help that she needed.","comparative[0]":"kinder","superlative[0]":"kindest","definition[1]":"saying or doing things that show that you care about other people and want to help them or make them happy","opposite[0]":"unkind","note[1]":"thank you for your kind invitation/offer (=said when thanking someone very politely for their invitation or offer)","example[20]":"It wasn’t a very kind thing to say.","example[21]":"She’s a very kind and generous person.","example[22]":"We thanked the priest for his kind words.","example[23]":"Thank you for your help. You’ve been most kind (=said when thanking someone very politely).","example[24]":"Ms Jarvis is unable to accept your kind invitation.","example[25]":"They’ve been very kind to me.","note[2]":"kind to","example[26]":"It’s kind of you to say that.","note[3]":"it’s kind of somebody (to do something)","example[27]":"It’s really kind of them to let us use their pool.","explanation[0]":"You are kind to someone","example[28]":"He was kind to her","bad_example[0]":"He was kind with her","definition[2]":"not causing harm or suffering","example[29]":"Let’s hope the weather’s kind tomorrow.","example[30]":"Life has been very kind to me.","example[31]":"I need a soap that’s kinder to my skin.","definition[3]":"someone who is kind tries to help people and make them happy or comfortable, and shows that they care about them","example[32]":"They were very kind to us and let us stay in their house as long as we liked.","example[33]":"a kind old lady","example[34]":"a kind thing to say","definition[4]":"friendly and kind. Nice is very common in everyday spoken English and is often used instead of kind","example[35]":"Everyone has been so nice to me.","example[36]":"It’s nice of you to invite me here.","example[37]":"He seems such a nice man.","display[0]":"generous","definition[5]":"kind because you give people money, presents etc","example[38]":"‘I’ll pay for the meal.’ ‘That’s very generous of you.’","example[39]":"a generous gift","display[1]":"considerate","definition[6]":"thinking about other people’s feelings, and careful not to do anything that will upset them","example[40]":"Our neighbours are very considerate and always keep their TV turned down.","example[41]":"a considerate driver","example[42]":"He’s always very polite and considerate to his guests.","display[2]":"thoughtful","definition[7]":"thinking of things you can do to make other people happy or feel good – used especially when someone does something such as giving someone a present or helping someone","example[43]":"It was thoughtful of you to send him a card.","example[44]":"Some thoughtful person had taken her bag to the lost property office.","display[3]":"caring","definition[8]":"kind and wanting to help and look after people","example[45]":"She’s lucky to have such a loving and caring husband.","example[46]":"The British are well-known for their caring attitude toward animals.","display[4]":"sympathetic","definition[9]":"saying kind things to someone who has problems and behaving in a way that shows you care about them","example[47]":"My boss was very sympathetic and said I should take some time off work.","example[48]":"She gave him a sympathetic smile.","definition[10]":"kind and showing that you want to help – used especially in the following phrases","example[49]":"It was good of you to come and see me.","example[50]":"She’s always been very good to us.","definition[11]":"very kind – used especially when you like someone very much, or you are very pleased because of something they have done","example[51]":"I was given the flowers by a sweet little old lady who lived next door.","example[52]":"It’s sweet of you to ask.","example[53]":"a sweet thing to say","display[5]":"kind-hearted/warm-hearted","definition[12]":"having a kind and friendly character, which makes other people like you","example[54]":"He was a wonderful father, kind-hearted and always laughing.","example[55]":"The town is full of warm-hearted, helpful people.","display[6]":"benevolent","definition[13]":"kind and wanting to help people – often used about someone who is important or who people respect","example[56]":"a benevolent ruler","example[57]":"They believe in the existence of a benevolent God who will save mankind.","example[58]":"He listened politely, like some benevolent uncle.","definition[14]":"a method of paying someone by giving goods or services instead of money","example[59]":"The company agreed that the loan should be settledby payment in kind.","example[60]":"A workplace nursery is not regarded as a benefit in kind, and is not counted in your income tax assessment."}