{"word[0]":"cure","definition[0]":"a medicine or medical treatment that makes an illness go away","example[0]":"There is still no cure for AIDS.","note[0]":"cure for","definition[1]":"something that solves a problem, or improves a bad situation","example[1]":"There is no easy cure for loneliness.","definition[2]":"the act of making someone well again after an illness","example[2]":"The new treatment effected a miraculous cure.","collocation[0]":"find/discover a cure","example[3]":"Scientists are still hoping to find a cure for the common cold.","collocation[1]":"develop a cure","example[4]":"It will be at least ten years before a cure is developed.","collocation[2]":"seek/search for/look for a cure","example[5]":"$3 billion a year is spent searching for a cure for cancer.","form[0]":"ADJECTIVES/NOUN + cure","collocation[3]":"an effective cure","example[6]":"A few decades ago there was no effective cure for the disease.","collocation[4]":"a miracle cure","example[7]":"People always hope for a miracle cure.","collocation[5]":"no known cure","example[8]":"At present is there is no known cure for this virus.","collocation[6]":"the search for a cure","example[9]":"Billions of pounds have been spent on the search for a cure.","collocation[7]":"prevention is better than cure","example[10]":"The scientists are trying to find a cure for Alzheimer’s Disease.","display[0]":"remedy","definition[3]":"a way to treat a health problem, especially a small problem such as a cold, using plants or other natural methods","example[11]":"Rinsing with salt water is a good home remedy for a sore throat.","example[12]":"The store sells herbal remedies.","display[1]":"antidote","definition[4]":"a medicine that will stop the effects of a poison or dangerous drug","example[13]":"There is no known antidote to a bite from this snake.","definition[5]":"to make an illness or medical condition go away","example[14]":"Many types of cancer can now be cured.","example[15]":"an operation that can cure short-sightedness in 15 minutes","definition[6]":"to make someone well again after they have been ill","example[16]":"She had some acupuncture treatment which seems to have cured her.","example[17]":"90% of patients can be cured of the disease.","note[1]":"cure somebody of something","definition[7]":"to solve a problem, or improve a bad situation","example[18]":"Attempts to cure unemployment have so far failed.","definition[8]":"to preserve food, tobacco etc by drying it, hanging it in smoke, or covering it with salt","example[19]":"cured ham","definition[9]":"to make someone who has an illness completely well again or to stop a disease making someone ill – used especially about drugs or other treatments","example[20]":"Many cancer victims can be cured if the disease is detected early enough.","display[2]":"heal","definition[10]":"to cure someone – used especially when someone cures people using special religious powers, rather than using medicine. Also used when saying that a cream or treatment makes a wound better","example[21]":"He claimed that he could heal the sick.","example[22]":"This cream is good for healing minor cuts and bruises.","display[3]":"make somebody (feel) better","definition[11]":"to make someone who is ill well again, especially when they have an illness that is not very serious","example[23]":"The pills did make me feel better.","display[4]":"relieve/ease","definition[12]":"to reduce someone’s pain or unpleasant feelings","example[24]":"Aspirin will help to relieve the symptoms.","example[25]":"I can give you something to alleviate the pain."}