{"comparative[0]":"deeper","superlative[0]":"deepest","signpost[0]":"going far down","definition[0]":"going far down from the top or from the surface","example[0]":"The castle is on an island surrounded by a deep lake.","example[1]":"The swimming pool has a deep end and a shallow end for kids.","example[2]":"We’ll take the boat out into deep water where we can dive.","example[3]":"a deep narrow valley","definition[1]":"you use deep to say what distance something goes down from the top or surface","example[4]":"In places, the snow was waist-deep  (=deep enough to reach a person’s waist).","note[0]":"ankle-deep/waist-deep etc","example[5]":"Dig a hole around 12 inches deep.","note[1]":"2 metres/6 feet etc deep","signpost[1]":"going far in","definition[2]":"going far in from the outside or from the front edge of something","example[6]":"a deep wound","example[7]":"She was sitting in a deep leather chair.","definition[3]":"serious or severe","example[8]":"Despite the peace process, there are deep divisions in the community.","example[9]":"The country is in a deep recession.","example[10]":"Evan will be in deep trouble if he is caught.","signpost[2]":"breath","definition[4]":"a deep breath or sigh is one in which you breathe a lot of air in or out","example[11]":"She stopped and took a deep breath.","example[12]":"Tom gave a deep sigh of relief.","signpost[3]":"feeling/belief","definition[5]":"a deep feeling, belief etc is very strong and sincere","synonym[0]":"profound","example[13]":"May I express my deepest sympathy.","example[14]":"The letters show her deep affection for him.","example[15]":"He has a deep understanding of the environment.","definition[6]":"a deep sound is very low","example[16]":"Her laugh was deep and loud.","example[17]":"I love that deep bass line.","definition[7]":"a deep colour is dark and strong","example[18]":"She gazed at him with wide deep blue eyes.","example[19]":"The berries are a deep red colour.","signpost[4]":"difficult to understand","definition[8]":"important but complicated or difficult to understand","example[20]":"These problems are too deep for me.","example[21]":"There is a deep issue of principle involved.","definition[9]":"if someone is in a deep sleep, it is difficult to wake them","example[22]":"He lay down and fell into a deep sleep.","definition[10]":"a deep person is serious and intelligent, but is hard to know well","example[23]":"Henry has always been a deep one. He keeps his views to himself.","signpost[5]":"ball games","definition[11]":"a deep ball is hit, thrown, or kicked to a far part of the sports field","definition[12]":"a long way into or below the surface of something","example[24]":"Some bones were hidden deep beneath the ground.","example[25]":"The tunnel led deep under the mountains.","example[26]":"We were deep in a tropical rainforest  (=far from the edge of the forest).","example[27]":"Tom stared deep into her eyes.","example[28]":"They talked deep into the night  (=very late)."}