{"word[0]":"soon","comparative[0]":"sooner","superlative[0]":"soonest","definition[0]":"in a short time from now, or a short time after something else happens","example[0]":"It will be dark soon.","example[1]":"David arrived sooner than I expected.","example[2]":"‘Who?’ ‘You’ll find out soon enough (=fairly soon).’","example[3]":"Paula became pregnant soon after they were married.","note[0]":"soon after","definition[1]":"quickly","example[4]":"How soon can you finish the report?","example[5]":"Try and get the car fixed as soon as possible.","example[6]":"See you soon!","example[7]":"It seemed difficult at first, but I soon got used to it.","display[0]":"in the near future","definition[2]":"in the next few weeks or months. In the near future  is more formal than soon","example[8]":"The book will be on sale in the near future.","display[1]":"in no time (at all)","definition[3]":"very soon – used to talk about something good happening","example[9]":"You’ll be feeling better in no time at all.","example[10]":"In no time at all, her son was starting to speak Japanese.","display[2]":"in a minute","definition[4]":"used to say that you will do something or something will happen within a few minutes","example[11]":"I’ll be ready in a minute.","example[12]":"The film’s going to start in a minute.","display[3]":"any minute now","definition[5]":"used to say that something will or may happen very soon, but you do not know exactly when","example[13]":"They should be here any minute now.","display[4]":"any day now","definition[6]":"used to say that something will or may happen in the next few days, but you do not know exactly when","example[14]":"I’m hoping to hear from her any day now.","display[5]":"shortly","definition[7]":"a short time from now","example[15]":"They will be with us shortly.","example[16]":"the new laws that will shortly be coming into effect","display[6]":"before long","definition[8]":"soon – used especially when something happens which you expected to happen","example[17]":"They got married, and before long Anna was expecting a baby.","display[7]":"it will not be long","definition[9]":"used when saying that something will happen soon","example[18]":"It won’t be long before everything is back to normal.","example[19]":"I knew that it wouldn’t be long before the same thing happened again."}