{"signpost[0]":"amount somebody/something weighs","definition[0]":"how heavy something is when you measure it","example[0]":"The average weight of a baby at birth is just over seven pounds.","example[1]":"fish that are over two kilos in weight","note[0]":"in weight","example[2]":"Fruit and vegetables are sold by weight.","note[1]":"by weight","signpost[1]":"how fat","definition[1]":"how heavy and fat someone is","example[3]":"You shouldn’t worry about your weight.","signpost[2]":"heaviness","definition[2]":"the fact that something is heavy","example[4]":"The weight of her boots made it hard for Sue to run.","example[5]":"I didn’t know if the bridge would support our weight.","example[6]":"Karen staggered along under the weight of her backpack.","note[2]":"under the weight of something","signpost[3]":"heavy thing","definition[3]":"something that is heavy","example[7]":"I can’t lift heavy weights because of my bad back.","definition[4]":"something that causes you a lot of worry because you have to deal with it","example[8]":"Selling the house is a weight off my mind  (=something that no longer causes a lot of worry).","example[9]":"She felt a great weight of responsibility.","note[3]":"weight of","example[10]":"families who are crumbling under the weight of increasing debt","signpost[4]":"importance","definition[5]":"if something has weight, it is important and influences people","example[11]":"She knew that her opinion carried very little weight.","example[12]":"This scandal adds more weight to their arguments.","note[4]":"give/add weight to something","signpost[5]":"for measuring quantities","definition[6]":"a piece of metal that weighs an exact amount and is balanced against something else to measure how much the other thing weighs","signpost[6]":"for sport","definition[7]":"a piece of metal that weighs an exact amount and is lifted by people as a sport","example[13]":"I’ve been lifting weights since I was 18.","heading[0]":"– Meaning 2: how heavy and fat someone is","collocation[0]":"put on weight","example[14]":"He had put on weight since she last saw him.","collocation[1]":"lose/shed weight","example[15]":"She lost a lot of weight when she was ill.","collocation[2]":"watch your weight","example[16]":"He has to watch his weight because he has a heart condition.","collocation[3]":"get/keep your weight down","example[17]":"How can I keep my weight down?","collocation[4]":"get/keep the weight off","example[18]":"I changed my eating habits so I’d keep the weight off.","form[0]":"weight + NOUN","collocation[5]":"a weight problem","example[19]":"I’ve always had a weight problem.","collocation[6]":"weight gain","example[20]":"The medication can cause rapid weight gain.","collocation[7]":"weight loss","example[21]":"After the first month, weight loss slows down.","collocation[8]":"somebody’s ideal weight","example[22]":"She weighs about 10lbs more than her ideal weight.","collocation[9]":"somebody’s target weight","example[23]":"I’ve reached my target weight.","collocation[10]":"excess weight","example[24]":"You’ll feel better if you lose the excess weight.","definition[8]":"to fix a heavy object to something in order to keep it in place","example[25]":"The fishing nets are weighted down with lead.","note[5]":"weight something (down) with something","definition[9]":"to change something slightly so that you give more importance to particular ideas or people","example[26]":"a temptation to weight the report in favour of the option you want","note[6]":"weight something in favour of somebody/something","definition[10]":"how heavy something is, measured using a particular system","example[27]":"The weight of the new noise reduction kits may limit the aircraft’s capacity by up to 10%.","definition[11]":"to allow for the differences between sets of figures that are being compared by increasing or lowering the value of some of them, and so creating a balance between them","example[28]":"The mid-cap index is weighted according to the market values of the stocks.","example[29]":"The results of the survey were weighted by age to make sure the poll accurately reflects voters nationwide."}