{"word[0]":"outcome","definition[0]":"the final result of a meeting, discussion, war etc – used especially when no one knows what it will be until it actually happens","example[0]":"People who had heard the evidence at the trial were surprised at the outcome.","example[1]":"It was impossible to predict the outcome of the election.","note[0]":"outcome of","explanation[0]":"Outcome is slightly formal and is used mostly in writing. In everyday English, people are more likely to talk about what happened:","example[2]":"It was impossible to predict what would happen in the election.","form[0]":"ADJECTIVES/NOUN + outcome","collocation[0]":"the final/ultimate outcome","example[3]":"The final outcome of the investigation is still to be announced.","example[4]":"The ultimate outcome of this controversy remains in doubt.","collocation[1]":"a likely outcome","example[5]":"What is the likely outcome of the election?","collocation[2]":"a possible outcome","example[6]":"When you throw a die, there are six possible outcomes.","collocation[3]":"a successful outcome","example[7]":"Hopes for a successful outcome to the war were fading.","collocation[4]":"a positive outcome","example[8]":"Everyone is hoping for a positive outcome to the talks.","collocation[5]":"a happy outcome","example[9]":"Adopting a child does not automatically result in a happy outcome.","collocation[6]":"a satisfactory outcome","example[10]":"Our main aim is to achieve a satisfactory outcome for both parties.","collocation[7]":"the desired outcome","example[11]":"The desired outcome of most services is a satisfied customer.","collocation[8]":"a favourable/unfavourable outcome","example[12]":"Considerable progress has been made towards a favourable outcome.","example[13]":"Discontinuing treatment too early may result in an unfavourable outcome.","collocation[9]":"a learning outcome","example[14]":"It is important to set teaching objectives and learning outcomes.","collocation[10]":"a policy outcome","example[15]":"A number of factors affect policy outcomes.","collocation[11]":"a treatment outcome","example[16]":"Funding is provided to collect and analyze data on treatment outcomes.","collocation[12]":"a health outcome","example[17]":"the assessment of health outcomes","collocation[13]":"have an outcome","example[18]":"The meeting had a very satisfactory outcome.","collocation[14]":"affect/influence the outcome","example[19]":"Did coverage in the media affect the outcome of the trial?","collocation[15]":"decide/determine the outcome","example[20]":"This move ultimately decided the outcome of the conflict.","example[21]":"At the leadership elections today, it is their votes that will determine the outcome.","collocation[16]":"predict the outcome","example[22]":"It is too early to predict the final outcome of the survey.","collocation[17]":"await the outcome","example[23]":"Medical science must await the outcome of proper international debate."}