{"word[0]":"release","signpost[0]":"let somebody go","definition[0]":"to let someone go free, after having kept them somewhere","example[0]":"Police arrested several men, who were later released.","example[1]":"The bears are eventually released into the wild.","example[2]":"He was released from the hospital yesterday.","note[0]":"release somebody from something","signpost[1]":"make public","definition[1]":"to let news or official information be known and printed","synonym[0]":"publish","example[3]":"The new trade figures have just been released.","signpost[2]":"film/record","definition[2]":"to make a CD, film, computer game etc available for people to buy or see","example[4]":"A version of the game for Mac computers will be released in February.","signpost[3]":"stop holding/drop","definition[3]":"to stop holding or drop something","example[5]":"Thousands of bombs were released over Dresden.","example[6]":"The sudden noise made him release his hold on her arm.","note[1]":"release your grip/hold (on somebody/something)","definition[4]":"to express or get rid of feelings such as anger or worry","example[7]":"Physical exercise is a good way of releasing stress.","signpost[4]":"chemical","definition[5]":"to let a substance flow out","example[8]":"Oil was released into the sea.","note[2]":"release something into something","signpost[5]":"from a duty","definition[6]":"to allow someone not to do their duty or work","example[9]":"Because of rising costs, the company released 10% of their workforce.","example[10]":"Williams asked to be released from her contract.","signpost[6]":"machinery","definition[7]":"to allow part of a piece of machinery or equipment to move from the position in which it is fastened or held","example[11]":"Release the handbrake first.","signpost[7]":"from prison","definition[8]":"when someone is officially allowed to go free, after being kept somewhere","example[12]":"Before release, the sea lions are fitted with electronic tracking devices.","example[13]":"Simon has obtained early release from prison.","note[3]":"release from","signpost[8]":"record/film","definition[9]":"a new CD, film, computer game etc that is available to buy or see","example[14]":"the band’s latest release","definition[10]":"if a film is on release, you can go and see it in a cinema","example[15]":"The film is on general release.","definition[11]":"freedom to show or express your feelings","example[16]":"Playing an instrument can be a form of emotional release.","definition[12]":"a feeling that you are free from the worry or pain that you have been suffering","example[17]":"treatment that will bring a release from pain","signpost[9]":"chemicals","definition[13]":"when a chemical, gas etc is allowed to flow out of its usual container","example[18]":"the release of toxic waste into the rivers","note[4]":"release into","signpost[10]":"official statement","definition[14]":"an official statement, report etc that is made available to be printed or broadcast, or the act of making it available","synonym[1]":"publication","example[19]":"October 22nd is the date set for the report’s release.","definition[15]":"a handle, button etc that can be pressed to allow part of a machine to move","definition[16]":"to make information, figures etc publicly available","example[20]":"The company will release its latest earnings figures on Wednesday.","definition[17]":"to make a new product, especially a film, book, or record, available for people to buy or see","example[21]":"The film will be released on DVD next week.","definition[18]":"to allow someone to stop working for you","example[22]":"He asked to be released from his contract.","definition[19]":"to make money available to be used","example[23]":"the need to release the money for grants","definition[20]":"an official statement, making information publicly available","example[24]":"In a joint news release, the companies said no agreement had been reached.","definition[21]":"a new product, especially a film, book, or record, or the fact that it is available","example[25]":"The company is hoping to keep ahead of the market by bringing out anew release of its operating system.","example[26]":"The movie has taken $5.1 million since its release.","example[27]":"The film will beon general release (=available in most places) on August 3."}