{"comparative[0]":"quieter","superlative[0]":"quietest","signpost[0]":"making no noise","definition[0]":"not making much noise, or making no noise at all","example[0]":"We’ll have to be quiet so as not to wake the baby.","example[1]":"It’s a nice car. The engine’s really quiet.","example[2]":"I’ll be as quiet as a mouse (=very quiet).","signpost[1]":"not speaking","definition[1]":"not saying much or not saying anything","example[3]":"You’re very quiet, Mom – is anything the matter?","example[4]":"I didn’t know anything about it so I just kept quiet.","example[5]":"The crowd went quiet.","example[6]":"a woman whose life of quiet desperation threatens to overwhelm her","note[0]":"quiet confidence/satisfaction/desperation","example[7]":"Jack’s air of quiet authority","note[1]":"quiet authority/dignity","definition[2]":"someone who is quiet does not usually talk very much","example[8]":"a strange, quiet girl","signpost[2]":"place with no noise","definition[3]":"a place that is quiet has no noise or not much noise","example[9]":"Our hotel room was comfortable and quiet.","example[10]":"When they walked into the pub, the place went quiet.","signpost[3]":"no activity/people","definition[4]":"without much activity or without many people","example[11]":"It was a Sunday, about three o'clock, and the streets were quiet.","example[12]":"I’d love to go on holiday somewhere where it’s nice and quiet.","example[13]":"Anthony met her in the bar, and they found a quiet corner where they could talk.","example[14]":"I’m going to have a  quiet night in (=an evening when you stay at home and relax).","example[15]":"He wants a quiet life, while she wants to go out partying.","definition[5]":"if business is quiet, there are not many customers","synonym[0]":"slack","example[16]":"August is a quiet time of year for the retail trade.","heading[0]":"a quiet sound or voice","definition[6]":"not making a loud sound","example[17]":"I heard a quiet voice behind me.","example[18]":"a car with a quiet engine","definition[7]":"quiet – especially because you do not want people to hear or be disturbed","example[19]":"Doug was on the phone, speaking in a low voice.","example[20]":"I turned the volume down low.","definition[8]":"quiet and pleasant to listen to","example[21]":"Soft music was playing in the background.","example[22]":"His voice was soft and gentle.","display[0]":"silent","definition[9]":"not making any sound at all","example[23]":"a silent prayer","example[24]":"silent laughter","example[25]":"The machines were virtually silent.","display[1]":"hushed","definition[10]":"deliberately quiet because you do not want people to hear – used about people’s voices","example[26]":"They were talking about money in hushed tones.","example[27]":"The doctor’s voice was hushed and urgent.","display[2]":"faint","definition[11]":"quiet and difficult to hear because it comes from a long way away","example[28]":"The men went ahead and their voices got fainter and fainter.","example[29]":"the faint sound of bells","display[3]":"muffled","definition[12]":"difficult to hear, for example because the sound comes from another room or someone’s mouth is covered by something","example[30]":"Muffled voices were coming from downstairs.","example[31]":"the muffled sound of someone crying","definition[13]":"a dull sound is not loud – used especially about the sound of something hitting another thing","example[32]":"He hit the ground with a dull thud.","display[4]":"inaudible","definition[14]":"too quiet to hear","example[33]":"The sound is inaudible to the human ear.","example[34]":"Her answer came in an almost inaudible whisper.","heading[1]":"a quiet place","definition[15]":"without much noise","example[35]":"It’s so quiet here at night.","example[36]":"This is the quietest room in the house to work in.","definition[16]":"with no noise at all","example[37]":"The room fell silent (=became silent).","display[5]":"peaceful","definition[17]":"quiet in a pleasant and relaxing way","example[38]":"Life’s more peaceful in the countryside.","example[39]":"The hotel is set in tranquil surroundings.","display[6]":"sleepy","definition[18]":"quiet – used about a town or village where there are not many people and very little happens","example[40]":"a sleepy fishing village","heading[2]":"not saying much","example[41]":"He’s a quiet boy who loves reading.","example[42]":"You’re very quiet tonight, Suzy – are you OK?","definition[19]":"not saying anything","example[43]":"Her husband was a big silent man.","example[44]":"Everyone was arguing but I decided to remain silent.","display[7]":"taciturn","definition[20]":"not talking much and seeming a little unfriendly or bad-tempered","example[45]":"He found Vaughn a taciturn and rather difficult person.","display[8]":"reticent","definition[21]":"unwilling to talk to other people, especially about a particular subject","example[46]":"She’s always been reticent about her early life.","display[9]":"a man/woman of few words","definition[22]":"someone who does not talk much, especially because they only speak when there is something important to say","example[47]":"My father was a man of few words, but when he spoke everyone listened.","definition[23]":"the state of being quiet, calm, and peaceful","example[48]":"We were enjoying the quiet of the forest.","example[49]":"I’ve had an awful day – now I just want some peace and quiet.","definition[24]":"silence","example[50]":"Can I have some quiet, please?","definition[25]":"if business, a market etc is quiet, there are not many customers or there is not much activity","example[51]":"The market has been quiet this morning.","definition[26]":"the right to use property or land without any interference","example[52]":"The purchaser shall have quiet enjoyment of the land."}