{"word[0]":"frame","signpost[0]":"border","definition[0]":"a structure made of wood, metal, plastic etc that surrounds something such as a picture or window, and holds it in place","note[0]":"door/window/picture frame","example[0]":"They removed the picture from its wooden frame.","signpost[1]":"structure","definition[1]":"the structure or main supporting parts of a piece of furniture, vehicle, or other object","example[1]":"a bicycle frame","example[2]":"the frame of the chair","definition[2]":"the general shape formed by the bones of someone’s body","note[1]":"large/thin/slight etc frame","signpost[2]":"glasses","definition[3]":"the metal or plastic part of a pair of glasses that holds the lenses","signpost[3]":"main facts/ideas","definition[4]":"the main ideas, facts etc that something is based on","example[3]":"A clear explanation of the subject provides a frame on which a deeper understanding can be built.","example[4]":"Some comments may or may not be understood as harassment, depending on your frame of reference  (=knowledge and beliefs that influence the way you think).","definition[5]":"an area of film that contains one photograph, or one of the series of separate photographs that make up a film or video","definition[6]":"a complete part in the games of snooker or bowling","example[5]":"I won the next three frames.","signpost[4]":"internet","definition[7]":"one of the areas into which a webpage is divided","definition[8]":"to surround something with something else so that it looks attractive or can be seen clearly","example[6]":"Sarah’s face was framed by her long dark hair.","example[7]":"She stood there, framed against the doorway.","definition[9]":"to put a picture in a structure that will hold it firmly","example[8]":"I’m going to get the picture framed.","example[9]":"a framed photograph","definition[10]":"to deliberately make someone seem guilty of a crime when they are not guilty, by lying to the police or in a court of law","synonym[0]":"set up","example[10]":"Needham’s lawyers claimed that he had been framed by the police.","example[11]":"The two men were framed for murder.","note[2]":"frame somebody for something","definition[11]":"to carefully plan the way you are going to ask a question, make a statement etc","example[12]":"She wondered how she was going to frame the question.","definition[12]":"to organize and develop a plan, system etc","example[13]":"Newman played a central role in framing the new law."}