{"word[0]":"translate","signpost[0]":"change languages","definition[0]":"to change written or spoken words into another language","example[0]":"Poetry doesn’t usually translate well.","example[1]":"Translate the text from Italian into English.","note[0]":"translate something (from something) into something","example[2]":"Dagda, an ancient Irish deity, literally translates as ‘the good god’.","note[1]":"translate as","signpost[1]":"happen as result","definition[1]":"if one thing translates into another, the second thing happens as a result of the first","example[3]":"A small increase in local spending will translate into a big rise in property tax.","note[2]":"translate (something) into something","signpost[2]":"have same meaning","definition[2]":"to mean the same as something else","example[4]":"These rates translate into a return of 8.5% for dollar investors.","note[3]":"translate into/to something","signpost[3]":"change forms","definition[3]":"to change something, or be changed, from one form into another","example[5]":"Jokes often don’t translate well into print.","example[6]":"the danger of translating your emotions into actions","signpost[4]":"use in new situation","definition[4]":"to be used in a new situation, or to make something do this","synonym[0]":"adapt","example[7]":"It’s amazing how well the play has been translated to film.","note[4]":"translate something to something","example[8]":"She has translated a number of his books.","example[9]":"Michael Meyer translated the play from the original Norwegian.","example[10]":"Can you translate this into French?","display[0]":"interpret","definition[5]":"to change what someone is saying into another language, as they are speaking","example[11]":"No one in our tour group spoke Spanish so we had to ask the guide to interpret.","example[12]":"We'll have to find someone who speaks Chinese to interpret the questions and answers for our guests.","example[13]":"I had to interpret for my boss on the last trip to Japan.","display[1]":"put something into English/French/Japanese etc","definition[6]":"to translate something into another language, especially a few words or a short piece of writing","example[14]":"I've written a message for Fabio. Could you put it into Italian for me?","example[15]":"I had to put a list of Japanese words into English.","definition[7]":"to change one currency into another","example[16]":"A strong dollar reduces the value of overseas profits when they are translated back into dollars.","note[5]":"translate something into/to something","example[17]":"The company sustained losses as revenue was translated from weak dollars to strong marks.","definition[8]":"to change something from one form to another, especially to produce a final result","example[18]":"This task previously required an extra machine to translate computer files.","example[19]":"£100m of private investment should translate into 5,000 new inner-city jobs.","note[6]":"translate into","example[20]":"The production team translates the architect’s specifications into high-quality systems."}