{"word[0]":"march","definition[0]":"if soldiers or other people march somewhere, they walk there quickly with firm regular steps","note[0]":"Quick march! (=an order to tell people to start marching)","example[0]":"On 29 August the royal army marched into Inverness.","note[1]":"march across/along/past etc","example[1]":"We marched 50 km across the foothills.","example[2]":"He gathered his troops and prepared to march on the capital  (=march to the capital in order to attack it).","note[2]":"march on","definition[1]":"if a large group of people march somewhere, they walk there together to express their ideas or protest about something","example[3]":"An estimated 5,000 people marched through the city to demonstrate against the factory closures.","example[4]":"Outraged citizens marched on City Hall  (=marched to City Hall), demanding the police chief’s resignation.","definition[2]":"to walk somewhere quickly and with determination, often because you are angry","example[5]":"Brett marched out of the office, slamming the door behind him.","note[3]":"march off/out etc","definition[3]":"to force someone to walk somewhere with you, often pushing or pulling them roughly","example[6]":"Mr Carter marched us to the principal’s office.","note[4]":"march somebody to/into etc something","definition[4]":"an organized event in which many people walk together to express their ideas or protest about something","example[7]":"The police decided not to ban the march.","example[8]":"I went on a lot of peace marches when I was a student.","note[5]":"protest/civil rights/peace etc march","definition[5]":"when soldiers walk with firm regular steps from one place to another","example[9]":"The general led his forces on a long march southwards.","definition[6]":"a piece of music for people to march to","example[10]":"military marches","example[11]":"a funeral march","definition[7]":"the third month of the year, between February and April","example[12]":"She started work here last March.","note[6]":"next/last March","example[13]":"The theatre opened in March 2001.","note[7]":"in March","example[14]":"There’s a meeting on March 6th.","note[8]":"on March 6th","example[15]":"I wrote to my bank on 6th March.","note[9]":"on 6th March","example[16]":"The hospital is scheduled to open March 6.","note[10]":"March 6"}