{"word[0]":"breathe","signpost[0]":"air","definition[0]":"to take air into your lungs and send it out again","example[0]":"The room filled with smoke, and it was becoming difficult to breathe.","example[1]":"People are concerned about the quality of the air they breathe.","example[2]":"Relax and breathe deeply (=take in a lot of air).","signpost[1]":"blow","definition[1]":"to blow air or smoke out of your mouth","example[3]":"Roy breathed on his hands and rubbed them together vigorously.","note[0]":"breathe on","example[4]":"The fat man opposite was breathing garlic all over me.","note[1]":"breathe something over somebody","signpost[2]":"skin","definition[2]":"if your skin can breathe, air can reach it","signpost[3]":"clothes/fabric","definition[3]":"if cloth or clothing breathes, air can pass through it so that your body feels pleasantly cool and dry","signpost[4]":"wine","definition[4]":"if you let wine breathe, you open the bottle to let the air get to it before you drink it","signpost[5]":"say something quietly","definition[5]":"to say something very quietly, almost in a whisper","example[5]":"‘Wait, ’ he breathed.","collocation[0]":"breathe deeply","example[6]":"She breathed deeply in the cool night air.","collocation[1]":"breathe heavily/hard","example[7]":"He’d been running and he was breathing hard.","collocation[2]":"breathe fast/rapidly","example[8]":"He closed his eyes, breathing fast under the fever.","collocation[3]":"breathe slowly","example[9]":"Breathe slowly and try to relax.","collocation[4]":"breathe steadily/evenly","example[10]":"The baby was fast asleep and breathing steadily.","collocation[5]":"breathe easily","example[11]":"Make sure the injured person can breathe easily.","collocation[6]":"breathe some air/the air","example[12]":"It was wonderful to be outside and breathe some fresh air.","collocation[7]":"breathe fumes","example[13]":"These children are breathing traffic fumes all day long.","collocation[8]":"can hardly breathe","example[14]":"It was so hot that I felt as though I could hardly breathe.","collocation[9]":"have trouble/difficulty breathing","example[15]":"In high altitudes some people have trouble breathing.","collocation[10]":"struggle to breathe","example[16]":"The crowd pressed in around me and I struggled to breathe.","example[17]":"Mary knew he was asleep because he was breathing deeply.","example[18]":"He breathed the clear spring air.","display[0]":"sigh","definition[6]":"to breathe out slowly and make a noise that shows you are disappointed, tired, relieved etc","example[19]":"She just sighed and shook her head.","example[20]":"‘Never mind, ’ he sighed. ‘I’m sure there’ll be other opportunities.’","display[1]":"pant","definition[7]":"to breathe quickly and noisily through your mouth, because you have been using a lot of effort","example[21]":"They were panting by the time they got to the finish line.","display[2]":"gasp","definition[8]":"to breathe very quickly and deeply and with difficulty","example[22]":"Her eyes were wide, and she was gasping for breath.","example[23]":"‘Do you think you can walk?’ ‘I’ll try to, ’ he gasped.","display[3]":"snore","definition[9]":"to breathe noisily while you are sleeping","example[24]":"I couldn’t sleep because my husband was snoring.","display[4]":"wheeze","definition[10]":"to breathe with difficulty, making a noise in your throat and chest, because you are ill","example[25]":"His asthma was making him wheeze.","display[5]":"be out of breath","definition[11]":"to be unable to breathe easily, especially because you have been running or doing other exercise","example[26]":"I was out of breath by the time we reached the top of the hill.","display[6]":"be short of breath","definition[12]":"to be unable to breathe easily, especially because you are unhealthy","example[27]":"Because she was so overweight, she was often short of breath."}