{"word[0]":"react","signpost[0]":"behaviour/feelings","definition[0]":"to behave in a particular way or show a particular emotion because of something that has happened or been said","example[0]":"She reacted very badly (=was very upset) when her parents split up.","example[1]":"You have to react quickly to circumstances.","example[2]":"How did Wilson react to your idea?","note[0]":"react to","example[3]":"He reacted angrily to the suggestion that he had lied.","example[4]":"The government reacted by declaring all strikes illegal.","note[1]":"react by doing something","signpost[1]":"chemicals","definition[1]":"if a chemical substance reacts, it changes when it is mixed with another chemical substance","example[5]":"The calcium reacts with sulphur in the atmosphere.","note[2]":"react with","signpost[2]":"prices","definition[2]":"if prices or financial markets react to something that happens, they increase or decrease in value because of it","example[6]":"Oil prices reacted sharply (=reacted a lot) to news of the crisis in the Middle East.","example[7]":"The market reacted favourably to the announcement.","signpost[3]":"become ill","definition[3]":"to become ill when a chemical or drug goes into your body, or when you eat a particular kind of food","example[8]":"Quite a lot of children react badly to antibiotics.","collocation[0]":"react badly","example[9]":"Do you react badly to criticism?","collocation[1]":"react angrily/violently","example[10]":"The prime minister reacted angrily to these accusations.","collocation[2]":"react strongly","example[11]":"Scott reacted strongly when he felt he was being treated unjustly.","collocation[3]":"react quickly/swiftly","example[12]":"The goalkeeper had to react quickly.","collocation[4]":"react differently","example[13]":"People react differently to stress.","collocation[5]":"react positively/negatively","example[14]":"We want versatile people who react positively to change.","collocation[6]":"react cautiously","example[15]":"The United States has reacted cautiously to the offer.","collocation[7]":"react instinctively","example[16]":"She reacted instinctively and reached for her gun.","definition[4]":"to start rising or falling in price, level etc because of something that has happened or that has been said","example[17]":"The stock market reacted favorably to the announcement.","example[18]":"Oil prices reacted only mildly to news of the cut in Saudi production."}