{"word[0]":"sole","definition[0]":"the sole person, thing etc is the only one","example[0]":"the sole American in the room","example[1]":"Griffiths is the sole survivor of the crash.","example[2]":"The story was published with the sole purpose of selling newspapers.","definition[1]":"not shared with anyone else","example[3]":"Derek has sole responsibility for sales in Dublin.","example[4]":"The company has the sole rights to market Elton John’s records.","heading[0]":"– Meaning 1: the sole person, thing etc is the only one","collocation[0]":"somebody’s sole purpose/aim","example[5]":"Their sole purpose was to kill.","collocation[1]":"the sole reason","example[6]":"His sole reason for calling was to shower abuse upon me.","collocation[2]":"the sole cause","example[7]":"I’m not saying that TV violence is the sole cause of violence in society.","collocation[3]":"the sole candidate","example[8]":"He was the sole candidate for the post.","collocation[4]":"the sole occupant","example[9]":"The library’s sole occupant was a thin, elderly man.","collocation[5]":"the sole survivor","example[10]":"Jack was the sole survivor of the crew.","collocation[6]":"the sole surviving/remaining member/child etc","example[11]":"His sole surviving child, Mary, succeeded to the throne at the age of one week.","heading[1]":"– Meaning 2: not shared with anyone else","collocation[7]":"sole responsibility","example[12]":"She has the sole responsibility for a large family.","collocation[8]":"sole rights","example[13]":"The company now has the sole rights to the process.","collocation[9]":"sole ownership/proprietorship","example[14]":"He now has sole ownership of the company.","collocation[10]":"sole control/charge","example[15]":"The school was no longer under their sole control.","definition[2]":"the bottom surface of your foot, especially the part you walk or stand on","example[16]":"The soles of his feet were caked in mud.","definition[3]":"the flat bottom part of a shoe, not including the heel","example[17]":"the soles of her shoes","definition[4]":"a flat fish that is often used for food","example[18]":"Dover sole","definition[5]":"to put a sole on a shoe","note[0]":"thick-soled/leather-soled etc (=having soles that are thick, made of leather etc)","explanation[0]":"Sole is usually passive","definition[6]":"a sole thing or person is the only one","example[19]":"The company’s sole business is software that blocks spam.","example[20]":"He became the sole owner of an investment management firm.","definition[7]":"a sole responsibility, duty, right etc is one that is not shared with anyone else","example[21]":"Derek has sole responsibility for sales in this region.","example[22]":"When he retired, he left his partner in sole control."}