{"word[0]":"fulfil","definition[0]":"if you fulfil a hope, wish, or aim, you achieve the thing that you hoped for, wished for etc","example[0]":"Visiting Disneyland has fulfilled a boyhood dream.","example[1]":"Being deaf hasn’t stopped Karen fulfilling her ambition to be a hairdresser.","example[2]":"It was then that the organization finally began to fulfill the hopes of its founders.","example[3]":"an analysis of how different countries are attempting to fulfill their political goals","note[0]":"fulfil an aim/a goal/an objective","definition[1]":"to do or provide what is necessary or needed","example[4]":"There is little doubt that the scheme fulfils a need for our community.","example[5]":"A good police officer is not fulfilling his role if he neglects this vital aspect.","note[1]":"fulfil a role/duty/function etc","example[6]":"Britain was accused of failing to fulfil its obligations under the EU Treaty.","note[2]":"fulfil a requirement/condition/obligation etc","example[7]":"Much of the electrical equipment failed to fulfill safety requirements.","definition[2]":"if your work fulfils you, it makes you feel satisfied because you are using all your skills, qualities etc","past_tense[0]":"fulfilled","definition[3]":"if a hope, promise etc is fulfilled, the thing that you had hoped for, promised etc happens or is done","example[8]":"Our aim is to fulfill our clients’ wishes as efficiently as possible.","example[9]":"She is striving to fulfil her ambition to be a fashion designer.","definition[4]":"to supply the things that have been ordered","example[10]":"a UK company that acquires goods from a Belgian supplier to fulfil an order from a German customer","definition[5]":"to do the things that a contract says you must do","example[11]":"The seller can fulfil his contract only by delivery of 500 tons of grain from the specified cargo.","example[12]":"The company is struggling to fulfill its contracts.","definition[6]":"to reach a standard that is necessary, especially one that has been officially decided","example[13]":"The rental contract sets out the conditions which the tenant is required to fulfil.","definition[7]":"to provide something that someone needs","example[14]":"The service will run initially for three months but may become permanent if it fulfils a need.","example[15]":"It is essential that the agency only sends us applicants who fulfil our requirements.","definition[8]":"to do the things a person, organization, or machine must do or is expected to do","example[16]":"He fulfilled his role as manager very effectively.","example[17]":"Robots fulfil many dull and tedious jobs on the production line.","definition[9]":"to achieve what you were hoping to do","example[18]":"The managers must decide on the policies and priorities that help the company to fulfil its aims.","example[19]":"There are major goals which businesses fulfill such as maximising the return on capital.","definition[10]":"if your work fulfils you, it makes you feel satisfied because you are using all your skills or qualities","example[20]":"I have rarely seen a person so fulfilled by hiswork.","definition[11]":"to be as successful as you could possibly be","example[21]":"We are confident that the new sales manager will fulfil his potential."}