{"word[0]":"claim","definition[0]":"to state that something is true, even though it has not been proved","example[0]":"The group claimed responsibility for the bombings.","note[0]":"claim responsibility/credit (for something)","example[1]":"Opposition leaders will claim victory if the turnout is lower than 50%.","example[2]":"The product claims that it can make you thin without dieting.","note[1]":"claim (that)","example[3]":"No responsible therapist will claim to cure your insomnia.","note[2]":"claim to do/be something","example[4]":"I don’t claim to be a feminist, but I’d like to see more women in top jobs.","example[5]":"The girls claim to have seen the fairies.","note[3]":"claim to have done something","example[6]":"A letter appeared in ‘The Times’ claiming Fleming as the discoverer of penicillin.","note[4]":"claim somebody/something as something","explanation[0]":"In more formal English, you say it is claimed that something is true","example[7]":"It has been claimed that he was difficult to work with","definition[1]":"to officially demand or receive money from an organization because you have a right to it","example[8]":"If you’re still not satisfied, you may be able to claim compensation.","note[5]":"claim benefit/an allowance/damages etc","example[9]":"He should be able to claim the price of the ticket back.","note[6]":"claim something back","example[10]":"You can claim on the insurance if you have an accident while on holiday.","note[7]":"claim on","signpost[0]":"legal right","definition[2]":"to state that you have a right to take or have something that is legally yours","example[11]":"The majority of those who claim asylum are genuine refugees.","example[12]":"Lost property can be claimed between 10 a.m. and 4 p.m.","signpost[1]":"death","definition[3]":"if a war, accident etc claims lives, people die because of it – used especially in news reports","example[13]":"The earthquake has so far claimed over 3,000 lives.","signpost[2]":"attention","definition[4]":"if something claims your attention, you notice and consider it carefully","example[14]":"The military conflict continues to claim our undivided attention.","collocation[0]":"claim responsibility","example[15]":"Following the attack, a man phoned a newspaper claiming responsibility.","collocation[1]":"claim credit","example[16]":"Political parties always claim credit for economic growth.","collocation[2]":"claim victory","example[17]":"The election results were in and the president was able to claim victory.","collocation[3]":"claim descent","example[18]":"He claimed descent from Beethoven.","collocation[4]":"wrongly/rightly","example[19]":"This hotel can rightly claim that it has some of the best views on the island.","collocation[5]":"falsely/rightfully","example[20]":"Some manufacturers falsely claim that their products are environmentally friendly.","collocation[6]":"justifiably","example[21]":"They can justifiably claim to be the top team in the country.","definition[5]":"to say that something is true, even though it has not been proved","example[22]":"He claims that he didn’t see anything.","example[23]":"She claims to be a descendant of Charles Dickens.","display[0]":"allege","definition[6]":"to claim that someone did something wrong or illegal, although you do not give any proof","example[24]":"It is alleged that he murdered his wife.","example[25]":"Patients allege that the two firms failed to warn doctors about the dangers of taking the drugs over a long period.","display[1]":"maintain","definition[7]":"to repeatedly say that something is true, especially when other people do not believe you","example[26]":"He continued to maintain his innocence, even after he was sent to prison.","example[27]":"My mother always maintains that I learned to talk at six months.","display[2]":"insist","definition[8]":"to say very firmly that something is true","example[28]":"She insists that Tom was there, although he denies it.","example[29]":"Turkey insists that there is more than enough water in the two rivers for all three countries.","display[3]":"assert","definition[9]":"to state that something is true – used especially in formal writing when reporting someone’s opinion","example[30]":"They assert that children work better on their own.","example[31]":"The Environment Minister asserted that one third of the country’s cities had major pollution problems.","display[4]":"contend","definition[10]":"to claim that something is true, especially when other people disagree with you","example[32]":"Lawyers contend that his back problems were due to an existing injury, not the accident.","example[33]":"It is possible, as Kennedy contends, that her medical condition is caused by her work.","definition[11]":"a statement that something is true, even though it has not been proved","example[34]":"They made claims they couldn’t live up to.","example[35]":"the competing claims of scientists","example[36]":"Evidence to support these claims is still lacking.","example[37]":"I make no claim to understand the complexities of the situation.","example[38]":"firms that make false claims about their products","note[8]":"false/extravagant/dubious etc claims","example[39]":"The police denied claims that the men were tortured.","note[9]":"dispute/deny/reject a claim","example[40]":"Gould rejected claims that he had acted irresponsibly.","note[10]":"claim that","example[41]":"his claim to be the rightful owner of the painting","definition[12]":"an official request for money that you think you have a right to","note[11]":"pay/wage claim (=a request from workers for more money)","example[42]":"Fill in and return the claim form as soon as it arrives.","example[43]":"He lost his claim for unfair dismissal.","note[12]":"reject/uphold/lose etc a claim","example[44]":"All claims should be made in writing.","note[13]":"make/put in/file a claim","example[45]":"claims for compensation","note[14]":"claim for","definition[13]":"the sum of money you request when you make a claim","example[46]":"The insurance company cannot meet (=pay) such enormous  claims.","signpost[3]":"rights","definition[14]":"a right to do something or to have something, especially because it belongs to you or because you deserve it","example[47]":"The Maldives pressed its claim to hold the summit.","example[48]":"Philip feared Edward would lay claim to the Scottish crown.","example[49]":"the competing claims of parents and teachers","example[50]":"A woman who has given a man children will always have a claim on his love.","note[15]":"have a claim on somebody’s time/attention etc","example[51]":"Surely they have a rightful claim on their father’s land?","note[16]":"claim to/on","definition[15]":"something such as a piece of land that contains valuable minerals","example[52]":"His claims were later found to be false.","collocation[7]":"unfounded/unsubstantiated","example[53]":"These claims of discrimination are completely unfounded.","collocation[8]":"extravagant claims","example[54]":"Some manufacturers make extravagant claims for their products.","collocation[9]":"competing claims","example[55]":"the competing claims of the political parties","collocation[10]":"conflicting claims","example[56]":"The reports contained conflicting claims of the number of people killed.","collocation[11]":"make a claim","example[57]":"He made extravagant claims about the benefits of the diet.","collocation[12]":"deny a claim","example[58]":"Government officials denied claims that the country possessed chemical weapons.","collocation[13]":"dispute/reject a claim","example[59]":"The prime minister rejected claims of a disagreement within his party.","collocation[14]":"support a claim","example[60]":"The court found no evidence to support her claim.","collocation[15]":"back up a claim","example[61]":"They challenged him to back up his claims with evidence.","collocation[16]":"accept a claim","example[62]":"Many scientists were reluctant to accept his claims.","collocation[17]":"challenge a claim","example[63]":"Washington continued to challenge the claim that global warming is partly caused by carbon dioxide.","collocation[18]":"investigate a claim","example[64]":"Detectives are investigating claims that the two officials took bribes.","example[65]":"It is difficult to believe some of the manufacturer's claims for its products.","display[5]":"allegation","definition[16]":"a statement that someone has done something wrong or illegal, but that has not been proved","example[66]":"He has strongly denied the allegations of sexual harassment.","display[6]":"assertion","definition[17]":"something that you say or write that you strongly believe","example[67]":"the assertion that house prices are falling","display[7]":"contention","definition[18]":"a strong opinion that someone expresses","example[68]":"Her main contention is that doctors should do more to encourage healthy eating.","definition[19]":"a request or demand for money, or the amount of money asked for","example[69]":"The developer made a claim against the owner for extra building costs.","example[70]":"There were very large claims for loss of earnings.","example[71]":"The company finally agreed to settle her claim (=pay it) for damages.","definition[20]":"a request for a payment for damage, theft, injury etc for which you are insured","example[72]":"Europ Assistance will deal with any claim received from the insured.","example[73]":"This form will be needed should you have to make an insurance claim.","example[74]":"The company’s results included a net gain of $87.3 million from the settlement of insurance claims resulting from the interruption of its operations.","definition[21]":"a right to have or get something such as land or other assets that belong to you","example[75]":"They have no claim to the property.","definition[22]":"a favourable statement made about a product by its producer that may or may not be true","example[76]":"The company has been forced by the Food and Drug Administration to remove ‘no cholesterol’ claims from its labels.","definition[23]":"to officially request, demand, or receive money from an organization","example[77]":"The new rules mean young people between 16 and 18 can no longer claim unemployment benefit.","example[78]":"Alcan claimed damages for the losses that resulted from the government cancelling the project.","definition[24]":"to request money for damage, theft, injury etc for which you are insured","example[79]":"Can you claim on your household insurance if the tiles on your roof are stolen?","note[17]":"claim (something) on","definition[25]":"to state that you have a right to something or to take something that belongs to you","example[80]":"They wanted to expand the golf course on land that Indians had claimed."}