{"word[0]":"Independent, the","definition[0]":"a serious British newspaper which generally supports liberal political ideas. The same company produces a similar paper on Sundays, called the Independent on Sunday.","signpost[0]":"not owned/controlled by something","definition[1]":"an independent organization is not owned or controlled by, or does not receive money from, another organization or the government","note[0]":"independent film (=one not made or produced by a large film production company)","example[0]":"There are plans to split the corporation into a number of smaller independent companies.","example[1]":"an independent charity","example[2]":"small independent bookshops","example[3]":"schools in the independent sector","example[4]":"independent television companies","note[1]":"independent television/radio/broadcasting etc","example[5]":"We need a central bank that is independent of the government.","note[2]":"independent of","definition[2]":"an independent organization or person is not involved in a particular situation, and can therefore be trusted to be fair in judging it","example[6]":"an independent panel of scientists","example[7]":"An independent body  (=group of people who work together) has been set up to monitor government spending.","example[8]":"There were no independent witnesses to the shooting.","example[9]":"Human rights groups have called for an independent inquiry into the killings.","note[3]":"independent inquiry/advice/opinion etc","example[10]":"the results of an independent study","signpost[1]":"country","definition[3]":"an independent country is not governed or controlled by another country","example[11]":"India became independent in 1947.","definition[4]":"confident and able to do things by yourself in your own way, without needing help or advice from other people","example[12]":"Now that my sons are more independent, I have more time for myself.","example[13]":"an independent young woman","example[14]":"He’s helping other people with spinal injuries to lead an independent life.","example[15]":"By this age, the child becomes relatively independent of his mother.","definition[5]":"having enough money to live, without having to ask for help from other people","example[16]":"It was always very important to me to be financially independent.","example[17]":"Robert aimed to be independent of his parents by the time he was twenty.","signpost[2]":"separate","definition[6]":"if one thing is independent of another, the two are not connected, or the second thing does not influence the first","example[18]":"Three independent studies all arrived at the same conclusion.","example[19]":"reports from two separate sources entirely independent of one another","signpost[3]":"politician","definition[7]":"an independent politician does not belong to a particular party","example[20]":"Independent candidates won three seats.","definition[8]":"a politician who does not belong to a political party","definition[9]":"not owned, controlled, or financed by another organization or the government","example[21]":"There are plans to split the company into a number of smaller independent companies."}