{"word[0]":"purpose","definition[0]":"the purpose of something is what it is intended to achieve","example[0]":"It should be legitimate to use cannabis for medical purposes.","note[0]":"for medical/political/decorative etc purposes","example[1]":"The protection of children is the primary purpose of this legislation.","note[1]":"sole/primary/main etc purpose","example[2]":"It would serve no useful purpose to re-open the investigation.","note[2]":"serve a purpose","example[3]":"The purpose of this meeting is to elect a new chairman.","note[3]":"purpose of","example[4]":"What is the purpose of your visit?","example[5]":"The purpose of conducting a business is to make money.","note[4]":"the purpose of doing something","example[6]":"Troops were sent solely for the purpose of assisting refugees.","note[5]":"for the purpose of doing something","definition[1]":"a plan or aim","example[7]":"Nick had no particular purpose in mind when he started.","example[8]":"Attending the race was not my purpose in coming to Indianapolis.","note[6]":"somebody’s purpose in doing something","example[9]":"He came here with the purpose of carrying out the attack.","note[7]":"with the purpose of doing something","definition[2]":"a feeling of determination to achieve things in life","example[10]":"It’s so important to have a sense of purpose that it underlies human happiness.","example[11]":"My football career was over and I had no purpose in life.","example[12]":"He possessed great strength of purpose.","collocation[0]":"the main/primary purpose","example[13]":"The main purpose of our trip to Arran was to see golden eagles.","collocation[1]":"the sole purpose","example[14]":"I used to bake cakes for the sole purpose of giving them away.","collocation[2]":"the real purpose","example[15]":"What was the real purpose of their visit?","collocation[3]":"the whole purpose","example[16]":"The whole purpose of running a business is to make money.","collocation[4]":"something’s original purpose","example[17]":"The building is no longer needed for its original purpose.","collocation[5]":"a useful purpose","example[18]":"Nuclear weapons serve no useful purpose and should be banned.","collocation[6]":"a practical purpose","example[19]":"These materials are too fine to have a practical purpose in daily life.","collocation[7]":"a dual purpose","example[20]":"A dog can fulfil a dual purpose by providing both company and security.","collocation[8]":"a common purpose","example[21]":"We were bound together by a common purpose.","collocation[9]":"a specific/particular purpose","example[22]":"Training is the acquisition of knowledge and skills for a specific purpose.","collocation[10]":"for political/military/educational/medicinal etc purposes","example[23]":"This technology could be used for military purposes.","collocation[11]":"for business/research etc purposes","example[24]":"About one in five of all trips are made for business purposes.","collocation[12]":"have a purpose","example[25]":"A meeting should have a clear purpose.","collocation[13]":"serve/fulfil a purpose","example[26]":"The building must have served a religious purpose.","example[27]":"Many old school buildings are no longer suitable for fulfilling their original purpose.","collocation[14]":"achieve your purpose","example[28]":"She had achieved her purpose, at least in part.","definition[3]":"the reason you do something, and the thing you want to achieve when you do it","example[29]":"What is the purpose of your visit to England?","example[30]":"The plant is used for medicinal purposes.","display[0]":"aim","definition[4]":"what you want to achieve when you do something","example[31]":"The main aims of the project are as follows.","example[32]":"Their ultimate aim is to find a cure for cancer.","display[1]":"goal","definition[5]":"something that you hope to achieve in the future, even though this may take a long time","example[33]":"It took Mandela over forty years to achieve his goal of a democratic South Africa.","example[34]":"the goal of ending child poverty","display[2]":"objective","definition[6]":"something that you are working hard to achieve, especially in business or politics","example[35]":"The bank achieved its objective of increasing its share of the market.","example[36]":"The government’s long-term objective is to cut CO2 emissions by 50%.","display[3]":"the object of something","definition[7]":"the specific purpose of an activity","example[37]":"The object of the game is to get as many points as possible.","example[38]":"The students will benefit, and that must be the object of the exercise (=the main thing that you are trying to do).","display[4]":"the point","definition[8]":"the purpose of doing something and the reason why it is right or necessary","example[39]":"At fourteen, I couldn’t see the point of going to school.","example[40]":"What’s the point in waiting?  (=I don’t think it is useful or necessary)","display[5]":"intention","definition[9]":"the purpose that you have in your mind when you do something","example[41]":"He kept his real intentions well hidden.","example[42]":"Although we made a lot of money, this wasn’t our original intention.","display[6]":"ends","definition[10]":"the result that someone is trying to achieve – used especially when you disapprove of what someone is doing","example[43]":"They are using religion for political ends.","example[44]":"The ends do not justify the means (=you should not use violence, cruelty, dishonest behaviour etc to achieve your aims)."}