{"word[0]":"make up","signpost[0]":"form/be","definition[0]":"to combine together to form something","synonym[0]":"constitute","example[0]":"Women make up only a small proportion of the prison population.","example[1]":"The committee is made up of representatives from every state.","note[0]":"be made up of something","explanation[0]":"Make up is not used in the progressive in this meaning You say","example[2]":"Oxygen makes up roughly 20% of the atmosphere","bad_example[0]":"Oxygen is making up roughly 20% of the atmosphere","explanation[1]":"However, the participle form making up is often used","example[3]":"Customers under 25 are important, making up a quarter of the total","signpost[1]":"pretend something is true","definition[1]":"to pretend that something is true in order to deceive someone","example[4]":"I think they’re making the whole thing up.","signpost[2]":"invent","definition[2]":"to produce a new story, song, game etc by thinking","example[5]":"Nick made up a song about them.","example[6]":"When you’re the boss you can make up your own rules.","example[7]":"I’ve given talks so many times that now I just make them up as  I go along (=think of things to say as I am speaking).","signpost[3]":"prepare","definition[3]":"to prepare something by mixing things or putting things together","example[8]":"I could make up a bed for you on the sofa.","example[9]":"Can you make up a bottle of milk for the baby?","signpost[4]":"somebody’s face","definition[4]":"to put make-up (=special coloured substances)  on someone’s face in order to make them look better or different","example[10]":"They made him up as an old man for the last act of the play.","example[11]":"One lucky winner will have the chance to be made up and photographed.","signpost[5]":"number/amount","definition[5]":"to add to an amount in order to bring it up to the level that is needed","example[12]":"I saved as much as I could, and my parents made up the rest.","example[13]":"The company will be forced to pay $6 million to make up the difference.","signpost[6]":"time/work","definition[6]":"to work at times when you do not usually work, because you have not done as much work as you should","example[14]":"I’m trying to make up the time I lost while I was sick.","example[15]":"Is it OK if I make the work up next week?","signpost[7]":"friends","definition[7]":"to become friendly with someone again after you have had an argument","example[16]":"Oh come on! Why don’t you just kiss and make up?","example[17]":"Have you made up with Patty yet?","signpost[8]":"from cloth","definition[8]":"to produce something from cloth by cutting and sewing","example[18]":"The dress had been made up to her exact requirements.","example[19]":"I plan on making that material up into a dress.","note[1]":"make something ↔ up into","signpost[9]":"for your face","definition[9]":"coloured substances that are put on your face to improve or change your appearance","example[20]":"I don’t usually wear much make-up.","signpost[10]":"people in a group","definition[10]":"the make-up of a group or team is the combination of people that are in it","example[21]":"We should change the make-up of the team.","note[2]":"make-up of","definition[11]":"a test that you take in school when you were not able to take a previous test","collocation[0]":"wear make-up","example[22]":"They’re not allowed to wear make-up to school.","collocation[1]":"have make-up on","example[23]":"She had no make-up on.","collocation[2]":"use make-up","example[24]":"She rarely uses make-up.","collocation[3]":"put on make-up","example[25]":"Gloria watched her mother put on her make-up.","collocation[4]":"do your make-up","example[26]":"I’ll do your make-up for you, if you want.","collocation[5]":"take off make-up","example[27]":"Take off eye make-up gently, using a cotton ball.","collocation[6]":"touch up/fix your make-up","example[28]":"She went into the bathroom to touch up her makeup.","collocation[7]":"smudge your make-up","example[29]":"Grace wiped her eyes, smudging her make-up.","form[0]":"ADJECTIVES/NOUN + make-up","collocation[8]":"heavy make-up","example[30]":"a girl in high heels and heavy make-up","collocation[9]":"eye make-up","example[31]":"She was wearing far too much eye make-up.","collocation[10]":"stage make-up","example[32]":"the elaborate stage make-up for ‘The Lion King’","collocation[11]":"pancake make-up","example[33]":"His face was covered by thick pancake makeup.","form[1]":"make-up + NOUN","collocation[12]":"a make-up artist","example[34]":"the chief make-up artist on the film","display[0]":"make-up","display[1]":"cosmetics","definition[12]":"creams, powders etc that you use on your face and body in order to look more attractive","example[35]":"a range of cosmetics and toiletries","display[2]":"lipstick","definition[13]":"a substance you use for adding colour to your lips, in the shape of a small stick","example[36]":"She was wearing bright red lipstick.","display[3]":"eyeshadow","definition[14]":"coloured cream or powder that you put on your eyelids","display[4]":"eyeliner","definition[15]":"something you use for adding a line of colour at the edges of your eyelids to make your eyes look bigger or more noticeable","display[5]":"mascara","definition[16]":"a dark substance you use to colour your eyelashes and make them look thicker","display[6]":"blusher","definition[17]":"red or pink cream or powder used for making your cheeks look slightly more pink","display[7]":"foundation","definition[18]":"a cream the same colour as your skin that you put on your face before the rest of your make-up","definition[19]":"to combine together to form a particular total or result","example[37]":"Plastic bags now make up 60% of all bags used in grocery stores.","definition[20]":"to prepare something","example[38]":"Your accountant will make up your accounts and prepare your tax return."}