{"word[0]":"difference","definition[0]":"a way in which two or more people or things are not like each other","opposite[0]":"similarity","example[0]":"There’s a world of difference (=there’s a very big difference) between being alone and being lonely.","example[1]":"There’s a big difference between knowing that something is true, and being able to prove it.","note[0]":"difference between","example[2]":"There is very little difference between the parties on green issues.","example[3]":"Do children know the difference between right and wrong?","example[4]":"Researchers found a number of important differences in the way boys and girls learn.","note[1]":"difference in","definition[1]":"the amount by which one thing is greater or smaller than another","example[5]":"There’s a five-hour time difference between London and New York.","example[6]":"There’s not much difference in price.","note[2]":"difference in age/size etc","form[0]":"ADJECTIVES/NOUN + difference","collocation[0]":"a big/major/huge difference","example[7]":"I think you’ll notice a big difference.","collocation[1]":"an important/significant/crucial difference","example[8]":"A study of the two groups of students showed a significant difference.","collocation[2]":"a slight/small/minor difference","example[9]":"There’s only a slight difference between the male and the female bird.","collocation[3]":"a marked/dramatic difference","example[10]":"There was a marked difference between the two sets of results.","collocation[4]":"a subtle difference","example[11]":"There’s a subtle difference in flavour between these coffees.","collocation[5]":"an essential/fundamental difference","example[12]":"The fundamental differences between the two sides slowly emerged.","collocation[6]":"cultural/political/regional etc differences","example[13]":"the major cultural differences between the west and the east","collocation[7]":"class differences","example[14]":"People’s answers to the questions showed clear class differences.","collocation[8]":"sex/gender differences","example[15]":"gender differences in levels of criminality","collocation[9]":"individual differences","example[16]":"We respect the children’s individual differences.","collocation[10]":"show a difference","example[17]":"Our data showed considerable national differences.","collocation[11]":"know the difference","example[18]":"If you don’t know the difference between two words, your dictionary can help.","collocation[12]":"can tell/see the difference","example[19]":"I can’t really see the difference between these two colours.","collocation[13]":"notice a difference","example[20]":"She has noticed a dramatic difference in her energy levels.","collocation[14]":"spot the difference","example[21]":"It’s easy to spot the difference between real and imitation leather.","definition[2]":"a detail, fact, or quality that makes one person or thing different from another","example[22]":"We should think about the similarities between cultures, not the differences.","example[23]":"Try and spot the differences between these two pictures.","example[24]":"The difference between the two cheeses is that one is made from goat’s milk.","example[25]":"I don’t think there’s any difference in the way you pronounce these two words.","example[26]":"He’s speaking Italian, not Spanish. Don’t you know the difference?","display[0]":"contrast","definition[3]":"a very clear difference that you can easily see when you compare two things or people","example[27]":"What surprised me was the contrast between Picasso’s early style and his later work.","display[1]":"gap","definition[4]":"a big difference between two amounts, two ages, or two groups of people","example[28]":"There’s a ten-year gap between Kay’s two children.","example[29]":"The gap between rich and poor is wider in the South than in the rest of the country.","example[30]":"The age gap between us didn’t seem to matter until we decided to have children.","display[2]":"gulf","definition[5]":"a very big difference and lack of understanding between two groups of people, especially in their beliefs, opinions, and way of life","example[31]":"More riots led to a growing gulf between the police and the communities in which they worked.","example[32]":"The central problem was how to bridge the gulf between the warring factions of the party.","display[3]":"disparity","definition[6]":"a big difference between two groups of people or things – use this especially when you think the difference is unfair or may cause problems","example[33]":"It is not easy to explain the disparity that still exists between the salaries of men and women.","example[34]":"the disparity in wealth between the highest and the lowest employees","example[35]":"The economic disparity between the area’s black and white citizens is a serious problem."}