{"word[0]":"strange","comparative[0]":"stranger","superlative[0]":"strangest","definition[0]":"unusual or surprising, especially in a way that is difficult to explain or understand","synonym[0]":"odd","example[0]":"strange noises","example[1]":"Does Geoff’s behaviour seem strange to you?","example[2]":"She felt there was something strange about Dexter’s voice.","example[3]":"Isn’t it strange how animals seem to sense danger?","example[4]":"It’s strange that we’ve never met before.","example[5]":"For some strange reason, I slept like a baby despite the noise.","example[6]":"Strange as it may seem, I actually prefer cold weather.","example[7]":"That’s strange. I was sure Jude was right here a second ago.","example[8]":"The strange thing is all four victims had red hair.","example[9]":"Strange to say, I was just thinking that myself.","note[0]":"strange to say","definition[1]":"someone or something that is strange is not familiar because you have not seen or met them before","example[10]":"As a child, she’d been taught never to speak to strange men.","example[11]":"I was just 20, a young girl in a strange city.","example[12]":"It was all strange to him, but he’d soon learn his way around.","note[1]":"strange to","definition[2]":"unusual or surprising, especially in a way that is difficult to understand, or that is a little frightening","example[13]":"What’s that strange noise downstairs?","example[14]":"That’s strange – I’m sure I left my keys on the table.","example[15]":"a strange old man","display[0]":"funny/odd","definition[3]":"a little strange and making you feel slightly surprised or worried","example[16]":"There’s a funny smell in the kitchen.","example[17]":"It’s odd that you can’t remember him at all.","display[1]":"curious","definition[4]":"strange, especially in an interesting way. Curious is a little more formal than strange","example[18]":"a curious fact","example[19]":"There’s something rather curious about small-town America.","example[20]":"She remembered curious little details.","display[2]":"mysterious","definition[5]":"strange – used about something that people know little about and are unable to explain or understand","example[21]":"He had disappeared in mysterious circumstances.","example[22]":"There were reports of mysterious lights in the sky.","display[3]":"eccentric","definition[6]":"strange in a way that seems slightly crazy and amusing – used about people and their behaviour","example[23]":"He lived completely alone and had some slightly eccentric habits.","example[24]":"an eccentric old lady","display[4]":"peculiar","definition[7]":"slightly strange, and different from what you would normally expect – used especially when this is either amusing or worrying","example[25]":"She sometimes wears rather peculiar clothes.","example[26]":"He had a peculiar expression on his face.","heading[0]":"very strange","display[5]":"weird","definition[8]":"very strange or very different from what you are used to","example[27]":"I had a weird dream last night.","example[28]":"It’s a weird and wonderful place.","display[6]":"bizarre","definition[9]":"extremely strange and different from what is usually considered normal","example[29]":"It was a bizarre situation.","example[30]":"Mark’s behaviour was really bizarre.","display[7]":"surreal","definition[10]":"extremely strange and unconnected with real life or normal experiences, like something out of a dream","example[31]":"His paintings are full of surreal images.","example[32]":"There is something surreal about the climate change talks in Bali.","example[33]":"The plant’s flowers were so big that they seemed almost surreal","display[8]":"uncanny","definition[11]":"very strange – used especially about someone having an unusual ability to do something, or looking surprisingly similar to someone","example[34]":"She had an uncanny knack  (=ability) of putting her finger right on a problem.","example[35]":"Alice had an uncanny resemblance to Josie.","example[36]":"his uncanny ability to pick racing winners","definition[12]":"in a way that is unusual or surprising","synonym[1]":"strangely","example[37]":"The cat’s been acting really strange – I wonder if it’s sick."}