{"word[0]":"clinic","definition[0]":"a place, often in a hospital, where medical treatment is given to people who do not need to stay in the hospital","example[0]":"an appointment at an outpatient clinic  (=clinic for someone who does not need to stay in a hospital)","example[1]":"women attending an antenatal clinic","note[0]":"dental/family planning/antenatal etc clinic","definition[1]":"a period of time during which doctors give treatment or advice to people with particular health problems","example[2]":"The baby clinic is held on Monday afternoons.","definition[2]":"a meeting during which a professional person gives advice or help to people","example[3]":"an MP’s clinic","example[4]":"a free clinic on caring for roses","definition[3]":"a place where medical treatment is given at a low cost","example[5]":"the doctors who volunteer at the inner-city clinic","definition[4]":"a group of doctors who work together and share the same offices","synonym[0]":"practice","definition[5]":"an occasion when medical students are taught how to decide what illness a patient has and how to treat it","form[0]":"types of clinic","collocation[0]":"a health/medical clinic","example[6]":"Test results from a health clinic are available in about three weeks.","collocation[1]":"a hospital clinic","example[7]":"You can be tested for infection at a special hospital clinic.","collocation[2]":"a family planning clinic","example[8]":"There are family planning clinics all over the country.","collocation[3]":"an antenatal clinic","example[9]":"The staff at the antenatal clinic will give you the results of your blood test.","collocation[4]":"a fertility clinic","example[10]":"We scheduled an appointment at the fertility clinic.","collocation[5]":"a dental clinic","example[11]":"a specialist dental clinic","collocation[6]":"an outpatient clinic","example[12]":"There's an outpatient clinic for people with diabetes.","collocation[7]":"a private clinic","example[13]":"Fees at private clinics are usually very high.","collocation[8]":"a local clinic","example[14]":"She's involved in health care education at a local clinic.","collocation[9]":"go to a clinic","example[15]":"Pregnant women should attend an antenatal clinic at least once a month.","collocation[10]":"hold a clinic","example[16]":"The hospital holds vaccination clinics once a fortnight.","form[1]":"clinic + NOUN","collocation[11]":"clinic staff","example[17]":"Clinic staff are hopeful that Stephen will make a full recovery."}