{"word[0]":"environmentally friendly","definition[0]":"not harmful to the environment","example[0]":"Cycling is very environmentally friendly.","example[1]":"environmentally friendly holidays","example[2]":"Is there such a thing as an environmentally friendly car?","display[0]":"eco-friendly","definition[1]":"not harmful to the environment – used especially about products","example[3]":"We always try to use eco-friendly cleaning products.","example[4]":"eco-friendly coffins made from newspapers","display[1]":"green","definition[2]":"not harmful to the environment – used especially in the following phrases","example[5]":"green products","example[6]":"green technology","example[7]":"green energy","example[8]":"It was voted the greenest building in Britain.","definition[3]":"clean fuels or forms of energy do not release any harmful substances into the atmosphere","example[9]":"We need cleaner fuels for cars and other road vehicles.","example[10]":"clean energy sources such as solar panels and wind turbines","display[2]":"renewable","definition[4]":"renewable energy comes from sources that can be easily replaced naturally, so that there is always more available","example[11]":"The building is heated using renewable energy from the sun.","example[12]":"The government needs to invest more in renewable energy sources.","example[13]":"Wind power is renewable and produces no greenhouse gases during operation.","display[3]":"sustainable","definition[5]":"using the Earth’s resources, without causing damage to the environment – used especially about farming, ways of living, and development","example[14]":"The flowers are produced to high environmental standards using sustainable farming methods.","example[15]":"Many people want to lead more sustainable lifestyles and to conserve the planet’s resources.","example[16]":"sustainable use of the world’s resources","display[4]":"carbon-neutral","definition[6]":"balancing the amount of carbon gases that you put into the Earth’s atmosphere with other activities that will effectively reduce the amount of carbon gases, for example by planting trees","example[17]":"a carbon-neutral company","example[18]":"Stirling is aiming to become the UK’s first carbon neutral city.","example[19]":"All new homes will be carbon-neutral.","display[5]":"low-carbon","definition[7]":"producing only a small amount of carbon","example[20]":"Research is being done into the development of low-carbon electricity.","example[21]":"We will need to have a low-carbon economy.","display[6]":"low-energy","definition[8]":"low-energy buildings and lightbulbs use very little energy","example[22]":"Position is a key factor in the design of a low-energy house."}