{"word[0]":"concession","signpost[0]":"something you allow somebody","definition[0]":"something that you allow someone to have in order to end an argument or a disagreement","example[0]":"The British were not prepared to make any concessions.","example[1]":"The committee has won a number of major concessions from the prison authorities.","note[0]":"major/important/substantial concession","example[2]":"a policy of no concessions to terrorists","note[1]":"concession to","example[3]":"his readiness to make concessions on many of the issues raised","note[2]":"concession on","example[4]":"We will try to force further concessions from the government.","note[3]":"concession from","signpost[1]":"a right","definition[1]":"a special right that a particular person or group of people is allowed to have, for example by the government or an employer, or the act of giving or allowing something as a right","example[5]":"the ending of tax concessions for home owners","example[6]":"the import/export concessions that had been granted to the island","example[7]":"the concession of autonomy to the universities","note[4]":"concession of","signpost[2]":"price reduction","definition[2]":"a reduction in the price of tickets, fees etc for certain groups of people, for example old people or children","synonym[0]":"reduction","example[8]":"To qualify for travel concessions you have to be 60.","example[9]":"Open daily, adults £4, concessions £2 (=people who have the right to a concession pay £2).","signpost[3]":"change of behaviour","definition[3]":"a change in your behaviour that you make because of a particular situation or idea","example[10]":"He took off his jacket as a concession to the heat.","example[11]":"He made no concessions to fashion.","definition[4]":"the right to have a business in a particular place, especially in a place owned by someone else","example[12]":"The company owns valuable logging and mining concessions.","definition[5]":"a small business that sells things in a place owned by someone else","example[13]":"Joe runs a hamburger concession in the mall.","collocation[0]":"make a concession","example[14]":"The government made some concessions in order to satisfy the rebels.","collocation[1]":"offer a concession","example[15]":"The King was prepared to offer some concessions to France.","collocation[2]":"win/obtain/gain/secure a concession","example[16]":"In the end, the strikers returned to work having won few concessions.","collocation[3]":"extract a concession","example[17]":"The Indian government was able to extract concessions on the price of oil.","collocation[4]":"a major/important concession","example[18]":"We made some major concessions in order to protect national security.","collocation[5]":"a significant/substantial concession","example[19]":"Israel refused to give up Sinai without some significant concession on Egypt's part.","collocation[6]":"a minor/small concession","example[20]":"Washington made a few minor concessions in the climate talks.","collocation[7]":"a further concession","example[21]":"They refused any further concessions in the argument over agricultural exports.","collocation[8]":"a military/political etc concession","example[22]":"In the past they have tried to exchange territorial concessions for peace.","definition[6]":"the right to carry out a particular business activity, given or sold to a company by a government or other public organization","example[23]":"BellSouth paid B$2.65 billion for the concession to operate cellular phones in São Paulo.","example[24]":"The company was granted a concession to build a 364 km stretch of the Warsaw-to-Berlin motorway.","definition[7]":"a small shop in a hotel, theatre, office building etc owned and managed by another business","example[25]":"Snack concession sales per person at cinemas have increased.","definition[8]":"an agreement or rule allowing someone to pay less money, tax etc than they would normally pay","example[26]":"American Express offered a rate concession to Laura Ashley’s UK operations.","example[27]":"The tax concessions apply only after the savings account has been held for five years.","definition[9]":"the amount paid to an UNDERWRITER when new shares or bonds are made available for the first time","example[28]":"a public offering of 8 million common shares, priced at $16 a share through underwriters Morgan Stanley - selling concession is 61 cents"}