{"word[0]":"bill","signpost[0]":"request for payment","definition[0]":"a written list showing how much you have to pay for services you have received, work that has been done etc","example[0]":"Have you paid the phone bill?","example[1]":"The bill for the repairs came to $650.","note[0]":"bill for","signpost[1]":"restaurant","definition[1]":"a list showing how much you have to pay for food you have eaten in a restaurant","example[2]":"Could we have the bill, please?","definition[2]":"a written proposal for a new law, that is brought to a parliament so that it can be discussed","example[3]":"The senator introduced a bill that would increase the minimum wage.","example[4]":"The House of Representatives passed a new gun-control bill.","note[1]":"approve/pass/veto a bill","definition[3]":"a piece of paper money","example[5]":"a five-dollar bill","signpost[2]":"concert/show etc","definition[4]":"a programme of entertainment at a theatre, concert, cinema etc, with details of who is performing, what is being shown etc","example[6]":"Tricia topped the bill (=was the most important performer) at the Children’s Variety Show.","signpost[3]":"bird","definition[5]":"a bird’s beak","signpost[4]":"advertisement","definition[6]":"a printed notice advertising an event","signpost[5]":"part of a hat","definition[7]":"the front part that sticks out on a hat such as a baseball cap","collocation[0]":"pay a bill","example[7]":"Most people pay their bills on time.","collocation[1]":"settle a bill","example[8]":"She went down to the lobby to settle the bill for their rooms.","collocation[2]":"foot the bill/pick up the bill","example[9]":"Taxpayers will probably have to foot the bill.","collocation[3]":"run up a bill","example[10]":"It’s easy to run up a big bill on your mobile phone.","collocation[4]":"face a bill","example[11]":"They were facing a mounting legal bill.","collocation[5]":"cut/reduce a bill","example[12]":"We need to find a way to cut our fuel bill.","collocation[6]":"a bill comes to something","example[13]":"The bill came to $60.","form[0]":"ADJECTIVES/NOUN + bill","collocation[7]":"a big/huge bill","example[14]":"Turn off the lights or we’ll get a huge electricity bill.","collocation[8]":"an electricity/gas/phone etc bill","example[15]":"I’ll have to pay the gas bill too next month.","collocation[9]":"a hotel bill","example[16]":"He paid the hotel bill by credit card.","collocation[10]":"a tax bill","example[17]":"There are various ways you can reduce your tax bill.","collocation[11]":"an unpaid bill","example[18]":"She had unpaid bills amounting to £3,000.","collocation[12]":"an outstanding bill","example[19]":"He still didn’t have enough to pay his outstanding bills.","definition[8]":"a piece of paper that tells you how much you must pay","example[20]":"Many families are struggling to pay their bills.","example[21]":"a credit card bill","example[22]":"We got a huge phone bill.","example[23]":"I asked the waiter to bring me the bill.","display[0]":"check","definition[9]":"a bill that tells you how much you must pay in a restaurant","example[24]":"Can I have the check, please?","display[1]":"invoice","definition[10]":"a document that lists the goods that a company has sent, or the services they have provided, and tells you how much you must pay. It is often sent from one company to another company","example[25]":"Payment is due ten days after receipt of the invoice.","display[2]":"tab","definition[11]":"a bill that is added up at the end of a period of time, especially for food or drinks that you have had in a restaurant or hotel","example[26]":"People staying in the hotel can order food or drinks to be put on their tab.","definition[12]":"to send someone a bill","example[27]":"Clients will be billed monthly.","example[28]":"I was billed for equipment that I didn’t order.","note[2]":"bill somebody for something","definition[13]":"a British television programme that was about a police station in London and the crimes solved by its police officers","definition[14]":"a list showing how much you have to pay for services or goods received","synonym[0]":"INVOICE","example[29]":"big companies that fail to settle their bills with smaller businesses on time","example[30]":"The government will no longer foot the bill (=pay the bill) if banks run into difficulty.","example[31]":"The average bill for electricity is £270 a year.","example[32]":"We finished coffee and asked for the bill.","definition[15]":"a written proposal for a new law","example[33]":"The wording of the bill was vague.","example[34]":"Democrats met earlier this month to draft (=write) a new tax  bill.","example[35]":"The senate haspassed a bill (=voted for one and made it law) to reform the social security system.","definition[16]":"a BANKNOTE","example[36]":"A dollar bill costs 3.2 cents to produce.","definition[17]":"a BILL OF EXCHANGE","definition[18]":"a form of borrowing for short periods of time","definition[19]":"to send a bill to someone saying how much they owe","example[37]":"They billed the Air Force for the work that they had carried out."}