{"word[0]":"have","pos[0]":"auxiliary verb","past_tense[0]":"had","third_person_singular[0]":"has","definition[0]":"used with past participles to form perfect tenses","example[0]":"Our guests have arrived.","example[1]":"Has anyone phoned?","example[2]":"We’ve been spending too much money.","example[3]":"I hadn’t seen him for 15 years.","example[4]":"‘I hope you’ve read the instructions.’ ‘Yes, of course I have.’","example[5]":"You haven’t done much, have you?","signpost[0]":"quality/feature","definition[1]":"used to say what someone or something looks like, what qualities or features they possess etc","example[6]":"She has dark hair and brown eyes.","example[7]":"Sullivan’s music does have a certain charm.","example[8]":"You need to have a lot of patience to be a teacher.","example[9]":"Wild rice has a very nutty flavour.","example[10]":"He didn’t even have the courtesy to answer my letter.","example[11]":"You should have seen the way Dad was dancing – I didn’t know he had it in him!","note[0]":"have it in you","signpost[1]":"include/contain","definition[2]":"to include or contain something or a particular number of things or people","example[12]":"Japan has a population of over 120 million.","example[13]":"How many pages has it got?","example[14]":"The tank still has water in it.","note[1]":"have something in it/them","signpost[2]":"own","definition[3]":"used to say that someone owns something or that it is available for them to use","example[15]":"They used to have a Mercedes Benz.","example[16]":"Has your secretary got a fax machine?","example[17]":"Have you ever had your own business?","example[18]":"He’s a lovely dog – how long have you had him?","example[19]":"Can I have the car tonight, Dad?","signpost[3]":"carry/hold","definition[4]":"to be holding something or carrying it with you","example[20]":"Have you got a match?","example[21]":"Look out! He’s got a gun.","example[22]":"Have you got any money on you?","note[2]":"have something on/with you","example[23]":"I’m afraid I don’t have my address book with me.","explanation[0]":"Senses 1-4 of have are not used in the progressive","bad_example[0]":"I am having","bad_example[1]":"It is having","signpost[4]":"do something","definition[5]":"to do something","example[24]":"We were just having a look around.","note[3]":"have a look/walk/sleep/talk/think etc","example[25]":"Are you going to have a swim?","signpost[5]":"eat/drink/smoke","definition[6]":"to eat, drink, or smoke something","example[26]":"She sat down and had another drink.","example[27]":"Someone had been having a cigarette in the toilet.","example[28]":"I usually have breakfast at about seven o'clock.","note[4]":"have lunch/a meal etc","definition[7]":"to experience something or be affected by something","example[29]":"We’ve been having a lot of difficulties with our new computer system.","example[30]":"I’m afraid your son has had a serious accident.","example[31]":"He is in hospital having treatment for a knee injury.","example[32]":"I hope you have a good holiday.","example[33]":"Thanks for everything – we had a great time.","note[5]":"have a good/terrible etc time","example[34]":"He found it quite natural to have people fussing over him.","note[6]":"have somebody doing something","signpost[6]":"idea/feeling","definition[8]":"to think of something or to experience a particular feeling","example[35]":"If you have any good ideas for presents, let me know.","example[36]":"I have lots of happy memories of my time in Japan.","example[37]":"He had an awful feeling of guilt.","signpost[7]":"disease/injury/pain","definition[9]":"to suffer from a disease, injury, or pain","example[38]":"Sarah’s got a cold.","example[39]":"One of the victims had a broken leg.","signpost[8]":"amount of time","definition[10]":"if you have a particular amount of time, it is available for you to do something","example[40]":"You have just 30 seconds to answer the question.","example[41]":"I haven’t time to stop and talk just now.","note[7]":"have time (to do something)","signpost[9]":"receive","definition[11]":"to receive something","example[42]":"I had lots of phone calls.","example[43]":"Have you had any news yet from Graham?","note[8]":"have something from somebody","example[44]":"I expect he had some help from his father.","signpost[10]":"in a position or state","definition[12]":"used to say that your body or something else is in a particular position or state, because you moved or did something","example[45]":"I had my eyes half-closed.","note[9]":"have something open/closed/on etc","example[46]":"Janice likes to have the window open.","example[47]":"She had her back to the door.","example[48]":"He’s always got the stereo playing.","note[10]":"have something doing something","signpost[11]":"family/friends","definition[13]":"used to say that there is someone who is your relation or friend","example[49]":"She has an uncle in Wisconsin.","example[50]":"It was nice for Alice to have friends of her own age.","signpost[12]":"job/duty","definition[14]":"to be employed in a particular job or to be responsible for doing something","example[51]":"Her boyfriend has a well-paid job.","example[52]":"The headteacher has responsibility for the management of the school.","example[53]":"I can’t stand here talking – I have work to do  (=there is work that I must do).","note[11]":"have something to do","signpost[13]":"employ/be in charge of","definition[15]":"to employ or be in charge of a group of workers","example[54]":"Margaret Gillies currently has a team of 20 volunteers working for her.","signpost[14]":"goods/rooms available","definition[16]":"if a shop or a hotel has goods or rooms, they are available for you to buy or use","example[55]":"Do you have any single rooms?","example[56]":"They didn’t have any sweaters in my size.","signpost[15]":"hold somebody","definition[17]":"to hold someone violently by a part of their body","example[57]":"They had him by the throat.","signpost[16]":"visitors/guests","definition[18]":"if you have visitors or guests, they have come to your home, office etc","example[58]":"Sorry, I didn’t realize you had visitors.","example[59]":"We had friends to stay over the weekend.","definition[19]":"if you have an event such as a meeting, party, or concert, it happens because you have organized it","example[60]":"We’re having a party on Saturday – you’re very welcome to come.","signpost[17]":"effect","definition[20]":"to cause a particular result","example[61]":"a mistake that could have disastrous results","example[62]":"Cardew was having a bad influence on the other students.","signpost[18]":"opportunity","definition[21]":"used to say that an opportunity or choice is available for you","example[63]":"If you have the chance, you should go and see it – it’s a really good film.","example[64]":"Women managers have a choice as to whether they wear trousers or a skirt.","example[65]":"Last year I had the honour of meeting the Prince of Wales.","definition[22]":"if a woman has a baby, it is born from her body","example[66]":"Anna insisted on having the baby at home.","signpost[19]":"make somebody do something","definition[23]":"to affect someone in a way that makes them start doing something","example[67]":"Within minutes he had the whole audience laughing and clapping.","note[12]":"have somebody laughing/crying etc","definition[24]":"to persuade or order someone to do something","example[68]":"She had me doing all kinds of jobs for her.","example[69]":"I’ll have Hudson show you to your room.","note[13]":"have somebody do something","example[70]":"I expect she’s had lots of men.","signpost[20]":"offering somebody something","definition[25]":"used to offer something to someone","example[71]":"Have another sandwich.","example[72]":"Won’t you have a drink before you go?","example[73]":"Please have a seat, and the doctor will be right with you.","heading[0]":"USAGE: Have got, have","explanation[1]":"In British spoken English, people usually use have got instead of have for many of its meanings Have sounds more formal and is the usual choice in written English You say  You write","example[74]":"He's got a cold","example[75]":"He has a cold","explanation[2]":"In questions in British spoken English, Have you got ? is often used instead of Do you have ? You say  You write","example[76]":"Have you got his address?","example[77]":"Do you have his address?","explanation[3]":"In negative sentences in British spoken English, you use haven't got or hasn't got You say  You write","example[78]":"He hasn't got any money","example[79]":"He does not have any money","explanation[4]":"Have got is mainly used in the present tense In the past tense you usually use had, and in the future you usually use will have","explanation[5]":"In American English, have got is much less common It is used when you want to emphasize what you are saying  It is also often used in the phrase have got to  (=have to)","example[80]":"He's got a gun!","example[81]":"We've got to go","explanation[6]":"In negative sentences, British speakers often say I haven't got  where American speakers say I don't have  In questions, British speakers say Have you got ? where American speakers say Do you have ?","definition[26]":"if you have to do something, you must do it because it is necessary or because someone makes you do it","example[82]":"We don’t have to rush – there’s plenty of time.","example[83]":"I hate having to get up early in the morning.","example[84]":"If you earn more than £5,000, you will have to pay tax.","example[85]":"I’ve got to be at the hospital at 4 o'clock.","example[86]":"It’ll have to be on a Sunday. I’ll be working every other day.","explanation[7]":"In writing, people often prefer to say someone is forced to do something or is obliged to do something, as these sound more formal than have to do something:","definition[27]":"used to say that it is important that something happens, or that something must happen if something else is to happen","example[87]":"There has to be an end to the violence.","example[88]":"You’ve got to believe me!","example[89]":"There will have to be a complete ceasefire before the Government will agree to talks.","example[90]":"You have to be good to succeed in this game.","definition[28]":"used to tell someone how to do something","example[91]":"First of all you have to mix the flour and the butter.","definition[29]":"used to say that you are sure that something will happen or something is true","example[92]":"House prices have to go up sooner or later.","example[93]":"This has to be a mistake.","example[94]":"You have got to be joking!","example[95]":"No one else could have done it – it had to be Neville.","definition[30]":"used to suggest that someone should do something because you think it would be enjoyable or useful","example[96]":"You’ll have to come and meet my wife some time.","definition[31]":"used when something annoying happens in a way that things always seem to happen","example[97]":"Of course, it had to happen today, when all the shops are shut.","definition[32]":"used to say that only one thing or person is good enough or right for someone","example[98]":"For Francesca it has to be the Ritz – nowhere else will do."}