{"word[0]":"schedule","definition[0]":"a plan of what someone is going to do and when they are going to do it","example[0]":"How can he fit everything into his busy schedule?","example[1]":"I’m going to be working to a very tight schedule (=including a lot of things that must be done in a short time).","example[2]":"The majority of holiday flights depart and arrive on schedule.","note[0]":"on schedule","example[3]":"Meg’s new book is still well ahead of schedule.","note[1]":"ahead of/behind schedule","definition[1]":"a list that shows the times that buses, trains etc leave or arrive at a particular place","definition[2]":"a formal list of something, for example prices","example[4]":"a schedule of postal charges","definition[3]":"a detailed plan of what someone is going to do and when they will do it, especially someone important","example[5]":"He has a very busy schedule.","example[6]":"The president’s schedule includes a two-day visit to St Petersburg.","display[0]":"timetable","definition[4]":"a written list that shows the exact times when something will happen, for example when planes or buses leave, or when classes at school take place","example[7]":"The timetable said there was another train at 6.15.","example[8]":"According to the class schedule, English 104 is at 10 am in Royce Hall.","display[1]":"programme","definition[5]":"a plan that shows the order of activities at a ceremony, sports meeting, public event etc","example[9]":"Who is organizing the conference programme?","example[10]":"the next event on the program","display[2]":"agenda","definition[6]":"a list of the subjects that will be discussed at a meeting","example[11]":"Attached is the agenda for the budget committee meeting.","example[12]":"the final item on the agenda","display[3]":"timeline","definition[7]":"a plan for when things will happen or how long you think something will take – used especially in business English","example[13]":"The timeline for the project is less than six months from start to finish.","example[14]":"What is the usual timeline from the sale of a house to the day you can move in?","display[4]":"itinerary","definition[8]":"a plan or list of the places you will visit on a journey, usually with the date or time that you will be there","example[15]":"The Travel Pack includes a detailed itinerary, maps, and a travel guide.","example[16]":"Let me know your itinerary when you know it.","definition[9]":"to plan that something will happen at a particular time","example[17]":"We will not cancel your holiday less than eight weeks before the scheduled departure date.","example[18]":"The elections are scheduled for mid-June.","note[2]":"be scheduled for June/Monday etc","example[19]":"Her first album is scheduled for release in September.","note[3]":"be scheduled for release/publication/completion etc","example[20]":"Prices include scheduled flights from Heathrow.","note[4]":"scheduled flight/service","example[21]":"Meetings are scheduled to take place all over the country.","note[5]":"be scheduled to do something","explanation[0]":"Schedule is usually passive","example[22]":"I’ve got a very full schedule (=I will be very busy because a lot of meetings and other activities have been arranged) today.","example[23]":"Our production schedule is tight and we may need extra staff.","example[24]":"We are running several weeks behind schedule.","example[25]":"The company is on schedule to bring out its new product in March.","definition[10]":"the list of television or radio programmes that are broadcast","example[26]":"The dramatic news disrupted all the TV schedules.","example[27]":"His show was a big success for the channel’s daytime schedule.","definition[11]":"a list added to a law, contract, or other formal document, giving details of things affected by the main document","example[28]":"The Supplier will supply to the Company the products set out in Schedule 1 to this Agreement.","definition[12]":"a list sent with an insurance policy document which gives details of the things that the policy covers","example[29]":"See the attached schedule of insurance.","definition[13]":"one of the different classes that incomes are put into under tax law. For example, in Britain there are six schedules from A to F, and income from employment falls into Schedule E","example[30]":"This amount will be taxed as income under Schedule F.","definition[14]":"a tax form for one of the different classes of income","example[31]":"I’ve scheduled a meeting for this afternoon.","note[6]":"schedule something for","example[32]":"The new airport is scheduled to open just before Christmas.","example[33]":"There are daily scheduled flights (=that fly at the same time every day) to Geneva, Zurich, or Basle."}