{"word[0]":"market","signpost[0]":"place to buy things","definition[0]":"a time when people buy and sell goods, food etc, or the place, usually outside or in a large building, where this happens","note[0]":"street market (=with a lot of different people selling things from tables, stalls etc in the street)","example[0]":"I usually buy all my vegetables at the market.","example[1]":"There’s a good antiques market here on Sundays.","note[1]":"fish/fruit and vegetable/flower etc market","definition[1]":"a shop that sells food and things for the home","signpost[1]":"country/area","definition[2]":"a particular country or area where a company sells its goods or where a particular type of goods is sold","example[2]":"Our main overseas market is Japan.","example[3]":"The domestic market makes up about 75% of their sales.","note[2]":"international/home/UK etc market","example[4]":"The world’s largest market for illegal drugs is the US.","note[3]":"market for","signpost[2]":"people who buy","definition[3]":"the number of people who want to buy something, or the type of people who want to buy it","note[4]":"niche/specialist market","example[5]":"Is there a market for his invention?","example[6]":"The market for specialist academic books is pretty small.","definition[4]":"to try to persuade people to buy a product by advertising it in a particular way, using attractive packages etc","example[7]":"If you could ever figure out how to market this, you’d make a fortune.","example[8]":"They plan to market the toy for children aged 2 to 6.","note[5]":"market something for somebody","example[9]":"Electric cars are being marketed as safe for the environment.","note[6]":"market something as something","definition[5]":"to make a product available in shops","example[10]":"The turkeys are marketed ready-to-cook.","definition[6]":"the activity of buying and selling goods or services, or the value of the goods or services sold","example[11]":"The babyfood market is worth many tens of millions of pounds a year.","example[12]":"Fast food is certainly a growth market (=one that is increasing in size).","example[13]":"Futures will tend to be overpriced in a rising market and underpriced in a falling market.","example[14]":"the market in consumer electronics","note[7]":"market in/for","example[15]":"the booming market (=a profitable one with lots of activity) for mobile communications","example[16]":"heavy losses on apartment loans in states with depressed markets (=ones with falling prices and not much activity)","example[17]":"Harley has captured (=obtained) about 60% of  the market for the biggest bikes.","definition[7]":"a particular country, area, or group of people to which a company sells or hopes to sell its goods or services","example[18]":"a magazine aimed at the teenage market","example[19]":"The company is entering the Hawaiian market as part of its nationwide expansion.","example[20]":"Import rules could make it hard for foreign van suppliers to penetrate that market (=to manage to enter it).","definition[8]":"available for people to buy","example[21]":"companies with drugs on the market or in the final stages of product-testing","example[22]":"They put their apartment on the market (=offered it for sale) for $300,000.","definition[9]":"the number of people who want to buy something","example[23]":"He’s been trying to determine if there is a market for his invention.","definition[10]":"the economic system in which prices, jobs, wages etc depend on what people want to buy, how much they are willing to pay etc","example[24]":"We should not leave credit card interest rates to the market - Congress should act.","definition[11]":"if a seller corners the market, they own or produce most of the goods on sale, and can therefore set prices","example[25]":"A trader may deliberately set out to corner the market in a product.","definition[12]":"to ask for so much money for something or for your services that no one wants to buy it or employ you","example[26]":"Supermodels are pricing themselves out of the market.","definition[13]":"the buying and selling of shares, bonds, COMMODITIES etc, or a place where this happens. Some markets are in a particular building, while trading on others takes place on computers and over the telephone, with no central building","example[27]":"The markets (=financial markets in general) here have improved and the economy is strong.","example[28]":"Fear of war shook financial markets around the world.","definition[14]":"to be ready to buy and sell particular shares, bonds etc at particular prices","example[29]":"Each company is assigned a dealer who is responsible for making a market in the stock.","definition[15]":"if a price bucks the market trend, it goes in the opposite direction to most of the other prices in the market","example[30]":"Among shares that bucked the market’s downward trend, EMI finished 4p higher.","definition[16]":"if someone cannot buck the market, they cannot avoid the effects of the market as a whole, for example by making money when everyone else is losing it","example[31]":"Governments can’t buck the market.","definition[17]":"to risk money on a financial market","example[32]":"One way to play the European markets is through publicly traded mutual funds.","definition[18]":"a time when people buy and sell goods, or the place, usually outside or in a large building, where this happens","example[33]":"A market is held in the town square every Friday.","definition[19]":"to sell something or make it available for sale, especially in a particular way","example[34]":"Toshiba’s consumer electronics products were previously marketed in Italy through a distributor.","definition[20]":"to sell something by considering what customers want or need when buying a product or service, for example how much they are willing to pay, where they will buy it etc","example[35]":"The company has marketed its services well with a highly visible media campaign."}