{"word[0]":"mentally ill","definition[0]":"having an illness that affects your mind and your behaviour","example[0]":"Many mentally ill people are treated in the community.","example[1]":"He was declared mentally ill and unfit to stand trial.","example[2]":"I couldn’t think straight. I felt like I was going crazy  (=becoming crazy).","display[0]":"mad","definition[1]":"mentally ill. This word is now usually considered offensive, and is usually used in a different meaning, when you think that someone’s ideas are not sensible","example[3]":"Swift himself went mad  (=became mad) later in life.","example[4]":"a mad old woman","display[1]":"insane","definition[2]":"having a serious and permanent mental illness","example[5]":"She went insane after her two young sons were murdered.","example[6]":"a hospital for the criminally insane","display[2]":"disturbed","definition[3]":"not behaving in a normal way because of mental or emotional problems, especially problems that are caused by bad experiences","example[7]":"She teaches emotionally disturbed children.","example[8]":"Her experiences left her deeply disturbed.","display[3]":"unstable","definition[4]":"having an emotional state that often changes very suddenly","example[9]":"Her mother was mentally unstable.","example[10]":"He lived in a small Putney flat with his ageing Aunt Bunny, and his emotionally unstable sister, Nancy.","example[11]":"He was too unstable to be a leader.","display[4]":"deranged","definition[5]":"behaving in a crazy or dangerous way, usually because of being mentally ill","example[12]":"A deranged young woman entered the school and took the life of one young boy.","display[5]":"psychopathic","definition[6]":"having a serious and permanent mental illness that causes violent or criminal behaviour","example[13]":"The film is about a psychopathic killer.","display[6]":"psychotic","definition[7]":"suffering from or caused by a serious mental illness that changes your character and makes you unable to behave in a normal way","example[14]":"psychiatric services for chronic psychotic patients.","example[15]":"There is a tendency for psychotic illnesses to be inherited.","display[7]":"neurotic","definition[8]":"relating to or suffering from a mental illness that makes you unreasonably worried of frightened","example[16]":"His mother was neurotic and insecure.","example[17]":"She’s neurotic about her weight.","example[18]":"A bored or lonely horse may become so neurotic that it chases itself around in circles."}