{"word[0]":"discussion","definition[0]":"when you discuss something","example[0]":"class discussions","example[1]":"the topics suggested for discussion","example[2]":"We have had discussions about her legal situation.","example[3]":"the discussion of important issues","note[0]":"discussion of","example[4]":"high-level discussions about trade and commerce","note[1]":"discussion about","example[5]":"The embassy will continue discussions with the Chinese government.","note[2]":"discussion with","example[6]":"The project is under discussion as a possible joint venture.","note[3]":"under discussion","definition[1]":"a piece of writing about a subject that considers different ideas or opinions about it","example[7]":"the report’s discussion of the legislation","definition[2]":"an occasion when you discuss something, or the process of discussing it","example[8]":"After a long discussion, they decided to paint the room pale blue.","example[9]":"This led to a discussion of our favourite books.","example[10]":"There are several projects under discussion  (=being discussed).","display[0]":"debate","definition[3]":"discussion of a particular subject that often continues for a long time, in which people express different opinions. Also used to mean a formal discussion of a subject, after which people vote for or against something","example[11]":"There is a lot of debate about the safety of nuclear power.","example[12]":"The student union is holding a debate on immigration.","display[1]":"talks","definition[4]":"formal discussions between governments, organizations etc","example[13]":"the Arab-Israeli peace talks","example[14]":"The next round of trade talks will be held in the spring.","example[15]":"Bilateral talks  (=between two groups or countries)on refugees took place in November.","display[2]":"negotiations","definition[5]":"official discussions between two or more groups who are trying to agree on something","example[16]":"The two sides have begun negotiations aimed at ending the dispute.","example[17]":"International negotiations on reducing sulphur dioxide emissions have ended without agreement.","display[3]":"conference","definition[6]":"a large formal meeting at which people from many places discuss their work or research, or important matters relating to their organization","example[18]":"an international conference on nuclear physics","example[19]":"the Labour Party conference","display[4]":"consultation","definition[7]":"a formal discussion in which people who are affected by or involved in something can give their opinions","example[20]":"The government promised a full public consultation before a decision was made to build the airport.","example[21]":"The revised syllabus was devised after wide consultations with the teaching profession."}