{"word[0]":"crucial","definition[0]":"something that is crucial is extremely important, because everything else depends on it","synonym[0]":"vital","example[0]":"The conservation of tropical forests is of crucial importance.","example[1]":"The city of Mycenae played a crucial role in the history of Greece.","note[0]":"play a crucial role/part in something","example[2]":"This aid money is crucial to the government’s economic policies.","note[1]":"crucial to","example[3]":"The work of monks was crucial in spreading Christianity.","note[2]":"crucial in/to doing something","example[4]":"Parents play a crucial role in preparing their children for adult life.","collocation[0]":"be of crucial importance","example[5]":"Good leadership is of crucial importance in motivating staff.","collocation[1]":"absolutely crucial","example[6]":"Technology has an absolutely crucial role in modern medicine.","collocation[2]":"prove crucial","example[7]":"His appointment was to prove crucial to the organization’s success.","collocation[3]":"remain crucial","example[8]":"Logging remains crucial to the country’s economy.","collocation[4]":"regard/consider something as crucial","example[9]":"The city was regarded as crucial to the area’s defence.","collocation[5]":"a crucial factor/part/element","example[10]":"The cost of the project is the crucial factor.","collocation[6]":"a crucial point","example[11]":"This was a crucial point in our relationship.","collocation[7]":"a crucial question","example[12]":"She seemed to be trying to avoid the crucial question.","collocation[8]":"a crucial issue","example[13]":"The study of consumer behaviour is a crucial issue in marketing.","collocation[9]":"a crucial difference","example[14]":"There is a crucial difference between the British and American attitudes.","collocation[10]":"a crucial moment/time","example[15]":"At the crucial moment, he withdrew the support of the army.","collocation[11]":"a crucial stage","example[16]":"The peace talks are now at a crucial stage.","collocation[12]":"a crucial decision/step","example[17]":"Choosing a career is a crucial decision to make.","collocation[13]":"crucial information","example[18]":"The government did not publicize this crucial information.","collocation[14]":"crucial evidence","example[19]":"The prosecution had forgotten one piece of crucial evidence."}