{"word[0]":"bear","past_tense[0]":"bore","past_participle[0]":"borne","signpost[0]":"deal with something","definition[0]":"to bravely accept or deal with a painful, difficult, or upsetting situation","synonym[0]":"stand","example[0]":"She was afraid she wouldn’t be able to bear the pain.","example[1]":"Overcrowding makes prison life even harder to bear.","example[2]":"Make the water as hot as you can bear.","example[3]":"The humiliation was more than he could bear.","example[4]":"Black people continue to bear the brunt of most racial violence  (=have to deal with the most difficult or damaging part).","example[5]":"Passengers could be insulting, and stewardesses just had to grin and bear it (=accept it without complaining).","example[6]":"Experts were worried the financial system would not be able to bear the strain.","explanation[0]":"In everyday English, people usually say that they can’t stand something, rather than that they can't bear it:","example[7]":"I couldn’t stand the noise any longer.","signpost[1]":"accept/be responsible for","definition[1]":"to be responsible for or accept something","example[8]":"Fares have gone up, perhaps to more than the market will bear.","example[9]":"Each company will bear half the costs of development.","note[0]":"bear the costs/burden","example[10]":"Developed countries bear much of the responsibility for environmental problems.","note[1]":"bear the responsibility/blame etc","definition[2]":"to be under something and support it","example[11]":"My leg was painful, and I wasn’t sure it would bear my weight.","example[12]":"a tray bearing a bottle and several glasses","example[13]":"a load-bearing wall","signpost[2]":"sign/mark","definition[3]":"to have or show a sign, mark, or particular appearance, especially when this shows that something has happened or is true","synonym[1]":"have","example[14]":"The letter bore no signature.","example[15]":"a car bearing diplomatic license plates","example[16]":"The labels bear a yellow and black symbol.","example[17]":"The town still bears the scars of the bombings during the war.","example[18]":"The store bears the hallmarks (=it has the qualities) of a family-owned business.","definition[4]":"to give birth to a baby","example[19]":"She might never be able to bear children.","example[20]":"She bore him three sons.","note[2]":"bear somebody a child/son/daughter","type[0]":"often in negatives","signpost[3]":"able to be examined/compared etc","definition[5]":"to be suitable or good enough to be examined, compared, repeated etc without failing or being wrong","example[21]":"The production figures did not bear scrutiny.","example[22]":"We believe our pupils’ results will bear comparison with any in Scotland.","example[23]":"The story is well known, but it certainly bears repeating.","signpost[4]":"carry","definition[6]":"to carry someone or something, especially something important","example[24]":"The wedding guests arrived, bearing gifts.","example[25]":"The US Constitution states that the people have a right to bear arms.","signpost[5]":"have feelings","definition[7]":"to have a particular feeling, especially a bad feeling","example[26]":"It was an accident. I don’t bear any grudges.","note[3]":"bear (somebody) a grudge","example[27]":"He was just doing his job, and I bore him no malice.","note[4]":"bear somebody no malice/ill will etc","signpost[6]":"wind/water","definition[8]":"if wind, water, or air bears something, it carries it somewhere","example[28]":"The sound of music was borne along on the wind.","signpost[7]":"name/title","definition[9]":"to have a particular name or title","example[29]":"He bore the name ‘Magnus’.","form[0]":"bear + NOUN","collocation[0]":"bear the pain","example[30]":"He knew that he couldn’t bear the pain much longer.","collocation[1]":"bear the heat/cold","example[31]":"Some people find it hard to bear the heat in the summer.","collocation[2]":"bear the strain/pressure","example[32]":"Mark couldn’t bear the pressure of the job any longer.","collocation[3]":"can hardly bear something","example[33]":"He was so ashamed that he could hardly bear to look at her.","collocation[4]":"be unable to bear something","example[34]":"Fiona was unable to bear the thought of selling the house.","collocation[5]":"be hard to bear","example[35]":"The situation was very hard to bear.","collocation[6]":"be more than somebody can bear","example[36]":"He sometimes felt the grief was more than he could bear.","collocation[7]":"bear the brunt of something","example[37]":"Shareholders will bear the brunt of the company’s financial troubles.","collocation[8]":"grin and bear it","example[38]":"It was a horrible job but she had to grin and bear it.","definition[10]":"a large strong animal with thick fur, that eats flesh, fruit, and insects","example[39]":"a mother bear and her cubs","definition[11]":"something that is very difficult to do or to deal with","example[40]":"The chemistry test was a bear.","definition[12]":"someone who sells shares or goods when they expect the price to fall","definition[13]":"someone who thinks that prices of shares, bonds, currencies, or basic goods are going to fall, and who may sell shares, bonds etc they do not actually own, expecting to be able to obtain them more cheaply later, before they have to deliver them to the buyer","example[41]":"The bears argue that after the stock market’s dramatic rise, shares are bound to fall again.","example[42]":"The bears took hold of the company, sending the shares 5p lower to 159p.","example[43]":"A contingent of dollar bears (=people who think that the price of the dollar is going to fall) still persists in the market."}