{"word[0]":"corporate","definition[0]":"belonging to or relating to a corporation","example[0]":"The company is moving its corporate headquarters  (=main offices) from New York to Houston.","example[1]":"Vince is vice-president of corporate communications.","example[2]":"Corporate America is not about to be converted to the environmentalist cause.","example[3]":"changing the corporate culture  (=the way that people in a corporation think and behave) to accept family-friendly policies","example[4]":"an advertising campaign intended to reinforce our corporate identity  (=the way a company presents itself to the public)","example[5]":"the yacht can be hired for corporate hospitality  (=entertainment provided by companies for their customers)","definition[1]":"shared by or involving all the members of a group","example[6]":"corporate responsibility","definition[2]":"used to describe a group of organizations that form a single group","example[7]":"The university is a corporate body made up of several different colleges.","collocation[0]":"corporate profits","example[8]":"U.S. corporate profits were higher than analysts predicted.","collocation[1]":"corporate culture","example[9]":"A company should trust its employees and have an open corporate culture.","collocation[2]":"the corporate sector","example[10]":"The UK corporate sector is highly competitive.","collocation[3]":"the corporate world","example[11]":"After 15 years, I really wanted to escape the corporate world.","collocation[4]":"corporate finance","example[12]":"I was trying to get a job in corporate finance.","collocation[5]":"corporate planning/strategy","example[13]":"Roche is the man in charge of corporate planning.","collocation[6]":"corporate identity/image","example[14]":"Our new logo is part of the process of developing our corporate identity.","collocation[7]":"corporate executives/managers","example[15]":"highly paid corporate executives","collocation[8]":"corporate clients/customers","example[16]":"It's a big investment bank that serves mainly corporate clients.","collocation[9]":"corporate hospitality","example[17]":"The castle can also be hired for corporate hospitality.","collocation[10]":"corporate power","example[18]":"the growth of corporate power","collocation[11]":"corporate structure","example[19]":"The company has a new corporate structure and a new management.","definition[3]":"relating to a company, usually a large one, or business in general","example[20]":"$5 million is to be used to open new stores, relocate to a new warehouse and for other corporate purposes.","example[21]":"corporate air travel","definition[4]":"a company, rather than another type of organization","example[22]":"Our customers are large corporates.","definition[5]":"bonds in companies, rather than in other types of organization","example[23]":"municipal bonds and investment-grade corporates"}