{"word[0]":"prospect","definition[0]":"the possibility that something will happen","example[0]":"I see no prospect of things improving here.","note[0]":"prospect of doing something","example[1]":"There is every prospect (=a strong possibility) of the weather remaining dry this week.","example[2]":"There are good prospects for growth in the retail sector.","note[1]":"prospect for","example[3]":"There’s a real prospect that England will not qualify for the World Cup.","note[2]":"prospect that","definition[1]":"a particular event which will probably or definitely happen in the future – used especially when you want to talk about how you feel about it","note[3]":"daunting/exciting etc prospect","example[4]":"He relishes the prospect of a fight.","example[5]":"She wasn’t exactly overjoyed at the prospect of looking after her niece.","note[4]":"be excited/alarmed/concerned etc at the prospect (of something)","example[6]":"The prospect of marriage terrified Alice.","note[5]":"prospect of","example[7]":"Greeks face the prospect of new general elections next month.","definition[2]":"a person, job, plan etc that has a good chance of success in the future","definition[3]":"a view of a wide area of land, especially from a high place","heading[0]":"– Meaning 2: a particular event which will probably or definitely happen in the future – used especially when you want to talk about how you feel about it","collocation[0]":"daunting","example[8]":"It is a pretty daunting prospect, being on stage for forty minutes.","collocation[1]":"terrifying","example[9]":"Driving through London in a strange car was a terrifying prospect.","collocation[2]":"gloomy/grim/bleak","example[10]":"Many Britons face the grim prospect of having their home repossessed.","collocation[3]":"exciting","example[11]":"We were to be her guardians. This was an exciting prospect.","example[12]":"A journey of that length was not an attractive prospect.","collocation[4]":"face the prospect (of something)","example[13]":"Now they face the prospect of unemployment.","collocation[5]":"relish the prospect (of something)","example[14]":"She would have to speak to him. She didn’t relish the prospect.","collocation[6]":"dread the prospect (of something)","example[15]":"I dread the prospect of staying here while you’re away.","collocation[7]":"be excited/thrilled/delighted etc at the prospect (of something)","example[16]":"I was excited at the prospect of going to Washington.","collocation[8]":"be alarmed/appalled/upset etc at the prospect (of something)","example[17]":"She was secretly appalled at the prospect of being looked after by her aunt.","definition[4]":"to examine an area of land or water, in order to find gold, silver, oil etc","example[18]":"The company is prospecting for gold in Alaska.","definition[5]":"to look for something, especially business opportunities","example[19]":"salesmen prospecting for new customers","definition[6]":"a possibility that something which you hope for will happen soon","example[20]":"There is little real prospect of significant economic growth.","definition[7]":"chances of future success","example[21]":"firms offering the best prospects for increasing productivity, profitability, and expansion","note[6]":"prospects for","example[22]":"In Singapore, investors remain optimistic about prospects for the economy.","definition[8]":"something that is possible or is likely to happen in the future","example[23]":"The prospect of still higher unemployment as growth slows is causing great concern.","example[24]":"Radio is an exciting prospect: the forthcoming deregulation of the industry and an expected boom in advertising revenues is finally making the City take notice.","definition[9]":"someone who is not a customer yet, but may become one in the future","example[25]":"Mercedes-Benz has kept its reputation by reminding prospects that its vehicles are ‘engineered like no other car in the world.’","example[26]":"Anglo-United was prospecting for gold in the area in the early eighties."}