{"word[0]":"withdrawal","definition[0]":"the act of moving an army, weapons etc away from the area where they were fighting","example[0]":"large-scale troop withdrawals","example[1]":"the withdrawal of UN forces","note[0]":"withdrawal of","example[2]":"the Russian withdrawal from Afghanistan","note[1]":"withdrawal from","signpost[0]":"removal/ending","definition[1]":"the removal or stopping of something such as support, an offer, or a service","example[3]":"withdrawal of government aid","definition[2]":"the act of taking money from a bank account, or the amount you take out","example[4]":"Customers can use the machine to make withdrawals of up to £250 a day.","signpost[1]":"stop taking part","definition[3]":"the act of no longer taking part in an activity or being a member of an organization","example[5]":"Germany’s withdrawal from the talks","definition[4]":"the period after someone has given up a drug that they were dependent on, and the unpleasant mental and physical effects that this causes","signpost[2]":"statement","definition[5]":"the act of saying that something you previously said was in fact untrue","synonym[0]":"retraction","example[6]":"the withdrawal of all allegations","example[7]":"There are penalties for the early withdrawal of savings.","example[8]":"cash withdrawals from ATMs","example[9]":"the withdrawal of government aid","definition[6]":"when a product is made no longer available, either for a period of time or permanently","example[10]":"The Environmental Health Services will be aware of a product withdrawal of the company’s bottled still water.","definition[7]":"when someone no longer takes part in an activity or is no longer a member of an organization","example[11]":"Poor profits resulted in the company’s withdrawal from its computer games and entertainment business.","definition[8]":"when you say that something you previously said was in fact untrue","example[12]":"The case ended with the complete withdrawal of allegations against the detainees held without trial."}