{"word[0]":"genuine","definition[0]":"a genuine feeling, desire etc is one that you really feel, not one you pretend to feel","synonym[0]":"sincere","example[0]":"‘Did he really?’ Her surprise seemed genuine.","example[1]":"The reforms are motivated by a genuine concern for the disabled.","note[0]":"genuine interest/concern/desire etc","example[2]":"a genuine fear of invasion","definition[1]":"something genuine really is what it seems to be","example[3]":"We need laws that will protect genuine refugees.","example[4]":"The strap is genuine leather.","definition[2]":"someone who is genuine is honest and friendly and you feel you can trust them","example[5]":"She is the most genuine person I’ve ever met.","definition[3]":"used about a feeling, thing, or person that really is what they seem to be","example[6]":"genuine concern","example[7]":"Experts believe that the painting is genuine.","example[8]":"genuine refugees","example[9]":"a genuine reason for taking time off work","example[10]":"If a student has genuine religious objections to a school activity, they do not have to participate.","definition[4]":"not false or artificial","example[11]":"real wood","example[12]":"His real name is Reginald.","example[13]":"It looks just like the real thing.","example[14]":"Are those flowers real or artificial?","display[0]":"authentic","definition[5]":"authentic  food, music, clothes etc are correct for the place or the period in history that they are supposed to be from","example[15]":"It’s a friendly restaurant offering authentic Greek food.","example[16]":"authentic medieval instruments","example[17]":"The dancers wore authentic Native American designs.","display[1]":"true","definition[6]":"having all the qualities you would expect a particular type of person or thing to have","example[18]":"a true friend","example[19]":"She is a true professional.","example[20]":"Being a true Red Sox fan, he never missed a game.","example[21]":"True Christians believe that Jesus is the Son of God.","display[2]":"bona fide","definition[7]":"bona fide people or things are really what they say they are, especially when this can be checked by looking at official documents","example[22]":"a bona fide medical qualification","example[23]":"a bona fide company","example[24]":"This club is only open to bona fide members.","display[3]":"hard evidence/facts","definition[8]":"evidence or facts that are genuine and can be proved","example[25]":"There was no hard evidence to support the theory."}