{"word[0]":"charm","definition[0]":"a special quality someone or something has that makes people like them, feel attracted to them, or be easily influenced by them – used to show approval","example[0]":"Joe’s boyish charm","example[1]":"She turned on the charm (=used her charm) to all the men.","example[2]":"The room had no windows and all the charm of a prison cell  (=used to say that something has no charm).","example[3]":"the charm of this small Southern city","note[0]":"charm of","definition[1]":"a very small object worn on a chain or bracelet","example[4]":"a charm bracelet","example[5]":"a small gold horseshoe worn as a lucky charm","definition[2]":"a phrase or action believed to have special magic powers","synonym[0]":"spell","collocation[0]":"have charm","example[6]":"Richard was clever and he had a lot of charm.","collocation[1]":"use your charm","example[7]":"She knew when to use her charm in order to get what she wanted.","collocation[2]":"turn on the charm","example[8]":"If you turn on the charm, I’m sure you’ll get the job.","collocation[3]":"ooze charm","example[9]":"Every time she saw him, he oozed charm.","collocation[4]":"lack charm/be lacking in charm","example[10]":"A lot of new buildings lack charm.","collocation[5]":"something loses its charm","example[11]":"He was getting older, and travel was losing its charm.","collocation[6]":"succumb to somebody’s/something’s charms","example[12]":"Thomas seemed to be succumbing to Sylvie's charms.","collocation[7]":"resist somebody’s charm","example[13]":"People say that it was impossible to resist Burton’s charm.","collocation[8]":"be part of somebody's/something's charm","example[14]":"The house is a long way from anywhere and that is part of its charm.","collocation[9]":"boyish charm","example[15]":"Women seem to love his boyish charm.","collocation[10]":"great charm","example[16]":"He was a man of great charm.","collocation[11]":"easy charm","example[17]":"Hudson was full of easy charm and smiles.","collocation[12]":"rustic charm","example[18]":"The cottage had a certain rustic charm.","collocation[13]":"natural charm","example[19]":"She had a quiet natural charm that everyone liked.","collocation[14]":"personal charm","example[20]":"He was a man of great personal charm.","collocation[15]":"considerable charm","example[21]":"Their music has considerable charm.","collocation[16]":"immense charm","example[22]":"No one could resist his immense charm.","definition[3]":"to attract someone and make them like you, sometimes in order to make them do something for you","example[23]":"We were charmed by the friendliness of the local people.","definition[4]":"to please and interest someone","example[24]":"a story that has charmed generations of children","definition[5]":"to gain power over someone or something by using magic"}