{"word[0]":"manage","definition[0]":"to direct or control a business or department and the people, equipment, and money involved in it","example[0]":"He was asked to manage a new department.","example[1]":"Managing a football team is harder than you think.","example[2]":"The company had been very badly managed.","example[3]":"a brewery which has been owned and managed by the same family for over 100 years","signpost[0]":"do something difficult","definition[1]":"to succeed in doing something difficult, especially after trying very hard","example[4]":"Juventus managed two goals in the last ten minutes.","example[5]":"I don’t know how I’ll manage it, but I’ll be there.","example[6]":"I finally managed to push the huge animal away.","note[0]":"manage to do something","example[7]":"How do you manage to stay so slim?","example[8]":"We somehow managed to persuade him.","explanation[0]":"In written English, people often use succeed in doing something rather than manage to do something, as it sounds more formal:","example[9]":"At a time of depression, Roosevelt succeeded in restoring hope.","signpost[1]":"deal with problems","definition[2]":"to succeed in dealing with problems, living in a difficult situation etc","example[10]":"I don’t know how she manages with seven children.","example[11]":"We didn’t have the proper equipment, but we managed somehow.","example[12]":"How do you manage without a washing machine?","note[1]":"manage without","example[13]":"I can’t afford to get you a new coat – you’ll have to manage with the one you’ve got.","note[2]":"manage with","signpost[2]":"time/money etc","definition[3]":"to use your time, money etc sensibly, without wasting it","example[14]":"Paying a little each month can help you manage your money.","example[15]":"You need to learn to manage your time more effectively.","example[16]":"Consultants can help academic institutions to manage their resources more efficiently.","signpost[3]":"live without much money","definition[4]":"to succeed in buying the things that you need in order to live even though you do not have very much money","synonym[0]":"get by","example[17]":"I honestly don’t know how we’ll manage now Keith’s lost his job.","example[18]":"It’ll be tight, but I guess I’ll just about manage.","example[19]":"People like Jim have to manage on as little as $75 a week.","note[3]":"manage on","signpost[4]":"not need help","definition[5]":"to be able to do something or carry something without help","example[20]":"Can you manage all right, Mum?","example[21]":"You’ll never manage that suitcase; let me take it.","example[22]":"Thank you, but I think I can manage perfectly well on my own.","signpost[5]":"keep tidy","definition[6]":"to succeed in keeping something neat and tidy","example[23]":"He’ll never manage such a big garden on his own.","definition[7]":"to control the behaviour of a person or animal, so that they do what you want","example[24]":"It’s hard to manage your children and do the shopping.","example[25]":"The horse was huge and vicious. Giles was the only one who could manage her.","signpost[6]":"be strong enough","definition[8]":"to be able to do something because you are strong enough or healthy enough","example[26]":"He tried to walk, but managed only a few shaky steps.","signpost[7]":"eat/drink","definition[9]":"to be able to eat or drink something","example[27]":"Could you manage another drink?","signpost[8]":"cause problems","definition[10]":"to do something that causes problems – used humorously","example[28]":"Andrews has managed to get himself sacked.","example[29]":"I don’t know how I managed to arrive so late.","signpost[9]":"have time for","definition[11]":"to be able to meet someone or do something, even though you are busy","example[30]":"Can you manage  dinner tonight?","example[31]":"‘Is there any chance you could work late?’ ‘I think I could manage an hour.’","explanation[1]":"You manage to do something","example[32]":"She managed to persuade him","bad_example[0]":"She managed persuading him","explanation[2]":"that you manage something or just that you manage","example[33]":"Did you manage it?","example[34]":"Somehow I managed","display[0]":"succeed","explanation[3]":"You succeed in doing something","example[35]":"She succeeded in persuading him","bad_example[1]":"She succeeded to persuade him","explanation[4]":"You can also use succeed on its own","example[36]":"I hope you succeed","bad_example[2]":"I hope you succeed it","definition[12]":"to direct or control a business, part of a business, or the people who work in it","example[37]":"He will be managing a staff of about 1,500.","example[38]":"The unions had undermined the employers’ ability to manage.","definition[13]":"if a financial institution manages someone’s money, it decides when and where to invest it","example[39]":"investors who use trading advisers to manage their money in futures markets","example[40]":"professionally managed pension funds"}