{"word[0]":"depressed","definition[0]":"very unhappy","example[0]":"She felt lonely and depressed.","example[1]":"The divorce left him deeply depressed.","example[2]":"I was depressed at the thought of all the hard work ahead.","example[3]":"Don’t get depressed about it.","note[0]":"depressed about","definition[1]":"suffering from a medical condition in which you are so unhappy that you cannot live a normal life","example[4]":"patients who are clinically depressed","definition[2]":"an area, industry etc that is depressed does not have enough economic or business activity","example[5]":"Britain’s depressed housing market","definition[3]":"a depressed level or amount is lower than normal","example[6]":"a depressed appetite","collocation[0]":"feel depressed","example[7]":"The boy said he was unhappy at school and felt depressed.","collocation[1]":"get/become depressed","example[8]":"If you get depressed, talk to someone about it.","collocation[2]":"look/sound depressed","example[9]":"Is Jo all right? She sounded a bit depressed.","collocation[3]":"severely/seriously depressed","example[10]":"He became severely depressed after losing his job.","collocation[4]":"deeply depressed","example[11]":"I could see that she was deeply depressed.","collocation[5]":"slightly/mildly depressed","example[12]":"He was exhausted and mildly depressed.","collocation[6]":"a bit depressed","example[13]":"I felt a bit depressed because I was so short of money.","collocation[7]":"clinically depressed","example[14]":"His medical records show that he was suicidal and clinically depressed.","definition[4]":"an economy or industry that is depressed does not have enough manufacturing or business activity","example[15]":"The Swiss drug company was a major winner in an otherwise depressed sector as its yearly results provided welcome comfort for investors.","example[16]":"help for companies suffering from the depressed economic climate","definition[5]":"if the price of something is depressed, it is lower than normal","example[17]":"The timber was sold, albeit at prices depressed by the glut of timber on the market."}