{"word[0]":"holiday","definition[0]":"a time of rest from work, school etc","example[0]":"The school holidays start tomorrow.","example[1]":"I’m away on holiday until the 1st of June.","note[0]":"on holiday","example[2]":"He came to stay with us in the school holidays.","note[1]":"in the holidays","example[3]":"a holiday from her usual responsibilities","note[2]":"holiday from","explanation[0]":"In everyday British English, when someone is temporarily away from their work or studies, people often say they are off, rather than on holiday. Note, however, that off can also mean that someone is away from their work or studies because they are sick:","example[4]":"‘Where’s Kate?’ ‘She’s off this week.’","definition[1]":"a period of time when you travel to another place for pleasure","example[5]":"We’re going to Spain for our holidays.","example[6]":"I haven’t had a proper holiday for two years.","example[7]":"He caught malaria while on holiday in Africa.","definition[2]":"a day fixed by law on which people do not have to go to work or school","example[8]":"The 4th of July is a national holiday in the US.","collocation[0]":"go on holiday","example[9]":"The children were excited about going on holiday.","collocation[1]":"have/take a holiday","example[10]":"Teachers cannot take holidays during term time.","collocation[2]":"book a holiday","example[11]":"I booked the holiday online.","form[0]":"ADJECTIVES/NOUN + holiday","collocation[3]":"a skiing/camping/walking etc holiday","example[12]":"They went on a camping holiday in France.","collocation[4]":"a package holiday","example[13]":"The company organizes package holidays to Spain and Greece.","collocation[5]":"a summer holiday","example[14]":"They were going to a house on the coast for their summer holidays.","collocation[6]":"a winter holiday","example[15]":"Why not try a winter holiday for a change?","collocation[7]":"a family holiday","example[16]":"I first visited Orkney on a family holiday when I was a boy.","collocation[8]":"an annual holiday","example[17]":"We were getting ready for our annual holiday in Cornwall.","collocation[9]":"your dream holiday","example[18]":"They won a dream holiday for two to the Caribbean.","form[1]":"holiday + NOUN","collocation[10]":"a holiday resort","example[19]":"a holiday resort in Spain","collocation[11]":"a holiday destination","example[20]":"Marmaris is one of Turkey's most popular holiday destinations.","collocation[12]":"a holiday brochure","example[21]":"We were looking through holiday brochures thinking about the summer.","collocation[13]":"holiday photos","example[22]":"Do you want to see our holiday snaps?","collocation[14]":"a holiday romance","example[23]":"It was just a holiday romance; I never saw him again.","collocation[15]":"a holiday abroad","example[24]":"They were planning a holiday abroad that year.","collocation[16]":"the holiday of a lifetime","example[25]":"We took the family on a holiday of a lifetime to Orlando, Florida.","heading[0]":"GRAMMAR: Holidays","explanation[1]":"You use holidays when talking about a period when you are not working or studying, or when you are travelling","explanation[2]":"You say the holidays","example[26]":"Soon it will be the holidays","explanation[3]":"You say my/your/her etc holidays","example[27]":"Where do you want to go for your holidays?","definition[3]":"to spend your holiday in a place – used especially in news reports","example[28]":"They’re holidaying in Majorca.","note[3]":"holiday in/at","definition[4]":"a day fixed by law on which people do not go to work or school and shops and businesses are closed","example[29]":"The Zurich stock market was closed yesterday for a national holiday.","example[30]":"This Monday is a public holiday in France.","example[31]":"The London stockmarket will reopen tomorrow after the bank holiday.","definition[5]":"a time of rest from work or school. Most employees are allowed a fixed number of days each year as paid holiday","example[32]":"My secretary’s on holiday this week.","example[33]":"You have to take your holiday by the end of the year.","example[34]":"Most employees would like to have more holiday entitlement (=the right to take longer holidays).","definition[6]":"a period of time spent in a place for pleasure","example[35]":"They’re on holiday in the Caribbean.","example[36]":"Make sure you have adequate holiday insurance before you leave.","example[37]":"a popular holiday resort","definition[7]":"a period of time when it is not necessary to make payments that must normally be made"}