{"word[0]":"flight","definition[0]":"a journey in a plane or space vehicle, or the plane or vehicle that is making the journey","example[0]":"He immediately booked a flight to Toulouse.","example[1]":"There are only three flights a day to Logan Airport from Heathrow.","signpost[0]":"flying","definition[1]":"when something flies through the air","example[2]":"In 1968, the first supersonic airliner took flight (=began flying).","example[3]":"pelicans in flight","note[0]":"in flight","signpost[1]":"movement through air","definition[2]":"an object’s or bird’s movement through the air","example[4]":"During its flight, the weapon twists and turns.","signpost[2]":"stairs","definition[3]":"a set of stairs between one floor and the next","example[5]":"Bert lives two flights down from here.","example[6]":"She fell down a whole flight of stairs.","note[1]":"a flight of stairs/steps","definition[4]":"when you leave a place in order to try and escape from a person or a dangerous situation","note[2]":"put somebody to flight (=make someone run away especially by fighting or threatening them)","example[7]":"When the alarm sounded, the whole gang took flight.","note[3]":"take flight","example[8]":"Donald Woods' hasty flight from South Africa early in 1978","note[4]":"flight from","signpost[3]":"birds","definition[5]":"a group of birds all flying together","synonym[0]":"flock","example[9]":"a flight of swallows","note[5]":"flight of","collocation[0]":"book a flight","example[10]":"I booked the flight over the Internet.","collocation[1]":"get a flight","example[11]":"I’ll be there tomorrow morning if I can get a flight.","collocation[2]":"catch a flight","example[12]":"They caught a flight that night to Frankfurt.","collocation[3]":"board a flight","example[13]":"We arrived at the departure lounge to board the flight to Madrid.","collocation[4]":"miss a flight","example[14]":"Jack overslept and missed his flight.","collocation[5]":"charter a flight","example[15]":"The club have chartered a special flight for fans.","collocation[6]":"operate flights","example[16]":"The airline operates three flights a day between London and New York.","collocation[7]":"get on/off a flight","example[17]":"She’d just got off a flight from Buenos Aires.","collocation[8]":"travel on a flight","example[18]":"Passengers travelling on flight BMI 373 to Zurich should proceed to gate 17.","collocation[9]":"a flight is cancelled","example[19]":"All flights have been cancelled due to fog.","collocation[10]":"a flight is delayed","example[20]":"Her flight was delayed and she arrived over an hour late.","collocation[11]":"a flight is diverted","example[21]":"Our flight was diverted to Manchester because of poor weather.","collocation[12]":"a flight is bound for London/New York etc","example[22]":"Johnson boarded a flight bound for Caracas.","collocation[13]":"good/pleasant/comfortable","example[23]":"Have a good flight!","example[24]":"The flight had been smooth all the way.","collocation[14]":"bumpy","example[25]":"The flight was very bumpy, and we really wondered whether we would make it.","collocation[15]":"long/short","example[26]":"I was very tired after the long flight.","collocation[16]":"cheap flights","example[27]":"Environmental groups are calling for an end to cheap flights.","collocation[17]":"a direct/non-stop flight","example[28]":"the first direct flight to Tokyo","collocation[18]":"an international flight","example[29]":"The number of international flights increased by over 5% last year.","collocation[19]":"a domestic/internal flight","example[30]":"Is there a domestic flight between Havana and Varadero?","collocation[20]":"a long-haul flight","example[31]":"You should wear comfortable clothes on a long-haul flight.","collocation[21]":"a scheduled flight","example[32]":"There are scheduled flights between the islands.","collocation[22]":"a charter flight","example[33]":"The company is operating charter flights to Crete.","collocation[23]":"a connecting flight","example[34]":"We had to wait for three hours in New York before catching a connecting flight to Chicago.","collocation[24]":"an intercontinental flight","example[35]":"Passengers on intercontinental flights can reserve seats with extra legroom.","collocation[25]":"a routine flight","example[36]":"They were on a routine flight when their helicopter developed engine trouble","collocation[26]":"an airline flight","example[37]":"domestic airline flights","collocation[27]":"a test flight","example[38]":"The aircraft made a successful test flight on June 3rd.","collocation[28]":"a maiden flight","example[39]":"The plane’s maiden flight is scheduled for November.","form[0]":"flight + NOUN","collocation[29]":"the flight time","example[40]":"Our estimated flight time is three hours and fifteen minutes.","collocation[30]":"the flight path","example[41]":"They lived directly underneath a busy flight path.","collocation[31]":"the flight number","example[42]":"Write the flight number on all your luggage labels.","collocation[32]":"a flight plan","example[43]":"For some reason the pilot diverged from the flight plan.","definition[6]":"a journey by plane","example[44]":"The airline began the regular flights to Santiago less than a year ago.","example[45]":"a return flight to Hong Kong","definition[7]":"a top-flight manager is one who is in a very high position in an organization and who is very good at the job","example[46]":"It is worth investing in a selection procedure to find a top-flight sales person.","definition[8]":"the rapid movement of money, goods etc out of a country or particular type of investment","example[47]":"The country experienced a flight of capital as investors put their faith in more favourable economic climates","example[48]":"The flight into gold and dollars has produced a dramatic leap in black-market rates."}