{"word[0]":"discount","definition[0]":"a reduction in the usual price of something","note[0]":"discount store/shop/warehouse (=a place where you can buy goods cheaply)","example[0]":"Members get a 15% discount.","note[1]":"10% discount/discount of 25% etc","example[1]":"discount airfares to Europe","note[2]":"discount price/fare","example[2]":"Employees can buy books at a discount.","note[3]":"at a discount","example[3]":"The Young Persons Railcard gives you a discount on rail travel.","note[4]":"discount on","collocation[0]":"get/receive a discount","example[4]":"You get a discount if you book more than ten tickets.","collocation[1]":"give (somebody) a discount","example[5]":"Many theatres give discounts to students.","collocation[2]":"offer (somebody) a discount","example[6]":"Lenders may offer a discount on larger loans.","collocation[3]":"ask for a discount","example[7]":"I asked for a discount because the vase was slightly damaged.","collocation[4]":"be entitled to a discount","example[8]":"Staff are entitled to a 20% discount.","collocation[5]":"a special discount","example[9]":"Some of the hotels offer special discounts during the winter.","collocation[6]":"a big/small discount","example[10]":"If you spend over £50, you get a big discount.","collocation[7]":"a substantial/good discount","example[11]":"Insurance companies give substantial discounts to mature drivers.","collocation[8]":"a 10%/40% etc discount","example[12]":"The magazine is offering readers a 15% discount on its subscription fees.","form[0]":"discount + NOUN","collocation[9]":"a discount price","example[13]":"You can buy books online at discount prices.","collocation[10]":"a discount fare","example[14]":"The bus company offers discount fares to pensioners.","collocation[11]":"a discount scheme","example[15]":"Many stores operate discount schemes for regular customers.","collocation[12]":"a discount card","example[16]":"The discount card entitles customers to 15% off.","collocation[13]":"a discount store/shop","example[17]":"There's a lot of competition from large discount stores.","definition[1]":"to regard something as unlikely to be true or important","example[18]":"Experts discounted the accuracy of the polls.","example[19]":"General Hausken had not discounted the possibility of an aerial attack.","definition[2]":"to reduce the price of something","example[20]":"Games were discounted to as little as $5.","definition[3]":"a reduction in the cost of goods or services in relation to the normal cost","example[21]":"You can nearly always get books there at a discount.","example[22]":"The company is trying to increase market share by selling its trainers at discount prices.","definition[4]":"the amount by which the price of a SECURITY is less than the value shown on it","example[23]":"Zero-coupon bonds are sold at a discount to their face value and pay no interest until maturity.","definition[5]":"if a BILL OF EXCHANGE is traded at a fine rate of discount, it is bought and sold at a price near to the amount shown on it, because the buyer knows there is little risk of it not being paid","example[24]":"Accepting Houses accept bills of exchange for a fee, which enables the bill to be traded at a fine rate of discount.","definition[6]":"if something in a financial market is traded at a discount, it is bought and sold at a lower price than something else to which it is compared","example[25]":"The premium of platinum over gold narrowed to $11, but there is a good chance platinum will trade at a discount to gold soon.","definition[7]":"to offer something for sale at a lower price than usual","example[26]":"The retailers discounted the goods below prices set by the manufacturer.","definition[8]":"to change the price of something in a financial market by taking into account good or bad news that affects it","example[27]":"I think the market has discounted almost all of what can go right with the economy this year.","definition[9]":"to sell SECURITIES at less than the value shown on them. The person who buys the securities makes a profit when the borrower buys them back at their full value at the repayment date","definition[10]":"to sell a BILL OF EXCHANGE or other COMMERCIAL BILL before its normal payment date for less than it will be worth on that date. The buyer makes a profit when the bill is paid in full by the borrower at the repayment date"}