{"definition[0]":"showing a lack of good sense or good judgment","synonym[0]":"silly","example[0]":"stupid mistakes","example[1]":"That was a stupid thing to say.","example[2]":"I can’t believe Kate was stupid enough to get involved in this.","example[3]":"It was stupid of me to lose my temper.","example[4]":"Whose stupid idea was this?","note[0]":"stupid idea/question","definition[1]":"having a low level of intelligence, so that you have difficulty learning or understanding things","example[5]":"He understands – he’s not stupid.","example[6]":"I couldn’t do it, and it made me feel stupid.","definition[2]":"used when you are talking about something or someone that makes you annoyed or impatient","example[7]":"I can’t get this stupid radio to work.","example[8]":"What is that stupid idiot doing?","definition[3]":"showing a total lack of good sense or good judgment. Stupid  sounds very strong and is often used when you are annoyed or strongly criticizing someone’s behaviour","example[9]":"I wish you’d stop asking stupid questions.","example[10]":"It was stupid of me to leave the door unlocked.","example[11]":"Well, if you’re stupid enough to skate on the lake, you deserve to fall in.","definition[4]":"doing or saying things that are not sensible or serious, and that may make you feel embarrassed later. Silly sounds much gentler than stupid","example[12]":"a silly mistake","example[13]":"Don’t be so silly! There’s nothing wrong with you.","example[14]":"I think you’re silly to worry so much about your hair.","display[0]":"daft","definition[5]":"not sensible, often in a way that is also amusing","example[15]":"Is this another of your daft ideas?","example[16]":"Don’t be daft! Of course you’re not too old to go clubbing.","display[1]":"dumb","example[17]":"a dumb question","example[18]":"He was dumb enough to believe her.","example[19]":"Oh, I just did the dumbest thing back there, I forgot my purse.","display[2]":"foolish","definition[6]":"stupid. Foolish sounds rather formal and is used mainly in written English. The usual words to use in everyday English are silly or stupid","example[20]":"It was a foolish thing to say.","example[21]":"They did not want to look foolish.","example[22]":"It was all a foolish dream.","example[23]":"I think the board of directors made a foolish choice that it will later regret.","display[3]":"unwise","definition[7]":"done without thinking carefully enough about the possible disadvantages that may result","example[24]":"She knew the marriage was unwise.","example[25]":"an unwise choice of words","example[26]":"It would be very unwise to speculate.","display[4]":"brave","definition[8]":"used when you think that what someone is planning or suggesting is certain to fail, but you do not want to say directly that they are behaving in a stupid way","example[27]":"The leader of the opposition described it as ‘a brave decision.’","example[28]":"I think he’s being very brave.","heading[0]":"very stupid","definition[9]":"not at all sensible or reasonable – used when you are very surprised by someone’s behaviour or what they have said","example[29]":"Ian’s got some crazy plan to drive across Africa.","example[30]":"She looked at me as if I was crazy!","example[31]":"You’re crazy to think of hitch-hiking on your own.","display[5]":"ridiculous","definition[10]":"extremely stupid","example[32]":"You look ridiculous in that hat.","example[33]":"Some people spend a ridiculous amount of money on cars.","example[34]":"It’s absolutely ridiculous to suggest that he would do something like that.","display[6]":"absurd/ludicrous","definition[11]":"extremely stupid – used especially when an idea or situation seems strange or illogical","example[35]":"How can a return ticket cost less than a single? It’s totally absurd!","example[36]":"It was a ludicrous idea.","example[37]":"Some of the objections to the theory are simply absurd.","display[7]":"laughable","definition[12]":"so stupid that you cannot believe someone is telling the truth or being serious","example[38]":"The accusations were almost laughable.","example[39]":"a laughable suggestion","example[40]":"It would be laughable if it wasn’t so serious.","definition[13]":"an insulting way of talking to someone who you think is being stupid","example[41]":"No, stupid, don’t do it like that!"}