{"word[0]":"describe","definition[0]":"to say what something or someone is like by giving details about them","example[0]":"The police asked her to describe the man.","example[1]":"Another approach to the problem is described in Chapter 3.","example[2]":"After the operation her condition was described as comfortable.","note[0]":"describe somebody/something as (being/having) something","example[3]":"The youth is described as being 18 to 19 years old.","example[4]":"It’s difficult to describe how I feel.","note[1]":"describe how/why/what etc","example[5]":"So describe this new boyfriend to me!","note[2]":"describe somebody/something to somebody","example[6]":"He described finding his mother lying on the floor.","note[3]":"describe doing something","definition[1]":"to talk or write about a person, place, event etc, in order to show what they are like","example[7]":"Could you try and describe the man you saw?","example[8]":"In her book, she describes her journey across the Sahara.","example[9]":"Police described the attack as particularly violent.","display[0]":"tell somebody about somebody/something","definition[2]":"to describe someone or something to someone. This phrase is more commonly used than describe  in everyday spoken English","example[10]":"So, tell me about your holiday!","example[11]":"My friends have told me all about you!","display[1]":"depict","definition[3]":"to describe someone or something in a piece of writing","example[12]":"His stories depict life in Trinidad as seen through the eyes of a young boy.","example[13]":"In this new biography she is depicted as a lonely and unhappy woman.","display[2]":"portray/represent","definition[4]":"to describe someone or something in a particular way","example[14]":"College teachers are often represented on television shows as slightly eccentric.","example[15]":"The magazine has been criticized for the way it portrays women.","example[16]":"The treatment has been portrayed as a painless way of curing cancer, which is simply not true.","example[17]":"Police have represented her as a willing participant in the crimes.","display[3]":"characterize somebody/something as something","definition[5]":"to describe someone or something by emphasizing one particular quality or feature about them","example[18]":"He characterized himself as ‘an average American’.","example[19]":"The successful schools were characterized as innovative and creative.","display[4]":"paint somebody/something as something","definition[6]":"to describe someone or something, especially in a way that makes people believe something that is not true","example[20]":"Not all young people are as bad as they’re painted in the press.","example[21]":"We won, yet the media is painting it as a victory for our opponents.","example[22]":"The woman was painted as having only a slight grasp of reality.","display[5]":"paint a picture","definition[7]":"to describe a situation, so that people can get a general idea of what it is like","example[23]":"Can you paint a picture of life in Japan for us?","example[24]":"My uncle’s letters generally painted a rosy picture of how things were.","example[25]":"The report painted a bleak picture of the management’s failures."}