{"definition[0]":"things that people and animals eat, such as vegetables or meat","example[0]":"The restaurant serves good food at affordable prices.","example[1]":"I love Italian food, especially pasta.","example[2]":"He was told to cut down on salty and fatty foods.","collocation[0]":"good/excellent","example[3]":"The hotel was nice and the food was really good.","collocation[1]":"delicious/tasty","example[4]":"Thanks for dinner – the food was delicious.","example[5]":"The food is all so fresh.","collocation[2]":"healthy","example[6]":"We try to give the kids good healthy food.","collocation[3]":"nourishing/nutritious","example[7]":"The food was nourishing but not particularly tasty.","collocation[4]":"plain/simple","example[8]":"He liked eating simple food, nothing spicy.","collocation[5]":"spicy","example[9]":"Spanish food is not usually very spicy.","collocation[6]":"hot food","example[10]":"She wanted a rest and some hot food.","collocation[7]":"cold food","example[11]":"The cafeteria only serves cold food.","collocation[8]":"Italian/French/Chinese etc food","example[12]":"The restaurant serves delicious Italian food.","collocation[9]":"exotic food","example[13]":"The shop specializes in selling exotic food like kangaroo and crocodile meat.","collocation[10]":"fatty foods","example[14]":"Limit your intake of fatty foods.","collocation[11]":"starchy foods","example[15]":"Starchy foods include bread, rice, pasta, and potatoes.","collocation[12]":"have food","example[16]":"The family hadn’t had any food for days.","collocation[13]":"eat food","example[17]":"He sat in the corner and ate his food.","collocation[14]":"cook/prepare food","example[18]":"I have to cook some food for this evening.","collocation[15]":"serve food","example[19]":"She served food and cleared tables all evening.","collocation[16]":"enjoy your food","example[20]":"I’ve never seen anyone enjoy their food so much.","collocation[17]":"chew food","example[21]":"He chewed the food slowly and carefully.","collocation[18]":"swallow food","example[22]":"While she was ill, she had trouble swallowing her food.","collocation[19]":"digest food","example[23]":"Aphids have bacteria in their guts that help them digest food.","collocation[20]":"food tastes good/delicious etc","example[24]":"The food at Jan’s house always tastes good.","collocation[21]":"food smells good","example[25]":"The food smelt good to her.","collocation[22]":"be off your food","example[26]":"The baby is off his food.","collocation[23]":"go off your food","example[27]":"Since becoming ill, he has gone off his food.","collocation[24]":"a food supply","example[28]":"The government must ensure an adequate food supply.","collocation[25]":"the food industry","example[29]":"The food industry has responded to consumer concerns about health.","collocation[26]":"food production","example[30]":"Farmers have increased food production to meet demand.","collocation[27]":"food products","example[31]":"The nutrient content of most food products is displayed on the packaging.","collocation[28]":"food prices","example[32]":"Food prices have increased rapidly in recent months.","collocation[29]":"a food shortage","example[33]":"He remembered the food shortages of the war years.","collocation[30]":"a food scare","example[34]":"The meat industry has been badly affected by recent food scares.","collocation[31]":"food colouring","example[35]":"Dilute a little food colouring with water.","collocation[32]":"food additives","example[36]":"These chemicals have been approved as food additives.","explanation[0]":"Food is usually uncountable","example[37]":"There was not enough food for everyone","bad_example[0]":"enough foods","explanation[1]":"Food is used as a countable noun when talking about particular types of food","example[38]":"The doctor advised her to avoid fatty foods","example[39]":"Butter is a healthy food","definition[1]":"things that people and animals eat","example[40]":"You can buy good fresh food in the market.","example[41]":"Do you like Japanese food?","display[0]":"dish","definition[2]":"a type of food that is cooked in a particular way","example[42]":"a traditional English dish","example[43]":"They also offer vegetarian dishes.","display[1]":"speciality","definition[3]":"a type of food that a restaurant or place is famous for","example[44]":"Fish dishes are a specialty of the region.","example[45]":"Home made pies are one of the hotel’s specialities.","display[2]":"delicacy","definition[4]":"an unusual food which people in a particular place like to eat","example[46]":"The local delicacies include laverbread (boiled seaweed).","example[47]":"I was keen to try out the local delicacies.","display[3]":"diet","definition[5]":"the type of food that someone usually eats","example[48]":"You shouldn’t have too much salt in your diet.","example[49]":"In the Andes, the main diet is beans, potatoes, and corn.","display[4]":"cooking","definition[6]":"food made in a particular way, or by a particular person","example[50]":"Herbs are used a lot in French cooking.","example[51]":"I love my Mum’s home cooking.","display[5]":"cuisine","definition[7]":"the food you can eat in a particular restaurant, country, or area","example[52]":"Italian cuisine","example[53]":"Trying the local cuisine is all part of the fun of travelling.","display[6]":"nutrition","definition[8]":"food considered as something that is necessary for good health and growth","example[54]":"a book on nutrition","example[55]":"Many homeless people suffer from poor nutrition.","display[7]":"nourishment","definition[9]":"goodness that you get from food, which helps your body to stay healthy","example[56]":"There's not much nourishment in fast food.","display[8]":"fare","definition[10]":"the kind of food that is served in a place – used especially when saying how interesting it is","example[57]":"In China you can feast on bird’s nest soup and other exotic fare.","example[58]":"Dinner was pretty standard fare (=the usual kind of food).","heading[0]":"types of food","display[9]":"fast food","definition[11]":"food such as hamburgers, which is prepared quickly and which you can take away with you to eat","example[59]":"He ballooned to 300lbs on a diet of fast food.","display[10]":"junk food","definition[12]":"food that is full of sugar or fat, and is bad for your health","example[60]":"I used to eat loads of junk food.","display[11]":"GM food","definition[13]":"food made from vegetables and animals that have had their genetic structure changed","example[61]":"There has been a lot of research into the safety of GM food.","display[12]":"organic food","definition[14]":"food that is produced without using harmful chemicals","example[62]":"Shoppers are willing to pay more for organic food.","display[13]":"health food","definition[15]":"food that is thought to be good for your health","example[63]":"You can buy the ingredients in any good health food shop.","display[14]":"superfood","definition[16]":"a type of food that is believed to be good for your health because it contains a lot of a particular type of vitamin, mineral etc","example[64]":"Superfoods such as blueberries are often promoted as having magic health-giving properties.","display[15]":"vegetarian food","definition[17]":"food that does not contain meat","example[65]":"The restaurant specializes in vegetarian food.","display[16]":"processed food","definition[18]":"food that has chemicals in it to make it last a long time","example[66]":"The colourings and flavourings in processed food are chemicals produced in factories.","display[17]":"canned food","definition[19]":"food that is sold in cans","example[67]":"We had to live on canned food for a week.","example[68]":"Tinned food was sent as emergency aid.","display[18]":"frozen food","definition[20]":"food that is kept at a very low temperature to make it last a long time","example[69]":"Some people claim that frozen food is just as healthy as fresh food.","display[19]":"convenience food","definition[21]":"food that is sold in cans, packages etc, so that it can be prepared quickly and easily","example[70]":"I found that I had more time to cook, instead of just heating up convenience food.","display[20]":"baby food","definition[22]":"special food for babies","example[71]":"The soup was horrible – it tasted like baby food.","display[21]":"pet/dog/cat/bird etc food","definition[23]":"food for animals that you keep as pets","example[72]":"She spent a fortune on pet food."}