{"word[0]":"nomination","definition[0]":"the act of officially suggesting someone or something for a position, duty, or prize, or the fact of being suggested for it","example[0]":"All the committee’s nominations were approved.","example[1]":"Who will get the Republican nomination for president?","note[0]":"nomination for","definition[1]":"the name of a book, film, actor etc that has been suggested to receive an honour or prize","example[2]":"The nominations for the Academy Awards were announced Tuesday.","definition[2]":"the act of giving someone a particular job, or the fact of being given that job","example[3]":"O'Neil’s nomination as chief executive","note[1]":"nomination as","collocation[0]":"get/receive a nomination","example[4]":"The film got the nomination for Best Drama.","collocation[1]":"win/secure a nomination","example[5]":"Do you think she has enough votes to win the nomination?","collocation[2]":"seek a nomination","example[6]":"He is seeking the Republican nomination in the Senate race.","collocation[3]":"accept a nomination","example[7]":"Lieberman accepted the nomination as the vice-presidential candidate.","collocation[4]":"withdraw a nomination","example[8]":"After hostile questioning, he withdrew his nomination to be CIA director.","collocation[5]":"make a nomination","example[9]":"The president makes the nominations of judges for the Supreme Court.","collocation[6]":"oppose a nomination","example[10]":"Senator Hatch said that he would oppose Lee's nomination to assistant attorney general.","collocation[7]":"approve a nomination","example[11]":"The Senate unanimously approved her nomination.","form[0]":"ADJECTIVES/NOUN + nomination","collocation[8]":"the presidential/Senate etc nomination","example[12]":"He was unsuccessful in his campaign for the presidential nomination in 2008.","collocation[9]":"the Republican/Democratic etc nomination","example[13]":"Feinstein beat Van de Kamp for the Democratic mayoral nomination.","collocation[10]":"an Oscar/Emmy/Grammy etc nomination","example[14]":"The novel has received a National Book Award nomination.","definition[3]":"the act of officially suggesting someone for a job, position, or prize, or the fact of being suggested for it","definition[4]":"the act of choosing someone for a particular job, or the fact of being chosen"}