{"word[0]":"era","definition[0]":"a period of time in history that is known for a particular event, or for particular qualities","example[0]":"His death marked the end of an era.","example[1]":"the Victorian era","example[2]":"We live in an era of instant communication.","note[0]":"era of","example[3]":"a new era of world peace","form[0]":"ADJECTIVES/NOUN + era","collocation[0]":"a new era","example[4]":"The talks signalled a new era of cooperation between the two countries.","collocation[1]":"the present era","example[5]":"People feel much less secure in the present era of international terrorism.","collocation[2]":"the modern/post-war/Victorian etc era","example[6]":"a collection of romantic paintings from the Victorian era","collocation[3]":"the Blair/Bush etc era","example[7]":"The end of the Bush era was defined, at least in part, by the war in Iraq.","collocation[4]":"a bygone era","example[8]":"The buildings have the elegance of a bygone era.","collocation[5]":"a golden era","example[9]":"a collection of songs from the golden era of rock 'n' roll","collocation[6]":"enter an era","example[10]":"We have entered an era of instant global communication.","collocation[7]":"usher in an era","example[11]":"His death ushered in an era of political instability.","collocation[8]":"an era begins","example[12]":"A new era began for Northern Ireland with the signing of the peace agreement.","collocation[9]":"an era ends","example[13]":"The era of cheap oil has ended.","collocation[10]":"the beginning/end of an era","example[14]":"The closure of the last coal mine marked the end of an era in Wales.","collocation[11]":"the dawn/dawning of a new era","example[15]":"The fall of the Berlin Wall marked the dawn of a new era in Europe.","definition[1]":"(the Equal Rights Amendment) a suggested change to US law, which was intended to give women the same legal rights as men. Although the suggested law was agreed to by Congress, not enough states agreed in time for it to become a law.","definition[2]":"abbreviation for EQUAL RIGHTS AMENDMENT"}