{"word[0]":"ethnic","definition[0]":"relating to a particular race, nation, or tribe and their customs and traditions","note[0]":"ethnic violence/divisions/strife etc (=violence etc between people from different races or cultures)","example[0]":"The school teaches pupils from different ethnic groups.","example[1]":"ethnic Russians in Estonia","example[2]":"plans to partition the republic along ethnic lines (=in a way that keeps different ethnic groups apart)","example[3]":"The students are from a variety of ethnic backgrounds.","note[1]":"ethnic background/origin","collocation[0]":"an ethnic group","example[4]":"People of Ukrainian descent are Canada’s fifth largest ethnic group.","collocation[1]":"an ethnic minority","example[5]":"Ethnic minorities have tended to live together in the same areas of the city.","collocation[2]":"ethnic origin/background","example[6]":"Schools are increasingly composed of pupils of different religions and different ethnic origins.","collocation[3]":"an ethnic Russian/Albanian etc","example[7]":"Romania’s 1.6 million ethnic Hungarians make up about 7 percent of the country’s population.","collocation[4]":"an ethnic mix","example[8]":"The city has a wonderful ethnic mix.","collocation[5]":"ethnic diversity","example[9]":"Chicago prides itself on its ethnic diversity.","collocation[6]":"ethnic violence/conflict","example[10]":"Hundreds were killed and injured in the country’s worst outbreak of ethnic violence.","collocation[7]":"ethnic divisions","example[11]":"Ethnic divisions continue to plague parts of America.","collocation[8]":"ethnic tension","example[12]":"It is feared that the growing ethnic tension could lead to civil war.","collocation[9]":"an ethnic identity","example[13]":"These small tribal communities share a common ethnic identity.","definition[1]":"someone who comes from a group of people who are a different race, religion etc or who have a different background from most other people in that country","example[14]":"In that neighborhood of New York, we were all ethnics."}