{"word[0]":"like","signpost[0]":"similar","definition[0]":"similar to something else, or happening in the same way","example[0]":"Her hair is dark brown like mine.","example[1]":"A club should be like a big family.","example[2]":"He eats like a pig!","example[3]":"My experience is very much like that described in the book.","example[4]":"He’s very like his brother.","example[5]":"Sometimes you sound just like (=exactly like) my mum!","example[6]":"He’s growing more like his father every day.","example[7]":"He looked nothing like (=not at all like) the man in the police photograph.","example[8]":"The garden looked like a jungle.","note[0]":"look/sound/feel/taste/seem like","example[9]":"At last he felt like a real soldier.","signpost[1]":"example","definition[1]":"for example","example[10]":"Things like glass, paper, and plastic can all be recycled.","example[11]":"Try to avoid fatty foods like cakes and biscuits.","explanation[0]":"In written English, people usually use for example, for instance, or such as rather than like:","example[12]":"packaging materials, for instance paper, glass, and plastic","example[13]":"Try to avoid fatty foods such as cakes and biscuits.","signpost[2]":"typical","definition[2]":"typical of a particular person","example[14]":"It’s not like Steven to be late.","note[1]":"be like somebody to do something","example[15]":"It’s just like her to run away from her responsibilities!","signpost[3]":"think something is nice","definition[3]":"to enjoy something or think that it is nice or good","opposite[0]":"dislike","example[16]":"I like your jacket.","example[17]":"I don’t really like classical music.","example[18]":"Do you like this colour?","example[19]":"I like my coffee quite weak.","example[20]":"I don’t like it when you get angry.","example[21]":"How do you like living in London  (=how much do you like it)?","example[22]":"I quite like their new album.","example[23]":"We really liked the film.","example[24]":"The time I like best (=like most of all) is the evening when it’s cool.","example[25]":"I didn’t like the idea of being a single parent.","example[26]":"I don’t like talking in public.","note[2]":"like doing something","example[27]":"I like to see people enjoying themselves.","note[3]":"like to do something","example[28]":"One of the things I like about John is his sense of humour.","note[4]":"like something about somebody/something","signpost[4]":"like a person","definition[4]":"to think that someone is nice or enjoy being with them","example[29]":"Jessica’s really nice, but I don’t like her boyfriend.","example[30]":"You’ll like my brother.","example[31]":"I really like Sam.","example[32]":"She’s a lovely girl and I like her very much.","example[33]":"In time, I got to like her  (=began to like her).","signpost[5]":"approve of something","definition[5]":"to approve of something and think that it is good or right","example[34]":"I don’t like dishonesty.","example[35]":"I don’t like the way he shouts at the children.","example[36]":"He’s never liked talking about people behind their backs.","example[37]":"I don’t like him taking all the credit when he didn’t do any of the work.","note[5]":"like somebody doing something","example[38]":"She doesn’t like to swear in front of the children.","signpost[6]":"do something regularly","definition[6]":"to try to do something regularly or make something happen regularly","example[39]":"I like to get up early and get a bit of work done before breakfast.","example[40]":"We like our students to take part in college sports activities.","note[6]":"like somebody to do something","signpost[7]":"Facebook","definition[7]":"to click a Facebook ‘like’ button on a webpage to show that you like or agree with something","signpost[8]":"romantic","definition[8]":"to think someone is sexually attractive","example[41]":"Do you think Alex likes me?","explanation[1]":"You like someone or something","example[42]":"I like my teacher","example[43]":"She likes tennis","explanation[2]":"You like doing something","example[44]":"She likes playing tennis","explanation[3]":"You like to do something","example[45]":"She likes to play tennis at weekends","bad_example[0]":"She likes play tennis","explanation[4]":"Like doing something and like to do something both mean the same thing You use like to do especially when saying that someone does something regularly or often","explanation[5]":"Like  is not usually used in the progressive You say","example[46]":"I like animals ","example[47]":"She liked to make cakes","bad_example[1]":"I am liking animals","bad_example[2]":"She was liking to make cakes","explanation[6]":"In spoken English, people sometimes say I’m liking to describe their present feelings about something that is happening right now or that they have just seen or heard about","example[48]":"I’m liking this music – what is it?","definition[9]":"to think that someone or something is nice","example[49]":"I like your dress – it’s a beautiful colour.","example[50]":"Do you like spaghetti?","example[51]":"What did you like about the movie?","example[52]":"I like travelling by train.","example[53]":"I like to see the children enjoying themselves.","example[54]":"Everybody liked Mr Schofield.","display[0]":"be fond of somebody/something","definition[10]":"to like someone or something, especially something that you have liked for a long time or someone who you have known for a long time","example[55]":"Connie had always been fond of animals.","example[56]":"Over the years, I’ve become quite fond of him.","example[57]":"He had always been fond of drinking at lunchtime, perhaps too fond.","display[1]":"be keen on somebody/something","definition[11]":"to like someone or something – often used in negative sentences","example[58]":"I like Maria but I’m not keen on her husband.","example[59]":"Our English teacher was very keen on Shakespeare, but I couldn’t stand him.","example[60]":"I was keen on all sports at school.","example[61]":"I know he’s keen on opera. Let’s take him to see ‘La Traviata’.","example[62]":"I’m quite keen on the idea of having a fancy dress party.","display[2]":"be into something","definition[12]":"to like doing a particular activity or be interested in a particular subject – used especially by young people","example[63]":"She’s really into music at the moment.","example[64]":"What kind of films are you into?","display[3]":"have a thing about somebody/something","definition[13]":"to like someone or something, especially something surprising or unusual","example[65]":"I’ve always had a thing about wolves.","example[66]":"He has this thing about tall women.","display[4]":"be partial to something","definition[14]":"to like to have something – often used humorously","example[67]":"He’s partial to the occasional glass of wine.","display[5]":"something grows on you","definition[15]":"used when saying that you begin to like something, especially something that you did not like before","example[68]":"I didn’t like the colour of the room at first, but it’s growing on me.","heading[0]":"to like something very much","display[6]":"love/adore","definition[16]":"to like something very much. Adore is stronger than love but is less common","example[69]":"I love the smell of coffee.","example[70]":"The children absolutely adore her books.","display[7]":"be crazy about something","definition[17]":"to be extremely interested in an activity and spend a lot of time doing it or watching it","example[71]":"Jonah’s crazy about basketball.","example[72]":"She’s always been mad about horses.","display[8]":"have a passion for something","definition[18]":"to like an activity very much, because it gives you a lot of pleasure or excitement","example[73]":"From a very early age he had a passion for fast cars.","example[74]":"To be a great performer, you have to work very hard and have a passion for the music you play.","display[9]":"be addicted to something","definition[19]":"to like doing something so much that you spend all your free time doing it","example[75]":"My son’s addicted to computer games – he hardly ever comes out of his room.","example[76]":"I started watching the show out of curiosity, but now I’m addicted!","definition[20]":"in the same way as. Some people consider this use to be incorrect","example[77]":"No one else can score goals like he can!","example[78]":"Don’t talk to me like you talk to a child.","definition[21]":"as if. Some people think that this use is not correct English","example[79]":"He looked at me like I was mad.","example[80]":"It looks like it’s going to rain.","example[81]":"This meat smells like it’s gone bad.","definition[22]":"used in speech to fill a pause while you are thinking what to say next","example[82]":"The water was, like, really cold.","example[83]":"I was just, like, standing there.","definition[23]":"similar in some way","example[84]":"The second dispute was sorted out in a like manner.","example[85]":"They get on well together because they are of like mind.","example[86]":"Try to buy two fish of like size.","definition[24]":"used after a noun to say that something is similar to or typical of the noun","example[87]":"a jelly-like substance","example[88]":"childlike simplicity","example[89]":"ladylike behaviour"}