{"word[0]":"shadow","signpost[0]":"dark shape","definition[0]":"the dark shape that someone or something makes on a surface when they are between that surface and the light","example[0]":"the long dark shadow of an old oak tree","example[1]":"It was hot, and we decided to walk in the shadow of the wall  (=along the wall, where its shadow would fall).","note[0]":"in the shadow of something","signpost[1]":"darkness","definition[1]":"darkness caused by something preventing light from reaching a place","example[2]":"The room was half in shadow.","note[1]":"in shadow","example[3]":"In the shadows, something moved.","note[2]":"in the shadows","signpost[2]":"bad effect/influence","definition[2]":"the bad effect or influence that something has, which makes other things seem less enjoyable, attractive, or impressive","example[4]":"The events of September 11th cast a shadow over the celebrations.","note[3]":"cast a shadow over/on something","example[5]":"For years, people had been living under the shadow of communism.","note[4]":"in/under the shadow of something","collocation[0]":"cast/throw a shadow","example[6]":"The building cast a shadow across the narrow street.","collocation[1]":"a shadow falls somewhere","example[7]":"The footsteps came closer, and a shadow fell across the table.","collocation[2]":"the shadows lengthen","example[8]":"Already the shadows were lengthening.","collocation[3]":"a dark/black shadow","example[9]":"She saw the dark shadow of a man in the doorway.","collocation[4]":"a long shadow","example[10]":"Long shadows stretched across the grass from the apple trees.","collocation[5]":"flickering shadows","example[11]":"Candles cast strange flickering shadows on the walls.","definition[3]":"to follow someone closely in order to watch what they are doing","example[12]":"Detectives shadowed him for weeks.","definition[4]":"to cover something with a shadow, or make it dark","example[13]":"a narrow street which was shadowed by a huge Catholic church","explanation[0]":"Shadow is usually passive in this meaning","definition[5]":"to watch someone very closely or work with them in order to learn how they do their job","example[14]":"The managers were shadowed by trainees in the bank’s development programme.","definition[6]":"to change at the same rate or in the same way as something","example[15]":"In London, share prices shadowed Wall Street’s, to close midway.","example[16]":"Gloomy news in the technology sector was shadowed by smaller electronics stocks."}