{"word[0]":"worried","definition[0]":"unhappy because you keep thinking about a problem, or about something bad that might happen","example[0]":"She gave me a worried look.","example[1]":"His parents must be worried sick (=extremely worried).","example[2]":"I’m really worried about my brother.","note[0]":"worried about","example[3]":"Local people are worried by the rise in crime.","note[1]":"worried by","example[4]":"I was worried we wouldn’t have enough money.","note[2]":"worried (that)","collocation[0]":"very/really worried","example[5]":"We were really worried about him during the divorce.","collocation[1]":"increasingly worried","example[6]":"The family became increasingly worried about her safety.","collocation[2]":"seriously/deeply worried","example[7]":"Hazel was now seriously worried. Why hadn’t he come back?","collocation[3]":"desperately worried","example[8]":"All this time I was desperately worried about my family.","collocation[4]":"a little/slightly worried","example[9]":"I was a bit worried about my exams.","collocation[5]":"not unduly worried","example[10]":"Jerry did not sound unduly worried at the prospect of going to jail.","collocation[6]":"be worried","example[11]":"I was so worried!","collocation[7]":"get/become worried","example[12]":"You should have called me. I was getting worried.","collocation[8]":"look worried","example[13]":"Don’t look so worried! It’ll be fine.","collocation[9]":"worried sick/stiff","example[14]":"Where have you been? We’ve been worried sick!","collocation[10]":"a worried expression/look","example[15]":"John came in with a worried look on his face.","collocation[11]":"a worried frown","example[16]":"Her worried frown deepened.","definition[1]":"not feeling happy or relaxed because you keep thinking about a problem or something bad that might happen","example[17]":"I was worried that you had forgotten our date.","example[18]":"It’s awful if you are worried about money.","example[19]":"I was so worried that I couldn’t sleep at all.","display[0]":"anxious","definition[2]":"worried because you think something bad might happen or has happened. Anxious is more formal than worried, and is often used about a general feeling of worry, when you are not sure what has happened","example[20]":"A lot of employees are anxious about their jobs.","example[21]":"Anxious relatives waited for news.","display[1]":"nervous","definition[3]":"worried or frightened about something you are going to do or experience, and unable to relax","example[22]":"Everyone feels nervous before an exam.","example[23]":"The thought of going into hospital was making me nervous.","display[2]":"uneasy","definition[4]":"a little worried because you feel there may be something wrong and you are not sure what is going to happen","example[24]":"When she still wasn’t home by midnight, I began to feel uneasy.","example[25]":"The total silence was making me feel uneasy.","display[3]":"concerned","definition[5]":"worried, usually about a problem affecting someone else or affecting the country or the world","example[26]":"Many people are concerned about the current economic situation.","example[27]":"Police say that they are concerned for the safety of the missing girl.","display[4]":"bothered","definition[6]":"worried by something that happens – often used in negative sentences","example[28]":"She didn’t seem particularly bothered by the news.","display[5]":"troubled","definition[7]":"very worried, so that you think about something a lot","example[29]":"She fell into a troubled sleep.","example[30]":"a troubled expression","example[31]":"‘Are you okay, Ben? You look troubled.’","display[6]":"apprehensive","definition[8]":"a little worried about something you are going to do, or about the future, because you are not sure what it will be like","example[32]":"I felt a bit apprehensive about seeing him again after so long.","display[7]":"stressed (out)","definition[9]":"very worried and tired because of problems, too much work etc, and unable to relax or enjoy life","example[33]":"He’d been working ten hours a day for ages and was stressed out.","example[34]":"an extremely stressed single mother"}