{"word[0]":"cover","signpost[0]":"hide/protect","definition[0]":"to put something over or be over something in order to hide, close, or protect it","example[0]":"Cover the pot and bake for an hour.","example[1]":"She wore a low-cut dress, partly covered by a thin shawl.","example[2]":"Dan covered his face with his hands.","note[0]":"cover something with something","signpost[1]":"layer","definition[1]":"if something covers a surface, it forms a layer over it","example[3]":"Grey mould covered the walls.","example[4]":"Much of the country is covered by snow.","example[5]":"The bulletin board was covered with messages.","note[1]":"cover something with/in something","example[6]":"The eruption of the volcano covered states as far away as Montana in a fine layer of ash.","signpost[2]":"include","definition[2]":"to include or deal with a particular subject or group of things","example[7]":"a course covering business law","example[8]":"Are there any areas you feel are not covered adequately in the book?","example[9]":"‘Exercise’ is a word which covers a vast range of activities.","example[10]":"We need more time to cover so much ground (=include so many things).","example[11]":"pollutants that are not covered by the Kyoto agreement","definition[3]":"to travel a particular distance","example[12]":"They were hoping to cover 40 miles yesterday.","example[13]":"A leopard can cover a lot of ground very quickly.","definition[4]":"to spread over an area","example[14]":"The city covers 25 square miles.","definition[5]":"to report the details of an event for a newspaper or a television or radio programme","example[15]":"I’d just returned from covering the Cambodian war.","definition[6]":"if a sum of money covers the cost of something, it is enough to pay for it","example[16]":"The award should be enough to cover her tuition fees.","example[17]":"Airlines are raising fares to cover the rising costs of fuel.","signpost[3]":"insurance","definition[7]":"if your insurance covers you or your possessions, it promises to pay you money if you have an accident, something is stolen etc","example[18]":"Most policies cover accidental damage to pipes.","example[19]":"The treatment wasn’t covered by her health care insurance.","example[20]":"Are we covered for theft?","note[2]":"cover somebody against/for something","example[21]":"He thought he was covered to drive the vehicle.","note[3]":"cover somebody to do something","signpost[4]":"guns","definition[8]":"to protect someone by being ready to shoot anyone who attacks them","example[22]":"I’ll make for the door – cover me, will you?","definition[9]":"to aim a gun at a person or a place where people might be, in order to prevent them from moving or escaping","example[23]":"He stepped into the doorway and swung the gun up to cover the corridor.","definition[10]":"to stay close to a member of the opposing team or a part of the field in order to prevent your opponents from gaining points","definition[11]":"to perform or record a song that was originally recorded by another artist","example[24]":"They’ve covered several hits from the 1980s.","definition[12]":"to put something over, on, or around something else, to hide it, protect it, or improve its appearance","example[25]":"Cover the dough, and leave it to rise.","example[26]":"She wears a lot of make-up to cover her spots.","display[0]":"put something over something","definition[13]":"to put a cloth, blanket etc loosely over the top of something in order to cover it","example[27]":"They gave him a blanket to put over his legs.","display[1]":"wrap","definition[14]":"to put paper, plastic, cloth etc tightly around something in order to protect, decorate, or post it","example[28]":"I haven’t wrapped her birthday present yet.","display[2]":"envelop","definition[15]":"to surround something completely so that it is difficult to see – used especially about darkness, smoke, and clouds","example[29]":"At sunset, darkness enveloped the town.","display[3]":"be shrouded in mist/darkness/smoke etc","definition[16]":"to be covered and hidden in mist, smoke etc","example[30]":"The mountains were shrouded in mist.","signpost[5]":"protection","definition[17]":"something that is put on top of something else to protect it","example[31]":"a blue duvet cover","example[32]":"a plastic cover","example[33]":"A dust cover (=to keep dirt etc off) hung over the painting.","signpost[6]":"books","definition[18]":"the outer front or back part of a magazine, book etc","example[34]":"His photo’s on the cover of ‘Newsweek’ again.","example[35]":"I read the magazine from cover to cover (=all of it).","example[36]":"an advertisement on the back cover","note[4]":"front/back cover","example[37]":"The cover shot was of three guys in army kit.","note[5]":"cover photo/shot/picture","signpost[7]":"shelter","definition[19]":"shelter or protection from bad weather or attack","example[38]":"We were forced to take cover in a barn.","example[39]":"Three soldiers broke cover (=left the place where they were hiding).","example[40]":"He was shot in the head as he ran for cover.","note[6]":"run/dive for cover","definition[20]":"the protection insurance gives you, so that it pays you money if you are injured, something is stolen etc","example[41]":"medical cover","example[42]":"cover against fire and theft","note[7]":"cover against/for","signpost[8]":"war","definition[21]":"military protection and support given to aircraft, ships etc that are likely to be attacked","example[43]":"fighters used as cover for ground troops","signpost[9]":"plants","definition[22]":"trees and plants that grow in large numbers on a piece of land","example[44]":"Once the forest cover is felled, rains wash away the soil.","example[45]":"With its spreading stems, ivy makes good ground cover.","definition[23]":"clouds, snow etc that partly hide the sky or the ground","example[46]":"Cloud cover in the morning should clear later.","note[8]":"cloud/snow/fog etc cover","definition[24]":"an arrangement in which people do a job or provide a service, especially because the people who normally do it are not there","example[47]":"It’s your responsibility to arrange adequate cover for holiday periods.","example[48]":"night-time ambulance cover","definition[25]":"a new recording of a song, piece of music etc that was originally recorded by a different artist","example[49]":"She’s opted to do a cover version for her first single.","signpost[10]":"secret","definition[26]":"behaviour or activities that seem normal or honest but are being used to hide something bad or illegal","example[50]":"The gang used the shop as a cover for drug deals.","note[9]":"cover for","example[51]":"All that toughness is just a cover for his inability to show affection.","form[0]":"ADJECTIVES/NOUN + cover","collocation[0]":"the front/back cover","example[52]":"The price of the book is on the back cover.","collocation[1]":"a hard/soft cover","example[53]":"I never buy books in hard cover – they’re much more expensive.","collocation[2]":"a book/magazine cover","example[54]":"There was a blonde girl on the magazine cover.","form[1]":"cover + NOUN","collocation[3]":"a cover story","example[55]":"Last month’s cover story was entitled ‘Your Child’s Brain’.","collocation[4]":"a cover photo/shot","example[56]":"The picture became the July 4th cover shot.","collocation[5]":"a cover design","example[57]":"the cover design of the Christmas issue","collocation[6]":"a cover girl","example[58]":"She had always liked the idea of being a cover girl.","collocation[7]":"read something from cover to cover","example[59]":"He read it from cover to cover in less than three hours.","definition[27]":"something that is put on or over something else to protect it, for example a piece of metal, plastic, or glass","example[60]":"a manhole cover","example[61]":"the cover that goes over the barbecue","display[4]":"covering","definition[28]":"a layer of something, or a sheet of something, that covers something else","example[62]":"There was light covering of snow on the ground.","example[63]":"The hard shell acts as a protective covering.","example[64]":"the cloth coverings on the altar","display[5]":"lid","definition[29]":"a cover for a container such as a pan or a box","example[65]":"the lid of the box","example[66]":"a saucepan lid","display[6]":"top/cap","definition[30]":"the thing that you put on top of a bottle, tube, or pen, in order to prevent the liquid or other things inside from coming out","example[67]":"I can’t find the cap for the pen.","example[68]":"Put the top back on the milk!","example[69]":"the cap that goes on the toothpaste","display[7]":"cork","definition[31]":"the top part that you put on top of a bottle of wine","example[70]":"Can you take off the cork for me?","display[8]":"wrapping","definition[32]":"a sheet of paper, plastic etc that is put around something in order to cover or protect it","example[71]":"John tore the wrapping off his presents.","example[72]":"The lamp was still in its wrapping.","display[9]":"wrapper","definition[33]":"a piece of paper or plastic that is put around something you buy, especially a small object","example[73]":"Put the candy wrappers in your pocket.","example[74]":"He took the drinking straw out of its wrapper.","definition[34]":"insurance against losing something or suffering damage, injury etc","example[75]":"The policies provide cover for death of the policyholder.","example[76]":"You have to pay an extra premium to have insurance cover on your personal possessions.","definition[35]":"the value that someone or something is insured for","example[77]":"insurance cover of up to £5000 per item for loss or damage","definition[36]":"something valuable, for example property or an insurance policy, that you promise to give to a bank or someone who has lent you money if you fail to pay the money back","synonym[0]":"COLLATERAL","definition[37]":"the amount of notes and coins kept by a bank to meet the needs of its customers","definition[38]":"when an insurance policy covers someone or something, the insurance company will pay out money if the person dies or is injured, or if something is damaged, stolen etc","example[78]":"You are not covered by your medical insurance if an accident happens abroad.","example[79]":"Our optional Payment Protector plan covers you against loss of income in the event of sickness, accident or compulsory redundancy.","note[10]":"cover somebody against something","definition[39]":"if an amount of money covers something, it is enough to pay for it","example[80]":"It took a massive $1.68 billion pretax charge to cover losses from bad loans.","definition[40]":"if an institution covers a loan, it makes sure that it has something valuable, for example property or an insurance policy, that it can keep if the loan is not repaid","example[81]":"Many of these banks’ loans no longer have collateral that covers the amount of the loan.","definition[41]":"to obtain and pay for a currency, bonds, shares etc that are needed to make a sale that has been agreed, for example in a FUTURES CONTRACT","example[82]":"The price of zinc for immediate delivery rose sharply because Chinese zinc producers that had sold short had to cover their positions."}