{"word[0]":"requirement","definition[0]":"something that someone needs or asks for","example[0]":"The refugees’ main requirements are food and shelter.","example[1]":"The new computer system will meet all our requirements.","note[0]":"meet/fulfil/satisfy a requirement","example[2]":"The increase in gas-fired power stations means traditional coal ones are becoming surplus to requirements.","note[1]":"surplus to requirements","example[3]":"Potatoes can provide one-third of our daily requirement of vitamin C.","note[2]":"requirement of","definition[1]":"something that must be done because of a law or rule","example[4]":"If you are installing a new bathroom, it has to meet the requirements of the Building Regulations.","example[5]":"Two measures have been introduced as legal requirements.","definition[2]":"something, especially good examination results, that a college, employer etc says you must have in order to do something","example[6]":"English 4 is a requirement for English majors.","note[3]":"requirement for","example[7]":"To find out about entry requirements for students, write to the college admissions board.","example[8]":"The minimum requirement for the post was a degree in engineering.","collocation[0]":"meet a requirement","example[9]":"We finally found a house that seemed to meet all of our requirements.","collocation[1]":"satisfy/fulfil a requirement","example[10]":"Our aim is to satisfy our customers’ requirements.","collocation[2]":"comply with requirements","example[11]":"Failure to comply with these requirements is a criminal offence.","collocation[3]":"impose requirements","example[12]":"Because the regulations impose new requirements on small businesses, they will prove costly.","collocation[4]":"suit somebody’s requirements","example[13]":"You could design and build your own house to suit your requirements.","form[0]":"ADJECTIVES/NOUNS + requirement","collocation[5]":"a special requirement","example[14]":"He modified the car to suit his own special requirements.","collocation[6]":"a basic requirement","example[15]":"Water is a basic requirement of life.","collocation[7]":"an essential requirement","example[16]":"Confidence is an essential requirement for success.","collocation[8]":"a minimum requirement","example[17]":"That certificate is a minimum requirement for entry to music college.","collocation[9]":"a legal/statutory requirement","example[18]":"There is no legal requirement to carry identity papers.","collocation[10]":"safety requirements","example[19]":"All companies are required to meet Health and Safety requirements.","collocation[11]":"entry requirements","example[20]":"Applicants must satisfy the normal entry requirements for the programme.","collocation[12]":"energy requirements","example[21]":"65 percent of the country’s energy requirements were met by imported oil.","collocation[13]":"be surplus to requirements","example[22]":"The old school building is now surplus to requirements.","definition[3]":"something that an official organization says a company or person must have or do","example[23]":"There are deed restrictions, including a requirement that the buyer live in the property.","definition[4]":"something that someone needs or wants","example[24]":"a product that meets customer requirements","example[25]":"Nuclear power plants generate a fifth of U.S. electricity requirements."}