{"word[0]":"disposal","definition[0]":"when you get rid of something","example[0]":"bomb disposal experts","example[1]":"the safe disposal of radioactive waste","note[0]":"disposal of","definition[1]":"a small machine under the kitchen sink which breaks vegetable waste into small pieces","synonym[0]":"waste disposal","definition[2]":"the sale of something you own such as a house, a business, or land","example[2]":"The profit or loss on the disposal of an asset must be accounted for.","definition[3]":"the way in which an amount of money is used","example[3]":"They had complete control over the disposal of the funds.","form[0]":"ADJECTIVES/NOUN + disposal","collocation[0]":"safe disposal","example[4]":"Talks were held on the safe disposal of nuclear weapons.","collocation[1]":"illegal disposal","example[5]":"People were put at risk by the illegal disposal of clinical waste.","example[6]":"Most countries have improved their standards of waste disposal.","collocation[2]":"refuse disposal","example[7]":"Refuse disposal is the responsibility of county councils.","collocation[3]":"sewage disposal","example[8]":"The city invested thousands in improved sewage disposal.","collocation[4]":"bomb disposal","example[9]":"The building was evacuated and a bomb disposal team moved in.","form[1]":"disposal + NOUN","collocation[5]":"a disposal site","example[10]":"The waste was sent by rail to a disposal site in Utah.","collocation[6]":"disposal facilities","example[11]":"There are inadequate disposal facilities for toxic waste.","collocation[7]":"a disposal problem","example[12]":"All cities have a waste disposal problem.","definition[4]":"when someone gets rid of something they no longer need or want","example[13]":"European Community environment ministers agreed to tighten controls on the production, transport and disposal of waste.","definition[5]":"an asset that is sold, and the act of selling it","example[14]":"The disposal of the 34 stores will allow the company to concentrate on its most profitable operations.","example[15]":"Continuing its asset disposal program, the car maker agreed to sell its 12.5% stake in the energy company."}