{"word[0]":"confused","definition[0]":"unable to understand or think clearly about what someone is saying or what is happening","example[0]":"I’m totally confused. Could you explain that again?","example[1]":"All the roads looked the same and he felt thoroughly confused.","example[2]":"If you’re confused about anything, phone me.","note[0]":"confused about","definition[1]":"not clear or not easy to understand","example[3]":"Witness statements presented a confused picture of the incident.","example[4]":"a lot of confused ideas","definition[2]":"unable to understand what someone is saying or what is happening","example[5]":"I was rather confused by his question.","example[6]":"She gave me a confused look.","example[7]":"With the huge range of computers on the market, it’s easy to get confused.","example[8]":"She felt hurt and confused when her husband left her.","display[0]":"puzzled","definition[3]":"confused because you cannot understand something, especially because it is different from what you expect","example[9]":"The doctor was puzzled by the man’s symptoms and ordered several further tests.","example[10]":"He had a puzzled expression on his face.","example[11]":"Ross looked perplexed when the audience laughed.","display[1]":"baffled","definition[4]":"very confused and unable to understand something, even though you have tried hard for a long time","example[12]":"Detectives admit they are baffled by the case.","example[13]":"a baffled expression","display[2]":"bewildered","definition[5]":"very confused and surprised when something unusual and unexpected happens to you","example[14]":"He was bewildered to find three policemen at the front door.","example[15]":"Bewildered train passengers watched as the man was arrested.","example[16]":"At first she was bewildered by all the noise and activity of the city.","display[3]":"bemused","definition[6]":"confused and surprised by what has happened, or by what someone has said","example[17]":"Local residents seem bemused by the sudden arrival of all the tourists.","example[18]":"She told him to leave, but he just sat there with a bemused expression.","display[4]":"can’t think straight","definition[7]":"to have difficulty thinking clearly, for example because you are too tired, too busy, or because a lot of things are happening around you","example[19]":"I can’t think straight with all this noise going on."}