{"word[0]":"sit","past_tense[0]":"sat","signpost[0]":"in a chair etc","definition[0]":"to be on a chair or seat, or on the ground, with the top half of your body upright and your weight resting on your buttocks","example[0]":"We used to sit and listen to her for hours.","example[1]":"Jean sat at the table writing a letter.","note[0]":"sit at a desk/table etc","example[2]":"I sat on the shore and looked at the sea.","note[1]":"sit on/in/by etc","example[3]":"She was sitting in a chair by the fire.","example[4]":"She’s the girl who sits next to me at school.","example[5]":"In the driving seat sat a man of average height.","example[6]":"They sat sipping their drinks.","note[2]":"sit doing something","definition[1]":"to get into a sitting position somewhere after you have been standing up","example[7]":"He came over and sat beside her.","example[8]":"Sam sat opposite her and accepted a cigarette.","definition[2]":"to make someone sit, or help them to sit","example[9]":"I gently led her to the chair and sat her on it.","note[3]":"sit somebody on/in etc something","signpost[1]":"objects/buildings etc","definition[3]":"to be in a particular position or condition","example[10]":"My climbing boots were sitting unused in a cupboard.","example[11]":"The house has sat empty for two years.","example[12]":"a little church sitting on a hillside","note[4]":"sit on/in etc","example[13]":"The parliament building sits in a large square.","example[14]":"He’s got a computer sitting on his desk, but he doesn’t use it.","signpost[2]":"do nothing","definition[4]":"to stay in one place for a long time, especially sitting down, doing nothing useful or helpful","example[15]":"I spent half the morning sitting in a traffic jam.","example[16]":"Well, I can’t sit here chatting all day.","example[17]":"Are you just going to sit there complaining?","signpost[3]":"committee/parliament etc","definition[5]":"to be a member of a committee, parliament, or other official group","example[18]":"They both sat on the management committee.","note[5]":"sit in/on","example[19]":"He was the first journalist to sit in parliament.","signpost[4]":"meeting","definition[6]":"to have a meeting in order to carry out official business","example[20]":"The council only sits once a month.","example[21]":"The court will sit until all the evidence has been heard.","signpost[5]":"animal/bird","definition[7]":"to be in, or get into, a resting position, with the tail end of the body resting on a surface","example[22]":"The cat likes to sit on the wall outside the kitchen.","definition[8]":"used to tell a dog to sit with the tail end of its body resting on the ground or floor","definition[9]":"if a bird sits on its eggs, it covers them with its body to make the eggs hatch","type[0]":"intransitive + for","signpost[6]":"look after","definition[10]":"to look after a baby or child while its parents are out","synonym[0]":"babysit","signpost[7]":"exams","definition[11]":"to take an examination","example[23]":"Tracy’s sitting her GCSEs this year.","example[24]":"They were preparing children to sit for the entry examination.","note[6]":"sit for","signpost[8]":"picture/photo","definition[12]":"to sit somewhere so that you can be painted or photographed","example[25]":"She sat for  (=was painted by) Holman Hunt and Millais.","collocation[0]":"sit still","example[26]":"Young children find it almost impossible to sit still.","collocation[1]":"sit quietly","example[27]":"Mac sat quietly in the back of the car.","collocation[2]":"be sitting comfortably","example[28]":"She was sitting comfortably on the sofa.","collocation[3]":"sit up straight/sit upright","example[29]":"Sit up straight at the table, Maddie.","collocation[4]":"sit bolt upright","example[30]":"Suddenly she sat bolt upright and said, ‘What was that?’","collocation[5]":"sit cross-legged","example[31]":"She sat cross-legged on the grass.","definition[13]":"to be resting your weight on your bottom somewhere, or to move into this position","example[32]":"He was sitting in front of the fire.","example[33]":"She sat on the bed and kicked off her shoes.","example[34]":"Who is the man sitting next to Karen?","display[0]":"sit down","definition[14]":"to sit on a chair, bed, floor etc after you have been standing","example[35]":"I sat down on the sofa.","example[36]":"Come in and sit down.","display[1]":"be seated","definition[15]":"to be sitting in a particular chair or place","example[37]":"John was seated on my left.","example[38]":"There was a man seated behind the desk.","display[2]":"take a seat","definition[16]":"to sit – used especially when asking someone to sit down","example[39]":"Please take a seat – she will be with you in a minute.","example[40]":"Would the audience please take their seats – the show will begin in five minutes.","display[3]":"sink into something","definition[17]":"to sit in a comfortable chair and let yourself fall back into it","example[41]":"We switched on the TV and sank into our armchairs.","display[4]":"lounge","definition[18]":"to sit in a very comfortable relaxed way","example[42]":"They lounged around all day by the pool.","display[5]":"perch","definition[19]":"to sit on the edge of something","example[43]":"He perched on the arm of the sofa.","example[44]":"My sister was perched  (=was sitting) on a high stool.","display[6]":"be slumped","definition[20]":"to be sitting while leaning against something, especially because you are injured, drunk, or asleep","example[45]":"They found him slumped against the steering wheel.","display[7]":"squat","definition[21]":"to sit with your knees bent under you, your bottom just off the ground, balancing on your feet","example[46]":"A little boy was squatting at the edge of the pool."}