{"word[0]":"previous","definition[0]":"having happened or existed before the event, time, or thing that you are talking about now","example[0]":"I’ve met him before on two previous occasions.","example[1]":"She has two children from a previous marriage.","example[2]":"Do you have any previous experience of this type of work?","example[3]":"The lawyer told the judge that Kennedy had no previous convictions.","definition[1]":"used when talking about a person, thing, time etc before the one that you are talking about now","example[4]":"The car’s previous owner didn’t take very good care of it.","example[5]":"Please ignore my previous instructions.","example[6]":"The temperature is higher than in previous years.","display[0]":"last","definition[2]":"used when talking about the one that you had just before now, or the one that existed just before now","example[7]":"The last apartment we lived in was much smaller than this one.","example[8]":"Ben’s last girlfriend was a teacher.","example[9]":"Beth broke up with her last boyfriend because he drank too much.","display[1]":"old","definition[3]":"used when talking about people you knew or things you had in the past, or about things that existed in the past and have been replaced by newer things","example[10]":"I never liked my old boss.","example[11]":"I saw Phil with one of my old girlfriends.","example[12]":"The new stadium is much bigger than the old one.","example[13]":"He was my old maths teacher.","display[2]":"preceding","definition[4]":"coming just before the time or thing you have just mentioned, or before the part of a book where you are now","example[14]":"There were fewer crimes compared to the preceding year.","example[15]":"The author dealt with this subject in the preceding chapters of the book.","example[16]":"In the preceding section of the poem, Whitman is talking about how important it is to live in the present.","definition[5]":"used to describe someone or something that used to have a particular job or position but does not anymore","example[17]":"her former husband","example[18]":"the former US president","example[19]":"Kyoto was the former capital of Japan.","display[3]":"ex-wife/boyfriend/soldier etc","definition[6]":"someone who used to be someone’s wife, used to be a soldier etc, but is not anymore","example[20]":"Her dad’s an ex-policeman.","example[21]":"Lydia is still friends with her ex-husband.","display[4]":"the one before","definition[7]":"the person or thing that existed before the one you have just mentioned","example[22]":"I didn’t enjoy Spielberg’s last film but I thought the one before was all right.","example[23]":"Each year, the convention is a little larger than the one before."}