{"word[0]":"credit","signpost[0]":"delayed payment","definition[0]":"an arrangement with a shop, bank etc that allows you to buy something and pay for it later","example[0]":"The store agreed to let him have credit.","example[1]":"What’s the credit limit on your Visa card?","example[2]":"Most new cars are bought on credit.","note[0]":"on credit","signpost[1]":"praise","definition[1]":"approval or praise that you give to someone for something they have done","example[3]":"They never give Gene any credit for all the extra work he does.","example[4]":"Credit must go to Fiona for making sure everything ran smoothly.","example[5]":"She deserves credit for trying her best.","note[1]":"take/claim/deserve etc (the) credit","example[6]":"Credit for this win goes to everybody in the team.","note[2]":"credit for","example[7]":"To Jamie’s credit, he remained calm.","note[3]":"to somebody’s credit","signpost[2]":"university","definition[2]":"a successfully completed part of a course at a university or college","example[8]":"I don’t have enough credits to graduate.","signpost[3]":"amount of money","definition[3]":"an amount of money that is put into someone’s bank account or added to another amount","opposite[0]":"debit","example[9]":"The company promised to provide credits to customers who had been charged too much.","signpost[4]":"true/correct","definition[4]":"the belief that something is true or correct","example[10]":"The witness’s story gained credit with the jury.","collocation[0]":"buy/get something on credit","example[11]":"They bought all their furniture on credit.","collocation[1]":"use credit","example[12]":"The survey showed only 15% of people had never used credit.","collocation[2]":"get/obtain credit","example[13]":"The economic situation is making it more difficult for people to get credit.","collocation[3]":"give/offer credit","example[14]":"A business may lose customers if it does not give credit.","collocation[4]":"refuse somebody credit","example[15]":"You may be refused credit if you have a bad financial record.","form[0]":"credit + NOUN","collocation[5]":"a credit card","example[16]":"Can I pay by credit card?","collocation[6]":"credit facilities","example[17]":"Credit facilities are available if you are over 18.","collocation[7]":"a credit agreement","example[18]":"People sometimes sign credit agreements and then realize they can’t afford the payments.","collocation[8]":"credit terms","example[19]":"The credit terms were a deposit of £1,000 and two later instalments of £900.","collocation[9]":"somebody’s credit rating","example[20]":"If you have a poor credit rating, you will have a hard time getting a mortgage.","collocation[10]":"a credit risk","example[21]":"Banks first have to assess whether a borrower is a credit risk.","collocation[11]":"a credit limit","example[22]":"I have a Visa card with a £1,000 credit limit.","collocation[12]":"a credit crunch/squeeze","example[23]":"Due to a credit squeeze, interest rates rose.","form[1]":"ADJECTIVES/NOUN + credit","collocation[13]":"consumer credit","example[24]":"Consumer credit has risen substantially during this period.","collocation[14]":"interest-free credit","example[25]":"We offer interest-free credit for up to 50 weeks.","definition[5]":"to add money to a bank account","example[26]":"The cheque has been credited to your account.","note[4]":"credit to","example[27]":"For some reason my account’s been credited with an extra $76.","note[5]":"credit with","definition[6]":"to believe that something is true","example[28]":"We found his statement hard to credit.","note[6]":"difficult/hard/impossible etc to credit","definition[7]":"an arrangement with a shop, supplier etc to buy something now and pay for it later","example[29]":"They are saving for new furniture - instead of buying on credit.","example[30]":"Sales were helped by the introduction of interest-free credit.","definition[8]":"an amount by which a payment is reduced, relating for example to goods you have returned","example[31]":"You can return the product within 30 days and get full credit toward the purchase of another.","definition[9]":"the right-hand side of each account in DOUBLE-ENTRY BOOKKEEPING, the side used for increases in LIABILITIES (=the amount of debt that must be paid) or REVENUEs","example[32]":"Every time an entry is made on the debit side, another entry of equal value must be made on the credit side somewhere in the books.","definition[10]":"if you are in credit, you have money in your bank account; be in the black","example[33]":"There are no bank charges if you stay in credit.","definition[11]":"another name for CREDIT HISTORY","example[34]":"If your credit is good and you drive less than 15,000 miles a year, you should consider leasing your car rather than buying one.","definition[12]":"an arrangement with a bank for a loan, or bank lending in general","example[35]":"The company is to get an additional $225 million in credit with no strings attached.","example[36]":"In the economic recovery, bank credit is absolutely critical, particularly for small businesses.","example[37]":"The bank said it would continue to extend credit (=make loans available) to the publishing group to keep it in business.","definition[13]":"an amount of money given to you by the authorities, or an amount that you do not have to pay, which normally you would have to pay","example[38]":"The couple may claim a credit of $800 for child care against their tax bill.","example[39]":"The interest credited to the income account will be taxable.","definition[14]":"to make an entry on the credit side of an account in DOUBLE-ENTRY BOOKKEEPING","example[40]":"On selling an asset, any profit is credited to capital reserve or a specific asset replacement account."}