{"word[0]":"traffic","definition[0]":"the vehicles moving along a road or street","example[0]":"There wasn’t much traffic on the roads.","example[1]":"The sound of the traffic kept me awake.","definition[1]":"the movement of aircraft, ships, or trains from one place to another","example[2]":"air traffic control","example[3]":"the problems of air traffic congestion in Europe","definition[2]":"the movement of people or goods by aircraft, ships, or trains","example[4]":"Most long-distance traffic of heavy goods is done by ships.","note[0]":"traffic of","definition[3]":"the secret buying and selling of illegal goods","example[5]":"drugs traffic","example[6]":"traffic in firearms","note[1]":"traffic in","collocation[0]":"be stuck/caught/held up in traffic","example[7]":"Sorry I’m late – I was stuck in traffic.","collocation[1]":"avoid/miss the traffic","example[8]":"I left early, hoping to miss the traffic.","collocation[2]":"cut/reduce traffic","example[9]":"The congestion charge did cut road traffic in central London.","collocation[3]":"traffic moves/flows","example[10]":"At last the traffic was moving again.","collocation[4]":"traffic is diverted","example[11]":"Traffic was diverted onto the A166 as emergency services cleared the wreckage","form[0]":"ADJECTIVES/NOUN + traffic","example[12]":"We ran into heavy traffic near the airport.","example[13]":"The traffic is fairly light at this time of day.","collocation[5]":"bad/terrible","example[14]":"The traffic was terrible this morning.","collocation[6]":"slow/slow-moving","example[15]":"Traffic’s very slow going out of New York.","collocation[7]":"rush-hour traffic","example[16]":"I left early to try to miss the rush-hour traffic.","collocation[8]":"local traffic","example[17]":"There is quite a lot of local traffic.","collocation[9]":"motorway traffic","example[18]":"As motorway traffic worsens, commuters may have to find other ways of getting to and from work.","collocation[10]":"oncoming traffic","example[19]":"The driver, too busy watching oncoming traffic, doesn’t notice the pedestrian ahead.","form[1]":"traffic + NOUN","collocation[11]":"a traffic jam","example[20]":"She spent two hours sitting in a traffic jam.","collocation[12]":"traffic congestion","example[21]":"efforts to cut traffic congestion","collocation[13]":"traffic flow","example[22]":"The road widening should help to improve traffic flow.","collocation[14]":"a traffic accident","example[23]":"He’s been involved in a traffic accident.","collocation[15]":"the traffic police","example[24]":"The teenagers got stopped by the local traffic police.","collocation[16]":"traffic noise","example[25]":"You get a lot of traffic noise living here.","collocation[17]":"the volume of traffic","example[26]":"The new ring road will reduce the volume of traffic through the village.","collocation[18]":"a stream of traffic","example[27]":"There was a constant stream of traffic.","collocation[19]":"the roar/rumble/hum of traffic","example[28]":"The only noise was the distant rumble of traffic on the coastal road.","definition[4]":"to take someone to another country and force them to work, for example as a prostitute","example[29]":"He had made a fortune by trafficking young women.","definition[5]":"the movement of planes, ships, trains etc from one place to another","example[30]":"a telecommunications network for controllingair traffic.","definition[6]":"the movement of people or goods by air, ship, train etc","example[31]":"The airline saidpassenger traffic dropped 29% in February.","example[32]":"the extensive traffic of Chinese goods to Canada","definition[7]":"the movement of computer DATA or other electronic information from one place to another","example[33]":"The three companies now control 90% of the nation’sphone traffic.","example[34]":"a digital service used fordata traffic","definition[8]":"the number of people buying a particular product or using a particular service","example[35]":"If consumer spending picks up, there will be keen competition forconsumer traffic."}