{"word[0]":"build","past_tense[0]":"built","signpost[0]":"make something","definition[0]":"to make something, especially a building or something large","example[0]":"The purpose is to build new houses for local people.","example[1]":"The road took many years to build.","example[2]":"They needed $3 million to build the bridge.","example[3]":"It is the female birds that build the nests.","example[4]":"Developers want to build on the site of the old gasworks.","example[5]":"a row of recently built houses","example[6]":"He’s going to build the children a doll’s house.","note[0]":"build somebody something","signpost[1]":"make something develop","definition[1]":"to make something develop or form","example[7]":"She had built a reputation as a criminal lawyer.","example[8]":"She’s been busy building her career.","example[9]":"Ross took 20 years to build up his business.","example[10]":"We’re trying to build up a picture of what happened.","note[1]":"build (up) a picture of somebody/something","definition[2]":"if a feeling builds, or if you build it, it increases gradually over a period of time","example[11]":"Tension began to build as they argued more frequently.","example[12]":"In order to build your self-esteem, set yourself targets you can reach.","definition[3]":"to make a house, road, wall, bridge etc using bricks, stone, wood, or other materials","example[13]":"A new stadium will be built for the Olympics.","display[0]":"construct","definition[4]":"to build a building, bridge, machine etc. Construct is more formal than build","example[14]":"The council plans to construct two new schools.","display[1]":"put up something","definition[5]":"to build a wall, fence, or building, or put a statue somewhere. Put up is less formal than build","example[15]":"The neighbours have put up a new wooden fence.","display[2]":"erect","definition[6]":"to build a wall, fence, or building, especially a public building, or put a statue somewhere","example[16]":"A monument to the Canadian soldiers was erected in Green Park.","display[3]":"throw something up","definition[7]":"to build something very quickly","example[17]":"Developers have hastily thrown up family homes in the area.","display[4]":"put together","definition[8]":"to make something from its parts, for example a piece of furniture","example[18]":"It took an hour to put the bookcase together.","display[5]":"assemble","definition[9]":"to put all the parts of something such as a machine or a piece of furniture together","example[19]":"A line of robots assemble the cars.","definition[10]":"the shape and size of someone’s body","example[20]":"a woman of slim build","example[21]":"You’re a surprisingly strong swimmer for one of such a slight build.","example[22]":"I wanted a more athletic and muscular build.","collocation[0]":"medium/average build","example[23]":"He was of medium build and wearing a light-coloured jacket.","collocation[1]":"slim/slender build","example[24]":"She was very strong despite her slender build.","collocation[2]":"thin build","example[25]":"He had the thin build of a long-distance runner.","collocation[3]":"slight build","example[26]":"Simpson was of slight build and shy in character.","collocation[4]":"stocky build","example[27]":"The man was described as of stocky build with dark hair.","collocation[5]":"sturdy build","example[28]":"an eight-year-old boy of sturdy build","collocation[6]":"muscular build","example[29]":"These exercises will help you achieve a strong muscular build.","collocation[7]":"athletic build","example[30]":"She admired his athletic build.","definition[11]":"to make or put together large things such as buildings, cars, ships, roads etc","example[31]":"New offices are being built on the site.","example[32]":"No new ships are being built at the yard now.","example[33]":"Sales of cars built in the US are falling.","definition[12]":"to create something over a long period of time by adding to it gradually","example[34]":"a peasant’s son who built an enormous business empire","example[35]":"He built the company into one of the world’s biggest jewelery concerns.","example[36]":"The drugs company has built up a formidable sales force.","example[37]":"The government has recently built up currency reserves by buying U.S. dollars.","definition[13]":"when lawyers build a case, they put together facts, information etc to try to convince a court that someone is innocent or guilty","example[38]":"He said prosecutors had built a case based on circumstantial evidence  (=evidence that can make you believe that something happened, but does not prove that it did)."}