{"word[0]":"establishment","definition[0]":"an organization or institution, especially a business, shop etc","example[0]":"a first-class training establishment","definition[1]":"the act of starting an organization, relationship, or system","example[1]":"the establishment of NATO in 1949","note[0]":"establishment of","heading[0]":"– Meaning 1: an organization or institution, especially a business, shop etc","collocation[0]":"an educational establishment","example[2]":"It’s a large educational establishment with over 2,000 pupils.","collocation[1]":"a medical establishment","example[3]":"New employees must undergo an examination at a medical establishment nominated by the Company.","collocation[2]":"a nuclear establishment","example[4]":"Local people are against having a nuclear establishment on their doorstep.","collocation[3]":"a catering establishment","example[5]":"She runs a successful catering establishment in Leeds.","collocation[4]":"a modest establishment","example[6]":"Mineo’s Pizza House is a modest but busy establishment just off the High Street.","collocation[5]":"the British/American/Spanish etc establishment","example[7]":"The affair caused acute embarrassment to the British establishment.","collocation[6]":"the political establishment","example[8]":"His resignation stunned the political establishment.","collocation[7]":"the military/defence establishment","example[9]":"The committee has many political figures who are close to the military establishment.","collocation[8]":"the scientific establishment","example[10]":"Professor Walker’s views are not shared by the scientific establishment.","collocation[9]":"the medical establishment","example[11]":"The measures were introduced despite protests from the medical establishment.","collocation[10]":"the religious/clerical establishment","example[12]":"His teachings were unacceptable to the religious establishment of the time.","collocation[11]":"the legal establishment","example[13]":"Prominent members of the legal establishment have opposed the bill.","collocation[12]":"the educational establishment","example[14]":"The proposals sent shock waves throughout the educational establishment.","definition[2]":"a business organization such as a shop or hotel","example[15]":"Microwave ovens are now an essential piece of equipment in catering establishments  (=restaurants etc).","example[16]":"a financial establishment","definition[3]":"when a company, organization, system etc is established","example[17]":"the establishment of a final-salary pension scheme","definition[4]":"the group of people in a society who have a lot of power and influence and who are often opposed to any kind of change or new ideas"}