{"word[0]":"pick up","signpost[0]":"lift something/somebody up","definition[0]":"to lift something or someone up","example[0]":"He picked up the letter and read it.","example[1]":"The phone rang and I picked it up.","example[2]":"Mummy, can you pick me up?","definition[1]":"to get up from the ground after you have fallen","example[3]":"Carol picked herself up and brushed the dirt off her coat.","signpost[1]":"tidy something","definition[2]":"to make a room or building tidy","example[4]":"Pick up your room before you go to bed.","signpost[2]":"get something","definition[3]":"to get or win something","example[5]":"He’s already picked up three major prizes this year.","definition[4]":"to buy something or get it from a shop etc","example[6]":"I picked up an evening paper on the way home.","example[7]":"For more details, pick up a leaflet in your local post office.","definition[5]":"to get an illness","example[8]":"I picked up a virus while I was in America.","signpost[3]":"collect","definition[6]":"to collect something from a place","example[9]":"I’ll pick my things up later.","example[10]":"She just dropped by to pick up her mail.","signpost[4]":"let somebody into a vehicle","definition[7]":"to let someone get into your car, boat etc and take them somewhere","example[11]":"I’ll pick you up at the station.","example[12]":"The survivors were picked up by fishing boats from nearby villages.","signpost[5]":"learn","definition[8]":"to learn something by watching or listening to other people","example[13]":"I picked up a few words of Greek when I was there last year.","example[14]":"Mary watched the other dancers to see if she could pick up any tips.","definition[9]":"to notice something that is not easy to notice, such as a slight smell or a sign of something","example[15]":"I picked up a faint smell of coffee.","example[16]":"The dogs picked up the scent and raced off.","example[17]":"We picked up their tracks again on the other side of the river.","signpost[6]":"radio/signals","definition[10]":"if a machine picks up a sound, movement, or signal, it is able to notice it or receive it","example[18]":"The sensors pick up faint vibrations in the earth.","example[19]":"I managed to pick up an American news broadcast.","definition[11]":"to become friendly with someone you have just met because you want to have sex with them","example[20]":"young women sitting around in bars waiting to be picked up","signpost[7]":"start again","definition[12]":"if you pick up where you stopped or were interrupted, you start again from that point","example[21]":"We’ll meet again in the morning and we can pick up where we left off.","definition[13]":"if you pick up an idea that has been mentioned, you return to it and develop it further","example[22]":"I’d like to pick up what you said earlier.","example[23]":"This same theme is picked up in his later works.","definition[14]":"if a situation picks up, it improves","example[24]":"Her social life was picking up at last.","example[25]":"The economy is finally beginning to pick up again.","example[26]":"We’ve been through a bit of a bad patch, but things are picking up again now.","definition[15]":"if a medicine or drink picks you up, it makes you feel better","definition[16]":"if you pick up a road, you go onto it and start driving along it","example[27]":"We take the A14 to Birmingham and then pick up the M5.","signpost[8]":"train/bus","definition[17]":"if you pick up a train, bus etc, you get onto it and travel on it","definition[18]":"to go faster","example[28]":"The train was gradually picking up speed.","definition[19]":"to pay for something","example[29]":"Why should the taxpayer pick up the tab for mistakes made by a private company?","definition[20]":"if the wind picks up, it increases or grows stronger","definition[21]":"if one thing picks up a colour in something else, it has an amount of the same colour in it so that the two things look nice together","example[30]":"I like the way the curtains pick up the red in the rug.","signpost[9]":"criminal","definition[22]":"if the police pick someone up, they take them somewhere to answer questions or to be locked up","example[31]":"He was picked up by police as he was trying to leave the country.","definition[23]":"to try to make your life normal again after something very bad has happened to you","example[32]":"Thousands of victims of the earthquake are now faced with the task of picking up the pieces of their lives.","definition[24]":"if you pick up the threads of something that you were doing, you try to return to it and start doing it again after it stopped or was changed","example[33]":"Now that the war was over they could pick up the threads of their lives again.","definition[25]":"used to tell someone to walk properly or more quickly","definition[26]":"a small truck with low sides that is used for carrying goods","signpost[10]":"improvement","definition[27]":"an improvement in something which will be good for economic success","example[34]":"There are signs of a pick-up in high street spending.","note[0]":"pick-up in","signpost[11]":"collection","definition[28]":"an occasion when someone or something is collected from a place","example[35]":"The price includes travel from your local pick-up point in the UK to your hotel in Paris.","example[36]":"trash pick-up","definition[29]":"a stranger that you meet in a bar, at a party etc and have sex with","definition[30]":"an electronic part on a musical instrument, especially an electric guitar, that makes the sound louder","signpost[12]":"speed","definition[31]":"the rate at which a vehicle can increase its speed","synonym[0]":"acceleration","example[37]":"It was a small car, but it had good pick-up.","definition[32]":"if business or trade picks up, it improves","definition[33]":"to buy something, especially for a low price","example[38]":"Homes here can be picked up for as little as £30,000.","definition[34]":"to pay for something, especially when it is not your responsibility to pay","example[39]":"The contractors do not want to pick up the bill for problems which are not of their making.","definition[35]":"an improvement or increase in a type of economic activity","example[40]":"A pick-up had been arranged for 5.30pm.","example[41]":"Where’s the pick-up point?"}