{"word[0]":"pound","definition[0]":"a unit for measuring weight, equal to 16 ounces or 0.454 kilograms","example[0]":"Moira weighs about 130 pounds.","example[1]":"The grapes cost $2 a pound.","example[2]":"a pound of apples","note[0]":"pound of","definition[1]":"the standard unit of money in Britain, which is divided into 100 pence","example[3]":"They spent over a thousand pounds.","example[4]":"a multi-million pound business","example[5]":"a five pound note","definition[2]":"the value of British money compared with the value of the money of other countries","example[6]":"The pound was up against the dollar.","definition[3]":"the standard unit of money in various other countries, such as Egypt and the Sudan","signpost[0]":"for dogs and cats","definition[4]":"a place where dogs and cats that have been found on the street are kept until their owners come to get them","signpost[1]":"for cars","definition[5]":"a place where cars that have been illegally parked are kept until their owners pay money to get them back","definition[6]":"the pound key","definition[7]":"to hit something very hard several times and make a lot of noise, damage it, break it into smaller pieces etc","example[7]":"He began pounding the keyboard of his computer.","example[8]":"Thomas pounded on the door with his fist.","note[1]":"pound against/on","example[9]":"Waves pounded against the pier.","example[10]":"Green pounded his fist on the counter.","note[2]":"pound something against/on something","signpost[2]":"heart","definition[8]":"if your heart or blood is pounding, your heart is beating very hard and quickly","example[11]":"She ran, her heart pounding in her chest.","example[12]":"Patrick rushed to the door, his heart pounding with excitement.","note[3]":"pound with","signpost[3]":"head","definition[9]":"if your head is pounding, it feels painful, especially because you have a headache or you have been using a lot of effort","definition[10]":"to walk or run quickly with heavy loud steps","example[13]":"a policeman pounding his beat","example[14]":"Runners will be pounding the pavement this weekend during the London Marathon.","example[15]":"I could hear him pounding up the stairs.","note[4]":"pound along/through/down etc","signpost[4]":"attack with bombs","definition[11]":"to attack a place continuously for a long time with bombs","example[16]":"Enemy forces have been pounding the city for over two months.","definition[12]":"the standard unit of currency in Britain, which is divided into 100 pence","example[17]":"a twenty-pound note","example[18]":"a shortfall of millions of pounds","definition[13]":"the value of the British currency compared with that of other countries","example[19]":"The pound climbed strongly against the dollar.","definition[14]":"the unit of currency in a number of countries, including Cyprus and Egypt","definition[15]":"a unit of weight equal to 16 OUNCEs or 0.454 KILOGRAMs","example[20]":"Apple prices averaged 24.9 cents a pound."}