{"word[0]":"reality","plural[0]":"realities","definition[0]":"what actually happens or is true, not what is imagined or thought","example[0]":"the distinction between fantasy and reality","example[1]":"TV is used as an escape from reality.","example[2]":"I think the government has lost touch with reality  (=no longer understands what is real or true).","example[3]":"political realities","example[4]":"The paperless office may one day become a reality.","example[5]":"Millions of people live with the harsh realities of unemployment.","note[0]":"harsh/grim/stark reality","example[6]":"The reality is that young people will not go into teaching until salaries are higher.","note[1]":"the reality is that","definition[1]":"the fact that something exists or is happening","example[7]":"She had never accepted the reality of her pregnancy.","collocation[0]":"the harsh/grim/stark reality","example[8]":"We want to protect our children from the harsh reality of our violent world.","collocation[1]":"political/social/economic realities","example[9]":"He's ignoring political realities.","collocation[2]":"face reality","example[10]":"It's painful, but you have to face reality.","collocation[3]":"confront a reality","example[11]":"They had to confront some unpleasant realities about themselves.","collocation[4]":"ignore a reality","example[12]":"They are ignoring the reality of Arab politics.","collocation[5]":"wake up to reality","example[13]":"Well, they need to wake up to reality.","collocation[6]":"lose touch with reality","example[14]":"If all you have is the show-business world, you kind of lose touch with reality.","collocation[7]":"escape from reality","example[15]":"The programmes help viewers escape from reality.","collocation[8]":"bring somebody back to reality","example[16]":"She was brought back to reality by the pain in her ankle.","collocation[9]":"become a reality","example[17]":"Last June, her longed-for baby finally became a reality.","collocation[10]":"reflect reality","example[18]":"Do these novels accurately reflect contemporary reality?","collocation[11]":"bear no relation to reality","example[19]":"His vision of European politics bears no relation to reality.","collocation[12]":"be divorced from reality","example[20]":"His ideas are completely divorced from reality.","collocation[13]":"a dose of reality","example[21]":"I got my first dose of reality when I reported to work at my new job.","collocation[14]":"somebody's grasp of reality","example[22]":"They portrayed her as a sick woman with only a tenuous grasp of reality."}