{"word[0]":"contribution","definition[0]":"something that you give or do in order to help something be successful","example[0]":"The school sees its job as preparing students to make a contribution to society.","example[1]":"Wolko made outstanding contributions to children’s medicine.","note[0]":"significant/substantial/valuable etc contribution","example[2]":"Einstein was awarded the Nobel Prize for his contribution to Quantum Theory.","note[1]":"contribution to/towards","definition[1]":"an amount of money that you give in order to help pay for something","example[3]":"a campaign contribution","example[4]":"You can make annual contributions of up to $1,000 in education savings accounts.","example[5]":"A contribution of £25 will buy 15 books.","note[2]":"contribution of","example[6]":"Contributions to charities are tax deductible.","definition[2]":"a regular payment that you make to your employer or to the government to pay for things that you will receive when you are no longer working, for example health care, a pension etc","example[7]":"income tax and national insurance contributions","example[8]":"Have you been making regular contributions to a pension plan?","note[3]":"contribution to","definition[3]":"a piece of writing, a song, a speech etc that forms part of a larger work such as a newspaper, book, broadcast, recording etc","example[9]":"a magazine with contributions from well-known travel writers","note[4]":"contribution from","example[10]":"a Christmas album featuring contributions from Carly Simon, Amy Grant, and others","definition[4]":"when you give money, time, help etc","example[11]":"All the money has been raised by voluntary contribution.","collocation[0]":"make a contribution","example[12]":"I’d like everyone to make a contribution towards the discussion.","collocation[1]":"acknowledge/recognize somebody’s contribution","example[13]":"He acknowledged the contribution of many individuals in developing the report.","collocation[2]":"value somebody’s contribution","example[14]":"They didn’t seem to value my contribution.","collocation[3]":"a major/great contribution","example[15]":"Tourism makes a major contribution to the local economy.","collocation[4]":"a positive contribution","example[16]":"We want kids to grow up to make a positive contribution to society.","collocation[5]":"a huge contribution","example[17]":"This player has made a huge contribution to our club.","collocation[6]":"a significant/important contribution","example[18]":"All of you can make a significant contribution to the organization.","collocation[7]":"a useful/valuable contribution","example[19]":"I joined the society because I felt I could make a useful contribution.","collocation[8]":"an invaluable/outstanding contribution","example[20]":"He won the award for his outstanding contribution over many years.","collocation[9]":"a vital contribution","example[21]":"Volunteers make a vital contribution in this country.","definition[5]":"a regular payment made to the government by an employee and their employer so that the employee has the right to receive money from the government when they are ill or unemployed","example[22]":"To qualify for the full basic pension, someone would need to have paid national insurance contributions for most of their working life.","example[23]":"In many pension schemes, you’re allowed to pay additional voluntary contributions to buy a bigger pension.","definition[6]":"an amount given to CHARITY","example[24]":"His contributions this year include gifts to the San Francisco library and Museum of Modern Art.","definition[7]":"the amount a particular product or activity pays to a company’s OVERHEADs","example[25]":"the contribution the business makes to corporate overheads and the way it is linked to the company’s other operations","definition[8]":"an amount that each co-insurer pays to the insurer who actually pays a CLAIM","example[26]":"If the claim exceeds $100 then a contribution should be obtained from the Home Insurer on an independent liability basis."}