{"word[0]":"milk","definition[0]":"a white liquid produced by cows or goats that is drunk by people","example[0]":"a bottle of milk","example[1]":"Would you like some milk in your tea?","example[2]":"a pint of semi-skimmed milk","definition[1]":"a white liquid produced by female animals and women for feeding their babies","example[3]":"mothers who believe that breast milk is best for their babies","example[4]":"The tiny fox cubs drink nothing but their mother’s milk.","definition[2]":"a liquid or juice produced by particular plants, especially the coconut","definition[3]":"a thin white liquid used to clean or protect skin","synonym[0]":"lotion","example[5]":"a mild facial cleansing milk","collocation[0]":"drink milk","example[6]":"Drinking milk keeps your bones strong.","collocation[1]":"have/take milk","example[7]":"Do you take milk in your coffee?","collocation[2]":"pour milk","example[8]":"She poured some milk into a saucepan.","form[0]":"ADJECTIVES/NOUN + milk","collocation[3]":"sour","example[9]":"Milk turns sour very quickly in hot weather.","example[10]":"She made me drink a glass of fresh milk.","example[11]":"I can only drink milk if it’s really cold.","collocation[4]":"hot/warm","example[12]":"Can I have a cup of warm milk please?","collocation[5]":"pasteurized","example[13]":"a type of cheese made from pasteurized milk","collocation[6]":"homogenized","example[14]":"Most milk sold in stores is homogenized milk.","collocation[7]":"whole milk","example[15]":"The ice cream is made from whole milk.","collocation[8]":"semi-skimmed milk","example[16]":"Adults should drink semi-skimmed milk rather than whole milk.","collocation[9]":"skimmed milk","example[17]":"a bowl of cereal with skim milk","collocation[10]":"long-life milk","example[18]":"I’ve got a carton of long-life milk in the cupboard.","collocation[11]":"powdered milk","example[19]":"Powdered milk is useful for camping trips.","collocation[12]":"baby/formula milk","example[20]":"Many babies are fed formula milk.","form[1]":"milk + NOUN","collocation[13]":"milk bottle","example[21]":"Put the empty milk bottles into the crates.","collocation[14]":"milk carton","example[22]":"containers such as milk cartons and soap powder boxes","collocation[15]":"milk jug","example[23]":"She put the butter, jam and milk jug on the table.","collocation[16]":"milk powder","example[24]":"hot water mixed with milk powder","collocation[17]":"a glass of milk","example[25]":"Would you like a glass of milk?","example[26]":"I accidentally knocked over a bottle of milk.","collocation[18]":"a pint of milk","example[27]":"I need to buy a pint of milk.","definition[4]":"to get as much money or as many advantages as you can from a situation, in a very determined and sometimes dishonest way","example[28]":"He seems to be milking the incident for all it’s worth (=getting as much from it as possible).","example[29]":"Their landlord regularly milks them for extra money by claiming for damage to his property.","note[0]":"milk somebody/something for something","definition[5]":"to take milk from a cow or goat","example[30]":"I helped to milk the cows.","definition[6]":"to get as much as you can from someone or from a situation, in a very determined and sometimes dishonest way","example[31]":"The cable companies will be able to milk subscribers for even more money."}