{"word[0]":"reprimand","definition[0]":"to tell someone officially that something they have done is very wrong","example[0]":"The military court reprimanded him for failing to do his duty.","note[0]":"reprimand somebody for (doing) something","definition[1]":"to tell someone that they have done something wrong or illegal and are being punished for it – used especially in official contexts","example[1]":"The police officers were officially reprimanded for their behaviour.","example[2]":"The Swiss authorities severely reprimanded the banks for accepting $660 million from the former Nigerian dictator Sani Abacha.","example[3]":"Debra remembered as a very young child being reprimanded by her father.","display[0]":"scold","definition[2]":"if a parent, teacher, or other adult scolds a child, they talk to them angrily because they have done something wrong. Scold sounds rather formal and old-fashioned. In everyday English people usually say tell somebody off","example[4]":"I dreaded the thought of going home and being scolded by my father.","display[1]":"tell somebody off","definition[3]":"to talk angrily to someone because they have done something wrong. Tell somebody off is more common in British English than American English","example[5]":"Dad told me off for getting home late.","display[2]":"give somebody a talking-to","definition[4]":"to talk angrily to a child because they have done something wrong","example[6]":"The boy was given a good talking-to and sent home.","display[3]":"lecture","definition[5]":"to talk angrily to someone for a long time about something they have done wrong, especially in a way that they think is not necessary or fair","example[7]":"Stop lecturing me, will you!","example[8]":"He began to lecture her about her duties as a citizen.","display[4]":"rebuke","definition[6]":"to tell someone that they should not have done something","example[9]":"She rebuked him for being late.","example[10]":"Sheerman rebuked his colleague for suggesting that he was too stupid to understand what he was saying.","display[5]":"reproach","definition[7]":"to talk to someone in a way that shows you are disappointed at what they have done. Reproach  sounds much gentler than criticizing someone or reprimanding them","example[11]":"He felt he had to reproach his friend for his excessive drinking.","display[6]":"berate","definition[8]":"to publicly criticize someone for a long time, in a way that shows you strongly disapprove of what they have done","example[12]":"She berated the paper for its 'misleading front-page story.'","example[13]":"Kennedy berated the Eisenhower administration and its vice president Richard Nixon, during the 1960 campaign.","definition[9]":"an occasion when someone is officially told that they have done something very wrong","example[14]":"He is likely to receive some kind of reprimand for trying to influence the regulators unfairly."}