{"word[0]":"interested","definition[0]":"giving a lot of attention to something because you want to find out more about it or because you enjoy it","opposite[0]":"uninterested","example[0]":"I wasn’t sure if he was really interested or if he was just being polite.","example[1]":"I’d be very interested to hear your opinion.","note[0]":"interested to hear/know/see etc","example[2]":"I’ve always been interested in music.","note[1]":"interested in","example[3]":"All she’s interested in is clothes.","definition[1]":"if you are interested in doing or having something, you want to do it or have it","example[4]":"I’ve got a spare ticket for the opera, if you’re interested.","example[5]":"Sheila’s interested in starting her own business.","note[2]":"interested in (doing) something","example[6]":"Would you be interested in a second-hand car?","heading[0]":"GRAMMAR: Patterns with interested","explanation[0]":"You are interested in something","example[7]":"She is interested in politics","bad_example[0]":"She is interested on politics","explanation[1]":"You are interested in doing something","example[8]":"Are you interested in working abroad?","bad_example[1]":"Are you interested to work abroad?","explanation[2]":"You say that you would be hear/know/see/find out something  Don’t use  with other verbs such as ‘have’ or ‘buy’","example[9]":"I would be interested to know what she thinks about the idea","bad_example[2]":"interested to","definition[2]":"giving your attention to something because you want to know more about it or you enjoy it","example[10]":"Recently I’ve got very interested in photography.","display[0]":"fascinated","definition[3]":"very interested by something you see, read, or hear about","example[11]":"She watched, fascinated, as the bird came closer until she could almost touch it.","example[12]":"The more I read about the place, the more fascinated I became.","display[1]":"curious","definition[4]":"wanting to find out more information about something","example[13]":"Small children are naturally curious.","example[14]":"I was curious to find out the reasons for his sudden departure.","display[2]":"intrigued","definition[5]":"interested in something because it seems strange or mysterious","example[15]":"He was intrigued by her story.","display[3]":"be into something","definition[6]":"used when talking about the kind of things you are interested in and enjoy doing","example[16]":"Are you into classical music?","example[17]":"I got into  (=became interested in) yoga when I was at college.","heading[1]":"so interested that you give something all your attention","display[4]":"absorbed/engrossed in something","definition[7]":"very interested in something, so that you give it all your attention and do not notice anything else","example[18]":"Jane was lying on the sofa engrossed in a novel.","example[19]":"She was so absorbed in her own thoughts that she didn’t hear me call.","display[5]":"gripped/riveted","definition[8]":"very interested, especially in a story you are reading, a film you are watching etc, so that you are eager to find out what happens next","example[20]":"It was a brilliant book and I was gripped from beginning to end.","example[21]":"I was so riveted by the film that I forgot the time.","display[6]":"enthralled","definition[9]":"very interested and enjoying something very much, so that you want to see or hear more","example[22]":"From the opening line of the play, the audience was completely enthralled.","display[7]":"spellbound","definition[10]":"extremely interested in something very strange or wonderful, so that you are unable to move or think of anything else","example[23]":"He could hold audiences spellbound with the power of his voice.","example[24]":"They all listened, spellbound.","display[8]":"rapt","definition[11]":"showing by your expression that you are very interested in something and are giving all your attention to it","example[25]":"He spoke before a rapt audience.","example[26]":"The congregation listened with rapt attention.","display[9]":"be all ears","definition[12]":"to be extremely interested in what someone is telling you","example[27]":"Tell me exactly what happened. I’m all ears.","heading[2]":"not interested","definition[13]":"not wanting to know about something or give it your attention","example[28]":"I just wasn’t at all interested in science at school.","definition[14]":"not interested in wanting to know about something, especially something you are told","example[29]":"When I tried to tell her about my holiday, she seemed completely uninterested.","display[10]":"apathetic","definition[15]":"not interested in a particular problem or situation, so that you are not willing to make an effort to change and improve things","example[30]":"Voters have become increasingly apathetic.","display[11]":"indifferent","definition[16]":"having no interest in someone or something, and often not caring about them","example[31]":"Sometimes the government seems indifferent to the problems of the poor.","display[12]":"somebody couldn’t care less","definition[17]":"used when saying that someone does not care at all about something and is not interested in it","example[32]":"I couldn’t care less what other people think."}