{"word[0]":"unkind","definition[0]":"nasty, unpleasant, or cruel","example[0]":"A lot of unkind things were said.","example[1]":"Her husband is very unkind to her.","note[0]":"unkind to","definition[1]":"treating people in a way that makes them unhappy or upset. Unkind  sounds rather formal. In everyday English, people usually say mean or nasty","example[2]":"Children can be very unkind to each other.","example[3]":"a rather unkind remark","display[0]":"mean","example[4]":"Don’t be mean to your sister!","example[5]":"It was a mean thing to do.","display[1]":"nasty","definition[2]":"deliberately unkind, and seeming to enjoy making people unhappy","example[6]":"He said some really nasty things before he left.","example[7]":"a nasty man","display[2]":"hurtful","definition[3]":"unkind – used about remarks and actions","example[8]":"Joe couldn’t forget the hurtful things she had said.","example[9]":"Couples sometimes do hurtful things to each other.","display[3]":"spiteful","definition[4]":"deliberately unkind to someone because you are jealous of them or angry with them","example[10]":"The other women were spiteful to her, and gave her the hardest work to do.","example[11]":"She watched them with spiteful glee  (=pleasure).","display[4]":"malicious","definition[5]":"deliberately behaving in a way that is likely to upset, hurt, or cause problems for someone","example[12]":"Someone had been spreading malicious rumours about him.","example[13]":"There was a malicious smile on her face.","example[14]":"an act of malicious vandalism","example[15]":"The accusations are malicious.","display[5]":"unsympathetic","definition[6]":"not seeming to care about someone’s problems, and not trying to help them or make them feel better","example[16]":"Her parents were very unsympathetic, and told her that she deserved to fail her exam.","example[17]":"an unsympathetic boss","display[6]":"hard-hearted","definition[7]":"very unsympathetic and not caring at all about other people’s feelings","example[18]":"Was he hard-hearted enough to leave his son in jail overnight?","example[19]":"a hard-hearted businessman","heading[0]":"very unkind","example[20]":"Why is Jack always so horrible to me?","display[7]":"cruel","definition[8]":"very unkind and deliberately making people feel unhappy or making them suffer physically","example[21]":"Her father was very cruel to her.","example[22]":"a selfish, cruel woman","display[8]":"wicked","definition[9]":"extremely unkind and behaving in a very immoral way","example[23]":"a wicked thing to do","example[24]":"the wicked stepmother in Cinderella","display[9]":"sadistic","definition[10]":"extremely unkind and enjoying making other people suffer","example[25]":"Their father was a sadistic bully who beat them regularly.","example[26]":"He took a certain sadistic pleasure in his job.","heading[1]":"unintentionally unkind","display[10]":"thoughtless/inconsiderate","definition[11]":"not thinking about the effects of your actions on other people","example[27]":"It was inconsiderate of him not to say that he would be late.","example[28]":"a thoughtless disregard for other people’s feelings","display[11]":"tactless","definition[12]":"someone who is tactless carelessly says or does things that are likely to upset someone, without realizing what they are doing","example[29]":"How could you be so tactless?","example[30]":"a tactless question","display[12]":"insensitive","definition[13]":"behaving in a way that is likely to upset someone, or not seeming to care about someone’s feelings. Insensitive is rather a formal word","example[31]":"The article is insensitive to the family and friends of the victim.","example[32]":"He later admitted that some of his remarks were ‘insensitive’.","explanation[0]":"In everyday English, people usually say mean, nasty, or horrible rather than unkind:","example[33]":"The other kids were really mean  to me."}