{"word[0]":"power","definition[0]":"the ability or right to control people or events","example[0]":"power-hungry politicians","note[0]":"power-mad/power-crazy/power-hungry","example[1]":"People should have more power over the decisions that affect their lives.","note[1]":"power over","definition[1]":"the position of having political control of a country or government","example[2]":"They seized power in a military coup.","example[3]":"De Gaulle came to power in 1958.","note[2]":"come/rise to power","example[4]":"The voters have once again shown their support for the party in power.","note[3]":"in power","signpost[0]":" influence","definition[2]":"the ability to influence people or give them strong feelings","note[4]":"student/black/consumer etc power (=the political or social influence a particular group has)","example[5]":"the pulling power (=ability to attract people or attention) of major celebrities","example[6]":"the power of his writing","note[5]":"power of","example[7]":"the immense power of television","signpost[1]":"right/authority","definition[3]":"the right or authority to do something","example[8]":"The police have been given special powers to help them in the fight against terrorism.","example[9]":"The chairman has the power of veto on all decisions.","note[6]":"power of arrest/veto etc","example[10]":"The committee has the power to order an enquiry.","note[7]":"power to do something","signpost[2]":"ability","definition[4]":"a natural or special ability to do something","example[11]":"After the accident she lost the power of speech (=ability to speak).","example[12]":"your mental powers","example[13]":"a stone with magical powers","example[14]":"a writer’s powers of observation","note[8]":"powers of observation/concentration/persuasion","signpost[3]":"energy","definition[5]":"energy that can be used to make a machine work or to make electricity","example[15]":"the search for renewable sources of power","example[16]":"Many people are opposed to the use of nuclear power.","note[9]":"nuclear/wind/solar etc power","example[17]":"The ship was able to leave port under its own power (=without help from another machine, ship etc).","note[10]":"under power","signpost[4]":"strength","definition[6]":"the physical strength or effect of something","example[18]":"the power of a cheetah’s long legs","example[19]":"The power of the explosion smashed windows across the street.","definition[7]":"electricity that is used in houses, factories etc","example[20]":"Make sure the power is switched off first.","example[21]":"The power came back on.","example[22]":"Parts of the country have had power cuts because of the storms.","note[11]":"power cut/failure/outage","signpost[5]":"strong country","definition[8]":"a country that is strong and important and can influence events, or that has a lot of military strength","note[12]":"world power (=a country that can influence events in different parts of the world)","example[23]":"Egypt is still a major power in the Middle East.","definition[9]":"if a number is increased to the power of three, four, five etc, it is multiplied by itself three, four, five etc times","signpost[6]":"lens","definition[10]":"the ability of a lens, for example in a pair of glasses or a microscope, to make things look bigger","heading[0]":"– Meaning 1: the ability or right to control people or events","collocation[0]":"have power","example[24]":"People who have power never seem to use it to help others.","collocation[1]":"get/gain power","example[25]":"Women were trying to gain power in a male-dominated world.","collocation[2]":"use your power","example[26]":"The party will use all its power and influence to raise the issue in the Senate.","example[27]":"Questions have been asked about the way the police exercised their power.","collocation[3]":"wield power","example[28]":"The Church still wields enormous power in the country.","collocation[4]":"great/huge/enormous","example[29]":"The central banks have huge power.","collocation[5]":"limited","example[30]":"The king's power was limited.","collocation[6]":"political/economic/military power","example[31]":"countries with little economic power","collocation[7]":"absolute power","example[32]":"Parents had absolute power over children in those days.","collocation[8]":"unbridled power","example[33]":"Certain wealthy men exercised unbridled power.","collocation[9]":"real power","example[34]":"The real power lay with the president’s advisers.","collocation[10]":"a power struggle","example[35]":"The country is locked in a power struggle between forces favouring and opposing change.","collocation[11]":"the balance of power","example[36]":"There has been a shift in the balance of power between the two countries.","collocation[12]":"a position of power","example[37]":"Many of them were using their positions of power for personal advantage.","collocation[13]":"an abuse of power","example[38]":"This cover-up is a scandalous abuse of power.","heading[1]":"– Meaning 2: the position of having political control of a country or government","collocation[14]":"be in power","example[39]":"The law was passed when the Democrats were in power.","collocation[15]":"come to power","example[40]":"Tony Blair came to power in 1997.","collocation[16]":"take power","example[41]":"Many people fled after the military took power last September.","collocation[17]":"seize power","example[42]":"His son seized power in a military coup.","collocation[18]":"assume power","example[43]":"He assumed power after the assassination of the former president.","collocation[19]":"win power","example[44]":"The prime minister is facing his toughest challenge since winning power.","collocation[20]":"rise to power","example[45]":"The Roman emperor Vespasian rose to power through command of an army.","collocation[21]":"return/be returned to power","example[46]":"The party was returned to power with a reduced majority.","collocation[22]":"hold power","example[47]":"Economic disaster befell the country during the decade when he held power.","collocation[23]":"restore somebody to power","example[48]":"In 2004, the army restored him to power.","collocation[24]":"sweep to power","example[49]":"Reagan swept to power by promising reforms.","collocation[25]":"cling to power","example[50]":"Mao Tse-tung, the leader of the 1949 Communist revolution, clung to power for 27 years.","collocation[26]":"somebody’s rise to power","example[51]":"The programme examines Saddam Hussein’s rise to power.","collocation[27]":"somebody’s return to power","example[52]":"Churchill’s return to power had an immediate effect upon Anglo-American relations.","heading[2]":"– Meaning 5: a natural or special ability to do something","collocation[28]":"mental powers","example[53]":"Is it possible to enhance your mental powers?","collocation[29]":"creative powers","example[54]":"A music teacher should have a real interest in developing children’s creative powers.","collocation[30]":"healing powers","example[55]":"The water was supposed to have healing powers.","collocation[31]":"magical/special/miraculous powers","example[56]":"Diamonds were once thought to have magical powers.","collocation[32]":"the power of speech","example[57]":"I was so surprised that I momentarily lost the power of speech.","collocation[33]":"the power of flight","example[58]":"Some birds have lost the power of flight over millions of years.","collocation[34]":"powers of observation","example[59]":"Experience improves our powers of observation, since it teaches us what to look for.","collocation[35]":"powers of concentration","example[60]":"As you get older, your powers of concentration may decrease.","collocation[36]":"powers of persuasion","example[61]":"She used all her powers of persuasion to convince Tilly that the move was a good idea.","collocation[37]":"be at the height of your powers","example[62]":"Fonteyn was still at the height of her powers as a dancer.","collocation[38]":"lose a power","example[63]":"He was a brilliant speaker, who never lost the power to influence people.","collocation[39]":"somebody’s powers are failing/waning","example[64]":"Mark felt that his creative powers were waning.","heading[3]":"– Meaning 6: energy that can be used to make a machine work or to make electricity","form[0]":"ADJECTIVES/NOUN + power","collocation[40]":"nuclear power","example[65]":"The accident raised doubts about the safety of nuclear power.","collocation[41]":"solar power","example[66]":"They use solar power for all their heating.","collocation[42]":"wind power","example[67]":"Is wind power the answer to the energy crisis?","collocation[43]":"wave power","example[68]":"Wave power can be used to generate electricity.","collocation[44]":"hydroelectric power","example[69]":"The factory is run on hydroelectric power.","collocation[45]":"steam power","example[70]":"Early engines were driven by steam power.","collocation[46]":"a source of power","example[71]":"One problem is their reliance on coal as the main source of power.","heading[4]":"– Meaning 11: a country that is strong and important and can influence events, or that has a lot of military strength","collocation[47]":"a great power","example[72]":"Britain wanted to maintain her status as a great power.","collocation[48]":"a major power","example[73]":"There will be representatives from all the world's major powers at the conference.","collocation[49]":"a world power","example[74]":"The United States had replaced Great Britain as the dominant world power.","collocation[50]":"a military/naval power","example[75]":"Russia had become a naval power equal to Spain.","collocation[51]":"a foreign power","example[76]":"He was charged with spying for a foreign power.","definition[11]":"to supply power to a vehicle or machine","example[77]":"It’s powered by a Ferrari V12 engine.","explanation[0]":"Power is usually passive in this meaning","definition[12]":"to move with a lot of force and speed","example[78]":"His strong body powered through the water.","definition[13]":"driven by an electric motor","example[79]":"power tools","example[80]":"power shower","definition[14]":"the ability or right to control people, organizations, events etc","example[81]":"I’m against giving too much power to one man.","example[82]":"Congress’s power over federal spending","example[83]":"He plans to resign after losing a power struggle within the firm.","example[84]":"The lawmakers approved the President’s demands for special powers to implement change.","example[85]":"He had almost unlimited executive powers to restructure the organization as he saw fit.","example[86]":"The Board of Trade invoked emergency powers (=special powers used to deal with an unusual dangerous situation) to stop an attempt to limit the soybean market.","definition[15]":"a country or organization that is strong and has a lot of influence","example[87]":"The US is still the world’s leading economic power.","example[88]":"a global financial power","example[89]":"a war between film producers and some of cable TV’s biggest powers","definition[16]":"an ability to do something, influence a situation etc","example[90]":"the incredible power of advertising","example[91]":"the job-generating power of small firms","definition[17]":"energy that is used to make electricity, electricity itself, and the industries that produce it","example[92]":"Turn the power on with the switch.","example[93]":"doubts about the safety of nuclear power","example[94]":"renewable energy, such as wind and solar power (=power from the sun’s energy)","definition[18]":"the ability of a machine to perform work","example[95]":"Supercomputers use multiple processors to vastly increase computing power and speed.","example[96]":"The car will be powered by electricity.","definition[19]":"working by means of gas, NUCLEAR ENERGY etc","example[97]":"gas-powered turbines","definition[20]":"driven by a motor","definition[21]":"showing that you are an important person in a business organization","example[98]":"If you think you can have a power career and a fulfilling family life, you’re crazy.","example[99]":"the director’s power lunches with movie moguls in trendy restaurants","example[100]":"a power nap (=a short sleep during the day that allows you to work more effectively later)"}