{"word[0]":"charge","signpost[0]":"price","definition[0]":"the amount of money you have to pay for goods or services","example[0]":"Guided tours are provided at no charge.","example[1]":"Your order will be sent free of charge (=with no cost).","example[2]":"an admission charge of $5","note[0]":"charge of","example[3]":"There is a charge for the use of the swimming pool.","note[1]":"charge for","definition[1]":"the position of having control or responsibility for a group of people or an activity","example[4]":"Stern put Travis in charge of (=gave him control of) the research team.","example[5]":"Owens came in and took charge of (=took control of) the situation.","example[6]":"A commander in each county was to have charge of the local militia.","example[7]":"He asked to speak to the person in charge.","note[2]":"in charge (of something)","example[8]":"the officer in charge of the investigation","signpost[1]":"somebody/something you look after","definition[2]":"if someone or something is in your charge, you are responsible for looking after them","example[9]":"teachers that do their best for the children in their charge","example[10]":"The files were left in your charge.","definition[3]":"someone that you are responsible for looking after","example[11]":"Sarah bought some chocolate for her three young charges.","definition[4]":"an official statement by the police that someone may be guilty of a crime","example[12]":"He was found guilty of all six charges against him.","note[3]":"charge against","example[13]":"Higgins is facing a charge of armed robbery.","example[14]":"The following morning, he was arrested on a charge of burglary.","note[4]":"on a charge (of something)","signpost[2]":"blame","definition[5]":"a written or spoken statement blaming someone for doing something bad or illegal","synonym[0]":"allegation","example[15]":"Wallace denied charges that he had lied to investigators.","note[5]":"deny/counter a charge","example[16]":"The speech laid him open to charges of political bias.","note[6]":"lay/leave yourself open to a charge of something","example[17]":"the charge that tobacco companies target young people with their ads","note[7]":"charge that","example[18]":"a charge of racial discrimination against the company","definition[6]":"an attack in which soldiers or animals move towards someone or something very quickly","definition[7]":"electricity that is put into a piece of electrical equipment such as a battery","example[19]":"Leave the battery on charge all night.","note[8]":"on charge","signpost[3]":"explosive","definition[8]":"an explosive put into something such as a bomb or gun","signpost[4]":"strength of feelings","definition[9]":"the power of strong feelings","example[20]":"Cases of child abuse have a strong emotional charge.","signpost[5]":"an order to do something","example[21]":"The old servant fulfilled his master’s charge to care for the children.","note[9]":"charge to do something","heading[0]":"– Meaning 1: the amount of money you have to pay for goods or services","form[0]":"ADJECTIVES/NOUN + charge","collocation[0]":"a small charge","example[22]":"For a small charge guests can use the hotel sauna.","collocation[1]":"an extra/additional charge","example[23]":"Breakfast may be served in your bedroom at no extra charge.","collocation[2]":"free of charge","example[24]":"Delivery is free of charge.","collocation[3]":"somebody’s charges are high/low","example[25]":"His charges are too high.","collocation[4]":"a fixed charge","example[26]":"There’s a fixed charge for having a dental check.","collocation[5]":"a nominal charge","example[27]":"You can use the tennis courts for a nominal charge.","collocation[6]":"a minimum charge","example[28]":"There’s a minimum charge of £10 per person in the Terrace restaurant.","collocation[7]":"a service charge","example[29]":"The restaurant’s prices include a 10% service charge.","collocation[8]":"an admission charge","example[30]":"There is no admission charge.","collocation[9]":"a call-out charge","example[31]":"The electrician said there is a £40 call-out charge.","collocation[10]":"a cancellation charge","example[32]":"If you change your flight booking, you may have to pay a cancellation charge.","collocation[11]":"a delivery charge","example[33]":"How much is the store’s delivery charge?","collocation[12]":"bank charges","example[34]":"You will have to pay bank charges if your account is overdrawn.","collocation[13]":"pay a charge","example[35]":"There will be a small charge to pay.","collocation[14]":"make a charge","example[36]":"We make no charge for this service.","collocation[15]":"incur a charge","example[37]":"All cancellations incur a charge.","collocation[16]":"introduce/impose a charge","example[38]":"The government introduced a charge for water.","collocation[17]":"waive a charge","example[39]":"I’ve asked the bank to waive the charge this time.","heading[1]":"– Meaning 4: an official statement by the police that someone may be guilty of a crime","collocation[18]":"a murder/burglary/drugs etc charge","example[40]":"He appeared in court on fraud charges.","example[41]":"Robins was in jail awaiting trial on drugs charges.","collocation[19]":"criminal charges","example[42]":"The investigation resulted in criminal charges against three police officers.","collocation[20]":"a serious charge","example[43]":"Drinking and driving is a very serious charge.","collocation[21]":"a felony charge","example[44]":"He pleaded not guilty to a felony charge of cocaine possession.","collocation[22]":"press/bring charges","example[45]":"Sometimes the victim of an assault does not want to press charges.","collocation[23]":"face charges","example[46]":"A farmer is facing charges of cruelty and neglect.","collocation[24]":"deny/admit a charge","example[47]":"All three men denied the charge of manslaughter.","collocation[25]":"plead guilty to a charge","example[48]":"The youth pleaded guilty to a charge of arson.","collocation[26]":"drop the charges","example[49]":"The prosecution dropped the charges in 2005.","collocation[27]":"dismiss the charges","example[50]":"If there is insufficient evidence, the court will dismiss the charges.","collocation[28]":"be released without charge","example[51]":"She had been arrested twice and released without charge.","collocation[29]":"be convicted of/on a charge","example[52]":"McCorley was convicted on a charge of assault.","collocation[30]":"be acquitted of/on a charge","example[53]":"Both men were acquitted of all charges.","definition[10]":"to ask someone for a particular amount of money for something you are selling","example[54]":"The hotel charges $125 a night.","example[55]":"The restaurant charged us £40 for the wine.","note[10]":"charge somebody £10/$50 etc (for something)","example[56]":"The gallery charges an entrance fee.","note[11]":"charge rent/a fee/interest etc","example[57]":"Calls will be charged at 44p per minute.","note[12]":"charge something at something","example[58]":"We won’t charge for delivery if you pay now.","definition[11]":"to record the cost of something on someone’s account, so that they can pay for it later","example[59]":"Wilson charged the drinks to his room.","example[60]":"Use a courier and charge it to the department.","definition[12]":"to pay for something with a credit card","example[61]":"‘How would you like to pay?’ ‘I’ll charge it.’","example[62]":"I charged the shoes on Visa.","note[13]":"charge something on something","definition[13]":"to state officially that someone may be guilty of a crime","example[63]":"Gibbons has been charged with murder.","note[14]":"charge somebody with something","signpost[6]":"blame somebody","definition[14]":"to say publicly that you think someone has done something wrong","example[64]":"Demonstrators have charged that the police used excessive force against them.","definition[15]":"to deliberately run or walk somewhere quickly","example[65]":"The boys charged noisily into the water.","note[15]":"charge around/through/out etc","definition[16]":"to deliberately rush quickly towards someone or something in order to attack them","example[66]":"Then, with a final effort, our men charged the enemy for the last time.","example[67]":"The bear charged towards her at full speed.","note[16]":"charge at/towards/into","definition[17]":"if a battery charges, or if you charge it, it takes in and stores electricity","example[68]":"The shaver can be charged up.","signpost[7]":"order somebody","definition[18]":"to order someone to do something or make them responsible for it","example[69]":"The commission is charged with investigating war crimes.","note[17]":"charge somebody with doing something","definition[19]":"to load a gun","signpost[8]":"glass","definition[20]":"to fill a glass","definition[21]":"an amount of money paid for services or goods","example[70]":"Vodafone is cutting its call charges by 15%.","example[71]":"You can search the database free of charge.","example[72]":"Politicians are opposing higher charges for electricity.","definition[22]":"money charged by a bank for services such as paying cheques, sending out bank statements etc","example[73]":"concern at the level of bank charges charged by some of the High Street banks","definition[23]":"a legal right to an asset belonging to another person if a particular event happens, for example if they do not repay a loan with which they bought the asset","example[74]":"Fund the purchase of the house by a loan, with the lender holding a charge on the property as security.","definition[24]":"a cost, especially one that is not paid regularly","example[75]":"The company’s net loss for the period will also include a restructuring charge of $12 million.","example[76]":"Denver said it will take a charge (=pay a cost) of about $590 million for the write-off of certain assets.","definition[25]":"to be the person who manages a group of people, an organization, or an activity","example[77]":"Under the new plan, each board member will be in charge of one product area.","example[78]":"He was put in charge of GM’s worldwide truck operations.","definition[26]":"to take control of a group of people, an organization, or an activity","example[79]":"After a brief power struggle, she took charge of the family firm.","definition[27]":"an official statement saying that someone has done something against the law","example[80]":"He was arrested on charges of bribery.","example[81]":"The charges against him are expected to cover fraud, forgery and fraudulent bankruptcy.","definition[28]":"to ask someone to pay a particular amount of money for something","example[82]":"She was charged $995 for a belt that really only cost $195.","example[83]":"The prices that producers charged for food fell by 0.8% in July.","definition[29]":"to record the cost of something on someone’s account so they can pay for it later","example[84]":"Charge the room to the company’s account.","definition[30]":"to pay for something with a CREDIT CARD","example[85]":"I charged the shoes on my Visa card.","definition[31]":"to state officially that someone has done something against the law","example[86]":"He was charged with theft."}