{"word[0]":"idea","signpost[0]":"plan/suggestion","definition[0]":"a plan or suggestion for a possible course of action, especially one that you think of suddenly","example[0]":"You should talk to Ken - he’s always full of good ideas.","example[1]":"I knew it was a bad idea to leave him on his own.","example[2]":"It was my wife’s idea to move house.","example[3]":"The idea for the book came from an old war movie.","note[0]":"idea for","example[4]":"I had the idea of asking Katie for help.","note[1]":"the idea of doing something","signpost[1]":"knowledge","definition[1]":"a general understanding of something, based on some knowledge about it","example[5]":"Could you give me an idea of how bad his injuries are?","example[6]":"You must have some idea (=have at least a little knowledge) of what happened to the money.","example[7]":"Don’t worry if you don’t understand it right now – you’ll get the idea (=begin to understand or be able to do something).","example[8]":"She doesn’t have any idea where they’ve gone.","note[2]":"have no idea/not have any idea","example[9]":"Can you give me a rough idea of how much the repairs will cost?","note[3]":"a general/rough idea","example[10]":"I don’t have the faintest idea what to get Rachel for her birthday.","note[4]":"not have the faintest/slightest/foggiest idea","signpost[2]":"aim/intention","definition[2]":"the aim, intention, or purpose of doing something","example[11]":"The idea is to teach children to save money.","example[12]":"They wanted Mike to go to law school, but he had other ideas (=had different plans).","example[13]":"The idea behind the outing is to encourage employees to get to know each other.","note[5]":"idea of/behind","signpost[3]":"how you imagine something to be","definition[3]":"an image in your mind of what something is like or should be like","example[14]":"I only have a vague idea of the kind of work I’ll be doing.","example[15]":"It helps if you have a clear idea of what you want.","example[16]":"The very idea of kissing him made her feel physically sick.","example[17]":"Chocolate milk and a piece of cake is not my idea of dinner.","note[6]":"not my idea of something","example[18]":"Chefs differ in their idea of what makes a good dessert.","note[7]":"idea of","signpost[4]":"belief/opinion","definition[4]":"someone’s opinion or belief about something","example[19]":"No, I’m not seeing Jane. Where did you get that idea?","note[8]":"where did you get that idea?","example[20]":"She had some rather unusual ideas about raising children.","note[9]":"idea about","signpost[5]":"principle","definition[5]":"a principle or belief about how something is or should be","example[21]":"The whole idea of democracy was something strange and new to most people.","example[22]":"It’s based on the idea that all people are created equal.","note[10]":"idea that","collocation[0]":"have an idea","example[23]":"I’ve had an idea. Why don’t we walk into town?","collocation[1]":"get an idea","example[24]":"She got the idea from an article in a magazine.","collocation[2]":"give somebody an idea","example[25]":"What gave you the idea for the book?","collocation[3]":"come up with an idea","example[26]":"He’s always coming up with interesting ideas.","collocation[4]":"hit on an idea","example[27]":"Then we hit on the idea of renting a cottage.","collocation[5]":"toy with an idea","example[28]":"I’m toying with the idea of going back to college.","collocation[6]":"brainstorm ideas","example[29]":"We had a meeting to brainstorm ideas for the new advertising campaign.","collocation[7]":"share/exchange ideas","example[30]":"an opportunity for local business people to share ideas","collocation[8]":"an idea comes to somebody","example[31]":"The idea came to me while I was having a bath.","collocation[9]":"a good/bad idea","example[32]":"Keeping the drinks cold in the bath was a good idea.","example[33]":"Knocking down this wall was a really bad idea.","collocation[10]":"a great/brilliant/excellent idea","example[34]":"What a great idea!","collocation[11]":"a bright idea","example[35]":"Whose bright idea was it to leave the washing out in the rain?","collocation[12]":"a clever idea","example[36]":"It seemed like a clever idea at the time.","collocation[13]":"interesting","example[37]":"The idea sounded interesting, but I didn’t think it would work.","collocation[14]":"stupid/ridiculous/crazy","example[38]":"The idea sounded crazy to me.","example[39]":"Camping in the middle of winter was a ridiculous idea!","example[40]":"He had the crazy idea of hitchhiking around South America.","collocation[15]":"original/innovative","example[41]":"The company is looking for people who can come up with original ideas.","collocation[16]":"a half-baked idea","example[42]":"It’s yet another of the government’s half-baked ideas.","collocation[17]":"be full of ideas","example[43]":"The children were enthusiastic and full of ideas.","collocation[18]":"fire/bounce ideas off one another","example[44]":"Our regular meetings are opportunities to fire ideas off each other.","definition[6]":"something that you think of, especially something that you could do or suggest","example[45]":"I think that’s an excellent idea.","example[46]":"Let me know if you have any good ideas.","display[0]":"thought","definition[7]":"something that comes into your mind","example[47]":"The thought had entered my mind that he might be lying.","example[48]":"It was a worrying thought.","example[49]":"She was lost in her thoughts.","display[1]":"impression","definition[8]":"the idea that you have in your mind about what someone or something is like","example[50]":"What was your impression of him?","display[2]":"inspiration","definition[9]":"a good and original idea, which makes you think of doing or creating something","example[51]":"Where did you get your inspiration from for the book?","example[52]":"He suddenly had a flash of inspiration.","example[53]":"The design for the house was entirely the inspiration of the architect.","display[3]":"brainwave","definition[10]":"a sudden new and clever idea, especially one that solves a problem","example[54]":"I thought I’d have to sell the house, but then I had a brainwave.","display[4]":"concept","definition[11]":"an idea of how something is, or how something should be done","example[55]":"Concepts of beauty are different in different cultures.","example[56]":"the traditional concept of marriage","display[5]":"notion","definition[12]":"an idea about life or society, especially one that is a little silly or old-fashioned","example[57]":"There is no evidence to support the notion that poverty is caused by laziness."}