{"word[0]":"source","definition[0]":"a thing, place, activity etc that you get something from","example[0]":"They get their money from various sources.","example[1]":"Beans are a very good source of protein.","note[0]":"source of","example[2]":"For me, music is a great source of enjoyment.","example[3]":"Is your pension taxed at source  (=before it is paid to you)?","note[1]":"at source","definition[1]":"the cause of something, especially a problem, or the place where it starts","example[4]":"We’ve found the source of the trouble.","example[5]":"The recent name change has been the source of some confusion.","definition[2]":"a person, book, or document that supplies you with information","example[6]":"List all your sources at the end of your essay.","example[7]":"I’ve heard from reliable sources that the company is in trouble.","definition[3]":"the place where a stream or river starts","definition[4]":"source code","form[0]":"ADJECTIVES/NOUN + source","collocation[0]":"a good/excellent/rich source","example[8]":"Milk is a good source of calcium.","collocation[1]":"a useful source","example[9]":"People said television was their most useful source of local information.","collocation[2]":"a major/important source","example[10]":"The lead mines were once a major source of employment for the islanders.","collocation[3]":"a great source","example[11]":"In times of stress, food can be a great source of comfort.","collocation[4]":"the main/primary source","example[12]":"It started as a hobby, but now it is his main source of income.","collocation[5]":"an alternative source","example[13]":"The university is exploring alternative funding sources.","collocation[6]":"an energy source","example[14]":"We hope to see increased usage of renewable energy sources.","collocation[7]":"a food source","example[15]":"Slugs attack potatoes in late summer, when other food sources are disappearing.","collocation[8]":"a power source","example[16]":"First, you need to turn off the power source.","collocation[9]":"a light source","example[17]":"The statue is illuminated by a hidden light source.","definition[5]":"if goods are sourced from a particular place, they are obtained from that place","example[18]":"locally sourced milk","example[19]":"Fish for the restaurant is sourced daily from British ports.","note[2]":"source from","definition[6]":"to find out where something can be obtained","example[20]":"We might be able to source the parts.","example[21]":"Tourism in the area is a slowly-growing source of revenue, helped by the development of air transport networks.","example[22]":"The cuts are a source of concern to all of us.","example[23]":"The source of the problem is the inferior quality of our labour supply.","definition[7]":"a person, book, document etc that supplies you with information","example[24]":"Industry sources say that Chrysler is planning to increase production.","example[25]":"At the end of your dissertation, please list your sources, including websites.","definition[8]":"if tax is taken off your income at source, it is taken before you get any income","example[26]":"Tax deducted at source from certain investment income is reclaimable by non-taxpayers.","definition[9]":"if a company sources materials, parts etc from a particular place, it obtains them from there","example[27]":"Components will be sourced from Polish producers."}