{"definition[0]":"someone who is bad-tempered becomes easily annoyed and talks in an angry way to people","definition[1]":"becoming easily annoyed and talking in an angry unfriendly way to people","example[0]":"Her husband was a disagreeable, bad-tempered man.","example[1]":"I was wondering why she had been so bad-tempered recently.","display[0]":"moody","definition[2]":"often becoming annoyed or unhappy, especially when there seems to be no good reason","example[2]":"a moody teenager","example[3]":"Myra can be a bit moody sometimes.","definition[3]":"easily annoyed about small things, especially because you are tired, upset, or worried","example[4]":"I hadn’t had much sleep and was feeling tired and irritable.","example[5]":"Since Steve quit smoking, he’s been really irritable.","example[6]":"You’re turning into an irritable old man.","display[1]":"grumpy/grouchy","definition[4]":"easily annoyed and often complaining about things – used especially when talking about people you know well. These words sound much gentler and less critical than bad-tempered","example[7]":"There’s no need to be so grumpy!","example[8]":"He woke up in a grouchy mood.","display[2]":"be in a bad mood","definition[5]":"to be feeling annoyed or unhappy, so that you do not speak in a normal friendly way to people – used especially when this only lasts for a fairly short period of time and is not part of someone’s usual character","example[9]":"Leave him alone – he’s in a bad mood today.","example[10]":"By the time I got home at 9 o'clock, I was in a really bad mood.","display[3]":"have/have got a short fuse","definition[6]":"to be likely to become angry very suddenly, especially in an unreasonable way","example[11]":"Be careful what you say to the Colonel - he’s got a very short fuse.","display[4]":"cantankerous","definition[7]":"bad-tempered and complaining or quarrelling a lot – used especially about old people","example[12]":"The hotel owner was a cantankerous old man.","example[13]":"In later years, she became quite cantankerous."}