{"word[0]":"dump","signpost[0]":"put something somewhere","definition[0]":"to put something somewhere in a careless untidy way","example[0]":"Merrill dumped her suitcase down in the hall.","example[1]":"They dump tons of salt on icy road surfaces to make driving safer.","note[0]":"dump something on something","example[2]":"He found a can of beef stew and dumped it in a saucepan to heat.","note[1]":"dump something in/into something","signpost[1]":"get rid of something","definition[1]":"to get rid of something that you do not want","example[3]":"Ellie dumped all the photos of her ex-husband.","example[4]":"He dumped her body into the sea.","definition[2]":"to get rid of waste material by taking it from people’s houses and burying it under the soil","example[5]":"Britain dumps more of its waste than any other European country.","signpost[2]":"end relationship","definition[3]":"to end a relationship with someone","example[6]":"Vicky dumped Neil yesterday.","signpost[3]":"sell goods","definition[4]":"to get rid of goods by selling them in a foreign country at a much lower price","example[7]":"a campaign to stop cheap European beef being dumped in West Africa","note[2]":"dump in/on","signpost[4]":"copy information","definition[5]":"to copy information stored in a computer’s memory on to something else such as a disk or magnetic tape","signpost[5]":"waste","definition[6]":"a place where unwanted waste is taken and left","example[8]":"Put the rest into a sack to take to the dump.","example[9]":"an underground nuclear waste dump","example[10]":"a dump site","example[11]":"The fire probably started in a rubbish dump.","note[3]":"rubbish dump","signpost[6]":"weapons","definition[7]":"a place where military supplies are stored, or the supplies themselves","example[12]":"There has been a series of explosions in an ammunition dump.","signpost[7]":"unpleasant place","definition[8]":"a place that is unpleasant to live in because it is dirty, ugly, untidy etc","example[13]":"‘What a dump, ’ she added as they entered the village.","example[14]":"Why are you living in a dump like this?","definition[9]":"the act of copying the information stored in a computer’s memory onto something else, such as a disk","example[15]":"a screen dump","definition[10]":"to put waste in a particular place, especially illegally","example[16]":"11 million gallons of crude oil were illegally dumped into Prince William Sound.","definition[11]":"to sell something that you do not want","example[17]":"But before you call your broker and dump all your stockholdings, consider some other data.","definition[12]":"to sell products cheaply in an export market, perhaps in order to increase your share of the market there","example[18]":"Japanese-made display screens are being dumped in the US at below-market prices.","definition[13]":"to copy information from a computer onto another computer, or onto a TAPE or a DISK","example[19]":"Orders placed by credit card are automatically dumped into the computer system."}