{"word[0]":"proposition","signpost[0]":"statement","definition[0]":"a statement that consists of a carefully considered opinion or judgment","example[0]":"Most people accept the proposition that we have a duty to protect endangered animals.","note[0]":"proposition that","example[1]":"The theory is founded on two basic propositions.","signpost[1]":"suggestion","definition[1]":"a suggestion, or something that is suggested or considered as a possible thing to do","example[2]":"He telephoned Stuart with a proposition.","example[3]":"I’ve got a proposition to put to you.","example[4]":"The offer of two tickets for the price of one makes it a very attractive proposition.","note[1]":"attractive/interesting/practical etc proposition","example[5]":"It doesn’t sound like a very viable proposition to me.","definition[2]":"a suggested change or addition to the law of a state of the US, which citizens vote on","example[6]":"Proposition 147","definition[3]":"something that must be proved, or a question to which the answer must be found – used in geometry","heading[0]":"– Meaning 2: a suggestion, or something that is suggested or considered as a possible thing to do","collocation[0]":"put a proposition to somebody","example[7]":"A proposition was put to Owen, and he is considering it.","example[8]":"I’m going to make you a proposition.","form[0]":"ADJECTIVES/NOUN + proposition","collocation[1]":"a business proposition","example[9]":"Does this mean you’ve changed your mind about my business proposition?","collocation[2]":"a commercial proposition","example[10]":"Gold mining is not a commercial proposition here.","collocation[3]":"an attractive proposition","example[11]":"Setting up your own business is a very attractive proposition.","collocation[4]":"an interesting proposition","example[12]":"A further study focussing on older people is an interesting proposition.","collocation[5]":"a practical/viable proposition","example[13]":"A complete ban on strikes is not a practical proposition.","definition[4]":"to suggest to someone that they have sex with you","example[14]":"Here, prostitutes constantly proposition tourists.","definition[5]":"a business idea, offer, or suggestion, for example a possible business deal","example[15]":"I’ll consider your proposition and let you know my decision next week.","example[16]":"We have a proposition to make.","example[17]":"It is an attractive proposition.","definition[6]":"in the US, a suggested change to the law of a state, which citizens vote on","example[18]":"Proposition 13, passed by California voters in 1978, requires that any new special taxes be approved by at least two-thirds of the voters.","definition[7]":"a statement that consists of a carefully considered opinion or judgement","example[19]":"Kondratiev’s basic proposition was that the advanced capitalist economies go through regular cycles of booms and slumps  (=ups and downs).","example[20]":"The proposition that the world economy is a system means that all parts are in one way or another dependent on each other."}