{"word[0]":"ought to","definition[0]":"used to say that someone should do something because it is the best or most sensible thing to do","synonym[0]":"should","example[0]":"You really ought to quit smoking.","example[1]":"The company ought to be making changes in its marketing strategy.","example[2]":"What sort of crimes ought the police to concentrate on?","example[3]":"You were out enjoying yourself when you ought to have been studying.","definition[1]":"used to make a suggestion about something you think is a good idea, especially in a social situation","example[4]":"We ought to get together some time soon.","example[5]":"You ought to meet him; he’s really nice.","example[6]":"We ought to get her some flowers for her birthday.","example[7]":"I ought to call Brian.","definition[2]":"used to say that someone should do something or something should happen, because it is morally right or fair","example[8]":"You ought to be ashamed of yourself.","example[9]":"The courts ought to treat black and white defendants in exactly the same way.","example[10]":"Many people felt that America ought not to take part in the war.","definition[3]":"used to say that you think something will probably happen, is probably true etc","example[11]":"He left two hours ago, so he ought to be there by now.","example[12]":"They ought to win – they’ve trained hard enough.","example[13]":"That ought to be enough potatoes for eight people.","example[14]":"New technology ought to make this easier.","heading[0]":"GRAMMAR: Patterns with ought to","explanation[0]":"You say that someone ought to do something","example[15]":"You ought to explain","explanation[1]":"You say that someone ought to have done something","example[16]":"You ought to have explained  (=but you did not)","explanation[2]":"You say that someone ought not to do something","example[17]":"She ought not to go","explanation[3]":"You say that someone ought not to have done something","example[18]":"She ought not to have gone  (=but she did go)","explanation[4]":"You can also use oughtn’t","example[19]":"She oughtn’t to go","example[20]":"She oughtn’t to have gone","explanation[5]":"You ask ought someone to do something","example[21]":"Ought we to tell them?","explanation[6]":"You ask ought someone to have done something","example[22]":"Ought we to have told them?"}