{"word[0]":"collapse","signpost[0]":"structure","definition[0]":"if a building, wall etc collapses, it falls down suddenly, usually because it is weak or damaged","example[0]":"Uncle Ted’s chair collapsed under his weight.","example[1]":"The roof had collapsed long ago.","signpost[1]":"illness/injury","definition[1]":"to suddenly fall down or become unconscious because you are ill or weak","example[2]":"He collapsed with a heart attack while he was dancing.","example[3]":"Marion’s legs collapsed under her.","signpost[2]":"fail","definition[2]":"if a system, idea, or organization collapses, it suddenly fails or becomes too weak to continue","example[4]":"The luxury car market has collapsed.","example[5]":"I thought that without me the whole project would collapse.","signpost[3]":"prices","definition[3]":"if prices, levels etc collapse, they suddenly become much lower","example[6]":"There were fears that property prices would collapse.","signpost[4]":"sit/lie","definition[4]":"to suddenly sit down, especially because you are very tired or want to relax","example[7]":"I was so exhausted when I got home, I just collapsed on the sofa.","signpost[5]":"fold something smaller","definition[5]":"if a piece of furniture or equipment collapses, or if you collapse it, you can fold it so that it becomes smaller","example[8]":"The legs on our card table collapse so we can store it in the closet.","definition[6]":"if a lung or a blood vessel collapses, it suddenly becomes flat, so that it no longer has any air or blood in it","signpost[6]":"business/system/idea etc","definition[7]":"a sudden failure in the way something works, so that it cannot continue","example[9]":"the threat of economic collapse","example[10]":"His business was in danger of collapse.","example[11]":"the collapse of the Soviet Union","note[0]":"collapse of","signpost[7]":"building/structure/furniture etc","definition[8]":"when something suddenly falls down","example[12]":"the collapse of an apartment building during the earthquake","example[13]":"The ancient abbey was in imminent danger of collapse.","definition[9]":"when someone suddenly falls down or becomes unconscious because of an illness or injury","example[14]":"The president said he was fine after his collapse yesterday.","example[15]":"She suffered a collapse under anaesthetic.","signpost[8]":"money/prices etc","definition[10]":"a sudden decrease in the value of something","example[16]":"the collapse of the stock market","example[17]":"a collapse in the value of pensions","note[1]":"collapse in","definition[11]":"if a company, organization, or system collapses, it suddenly fails or becomes too weak to continue","example[18]":"We did not want existing company pension schemes to collapse.","definition[12]":"when a company, organization, or system suddenly fails or becomes too weak to continue","example[19]":"The province has become sadly familiar with news of redundancies and company collapses."}