{"word[0]":"speech","definition[0]":"a talk, especially a formal one about a particular subject, given to a group of people","example[0]":"Collins gave the keynote speech  (=most important speech).","example[1]":"Each child had to give a short speech to the rest of the class.","note[0]":"make/give/deliver a speech","example[2]":"He has to make a lot of after-dinner speeches.","example[3]":"a major speech on relations with China","note[1]":"speech on/about","definition[1]":"the ability to speak","example[4]":"Only humans are capable of speech.","definition[2]":"spoken language rather than written language","example[5]":"In speech we use a smaller vocabulary than in writing.","definition[3]":"the particular way in which someone speaks","example[6]":"Bob’s speech was slurred, and he sounded drunk.","definition[4]":"a set of lines that an actor must say in a play","example[7]":"Hamlet’s longest speech","collocation[0]":"give/make a speech","example[8]":"She gave a speech at the party conference.","collocation[1]":"deliver a speech","example[9]":"The president delivered a major speech to Congress yesterday.","form[0]":"ADJECTIVES/NOUN + speech","example[10]":"The speeches were all really long.","collocation[2]":"short/brief","example[11]":"The chairman opened the meeting with a brief speech.","collocation[3]":"a passionate/impassioned speech","example[12]":"She made impassioned speeches on civil rights.","collocation[4]":"an emotional speech","example[13]":"On retiring, she delivered an emotional farewell speech.","collocation[5]":"a moving speech","example[14]":"That was a very moving speech.","collocation[6]":"a powerful speech","example[15]":"He gave a powerful speech calling for unity.","collocation[7]":"a rousing/stirring speech","example[16]":"Thousands of people were inspired by his stirring speeches.","collocation[8]":"a major speech","example[17]":"This was her first major speech as party leader.","collocation[9]":"somebody’s inaugural speech","example[18]":"He said all the right things in his inaugural speech.","collocation[10]":"somebody’s acceptance speech","example[19]":"In his acceptance speech, he paid tribute to his wife.","collocation[11]":"a farewell speech","collocation[12]":"an after-dinner speech","example[20]":"He gets paid a lot for making after-dinner speeches.","collocation[13]":"a keynote speech","example[21]":"The prime minister will make his keynote speech at the conference today.","collocation[14]":"a political speech","example[22]":"She began writing political speeches for local politicians.","collocation[15]":"a campaign speech","example[23]":"Eisenhower was careful in his campaign speeches to use only the vaguest of phrases.","example[24]":"The bridegroom usually makes a speech after the wedding.","example[25]":"In her speech, she proposed major changes to the welfare system.","example[26]":"the opening speech of the conference","display[0]":"address","definition[5]":"a speech that a very important person gives to a large group of people","example[27]":"the president’s address to the nation","example[28]":"He was surrounded by security officers as he made his address.","definition[6]":"an occasion when someone speaks to a group of people giving them information about a particular subject or about their experiences","example[29]":"I went to an interesting talk on the wildlife of Antarctica.","example[30]":"He’s been asked to give a talk about his trip to India.","display[1]":"lecture","definition[7]":"a talk, especially on an academic subject and given to students in a university","example[31]":"a lecture on 17th-century French literature","example[32]":"Professor Black is giving the lecture.","display[2]":"presentation","definition[8]":"a talk in which you describe or explain a new product or idea, especially one you give for your company","example[33]":"I had to give a presentation to the board of directors.","example[34]":"He's making a presentation to the management of a well-known manufacturing company.","display[3]":"sermon","definition[9]":"a talk given by a priest or a religious leader","example[35]":"The vicar preached a sermon about the need for forgiveness.","display[4]":"statement","definition[10]":"a spoken or written announcement that someone makes in public, often to journalists","example[36]":"The minister issued a short statement in which he said he had no plans to resign."}