{"word[0]":"execution","definition[0]":"when someone is killed, especially as a legal punishment","example[0]":"a public execution","example[1]":"The two men face execution  (=they will be killed as a punishment).","example[2]":"Torture and summary execution  (=execution without a trial or any legal process) are common.","example[3]":"He was granted a stay of execution  (=delay in carrying out an execution).","definition[1]":"a process in which you do something that has been carefully planned","synonym[0]":"implementation","example[4]":"the formulation and execution of urban policy","note[0]":"execution of","definition[2]":"the process of making sure that the instructions in a legal document are followed","example[5]":"the execution of a will","definition[3]":"the performance of a difficult action or movement","definition[4]":"the process of producing something such as a painting, film, book etc, or the way it is produced","example[6]":"art that is unusual in design and execution","definition[5]":"when you make a computer program work, or a command (=instruction) happen","collocation[0]":"carry out an execution","example[7]":"The order to carry out his execution was sent to the prison.","collocation[1]":"hold an execution","example[8]":"The executions will be held later today.","collocation[2]":"face execution","example[9]":"He is facing execution after being found guilty of murdering three women.","collocation[3]":"await execution","example[10]":"The convicted men were moved to Virginia Penitentiary to await execution.","collocation[4]":"an execution takes place","example[11]":"In Elizabethan times, the execution of traitors took place on Tower Hill.","example[12]":"Bethea's hanging on August 14,1936 was the last public execution in America.","collocation[5]":"a mock execution","example[13]":"He had to endure torture and a mock execution.","collocation[6]":"summary execution","example[14]":"Protestors face summary execution.","collocation[7]":"a mass execution","example[15]":"Eleven convicted murderers were hanged in what was the country's biggest ever mass execution.","collocation[8]":"a stay of execution","example[16]":"He was granted a stay of execution by the Supreme Court."}