{"word[0]":"boundary","plural[0]":"boundaries","definition[0]":"the real or imaginary line that marks the edge of a state, country etc, or the edge of an area of land that belongs to someone","example[0]":"National boundaries are becoming increasingly meaningless in the global economy.","example[1]":"We would need their agreement to build outside the city boundary.","example[2]":"The stream curves round to mark the boundary of his property.","example[3]":"Anything that crosses the boundary of a black hole cannot get back.","example[4]":"We walked through the churchyard towards the boundary wall.","example[5]":"The property’s boundary line is 25 feet from the back of the house.","example[6]":"boundary disputes between neighbouring countries","example[7]":"The Mississippi River forms a natural boundary between Iowa and Illinois.","note[0]":"boundary between","definition[1]":"the limit of what is acceptable or thought to be possible","example[8]":"within the boundaries of the law","note[1]":"within/beyond the boundaries of something","example[9]":"art that pushes back the boundaries","note[2]":"push back the boundaries (of something)","example[10]":"the boundaries of human knowledge","note[3]":"boundary of","definition[2]":"the point at which one feeling, idea, quality etc stops and another starts","example[11]":"the boundaries between work and play","note[4]":"boundary of/between","example[12]":"the blurring of the boundaries between high and popular culture","definition[3]":"the outer limit of the playing area in cricket, or a shot that sends the ball across this limit for extra points","form[0]":"ADJECTIVES/NOUN + boundary","collocation[0]":"national/state boundaries","example[13]":"Big companies usually aim to expand outside national boundaries.","collocation[1]":"international boundaries","example[14]":"About 10% of hazardous waste is shipped across international boundaries.","collocation[2]":"a city boundary","example[15]":"The new housing estates stretch beyond the old city boundaries.","collocation[3]":"the northern/southern etc boundary","example[16]":"the southern boundary of San Francisco","collocation[4]":"a geographical boundary","example[17]":"Today satellite communications cross all geographical boundaries.","collocation[5]":"a political boundary","example[18]":"Reforms could extend the geographical and political boundaries of the EU.","collocation[6]":"a natural boundary","example[19]":"Here, the Andes form a natural boundary between Argentina and Chile.","collocation[7]":"mark/form a boundary","example[20]":"The river Jordan marks the boundary between Israel and Jordan.","collocation[8]":"cross/transcend a boundary","example[21]":"These are practical problems that cross political boundaries.","form[1]":"boundary + NOUN","collocation[9]":"a boundary wall/fence","example[22]":"The boundary wall was about twenty foot high.","collocation[10]":"a boundary line","example[23]":"There was some disagreement about the exact position of the boundary line.","collocation[11]":"a boundary dispute","example[24]":"We had to hire a lawyer to sort out the boundary dispute."}