{"word[0]":"click","definition[0]":"to make a short hard sound, or make something produce this sound","example[0]":"The door clicked shut behind me.","example[1]":"Mother clicked her tongue  (=made a short sound to show disapproval) and sighed.","example[2]":"Edmund clicked his fingers  (=made a short sound to get someone’s attention) for John to follow him.","example[3]":"Vogel clicked his heels  (=hit the heels of his shoes together) and bowed.","example[4]":"Twist the lever and the gears click into place.","definition[1]":"to press a button on a computer mouse to choose something from the screen that you want the computer to do, or to press a button on a remote control","example[5]":"Choose the image you want by clicking twice.","example[6]":"Children can click on a sentence to hear it read aloud.","note[0]":"click on","definition[2]":"to suddenly understand or realize something","example[7]":"It’s hard work, but one day it will just click.","example[8]":"I thought, ‘What is he doing?’ and then suddenly it all clicked into place  (=I understood how all the events related to each other).","definition[3]":"if two people click, they like, understand, and agree with each other","example[9]":"They clicked straight away.","definition[4]":"to happen in a good or successful way, especially because people are working together well","example[10]":"If everything clicks, we should have a good season.","form[0]":"click + NOUN","collocation[0]":"click your fingers","example[11]":"She clicks her fingers and he comes running.","collocation[1]":"click your tongue","example[12]":"She clicked her tongue in annoyance.","collocation[2]":"click your heels","example[13]":"He clicked his heels and saluted.","collocation[3]":"click into place/position","example[14]":"Make sure the lid clicks firmly into place.","collocation[4]":"click open/shut","example[15]":"I heard the gate at the front of the house click open.","definition[5]":"a short hard sound","example[16]":"The door closed with a click.","collocation[5]":"hear a click","example[17]":"She heard a click, and then the line went dead.","collocation[6]":"make/produce a click","example[18]":"He made a click of disapproval.","collocation[7]":"go click","example[19]":"Soon there were photographers all around him going click, click, click.","collocation[8]":"shut/close with a click","example[20]":"The front door shut with a click.","collocation[9]":"a sharp click","example[21]":"There was a sharp click, and the panel opened like a tiny door.","collocation[10]":"a loud click","example[22]":"I heard the loud click of heels on the stone floor.","collocation[11]":"a faint/soft click","example[23]":"There was only a faint click from the gun's trigger mechanism.","collocation[12]":"a metallic click","example[24]":"She strapped herself in with a metallic click of the belt.","collocation[13]":"a little click","example[25]":"The neon sign made little clicks as it changed colour.","collocation[14]":"a series/succession of clicks","example[26]":"A series of loud clicks came from the car's engine.","collocation[15]":"the click of a latch/door/lock etc","example[27]":"The click of the latch told me Michele was back.","definition[6]":"to press a button on a computer mouse in order to choose something from the screen that you want the computer to do","example[28]":"Click on the link to go to that webpage.","definition[7]":"the action of pressing a button on a computer mouse","example[29]":"You can check your bank account at the click of a mouse."}