{"word[0]":"efficiency","definition[0]":"the quality of doing something well and effectively, without wasting time, money, or energy","opposite[0]":"inefficiency","example[0]":"considerable advancements in energy efficiency","example[1]":"the efficiency of the train service","note[0]":"efficiency of","collocation[0]":"improve/increase efficiency","example[2]":"The company is taking steps to improve efficiency and reduce costs.","example[3]":"Recent efforts by American business to increase efficiency seem to have failed.","collocation[1]":"promote efficiency","example[4]":"A competitive market helps to promote efficiency.","form[0]":"ADJECTIVES/NOUN + efficiency","collocation[2]":"greater/increased efficiency","example[5]":"In a search for greater efficiency, the two departments have merged.","collocation[3]":"maximum efficiency","example[6]":"The boat's design helps it to move with maximum efficiency.","collocation[4]":"fuel efficiency","example[7]":"Better fuel efficiency can be achieved by driving more slowly.","collocation[5]":"energy efficiency","example[8]":"Energy efficiency can play a huge role in reducing pollution.","collocation[6]":"high efficiency","example[9]":"The diesel engine offers high efficiency and low fuel consumption.","collocation[7]":"operating/operational efficiency","example[10]":"The computer can process this information quickly, without any loss of operating efficiency.","form[1]":"efficiency + NOUN","collocation[8]":"efficiency gains","example[11]":"New technology introduced by the company has brought efficiency gains.","collocation[9]":"efficiency savings","example[12]":"Efficiency savings in the industry will inevitably lead to job losses.","collocation[10]":"efficiency measures","example[13]":"The new efficiency measures are designed to improve the health service.","collocation[11]":"standards of efficiency","example[14]":"Their work led to higher standards of efficiency across the industry.","definition[1]":"how well an industrial process, factory, or business works so that it produces as much as possible from the time, money, and resources that are put into it","example[15]":"A successful business constantly strives for greater efficiency.","example[16]":"The increase in profitability is the result of improved efficiency.","definition[2]":"how well and quickly a person or machine works","example[17]":"He was impressed by the speed and efficiency of the Japanese trains.","example[18]":"I had to admire his efficiency.","definition[3]":"when something costs as little as possible, uses as little fuel as possible etc","example[19]":"Auto makers will increase the fuel efficiency of their cars by 20% over the next five years."}