{"word[0]":"install","definition[0]":"to put a piece of equipment somewhere and connect it so that it is ready to be used","example[0]":"They’ve installed the new computer network at last.","example[1]":"Security cameras have been installed in the city centre.","definition[1]":"to add new software to a computer so that it is ready to be used","opposite[0]":"uninstall","example[2]":"We’ve installed new anti-virus software.","definition[2]":"to put someone in an important job or position, especially with a ceremony","example[3]":"Churchill was installed as Chancellor of the university.","example[4]":"The company is installing a new computer system.","example[5]":"How much does it cost to install central heating?","display[0]":"put in","definition[3]":"to install something. Put in  is more common in everyday English than install and is used especially about things that are not very complicated to install","example[6]":"The workmen are coming to put the new windows in today.","example[7]":"They removed the bath and put in a shower instead.","display[1]":"fit","definition[4]":"to put a new part or piece of equipment into or onto something","example[8]":"I had to fit new locks after the burglary.","example[9]":"All vehicles must have seat belts fitted.","display[2]":"lay","definition[5]":"to put cables or a carpet in the correct place on the ground","example[10]":"Work on laying the telephone cables has not yet begun.","example[11]":"Two workmen were laying carpet tiles in the kitchen.","past_tense[0]":"installed","definition[6]":"to put equipment into a place and connect it so that it is ready to use","example[12]":"They help install and operate big computer systems.","definition[7]":"to copy a program onto a computer so that it is ready to use","example[13]":"To protect yourself against hacking, install a firewall program.","definition[8]":"to give someone an important job or position","example[14]":"United Technologies installed senior environmental officers in each division."}