{"word[0]":"virus","definition[0]":"a very small living thing that causes infectious illnesses","example[0]":"children infected with the Aids virus","example[1]":"a virus infection","definition[1]":"a set of instructions secretly put onto a computer or computer program, which can destroy information. When a computer that has a virus makes a connection with another computer, for example by email, the virus can make copies of itself and move to the other computer.","definition[2]":"a program that sends a large number of annoying messages to many people’s mobile phones in an uncontrolled way","form[0]":"ADJECTIVES/NOUN + virus","collocation[0]":"the AIDS/flu/polio etc virus","example[2]":"They are trying to stop the spread of the flu virus.","collocation[1]":"a deadly/killer virus","example[3]":"a killer virus which has already been responsible for the deaths of hundreds of people","collocation[2]":"virulent","example[4]":"Why was this particular strain of the virus so virulent?","collocation[3]":"a virus causes something","example[5]":"The virus causes people to sweat.","collocation[4]":"carry a virus","example[6]":"A nurse at the clinic was found to be carrying the virus.","collocation[5]":"get a virus","example[7]":"He does not know when he contracted the virus.","collocation[6]":"be infected with a virus","example[8]":"Thousands of people may already be infected with the virus.","collocation[7]":"be exposed to a virus","example[9]":"Four workers at the facility, though exposed to the virus, never became ill.","collocation[8]":"transmit/pass on a virus","example[10]":"The rabies virus is transmitted in saliva when one animal bites another.","collocation[9]":"a virus spreads","example[11]":"The virus spread throughout the population.","collocation[10]":"a strain of a virus","example[12]":"Doctors fear that a new strain of the virus will appear.","example[13]":"The fever was caused by a virus infection.","definition[3]":"a set of instructions secretly put onto a computer, that can destroy or change information on the computer","example[14]":"The virus had already destroyed data at several US companies."}