{"word[0]":"criterion","plural[0]":"criteria","definition[0]":"a standard that you use to judge something or make a decision about something","example[0]":"the criteria we use to select candidates","example[1]":"Academic ability is not the sole criterion for admission to the college.","example[2]":"a universal set of criteria for diagnosing patients","example[3]":"To qualify for a grant, students must satisfy certain criteria.","note[0]":"meet/satisfy/fulfil criteria","example[4]":"the criteria for measuring how good schools are","note[1]":"criterion for","collocation[0]":"meet/satisfy/fulfil the criteria","example[5]":"Does your experience meet the criteria for the job?","collocation[1]":"use criteria","example[6]":"What criteria do we use to decide whether one book is better than another?","collocation[2]":"apply criteria","example[7]":"There are certain criteria you should apply when buying a computer.","collocation[3]":"be based on criteria","example[8]":"Normal child development is based upon certain criteria.","collocation[4]":"establish the criteria for something","example[9]":"Management establishes the criteria for each project.","collocation[5]":"the main criterion","example[10]":"You need to decide on your main criteria before you buy a house.","collocation[6]":"the sole criterion","example[11]":"Examination results are still seen as the sole criterion of success in education.","collocation[7]":"a strict criterion","example[12]":"All the cars must meet strict criteria, and are tested by our mechanics.","collocation[8]":"academic/political/environmental etc criteria","example[13]":"The winning product must satisfy a range of environmental criteria.","collocation[9]":"an objective criterion","example[14]":"The label of 'carer' was defined by the objective criterion of someone who spends more than seven hours looking after someone.","collocation[10]":"a set of criteria","example[15]":"Doctors use an established set of criteria for making a diagnosis.","collocation[11]":"a list of criteria","example[16]":"There’s a list of criteria that you must meet in order to pass your driving test."}