{"word[0]":"condition","signpost[0]":"state","definition[0]":"the state that something is in, especially how good or bad its physical state is","example[0]":"The car has been well maintained and is in excellent condition.","note[0]":"in (a) good/poor/excellent/terrible etc condition","example[1]":"The house was in a terrible condition.","example[2]":"The condition of nuclear plants is a matter of great concern.","note[1]":"condition of","signpost[1]":"health/fitness","definition[1]":"how healthy or fit you are","example[3]":"She is being treated at Walton Hospital, where her condition is described as ‘satisfactory’.","example[4]":"‘I’m so out of condition (=unfit), ’ she panted.","example[5]":"an athlete in peak condition","example[6]":"One of the victims was in a critical condition after suffering severe burns.","note[2]":"in (a) critical/stable/satisfactory condition","example[7]":"If you are uncertain about your physical condition, check with your doctor before trying these exercises.","note[3]":"physical/mental condition","example[8]":"I was in no condition to cope with a train journey.","note[4]":"in no condition to do something","example[9]":"Mark can’t possibly drive home in that condition (=when he is so drunk, ill, or upset).","signpost[2]":"agreement/contract","definition[2]":"something that you must agree to in order for something to happen, especially when this is included in a contract","example[10]":"She laid down only one condition: that her name not be revealed.","example[11]":"The bank agreed to extend the loan if certain conditions were met.","example[12]":"A statement of your terms and conditions of employment can be found in the Personnel Handbook.","example[13]":"He was released on bail on condition that he did not go within half a mile of his mother’s address.","example[14]":"The application was approved, subject to certain conditions.","example[15]":"There were strict conditions for letting us use their information.","note[5]":"condition for","signpost[3]":"for something to happen","definition[3]":"something that must exist or happen first, before something else can happen","example[16]":"Our goal is to create the conditions for a lasting peace.","note[6]":"condition for/of","example[17]":"Investment is a necessary condition of economic growth.","definition[4]":"an illness or health problem that affects you permanently or for a very long time","example[18]":"People suffering from this condition should not smoke.","example[19]":"Was he being treated for any medical condition?","example[20]":"She has a serious heart condition.","note[7]":"heart/lung etc condition","signpost[4]":"situation of group","definition[5]":"the situation or state of a particular group of people, especially when they have problems and difficulties","example[21]":"the condition of the poor in our cities","example[22]":"All my paintings are ultimately about the human condition.","heading[0]":"– Meaning 6: something that you must agree to in order for something to happen, especially when this is included in a contract","collocation[0]":"lay down/set/impose conditions","example[23]":"They laid down certain conditions before agreeing to the ceasefire.","collocation[1]":"attach a condition","example[24]":"Only one condition was attached to this agreement.","collocation[2]":"accept/agree to conditions","example[25]":"He refused to accept the conditions set by the rebel leader.","collocation[3]":"meet/satisfy/fulfil a condition","example[26]":"In order to get a state pension, you must satisfy certain conditions.","collocation[4]":"comply with/observe a condition","example[27]":"You must agree to comply with the bank’s conditions before you can get a loan.","collocation[5]":"a strict condition","example[28]":"The US agreed to give financial aid, with a number of strict conditions.","collocation[6]":"on condition that","example[29]":"The police released him on condition that he return the following week.","collocation[7]":"on one condition","example[30]":"You can go, but only on one condition - you have to be back by eleven.","collocation[8]":"on certain conditions","example[31]":"He said we could rent the house from him on certain conditions.","collocation[9]":"terms and conditions","example[32]":"Before you buy online, make sure you read the terms and conditions.","collocation[10]":"be subject to a condition","example[33]":"Permission to build on the land will be subject to certain conditions.","collocation[11]":"a breach of (a) condition","example[34]":"You can sue the company for a breach of condition.","heading[1]":"– Meaning 8: an illness or health problem that affects you permanently or for a very long time","form[0]":"ADJECTIVES/NOUN + condition","collocation[12]":"a medical condition","example[35]":"She has an unusual medical condition.","collocation[13]":"a heart/lung/skin etc condition","example[36]":"I’m taking some medicine for a heart condition.","collocation[14]":"a chronic condition","example[37]":"People with chronic medical conditions need long-term care.","collocation[15]":"a common condition","example[38]":"Depression is a very common condition.","collocation[16]":"a rare condition","example[39]":"He had a rare condition which made all his hair fall out.","collocation[17]":"a genetic/hereditary condition","example[40]":"The disease is a genetic condition that eventually causes blindness.","collocation[18]":"a life-threatening condition","example[41]":"The surgery repaired a potentially life-threatening heart condition.","collocation[19]":"have a condition","example[42]":"The baby has a rare skin condition.","collocation[20]":"suffer from a condition","example[43]":"He has suffered from this condition for many years.","collocation[21]":"working conditions","example[44]":"An office must be able to provide safe working conditions.","collocation[22]":"living conditions","example[45]":"Living conditions in the camp were dreadful.","collocation[23]":"physical conditions","example[46]":"Many teachers have to work in poor physical conditions.","collocation[24]":"poor conditions","example[47]":"The refugees are living in camps in very poor conditions.","collocation[25]":"appalling/dreadful conditions","example[48]":"Some of the animals were being kept in appalling conditions.","collocation[26]":"overcrowded/crowded conditions","example[49]":"Families here are living in dirty, overcrowded conditions.","collocation[27]":"insanitary/unhygienic conditions","example[50]":"Diseases spread quickly among people living in insanitary conditions.","collocation[28]":"cramped conditions","example[51]":"The hostages were held in extremely cramped conditions.","collocation[29]":"inhumane conditions","example[52]":"Live animals were transported under inhumane conditions.","heading[2]":"the condition of something","definition[6]":"how something looks and whether it is damaged, working etc or not","example[53]":"The price of used cars varies according to their condition.","example[54]":"How well your plants will grow depends on the quality and condition of the soil.","example[55]":"The house is in very good condition.","definition[7]":"the condition of something at a particular time – use this especially when something is in bad condition because it has not been well looked after","example[56]":"One of the things people complain of most is the state of the sidewalks.","example[57]":"When I got back home, I was horrified to see what a terrible state the kitchen was in.","heading[3]":"in bad condition","display[0]":"in (a) bad/terrible/awful condition","definition[8]":"if something is in bad condition, it is damaged, dirty, not working properly, etc","example[58]":"The road was in a very bad condition.","example[59]":"The inspectors said the bridge was in a bad state and potentially dangerous.","display[1]":"shabby","definition[9]":"used especially about clothes, furniture, or buildings that are in bad condition because they are old and have been used a lot","example[60]":"His clothes were shabby and ill-fitting.","example[61]":"They lived in a shabby one-room apartment.","display[2]":"tattered","definition[10]":"used about clothes or books that are old and torn","example[62]":"The old man clutched a tattered copy of ‘War and Peace’.","example[63]":"The shirt was now tattered beyond recognition.","display[3]":"dilapidated","definition[11]":"used about a building that is in very bad condition because it has not been looked after","example[64]":"He shared a dilapidated house with five other people.","example[65]":"The hotel looked slightly dilapidated.","display[4]":"run-down","definition[12]":"used about a building or area that is in bad condition, especially because the people who live there do not have enough money to look after it properly","example[66]":"He found lodgings at a run-down motel.","example[67]":"We lived in a run-down part of the city.","display[5]":"derelict","definition[13]":"used about something such as a house or piece of land that is in very bad condition, because it has been empty for a very long time","example[68]":"In the middle of town is a derelict building that used to be the school.","example[69]":"The land behind the factory is stony and derelict.","display[6]":"battered","definition[14]":"used about something that is old and in bad condition because it has been used a lot and treated roughly","example[70]":"There was nothing in his office except for a few battered chairs.","example[71]":"Alex and Lisa used to drive around town in a battered old Fiat Uno.","display[7]":"rickety","definition[15]":"used about furniture and other structures that are in such bad condition that they look as if they would break if you tried to use them","example[72]":"The staircase was old and rickety.","example[73]":"They sat around the card table on rickety old chairs.","example[74]":"a rickety bamboo fence","display[8]":"clapped-out","definition[16]":"used about a vehicle or machine that is so old that it does not work properly","example[75]":"She drives an old beat-up Ford.","example[76]":"He was using a clapped-out old typewriter.","display[9]":"be falling apart","definition[17]":"if something is falling apart, it is gradually breaking into pieces, because it is old or badly made","example[77]":"I need some new shoes. These are falling apart.","display[10]":"be on its last legs","definition[18]":"if a vehicle or machine is on its last legs, it has been used so much and is in such bad condition that you will soon not be able to use it anymore","example[78]":"The washing machine was on its last legs.","display[11]":"have seen better days","definition[19]":"if something has seen better days, it is not in as good condition as it was","example[79]":"The carpets, curtains, and cushions had all seen better days but still looked quite pretty.","example[80]":"She lived in an old Victorian house that had certainly seen better days.","heading[4]":"in good condition","definition[20]":"something that is  in good condition  is not broken and has no marks or other things wrong with it","example[81]":"The car hadn’t been used much, and was in very good condition.","example[82]":"The charity is accepting toys and clothing in good condition.","display[12]":"in good shape","definition[21]":"in good condition – used especially about a person or part of their body, or about something that has had a lot of use or is rather old","example[83]":"Doctor Morrissey told her that her leg was healing well, and was now in very good shape.","example[84]":"To avoid accidents, it’s important to check that all your tools are in good shape before starting.","display[13]":"in perfect/mint condition","definition[22]":"something that is in perfect  or mint condition  looks as good or works as well as when it was new, especially because it has not been used or touched very much","example[85]":"The book is over 100 years old, but it’s still in perfect condition.","example[86]":"The car had been kept in the garage for 20 years and was in mint condition.","display[14]":"as good as new","definition[23]":"something that is as good as new is almost as good as when it was new – used about things that have recently been cleaned or repaired","example[87]":"I’ve just had the bike serviced, and it looks as good as new.","definition[24]":"to make a person or an animal think or behave in a certain way by influencing or training them over a period of time","example[88]":"People are conditioned by society.","example[89]":"Many women are conditioned from birth to be accepting rather than questioning.","note[8]":"condition somebody to do something","definition[25]":"to control or decide the way in which something can happen or exist","synonym[0]":"determine","example[90]":"What I buy is conditioned by the amount I earn.","definition[26]":"to keep hair or skin healthy by putting a special liquid on it","example[91]":"a shampoo that washes and conditions all in one","definition[27]":"something stated in a contract, agreement, or insurance policy that must be done or must be true otherwise the contract, agreement, or policy will be ended or will not remain in force","example[92]":"You should read the conditions of your contract of employment carefully.","example[93]":"Under the conditions of the contract, all work must be completed by June 1st.","example[94]":"The bank agreed to extend the loan if we met certain conditions."}