{"word[0]":"talent","definition[0]":"a natural ability to do something well","example[0]":"He has a lot of talent, and his work is fresh and interesting.","example[1]":"a persuasive speaker with a natural talent for leadership","example[2]":"His latest book reveals hidden talents.","example[3]":"Sadly, she inherited none of her father’s musical talent.","example[4]":"Your brother is a man of many talents.","example[5]":"There’s a wealth of talent in English football.","example[6]":"She showed a talent for acting at an early age.","note[0]":"talent for","definition[1]":"a person or people with a natural ability or skill","example[7]":"Britain’s footballing talent","definition[2]":"sexually attractive people","collocation[0]":"have talent","example[8]":"Greg has a real talent for drawing.","collocation[1]":"show talent","example[9]":"Zach was the only one who showed any natural talent.","collocation[2]":"use your talents","example[10]":"They have been using their artistic talents to brighten up the school.","collocation[3]":"develop your talent","example[11]":"Education allows people to develop their talents to the full.","collocation[4]":"waste your talents","example[12]":"They felt their son was wasting his talents and his time.","collocation[5]":"somebody’s talents flourish","example[13]":"The school created an atmosphere in which young talent could flourish.","collocation[6]":"great/considerable/exceptional talent","example[14]":"He had a great talent for making money.","collocation[7]":"real talent","example[15]":"She has real talent and with a little help she could go far.","collocation[8]":"natural talent","example[16]":"Ronaldo is a player of immense natural talent.","collocation[9]":"raw talent","example[17]":"He’s got lots of raw talent but he needs a good coach.","collocation[10]":"a hidden talent","example[18]":"Have a go – you may discover a hidden talent!","collocation[11]":"musical/artistic/creative etc talent","example[19]":"It was at school that Brian’s musical talents were spotted.","form[0]":"talent + NOUN","collocation[12]":"a talent contest/show/competition","example[20]":"Don’t assume winning a talent contest is a passport to success.","collocation[13]":"a wealth of talent","example[21]":"There’s a wealth of musical talent in New York and other large American cities.","collocation[14]":"a pool of talent","example[22]":"Employers can draw on an enormous pool of talent in this area."}