{"word[0]":"stain","definition[0]":"to accidentally make a mark on something, especially one that cannot be removed, or to be marked in this way","example[0]":"Be careful you don’t stain the carpet.","example[1]":"This tablecloth stains very easily.","example[2]":"Her fingers were stained yellow from years of smoking.","example[3]":"a cowboy hat stained with dust and sweat","note[0]":"stain with","definition[1]":"to change the colour of something, especially something made of wood, by using a special liquid","example[4]":"We’ve decided to stain the shelves blue.","definition[2]":"a mark that is difficult to remove, especially one made by a liquid such as blood, coffee, or ink","note[1]":"stubborn stains (=ones that are very difficult to remove)","example[5]":"White vinegar is great for removing stains.","note[2]":"remove/get rid of a stain","example[6]":"How do you get wine stains out of a tablecloth?","note[3]":"wine/coffee/blood etc stain","example[7]":"There was a dark red stain on the carpet.","note[4]":"stain on","definition[3]":"a special liquid that you use to change the colour of something, especially wood","form[0]":"ADJECTIVES/NOUN + stain","collocation[0]":"a wine/coffee/blood etc stain","example[8]":"How can I get coffee stains out of a cotton tablecloth?","collocation[1]":"a red/brown/dark etc stain","example[9]":"There was a brown stain on the bedroom ceiling.","collocation[2]":"a stubborn stain","example[10]":"Lighter fuel can be used to remove more stubborn stains.","collocation[3]":"remove a stain","example[11]":"He was trying to remove a stain from his jacket.","example[12]":"Fruit juice stains can be hard to shift.","collocation[4]":"get a stain out","example[13]":"You’ll never get that stain out.","collocation[5]":"get a stain on something","example[14]":"She didn’t want to get a stain on her new dress.","collocation[6]":"something leaves a stain","example[15]":"She wiped the soup off her blouse, but it left a stain.","collocation[7]":"a stain spreads","example[16]":"A dark stain spread over the grey carpet.","form[1]":"stain + NOUN","collocation[8]":"stain remover","collocation[9]":"stain removal","example[17]":"Here are a few quick tips for stain removal."}