{"word[0]":"next","definition[0]":"the next event, day, time etc is the one that happens after the present one, or the previous one","example[0]":"I just missed my flight to Chicago. When’s the next one?","example[1]":"We’ll look at the proposals at the next meeting.","example[2]":"Over the next couple of months, try to relax more and get more exercise.","example[3]":"We’re hoping to open the factory sometime next year.","note[0]":"next week/year/Monday etc","example[4]":"She called me and we arranged to meet the next day.","note[1]":"the next day/week etc","example[5]":"Next time I go skiing, I’ll wear warmer clothes.","note[2]":"(the) next time","definition[1]":"the next house, room, place etc is the one that is nearest to where you are now","example[6]":"Turn left at the next corner.","example[7]":"We could hear them arguing in the next room.","definition[2]":"the next person or thing in a list, series etc comes after the one that you are dealing with now","example[8]":"Read the next two chapters before Friday.","example[9]":"Do they have the next size up (=a slightly bigger size)?","definition[3]":"happening or coming immediately after another one","example[10]":"When does the next train to London leave?","example[11]":"I’ll see you next Saturday.","display[0]":"following","definition[4]":"happening or coming immediately after something – used about periods of time, or parts of a piece of writing","example[12]":"We met the following day.","example[13]":"The following weeks passed quickly.","example[14]":"the following pages of the book","display[1]":"subsequent","definition[5]":"happening or coming at some time after something else","example[15]":"the subsequent success of the film","example[16]":"This will be explained in more detail in subsequent chapters.","example[17]":"This figure is expected to rise steeply in subsequent years.","display[2]":"succeeding","definition[6]":"coming after someone or something else – used about a series of groups of people, periods of time, or parts of a book","example[18]":"succeeding generations","example[19]":"Succeeding governments have made the same mistake.","example[20]":"During the succeeding weeks he wrote several more letters.","display[3]":"coming","definition[7]":"happening soon","example[21]":"The information will be mailed to members during the coming weeks.","example[22]":"The villagers are storing up wood for the coming winter.","definition[8]":"immediately afterwards","example[23]":"With John here, you never know what will happen next.","example[24]":"Next, put it in the oven for 20 minutes.","definition[9]":"the next time","example[25]":"When I next saw her she completely ignored me.","definition[10]":"the person or thing in a list, series etc that comes after the person or thing you are dealing with now","example[26]":"What’s next on the shopping list?","example[27]":"Who will be the next to go?","note[3]":"the next to do something","definition[11]":"a British shop which sells fashionable and good-quality clothes for adults and children. There are Next shops in many UK towns, but the company also sells some of its products by means of a catalogue, the Next Directory. Customers can order goods from the catalogue by telephone."}