{"word[0]":"invent","definition[0]":"to make, design, or think of a new type of thing","example[0]":"Alexander Graham Bell invented the telephone in 1876.","definition[1]":"to think of an idea, story etc that is not true, usually in order to deceive people","example[1]":"They invented a very convincing alibi.","definition[2]":"to think of an idea for a new product, machine etc, and design it or make it","example[2]":"The telephone was invented by Alexander Graham Bell.","example[3]":"Who invented the Internet?","display[0]":"create","definition[3]":"to make or design something new and original","example[4]":"We decided to create the software ourselves.","example[5]":"For her latest book, she has created a whole new group of characters.","display[1]":"think of something/think up something","definition[4]":"to produce a new idea, plan, method, excuse etc by thinking","example[6]":"I’ve thought of an idea.","example[7]":"They’re always trying to think up new ways to improve efficiency.","display[2]":"come up with something","definition[5]":"to produce a new idea, a way of dealing with something etc, especially a good one","example[8]":"How did you come up with that idea?","example[9]":"Ellis came up with the solution to the problem immediately.","display[3]":"make something up","definition[6]":"to invent a story, song, game, excuse etc","example[10]":"My mother used to make up bedtime stories for us.","example[11]":"I didn’t want to go to the class, so I decided to make up an excuse.","display[4]":"dream something up","definition[7]":"to think of an idea or plan, especially one that seems unusual or even crazy","example[12]":"It can’t be easy dreaming up new advertisements all the time.","example[13]":"I wonder who dreamt up that idea!","display[5]":"devise","definition[8]":"to invent a way of doing something, especially one that is clever or complicated","example[14]":"This system was devised as a way of measuring students’ progress.","display[6]":"conceive","definition[9]":"to think of a new idea, plan etc and develop it in your mind","example[15]":"The project was originally conceived by a Dutch businessman two years ago.","definition[10]":"to make, design or produce something new or a new way of doing something","example[16]":"Percy Spencer invented the microwave oven.","example[17]":"Mr. Monaghan virtually invented the modern pizza delivery business when he founded Domino’s.","definition[11]":"to tell people something that is not true in order to deceive them","example[18]":"He told investors the firm had monthly returns of between 10% and 25% but those returns were invented.","example[19]":"Perhaps the most popular fraud is to inflate or invent business expenses."}