{"word[0]":"defect","definition[0]":"a fault or a lack of something that means that something or someone is not perfect","example[0]":"All the cars are tested for defects before they leave the factory.","example[1]":"a genetic defect","form[0]":"ADJECTIVES/NOUN + defect","collocation[0]":"a serious defect","example[2]":"The movie has a few serious defects.","collocation[1]":"a major defect","example[3]":"They have found a major defect in the program.","collocation[2]":"a slight/minor defect","example[4]":"There are one or two minor defects on the car’s paintwork.","collocation[3]":"a physical defect","example[5]":"Doctors examined the baby and could find no physical defects.","collocation[4]":"a structural defect","example[6]":"Older buildings are bound to have some structural defects.","collocation[5]":"a genetic/inherited defect","example[7]":"The condition is caused by a genetic defect.","collocation[6]":"a birth defect","example[8]":"About 11% of children have birth defects.","collocation[7]":"a heart defect","example[9]":"Laura was born with a rare heart defect.","collocation[8]":"a speech defect","example[10]":"He had a speech defect which made it quite difficult to understand him.","collocation[9]":"a character defect","example[11]":"Laziness was just one of his character defects.","collocation[10]":"have a defect","example[12]":"The old system had some serious defects.","collocation[11]":"correct a defect","example[13]":"She had surgery to correct a defect in her right eye.","definition[1]":"to leave your own country or group in order to go to or join an opposing one","example[14]":"a Russian actor who defected to the West","note[0]":"defect to/from","definition[2]":"a fault in something that means it is not perfect","example[15]":"They recalled the vehicles because of brake defects.","example[16]":"an effort to improve customer satisfaction and reduce product defects","example[17]":"a possible safety defect with the plane’s autopilot","definition[3]":"if the buyer of one product defects to another product, they stop buying the first one and start buying the second one","example[18]":"They tried to retain customers who might defect to a credit card with a lower interest rate.","definition[4]":"if an employee working for a particular company defects, they leave it and start working for another","example[19]":"Although several senior employees have defected, it’s not true that there’s any kind of mass walkout."}