{"word[0]":"task","definition[0]":"a piece of work that must be done, especially one that is difficult or unpleasant or that must be done regularly","example[0]":"The task of the union representative is to fight on behalf of the members.","example[1]":"Sara had the task of preparing the agenda for meetings.","example[2]":"I was given the task of building a fire.","example[3]":"the skills required to carry out these tasks","example[4]":"He soon realized the scale of the task he had undertaken.","example[5]":"Our first task is to gather information.","example[6]":"Monkeys can be taught to do simple tasks.","example[7]":"They have the unenviable task of supervising the most dangerous prison in the country.","example[8]":"Volunteers had the thankless task of distributing campaign leaflets.","example[9]":"Trying to bring up a small daughter on your own is no easy task.","explanation[0]":"In everyday English, people usually say job rather than task:","example[10]":"I was given the job of building the fire.","collocation[0]":"have the task of doing something","example[11]":"He had the task of judging the competition.","collocation[1]":"carry out/perform/do a task","example[12]":"I don't think we have enough resources to carry out this task.","collocation[2]":"set/give somebody a task","example[13]":"I was given the task of writing the chairman's speech.","collocation[3]":"take on/undertake a task","example[14]":"No-one else is willing to take on the task.","collocation[4]":"assign a task","example[15]":"People were assigned different tasks.","collocation[5]":"a task faces somebody","example[16]":"Given the nature of the task facing us, three days might not be enough.","collocation[6]":"impossible","example[17]":"She may argue that the task is impossible.","example[18]":"The children help with simple tasks like carrying in water or logs for the fire.","example[19]":"The task of selecting just five candidates is difficult.","collocation[7]":"somebody's first/main task","example[20]":"Their first task was to rebuild the wall.","collocation[8]":"a thankless task","example[21]":"Driving a bus in London must be a pretty thankless task.","collocation[9]":"a formidable/daunting task","example[22]":"Achieving these targets will be a formidable task.","collocation[10]":"an unenviable task","example[23]":"He has the unenviable task of telling hungry people that there is no food.","collocation[11]":"an arduous task","example[24]":"We began the arduous task of carrying the furniture to the top floor.","collocation[12]":"something is not an easy task","example[25]":"Recruiting experienced people is no easy task nowadays.","definition[1]":"to give someone the responsibility for doing something","example[26]":"We were tasked with completing the job by the end of 2006.","note[0]":"be tasked with (doing) something","explanation[1]":"Task is usually passive","definition[2]":"a piece of work that must be done, especially one that must be done regularly","example[27]":"Scheduling is a key task for most managers.","example[28]":"day-to-day management tasks","example[29]":"computers that can do dozens of tasks at the same time","definition[3]":"a piece of work that is difficult but very important","example[30]":"the Bundesbank’s task of keeping the currency stable","example[31]":"He faced the daunting task (=one that is difficult and slightly frightening) of leading the largest experiment ever in employee ownership.","definition[4]":"to tell someone that you strongly disapprove of something they have done","example[32]":"The tobacco companies have been taken to task for exposing their cigarette brands to kids."}