{"word[0]":"haul","definition[0]":"to pull something heavy with a continuous steady movement","example[0]":"the steam locomotive which hauled the train","example[1]":"I hauled the door shut behind me.","example[2]":"She hauled her backpack onto her back.","note[0]":"haul something off/onto/out of etc something","definition[1]":"a large amount of illegal or stolen goods","example[3]":"The gang escaped with a haul worth hundreds of pounds.","example[4]":"A haul of stolen cars has been seized by police officers.","note[1]":"haul of","definition[2]":"the amount of fish caught when fishing with a net","definition[3]":"if a train or TRUCK hauls goods, it takes them from one place to another","example[5]":"The freight train hauled the load of 240 tons with ease.","example[6]":"Union Pacific hauls garbage from Seattle to a landfill in eastern Oregon.","definition[4]":"to officially make someone go to a senior manager, committee, or court to be judged on something they have done, especially something bad","example[7]":"Officials can be hauled before Congressional committees and asked to justify their policies.","note[2]":"haul somebody before/in front of somebody/something","example[8]":"Bar staff who serve drunk drivers may get hauled up in front of the local judge if those people are later involved in accidents.","definition[5]":"to speak to someone angrily and severely because they have done something wrong","example[9]":"He might be hauled over the coals and forced to resign if his manager did not agree with his actions.","definition[6]":"the amount of fish caught in one net or in one period of time","example[10]":"Demand for fishing boats depends on estimated sizes of fish hauls.","definition[7]":"a large amount of stolen or illegal goods that has been found by the police or CUSTOMS","example[11]":"A haul of stolen cars has been seized by police.","example[12]":"a £1 million drugs haul","definition[8]":"connected with long or short journeys by plane","example[13]":"KLM earns most of its revenue on long-haul flights.","example[14]":"a popular short-haul destination"}