{"word[0]":"deposit","definition[0]":"a part of the cost of something you are buying that you pay some time before you pay the rest of it","example[0]":"We put down a deposit on a house.","note[0]":"put down a deposit (on something)","example[1]":"A deposit of 10% is required.","note[1]":"deposit of","definition[1]":"money that you pay when you rent something such as an apartment or car, which will be given back if you do not damage it","example[2]":"We ask for one month’s rent in advance, plus a deposit of $500.","definition[2]":"an amount of money that is paid into a bank account","opposite[0]":"withdrawal","example[3]":"I’d like to make a deposit  (=pay some money) into my savings account.","note[2]":"deposit into","definition[3]":"a layer of a mineral, metal etc that is left in soil or rocks through a natural process","example[4]":"rich deposits of gold in the hills","definition[4]":"an amount or layer of a substance that gradually develops in a particular place","example[5]":"fatty deposits on the heart","definition[5]":"an amount of money paid by a candidate in a political election in Britain, that is returned to them if they get enough votes","note[3]":"lose your deposit (=not get enough votes)","heading[0]":"– Meaning 2: money that you pay when you rent something such as an apartment or car, which will be given back if you do not damage it","collocation[0]":"pay a deposit","example[6]":"Car hire firms may ask you to pay a deposit in advance.","collocation[1]":"get your deposit back","example[7]":"You'll get your deposit back when all the bills have been paid.","collocation[2]":"lose your deposit","example[8]":"If there is any damage to the apartment, you may lose your deposit.","collocation[3]":"give somebody their deposit back","example[9]":"When I left, the landlord refused to give me my deposit back.","collocation[4]":"return somebody's deposit","example[10]":"Your deposit will be returned to you when you leave the flat.","collocation[5]":"refundable/returnable","example[11]":"We ask for a refundable deposit of 500 Euros.","definition[6]":"to put something down in a particular place","example[12]":"The female deposits her eggs directly into the water.","definition[7]":"to leave a layer of a substance on the surface of something, especially gradually","example[13]":"As the river slows down, it deposits a layer of soil.","definition[8]":"to put money or something valuable in a bank or other place where it will be safe","example[14]":"You are advised to deposit your valuables in the hotel safe.","note[4]":"deposit something in something","example[15]":"The dollars are then deposited with banks outside the USA.","note[5]":"deposit something with somebody/something","explanation[0]":"In everyday English, people usually say they put in or pay in money, rather than deposit money:","example[16]":"I paid/put $100 into his account.","example[17]":"You should put your valuables in the hotel safe.","definition[9]":"an amount of money paid into a bank account or held in a bank account, especially when it is earning interest","example[18]":"Residents have some $4 billion in deposits in local financial institutions.","example[19]":"The Hong Kong bank had more than US$1 billion on deposit when it was closed.","definition[10]":"the total amount of money held in bank accounts etc within an economy","definition[11]":"a bank account in which money can be held and will earn interest","definition[12]":"a small first payment that you make for a house, car, holiday etc","example[20]":"You have to put down a deposit of 10% of the total cost.","definition[13]":"an amount of money that you pay when you rent something which will be given back to you if you do not damage the thing you are renting","example[21]":"You will have to pay one month’s rent in advance, plus a deposit of $500.","definition[14]":"to leave money or other valuable things at a bank","example[22]":"He advised her to sell the shop and deposit the money in the bank.","example[23]":"The dollars were deposited with banks outside the USA."}