{"word[0]":"could","signpost[0]":"past ability","definition[0]":"used as the past tense of ‘can’ to say what someone was able to do or was allowed to do in the past","example[0]":"By the time she was eight, she could read Greek and Latin.","example[1]":"In those days you could buy a box of cigars for a dollar.","example[2]":"Could you hear what I was saying?","example[3]":"I couldn’t get tickets after all, they were sold out.","example[4]":"I knew I couldn’t afford the rent.","example[5]":"The teacher said we could all go home.","definition[1]":"used to say that something is possible or might happen","example[6]":"Most accidents in the home could be prevented.","example[7]":"It could be weeks before we get a reply.","example[8]":"If you’re not careful, you could get into even worse trouble.","example[9]":"A faulty connection could easily  (=would be likely to) cause a fire.","definition[2]":"used to say that something was a possibility in the past, but did not actually happen","example[10]":"Somebody could have been killed.","example[11]":"I could have warned you if I had known where you were.","example[12]":"He could have escaped, but he chose to fight.","signpost[1]":"emphasizing your feelings","definition[3]":"used to emphasize how happy, angry etc you are by saying how you want to express your feelings","example[13]":"He irritates me so much I could scream.","example[14]":"I was so angry I could have killed her.","example[15]":"I was so relieved I could have kissed them all.","signpost[2]":"requesting","definition[4]":"used to make a polite request","example[16]":"Could you help me with these boxes?","example[17]":"Could I have a drink of water, please?","example[18]":"How about Sam? Could he come along too?","example[19]":"I wonder if I could just ask you to sign this.","signpost[3]":"suggesting","definition[5]":"used to suggest doing something","example[20]":"You could ask your doctor for a check-up.","example[21]":"You could always try phoning her at the office.","example[22]":"Maybe we could get together sometime next week?","example[23]":"Couldn’t you get one of your friends to help you?","signpost[4]":"annoyance","definition[6]":"used to show that you are annoyed about someone’s behaviour","example[24]":"You could have told me you were going to be late  (=you should have told me but you did not)!","example[25]":"You could at least say that you’re sorry.","example[26]":"How could you be so stupid!","heading[0]":"GRAMMAR: Patterns with could","explanation[0]":"You use could  with the base form of the verb  (=the infinitive without ‘to’)","example[27]":" The teacher said we could go home","example[28]":"He could be in his office","explanation[1]":"You say Could I?  when asking for permission","example[29]":"Could I use your phone?","explanation[2]":"You say that something could have happened","example[30]":"The team could have won","example[31]":"They could already have gone home","explanation[3]":"You use couldn’t or could not in negative sentences","example[32]":"We couldn’t see anything","example[33]":"That could not be true"}