{"word[0]":"choice","definition[0]":"if you have a choice, you can choose between several things","example[0]":"He has to make some important choices.","example[1]":"They gave us no choice in the matter.","example[2]":"Voters have a choice between three main political parties.","note[0]":"choice between","example[3]":"You have a choice of hotel or self-catering accommodation.","note[1]":"choice of","definition[1]":"the range of people or things that you can choose from","example[4]":"It was a small shop and there wasn’t much choice.","example[5]":"Consumers these days are spoilt for choice  (=have a lot of things to choose from).","note[2]":"spoilt for choice","example[6]":"There is a choice of four different colours.","example[7]":"We offer a wide choice of wines and beers.","definition[2]":"the person or thing that someone chooses","example[8]":"I think London was a good choice as a venue.","example[9]":"My first choice of college was Stanford.","note[3]":"somebody’s first/second choice","example[10]":"I don’t really like her choice of jewellery.","collocation[0]":"have a choice","example[11]":"Students have a choice between German and Spanish.","collocation[1]":"make a choice","example[12]":"One of our course advisors can help you to make your choice.","collocation[2]":"give somebody a choice","example[13]":"Her doctor gave her a choice: take medicine or lose weight.","collocation[3]":"be faced with a choice","example[14]":"He was faced with a difficult choice.","collocation[4]":"have no choice (but to do something)","example[15]":"The men had no choice but to obey.","collocation[5]":"leave somebody with no choice","example[16]":"I was left with no choice but to resign.","collocation[6]":"exercise your choice","example[17]":"Everyone should have the right to exercise choice in matters of relationships.","form[0]":"ADJECTIVES/NOUN + choice","collocation[7]":"the right/wrong choice","example[18]":"I think you’ve made the right choice.","collocation[8]":"a difficult choice","example[19]":"It was a very difficult choice for me.","collocation[9]":"a stark choice","example[20]":"We faced a stark choice: steal or starve.","collocation[10]":"(a) free choice","example[21]":"Students have an entirely free choice of what to study at university.","collocation[11]":"an informed choice","example[22]":"The patient should have enough information to make an informed choice.","collocation[12]":"consumer choice","example[23]":"I believe in free trade and consumer choice.","collocation[13]":"parental choice","example[24]":"The aim is to extend parental choice in education.","collocation[14]":"freedom of choice","example[25]":"Patients should have more freedom of choice.","collocation[15]":"given the choice","example[26]":"Given the choice, I probably wouldn’t work.","collocation[16]":"have no choice in the matter","example[27]":"The village people had no choice in the matter.","example[28]":"The school seems OK, but there isn’t a great choice of courses.","example[29]":"With her high grades and athletic skill, Celeste had her choice of colleges.","example[30]":"Spooner says he had no choice but to file for bankruptcy.","example[31]":"There is a wide choice of hotels and hostels in the town.","display[0]":"option","definition[3]":"one of the things that you can choose to do in a particular situation","example[32]":"He basically has two options: he can have the surgery, or he can give up playing football.","example[33]":"I haven’t signed any contracts yet – I want to keep my options open.","display[1]":"alternative","definition[4]":"one of two or more ways of doing something","example[34]":"Did you consider other alternatives before you moved in with Lucy?","example[35]":"There is no practical alternative to our current policy.","example[36]":"He says he doesn’t want to see a doctor, but I’m afraid he has no alternative.","definition[5]":"something or someone that has been chosen","example[37]":"Maria was very pleased with her choice.","example[38]":"Greece was our first choice for a vacation, but all the flights were full.","example[39]":"I don’t like his choice of friends.","display[2]":"selection","definition[6]":"a small group of the best things that have been chosen from a larger group","example[40]":"She showed me a selection of her drawings.","example[41]":"a selection of songs from ‘West Side Story’","definition[7]":"choice food is of very good quality","example[42]":"choice steak","example[43]":"We select only the choicest apples for our pies."}