{"word[0]":"price","definition[0]":"the amount of money you have to pay for something","example[0]":"Supermarkets often offer you two products for the price of one.","example[1]":"The price of fuel keeps going up.","note[0]":"price of","example[2]":"We agreed a price for the bike.","note[1]":"price for","definition[1]":"something unpleasant that you must suffer in order to be successful, free etc, or that you suffer because of a mistake or bad action","example[3]":"The awful boat journey was a small price to pay for freedom.","example[4]":"They may pay a high price for their few years of glory.","example[5]":"The country will pay a heavy price for the government’s failure.","example[6]":"She was finally made senior executive, but at what price!","example[7]":"He’s never at home, but that’s the price of success.","heading[0]":"– Meaning 1: the amount of money you have to pay for something","form[0]":"ADJECTIVES/NOUN + price","example[8]":"House prices in the UK are very high.","example[9]":"With such low prices, there are lots of eager buyers.","collocation[0]":"reasonable","example[10]":"The price was reasonable for such good food.","example[11]":"I am sure we can agree on a fair price.","collocation[1]":"astronomical","example[12]":"Many fans paid astronomical prices for their tickets.","collocation[2]":"exorbitant/extortionate","example[13]":"£10,000 seemed an exorbitant price for the rug.","collocation[3]":"inflated","example[14]":"People seem willing to pay inflated prices for houses in central London.","collocation[4]":"house/food/oil etc prices","example[15]":"A poor harvest led to higher food prices.","collocation[5]":"a good price","example[16]":"Did you get a good price for your car?","collocation[6]":"a bargain price","example[17]":"We sell quality cars at bargain prices.","example[18]":"The house is available at a knockdown price of $195,000.","collocation[7]":"the market price","example[19]":"We think the stock’s current market price is too high.","collocation[8]":"the asking price","example[20]":"The property is worth more than the asking price.","collocation[9]":"the purchase price","example[21]":"You can obtain a loan for up to 90% of the purchase price.","collocation[10]":"the retail price","example[22]":"Tax is 40% of the retail price of a typical bottle of wine.","collocation[11]":"the wholesale price","example[23]":"Wholesale coffee prices have fallen.","collocation[12]":"a price goes up/rises/increases","example[24]":"When supplies go down, prices tend to go up.","collocation[13]":"a price goes down/falls/decreases","example[25]":"In real terms, the price of clothes has fallen over the last ten years.","collocation[14]":"a price shoots up/soars/rockets","example[26]":"The price of oil soared in the 1970s.","collocation[15]":"prices fluctuate","example[27]":"Gas prices have continued to fluctuate in recent months.","collocation[16]":"prices start from £200/$300 etc","example[28]":"Ticket prices start from £39.00.","collocation[17]":"prices range from £30 to £65 etc","example[29]":"Over 1,000 paintings will be shown with prices ranging from £50 to £5,000.","collocation[18]":"put up/increase/raise a price","example[30]":"Manufacturers have had to put their prices up.","collocation[19]":"cut/lower/reduce a price","example[31]":"The company recently cut the price of its best-selling car.","collocation[20]":"slash a price","example[32]":"Many carpet stores have slashed prices to bring in customers.","collocation[21]":"fix a price","example[33]":"Publishers are not permitted to fix prices with one another.","collocation[22]":"agree on a price","example[34]":"Now all we need to do is agree on a price.","collocation[23]":"pay a good/low etc price","example[35]":"I paid a very reasonable price for my guitar.","collocation[24]":"get a good/reasonable etc price","example[36]":"Farmers now get a decent price for their crop.","collocation[25]":"fetch a good/high etc price","example[37]":"I’m sure the painting would fetch a good price in London.","form[1]":"price + NOUN","collocation[26]":"a price rise/increase","example[38]":"Consumers are facing more fuel price rises.","collocation[27]":"a price cut/reduction","example[39]":"Holiday sales were down, even with drastic price cuts.","collocation[28]":"a price freeze","example[40]":"A price freeze on nine basic goods was announced on June 14.","collocation[29]":"a fall/drop in prices","example[41]":"Poor demand led to a sharp drop in prices.","collocation[30]":"a rise in prices","example[42]":"The sharp rise in wholesale food prices will have to be passed onto customers.","collocation[31]":"in/outside somebody’s price range","example[43]":"Unfortunately, there was nothing in our price range.","heading[1]":"– Meaning 2: something unpleasant that you must suffer in order to be successful, free etc, or that you suffer because of a mistake or bad action","collocation[32]":"pay a price","example[44]":"We paid a heavy price for our mistakes this season.","collocation[33]":"come at a price","example[45]":"She won fame, but it came at a high price.","collocation[34]":"exact a price","example[46]":"The success of the nation’s businesses has exacted a dreadful price from the people.","collocation[35]":"a high price","example[47]":"Smokers often pay a high price in terms of their health.","collocation[36]":"a heavy price","example[48]":"Any country breaking international law will be made to pay a heavy price.","collocation[37]":"a terrible price","example[49]":"The sport can exact a terrible price from its participants.","collocation[38]":"something is a small price to pay","example[50]":"Changing his job would be a small price to pay to keep his marriage intact.","definition[2]":"the amount of money that you have to pay for something","example[51]":"The prices in that shop are rather high.","example[52]":"You can have a two-course meal for a special price of £9.95.","definition[3]":"the amount of money that you have to pay for services, activities, or things you need such as food and electricity","example[53]":"The cost of the two-day course is $1,295.","example[54]":"Many banks are raising their borrowing costs.","example[55]":"a sudden increase in energy costs","display[0]":"value","definition[4]":"the amount of money that something is worth and that people are willing to pay if it is sold","example[56]":"The value of the painting was estimated at £500,000.","example[57]":"Fine wines may increase in value.","example[58]":"The shares have gone down in value.","definition[5]":"to decide the price of something that is for sale","example[59]":"a reasonably priced apartment","example[60]":"Tickets are priced at £75 each.","note[2]":"be priced at something","explanation[0]":"Price is usually passive in this meaning","definition[6]":"to put the price on goods to show how much they cost","definition[7]":"to compare the prices of things","example[61]":"We spent Saturday morning pricing microwaves.","collocation[39]":"highly priced","example[62]":"The clothes shops all seemed to be full of highly priced designer clothes.","collocation[40]":"reasonably priced","example[63]":"The food was good and reasonably priced.","collocation[41]":"moderately priced","example[64]":"On the outskirts of many towns, you will find moderately priced motels.","collocation[42]":"competitively/keenly priced","example[65]":"Lower costs meant that Japanese exports remained competitively priced.","collocation[43]":"modestly priced","example[66]":"There are some very modestly priced artificial plants to be had.","collocation[44]":"attractively priced","example[67]":"These figurines are attractively priced at £32.","definition[8]":"the amount of money for which something is bought, sold, or offered","example[68]":"They agreed on a price of $10,000 for the car.","example[69]":"Some mines may close because of gold’s current low price.","example[70]":"The bonds continued to fall in price.","example[71]":"Buy one shirt and get a second at half price.","example[72]":"People today are attracted to discount stores because they don’t want to pay full price.","definition[9]":"used to say that you can obtain something, but only if you pay a lot of money for it, or if the cost is very high in other unpleasant ways","example[73]":"The track was designed to allow higher train speeds at a price, and that price was safety.","definition[10]":"if you are prepared to do something at any price, you are determined to do it, even if it is very difficult and the cost is very high","example[74]":"The government is prepared to hang onto power at any price.","example[75]":"Sorry, that painting’s not for sale, not at any price  (=no price could be high enough).","definition[11]":"to say how much something costs, or to give something a financial value","example[76]":"The government hasn’t put a price on the stake it wants to sell.","definition[12]":"to fix the price of something that is for sale","example[77]":"If the stock is priced at about C$24 a share, it probably will be well received by the market.","note[3]":"be priced at","example[78]":"She priced her T-shirts at $22 only to find a competitor moving faster at $20.","example[79]":"Today’s moderately priced clothes look almost as good as high priced designer clothes.","definition[13]":"to fix the price of bonds, shares etc","example[80]":"The notes were priced to yield 6.88%.","example[81]":"Many commercial loans are priced off  (=in relation to) Fed funds, which currently are around 4%.","note[4]":"price off","example[82]":"We spent the morning pricing microwaves.","definition[14]":"to put the price on goods, showing how much they cost","definition[15]":"if you have been priced out of the market, you can no longer afford to buy something because prices have become too high","example[83]":"Younger people with jobs need homes but they have been priced out of the housing market.","definition[16]":"to demand too much money for the goods or services you are offering, so that people are no longer willing to buy them","example[84]":"The hotels have priced themselves out of the market with typical cost at one chain of $100 to $120 a night compared with our average room cost of $50."}