{"word[0]":"expense","definition[0]":"the amount of money that you spend on something","example[0]":"He borrowed £150,000 and used the money for legal expenses.","example[1]":"Conference rooms were equipped at great expense.","heading[0]":"– Meaning 1: the amount of money that you spend on something","form[0]":"ADJECTIVES/NOUN + expense","collocation[0]":"the extra/additional expense","example[2]":"Is it worth the extra expense to get a room with a sea view?","collocation[1]":"an unnecessary expense","example[3]":"Paying extra for leather seats seemed like an unnecessary expense.","collocation[2]":"living expenses","example[4]":"She receives £80 a week, from which she must pay for all her living expenses.","collocation[3]":"operating expenses","example[5]":"We must reduce our operating expenses.","collocation[4]":"legal/medical expenses","example[6]":"We had to get a loan to pay for my husband’s medical expenses.","example[7]":"The tenant can incur considerable legal expenses.","collocation[5]":"household expenses","example[8]":"Unfortunately, household expenses don’t go away just because you’re in hospital or out of work.","collocation[6]":"funeral expenses","example[9]":"She had a small insurance policy to cover the funeral expenses.","collocation[7]":"at great/huge/considerable/vast expense","example[10]":"The tiles were imported at great expense from Italy.","example[11]":"Recently, and at vast expense to the taxpayer, the bridge was rebuilt.","collocation[8]":"at your own expense","example[12]":"He had copies of the book printed at his own expense.","collocation[9]":"at (the) public expense","example[13]":"The bridge was built at public expense.","collocation[10]":"go to the expense of doing something","example[14]":"The council must now decide whether to go to the expense of appealing through the courts.","collocation[11]":"spare no expense (in doing something)","example[15]":"Her parents spared no expense in arranging the wedding.","example[16]":"Everything has been provided tonight – no expense has been spared!","collocation[12]":"incur an expense","example[17]":"Potential buyers incur the expense of a survey and legal fees.","form[1]":"NOUN + expenses","collocation[13]":"travel/travelling expenses","example[18]":"The company will pay the travelling expenses involved in getting to and from the meeting.","collocation[14]":"entertainment/business expenses","example[19]":"The president receives an unspecified allowance for business and entertainment expenses.","collocation[15]":"relocation/moving expenses","example[20]":"Successful candidates will receive a comprehensive benefits package that includes relocation expenses if needed.","collocation[16]":"pay somebody’s expenses","example[21]":"They agreed  to pay my travel expenses and initial accommodation costs.","collocation[17]":"claim expenses","example[22]":"If you have to stay overnight, you will be able to claim any expenses back.","collocation[18]":"reimburse somebody’s expenses","example[23]":"Your expenses will usually be reimbursed within one month of receiving the claim.","definition[1]":"an amount of money that a business or organization has to spend on something","example[24]":"Most advertisers look upon advertising as an expense and not an investment, which is a mistake.","example[25]":"The company’s cost-cutting program is expected to reduce expenses by $28 million next year.","definition[2]":"money that an employee spends while doing their job on things such as travel and food, and which their employer then pays back to them","example[26]":"Come on, have another drink — it’s on expenses.","example[27]":"He gets an annual salary of $1.5 million; in addition he gets reimbursed for travel and other expenses."}