{"word[0]":"bond","definition[0]":"an official document promising that a government or company will pay back money that it has borrowed, often with interest","example[0]":"My father put all his money into stock market bonds.","example[1]":"furious trading on the bond market","definition[1]":"something that unites two or more people or groups, such as love, or a shared interest or idea","example[2]":"the emotional bond between mother and child","note[0]":"bond between","example[3]":"the United States’ special bond with Britain","note[1]":"bond with","example[4]":"lifelong bonds of friendship","note[2]":"bond of","signpost[0]":"with glue","definition[2]":"the way in which two surfaces become attached to each other using glue","example[5]":"Use a glue gun to form a strong bond on wood or china.","signpost[1]":"chemistry","definition[3]":"the chemical force that holds atoms together in a molecule","example[6]":"In each methane molecule there are four CH bonds.","signpost[2]":"written agreement","definition[4]":"a written agreement to do something, that makes you legally responsible for doing it","heading[0]":"– Meaning 2: something that unites two or more people or groups, such as love, or a shared interest or idea","collocation[0]":"a close/strong bond","example[7]":"A strong bond had developed between them.","collocation[1]":"a common bond","example[8]":"They shared a common bond – a love of literature.","collocation[2]":"a special bond","example[9]":"There was a special bond between him and his mother.","collocation[3]":"an emotional bond","example[10]":"As soon as we met we felt an emotional bond.","collocation[4]":"form/forge a bond","example[11]":"Frequently horses form a strong bond with their riders.","collocation[5]":"have a bond","example[12]":"Twins often have a very close bond.","collocation[6]":"feel a bond","example[13]":"The people of the island feel a strong bond with each other.","collocation[7]":"strengthen a bond","example[14]":"Sharing experiences strengthens bonds with friends.","collocation[8]":"break/destroy a bond","example[15]":"He didn’t want to do anything to break the bond between them.","collocation[9]":"a bond develops","example[16]":"Over six months of working together, a close bond developed.","definition[5]":"if two things bond with each other, they become firmly fixed together, especially after they have been joined with glue","example[17]":"It takes less than ten minutes for the two surfaces to bond.","definition[6]":"to develop a special relationship with someone","example[18]":"Time must be given for the mother to bond with her baby.","definition[7]":"to keep goods in a bonded warehouse","definition[8]":"an amount of money borrowed by a government or an organization. The government or organization produces a document promising that it will pay back the money that it has borrowed, usually with interest. The document, which can be bought and sold, is also called a bond","example[19]":"Many investors switched out of shares into bonds yesterday.","definition[9]":"a contract in which someone agrees to pay a sum of money if they do not do something they have promised to do","example[20]":"Importers of Mexican cement must post bonds (=leave money with a court) to cover penalties that may apply later.","definition[10]":"if imported goods are in bond, they are kept in a BONDED WAREHOUSE until tax has been paid on them","definition[11]":"used to talk about certain types of insurance contract"}