{"word[0]":"queue","definition[0]":"a line of people waiting to enter a building, buy something etc, or a line of vehicles waiting to move","example[0]":"You’ll have to join the queue.","example[1]":"We stood in a queue for half an hour.","note[0]":"be/stand/wait in a queue","example[2]":"At last we got to the front of the queue.","note[1]":"the front/head/back/end of a queue","example[3]":"a queue of people waiting for the bus","note[2]":"queue of","example[4]":"the queue for the toilets","note[3]":"queue for","example[5]":"There was a long queue to get into the cinema.","note[4]":"queue to do something","definition[1]":"all the people who are waiting to have or get something","example[6]":"You’ll have to join the housing queue.","example[7]":"It is possible to jump the queue  (=get something before people who have been waiting longer) if you are prepared to pay for your treatment.","example[8]":"the queue for kidney transplant operations","definition[2]":"a list of jobs that a computer has to do in a particular order","example[9]":"the print queue","definition[3]":"a number of telephone calls to a particular number that are waiting to be answered","collocation[0]":"stand/wait in a queue","example[10]":"She stood in the queue at the checkout.","collocation[1]":"be in a queue","example[11]":"I've been in this queue for fifteen minutes.","collocation[2]":"form a queue","example[12]":"Other passengers for the train were forming a queue.","collocation[3]":"join a queue","example[13]":"He went back inside to join the queue for the toilets.","collocation[4]":"take your place in a queue","example[14]":"I walked to the bus stop and took my place in the queue.","collocation[5]":"jump the queue","example[15]":"An argument developed when she tried to jump the queue.","collocation[6]":"a queue forms","example[16]":"A queue had formed outside the shop.","collocation[7]":"a queue stretches somewhere","example[17]":"The queue stretched the full length of the building.","collocation[8]":"long/big","example[18]":"Already a long queue had formed outside the concert hall","example[19]":"There was a big queue.","example[20]":"There was a small queue of people waiting to see the doctor.","collocation[9]":"an orderly queue","example[21]":"She told the children to form an orderly queue.","collocation[10]":"the front/head of the queue","example[22]":"He pushed his way to the front of the queue.","collocation[11]":"the back/end of the queue","example[23]":"Get to the back of the queue!","collocation[12]":"be first in a queue","example[24]":"I wanted to be first in the queue when the doors opened.","definition[4]":"to form or join a line of people or vehicles waiting to do something or go somewhere","example[25]":"Some of the people queuing for tickets had been there since dawn.","example[26]":"We had to queue up for ages to get served.","note[5]":"queue (up) to do something","definition[5]":"if people are queuing up to do something, they all want to do it very much","example[27]":"The school is one of the best, and parents are queuing up to send their children there.","note[6]":"queue up to do something","example[28]":"Actresses are queuing up for the part.","note[7]":"queue up for something","definition[6]":"a line of people waiting to enter a building, buy something etc","example[29]":"There may be long queues outside stores at sale times.","example[30]":"the number of jobs in the batch queue","past_tense[0]":"queued","example[31]":"Customers queued for hours to buy the new toy.","example[32]":"I queued up at the travel centre to pick up my tickets.","definition[7]":"if a computer queues a job, it puts it in a list of jobs that are to be done in a particular order","example[33]":"Input or output requests to a file are queued by the operating system."}