{"word[0]":"culture","signpost[0]":"in a society","definition[0]":"the beliefs, way of life, art, and customs that are shared and accepted by people in a particular society","example[0]":"We speak Danish at home so that the boys don’t lose touch with their language and culture.","example[1]":"In our culture, it is rude to ask someone how much they earn.","example[2]":"I love working abroad and meeting people from different cultures.","example[3]":"A brief history of Western culture.","note[0]":"Western/American/Japanese etc culture","example[4]":"Business is one of the major forces in modern culture.","note[1]":"modern/contemporary culture","signpost[1]":"in a group","definition[1]":"the attitudes and beliefs about something that are shared by a particular group of people or in a particular organization","example[5]":"Every government department has its own particular culture.","example[6]":"modern American youth culture","example[7]":"the drug culture that is destroying so many young lives today","example[8]":"the German political culture","example[9]":"Changing the corporate culture is a long and difficult process.","note[2]":"corporate/business/company culture","example[10]":"In the field of drug development, the culture of secrecy is deep and strong.","note[3]":"culture of","signpost[2]":"art/music/literature","definition[2]":"activities that are related to art, music, literature etc","note[4]":"culture vulture informal (=someone who is very interested in art, music, literature etc)","example[11]":"If it’s culture you’re looking for, the city has plenty of museums and art galleries.","example[12]":"the Italian Ministry of Culture","signpost[3]":"society","definition[3]":"a society that existed at a particular time in history","example[13]":"This technique was then adapted and refined by the more sophisticated cultures of the ancient world.","example[14]":"primitive cultures","signpost[4]":"medicine/science","definition[4]":"bacteria or cells grown for medical or scientific use, or the process of growing them","example[15]":"It takes two to three weeks to grow the culture.","example[16]":"tissue cultures","signpost[5]":"crops","definition[5]":"the practice of growing crops","synonym[0]":"cultivation","example[17]":"clearing forest for rice culture","example[18]":"Our society was heavily influenced by Greek and Roman culture.","collocation[0]":"national culture","example[19]":"Sport is a major part of our national culture.","collocation[1]":"local culture","example[20]":"The local culture of the island has much to interest visitors.","collocation[2]":"a common culture","example[21]":"Britain and America are united by a common culture.","collocation[3]":"traditional/ancient culture","example[22]":"The people have a traditional culture which has hardly changed in 500 years.","collocation[4]":"modern culture","example[23]":"Computers are a part of modern culture.","collocation[5]":"the dominant culture","example[24]":"What are the values of the dominant culture?","form[0]":"culture + NOUN","collocation[6]":"culture shock","definition[6]":"to grow bacteria or cells for medical or scientific use","definition[7]":"the ideas, beliefs, and customs that are shared and accepted by people in a society","example[25]":"Western culture places a high value on material wealth.","definition[8]":"the attitudes or beliefs that are shared by a particular group of people or in a particular organization","example[26]":"Working late hours seems part of the company culture.","example[27]":"Can he transform their corporate culture from overstaffed public administration to profit-minded entrepreneurship?","example[28]":"We have to change our management culture to compete in Asia.","example[29]":"land used for strawberry culture"}