{"word[0]":"measure","definition[0]":"to find the size, length, or amount of something, using standard units such as inches, metres etc","note[0]":"measuring jug/cup/tape (=one used for measuring)","example[0]":"The rainfall was measured over a three-month period.","example[1]":"She was being measured for her wedding dress.","note[1]":"measure somebody for something","example[2]":"We can measure the energy that food provides in calories.","note[2]":"measure something in something","definition[1]":"to judge the importance, value, or true nature of something","synonym[0]":"assess","example[3]":"Doctors say it is too early to measure the effectiveness of the drug.","example[4]":"Education shouldn’t be measured purely by examination results.","note[3]":"measure something by something","definition[2]":"to be a particular size, length, or amount","example[5]":"The room measures 6 x 6 metres.","example[6]":"The earthquake measured 6.5 on the Richter scale.","definition[3]":"if a piece of equipment measures something, it shows or records a particular kind of measurement","example[7]":"An odometer measures the number of miles your car travels.","signpost[0]":"action","definition[4]":"an action, especially an official one, that is intended to deal with a particular problem","example[8]":"Measures are being taken to reduce crime in the city.","example[9]":"New safety measures were being demanded after last night’s horrific train crash.","example[10]":"The new bridge was erected as a temporary measure to replace the one which was destroyed by floods.","example[11]":"drastic measures to reduce traffic problems","note[4]":"drastic/tough/extreme etc measures","example[12]":"He was kept in hospital overnight as a precautionary measure.","note[5]":"precautionary/preventative measure","signpost[1]":"unit of measurement","definition[5]":"an amount or unit in a measuring system","example[13]":"a table of weights and measures","definition[6]":"a standard amount of an alcoholic drink","signpost[2]":"thing used for measuring","definition[7]":"something used for measuring, for example a piece of wood or a container","definition[8]":"a group of notes and rests, separated from other groups by vertical lines, into which a piece of music is divided","collocation[0]":"take measures","example[14]":"We are taking measures to improve the situation.","collocation[1]":"adopt/introduce a measure","example[15]":"The countries agreed to adopt measures to reduce pollution.","collocation[2]":"a measure is aimed at doing something","example[16]":"The measures were aimed at reducing the speed of cars on the roads.","form[0]":"ADJECTIVES/NOUN + measure","collocation[3]":"a safety measure","example[17]":"New safety measures were implemented after the rail crash.","collocation[4]":"a security measure","example[18]":"Video surveillance cameras have been installed as a security measure.","collocation[5]":"a preventative/precautionary measure","example[19]":"Vaccination against disease is a sensible preventative measure.","collocation[6]":"a extreme measure","example[20]":"The public would not be in favour of such an extreme measure.","collocation[7]":"a drastic measure","example[21]":"Drastic measures are needed if we are to combat global warming.","collocation[8]":"a temporary measure","example[22]":"The tents were used as a temporary measure to replace homes destroyed in the floods.","collocation[9]":"a necessary measure","example[23]":"The army will take all necessary measures to protect the public.","collocation[10]":"an appropriate measure","example[24]":"In the event of an assault, staff will need to take appropriate measures to defend themselves.","collocation[11]":"a package/series of measures","example[25]":"A package of road safety measures has been announced.","definition[9]":"an official action, taken to deal with a particular problem","example[26]":"The company has had to take cost-cutting measures, including reducing spending on certain marketing programs.","definition[10]":"a way of measuring or calculating something","example[27]":"Gross domestic product is the Commerce Department’s main measure of U.S. economic output.","example[28]":"Car sales are often seen as a measure of consumer confidence.","definition[11]":"to find out or calculate the amount or level of something","example[29]":"ways to measure and improve service quality","example[30]":"This country has the third highest standard of living, as measured by per capita GDP.","example[31]":"All currencies have historically been measured against gold.","note[6]":"measure something against something","example[32]":"Overseas sales, measured in dollars, rose 18% last year."}