{"signpost[0]":"from harm/danger","definition[0]":"to make someone or something safe from danger, harm, or destruction","example[0]":"Emergency aid could save millions threatened with starvation.","example[1]":"a new treatment that could save his life","example[2]":"She was determined to save her marriage.","example[3]":"the campaign to save the rain forests","example[4]":"He saved the child from drowning.","note[0]":"save somebody/something from something","definition[1]":"to keep money in a bank so that you can use it later, especially when you gradually add more money over a period of time","example[5]":"He managed to save enough to buy a small house.","example[6]":"So far, I’ve saved about £500.","example[7]":"I’m saving up for a new car.","note[1]":"save for","signpost[1]":"not waste","definition[2]":"to use less money, time, energy etc so that you do not waste any","opposite[0]":"waste","example[8]":"We’ll save a lot of time if we go by car.","example[9]":"Everyone is being encouraged to save energy.","example[10]":"ways to save money on heating bills","example[11]":"money-saving ideas","note[2]":"energy-saving/time-saving etc","signpost[2]":"to use later","definition[3]":"to keep something so that you can use or enjoy it in the future","example[12]":"We’ll save the rest of the food and have it later.","example[13]":"I had a bottle of champagne which I’d been saving for a special occasion.","note[3]":"save something for something","signpost[3]":"collect","definition[4]":"to keep all the objects of a particular kind that you can find, so that you can use them","example[14]":"I’m saving up vouchers to get a cheap air ticket to the States.","signpost[4]":"help to avoid","definition[5]":"to help someone by making it unnecessary for them to do something that they do not want to do","example[15]":"If you lent me £5, it would save me a trip to the bank.","example[16]":"I’ll get a taxi from the station to save you the trouble of coming to collect me.","note[4]":"save somebody the trouble/bother (of doing something)","example[17]":"I’ll take the shopping home in the car to save you carrying it.","note[5]":"save somebody doing something","signpost[5]":"keep for somebody","definition[6]":"to stop people from using something so that it is available for someone else","example[18]":"Will you save me a seat?","example[19]":"We’ll save some dinner for you if you’re late.","note[6]":"save something for somebody","definition[7]":"to make a computer keep the work that you have done on it","example[20]":"Don’t forget to save before you close the file.","example[21]":"Did you save the changes that you made?","definition[8]":"to stop the other team from scoring in a game such as football","example[22]":"The goalkeeper just managed to save the shot.","definition[9]":"in the Christian church, to free someone from the power of evil and bring them into the Christian religion","example[23]":"Jesus came to save sinners.","definition[10]":"to gradually collect money by not spending all the money you have, especially when you regularly put some of it in a bank","example[24]":"She doesn’t earn much, but she still manages to save a few dollars each week.","example[25]":"We’re saving for a deposit to buy a house.","display[0]":"set/put aside","definition[11]":"to regularly save part of the money you earn, especially over a long period of time","example[26]":"You should start setting aside part of your earnings as retirement savings.","display[1]":"scrimp and save","definition[12]":"to try to save money by spending less on the things you need and by saving what you can, especially when you do not earn very much","example[27]":"My parents scrimped and saved for years to send me to college.","display[2]":"squirrel something away","definition[13]":"to keep something, especially money, in a safe place to be used later","example[28]":"I wanted to surprise her, so I squirreled away a couple of dollars a week to spend on a present.","display[3]":"economize","definition[14]":"to spend less money by buying only the things that you really need, or by buying cheaper things","example[29]":"Weddings can be expensive, but you can economize by doing some things yourself.","definition[15]":"an action in which a player in a game such as football prevents the other team from scoring","example[30]":"Martin made a brilliant save from Nichol’s shot.","definition[16]":"except","example[31]":"She answered all the questions save one.","example[32]":"Little is known about his early life, save that he had a brother.","note[7]":"save that","definition[17]":"to keep or collect money to use later, especially when you gradually add more money over a period of time","example[33]":"She saves £200 a month from her salary.","example[34]":"We want to increase incentives to work, save, and invest.","example[35]":"After three years he had saved up enough to fly to Australia.","note[8]":"save to do something","definition[18]":"to use less money, time, energy etc, so that you do not waste any","example[36]":"The Bank expects to save $1.4 million a year with the job cuts.","example[37]":"new energy-saving technology","example[38]":"An experienced tax professional can save you time and trouble.","note[9]":"save somebody something","definition[19]":"to make a computer keep the work that you have done in its permanent memory","example[39]":"You transfer information to permanent disk storage by saving your file.","example[40]":"Don’t forget to save every few minutes."}