{"word[0]":"mortgage","definition[0]":"a legal arrangement by which you borrow money from a bank or similar organization in order to buy a house, and pay back the money over a period of years","example[0]":"Your building society or bank will help arrange a mortgage.","example[1]":"They’ve taken out a 30-year  mortgage  (=they will pay for their house over a period of 30 years).","example[2]":"We decided to use Fred’s redundancy money to pay off the mortgage  (=pay back all the money we borrowed for a mortgage).","example[3]":"Mortgage rates are set to rise again in the spring.","example[4]":"She was having trouble meeting her mortgage payments.","definition[1]":"the amount of money you borrow in the form of a mortgage","example[5]":"If you earn £20,000 per year, then you may be able to get a mortgage of £60,000.","collocation[0]":"have a mortgage","example[6]":"They have a mortgage on a small house in North London.","collocation[1]":"take out a mortgage","example[7]":"We took out a 25-year mortgage.","collocation[2]":"get a mortgage","example[8]":"We couldn't get a mortgage.","collocation[3]":"pay/repay a mortgage","example[9]":"If I lose my job, we won't be able to pay the mortgage.","collocation[4]":"pay off a mortgage","example[10]":"They paid off their mortgage five years early.","collocation[5]":"fall/get behind with the mortgage","example[11]":"He fell behind with the mortgage when he lost his job.","collocation[6]":"big/high","example[12]":"They both need to work full-time because their mortgage is so big.","collocation[7]":"cheap","example[13]":"Homebuyers are eager to take advantage of the cheap mortgages on offer.","form[0]":"mortgage + NOUN","collocation[8]":"a mortgage payment","example[14]":"If interest rates go down, your mortgage payments will fall.","collocation[9]":"the mortgage rate","example[15]":"You need to shop around for a good mortgage rate.","collocation[10]":"a mortgage lender","example[16]":"Nearly all mortgage lenders plan to raise their interest rates.","definition[2]":"if you mortgage your home, land, or property, you borrow money, usually from a bank, and if you cannot pay back the money within a particular period of time, the bank has the right to sell your property in order to get the money you owe it","example[17]":"We mortgaged our house to start Paul’s business.","definition[3]":"a legal arrangement where you borrow money from a financial institution in order to buy land or a house, and you pay back the money over a period of years. If you do not make your regular payments, the lender normally has the right to take the property and sell it in order to get back their money","example[18]":"He arranged a 30-year mortgage at 7% for the five-bedroom house.","example[19]":"They took out a $100,000 mortgage (=obtained one) to pay for the property.","example[20]":"He recently paid off his mortgage (=paid back all the money borrowed) because he fears that interest rates will rise.","definition[4]":"to give a financial institution the right to own your house, property, or land if you do not pay back the money they lent you within the agreed time","example[21]":"They mortgaged their home for $65,000 to a life insurance company and gave the cash to their children.","definition[5]":"to have a very large mortgage in relation to the value of the property you own"}