{"word[0]":"emergency","plural[0]":"emergencies","definition[0]":"an unexpected and dangerous situation that must be dealt with immediately","example[0]":"Lifeguards are trained to deal with emergencies.","example[1]":"In case of emergency, press the alarm button.","example[2]":"The plane had to make an emergency landing.","example[3]":"The government called an emergency meeting to discuss the crisis.","example[4]":"$500,000 of emergency aid for the victims of the earthquake","note[0]":"emergency exit/supplies etc","example[5]":"The staff need to know what to do in an emergency.","note[1]":"in an emergency","collocation[0]":"deal with an emergency","example[6]":"Several fire crews were called to deal with the emergency at the power plant.","collocation[1]":"cope with an emergency","example[7]":"Do you think that you could cope with an emergency?","collocation[2]":"handle an emergency","example[8]":"There is always a doctor on call to handle emergencies.","form[0]":"emergency + NOUN","collocation[3]":"an emergency situation","example[9]":"If an emergency situation arises, the pilot and crew must stay calm.","collocation[4]":"emergency aid/relief/help","example[10]":"The charity made a television appeal for emergency aid to the region.","collocation[5]":"emergency treatment","example[11]":"The driver is undergoing emergency treatment at Park Royal Hospital.","collocation[6]":"an emergency operation","example[12]":"He had an emergency operation to save his sight.","collocation[7]":"an emergency meeting","example[13]":"The cabinet held an emergency meeting earlier today.","collocation[8]":"an emergency session","example[14]":"an emergency session of the UN Security Council","collocation[9]":"emergency measures","example[15]":"The president announced emergency measures to deal with terrorism.","collocation[10]":"emergency powers","example[16]":"The army was given emergency powers to help tackle the rising violence.","collocation[11]":"an emergency vehicle","example[17]":"Emergency vehicles rushed to the scene.","collocation[12]":"a serious emergency","example[18]":"The police usually respond quickly to serious emergencies.","collocation[13]":"an extreme emergency","example[19]":"These weapons should be used only in an extreme emergency.","collocation[14]":"a major emergency","example[20]":"In a major emergency, the national guard may be called in.","collocation[15]":"a sudden/unexpected/unforeseen emergency","example[21]":"I left half an hour early in case of traffic jams or some other unforeseen emergency.","collocation[16]":"in case of emergency/in the event of an emergency","example[22]":"The fire-exit doors should only be opened in case of emergency.","example[23]":"Ring this number in case of an emergency.","definition[1]":"work, a meeting, money etc needed to deal with an urgent and unexpected problem","example[24]":"Workmen are carrying out emergency repairs to the bridge.","example[25]":"emergency reserves held at the Bank of England"}