{"word[0]":"swap","definition[0]":"to give something to someone and get something in return","synonym[0]":"exchange","example[0]":"Do you want to swap umbrellas?","example[1]":"He swapped his watch for a box of cigars.","note[0]":"swap something for something","example[2]":"The girls chatted and swapped clothes with each other.","note[1]":"swap something with somebody","definition[1]":"to tell information to someone and be given information in return","example[3]":"We need to get together to swap ideas and information.","example[4]":"They sat in a corner and swapped gossip.","definition[2]":"to do the thing that someone else has been doing, and let them do the thing that you have been doing","example[5]":"They decided to swap roles for the day.","example[6]":"You start on the windows and I’ll do the walls, then we can swap over after an hour or so.","example[7]":"She ended up swapping jobs with her secretary.","definition[3]":"to stop using or get rid of one thing and put or get another thing in its place","example[8]":"The driver announced that we would have to swap buses.","example[9]":"She had swapped her long skirts for jeans and T-shirts.","example[10]":"He swapped his London home for a cottage in Scotland.","definition[4]":"to move one thing and put another in its place","example[11]":"Someone had gone into the nursery and swapped all the babies around.","example[12]":"Why don’t we swap the TV with the bookcase?","note[2]":"swap something with something","definition[5]":"a situation in which you give something to someone and get another thing in return","example[13]":"a fair swap","example[14]":"We can do a swap if you like.","definition[6]":"a situation in which people each do the job that the other usually does","definition[7]":"to exchange one investment for another","example[15]":"Investors have doubled their money afterswapping thebonds for a package of cash and shares.","example[16]":"Employees were allowed to swap old, effectively worthlessstock for new options.","definition[8]":"an exchange of one investment for another","example[17]":"The tax-free stock swap was valued at almost $880 million.","example[18]":"The Accounting Standards Board has launched a project to valuedebt-for-equity swaps more accurately."}