{"word[0]":"access","definition[0]":"the right to enter a place, use something, see someone etc","example[0]":"Access to the papers is restricted to senior management.","note[0]":"access to","example[1]":"Cats should always have access to fresh, clean water.","definition[1]":"how easy or difficult it is for people to enter a public building, to reach a place, or talk to someone","example[2]":"We’re trying to improve access for disabled visitors.","note[1]":"access for","example[3]":"a villa with easy access to the sea","definition[2]":"the way you use to enter a building or reach a place","example[4]":"Access is by means of a small door on the right.","example[5]":"Access to the restrooms is through the foyer.","definition[3]":"the legal right to see and spend time with your children, a prisoner, an official etc","example[6]":"My ex-husband has access to the children once a week.","definition[4]":"to find information, especially on a computer","example[7]":"Users can access their voice mail remotely.","definition[5]":"a former type of credit card in the UK which is now known as Mastercard","definition[6]":"the right to sell goods to a particular market or country without breaking any laws or agreements","example[8]":"Japan agreed to allow foreign manufacturers of satellite equipment equal access to the Japanese market.","definition[7]":"the way in which you are able to find information held on a computer","example[9]":"In order to simplify access to the data, the computer program enables users to specify their own requirements.","definition[8]":"when you are allowed to see official documents","example[10]":"The National Union of Teachers has proposed that parents should have access to their children’s files.","definition[9]":"the ability to buy a product or make use of a service","example[11]":"The move is intended to widen the access to credit.","example[12]":"Many poorer residents have no access to health care.","definition[10]":"the right to remove money from where it is invested in order to use it","example[13]":"Policyholders often feel more confident if they have access to their funds.","example[14]":"The software enables each client to access data from other databases.","definition[11]":"to be able to use something","example[15]":"Many customers now access their accounts using the internet."}