{"word[0]":"inside","definition[0]":"in or into a container or other closed space so as to be completely covered or surrounded","example[0]":"The jewels were locked away inside the safe.","example[1]":"I sent the money inside an envelope addressed to Ann.","example[2]":"Carl picked up the book and stuffed it inside his jacket.","example[3]":"Her car was locked and the keys were inside.","signpost[0]":"building/room","definition[1]":"in or into a building or room","example[4]":"It’s raining. We’ll have to go inside.","example[5]":"She could hear voices inside, but no one came to the door.","example[6]":"Mail was piled up just inside the doorway.","example[7]":"The sound was coming from inside the house.","example[8]":"There were 20 people packed inside of her dorm room.","note[0]":"inside of","signpost[1]":"country/area","definition[2]":"in a country or area – used when you want to emphasize that something is happening there and not in other places","example[9]":"Very little is known of events inside this mysterious country.","example[10]":"The guerrillas were said to be operating from bases inside the war zone.","definition[3]":"if someone is inside a group or organization, they are part of it","example[11]":"women’s influence inside the party","example[12]":"The information comes from sources inside the company.","example[13]":"Discussions should involve local people both inside and outside the school.","signpost[2]":"head/mind","definition[4]":"if something happens inside you, or inside your head or mind, it is part of what you think and feel, especially when you do not express it","example[14]":"You just don’t understand how I feel inside!","example[15]":"Steve’s a strange guy – you never know what’s going on inside his head.","example[16]":"Anger bubbled up deep inside her.","example[17]":"Something inside of me told me not to trust him.","definition[5]":"in your body","example[18]":"She could feel the baby kicking inside her.","example[19]":"You’ll feel better once you’ve got a good meal inside you  (=after you have eaten something).","definition[6]":"in less than a particular amount of time","example[20]":"A full report is expected inside three months.","example[21]":"We’ll be back inside the hour.","note[1]":"inside the hour/month etc","example[22]":"Our aim is to get the whole job finished inside of a week.","definition[7]":"less than a particular amount of time","example[23]":"Jonson’s time of 9.3 seconds was just inside the world record.","definition[8]":"in prison","example[24]":"My boyfriend’s been inside for a year.","definition[9]":"in or facing the inner part of something","example[25]":"the inside pages of the newspaper","example[26]":"the inside pocket of his jacket","definition[10]":"someone inside a company or organization works for it and is part of it","example[27]":"He had obviously been helped by someone inside the company.","example[28]":"She made enemies both inside and outside the industry.","definition[11]":"inside knowledge, information etc is possessed by or comes from someone working for the company or organization it relates to","example[29]":"someone who trades on an inside stock tip","definition[12]":"already employed by a company","example[30]":"The leading inside candidate for the post is Robert A. Lutz."}