{"definition[0]":"earlier than a particular event or action","opposite[0]":"after","example[0]":"Say goodbye before you go.","example[1]":"I saw her a few days before she died.","definition[1]":"so that something does not or cannot happen","example[2]":"Put that money somewhere safe before it gets stolen.","example[3]":"That dog ought to be destroyed before it attacks any more children.","example[4]":"Before I could say anything more, Holmes had rushed off towards the station.","definition[2]":"used to say that something happens after a period of time","example[5]":"It was several minutes before we realised what was happening.","example[6]":"It will be a while before we know the results.","definition[3]":"used to say that something must happen in order for something else to be possible","example[7]":"You have to pass a test before you can get a licence.","definition[4]":"used to warn someone that something bad will happen to them if they do not do something","example[8]":"Get out before I call the police!","definition[5]":"used to emphasize that someone does not want to do something","example[9]":"She would die before she would admit she was wrong.","heading[0]":"GRAMMAR: Choosing the right tense","explanation[0]":"You use the present simple with before to talk about a future event Don’t use ‘will’ You say","example[10]":"I want to get home before it rains","bad_example[0]":"before it will rain","definition[6]":"earlier than something or someone","example[11]":"The new road should be completed before the end of the year.","example[12]":"Let’s meet at our house before the show.","example[13]":"Larry arrived home before me.","example[14]":"We only got back from Scotland the day before yesterday (=two days ago).","example[15]":"Other students joined in the protest, and before long (=soon) there was a crowd of 200 or so.","example[16]":"Hugh arrived just five minutes before the ceremony.","note[0]":"five minutes/two hours etc before something","example[17]":"I usually take a shower before having my breakfast.","note[1]":"before doing something","definition[7]":"ahead of someone or something else in a list or order","example[18]":"You were before me in the queue.","example[19]":"The files are in alphabetical order, so B1 comes before C1.","definition[8]":"used to say that something happens where it can be watched by people","synonym[0]":"in front of","example[20]":"Italy will face Brazil this afternoon before a crowd of 100,000 spectators.","example[21]":"an actor who had performed before the Queen","definition[9]":"used to say that someone or something comes to be judged or considered by a person or group of people","example[22]":"The proposal was put before the planning committee.","definition[10]":"used to say that one thing or person is considered more important than another","example[23]":"I put my wife and kids before anyone else.","example[24]":"In the air transport business, safety must always come before profit.","definition[11]":"in front of something or someone","example[25]":"The priest stood before the altar.","example[26]":"The sea stretched out before them.","definition[12]":"if one place is before another place on a road or journey, the first place is nearer to you than the second, so you will reach it first","example[27]":"The pub is 100 metres before the church on the right.","example[28]":"the last station before the Simplon Tunnel","definition[13]":"if there is a job or situation before you, you will have to do the job or face the situation","synonym[1]":"ahead of","example[29]":"The task of emptying the house lay before us.","definition[14]":"if a period of time is before you, it is about to start and you can do what you want during it","example[30]":"We had a glorious summer afternoon before us to do as we pleased.","example[31]":"You have your whole life before you.","example[32]":"She could read before she started school.","example[33]":"Do you want to have a shower before me?","display[0]":"prior to","definition[15]":"before something happens","example[34]":"Please arrive at the airport two hours prior to departure.","display[1]":"by","definition[16]":"no later than a particular time or date","example[35]":"The children are usually in bed by 9 o'clock.","example[36]":"We have to be out of our hotel room by 10 o'clock.","display[2]":"earlier","definition[17]":"before now, or before the time you are talking about","example[37]":"I saw her earlier.","example[38]":"I had sent the letter earlier in the week.","display[3]":"previously","definition[18]":"before now, or before a time in the past","example[39]":"He previously worked as an electrician.","example[40]":"The show starred a previously unknown actress called Jennifer Aniston.","display[4]":"in advance","definition[19]":"before something happens – used especially when talking about the arrangements for something","example[41]":"Let me know in advance if you are going to be late.","example[42]":"The landlord wants three months’ rent in advance.","display[5]":"beforehand","definition[20]":"before something happens, especially so that you are ready","example[43]":"I wish we had known about all this beforehand.","example[44]":"It’s always best to decide beforehand how much you want to pay.","definition[21]":"at an earlier time","example[45]":"Haven’t I met you before somewhere?","example[46]":"Never before had he seen so many people starving.","example[47]":"She looked just the same as before.","definition[22]":"ahead of someone or something else","example[48]":"The king’s herald walked before."}