{"word[0]":"and","definition[0]":"used to join two words, phrases etc referring to things that are related in some way","example[0]":"He’s gone to get some fish and chips.","example[1]":"The film starred Jack Lemmon and Shirley Maclaine.","example[2]":"We’ve dealt with items one, two, and eleven.","example[3]":"He was tall, dark, and handsome.","example[4]":"He plays the guitar and sings folk songs.","example[5]":"She didn’t speak to anyone and nobody spoke to her.","definition[1]":"used to say that one action or event follows another","example[6]":"Sit down and tell me all about it.","example[7]":"She picked up the kitten and put it in the box.","example[8]":"He knocked on the door and went in.","example[9]":"You’ll have to wait and see what happens.","definition[2]":"used to say that something is caused by something else","example[10]":"I missed supper and I’m starving!","example[11]":"She fell downstairs and broke her leg.","definition[3]":"used when adding numbers","example[12]":"Six and four is ten.","definition[4]":"used after verbs such as ‘go’, ‘come’, and ‘try’ to show what your intention is","example[13]":"Shall we go and have a cup of coffee?","example[14]":"I’ll see if I can try and persuade her to come.","definition[5]":"used to introduce a statement, remark, question etc","example[15]":"And now I’d like to introduce our next speaker, Mrs Thompson.","example[16]":"‘She’s getting married in June.’ ‘And who’s the lucky man?’","explanation[0]":"In written English, avoid starting a sentence with and:","definition[6]":"used between repeated words to emphasize what you are saying","example[17]":"More and more people are losing their jobs.","example[18]":"We waited for hours and hours!","example[19]":"That was years and years ago.","example[20]":"We ran and ran.","definition[7]":"used before saying the part of a large number which is less than 100","example[21]":"a hundred and four","example[22]":"five hundred and seventy-six","example[23]":"by the year two thousand and ten","definition[8]":"used when saying a number which consists of a whole number followed by a fraction","example[24]":"three and three-quarters","example[25]":"in about two and a half hours’ time","example[26]":"five and a quarter per cent","definition[9]":"used between repeated plural nouns to say that some things of a particular kind are much better than others","example[27]":"‘They said this guy was an expert.’ ‘Yes, but there are experts and experts.’","definition[10]":"used when you want someone to add something to what they have just said","example[28]":"‘I’m sorry.’ ‘And?’ ‘And I promise it won’t happen again.’"}