{"word[0]":"thief","plural[0]":"thieves","definition[0]":"someone who steals things from another person or place","note[0]":"a car/jewel etc thief","example[0]":"Thieves broke into the offices and stole some computer equipment.","example[1]":"They were nothing but petty thieves (=thieves who steal small things).","definition[1]":"someone who steals things from a person or place","example[2]":"The thief grabbed her handbag and ran off down the street.","example[3]":"Car thieves are operating in this area.","display[0]":"burglar","definition[2]":"someone who goes into houses, offices etc to steal things","example[4]":"Burglars broke into the house and took a computer worth £1,000.","example[5]":"Police believe the burglar got in through the kitchen window.","display[1]":"robber","definition[3]":"someone who steals from banks, offices, houses etc, especially using threats or violence","example[6]":"a gang of bank robbers","example[7]":"an armed robber (=a robber with a gun)","display[2]":"shoplifter","definition[4]":"someone who takes things from shops without paying for them, especially by hiding them in their clothes or in a bag","example[8]":"The store has installed hidden cameras to catch shoplifters.","display[3]":"pickpocket","definition[5]":"someone who steals from people’s pockets, especially in a crowded public place","example[9]":"Look out for pickpockets in busy tourist areas.","display[4]":"mugger","definition[6]":"a thief who violently attacks someone in the street and robs them","example[10]":"The mugger punched him in the face and tried to steal his wallet.","display[5]":"joyrider","definition[7]":"someone who steals a car and drives it very fast for fun","example[11]":"Police pursued the teenage joyriders across three counties.","display[6]":"looter","definition[8]":"someone who breaks into shops or homes and steals things, after there has been a natural disaster, a war, or a violent protest","example[12]":"Police chiefs have warned that looters will be shot.","display[7]":"bandit","definition[9]":"a member of an armed group of thieves who travel around attacking people in country areas","example[13]":"The village was attacked by a gang of bandits.","display[8]":"poacher","definition[10]":"someone who hunts animals, birds etc illegally on other people’s land","example[14]":"Their job is to prevent poachers from killing the elephants."}