{"word[0]":"reveal","definition[0]":"to make known something that was previously secret or unknown","opposite[0]":"conceal","example[0]":"He may be prosecuted for revealing secrets about the security agency.","example[1]":"a test that can reveal a teacher’s hidden skills","example[2]":"He revealed that he had been in prison twice before.","note[0]":"reveal (that)","example[3]":"The violinist revealed himself as a talented interpreter of classical music.","note[1]":"reveal yourself (as/to be something)","definition[1]":"to show something that was previously hidden","example[4]":"The curtain opened to reveal the grand prize.","definition[2]":"to let someone know about something that is secret or has not been known until now","example[5]":"Doctors are not allowed to reveal confidential information.","example[6]":"It was revealed that he had smoked marijuana at college.","definition[3]":"to talk about something to someone, so that they know about it","example[7]":"Don’t tell anyone about this just yet.","example[8]":"Shall I tell you a secret?","display[0]":"disclose","definition[4]":"to publicly reveal something such as a fact or a name that has been kept secret","example[9]":"The terms of the agreement have not yet been disclosed.","example[10]":"The agent did not disclose that there had been a violent crime in the house.","display[1]":"divulge","definition[5]":"to reveal important or personal information which was previously secret or unknown","example[11]":"The bank has refused to divulge its plans.","example[12]":"I’m afraid I cannot divulge what was said to me.","display[2]":"make something public","definition[6]":"to tell people about important information, especially after it has been kept secret","example[13]":"Apparently they were engaged for some time before making it public.","example[14]":"The government has agreed that sources of financing should in future be made public.","display[3]":"leak","definition[7]":"to deliberately give secret information to a newspaper, television company etc, when a government or other organization wants to keep it secret","example[15]":"The contents of the email were leaked to the press.","example[16]":"A man was charged today with leaking official secrets.","display[4]":"give something away","definition[8]":"to tell someone something that you want to keep secret","example[17]":"He was careful not to give away any trade secrets.","example[18]":"I’m not going to give away how much I paid for it!","display[5]":"let slip","definition[9]":"to accidentally tell someone about something","example[19]":"He let slip that he was envious of his older brother.","definition[10]":"the time, especially on a television programme, when something that was previously secret or unknown is shown or made known, or when a changed person or thing is shown","example[20]":"After the garden makeover, it was time to bring the owners back for the big reveal."}