{"word[0]":"use","signpost[0]":"use something","definition[0]":"if you use a particular tool, method, service, ability etc, you do something with that tool, by means of that method etc, for a particular purpose","note[0]":"use force (=use violent methods)","example[0]":"Can I use your phone?","example[1]":"I’ll show you which room you can use.","example[2]":"I always use the same shampoo.","example[3]":"Use your imagination when planning meals.","example[4]":"She booked the flight using a false name.","example[5]":"Drop-down menus make the program very easy to use.","note[1]":"easy/difficult/simple etc to use","example[6]":"They were using animals for scientific experiments.","note[2]":"use something for (doing) something","example[7]":"Bob uses the van for picking up groceries.","example[8]":"My parents use the house as a holiday home.","note[3]":"use something as something","example[9]":"Most people now use their cars to go shopping.","note[4]":"use something to do something","signpost[1]":"amount of something","definition[1]":"to take an amount of something from a supply of food, gas, money etc","example[10]":"We use about £40 worth of electricity a month.","example[11]":"Standard washing machines use about 40 gallons of water.","signpost[2]":"treat somebody unfairly","definition[2]":"to make someone do something for you in order to get something you want","example[12]":"Can’t you see that Howard is just using you?","example[13]":"Gerald had been using her for his own ends.","signpost[3]":"an advantage","definition[3]":"to take advantage of a situation","example[14]":"She used her position as manager to get jobs for her friends.","signpost[4]":"word","definition[4]":"to say or write a particular word or phrase","example[15]":"We use the word ‘hardware’ to describe the actual machine.","example[16]":"Don’t use bad language.","definition[5]":"to regularly take illegal drugs","definition[6]":"to use something for a particular purpose","example[17]":"Do you mind if I use your phone?","example[18]":"They rebuilt the church using local stone.","example[19]":"We use a range of different methods.","display[0]":"make use of something","definition[7]":"to use something that is available to you","example[20]":"Staff can make use of a wide range of facilities.","example[21]":"She made full use of her contacts within the organization.","display[1]":"employ","definition[8]":"to use a particular method or skill in order to achieve something","example[22]":"The surgeons employed a new technique.","example[23]":"They employed every means at their disposal (=every available method).","display[2]":"utilize","definition[9]":"to use something that is available to you, for a practical purpose","example[24]":"The company has developed a new way to utilize solar energy.","example[25]":"a better way of utilizing the space","display[3]":"exploit","definition[10]":"to use something as fully and effectively as possible, or to use something that will give you an advantage over your opponent","example[26]":"The country’s natural resources have not yet been fully exploited.","example[27]":"He was quick to exploit any weakness in his opponent’s argument.","display[4]":"apply","definition[11]":"to use something such as a method, idea, or system in a particular situation","example[28]":"New technology is being applied to almost every industrial process.","example[29]":"I wanted to apply the things that I had learned on the course.","display[5]":"draw on something","definition[12]":"to use information, knowledge, or experience that you have learned in the past","example[30]":"He was able to draw on his own experience as a diplomat when he was writing the book.","example[31]":"Journalists draw on information from many different sources.","display[6]":"resort to something","definition[13]":"to use violence, force, threats etc as a way of achieving something","example[32]":"Extremists on both sides resort to violence.","example[33]":"We are prepared to resort to force if necessary.","heading[0]":"to use your power or your rights","display[7]":"exercise","definition[14]":"to use your rights, authority, influence etc","example[34]":"Only 40% of the population exercised their right to vote.","example[35]":"Congress must decide whether to exercise its veto.","display[8]":"wield","definition[15]":"to use great power or influence","example[36]":"The central banks wield enormous power.","definition[16]":"the action or fact of using something","example[37]":"an exit for use in emergencies","example[38]":"the increasing use of computers in education","note[5]":"use of","definition[17]":"a purpose for which something can be used","example[39]":"Robots have many different uses in modern industry.","example[40]":"The cupboard is full of things I can never find a use for.","note[6]":"have/find a use for something","definition[18]":"one of the meanings of a word, or the way that a particular word is used","collocation[0]":"widespread/extensive use","example[41]":"The widespread use of computers changed business completely.","collocation[1]":"efficient use","example[42]":"Doing the work in stages makes the most efficient use of resources.","collocation[2]":"effective use","example[43]":"We need to consider whether there could be a more effective use of our time.","collocation[3]":"heavy/frequent use","example[44]":"The heavy use of pesticides in the area led to severe health problems.","collocation[4]":"regular use","example[45]":"These drugs are not recommended for regular use.","collocation[5]":"greater use","example[46]":"We want to encourage employees to make greater use of the sports facilities.","collocation[6]":"land use","example[47]":"Our department is responsible for establishing the guidelines for land use in the county.","collocation[7]":"drug/alcohol use","example[48]":"Drug use among teenage boys is on the increase."}