{"word[0]":"emphasize","definition[0]":"to say something in a strong way","synonym[0]":"stress","example[0]":"The report emphasizes the importance of improving safety standards.","example[1]":"Logan made a speech emphasizing the need for more volunteers.","example[2]":"The prime minister emphasized that there are no plans to raise taxes.","note[0]":"emphasize that/how","definition[1]":"to say a word or phrase louder or higher than others to give it more importance","definition[2]":"to make something more noticeable","synonym[1]":"accentuate","example[3]":"The dress emphasized the shape of her body.","definition[3]":"to say strongly or show clearly that a fact, idea etc is especially important","example[4]":"Our company emphasizes the need for good communication between staff.","definition[4]":"to emphasize something when you are talking about a subject","example[5]":"Most schools stress the importance of parental involvement in their child’s learning.","example[6]":"He stressed the need for parents to listen to their children.","display[0]":"highlight","definition[5]":"to show that something is important, so that people will pay special attention to it","example[7]":"This case highlights the need for tougher laws on gun ownership.","example[8]":"The report highlights the decline in the numbers of native plants and insects.","display[1]":"underline/underscore","definition[6]":"to help to show clearly that a fact is true, especially a fact that is already known","example[9]":"These attacks underline the fact that the security situation here remains fragile.","example[10]":"The president’s speech repeatedly underscored the progress that has been made.","definition[7]":"to show something clearly and make it easier to notice","example[11]":"The recent economic crisis has accentuated the gap between the rich and the poor.","display[2]":"overemphasize","definition[8]":"to emphasize something too much","example[12]":"The relation between food and health is often overemphasized in my view.","display[3]":"play up","definition[9]":"to emphasize something and make it seem more important than it really is, especially to get advantages for yourself","example[13]":"The story has been played up by the media.","example[14]":"The Labour party had a great time playing up the Conservatives’ problems."}