{"word[0]":"activity","plural[0]":"activities","definition[0]":"things that people do, especially in order to achieve a particular aim","example[0]":"Everyone is free to engage in peaceful political activity.","example[1]":"fund-raising activities","example[2]":"Regular physical activity helps to control your weight.","definition[1]":"something that you do because you enjoy it","example[3]":"leisure activities","example[4]":"outdoor activities such as hiking or climbing","definition[2]":"a situation in which a lot of things are happening or a lot of things are being done","example[5]":"The office was suddenly full of frantic activity.","example[6]":"The farm was always a hive of activity at this time of year.","collocation[0]":"take part in an activity","example[7]":"The children were encouraged to take part in several different activities.","collocation[1]":"engage in an activity","example[8]":"Police suspect he may have engaged in criminal activities.","collocation[2]":"be involved in an activity","example[9]":"The men were involved in terrorist activities.","collocation[3]":"do an activity","example[10]":"He doesn’t do a lot of physical activity.","form[0]":"ADJECTIVES/NOUN + activity","collocation[4]":"political activity","example[11]":"Political activity is closely controlled by the government.","collocation[5]":"economic activity","example[12]":"The current level of economic activity will influence business confidence.","collocation[6]":"business/commercial activity","example[13]":"Internet shopping is a rapidly developing area of business activity.","collocation[7]":"human activity","example[14]":"There was no sign of any human activity.","collocation[8]":"criminal/illegal activity","example[15]":"The bar was being used for illegal activities.","collocation[9]":"terrorist activity","example[16]":"The police took extra measures to protect the public against terrorist activity.","collocation[10]":"outdoor activities","example[17]":"The college is well situated for students who are interested in outdoor activities.","collocation[11]":"physical activity","example[18]":"It’s important to do some kind of regular physical activity.","collocation[12]":"mental activity","example[19]":"Your mental activity starts to slow down as you grow old.","example[20]":"I don’t have much time for leisure activities.","collocation[13]":"classroom activities","example[21]":"He didn’t really take part in classroom activities.","collocation[14]":"cultural activities","example[22]":"There is plenty of opportunity for children to express themselves in creative and cultural activities.","collocation[15]":"the level of activity","example[23]":"The level of economic activity has increased."}