{"word[0]":"sure","signpost[0]":"certain you know something","definition[0]":"confident that you know something or that something is true or correct","synonym[0]":"certain","example[0]":"‘That’s Sarah’s cousin.’ ‘Are you sure?’","example[1]":"‘What time does the show start?’ ‘I’m not sure.’","example[2]":"I’m sure there’s a logical explanation for all this.","note[0]":"sure (that)","example[3]":"Are you sure that you know how to get there?","example[4]":"My mother, I felt sure, had not met him before.","example[5]":"Henry wasn’t sure how to answer this.","note[1]":"not sure how/where/when etc","example[6]":"I’m not sure if I’m pronouncing this correctly.","note[2]":"not sure if/whether","example[7]":"He wasn’t even sure of his mother’s name.","note[3]":"sure of","example[8]":"They were talking about her, she was sure of that.","example[9]":"‘That’s the man I saw in the building last night.’ ‘Are you quite sure (=completely sure) about that?’","note[4]":"sure about","explanation[0]":"In writing, people often prefer to use certain rather than sure, because it sounds more formal:","example[10]":"We cannot be certain what causes this phenomenon.","signpost[1]":"certain about your feelings","definition[1]":"certain about what you feel, want, like etc","example[11]":"Are you sure you really want a divorce?","example[12]":"Carla says she is very sure of her love for Tony.","signpost[2]":"certain to be true","example[13]":"One thing’s for sure, we’ll never be able to move this furniture on our own.","note[5]":"one thing is (for) sure","example[14]":"Those black clouds are a sure sign of rain.","note[6]":"sure sign/indication","signpost[3]":"certain to happen/succeed","definition[2]":"certain to happen, succeed, or have a particular result","note[7]":"sure thing/bet American English (=something that will definitely happen, win, succeed etc)","example[15]":"There was only one sure way of finding out – and that was to visit him.","note[8]":"sure way to do something/of doing something","example[16]":"He’s sure to get nervous and say something stupid.","note[9]":"sure to do something","collocation[0]":"quite sure","example[17]":"Are you quite sure she won’t mind?","collocation[1]":"pretty sure","example[18]":"I’m pretty sure it was the same woman who called the office last week.","collocation[2]":"absolutely sure","example[19]":"Don’t throw anything away until you are absolutely sure you won’t need it again.","collocation[3]":"not quite/entirely sure","example[20]":"‘What are they?’ ‘I’m not entirely sure.’","collocation[4]":"not exactly sure","example[21]":"I’m not exactly sure when the funeral is.","collocation[5]":"not very/too sure","example[22]":"Make a list of any words or phrases whose meaning you are not too sure about.","collocation[6]":"not at all sure","example[23]":"By now, we were not at all sure where we were.","definition[3]":"believing that something is definitely true or correct","example[24]":"I’m sure that you’re right.","example[25]":"‘The car was a BMW.’ ‘Are you sure?’","example[26]":"I’m not sure what the best thing to do is.","definition[4]":"completely sure. Certain  is more formal than sure, and it is very commonly used in writing","example[27]":"The police were certain that they had found the killer.","example[28]":"I think he’s married, but I’m not certain about it.","display[0]":"convinced","definition[5]":"sure that something is true, even though you cannot prove it","example[29]":"She became convinced that her boyfriend was seeing someone else.","example[30]":"Brown’s wife was convinced of his innocence.","definition[6]":"completely sure that something is true, especially when other people are not sure","example[31]":"She said she was positive that the exam was next Tuesday.","example[32]":"I’m absolutely positive I haven’t made a mistake.","display[1]":"satisfied","definition[7]":"sure that you know the truth about something that has happened, because you have enough information","example[33]":"The authorities are now satisfied that her death was an accident.","display[2]":"confident","definition[8]":"sure that something good will happen or that you will achieve something","example[34]":"Doctors are confident that he’ll make a full recovery.","example[35]":"A spokesman said the government was confident of winning the vote.","display[3]":"have no doubt","definition[9]":"to have no doubts in your mind about something","example[36]":"I have no doubt that his story is true.","example[37]":"He was in no doubt about what he should do next.","display[4]":"know","definition[10]":"to have a strong feeling that something is true or correct","example[38]":"I just know that she will love this necklace.","example[39]":"When the phone rang, we knew something terrible must have happened.","signpost[4]":"yes","definition[11]":"used to say ‘yes’ to someone","example[40]":"‘Can you give me a ride to work tomorrow?’ ‘Sure.’","signpost[5]":"accept thanks","definition[12]":"used as a reply when you accept thanks from someone","example[41]":"‘Thanks for your help, Karen.’ ‘Sure.’","signpost[6]":"emphasize","definition[13]":"used to emphasize a statement","example[42]":"It sure is hot out here.","example[43]":"I sure hope they get there all right.","signpost[7]":"before statement","definition[14]":"used at the beginning of a statement admitting that something is true, especially before adding something very different","example[44]":"Sure Joey’s happy now, but will it last?"}