{"past_tense[0]":"left","signpost[0]":"go away","definition[0]":"to go away from a place or a person","example[0]":"My baby gets upset when I leave the room.","example[1]":"Before leaving the train, make sure you have all your belongings with you.","example[2]":"Leave the motorway at Junction 7.","example[3]":"My youngest boy has not left my side (=has stayed near me) since his daddy was killed.","example[4]":"If he left immediately, he’d catch the 7.30 train.","note[0]":"leave (something/somebody) soon/now/later etc","example[5]":"Just a few more questions, then we’ll leave you in peace.","note[1]":"leave somebody in peace","example[6]":"The plane leaves at 12.30.","note[2]":"leave at","example[7]":"I tried calling him, but he’d already left for work.","note[3]":"leave for","example[8]":"Frances left work early to meet her mother.","note[4]":"leave (something/somebody) to do something","example[9]":"Never leave children playing near water unattended.","note[5]":"leave somebody doing something","example[10]":"I’ll leave you to it (=go away and let you continue with what you are doing).","note[6]":"leave somebody to something","definition[1]":"if you leave your job, home, school etc, you permanently stop doing that job, living at home etc","example[11]":"Over the past two years, 20 staffers have left.","example[12]":"How old were you when you left home  (=your parents’ home)?","note[7]":"leave home/school/college etc","example[13]":"My daughter got a job after she left school.","example[14]":"The lawsuit will be postponed until the president leaves office.","example[15]":"Many missionaries were forced to leave the country.","note[8]":"leave a job/country/Spain etc","example[16]":"It seems that Tony has left the band for good (=permanently).","example[17]":"Laura left her native England to live in France.","note[9]":"leave (somebody/something) to do something","signpost[1]":"let something/somebody stay","definition[2]":"to make or allow something or someone to stay in a place when you go away","example[18]":"She left her son in the care of a friend.","example[19]":"The girl had been attacked and left for dead.","note[10]":"leave somebody for dead","example[20]":"Are you leaving the kids with Grandma on Saturday?","note[11]":"leave something/somebody in/with/behind etc","example[21]":"As soon as I’d shut the door, I realized I’d left the keys inside.","example[22]":"Did anybody leave a jacket behind last night?","example[23]":"He left Ruth to find her own way home.","note[12]":"leave somebody to do something","example[24]":"Students were left to their own devices (=left alone and allowed to do whatever they wanted) for long periods.","signpost[2]":"not change/move something","definition[3]":"to let something remain in a particular state, position, or condition","example[25]":"The trial left many questions unanswered.","example[26]":"Don’t leave tools lying about.","example[27]":"I wish you’d stop leaving the door open.","note[13]":"leave something open/empty/untidy etc","example[28]":"Leave the next two lines blank for the tutor’s comments.","note[14]":"leave a space/gap etc","example[29]":"Drivers should always leave room for cyclists.","example[30]":"You’ve left your lights on.","note[15]":"leave something on/off/out etc","example[31]":"She must have left the phone off the hook.","example[32]":"I’ll just leave the engine running while I go in.","note[16]":"leave something doing something","example[33]":"Leave the pots to soak overnight.","note[17]":"leave something to do something","signpost[3]":"result of accident/illness/event","definition[4]":"if an event, accident, illness etc leaves you in a particular condition, you are in that condition because of it","example[34]":"An explosion at a chemical plant has left one worker dead and four injured.","example[35]":"Although the infection cleared up, he was left with a persistent cough.","note[18]":"leave somebody with something","example[36]":"The incident left her feeling confused and hurt.","example[37]":"The announcement has left shareholders nursing huge losses.","signpost[4]":"letter/message/thing","definition[5]":"to deliver a message, note, package etc for someone or put it somewhere so that they will get it later","example[38]":"She left a message on his answerphone.","example[39]":"Can you leave me some money for the bus?","note[19]":"leave somebody something","example[40]":"Ian left this note with me.","note[20]":"leave something with somebody","example[41]":"A guy left these flowers for you.","note[21]":"leave something for somebody","signpost[5]":"delay","definition[6]":"to not do something or to do it later than you intended","example[42]":"Leave the dishes. I’ll do them later.","example[43]":"So much had been left undone.","example[44]":"I want to think about it. Can I leave it for now?","example[45]":"I’m afraid you’ve left it too late to change your ticket.","example[46]":"If you leave your preparation until the last minute, you’ll reduce your chances of passing.","note[22]":"leave something until the last minute/until last","example[47]":"I left the best bit until last.","example[48]":"Let’s leave it at that for today.","note[23]":"leave it at that","signpost[6]":"let somebody decide/be responsible","definition[7]":"to let someone else decide something or be responsible for something","example[49]":"He’s not the sort to leave things to chance (=take no action and just wait to see what happens).","example[50]":"You leave me with no choice but to fire you.","note[24]":"leave somebody with no choice/option","example[51]":"Leave it to me. I’ll make sure it gets posted.","note[25]":"leave something to somebody","example[52]":"The choice of specialist subject is left entirely to the students.","example[53]":"I’ll leave it up to you to decide.","note[26]":"leave it (up) to somebody to do something","example[54]":"She leaves it to the reader to draw their own conclusions.","example[55]":"Is it okay if I leave writing the results to you?","note[27]":"leave doing something to somebody","example[56]":"Leave it with me, I’ll fix it for you.","example[57]":"Clive moved to London, leaving Edward to run the Manchester office.","signpost[7]":"husband/wife etc","definition[8]":"to stop living with or having a relationship with your husband, partner etc","example[58]":"Martha was always threatening to leave, but I never believed her.","example[59]":"Mr Rushworth left his partner of 10 years for a younger woman.","note[28]":"leave somebody for somebody","signpost[8]":"when you die","definition[9]":"to arrange for someone to receive your money, property etc after you die","example[60]":"Aunt Alice died, leaving almost $5 million.","example[61]":"Hugo left me his mother’s ring.","example[62]":"In his will, he had left all his children a small sum of money.","example[63]":"Have you thought of leaving a gift to charity after you die?","note[29]":"leave something to somebody/something","definition[10]":"used when someone dies before their wife, children etc","example[64]":"PC Davis leaves a wife and three small children.","definition[11]":"to make a mark that remains afterwards","example[65]":"He staggered to the door, leaving a trail of blood.","example[66]":"Make sure that you don’t leave any footprints.","example[67]":"The wine had left a permanent mark on the tablecloth.","note[30]":"leave a mark/stain/scar etc","signpost[9]":"not eat/drink","definition[12]":"if you leave food or drink that you have been given, you do not eat or drink it","example[68]":"‘I’m really hungry now.’ ‘That’s because you left half your lunch.’","example[69]":"He rose from the table, leaving his brandy untouched.","definition[13]":"in a sum, to have a particular amount remaining","example[70]":"Three from seven leaves four.","heading[0]":"to leave a place","example[71]":"Just as I was leaving the house, the phone rang.","example[72]":"We left early to avoid the traffic.","display[0]":"go","definition[14]":"to leave somewhere","example[73]":"Come on, boys, it’s time to go.","example[74]":"When does the next bus go?","display[1]":"set off","definition[15]":"to leave somewhere and begin a journey","example[75]":"The following day we set off for Vienna.","display[2]":"take off","definition[16]":"if a plane takes off, it leaves the ground at the beginning of a flight","example[76]":"Our plane took off late because of the fog.","display[3]":"emigrate","definition[17]":"to leave your own country in order to live permanently in another country","example[77]":"In 2002, his family emigrated to New Zealand.","display[4]":"depart","definition[18]":"to leave – used especially about trains, buses, planes etc","example[78]":"Coaches depart for the airport every 30 minutes.","heading[1]":"to leave school/college etc","definition[19]":"to finish studying at school or college, usually at the age or time when people normally finish","example[79]":"When James left school, he worked for a while with his father.","example[80]":"She found it hard to get a job after leaving university.","display[5]":"graduate","definition[20]":"to successfully finish your studies at a college or university, or at an American high school","example[81]":"Kelly graduated from Harvard with a degree in East Asian Studies.","example[82]":"Approximately 80% of Americans graduate from high school.","display[6]":"drop out","definition[21]":"to leave school, college, or university before your course of study has finished, because you do not want to continue with it","example[83]":"I failed my first year exams and decided to drop out and get a job.","display[7]":"quit","definition[22]":"to leave school without finishing your course of study","example[84]":"He quit school at fourteen to work and help support his family.","heading[2]":"leave your job","example[85]":"I left my last job because the salary was so low.","example[86]":"Why don’t you just leave?","definition[23]":"to leave your job permanently because you are not happy with it","example[87]":"After enduring months of harassment, Mrs Collins decided to quit her job.","example[88]":"I’ve told them I’m quitting.","display[8]":"resign","definition[24]":"to officially announce that you have decided to leave your job","example[89]":"The company director was forced to resign over the scandal.","display[9]":"hand in your notice/resignation","definition[25]":"to write an official letter to your employer saying that you are going to leave your job on a particular date","example[90]":"You have to hand in your notice at least four weeks before you leave.","display[10]":"retire","definition[26]":"to leave your job in order to stop working permanently, usually because you have reached the age when most people stop working","example[91]":"After forty years of working for the bank, Karl retired in May.","example[92]":"He had to retire because of ill health.","signpost[10]":"holiday","definition[27]":"time that you are allowed to spend away from your work, especially in the armed forces","example[93]":"I’ve applied for three days’ leave.","example[94]":"Your basic annual leave is 20 days.","example[95]":"navy officers home on leave","note[31]":"on leave","signpost[11]":"permission","definition[28]":"permission to do something","example[96]":"All this was done entirely without my leave.","example[97]":"He asked leave to speak to her in private.","note[32]":"grant/obtain/ask/seek etc leave (to do something)","example[98]":"a petition for leave to appeal to the European court","note[33]":"leave to do something","form[0]":"ADJECTIVES/NOUN + leave","collocation[0]":"annual leave","example[99]":"Annual leave is 22 days plus public holidays.","collocation[1]":"maternity leave","example[100]":"Two teachers were off on maternity leave.","collocation[2]":"paternity leave","example[101]":"He got five days’ paternity leave.","collocation[3]":"parental leave","example[102]":"Parental leave is often unpaid.","collocation[4]":"sick leave","example[103]":"The form must be filled in as soon as you return from sick leave.","collocation[5]":"compassionate leave","example[104]":"Eileen was given compassionate leave to go to the funeral.","collocation[6]":"paid/unpaid leave","example[105]":"She took three days unpaid leave in order to help her daughter.","collocation[7]":"home leave","example[106]":"Roberts had failed to return from home leave, and there was a warrant out for his arrest.","collocation[8]":"shore leave","example[107]":"Hong Kong was a popular place for shore leave.","collocation[9]":"special leave","example[108]":"Some firms grant special leave when you move house.","collocation[10]":"study leave","example[109]":"The company offers study leave for staff development.","collocation[11]":"sabbatical leave","example[110]":"Headteachers can take sabbatical leave every five years.","collocation[12]":"indefinite leave","example[111]":"She has gone on indefinite leave, suffering from exhaustion.","collocation[13]":"leave entitlement","example[112]":"The normal paid leave entitlement is 20 days.","collocation[14]":"have/get leave","example[113]":"How much annual leave do you get?","collocation[15]":"be entitled to leave","example[114]":"After five years, employees are entitled to 25 days’ leave.","collocation[16]":"go on leave","example[115]":"I’ll get the report to you before you go on leave.","collocation[17]":"take leave","example[116]":"I don’t think I’ll be able to take any leave in January because we’re too busy.","collocation[18]":"use (up) leave","example[117]":"I used all my leave in the summertime.","collocation[19]":"give/grant somebody leave","example[118]":"He was given compassionate leave.","collocation[20]":"cancel somebody’s leave","example[119]":"The Police Department cancelled all leave because of the emergency.","definition[29]":"time that you are allowed to be absent from your work","example[120]":"The company offers attractive benefits, including five weeks’ leave per year.","example[121]":"The Los Gatos School District has hired 21 new teachers to replace those who are on leave."}