{"word[0]":"permission","definition[0]":"if you have permission to do something, you are officially allowed to do it","example[0]":"Photographs should only be taken with the permission of the subject.","example[1]":"You'll have to get permission from your parents if you want to come.","note[0]":"permission from","example[2]":"The Council refused permission for the development.","note[1]":"permission for","collocation[0]":"have permission to do something","example[3]":"They did not have permission to build on the land.","collocation[1]":"ask (for) permission","example[4]":"Tommy asked for permission to go to the bathroom.","example[5]":"Captain Miller requested permission to land.","collocation[2]":"apply for permission","example[6]":"The company has applied for permission to drill for oil.","collocation[3]":"get permission","example[7]":"We'll need to get permission to film in the museum.","example[8]":"You must obtain permission from the owners before viewing the property.","collocation[4]":"give permission","example[9]":"The city authorities gave permission for the rally to take place.","example[10]":"In 1961, he was granted permission to emigrate to Israel.","collocation[5]":"refuse/deny (somebody) permission","example[11]":"Betty's father refused her permission to attend the dance.","collocation[6]":"seek permission","example[12]":"People wanting to visit the island have to seek permission from the authorities.","collocation[7]":"need permission","example[13]":"You'll need written permission from your parents first.","collocation[8]":"written permission","example[14]":"Doctors need written permission from the patient before they can operate.","collocation[9]":"special permission","example[15]":"The paintings cannot be taken out of Russia without special permission.","collocation[10]":"official permission","example[16]":"Mr Murphy was granted official permission to travel to North Korea.","collocation[11]":"planning permission","example[17]":"The bank has applied for planning permission to redevelop a 1¼-acre site.","collocation[12]":"express permission","example[18]":"He is not to leave without my express permission.","collocation[13]":"without permission","example[19]":"Pages should not be copied without the permission of the publisher.","collocation[14]":"with somebody's permission","example[20]":"With your permission, I'd like to talk to your son alone.","collocation[15]":"by kind permission of somebody","example[21]":"This photograph is reproduced by kind permission of Country Living.","explanation[0]":"Permission is normally used as an uncountable noun","example[22]":"Permission was granted for the interview","bad_example[0]":"a permission was granted","bad_example[1]":"the permission was granted","explanation[1]":"The plural form permissions is also sometimes used when talking about official written statements allowing someone to do something","example[23]":"The company needs to obtain all the necessary permissions before it can start drilling for oil","definition[1]":"when someone is officially told that they are allowed to do something","example[24]":"The Board denied the company permission to build the pipeline.","note[2]":"permission to do something","example[25]":"The officer approved $4.5 million in loans without getting the bank’s permission.","example[26]":"Airlines need their own government’s permission for internal flights."}