{"word[0]":"upset","definition[0]":"unhappy and worried because something unpleasant or disappointing has happened","example[0]":"She was deeply upset about the way her father treated her.","note[0]":"upset by/about/at etc","example[1]":"Debbie was upset that he didn’t spend more time with her.","note[1]":"upset that","example[2]":"Miss Hurley is too upset to speak to anyone at the moment.","example[3]":"She’s still deeply upset about her uncle’s death.","example[4]":"He’s upset that he didn’t get an invitation to their wedding.","display[0]":"hurt","definition[1]":"upset and shocked because someone has been unkind to you, especially someone that you trusted and thought was a friend","example[5]":"Bill felt deeply hurt when he realized she had lied to him.","example[6]":"Gretta was really hurt that none of her friends came to visit her in the hospital.","example[7]":"Jackson was said to be ‘deeply hurt’ by the newspaper reports about him.","example[8]":"He had a hurt expression on his face.","display[1]":"distressed","definition[2]":"very upset","example[9]":"Priests have been counselling distressed relatives of the victims.","example[10]":"She was visibly distressed after hearing of her husband’s accident.","example[11]":"Matilda was too distressed to speak.","display[2]":"distraught","definition[3]":"so upset and worried that you are unable to do normal things, and nothing can make you feel calm","example[12]":"Benson was so distraught over the breakup of his marriage that he felt like committing suicide.","example[13]":"The distraught parents of the missing baby have made a public appeal for her return.","display[3]":"in a (terrible) state","definition[4]":"so upset that you cannot stop crying","example[14]":"She called me one night in a terrible state, saying she wanted to die.","example[15]":"I could see that she was in a bit of a state.","display[4]":"be worked up","definition[5]":"to be very upset or angry, so that you think things are worse than they really are","example[16]":"I was too worked up to sleep.","example[17]":"It’s not worth getting worked up about. Anyone can make a mistake.","signpost[0]":"make somebody unhappy","definition[6]":"to make someone feel unhappy or worried","example[18]":"Don’t do anything that would upset him.","example[19]":"It upsets me to see you cry.","note[2]":"it upsets somebody that/when/to do","signpost[1]":"change something","definition[7]":"to change a plan or situation in a way that causes problems","example[20]":"The chemicals upset the balance of the environment.","signpost[2]":"make something fall","definition[8]":"to push something over without intending to","example[21]":"He upset a bowl of soup.","definition[9]":"to defeat an opponent who is considered to be much better than you","example[22]":"Jones upset the 40th-ranked American, Cunningham.","definition[10]":"worry and unhappiness caused by an unexpected problem","example[23]":"If you are the victim of a burglary, the emotional upset can affect you for a long time.","definition[11]":"when a person or team defeats an opponent who is considered to be much better than them","example[24]":"There was a major upset when the young skater took the gold medal."}