{"word[0]":"chill","definition[0]":"a feeling of coldness","example[0]":"There was a slight chill in the air.","example[1]":"I turned on the heater in the hall to take the chill off the house  (=to heat it slightly).","example[2]":"Suddenly aware of the morning chill, she closed the window.","note[0]":"morning/autumnal/January etc chill","example[3]":"He sat in the chill of the evening, staring out over the city below.","note[1]":"chill of","definition[1]":"a sudden feeling of fear or worry, especially because of something cruel or violent","example[4]":"The sound of his dark laugh sent a chill through her.","example[5]":"There was something in his tone that sent a chill down Melissa’s spine (=made her very frightened).","example[6]":"Fay felt a chill of fear as she watched Max go off with her daughter.","note[2]":"chill of fear/apprehension/disquiet etc","definition[2]":"an illness which causes a slight fever, headache, and shivering (=slight shaking of the body)","example[7]":"Let’s get these wet clothes off you before you catch a chill.","definition[3]":"a feeling of being cold, caused by being ill","definition[4]":"if you chill something such as food or drink, or if it chills, it becomes very cold but does not freeze","example[8]":"Spoon the mixture into a bowl and chill for two hours.","example[9]":"The longer this salad chills, the better the flavour.","definition[5]":"to relax completely instead of feeling angry, tired, or nervous","example[10]":"‘Hold it! Just chill for a second, won’t you!’","example[11]":"I spent the afternoon chilling out in front of the TV.","definition[6]":"to make someone very cold","example[12]":"The wind blew across her body, chilling her wet skin.","example[13]":"Come and sit by the fire – you look chilled to the bone.","note[3]":"chilled to the bone/marrow","definition[7]":"to suddenly frighten someone, especially by seeming very cruel or violent","example[14]":"The anger in his face chilled her.","example[15]":"He jerked his head round and saw something that chilled his blood.","note[4]":"chill somebody to the bone/chill somebody to the marrow/chill somebody’s blood","definition[8]":"unpleasantly cold","example[16]":"the chill night air","example[17]":"a chill wind"}