{"word[0]":"employment","definition[0]":"the condition of having a paid job","example[0]":"She was offered employment in the sales office.","example[1]":"terms and conditions of employment","example[2]":"Steve’s still looking for full-time employment.","example[3]":"the needs of women who combine paid employment and care for their families","example[4]":"The employment prospects for science graduates are excellent.","note[0]":"employment opportunities/prospects","example[5]":"21.7% of all those in employment were in part-time jobs.","note[1]":"in employment","definition[1]":"the act of paying someone to work for you","example[6]":"Mexican law prohibits the employment of children under 14.","note[2]":"employment of","definition[2]":"the number of people who have jobs","opposite[0]":"unemployment","example[7]":"Nationwide employment now stands at 95%.","example[8]":"Many economists consider full employment an unrealistic goal.","note[3]":"full employment","definition[3]":"the use of a particular object, method, skill etc to achieve something","example[9]":"Was the employment of force justified?","collocation[0]":"paid employment","example[10]":"51% of women return to paid employment within 5 years of having a child.","collocation[1]":"full-time/part-time employment","example[11]":"Mike is in full-time employment, but his wife is not working.","collocation[2]":"permanent/temporary employment","example[12]":"university graduates entering permanent employment for the first time","collocation[3]":"long-term/regular employment","example[13]":"She finally found regular employment at a hospital in York.","collocation[4]":"continuous employment","example[14]":"You can join the pension scheme after two years of continuous employment with the company.","collocation[5]":"give/offer somebody employment","example[15]":"He was offered employment in the company’s main office.","collocation[6]":"provide employment","example[16]":"The new power station will provide employment for around 400 people.","collocation[7]":"create employment","example[17]":"The government is trying to stimulate the economy and create employment.","collocation[8]":"find/get employment","example[18]":"The men hope to find employment in the construction industry.","collocation[9]":"obtain/secure employment","example[19]":"He found it difficult to obtain employment because of his criminal record.","collocation[10]":"look for employment","example[20]":"My son had to leave the farm and seek employment elsewhere.","form[0]":"employment + NOUN","collocation[11]":"employment opportunities","example[21]":"There are very few employment opportunities in the area.","collocation[12]":"employment prospects","example[22]":"Better qualifications will improve your employment prospects.","collocation[13]":"employment rights","example[23]":"Part-time workers don’t have the same employment rights as full-time staff.","collocation[14]":"employment levels","example[24]":"Employment levels in the region are above the national average.","collocation[15]":"employment conditions","example[25]":"All workers have a right to a fair wage and decent conditions of employment.","collocation[16]":"an employment contract","example[26]":"There is a clause in your employment contract covering holiday entitlement.","collocation[17]":"employment terms","example[27]":"It’s in the terms of their employment that they can’t go on strike.","collocation[18]":"loss of employment","example[28]":"Closure of the factory will lead to a substantial loss of employment.","collocation[19]":"somebody’s place of employment","example[29]":"They had a long journey to their place of employment.","definition[4]":"work that you do to earn money","example[30]":"students seeking employment after college","example[31]":"Part-time employment was often the only paid employment women could find.","definition[5]":"the number of people in an area or a country who have jobs, the types of jobs they have etc","example[32]":"Nationwide, employment now stands at 3.5%."}