{"word[0]":"bid","definition[0]":"an offer to pay a particular price for something, especially at an auction","example[0]":"the person who places the highest bid","example[1]":"We’ve made a bid of nearly £400 million for the company.","example[2]":"A takeover bid for the airline was launched today.","example[3]":"They put in a bid for the house.","note[0]":"bid for","definition[1]":"an offer to do work or provide services for a specific price","example[4]":"rival bids for the cleaning contract","definition[2]":"an attempt to achieve or obtain something","example[5]":"a bid for power","example[6]":"a desperate bid to free herself from a loveless marriage","note[1]":"a bid to do something","definition[3]":"a statement of how many points you hope to win in a card game","collocation[0]":"put in a bid","example[7]":"A big property developer has put in a bid for the land.","collocation[1]":"place a bid","example[8]":"The gallery placed the highest bid of $2.5 million.","collocation[2]":"make a bid","example[9]":"Paramount made a bid for the film rights to the book.","collocation[3]":"accept a bid","example[10]":"The auctioneer may refuse to accept any bid below a certain price.","form[0]":"ADJECTIVES/NOUN + bid","collocation[4]":"a high/low bid","example[11]":"There were several high bids for the painting.","collocation[5]":"an opening bid","example[12]":"The opening bid was only $10.","collocation[6]":"a final bid","example[13]":"The unknown man was successful with a final bid of £9,500.","collocation[7]":"a takeover bid","example[14]":"Staff are afraid that the takeover bid will threaten some of their jobs.","collocation[8]":"a hostile bid","example[15]":"Airtours launched a £221m hostile bid for Owners Abroad.","definition[4]":"to offer to pay a particular price for goods, especially in an auction","example[16]":"She bid £100 for a Victorian chair.","note[2]":"bid (somebody) something for something","example[17]":"What am I bid for lot 227? Shall we start at $500?","example[18]":"The two men ended up bidding against each other at the auction.","note[3]":"bid against","definition[5]":"to offer to do work or provide services for a specific price, in competition with other offers","example[19]":"Three firms bid for the contract on the new buildings.","definition[6]":"to say how many points you think you will win in a game of cards","past_tense[0]":"bade","definition[7]":"to order or tell someone what to do","example[20]":"The queen bade us enter.","note[4]":"bid somebody (to) do something","definition[8]":"a price offered to buy something such as goods, property, shares, or bonds","example[21]":"bids from buyers in the auction rooms","example[22]":"Bids for the bonds totalled M$2.26 billion.","example[23]":"Its shares were quoted yesterday at a bid price of 31 cents a share.","definition[9]":"an offer by one company to buy another, or the value of this offer","example[24]":"It made a bid for the company at C$23.50 a share.","example[25]":"The football club accepted a £24 million takeover bid from Soccer Investments.","example[26]":"Its directors rejected the offer, saying the bid price significantly undervalues the company.","definition[10]":"an offer to do work or provide services for a fixed price, in competition with other offers","example[27]":"Carlisle invited bids to run the whole hospital.","example[28]":"The company did not put in a bid for the contract.","definition[11]":"to offer to pay a particular price for something such as goods, property, or bonds","example[29]":"He bid £69,000 at Sotheby’s for an 18th century wine glass.","note[5]":"bid (something) for something","definition[12]":"to offer to buy a large number of shares in a company and so take over the company","example[30]":"The company is bidding 910p a share for control of AB Ports, in a deal worth an estimated £2.8 billion.","definition[13]":"to offer to do work or provide services for a fixed price, in competition with others","example[31]":"Investors have bid a record amount of cash for Venezuela’s oil operating licences.","example[32]":"The government has invited companies to bid for gas exploration rights in the west of the country."}