{"word[0]":"destroy","definition[0]":"to damage something so badly that it no longer exists or cannot be used or repaired","note[0]":"destroy somebody’s confidence/hope/faith etc","example[0]":"companies that are polluting and destroying the environment","example[1]":"The school was completely destroyed by fire.","note[1]":"completely/totally destroy","definition[1]":"if something destroys someone, it ruins their life completely","example[2]":"The scandal destroyed Simmons and ended his political career.","definition[2]":"to defeat an opponent easily","example[3]":"The Bears destroyed the Detroit Lions 35–3.","definition[3]":"to kill an animal, especially because it is ill or dangerous","example[4]":"One of the bulls had to be destroyed.","collocation[0]":"destroy the evidence","example[5]":"They set light to the car to destroy the evidence.","collocation[1]":"destroy the environment","example[6]":"Some of these companies are polluting and destroying the environment.","collocation[2]":"destroy the world/planet","example[7]":"No one wants another war, which might destroy the world.","collocation[3]":"destroy somebody’s career","example[8]":"She made one bad mistake and it destroyed her career.","collocation[4]":"destroy somebody’s reputation","example[9]":"The scandal destroyed his reputation.","collocation[5]":"destroy the character of something","example[10]":"New buildings have destroyed much of the character of the area.","collocation[6]":"destroy somebody’s hopes","example[11]":"Losing the game destroyed the team’s hopes of reaching the semi-finals.","collocation[7]":"destroy somebody’s confidence","example[12]":"When he failed his degree, it completely destroyed his confidence.","collocation[8]":"completely/totally destroy something","example[13]":"The plane was completely destroyed when it hit a mountain.","collocation[9]":"partially destroy something","example[14]":"The Great Fire of 1666 partially destroyed the prison.","collocation[10]":"be destroyed by fire/a bomb/earthquake etc","example[15]":"The building was destroyed by fire in 2004.","example[16]":"The earthquake almost completely destroyed the city.","example[17]":"The twin towers were destroyed in a terrorist attack.","display[0]":"devastate","definition[4]":"to damage a large area very badly and destroy many things in it","example[18]":"Allied bombings in 1943 devastated the city.","example[19]":"The country’s economy has been devastated by years of fighting.","display[1]":"demolish","definition[5]":"to completely destroy a building, either deliberately or by accident","example[20]":"The original 15th century house was demolished in Victorian times.","example[21]":"The plane crashed into a suburb of Paris, demolishing several buildings.","display[2]":"flatten","definition[6]":"to destroy a building or town by knocking it down, bombing it etc, so that nothing is left standing","example[22]":"The town centre was flattened by a 500 lb bomb.","display[3]":"wreck","definition[7]":"to deliberately damage something very badly, especially a room or building","example[23]":"The toilets had been wrecked by vandals.","example[24]":"They just wrecked the place.","display[4]":"trash","definition[8]":"to deliberately destroy a lot of the things in a room, house etc","example[25]":"Apparently, he trashed his hotel room while on drugs.","display[5]":"obliterate","definition[9]":"to destroy a place so completely that nothing remains","example[26]":"The nuclear blast obliterated most of Hiroshima.","display[6]":"reduce something to ruins/rubble/ashes","definition[10]":"to destroy a building or town completely","example[27]":"The town was reduced to rubble in the First World War.","display[7]":"ruin","definition[11]":"to spoil something completely, so that it cannot be used or enjoyed","example[28]":"Fungus may ruin the crop.","example[29]":"The new houses will ruin the view."}