{"signpost[0]":"idea","definition[0]":"a single fact, idea, or opinion that is part of an argument or discussion","example[0]":"That’s a very interesting point.","example[1]":"She made some extremely good points.","example[2]":"There are three important points we must bear in mind.","example[3]":"This brings me to my next point.","example[4]":"I agree with John’s point about keeping the costs down.","note[0]":"point about","signpost[1]":"purpose","definition[1]":"the purpose or aim of something","example[5]":"I suppose we could save one or two of the trees, but what’s the point?","example[6]":"There’s no point in worrying.","example[7]":"We’re going to lose anyway, so I can’t see the point of playing.","example[8]":"I didn’t see the point in moving to London.","example[9]":"What’s the point of this meeting anyway?","note[1]":"point of","example[10]":"The whole point of this legislation is to protect children.","definition[2]":"a particular place or position","example[11]":"The accident happened at the point where the A15 joins the M1.","example[12]":"No cars are allowed beyond this point.","example[13]":"a border crossing point","example[14]":"Cairo is a convenient departure point for tours.","example[15]":"Dover is a point of entry into Britain.","signpost[2]":"in time/development","definition[3]":"an exact moment, time, or stage in the development of something","example[16]":"I had reached a point in my career where I needed to decide which way to go.","example[17]":"She had got to the point where she felt that she could not take any more.","example[18]":"Their win over old rivals Manchester United was the high point (=best part) in their season.","example[19]":"Sales reached a low point in 1996.","example[20]":"We will take last week’s riots as a starting point for our discussion.","example[21]":"At one point, I thought he was going to burst into tears.","example[22]":"Maybe at this point we should move onto some of the practical experiments.","example[23]":"At that point, I was still living at home and had no job.","example[24]":"You will probably sell the car at some point in the future.","example[25]":"It is impossible to give a definite answer at this point in time.","example[26]":"Some children are bullied to the point of suicide  (=until they reach this stage).","signpost[3]":"quality/feature","definition[4]":"a particular quality or feature that something or someone has","example[27]":"The low price is one of its main selling points (=features that will help to sell it).","example[28]":"Driving was not one of Baxter’s strong points.","example[29]":"One of the club’s plus points is that it is central.","example[30]":"There were some weak points in his argument.","example[31]":"Sometimes she had to remind herself of his good points.","note[2]":"somebody’s/something’s good/bad points","example[32]":"They would spend hours discussing the finer points (=small details about qualities and features) of various cars.","signpost[4]":"games/sport","definition[5]":"one of the marks or numbers that shows your score in a game or sport","example[33]":"He is three points behind the leader.","example[34]":"Leeds United are now six points clear at the top of the table.","example[35]":"She had to win this point.","example[36]":"You get three points for a win and one point for a draw.","example[37]":"You lose a point if you do not complete the puzzle on time.","example[38]":"The fight went the full fifteen rounds, and in the end the American won on points.","signpost[5]":"sharp end","definition[6]":"a sharp end of something","example[39]":"the sharp point of a spear","signpost[6]":"numbers","definition[7]":"a sign (.) used to separate a whole number from any decimals that follow it","signpost[7]":"measure on a scale","definition[8]":"a mark or measure on a scale","example[40]":"The stock market has fallen by over 200 points in the last week.","signpost[8]":"small spot","definition[9]":"a very small spot of light or colour","example[41]":"The stars shone like points of light in the sky.","definition[10]":"one of the marks on a compass that shows direction","example[42]":"Soldiers were advancing on us from all points of the compass.","signpost[9]":"piece of land","definition[11]":"a long thin piece of land that stretches out into the sea","example[43]":"We sailed round the point into a small, sheltered bay.","definition[12]":"a piece of plastic with holes in it which is attached to a wall and to which electrical equipment can be connected","example[44]":"a telephone point","example[45]":"an electrical point","heading[0]":"– Meaning 1: a single fact, idea, or opinion that is part of an argument or discussion","collocation[0]":"a good point","example[46]":"I think that’s a very good point.","collocation[1]":"an interesting point","example[47]":"He has made an interesting point.","collocation[2]":"an important point","example[48]":"That’s an important point to bear in mind.","collocation[3]":"a serious point","example[49]":"He’s making a joke but there is a serious point there as well.","collocation[4]":"a valid point","example[50]":"She raised a number of valid points.","collocation[5]":"a general point","example[51]":"I’d like to make one further general point.","collocation[6]":"a similar point","example[52]":"Kevin Phillips made a similar point in his 1993 book, ‘Boiling Point’.","collocation[7]":"the main point","example[53]":"Finally, I will summarise the main points of this chapter.","collocation[8]":"one final/last point","example[54]":"There is one final point I would like to make.","collocation[9]":"make a point","example[55]":"He makes the point that predicting behaviour is not easy.","collocation[10]":"put/get your point across","example[56]":"I think we got our point across.","collocation[11]":"raise a point","example[57]":"I was going to raise that point.","collocation[12]":"illustrate/demonstrate a point","example[58]":"A simple example will illustrate the point.","collocation[13]":"prove your/a point","example[59]":"He was determined to prove his point.","collocation[14]":"understand a point","example[60]":"I’m sorry, I don’t understand your point.","collocation[15]":"see/take/get somebody’s point","example[61]":"OK, I take your point. But it’s not that easy.","collocation[16]":"have a point","example[62]":"Maybe she has a point.","collocation[17]":"labour the point","example[63]":"I don’t wish to labour the point, but why didn’t you just tell me?","collocation[18]":"clarify a point","example[64]":"Could you clarify a couple of points for me?","collocation[19]":"point taken","example[65]":"All right, point taken – I should have asked you first.","collocation[20]":"the finer points of something","example[66]":"I’m afraid I don’t understand the finer points of the game.","collocation[21]":"the point is (that) ...","example[67]":"The point is that going by bus would be a lot cheaper.","collocation[22]":"that’s the (whole) point","example[68]":"That’s the point. She didn’t tell us what was going on.","collocation[23]":"that's not the point","example[69]":"We'd earn a lot of money, but that's not the point.","collocation[24]":"be beside the point","example[70]":"He's the best person for the job so his age is beside the point.","collocation[25]":"more to the point","example[71]":"When did she leave, and, more to the point, why?","collocation[26]":"get/come (straight) to the point","example[72]":"I haven't got much time so let's get straight to the point.","collocation[27]":"get the point","example[73]":"He didn’t get the point at first.","collocation[28]":"miss the point","example[74]":"I don't know why but Mel always seems to miss the point.","heading[1]":"– Meaning 5: an exact moment, time, or stage in the development of something","collocation[29]":"reach a point","example[75]":"Some couples reach a point where divorce is the only solution.","collocation[30]":"get to a point","example[76]":"You get to the point where ordinary things like climbing stairs are difficult.","collocation[31]":"mark a high/low/turning etc point","example[77]":"The day of the accident marked a turning point in Kenny’s life.","form[0]":"ADJECTIVES/NOUN + point","collocation[32]":"a high point","example[78]":"Winning the World Championship was the high point of my career.","collocation[33]":"a low point","example[79]":"She helped me when I was at a low point in my life.","collocation[34]":"a starting point","example[80]":"The following recipes are a good starting point for making your own bread.","collocation[35]":"a turning point","example[81]":"A turning point in the history of the republic came in 1358.","collocation[36]":"crisis point","example[82]":"The tensions within the country have reached crisis point.","collocation[37]":"breaking point","example[83]":"Our resources are stretched to breaking point.","collocation[38]":"bursting point","example[84]":"The hospital was full to bursting point.","collocation[39]":"saturation point","example[85]":"Is the market for computer games reaching saturation point?","collocation[40]":"at one point","example[86]":"At one point I was thinking of studying physics.","collocation[41]":"at some point","example[87]":"Over half the population suffers from back pain at some point in their lives.","collocation[42]":"at this/that point","example[88]":"I’m not prepared at this point to make any decision.","collocation[43]":"at this/that point in time","example[89]":"It would be wrong to comment at this point in time.","collocation[44]":"to the point of something","example[90]":"British industry was driven to the point of collapse.","collocation[45]":"there comes a point when/where ...","example[91]":"There comes a point where you have to accept defeat.","heading[2]":"– Meaning 6: a particular quality or feature that something or someone has","collocation[46]":"good points","example[92]":"Every system has its good points and its drawbacks.","collocation[47]":"bad points","example[93]":"What would you say are Natalie’s bad points?","collocation[48]":"somebody’s strong point","example[94]":"Mathematics was never my strong point.","collocation[49]":"somebody’s weak point","example[95]":"Be honest about assessing your weak points.","collocation[50]":"a plus point","example[96]":"The airline’s outstanding safety record is a major plus point.","collocation[51]":"a positive point","example[97]":"Underfloor heating has a lot of positive points.","collocation[52]":"a negative point","example[98]":"A few negative points should be mentioned.","collocation[53]":"a selling point","example[99]":"The house's main selling point is its beautiful garden.","example[100]":"I'm afraid I'm not interested in the finer points of cars.","heading[3]":"– Meaning 7: one of the marks or numbers that shows your score in a game or sport","collocation[54]":"score a point","example[101]":"The Kiwis scored 206 points in their three matches.","collocation[55]":"win a point","example[102]":"I didn't win a single point in my first few games.","collocation[56]":"get a point","example[103]":"Our aim is to get as many points as possible.","collocation[57]":"lose a point","example[104]":"If he’s got the answer wrong, he loses 250 points.","collocation[58]":"give/award somebody a point","example[105]":"I was awarded 17 points out of 20.","collocation[59]":"win/lose by 5/10 etc points","example[106]":"We only lost by two points.","collocation[60]":"win/lose on points","example[107]":"He was knocked down twice, before losing on points.","collocation[61]":"be level on points","example[108]":"The teams finished level on points.","signpost[10]":"show something with your finger","definition[13]":"to show something to someone by holding up one of your fingers or a thin object towards it","example[109]":"‘Look!’ she said and pointed.","example[110]":"She pointed in the direction of the car park.","example[111]":"He stood up and pointed his finger at me.","example[112]":"I could see him pointing at me and telling the other guests what I had said.","note[3]":"point at","example[113]":"She was pointing to a small boat that was approaching the shore.","note[4]":"point to/towards","example[114]":"The driver pointed with his whip.","note[5]":"point with","signpost[11]":"aim something","definition[14]":"to hold something so that it is aimed towards a person or thing","example[115]":"He stood up and pointed his gun at the prisoner.","note[6]":"point something at somebody/something","example[116]":"She produced a camera and pointed it at me.","signpost[12]":"face in one direction","definition[15]":"to face or be aimed in a particular direction","example[117]":"The arrow always points north.","example[118]":"There were flashlights all around us, pointing in all directions.","example[119]":"There were TV cameras pointing at us.","example[120]":"The hands of the clock pointed to a quarter past one.","example[121]":"We found footprints pointing towards the back door.","signpost[13]":"show somebody where to go","definition[16]":"to show someone which direction they should go in","example[122]":"She pointed me towards an armchair.","example[123]":"Could you point me in the direction of the bathroom, please?","signpost[14]":"suggest what somebody should do","definition[17]":"to suggest what someone should do","example[124]":"My teachers were all pointing me towards university.","example[125]":"A financial adviser should be able to point you in the right direction.","signpost[15]":"suggest that something is true","definition[18]":"to suggest that something is true","example[126]":"Everything seemed to point in one direction.","example[127]":"All the evidence pointed towards Blake as the murderer.","example[128]":"Everything points to her having died from a drugs overdose.","signpost[16]":"walls/buildings","definition[19]":"to put new cement between the bricks of a wall","definition[20]":"a single idea, opinion, or fact, especially one that is part of a plan, argument, or discussion","example[129]":"I agree with your point about the importance of safety.","example[130]":"He made the point that economic growth would create the wealth necessary to protect the environment.","definition[21]":"a level on a scale","example[131]":"Gas prices have reached their highest point so far this year.","example[132]":"The president’s approval rating has hit its lowest point.","definition[22]":"the main idea in something that is said or done which gives meaning to all of it","example[133]":"The point is that staff are not allowed to smoke in the building.","example[134]":"Have I completely missed the point (=failed to understand the main meaning of something)?","definition[23]":"one of a series of parts into which a meeting, plan etc is divided","example[135]":"What’s the first point on the agenda?","example[136]":"The corporation announced a five-point plan for overhauling its businesses.","definition[24]":"a unit of measure used in INDEXES (=series of figures giving the general level of financial markets, economic activity etc)","example[137]":"The Financial Times 30 Share Index closed up 11 points at 1659.5.","definition[25]":"a place or position","example[138]":"Your luggage will be searched at thepoint of departure.","example[139]":"Visas cannot be issued at the entry points along the border.","definition[26]":"an exact moment, time, or stage in the development or progress of something","example[140]":"It is too early to tell whether last month’s increase marks a turning point (=a time when a situation changes) for the company.","example[141]":"The economy seems to be moving to the point of no return (=the point where it becomes so bad it cannot recover).","definition[27]":"a unit used to measure how good someone or something is or how suitable they are for something","example[142]":"The details you give are assessed according to a points system.","example[143]":"Finance has never been his strong point.","definition[28]":"a sign (.) used to separate a whole number from any DECIMALs that follow it","definition[29]":"to blame someone for something","example[144]":"To minimise his sentence, he pointed the finger at people he had dealt with.","definition[30]":"to show how something could change or develop successfully","example[145]":"The article summarises the current law and points the way forward."}