{"word[0]":"secret","definition[0]":"known about by only a few people and kept hidden from others","example[0]":"They kept their relationship secret from their parents.","example[1]":"agents on a secret mission","example[2]":"secret talks with the terrorists","example[3]":"The drugs were found in a secret compartment in Campbell’s suitcase.","note[0]":"secret compartment/passage etc","example[4]":"The cookies are made to a secret recipe.","note[1]":"secret ingredient/recipe/formula","definition[1]":"secret feelings, worries, or actions are ones that you do not want other people to know about","example[5]":"His secret fear was that Jenny would leave him.","example[6]":"Did you know you had a secret admirer (=someone who is secretly in love with you)?","definition[2]":"used to describe the behaviour of someone who is keeping their thoughts, intentions, or actions hidden from other people","synonym[0]":"secretive","example[7]":"There was a secret smile on her face.","example[8]":"They’re being very secret about it.","note[2]":"secret about","definition[3]":"known about by only a few people, who have agreed not to tell anyone else","example[9]":"a secret meeting place","example[10]":"The details of the proposal must remain secret.","display[0]":"confidential","definition[4]":"used about information, especially in business or government, that is secret and not intended to be shown or told to other people","example[11]":"a highly confidential report","example[12]":"Employees’ personal details are treated as strictly confidential.","display[1]":"classified","definition[5]":"used about information that the government has ordered to be kept secret from most people","example[13]":"He was accused of passing on classified information to the Russians in the 1950s.","display[2]":"sensitive","definition[6]":"used about information that is kept secret because there would be problems if the wrong people knew it","example[14]":"A teenager managed to hack into sensitive US Air Force files.","display[3]":"covert","definition[7]":"used about things that are done secretly, especially by a government or official organization","example[15]":"a CIA covert operation","display[4]":"undercover","definition[8]":"used about things that are done secretly by the police in order to catch criminals or find out information","example[16]":"Detectives arrested the suspect after a five-day undercover operation.","display[5]":"underground","definition[9]":"an underground organization or newspaper is one that operates or is produced secretly and opposes the government","example[17]":"Her father was a member of the underground resistance movement in France during World War II.","display[6]":"clandestine","definition[10]":"secret and often illegal or immoral","example[18]":"clandestine meetings","example[19]":"his involvement in a clandestine operation to sell arms to Iran","example[20]":"a clandestine love affair","display[7]":"hush-hush","definition[11]":"used about information or activities that are kept officially secret","example[21]":"He was put in charge of some hush-hush military project.","example[22]":"I’ve no idea what he does – it’s all very hush-hush.","definition[12]":"something that is kept hidden or that is known about by only a few people","example[23]":"I can’t tell you. It’s a secret.","example[24]":"It was no secret that the two men hated each other.","example[25]":"Don’t worry. Your secret is safe with me (=I won’t tell anyone about it).","collocation[0]":"have a secret","example[26]":"We have no secrets from each other.","collocation[1]":"know a secret","example[27]":"You can tell Tom that I know his secret.","collocation[2]":"keep a secret","example[28]":"Can you keep a secret?","collocation[3]":"tell somebody a secret","example[29]":"Shall I tell you a secret?","collocation[4]":"let somebody in on a secret","example[30]":"Frank let me in on the secret.","collocation[5]":"reveal/divulge a secret","example[31]":"He was accused of revealing state secrets.","collocation[6]":"give away a secret","example[32]":"I had to be careful not to give away any secrets.","collocation[7]":"share a secret","example[33]":"I trusted Alexander, so I decided to share my secret with him.","collocation[8]":"discover/find out a secret","example[34]":"He was afraid that someone would discover his secret.","form[0]":"ADJECTIVES/NOUN + secret","collocation[9]":"a big secret","example[35]":"The event was supposed to be a big secret, but everyone knew about it.","collocation[10]":"a little secret","example[36]":"You must promise me that this will be our little secret.","collocation[11]":"a closely-guarded/well-kept secret","example[37]":"The recipe is a closely-guarded secret.","collocation[12]":"an open secret","example[38]":"It was an open secret that he was having an affair.","collocation[13]":"a dark/terrible secret","example[39]":"I’m sure every family has a few dark secrets.","collocation[14]":"a dirty secret","example[40]":"The exclusion of black people from the film industry is one of Hollywood’s dirty little secrets.","collocation[15]":"a guilty secret","example[41]":"He had finally discovered Jo’s guilty secret.","collocation[16]":"somebody’s innermost secrets","example[42]":"She wasn’t confident enough to share her innermost secrets with him.","collocation[17]":"a family secret","example[43]":"Their normally strong relationship is threatened when he has to reveal a family secret.","collocation[18]":"a state/official secret","example[44]":"He was accused of passing on state secrets to a foreign power.","collocation[19]":"a trade secret","example[45]":"They must not betray their employer’s trust, for instance by giving away trade secrets.","collocation[20]":"military secrets","example[46]":"He was sent to prison for five years in 1933 for selling military secrets to Germany.","definition[13]":"something that is secret is only known about by a few people and kept hidden from other people, sometimes because it is illegal","example[47]":"The unexpected merger has triggered reports of a secret deal.","example[48]":"The judge has twice insisted that there must be a secret ballot (=a vote in which every individual voter can keep his or her vote a secret).","definition[14]":"information about a company or its products which is known only to a few people in the company, and which must not be given to anyone not working for it","example[49]":"The company has labelled the underlying sales data a trade secret.","example[50]":"A law prohibits employees from divulging  (=telling other people) corporate secrets."}