{"word[0]":"lake","definition[0]":"a large area of water surrounded by land","example[0]":"Lake Michigan","heading[0]":"GRAMMAR: Patterns with lake","display[0]":"in the lake","explanation[0]":"You use in the lake to talk about things that happen in the water","example[1]":"You can swim in the lake","example[2]":"Are there any fish in the lake?","display[1]":"on the lake","explanation[1]":"You use on the lake to talk about things that happen on the surface of a lake or are very close to the edge of a lake","example[3]":"We go sailing on the lake","example[4]":"They have a cottage on the lake","display[2]":"at the lake","explanation[2]":"You use at the lake when thinking of a lake as a place where you can go","example[5]":"We spend summers at the lake","example[6]":"There’s a café at the lake","example[7]":"We went for a swim in the lake.","display[3]":"lagoon","definition[1]":"an area of water that is separated from the sea by rocks, sand, or coral","example[8]":"a tropical lagoon","example[9]":"coastal lagoons","display[4]":"loch","definition[2]":"in Scotland, a lake or an area of sea water that is almost completely surrounded by land","example[10]":"Loch Ness","example[11]":"a sea loch","display[5]":"reservoir","definition[3]":"a lake, especially an artificial one, where water is stored before it is supplied to people’s houses","example[12]":"The reservoirs supply water to Greater Manchester.","display[6]":"pond","definition[4]":"a small area of fresh water that is smaller than a lake, which is either natural or artificially made","example[13]":"There were several ducks on the village pond.","display[7]":"pool","definition[5]":"a small area of still water in a hollow place","example[14]":"a pool of water near the summit of the mountain","example[15]":"a rockpool  (=a pool in some rocks near the sea)","display[8]":"puddle","definition[6]":"a very small area of water on the ground, especially after it has been raining","example[16]":"She turned quickly to avoid stepping in a puddle.","display[9]":"waterhole","definition[7]":"a small area of water in a dry country, where wild animals go to drink","example[17]":"The waterhole is used by elephants."}