{"word[0]":"section","signpost[0]":"place/object","definition[0]":"one of the parts that something such as an object or place is divided into","example[0]":"The plane’s tail section was found in a cornfield.","example[1]":"the smoking section  (=where you can smoke)","example[2]":"a busy section of road","note[0]":"section of","example[3]":"the reference section of the library","signpost[1]":"part of a whole","definition[1]":"one of the separate parts of a structure, piece of furniture etc that you fit together to form the whole","example[4]":"The boats were built in Scotland, and transported to Egypt in sections.","note[1]":"in sections","signpost[2]":"book/newspaper/report","definition[2]":"a separate part of a book, newspaper, document, report etc","note[2]":"sports/style/business/travel etc section (=particular part of a newspaper)","example[5]":"This issue will be discussed further in section two.","definition[3]":"a separate group within a larger group of people","example[6]":"a large section of the American public","definition[4]":"one of the parts of a law or a legal document","example[7]":"Article I, Section 8 of the US Constitution","signpost[3]":"side/top view","definition[5]":"a picture that shows what a building, part of the body etc would look like if it were cut from top to bottom or side to side","example[8]":"Here’s the outside view, and here are the floors in section.","note[3]":"in section","signpost[4]":"medical/scientific","definition[6]":"a medical operation that involves cutting","definition[7]":"a very thin flat piece that is cut from skin, a plant etc to be looked at under a microscope","signpost[5]":"area of land","definition[8]":"a square area of land in the US that is one mile long on each side","definition[9]":"the shape that is made when a solid figure is cut by a flat surface in mathematics","definition[10]":"to officially force someone with a mental illness to go to a psychiatric hospital, because they are dangerous to themselves or other people","definition[11]":"to separate something into parts","example[9]":"Peel and section the oranges.","definition[12]":"to cut a very thin flat piece from skin, a plant etc so that you can look at it under a microscope","definition[13]":"to cut a part of the body in a medical operation","definition[14]":"one of the parts of an organization or department","example[10]":"You will need to speak to the manager of the marketing services section.","example[11]":"Toyota suffered its biggest drop in profit since its sales and manufacturing sections merged.","definition[15]":"one of the parts of a document, book, newspaper etc","example[12]":"The lease qualifies for special protection under section 11 of the Bankruptcy Code.","example[13]":"I usually read the business section of the newspaper first."}