{"word[0]":"scratch","signpost[0]":"rub your skin","definition[0]":"to rub your skin with your nails because it feels uncomfortable","example[0]":"John yawned and scratched his leg.","example[1]":"Try not to scratch.","example[2]":"He was scratching at the bites on his arm.","note[0]":"scratch at","signpost[1]":"cut somebody’s skin","definition[1]":"to cut someone’s skin slightly with your nails or with something sharp","example[3]":"She ran at him and scratched his face.","example[4]":"Don’t scratch yourself on the thorns.","signpost[2]":"make a mark","definition[2]":"to make a small cut or mark on something by pulling something sharp across it","example[5]":"I’m afraid I’ve scratched your car.","example[6]":"Some of the prisoners had scratched their names on the walls.","definition[3]":"if an animal scratches, it rubs its feet against something, often making a noise","example[7]":"A few chickens scratched around in the yard.","example[8]":"a dog scratching at the door to be let in","signpost[3]":"remove something","definition[4]":"to remove something from a surface by rubbing it with something sharp","example[9]":"I scratched away a little of the paint with my fingernail.","note[1]":"scratch something off/away etc","signpost[4]":"remove writing","definition[5]":"to remove a word from a piece of writing by drawing a line through it","synonym[0]":"cross out","example[10]":"I have scratched his name from the list.","note[2]":"scratch something from/off something","signpost[5]":"make a noise","definition[6]":"to make a rough sound by moving something sharp across a surface","example[11]":"His pen scratched away on the paper.","signpost[6]":"stop something happening","definition[7]":"if you scratch an idea or a plan, you decide that you will not do it","synonym[1]":"abandon","signpost[7]":"remove from race","definition[8]":"if someone scratches from a race, or if you scratch them from the race, they do not take part in it","definition[9]":"a small cut on someone’s skin","example[12]":"There were deep scratches all over her face.","example[13]":"Don’t worry, it’s only a scratch (=not a serious injury).","example[14]":"She was unharmed apart from a few cuts and scratches.","definition[10]":"a thin mark or cut on the surface of something","example[15]":"There was a big scratch on the car door.","signpost[8]":"rub","definition[11]":"when you rub part of your body with your nails because it feels uncomfortable","example[16]":"He stretched and had a scratch.","example[17]":"He brushed his hair and gave his scalp a good scratch.","definition[12]":"a sound made by something sharp or rough being rubbed on a hard surface","example[18]":"I heard the scratch of an animal’s claws on the door.","definition[13]":"a scratch team or group of people has been put together in a hurry, using anyone that is available","definition[14]":"a scratch player in golf is very good and is not given any advantage in games"}