{"word[0]":"appointment","definition[0]":"an arrangement for a meeting at an agreed time and place, for a particular purpose","example[0]":"All consultations are by appointment only.","example[1]":"I’d like to make an appointment to see the doctor. ","note[0]":"an appointment to do something","example[2]":"He has an appointment with a client at 10.30.","note[1]":"appointment with","definition[1]":"when someone is chosen for a position or job","example[3]":"Other changes included the appointment of a new Foreign Minister.","note[2]":"appointment of","example[4]":"They congratulated him on his appointment as chairman.","note[3]":"appointment as","definition[2]":"a job or position, usually involving some responsibility","example[5]":"He has taken up an appointment as Professor of Chemistry.","collocation[0]":"have an appointment","example[6]":"She has an appointment with the dentist at 5 o'clock.","collocation[1]":"make/arrange an appointment","example[7]":"Can you phone the hairdresser and make an appointment?","collocation[2]":"book an appointment","example[8]":"Have you booked another appointment at the clinic?","example[9]":"I’ve scheduled your appointment for 9.30.","collocation[3]":"cancel an appointment","example[10]":"He had to cancel all his afternoon appointments.","collocation[4]":"get an appointment","example[11]":"It’s difficult to get an appointment on Monday morning.","collocation[5]":"miss an appointment","example[12]":"The train was late so I missed my appointment.","collocation[6]":"keep an appointment","example[13]":"Please let us know if you cannot keep your appointment.","form[0]":"ADJECTIVES/NOUN + appointment","collocation[7]":"a hospital appointment","example[14]":"My hospital appointment lasted half an hour.","collocation[8]":"a doctor’s appointment","example[15]":"What time is your doctor’s appointment?","example[16]":"I have an appointment at the doctor’s this morning.","collocation[9]":"an urgent appointment","example[17]":"I can’t talk now – I have an urgent appointment to get to.","collocation[10]":"a dentist’s/dental appointment","example[18]":"She has a dental appointment, so she won’t be in until later.","collocation[11]":"a medical appointment","example[19]":"Children sometimes miss school because of medical appointments.","collocation[12]":"a business appointment","example[20]":"Dennis had an early-morning business appointment with a client.","collocation[13]":"a hair appointment","example[21]":"I’d like to make a hair appointment for next week.","collocation[14]":"a morning/afternoon appointment","example[22]":"I asked for a morning appointment.","definition[3]":"an arrangement to meet someone at a particular time and place","example[23]":"Erlich was 25 minutes early for his appointment.","example[24]":"He had an appointment with a union delegate at the Grand Hotel.","example[25]":"Were you able to make an appointment to meet the area manager?","example[26]":"Visits to the doctor’s surgery are strictly by appointment (=you must make an appointment before coming).","definition[4]":"when someone is chosen to do a job, or the job itself","example[27]":"I am pleased to accept the appointment and have taken note of the terms laid down in your letter.","example[28]":"a coherent policy for the dismissal and appointment of state employees","definition[5]":"a person who is chosen to do a particular job","example[29]":"Our new appointment, Ms Baynes, seems to be working out very well."}