{"word[0]":"origin","definition[0]":"the place or situation in which something begins to exist","example[0]":"The tradition has its origins in the Middle Ages.","example[1]":"old folk tales of unknown origin","example[2]":"All meat should be clearly labelled with its country of origin.","note[0]":"country/place of origin","example[3]":"a new theory to explain the origins of the universe","note[1]":"origin of","example[4]":"Most coughs are viral in origin.","note[2]":"in origin","example[5]":"The word is French in origin.","definition[1]":"the country, race, or type of family which someone comes from","example[6]":"The form asks for information about the person’s ethnic origin.","example[7]":"Immigrants rarely return to their country of origin.","example[8]":"She never forgot her humble origins.","example[9]":"Two thirds of the pupils are of Asian origin.","note[3]":"of French/German/Asian etc origin","collocation[0]":"a common origin","example[10]":"It may be that all life on Earth has a common origin.","collocation[1]":"of recent origin","example[11]":"This particular theory is of very recent origin.","collocation[2]":"of unknown origin","example[12]":"an ancient folk tale of unknown origin","collocation[3]":"of doubtful origin","example[13]":"The fire was still being treated as of doubtful origin.","collocation[4]":"something’s historical/geographical/political etc origins","example[14]":"This type of story has its historical origins in eighteenth century gothic novels.","example[15]":"the geographical origins of the plant","collocation[5]":"have its origin in something","example[16]":"The ceremony has its origins in medieval times.","collocation[6]":"trace its origins to something","example[17]":"The Roman Catholic Church traces its origins back to the 4th century.","collocation[7]":"trace the origin of something","example[18]":"It’s difficult to trace the origin of some words.","collocation[8]":"owe its origins to something","example[19]":"a government which owes its origins to revolution","collocation[9]":"something’s origins lie in something","example[20]":"a grape whose origins lie in northern Italy","example[21]":"The technique’s origins lie in the popular arts of the time.","collocation[10]":"something’s origins go back to something","example[22]":"The school’s origins go back to the 12th century.","collocation[11]":"investigate the origin of something","example[23]":"researchers investigating the origin of AIDS","form[0]":"phrase","collocation[12]":"the country/place of origin","example[24]":"The rugs are somewhat cheaper in their country of origin.","heading[0]":"where something comes from","display[0]":"origin/origins","example[25]":"the origins of the conflict in the Middle East","example[26]":"The book explains the origin of words.","example[27]":"Her disability is genetic in origin.","display[1]":"source","definition[2]":"the thing, place etc that you get something from","example[28]":"They get their money from various sources.","example[29]":"Beans are a good source of protein.","display[2]":"root","definition[3]":"the root of a problem is the main cause. The roots of something are the things that it was originally based on","example[30]":"Allergies are at the root of a lot of health problems.","example[31]":"At the root of the crisis was a shortage of hard cash.","example[32]":"They want a return to the roots of Christianity.","example[33]":"Reggae has its roots in a range of different musical styles.","display[3]":"the birthplace of something","definition[4]":"the place where something first started to exist","example[34]":"New Orleans is the birthplace of jazz.","example[35]":"Ethiopia, the birthplace of coffee","display[4]":"the cradle of something","definition[5]":"the place where something important first started – used mainly in the following phrases","example[36]":"Ancient Athens is considered to be the cradle of democracy.","example[37]":"Baghdad was the cradle of civilization.","display[5]":"starting point","definition[6]":"an idea, suggestion etc from which a discussion, process, or project can develop","example[38]":"His paper provided an excellent starting point for discussion.","heading[1]":"to come from something or somewhere","display[6]":"come from something","definition[7]":"to have developed from something that existed before","example[39]":"The word origami comes from the Japanese ori (folding) and kami (paper).","example[40]":"Where did the idea for the book come from?","display[7]":"be based on something","definition[8]":"to use something else as the basis","example[41]":"The film is based on a traditional Chinese story.","example[42]":"She later wrote a book based on her experiences in Africa.","display[8]":"originate","definition[9]":"to come from a particular place, group, or situation, especially one that existed a long time ago. Originate is more formal than come from","example[43]":"The jewellery probably originates from Egypt.","example[44]":"Genes also tell us that native Americans originated from a small group of migrants who crossed the Bering land bridge from Siberia.","example[45]":"Christmas pudding is thought to have originated from a type of medieval porridge, which was made of meat, dried fruit, nuts, sugar and spices.","display[9]":"be founded on something","definition[10]":"to develop from an idea or belief","example[46]":"Our system of government is founded on the principle of democracy.","display[10]":"derive from something/be derived from something","definition[11]":"to come from something, especially by means of a long or complicated process – often used about words coming from another language","example[47]":"Much of the English language is derived from Latin.","example[48]":"Many drugs are derived from plants.","display[11]":"have its origins/roots in something","definition[12]":"to develop from something that existed long ago","example[49]":"Halloween has its origins in an ancient Celtic festival.","example[50]":"Modern country and Western music has its roots in the folk songs of the rural south.","display[12]":"go back to something","definition[13]":"to come from a particular past time or event or from something that existed a long time ago","example[51]":"Our friendship goes back to our freshman year in college.","example[52]":"The college goes back to the Middle Ages.","definition[14]":"the situation, place, or substance something comes from","example[53]":"Swiss authorities were doubtful about the origins of his financing.","example[54]":"products of petroleum origin","example[55]":"The software helps you trace the origin of any piece of data.","definition[15]":"the country or place that goods have come from","example[56]":"lists showing U.S. imports of crude oil and other products by country of origin","example[57]":"The shipper assumes full responsibility for the cargo from the point of origin to the point of destination."}