{"word[0]":"tight","comparative[0]":"tighter","superlative[0]":"tightest","definition[0]":"tight clothes fit your body very closely, especially in a way that is uncomfortable","opposite[0]":"loose","example[0]":"tight jeans","example[1]":"My shoes were so tight that I could hardly walk.","example[2]":"The jacket is rather a tight fit  (=it fits too tightly).","signpost[0]":"pulled/stretched firmly","definition[1]":"string, wire, cloth etc that is tight has been pulled or stretched firmly so that it is straight or cannot move","example[3]":"The bandage must be tight enough to stop the bleeding.","example[4]":"She tied the rope around the post and pulled it tight.","signpost[1]":"attached firmly","definition[2]":"a screw, lid etc that is tight is firmly attached and difficult to move","example[5]":"Check that the screws are tight.","signpost[2]":"strict","definition[3]":"controlling something very strictly or firmly","note[0]":"run/keep a tight ship (=manage a company, organization etc strictly and effectively)","example[6]":"The government is keeping tight control on immigration.","example[7]":"Security is always tight  for the opening day of parliament.","example[8]":"The former dictator still keeps a tight grip on power.","note[1]":"keep a tight grip/hold/rein on something","example[9]":"Anna was determined to keep a tight hold on her feelings.","signpost[3]":"little money","definition[4]":"if money is tight, you do not have enough of it","example[10]":"As you know, I run the magazine on a pretty tight budget.","example[11]":"Money was tight and he needed a job badly.","note[2]":"money is tight/things are tight","signpost[4]":"little time","definition[5]":"if time is tight, it is difficult for you to do everything you need to do in the time available","example[12]":"Time is tight, and she has another meeting to go to this afternoon.","example[13]":"We should arrive on time, but it’ll be tight.","example[14]":"As usual, his schedule on Saturday was tight  (=he had arranged to do several things in a short time).","example[15]":"I'm working to a very tight deadline  (=I have to finish a piece of work very quickly).","signpost[5]":"little space","definition[6]":"if space is tight, there is only just enough space to fit something into a place","example[16]":"Six in the car will be a tight squeeze.","note[3]":"be a tight squeeze/fit","signpost[6]":"not generous","definition[7]":"not generous, or trying hard to avoid spending money","example[17]":"Don’t be so tight!","signpost[7]":"close together","definition[8]":"placed or standing closely together","example[18]":"The animal’s body was curled up in a tight little ball.","example[19]":"She wore her hair in a tight bun.","signpost[8]":"close relationship","definition[9]":"a tight group of people, countries etc have a close relationship with each other","synonym[0]":"tight-knit","example[20]":"Together, the young film-makers formed a tight group.","example[21]":"the tight bonds that had grown between them","signpost[9]":"bend/turn","definition[10]":"a tight bend or turn is very curved and turns quickly in another direction","example[22]":"Danny lost control on a tight bend, and the car ran off the road.","signpost[10]":"chest/stomach/throat","definition[11]":"if your chest, stomach, or throat feels tight, it feels painful and uncomfortable, because you are ill or worried","example[23]":"Before she went on stage her chest felt tight and her throat hurt.","signpost[11]":"expression/smile/voice","definition[12]":"a tight expression, smile, or voice shows that you are annoyed or worried","synonym[1]":"tight-lipped","example[24]":"‘Look, I’m sorry ..., ’ she said, forcing a tight smile.","signpost[12]":"play/performance","definition[13]":"playing a piece of music or giving a performance very exactly and well, without any pauses or mistakes","example[25]":"The band gave a really tight performance.","example[26]":"a tight, well-rehearsed production","signpost[13]":"game/competition","definition[14]":"a tight game, competition etc is one in which the teams, players etc play equally well, and it is not easy to win","example[27]":"The opening quarter of the game was very tight.","definition[15]":"very firmly or closely","synonym[2]":"tightly","example[28]":"Hold tight to the handrail!","example[29]":"I kept my eyes tight shut."}