{"word[0]":"reputation","definition[0]":"the opinion that people have about someone or something because of what has happened in the past","example[0]":"Judge Kelso has a reputation for being strict but fair.","note[0]":"reputation for","example[1]":"In her last job she gained a reputation as a hard worker.","note[1]":"reputation as","collocation[0]":"have a good/bad etc reputation","example[2]":"The law firm has an excellent reputation.","collocation[1]":"get a reputation","example[3]":"Over the years, the company has gained a reputation for making quality products.","example[4]":"I didn’t want to get a reputation as a troublemaker.","collocation[2]":"earn/win a reputation","example[5]":"As a young publisher, she earned a reputation for toughness.","collocation[3]":"enjoy a reputation","example[6]":"The hotel enjoys a good reputation.","collocation[4]":"deserve a reputation","example[7]":"France deserves its reputation for good food.","collocation[5]":"live up to its reputation","example[8]":"New York certainly lived up to its reputation as an exciting city.","collocation[6]":"establish a reputation","example[9]":"By then Picasso was already establishing his reputation as an artist.","collocation[7]":"enhance somebody’s reputation","example[10]":"The performance enhanced his reputation as one of our most promising young actors.","collocation[8]":"build/develop a reputation","example[11]":"Our business has built a reputation for reliable service.","collocation[9]":"damage somebody’s reputation","example[12]":"She wouldn’t do anything to damage her family’s reputation.","collocation[10]":"tarnish somebody’s reputation","example[13]":"His reputation was tarnished by allegations that he had taken bribes.","collocation[11]":"destroy/ruin somebody’s reputation","example[14]":"The accusation ruined her reputation and cost her the election.","collocation[12]":"good/excellent","example[15]":"The university has a very good reputation.","collocation[13]":"bad/poor","example[16]":"The city doesn’t deserve its bad reputation.","collocation[14]":"a considerable reputation","example[17]":"He was also an historian with a considerable reputation.","collocation[15]":"an international/worldwide reputation","example[18]":"The department has a worldwide reputation for its research.","collocation[16]":"a formidable reputation","example[19]":"After the meeting, I understood why he had such a formidable reputation.","collocation[17]":"an enviable reputation","example[20]":"The company has established an enviable reputation for quality.","collocation[18]":"a well-deserved reputation","example[21]":"Ronaldo’s performances earned him a deserved reputation as a terrific footballer.","collocation[19]":"an undeserved reputation","example[22]":"She has an undeserved reputation for being difficult, but really it's just her manner.","definition[1]":"the opinion that people have about a person, organization etc because of what has happened in the past","example[23]":"She was a good lawyer with a reputation for honesty and diligence.","example[24]":"The school had an excellent reputation.","example[25]":"The lawsuit has damaged the company’s reputation.","display[0]":"image","definition[2]":"the idea that people have about what something is like, especially when this is created through newspaper stories, advertising etc","example[26]":"A PR campaign was launched in an effort to improve the company’s image.","example[27]":"Boxing has rather a negative image.","example[28]":"The princess tried to project an image of herself as serious and hard-working (=she tried to give people the idea that she was serious and hard-working).","display[1]":"name","definition[3]":"the reputation that a person, organization etc has – used especially in the following phrases","example[29]":"The company is anxious to protect its good name.","example[30]":"Cyclists who ignore traffic rules give other cyclists a bad name.","example[31]":"Electrolux has a name for making top quality vacuum cleaners.","example[32]":"He went to court in order to try to clear his name  (=prove that he is innocent).","display[2]":"standing","definition[4]":"someone’s reputation and position compared to other people in a group or society, based on other people’s opinion of them","example[33]":"The class system in Great Britain encourages people to be very aware of their social standing.","example[34]":"He needs to improve his standing among female voters.","example[35]":"Jacques Tati was a man of international standing in the world of screen comedy.","display[3]":"prestige","definition[5]":"the good reputation that a company, organization, group etc has, which makes people respect and admire them","example[36]":"the prestige of a carmaker such as Rolls-Royce","example[37]":"Does Stanford University carry the same prestige as Harvard or Yale?","example[38]":"Hosting the Olympic Games would enhance our country’s international prestige.","example[39]":"The teaching profession has lost the prestige it had in the past.","display[4]":"stature","definition[6]":"the importance and respect that a person or organization has, because of their achievements or their influence","example[40]":"As he got older, Picasso’s stature as an artist increased.","example[41]":"Their work is equal in stature.","example[42]":"an actor of international stature","example[43]":"The party’s stature has increased in recent years.","definition[7]":"the opinion people have of something or someone, based on what has happened in the past","example[44]":"The firm has a very good reputation.","example[45]":"A lengthy legal battle woulddamage the reputation of both sides.","example[46]":"The hotel has a good reputation for service.","note[2]":"reputation for/as","example[47]":"He has built a reputation as a financial wizard."}