{"word[0]":"rival","definition[0]":"a person, group, or organization that you compete with in sport, business, a fight etc","synonym[0]":"competitor","example[0]":"This gives the company a competitive advantage over its rivals.","example[1]":"He finished 39 seconds ahead of his main rival.","example[2]":"She was 2 minutes faster than her nearest rival.","example[3]":"a game against their old rivals, Manchester United","example[4]":"They still remain bitter rivals  (=hate each other).","example[5]":"Their sales have now overtaken those of their arch-rival  (=main or strongest rival).","example[6]":"Sheena left her job and went to work for a rival company.","note[0]":"rival company/firm/team etc","example[7]":"his chief rival for the job","note[1]":"rival for","definition[1]":"one of a group of things that people can choose between","example[8]":"The newest model has several advantages over its rivals.","collocation[0]":"somebody's main/chief rival","example[9]":"Who is the champion's main rival?","collocation[1]":"somebody's nearest/closest rival","example[10]":"She finished 7.1 seconds ahead of her nearest rival.","collocation[2]":"a great rival","example[11]":"Oxford and Cambridge University have always been great rivals","collocation[3]":"somebody's arch-rival","example[12]":"McDonald's and its arch-rival Burger King","collocation[4]":"a serious rival","example[13]":"He knows that he has no serious rival for the job.","collocation[5]":"an old rival","example[14]":"Hindhead had a convincing victory over their old rivals, Frensham.","collocation[6]":"a potential rival","example[15]":"Their business is a potential rival for ours.","collocation[7]":"a bitter rival","example[16]":"They have long been bitter rivals.","collocation[8]":"a political rival","example[17]":"At the time, France and Britain were major political rivals.","collocation[9]":"a presidential rival","example[18]":"His presidential rivals have vigorously attacked him.","form[0]":"rival + NOUN","collocation[10]":"rival factions/groups","example[19]":"My task is to unite the rival factions within the party.","collocation[11]":"a rival team","example[20]":"The rival team's fans were in the other part of the ground.","collocation[12]":"a rival gang","example[21]":"The street is a war zone between two rival gangs.","collocation[13]":"rival fans/supporters","example[22]":"There were fights between rival fans after the match.","collocation[14]":"a rival company/firm","example[23]":"It may have to merge with a rival company to stay in business.","definition[2]":"to be as good or important as someone or something else","example[24]":"The college’s facilities rival those of Harvard and Yale.","example[25]":"a stadium to rival any in the world","definition[3]":"a person, group, or organization that you compete with","example[26]":"The authorities hope that such changes will help Italian banks compete more effectively against European rivals.","example[27]":"Jack left his job and went to work for a rival company.","example[28]":"The two men had been rivals for the top job three years ago.","definition[4]":"one of a number of products that people can choose between","example[29]":"The car was a success because it met the needs of car buyers better than most of its rivals.","example[30]":"Your product needs to be better than rival products in precisely specified ways.","definition[5]":"a BID etc that is competing with another","example[31]":"Another travel company has now come in with a rival bid.","example[32]":"This notebook computer rivals the power of some desk-top models."}