{"word[0]":"perform","definition[0]":"to do something to entertain people, for example by acting a play or playing a piece of music","example[0]":"Chenier and the band are performing at the Silver Palace tomorrow.","example[1]":"The children perform two plays each school year.","definition[1]":"to do something, especially something difficult or useful","synonym[0]":"carry out","example[2]":"Surgeons performed an emergency operation.","example[3]":"The official opening ceremony was performed by Princess Margaret.","example[4]":"The leadership cannot be expected to perform miracles (=improve a situation in a way that seems impossible).","example[5]":"An analysis of the survey data was performed.","note[0]":"perform a study/experiment/analysis etc","example[6]":"She was fired for not performing the duties outlined in her contract.","note[1]":"perform a task/job/duty","example[7]":"software that performs a specific function","note[2]":"perform a function/role","explanation[0]":"In everyday English, people usually say that someone carries out an operation, a study etc rather than use perform:","example[8]":"The operation was carried out by a team of surgeons.","heading[0]":"– Meaning 2: to do something, especially something difficult or useful","collocation[0]":"perform a task/job/duty etc","example[9]":"What skills do you need to perform this task?","collocation[1]":"perform work","example[10]":"Over 6,000 people in our community of 100,000 perform volunteer work.","collocation[2]":"perform an experiment/study etc","example[11]":"Part of the Chemistry exam involves performing an experiment.","collocation[3]":"perform an operation","example[12]":"The surgeon who performed the operation said it had gone well.","collocation[4]":"perform a ceremony","example[13]":"At 3 o'clock, the opening ceremony was performed by the Queen.","collocation[5]":"perform a service","example[14]":"Our troops are performing a remarkable service and a terribly important mission.","example[15]":"The two organizations perform similar functions.","collocation[6]":"perform an action","example[16]":"The children sing and perform the actions to nursery songs.","collocation[7]":"perform miracles","example[17]":"I'm prepared to work hard to get the job done but I can't perform miracles.","definition[2]":"to do work, carry out a duty, task etc","example[18]":"It takes a highly skilled mechanic to perform repairs on this car.","example[19]":"Symbols across the top of the screen let a user click a mouse button to perform common operations such as adding up a column of figures.","example[20]":"These chips are designed to perform very specific functions, such as controlling computer disk drives.","definition[3]":"to do what is expected or wanted","example[21]":"She looked good during the interview, but will she perform once she’s in the job?","example[22]":"The company’s three divisions allperformed well, despite the recession."}