{"definition[0]":"what you earn by working and can use to buy things. Money can be in the form of notes and coins or cheques, and can be kept in a bank","example[0]":"Don’t spend all your money on the first day of your holiday!","example[1]":"The repairs will cost quite a lot of money.","definition[1]":"money in the form of coins or notes that you can carry around with you","synonym[0]":"cash","example[2]":"You’ll find some money in my purse.","example[3]":"I didn’t have any money on me (=I was not carrying any money).","example[4]":"We can change some money at the airport  (=change it into the money of another country).","example[5]":"Don’t forget to get some Swiss money before you leave.","note[0]":"Swiss/Japanese/Turkish etc money","definition[2]":"someone’s wealth, including all the property and other things they own","example[6]":"The family made their money in the woollen trade.","example[7]":"He had lost all his money gambling.","collocation[0]":"have money","example[8]":"I didn’t have enough money to pay for it.","collocation[1]":"make/earn money","example[9]":"She makes a little money by babysitting.","collocation[2]":"spend money (on something)","example[10]":"More money should be spent on training.","collocation[3]":"cost money/cost a lot of money","example[11]":"Good food doesn’t have to cost a lot of money.","collocation[4]":"save money","example[12]":"Companies fired workers to save money.","collocation[5]":"make money","example[13]":"The farm was beginning to make money at last.","collocation[6]":"lose money","example[14]":"The movie didn’t attract audiences and lost money for the studio.","collocation[7]":"pay money (for something)","example[15]":"Has he paid the money he owes you?","collocation[8]":"lend somebody money","example[16]":"My dad lent me money to buy a car.","collocation[9]":"borrow money","example[17]":"They arranged to borrow money from the bank to buy a house.","collocation[10]":"owe somebody money","example[18]":"He owes me money.","collocation[11]":"waste money (on something)","example[19]":"Don’t waste your money on a computer that doesn’t have enough memory.","collocation[12]":"raise money","example[20]":"The Christmas fair raises money for the school.","collocation[13]":"save up money","example[21]":"She had saved up enough money to buy a car.","collocation[14]":"give somebody their money back","example[22]":"We regret that we are unable to refund money on tickets.","collocation[15]":"money goes on something","example[23]":"All the money went on doctor’s bills.","collocation[16]":"money comes in","example[24]":"Rob wasn’t working for a while, so we had less money coming in.","collocation[17]":"money comes from something","example[25]":"All of Dawson’s money came from drugs.","form[0]":"ADJECTIVES/NOUN + money","collocation[18]":"good money","example[26]":"Preston earns good money as a lawyer.","collocation[19]":"big money","example[27]":"Basketball players make big money.","collocation[20]":"easy money","example[28]":"For many, selling drugs seems like easy money.","collocation[21]":"spending money","example[29]":"We had £500 spending money saved for our holiday.","collocation[22]":"pocket money/spending money","example[30]":"How much pocket money do you get?","collocation[23]":"government/taxpayers’/public money","example[31]":"More  taxpayer’s money should be spent on the railways.","collocation[24]":"a sum of money","example[32]":"£10,000 seemed a huge sum of money to me.","collocation[25]":"be a waste of money","example[33]":"Fancy clothes for a baby are a waste of money.","collocation[26]":"be value for money","example[34]":"The holiday was excellent value for money.","definition[3]":"what you use to buy things, in the form of notes or coins","example[35]":"He spent all his money on computer equipment.","definition[4]":"money in the form of coins and notes","example[36]":"I didn’t have any cash with me.","display[0]":"currency","definition[5]":"the money used in a particular country","example[37]":"The dollar gained in value against other currencies.","example[38]":"a single European currency","definition[6]":"money in the form of coins of low value","example[39]":"Do you have any small change?","example[40]":"a pocketful of loose change","display[1]":"note","definition[7]":"a piece of paper money","example[41]":"a £20 note","example[42]":"a $5 bill","display[2]":"coin","definition[8]":"a flat round piece of metal used as money","example[43]":"She put some coins in the parking meter.","example[44]":"He took a coin out of his pocket.","display[3]":"a ten-pence/50-cent etc piece","definition[9]":"a coin worth a particular amount","definition[10]":"coins, BANKNOTEs and BANK DEPOSITs (=money held in banks) used to buy things and to show their value","example[45]":"People are eating out less to save money.","example[46]":"Americans spent more money even though they earned less.","example[47]":"You should borrow money from the bank to pay for your course.","example[48]":"As an estate agent, he made (=gained) a lot of  money buying houses cheaply and reselling them.","example[49]":"He has picked a difficult time to raise money (=obtain it for a particular purpose) from outside investors.","definition[11]":"all the money that a country, organization, or person owns","example[50]":"The business collapsed and we lost all our money.","definition[12]":"money used for investment","synonym[1]":"capital","example[51]":"a plan to inject money into the company","example[52]":"foreigners who wanted to put money into (=invest in) US stocks","definition[13]":"used to talk about what it costs to borrow money","definition[14]":"used to talk about the MONEY SUPPLY (=the amount of money in the economy at a particular time)","definition[15]":"money paid by someone to prove that they are serious about buying something or about doing business","definition[16]":"in OPTIONS TRADING (=buying and selling the right to buy shares etc at a later date for a particular price), an option is at the money when the EXERCISE PRICE (=the price at which the shares etc can be bought using the option) is the same as the MARKET PRICE (=the current price of the shares on the stockmarket). A CALL OPTION (=the right to buy particular shares) is in the money when the exercise price is below the market price and out of the money when it is above it"}