{"word[0]":"sell out","definition[0]":"if a shop sells out of something, it has no more of that particular thing left to sell","example[0]":"Sorry, we’re sold out.","note[0]":"be/have sold out","example[1]":"We’ve completely sold out of those shirts in your size, sir.","definition[1]":"if products, tickets for an event etc sell out, they are all sold and there are none left","example[2]":"Wow! Those cakes sold out fast.","example[3]":"Tonight’s performance is completely sold out.","definition[2]":"to change your beliefs or principles, especially in order to get more money or some other advantage – used to show disapproval","example[4]":"ex-hippies who’ve sold out and become respectable businessmen","definition[3]":"to sell your business or your share in a business","example[5]":"Wyman says he’ll sell out if business doesn’t pick up.","example[6]":"The T-mail Co. has sold out to San José-based DMX Inc for an undisclosed sum.","definition[4]":"a performance, sports game etc for which all the tickets have been sold","example[7]":"The concert was expected to be a sell-out.","example[8]":"a sellout crowd of 32,000","definition[5]":"a situation in which someone has not done what they promised to do or were expected to do by the people who trusted them","example[9]":"a sellout of the poor for political reasons","definition[6]":"someone who has not done what they promised to do or who is not loyal to their friends or supporters, especially in order to become more popular, richer etc","example[10]":"Many black students regarded him as a sellout.","definition[7]":"if an investor or owner of a company sells out, they sell their investments or the company","example[11]":"Relations between the directors are strained, and shareholders have said they would like to sell out.","example[12]":"They announced that they were selling out to a Japanese company.","definition[8]":"if a shop sells out of a product, it has no more of that particular product left","example[13]":"Some retailers had sold out of the new games console within twenty-four hours.","definition[9]":"if a product, seats at an event, tickets for a journey etc sell out, there is none left","example[14]":"First-class cabins are starting to sell out on some transcontinental flights.","definition[10]":"if a product, share offer, event etc is a sell-out, it is very successful and lots of people buy it or go there, and no more products, shares, tickets etc are available","example[15]":"The $200 million five-year bonds were an absolute sell-out."}