{"word[0]":"lapse","definition[0]":"a short period of time during which you fail to do something well or properly, often caused by not being careful","example[0]":"A defensive lapse by Keown allowed Tottenham to score.","example[1]":"Despite the occasional lapse, this was a fine performance by the young saxophonist.","note[0]":"momentary/temporary/occasional etc lapse","example[2]":"lapses in security","note[1]":"lapse in","example[3]":"A single lapse of concentration cost Sampras the game.","note[2]":"lapse of","example[4]":"a lapse of judgement","example[5]":"After taking the drug, several patients suffered memory lapses  (=when you cannot remember something for a short time).","definition[1]":"a failure to do something you should do, especially to behave correctly","example[6]":"He forgot to offer Darren a drink, but Marie did not appear to notice the lapse.","definition[2]":"a period of time between two events","example[7]":"The usual time lapse between request and delivery is two days.","example[8]":"a lapse of about ten seconds","definition[3]":"to gradually come to an end or to stop for a period of time","example[9]":"The conversation lapsed.","definition[4]":"if a contract, agreement etc lapses, it comes to an end, usually because an agreed time limit has passed","example[10]":"Your booking will automatically lapse unless you confirm it.","explanation[0]":"In everyday English, people usually say that a contract or agreement runs out rather than lapses:","example[11]":"His club membership had run out.","definition[5]":"to stop believing in or following a religion","example[12]":"those people who have lapsed from the practice of their religion","definition[6]":"if a period of time lapses, it passes","example[13]":"Many years had lapsed since her first visit to Wexford.","definition[7]":"if a contract, agreement, or offer lapses, it ends because an agreed time limit has passed","example[14]":"The customer has the right to exercise the option or allow the option to lapse.","example[15]":"There are many films on which the copyright has lapsed and hasn’t been renewed.","definition[8]":"if an INSURANCE POLICY lapses, it ends because the regular payments required have not been made","example[16]":"Kimble let his fire insurance lapse when he couldn’t afford the premiums.","example[17]":"There is a four-day lapse between the time a patron buys a ticket and the money is deposited in the bank.","definition[9]":"a failure to do something you should do","example[18]":"The customer complained about a lapse in service.","example[19]":"The audit uncovered accounting lapses."}