{"word[0]":"interrupt","definition[0]":"to stop someone from continuing what they are saying or doing by suddenly speaking to them, making a noise etc","example[0]":"Will you stop interrupting me!","example[1]":"Sorry to interrupt, but I need to ask you to come downstairs.","definition[1]":"to make a process or activity stop temporarily","example[2]":"My studies were interrupted by the war.","definition[2]":"if something interrupts a line, surface, view etc, it stops it from being continuous","heading[0]":"when someone is speakng","definition[3]":"to stop someone from continuing speaking","example[3]":"She interrupted him to ask exactly how he had broken his ankle.","example[4]":"Oliver began his story but was soon interrupted by the arrival of Mr Gosling.","example[5]":"I wish you wouldn’t interrupt all the time.","display[0]":"butt in","definition[4]":"to rudely start speaking when someone is already speaking","example[6]":"Will you please stop butting in!","example[7]":"Steve kept butting in with silly comments.","display[1]":"cut somebody off/cut somebody short","definition[5]":"to prevent someone from finishing what they are saying","example[8]":"He slammed down the phone and cut her off in mid-sentence.","example[9]":"Bob began to speak but Donna cut him short.","display[2]":"heckle","definition[6]":"to deliberately interrupt a speaker or performer by shouting, especially to show that you do not agree with what they are saying","example[10]":"Comedians are used to dealing with members of the audience who heckle.","example[11]":"The speaker was heckled by a group of protesters.","display[3]":"chip in","definition[7]":"to interrupt a conversation or discussion by adding comments, especially helpful or useful ones","example[12]":"Feel free to chip in if you have any comments to make.","heading[1]":"when someone is doing something","definition[8]":"to stop someone from continuing to do something","example[13]":"Miss Danziger apologised for interrupting their enjoyment of their meal.","example[14]":"My thoughts were interrupted by the sound of the doorbell.","example[15]":"His interview was interrupted by a call from the president.","display[4]":"disturb","definition[9]":"to interrupt someone when they are trying to work, sleep etc","example[16]":"The sign on the door said ‘Do not disturb. Meeting in progress’.","example[17]":"I hope I’m not disturbing you. Do you want me to come back later?","example[18]":"Her sleep was disturbed by a violent hammering on the door.","display[5]":"bother","definition[10]":"to interrupt someone, especially by asking questions when they are trying to do something else","example[19]":"‘I’m very sorry to bother you, ’ Jackson said smoothly, ‘but I’d like a few minutes of your time.’","example[20]":"You mustn’t bother him - he’s working on his essay."}