{"word[0]":"circumstance","definition[0]":"the conditions that affect a situation, action, event etc","example[0]":"The Soviet Union had been forced by circumstances to sign a pact with Nazi Germany.","example[1]":"I can’t imagine a circumstance in which I would be willing to steal.","example[2]":"The rules can only be waived in exceptional circumstances.","note[0]":"in ... circumstances","example[3]":"Prisoners can only leave their cells under certain circumstances.","note[1]":"under ... circumstances","definition[1]":"the combination of facts, events etc that influence your life, and that you cannot control","example[4]":"He was a victim of circumstance.","collocation[0]":"in/under certain circumstances","example[5]":"In certain circumstances you may be refused a visa.","collocation[1]":"exceptional/special circumstances","example[6]":"The court may allow this evidence in exceptional circumstances.","collocation[2]":"normal circumstances","example[7]":"In normal circumstances, a child’s language will develop naturally.","collocation[3]":"particular circumstances","example[8]":"There may be particular circumstances in which this rule will not apply.","collocation[4]":"difficult circumstances","example[9]":"Many teachers are doing a very good job under difficult circumstances.","collocation[5]":"suspicious circumstances","example[10]":"Officers said there were no suspicious circumstances surrounding his death.","collocation[6]":"mysterious circumstances","example[11]":"One of their colleagues had vanished in mysterious circumstances.","collocation[7]":"unusual circumstances","example[12]":"There were several unusual circumstances that night.","collocation[8]":"unforeseen circumstances","example[13]":"The tragedy was the result of a series of unforeseen circumstances.","collocation[9]":"tragic circumstances","example[14]":"Both parents had died in tragic circumstances.","collocation[10]":"extenuating/mitigating circumstances","example[15]":"Hunger and poverty are not treated by the courts as extenuating circumstances.","collocation[11]":"a set/combination of circumstances","example[16]":"This was a very unusual set of circumstances.","collocation[12]":"the circumstances surrounding something","example[17]":"Police are investigating the circumstances surrounding the accident.","collocation[13]":"due to circumstances beyond somebody’s control","example[18]":"Occasionally flights are cancelled due to circumstances beyond our control."}