{"definition[0]":"your ideas or beliefs about a particular subject","example[0]":"In my opinion, the law should be changed.","note[0]":"in my opinion","example[1]":"What’s your opinion of Cathy?","note[1]":"opinion of","example[2]":"He asked his wife’s opinion on every important decision.","note[2]":"opinion on","example[3]":"The two women had very different opinions about drugs.","note[3]":"opinion about","bad_example[0]":"on my opinion","bad_example[1]":"according to my opinion","definition[1]":"judgment or advice from a professional person about something","example[4]":"When choosing an insurance policy it’s best to get an independent opinion.","example[5]":"My doctor says I need an operation, but I’ve asked for a second opinion (=advice from a second doctor to make sure that the first advice is right).","example[6]":"They took the painting to get an expert opinion (=an opinion from someone who knows a lot).","collocation[0]":"have/hold an opinion","example[7]":"Everyone seemed to have a different opinion.","example[8]":"He holds strong opinions on these issues.","collocation[1]":"ask somebody (for) their opinion","example[9]":"We asked people for their opinions about the Olympics.","example[10]":"Nobody asked my opinion.","example[11]":"It’s a good idea to ask people for their opinions and suggestions.","collocation[2]":"give/express an opinion","example[12]":"He gave his opinion only when asked.","collocation[3]":"voice/state an opinion","example[13]":"She has every right to voice her opinion.","collocation[4]":"form an opinion","example[14]":"Olson had not yet formed an opinion as to Mark’s reliability.","collocation[5]":"the general opinion","example[15]":"The general opinion seems to be that the government has made a mess of the war.","collocation[6]":"popular/public opinion","example[16]":"How much do newspapers influence popular opinion?","collocation[7]":"somebody’s personal opinion","example[17]":"My personal opinion is that his first film was better.","collocation[8]":"strong opinions","example[18]":"People have strong opinions about this subject.","collocation[9]":"have a difference of opinion","example[19]":"He and Luke had a difference of opinion.","collocation[10]":"something is a matter of opinion","example[20]":"‘He’s a very nice man.’ ‘That’s a matter of opinion, ’ thought Sam.","collocation[11]":"contrary to popular opinion","example[21]":"Contrary to popular opinion, many cats dislike milk.","collocation[12]":"in my humble opinion","example[22]":"In my humble opinion, he is the greatest sportsman Britain has produced.","collocation[13]":"keep your opinions to yourself","example[23]":"As the youngest person there, I knew enough to keep my opinions to myself.","collocation[14]":"opinion is divided as to/on/over something","example[24]":"Opinion was divided as to whether the program will work.","collocation[15]":"everyone is entitled to their opinion","example[25]":"Of course everyone is entitled to their opinion, but I can't accept what he is saying.","definition[2]":"what you think about something or someone","example[26]":"People didn’t usually ask his opinion about anything.","example[27]":"She has rather a low opinion of young people.","display[0]":"view","definition[3]":"your opinion about a serious or important issue","example[28]":"She has strong views about education.","example[29]":"In my view, footballers are paid too much.","display[1]":"point of view","definition[4]":"your opinion, especially when this is influenced by the situation you are in","example[30]":"From a farmer’s point of view, foxes are a nuisance.","example[31]":"It all depends on your point of view.","definition[5]":"the official opinion of a government, political party, or someone in authority","example[32]":"The prime minister has made his position perfectly clear.","example[33]":"The party has changed its position on nuclear weapons.","display[2]":"attitude","definition[6]":"your opinions and feelings about something or someone, especially when this shows in your behaviour","example[34]":"My parents and I have very different attitudes to life.","example[35]":"It was his attitude to women that shocked me.","display[3]":"school of thought","definition[7]":"an opinion that one group of people have about a subject, especially when this is different from that of another group","example[36]":"There is one school of thought that says that coffee is addictive and is therefore a bad thing.","example[37]":"There are two schools of thought on this."}