{"word[0]":"article","signpost[0]":"newspaper/magazine","definition[0]":"a piece of writing about a particular subject in a newspaper or magazine","example[0]":"The paper’s leading article (=the main article) described the government as weak.","example[1]":"newspaper articles","example[2]":"an article on environmental issues","note[0]":"article on/about","definition[1]":"a thing, especially one of a group of things","synonym[0]":"item","example[3]":"household articles","example[4]":"She only took a few articles of clothing with her.","definition[2]":"a part of a law or legal agreement that deals with a particular point","example[5]":"Article 1 of the constitution guarantees freedom of religion.","definition[3]":"a word used before a noun to show whether the noun refers to a particular example of something or to a general example of something. In English, ‘the’ is called the definite article and ‘a’ and ‘an’ are called the indefinite article.","form[0]":"NOUN + newspaper","collocation[0]":"a newspaper article","example[6]":"He writes newspaper articles in the Guardian.","collocation[1]":"a magazine article","example[7]":"The couple talked frankly about their joy at having a new baby in a magazine article published yesterday.","collocation[2]":"a feature article","example[8]":"I wrote a few feature articles on sporting events.","form[1]":"ADJECTIVES/NOUN + article","collocation[3]":"a good/excellent/interesting article","example[9]":"There was an interesting article on Russia in the paper today.","collocation[4]":"the leading/lead article","example[10]":"Look at this leading article from Newsweek’s business section.","collocation[5]":"a front-page article","example[11]":"The protest followed a front-page article in the Herald three weeks ago.","collocation[6]":"an in-depth article","example[12]":"Each issue contains in-depth articles and photographs.","collocation[7]":"write/do an article","example[13]":"The Times have asked me if I will do an article on the election.","collocation[8]":"read/see an article","example[14]":"It was good to see such an intelligent article on censorship.","collocation[9]":"publish/carry/run an article","example[15]":"The magazine carried an article on the dangers of being overweight.","collocation[10]":"an article appears in a newspaper/magazine","example[16]":"A couple of articles appeared in local papers, but nothing else.","definition[4]":"a piece of writing in a newspaper or magazine about a particular subject","example[17]":"Greg began his career writing articles for the college magazine.","example[18]":"an interesting newspaper article","display[0]":"story","definition[5]":"an article in a newspaper about a recent event, especially one that a lot of people find interesting or exciting","example[19]":"a front-page story","example[20]":"I read a newspaper story about the crash.","example[21]":"The local paper ran a story  (=published a story) about the festival.","definition[6]":"a short article in a newspaper or magazine","example[22]":"I’ve written a couple of pieces for the New York Times magazine.","example[23]":"The piece was first published in the Observer.","display[1]":"feature","definition[7]":"a special article about a particular subject, often with photographs and continuing for several pages","example[24]":"They had a special feature on Croatia.","example[25]":"The paper did a big feature on growing your own food.","display[2]":"review","definition[8]":"an article in a newspaper or magazine about a book, play, product, hotel etc, giving someone’s opinion of it","example[26]":"The play had rave reviews  (=people liked it a lot - an informal use).","example[27]":"Did you see the review of the new Coldplay album?","display[3]":"column","definition[9]":"an article by a particular writer that appears regularly in a newspaper or magazine","example[28]":"He has a weekly column in the Times.","example[29]":"She writes a newspaper column on gardening.","display[4]":"editorial","definition[10]":"a piece of writing in a newspaper that gives the personal opinion of the editor about something that is in the news","example[30]":"Several years ago the New York Times published an editorial stating that the appropriate minimum wage is $0.00.","display[5]":"cutting","definition[11]":"an article that has been cut from a newspaper or magazine","example[31]":"His mother has kept all his old press cuttings.","definition[12]":"one part of a law or legal agreement, especially a numbered part","example[32]":"Articles 2 and 3 of the Constitution","definition[13]":"in Britain, a period of training with a firm of SOLICITORs which someone who wants to be a lawyer must complete before they can become fully qualified","example[33]":"After graduation, she returned to her father’s solicitor’s practice to take her articles."}