{"word[0]":"speculation","definition[0]":"when you guess about the possible causes or effects of something without knowing all the facts, or the guesses that you make","note[0]":"wild/idle speculation (=speculation that is unlikely to be true)","example[0]":"The witness’s statement was pure speculation (=not based on any knowledge).","example[1]":"There is speculation that the president is ill.","note[1]":"speculation that","example[2]":"speculation about the future","note[2]":"speculation about/on","definition[1]":"when you try to make a large profit by buying goods, property, shares etc and then selling them","example[3]":"property speculation","form[0]":"ADJECTIVES/NOUN + speculation","collocation[0]":"pure/mere speculation","example[4]":"A government official yesterday dismissed the reports as ‘pure speculation’.","collocation[1]":"wild/idle speculation","example[5]":"Such fears are wild speculation.","collocation[2]":"intense speculation","example[6]":"The reason for his resignation was the subject of intense speculation.","collocation[3]":"widespread speculation","example[7]":"There was widespread speculation about his political plans.","collocation[4]":"renewed speculation","example[8]":"The move has prompted renewed speculation that an election will be held in April.","collocation[5]":"press/media speculation","example[9]":"She appealed for an end to press speculation about her marriage.","collocation[6]":"lead to/prompt/give rise to speculation","example[10]":"This development led to speculation that she was about to resign.","collocation[7]":"fuel speculation","example[11]":"The announcement has fueled speculation that the company will be the target of a takeover bid.","collocation[8]":"dismiss speculation","example[12]":"He dismissed speculation that he might run for president.","collocation[9]":"end speculation","example[13]":"Smith has ended speculation about his future by signing a new contract.","collocation[10]":"be a matter for speculation","example[14]":"The precise nature of the deal is a matter for speculation.","collocation[11]":"be the subject of speculation","example[15]":"His role in the affair has been the subject of speculation in the press.","definition[2]":"the act of trying to make a profit by speculating","example[16]":"He made most of his money through property speculation.","example[17]":"Inflation encourages consumption, borrowing and speculation.","example[18]":"Low interest rates encourage speculation in the property market.","note[3]":"speculation in","definition[3]":"the act of guessing without knowing all the facts about something, or the guesses that you make","example[19]":"The group is now the focus of takeover speculation.","example[20]":"A Treasury official dismissed the reports as “pure speculation”.","example[21]":"The company’s stock rose on Monday amid speculation that the computer maker may sell its microprocessor technology for $1.5 billion.","example[22]":"Speculation mounted (=increased) that the Bundesbank was set to raise its key interest rates."}