{"word[0]":"dive","past_tense[0]":"dived","signpost[0]":"jump into water","definition[0]":"to jump into deep water with your head and arms going in first","example[0]":"She dived into a pool.","note[0]":"dive into/off etc","example[1]":"Diving off the cliffs is dangerous.","signpost[1]":"swim under water","definition[1]":"to swim under water using special equipment to help you breathe","example[2]":"The first time you dive on a coral reef is an experience you will never forget.","signpost[2]":"go deeper/lower","definition[2]":"to travel down through the air or through water to a lower level","example[3]":"The submarine began to dive.","example[4]":"The aircraft appeared to dive vertically towards the crowd.","signpost[3]":"move quickly","definition[3]":"to move or jump quickly in a particular direction or into a particular place","example[5]":"Jackson dived after the ball.","example[6]":"We dived into a shop to avoid the rain.","example[7]":"The soldiers were diving for cover (=to protect themselves behind something).","signpost[4]":"numbers","definition[4]":"if numbers, prices etc dive, they suddenly become much lower than before","example[8]":"The dollar dived against the yen in Tokyo today.","signpost[5]":"soccer","definition[5]":"to fall down deliberately in order to unfairly win a free kick or a penalty","signpost[6]":"sudden movement","definition[6]":"a sudden movement in a particular direction or into a particular place","example[9]":"She made a dive for the bathroom.","signpost[7]":"sudden fall","definition[7]":"a sudden fall in the amount, value, or success of something","example[10]":"The news put shares in a dive.","example[11]":"The team’s fortunes have taken a dive this year.","signpost[8]":"movement downwards","definition[8]":"when something moves down through the air or water","note[1]":"steep/vertical dive","example[12]":"Thankfully, the pilot managed to pull out of the dive and regain control.","signpost[9]":"jump","definition[9]":"a jump into deep water with your head and arms going in first","signpost[10]":"swim","definition[10]":"the act of going under water to swim, using special equipment to help you breathe","definition[11]":"a bar, club etc that is cheap and dirty","definition[12]":"the act of falling down deliberately in order to unfairly win a freekick or a penalty","heading[0]":"– Meaning 3: when something moves down through the air or water","collocation[0]":"go into a dive","example[13]":"The plane was in trouble, then it went into a dive.","collocation[1]":"pull out of a dive","example[14]":"He tried to pull out of the steep dive before hitting the ground.","collocation[2]":"a steep dive","example[15]":"The fighter plane went into a steep dive.","collocation[3]":"a vertical dive","example[16]":"His actions sent the plane into a near vertical dive.","collocation[4]":"a shallow dive","example[17]":"The bird captures its prey on the ground after a long, shallow dive."}