{"word[0]":"reference","definition[0]":"part of something you say or write in which you mention a person or thing","example[0]":"The article made no reference to previous research on the subject.","example[1]":"The governor made only a passing reference to the problem of unemployment  (=he mentioned it quickly).","example[2]":"There is no direct reference to her own childhood in the novel.","note[0]":"reference to","definition[1]":"the act of looking at something for information","example[3]":"Keep their price list on file for future reference (=so that it can be looked at in the future).","example[4]":"The book will become a standard work of reference (=a book that people look at for information).","example[5]":"A vocabulary index is included for easy reference.","note[1]":"for easy/quick reference","definition[2]":"a letter containing information about you that is written by someone who knows you well, and is usually intended for a new employer","example[6]":"We will need references from your former employers.","definition[3]":"a person who provides information about your character and abilities","example[7]":"Ask your teacher to act as one of your references.","definition[4]":"a book, article etc from which information has been obtained","example[8]":"a comprehensive list of references","definition[5]":"a number that tells you where you can find the information you want in a book, on a map etc","example[9]":"a list of towns, each with a map reference","collocation[0]":"make reference to something","example[10]":"Official reports made no reference to the incident.","collocation[1]":"there is a reference to something","example[11]":"There are 32 references to eagles in the Bible.","collocation[2]":"a specific/direct/explicit reference","example[12]":"No specific reference was made to the race of the children.","collocation[3]":"an oblique reference","example[13]":"He added, in an oblique reference to the US, that ‘some countries could do more’.","collocation[4]":"a brief reference","example[14]":"Brief references to the tragedy have appeared in the French press.","collocation[5]":"a passing reference","example[15]":"He made only a passing reference to his injury.","collocation[6]":"frequent/constant/repeated references","example[16]":"Medieval literature contains frequent references to insanity.","collocation[7]":"an occasional reference","example[17]":"During the interview, he made only occasional references to his forthcoming autobiography.","definition[6]":"to mention another book, article etc that contains information connected with the subject you are writing about","example[18]":"The book does not reference anything written in the last 10 years.","definition[7]":"used to say what you are writing or talking about, especially in business letters","example[19]":"With reference to your recent advertisement, I am writing to apply for the post of sales manager.","definition[8]":"a group of numbers and letters that identify a document. A reference is often put at the top of a business letter","example[20]":"Thank you for your letter (reference JC/216).","example[21]":"Please quote the reference number above in all correspondence.","definition[9]":"a letter written by someone who knows you well, usually to a new employer, giving information about your character, abilities, or qualifications","example[22]":"We will be taking up (=getting) references from your former employers.","example[23]":"No employee can insist upon being given a reference when he leaves a job.","definition[10]":"a person who provides information about your character, abilities, or qualifications when you are trying to get a job","synonym[0]":"referee","example[24]":"Could I ask you to act as one of my references?","definition[11]":"a report giving information on a company’s business reputation and financial situation","example[25]":"Bank references are sought by companies to ensure that those with whom they are trading are solvent and can pay for the goods supplied to them.","example[26]":"We always ask for trade references (=from members of the customer’s own trade) from our customers.","definition[12]":"the agreed limits of what an official committee or report will deal with","example[27]":"The matter of compensation is not within the committee’s terms of reference."}