{"word[0]":"shed","definition[0]":"a small building, often made of wood, used especially for storing things","example[0]":"a tool shed","example[1]":"a cattle shed","definition[1]":"a large industrial building where work is done, large vehicles are kept, machinery is stored etc","signpost[0]":"get rid of","definition[2]":"to get rid of something that you no longer need or want","example[2]":"The company is planning to shed about a quarter of its workforce.","example[3]":"The magazine is desperately trying to shed its old-fashioned image.","example[4]":"a diet to help you shed pounds","signpost[1]":"plants/animals","definition[3]":"if a plant sheds its leaves or if an animal sheds skin or hair, they fall off as part of a natural process","example[5]":"The trees were starting to shed their leaves.","example[6]":"As it grows, a snake will regularly shed its skin.","signpost[2]":"drop/fall","definition[4]":"to drop something or allow it to fall","example[7]":"He strode across the bathroom, shedding wet clothes as he went.","example[8]":"A lorry shed its load of steel bars on the M25.","note[0]":"shed a load","definition[5]":"if something sheds water, the water flows off its surface, instead of sinking into it","collocation[0]":"shed jobs/workers/staff etc","example[9]":"The bank continued to shed workers.","collocation[1]":"shed weight","example[10]":"Doing exercise is the best way to shed surplus weight.","collocation[2]":"shed pounds/kilos","example[11]":"I needed to shed a few pounds.","collocation[3]":"shed an image","example[12]":"Has the industry finally shed its negative image?","collocation[4]":"shed your inhibitions","example[13]":"As the party went on, people began to shed their inhibitions.","definition[6]":"to get rid of something that you no longer need, especially workers","example[14]":"Plans to shed another 10,000 employees were unveiled.","example[15]":"There are companies who are making high levels of profit and who are still shedding jobs.","definition[7]":"if shares shed an amount they become less in value by that amount","example[16]":"The shares shed 55 cents to close at A$15.9."}