{"word[0]":"grind","signpost[0]":"into small pieces","definition[0]":"to break something such as corn or coffee beans into small pieces or powder, either in a machine or between two hard surfaces","example[0]":"freshly ground pepper","definition[1]":"to cut food, especially raw meat, into very small pieces by putting it through a machine","example[1]":"ground beef","signpost[1]":"smooth/sharp","definition[2]":"to make something smooth or sharp by rubbing it on a hard surface or by using a machine","example[2]":"a stone for grinding knives and scissors","example[3]":"The lenses are ground to a high standard of precision.","definition[3]":"to press something onto a surface and rub it with a strong twisting movement","example[4]":"He ground out his cigarette on the window ledge.","example[5]":"He dropped a cigar butt and ground it into the carpet with his heel.","note[0]":"grind something into something","definition[4]":"to press hard against something","example[6]":"as these plates  (=large areas of land) grind against each other","note[1]":"grind against/together","signpost[2]":"perform a movement","definition[5]":"to perform a special movement in skateboarding or rollerblading, which involves moving sideways along the edge of something, so that the bar connecting the wheels of the skateboard or Rollerblade presses hard against the edge","definition[6]":"something that is hard work and physically or mentally tiring","example[7]":"I find the journey to work a real grind.","example[8]":"workers emerging from their daily grind in the factory","definition[7]":"a student who never does anything except study","definition[8]":"a movement in skateboarding or rollerblading, which involves moving sideways along the edge of something, so that the bar connecting the wheels of the skateboard or Rollerblade presses hard against the edge","example[9]":"the relentless grind of international conferences","note[2]":"grind of","definition[9]":"the boring things that you have to do at work every day","definition[10]":"to gradually stop","example[10]":"If the strikes continue, steel production will grind to a halt.","example[11]":"These latest figures are further evidence of Britain’s economy grinding to a halt."}