{"word[0]":"blow","past_tense[0]":"blew","past_participle[0]":"blown","signpost[0]":"wind moving","definition[0]":"if the wind or a current of air blows, it moves","example[0]":"A cold breeze was blowing hard.","example[1]":"It was blowing from an easterly direction.","example[2]":"Outside, the weather was blowing a gale.","type[0]":"intransitive, transitive usually + adverb/preposition","signpost[1]":"wind moving something","definition[1]":"to move, or to move something, by the force of the wind or a current of air","example[3]":"Her hair was blowing in the breeze.","example[4]":"The wind blew the rain into our faces.","example[5]":"My ticket blew away.","example[6]":"A sudden draught blew the door shut.","note[0]":"blow (something) open/shut","signpost[2]":"air from your mouth","definition[2]":"to send air out from your mouth","example[7]":"He blew the smoke right in my face.","example[8]":"She blew onto her coffee to cool it down.","note[1]":"blow (something) into/onto/out etc","signpost[3]":"make a noise","definition[3]":"to make a sound by passing air through a whistle, horn etc","example[9]":"The whistle blew for half time.","example[10]":"A truck went by and blew its horn at her.","signpost[4]":"violence","definition[4]":"to damage or destroy something violently with an explosion or by shooting","example[11]":"A bomb like that could blow you to bits.","note[2]":"blow somebody/something to pieces/bits/smithereens","example[12]":"Part of his leg had been blown off.","note[3]":"blow something away/out/off something","signpost[5]":"lose an opportunity","definition[5]":"to lose a good opportunity by making a mistake or by being careless","example[13]":"We’ve blown our chances of getting that contract.","example[14]":"You’ve got a great future ahead of you. Don’t blow it.","signpost[6]":"waste money","definition[6]":"to spend a lot of money in a careless way, especially on one thing","example[15]":"I blew all the money I won on a trip to Hawaii.","signpost[7]":"electricity stops","definition[7]":"if an electrical fuse blows, or a piece of electrical equipment blows a fuse, the electricity suddenly stops working because a thin wire has melted","example[16]":"The floodlights blew a fuse.","signpost[8]":"tyre","definition[8]":"if a tyre blows, or if a car blows a tyre, it bursts","signpost[9]":"make a shape","definition[9]":"to make or shape something by sending air out from your mouth","note[4]":"blow glass (=shape glass by blowing into it when it is very hot and soft)","example[17]":"The kids were blowing bubbles in the backyard.","signpost[10]":"tell a secret","definition[10]":"to make known something that was meant to be a secret","example[18]":"Your coming here has blown the whole operation.","example[19]":"It would only take one phone call to blow his cover.","note[5]":"blow somebody’s cover","explanation[0]":"Blow belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[1]":"In this sentence, ‘a whistle’ is the object of blow","example[20]":"Someone blew a whistle","explanation[2]":"In this sentence, ‘a whistle’ is the subject of blow","example[21]":"A whistle blew","signpost[11]":"BAD EFFECT","definition[11]":"an action or event that causes difficulty or sadness for someone","example[22]":"Joe resigned, which was a severe blow because we needed him desperately.","example[23]":"His mother’s death was a shattering blow.","example[24]":"The election result dealt a further blow to the party.","example[25]":"The factory closures came as a blow to the local economy.","example[26]":"The final blow for many firms was the government’s abolition of import duties.","signpost[12]":"hard hit","definition[12]":"a hard hit with someone’s hand, a tool, or a weapon","example[27]":"She died from a heavy blow to the head.","example[28]":"He struck a blow which threw her to the floor.","example[29]":"Martin received a blow on the nose.","example[30]":"He had been struck a glancing blow (=a blow that did not hit him directly) by the car.","example[31]":"He gave her a violent blow to the head.","note[6]":"blow to","explanation[3]":"In everyday English, people usually say that someone gets hit or that something hits them, rather than using the noun blow:","signpost[13]":"blowing","definition[13]":"an action of blowing","example[32]":"One big blow and the candles were out.","form[0]":"ADJECTIVES/NOUN + blow","collocation[0]":"a big/major/serious/heavy blow","example[33]":"The earthquake was a serious blow to the area’s tourism industry.","collocation[1]":"a severe/terrible/awful blow","example[34]":"The news was a terrible blow for his family.","collocation[2]":"a bitter blow","example[35]":"Their defeat was a bitter blow.","collocation[3]":"a cruel/devastating/crushing blow","example[36]":"Her loss came as a devastating blow to her father.","collocation[4]":"a body blow","example[37]":"A tax on books would be a body blow for education.","collocation[5]":"a mortal/fatal/death blow","example[38]":"When he quit it dealt a mortal blow to the show.","collocation[6]":"be a blow","example[39]":"I can’t deny his leaving was a blow.","collocation[7]":"deal a blow to somebody/something","example[40]":"The 1982 drought dealt a devastating blow to the country.","collocation[8]":"come as a blow to somebody","example[41]":"His sudden death came as a huge blow to us all.","collocation[9]":"deliver a blow","example[42]":"Opinion polls delivered a nasty blow to the Tory leader.","collocation[10]":"suffer/receive a blow","example[43]":"Our team suffered a blow when Paul was sent off the field.","collocation[11]":"soften/cushion the blow","example[44]":"There are various ways to soften the blow of redundancy among staff.","collocation[12]":"be a bit of a blow","example[45]":"The result was a bit of a blow for the team.","definition[14]":"if you blow money on something, you spend a lot of money on it, often money that you cannot afford","example[46]":"He blew his wages on a new stereo.","definition[15]":"to tell the authorities that someone in your organization is doing something illegal, dishonest, or wrong","example[47]":"Workers were too scared of their employers to blow the whistle on illegal working hours."}