{"word[0]":"channel","signpost[0]":"television","definition[0]":"a television station and all the programmes that it broadcasts","example[0]":"the news on Channel 4","example[1]":"The kids are watching cartoons on the Disney Channel.","example[2]":"What channel is ‘ER’ on?","example[3]":"He changed channels to watch the basketball game.","signpost[1]":"for getting information/goods etc","definition[1]":"a system or method that you use to send or obtain information, goods, permission etc","example[4]":"The U.S. is working through diplomatic channels to find a solution.","example[5]":"The new software will be sold through existing distribution channels.","example[6]":"It is important that we open channels of communication with the police.","note[0]":"channel of","signpost[2]":"sea/river","definition[2]":"an area of water that connects two larger areas of water","example[7]":"St George’s Channel","definition[3]":"the area of water between France and England","definition[4]":"the deepest part of a river, harbour, or sea, especially where it is deep enough to allow ships to sail in","definition[5]":"a passage that water or other liquids flow along","example[8]":"an irrigation channel","signpost[3]":"radio","definition[6]":"a particular range of sound waves which can be used to send and receive radio messages","signpost[4]":"in a surface","definition[7]":"a long deep line cut into a surface or a long deep space between two edges","synonym[0]":"groove","example[9]":"The sliding doors fit into these plastic channels.","signpost[5]":"way to express yourself","definition[8]":"a way of expressing your thoughts, feelings, or physical energy","example[10]":"Art provides a channel for the children’s creativity.","note[1]":"channel for","form[0]":"types of channel","collocation[0]":"a television channel","example[11]":"NTV is Russia’s leading television channel.","collocation[1]":"a news/movie/sports etc channel","example[12]":"What’s on the movie channel tonight?","collocation[2]":"a satellite channel","example[13]":"CNN and other satellite channels","collocation[3]":"a cable channel","example[14]":"ABC announced its plans for a new cable channel.","collocation[4]":"a terrestrial channel","example[15]":"Channel 5 is the newest terrestrial channel in the UK.","collocation[5]":"a digital channel","example[16]":"You can’t record one digital channel while watching another.","collocation[6]":"a commercial channel","example[17]":"On commercial channels they have advertisement breaks.","collocation[7]":"change channels","example[18]":"Use the remote control to change channels.","collocation[8]":"switch channels","example[19]":"He kept switching channels.","collocation[9]":"launch a channel","example[20]":"In 1994, SKY launched two new channels.","collocation[10]":"watch a channel","example[21]":"The kids are always watching the cartoon channel.","collocation[11]":"a channel broadcasts something","example[22]":"All the channels are broadcasting the match live.","collocation[12]":"channel-hop","example[23]":"I usually start channel-hopping when the adverts are on.","definition[9]":"to control and direct something such as money or energy towards a particular purpose","example[24]":"Most of his energy was channeled into writing and lecturing.","note[2]":"channel something into something","example[25]":"Profits are channelled to conservation groups.","note[3]":"channel something to somebody","example[26]":"The famine relief money was channelled through the UN.","note[4]":"channel something through something","definition[10]":"to control or direct people or things to a particular place, work, situation etc","example[27]":"Women were likely to be channeled into jobs as teachers or nurses.","note[5]":"channel somebody/something into something","example[28]":"Drugs from government pharmacies were being channeled into illegal drug markets.","definition[11]":"to cut a long deep line in something","example[29]":"Water had channelled grooves in the rock.","definition[12]":"to send water through a passage","example[30]":"An efficient irrigation system channels water to the crops.","definition[13]":"to allow a spirit to come into your body and speak through you, or to tell people a message that you have received in this way","example[31]":"She claims to channel the spirit of a 2,000-year-old hunter.","definition[14]":"to look or sound like a famous person, especially someone who is dead","example[32]":"In her latest video, Kylie is channelling Marilyn Monroe.","definition[15]":"the English Channel","definition[16]":"a system that is used for supplying information or goods","example[33]":"A direct marketing channel moves goods directly from manufacturer to consumer.","definition[17]":"a television station and all the programmes broadcast on it","example[34]":"a 24-hour channel devoted exclusively to football","definition[18]":"a route along which computer signals can be sent, for example a CABLE","definition[19]":"to control and direct something such as money or effort towards a particular purpose","example[35]":"The company wanted to channel all its financial resources into completing several major office buildings.","example[36]":"The International Finance Corp. will channel funds through Zivnobanka for other investment projects in the Czech republic."}