{"word[0]":"note","signpost[0]":"to remind you","definition[0]":"something that you write down to remind you of something","example[0]":"Dave made a note of her address and phone number.","example[1]":"Keep a careful note of any problems you have with the software.","definition[1]":"to decide that you must remember to do something later","example[2]":"He made a mental note to arrange a time to meet her.","signpost[1]":"short letter","definition[2]":"a short informal letter","example[3]":"I was going to write Kathy a note, but I decided to call her instead.","example[4]":"This is just a quick note to let you know that I won’t be in the office tomorrow.","example[5]":"a suicide note (=a note telling someone that you are going to kill yourself)","example[6]":"a thank you note (=a note to say thank you for something)","signpost[2]":"official letter","definition[3]":"an official letter or document","note[0]":"diplomatic note (=a formal letter from one government to another)","signpost[3]":"additional information","definition[4]":"a short piece of writing at the bottom of a page or at the end of a book or document which gives more information about something written in the main part","example[7]":"The notes are at the back of the book.","example[8]":"A set of guidance notes is provided to assist applicants in completing the form.","note[1]":"explanatory/guidance notes","definition[5]":"a particular musical sound, or a symbol representing this sound","example[9]":"She has a good voice but has trouble hitting the high notes.","note[2]":"high/low note","definition[6]":"a piece of paper money worth a particular amount of money","example[10]":"a ten-pound note","signpost[4]":"feeling or quality","definition[7]":"a type of feeling or quality when someone speaks or does something","example[11]":"There was a note of doubt in her voice.","note[3]":"note of","example[12]":"He brought a note of realism into the debate.","example[13]":"She ended her speech on a personal note.","note[4]":"on a ... note","example[14]":"On a more serious note, I’d like to thank everyone for all their support.","collocation[0]":"make notes","example[15]":"As he read the letters, he made careful notes.","collocation[1]":"take notes","example[16]":"The reporter took notes throughout the interview.","collocation[2]":"jot down/scribble notes","example[17]":"The jurors were scribbling notes as the witness gave evidence.","collocation[3]":"write up notes","example[18]":"It’s a good idea to write up your notes soon after a lecture.","collocation[4]":"look/go/read through your notes","example[19]":"I read through my notes before the exam.","form[0]":"ADJECTIVES/NOUN + notes","collocation[5]":"detailed notes","example[20]":"I always make quite detailed notes after important meetings.","collocation[6]":"copious notes","example[21]":"She sat at the back of the hall and made copious notes.","collocation[7]":"brief notes","example[22]":"He jotted down some brief notes.","collocation[8]":"scrappy notes","example[23]":"Her rather scrappy notes weren’t much use when it came to revision.","collocation[9]":"lecture notes","example[24]":"I missed class today; can I borrow your lecture notes?","collocation[10]":"case notes","example[25]":"The researchers looked at the case notes of 500 patients with this type of cancer.","collocation[11]":"medical notes","example[26]":"I asked if I could see my medical notes.","definition[8]":"to notice or pay careful attention to something","example[27]":"He carefully noted the time when they left the building.","example[28]":"It should be noted that parking without a permit attracts a charge of £5.","example[29]":"Please note that the bill must be paid within ten days.","note[5]":"note (that)","example[30]":"Note how she is holding her racket.","note[6]":"note how","definition[9]":"to mention something because it is important or interesting","example[31]":"The judge noted that Miller had no previous criminal record.","note[7]":"note that","definition[10]":"a piece of printed paper that is used as money","synonym[0]":"BANKNOTE","example[32]":"a ten pound note","definition[11]":"a short letter or official document","example[33]":"a note from the chief executive","definition[12]":"used in the names of bonds or COMMERCIAL PAPER (=borrowing for less than a year by companies)","example[34]":"The government has auctioned $15 billion of three-year notes (=borrowing that will be repaid after three years).","definition[13]":"to mention something important or interesting so that people will notice it","example[35]":"‘The big stores aren’t competing for space any more, ’ notes Davidowitz.","example[36]":"Analysts note that unless the discount rate is lowered, a substantial stock market recovery isn’t likely.","example[37]":"Please note the following amendments to the guidelines.","example[38]":"Investors should note that these new long-term options are currently quite a risk.","example[39]":"It’s worth noting that there’s now little real price differential between the two types of product."}