{"word[0]":"seed","signpost[0]":"plants","definition[0]":"a small hard object produced by plants, from which a new plant of the same kind grows","example[0]":"a packet of sunflower seeds","example[1]":"Sow the seeds one inch deep in the soil.","note[0]":"plant/sow seeds","example[2]":"We grew all our tomatoes from seed.","note[1]":"grow something from seed","definition[1]":"a quantity of seeds","example[3]":"Some of the poorest farmers don’t have enough money to buy seed.","signpost[1]":"in fruit","definition[2]":"one of the small hard objects in a fruit such as an apple or orange, from which new fruit trees grow","definition[3]":"semen or sperm – often used humorously","signpost[2]":"family","definition[4]":"the group of people who have a particular person as their father, grandfather etc, especially when they form a particular race","example[4]":"Sow the seeds in trays or pots.","example[5]":"You can grow most vegetables from seed.","collocation[0]":"seeds germinate","example[6]":"The seeds should start to germinate after a few days.","form[0]":"NOUN + seed","collocation[1]":"flower/sunflower/tomato etc seeds","example[7]":"I bought a packet of poppy seeds.","collocation[2]":"grass seed","example[8]":"You can sprinkle grass seed over any gaps in the lawn.","definition[5]":"to remove seeds from fruit or vegetables","example[9]":"Add one lime, seeded and sliced.","definition[6]":"to give a player or team in a competition a particular position, according to how likely they are to win","example[10]":"Sharapova was seeded fifth at Wimbledon.","note[2]":"be seeded 8th/18th etc","definition[7]":"to plant seeds in the ground","example[11]":"a newly seeded lawn","definition[8]":"to produce seeds","explanation[0]":"Seed is usually passive when used as a transitive verb","definition[9]":"money used to start a new company, project, activity etc","example[12]":"Careful budgeting allows managers to accumulate savings, which they can use as seed capital.","example[13]":"Our total computer-relatedseed investment amounted to $29.1 million.","definition[10]":"to provide the money needed to start a company","example[14]":"In Germany, government funding has helped seed about 300 companies in three years."}