{"word[0]":"the","pos[0]":"definite article","definition[0]":"used to show that you are talking about a particular thing or person that has already been mentioned, is already known about, or is the only one","example[0]":"The audience clapped and cheered.","example[1]":"I ordered a pizza and salad. The pizza was nice but the salad was disgusting.","example[2]":"the tallest building in the world","example[3]":"sailing across the Pacific","example[4]":"The prime minister has intervened personally.","example[5]":"Elections will be held later in the year  (=this year).","example[6]":"How are all the family  (=your family)?","definition[1]":"used before nouns referring to actions and changes when they are followed by ‘of’","example[7]":"the growth of the steel industry","example[8]":"the arrival of our guests","definition[2]":"used when you are about to make it clear which person or thing you mean","example[9]":"That’s the school that Terry went to.","example[10]":"She laughed at the birthday card from Myra.","definition[3]":"used before the name of a family in the plural to refer to all the members of that family","example[11]":"The Johnsons had lived in this house for many years.","definition[4]":"used to refer to something that everyone knows because it is part of our natural environment or part of daily life","example[12]":"What was the weather like?","example[13]":"I looked out into the darkness.","example[14]":"Sometimes the traffic kept her awake at night.","example[15]":"The shops open at 9 o’clock.","definition[5]":"used before a singular noun to refer to a type of institution, shop, system etc","example[16]":"You used to buy them from the chemist.","example[17]":"I heard it on the radio.","example[18]":"I’ll put it in the mail for you today.","definition[6]":"used to refer to a part of someone’s body","example[19]":"Lieutenant Taylor was wounded in the knee.","example[20]":"How’s the ankle? Is it still hurting?","definition[7]":"used before an adjective to make it into a plural noun when you are referring to all the people that the adjective describes","example[21]":"She devoted her life to helping the poor.","example[22]":"a school for the deaf","example[23]":"wars between the English and the French","definition[8]":"used before an adjective to make it into a noun when you are referring to the particular kind of situation or thing that the adjective describes","example[24]":"Come on now, that’s asking for the impossible.","example[25]":"fantasy movies that make the unreal seem real","definition[9]":"used before a singular noun when you are referring to a particular type of thing or person in a general way","example[26]":"The tiger is without doubt the most magnificent of the big cats.","example[27]":"The computer has changed everyone’s lives in so many ways.","example[28]":"complicated dances like the tango","definition[10]":"used to refer to a period of time, especially a period of 10 or 100 years","example[29]":"fashions of the 60s","example[30]":"the great novelists of the 1900s","example[31]":"She remembers the war years.","example[32]":"In the thirties unemployment was widespread.","definition[11]":"used to mention a date","example[33]":"the 3rd of November","example[34]":"The battle took place on March the 21st, 1940. ","example[35]":"Shall we meet on the twelfth?","definition[12]":"enough of something for a particular purpose","example[36]":"I haven’t the time to talk just now.","example[37]":"Eric didn’t even have the common sense to send for a doctor.","definition[13]":"used to say which type of musical instrument someone plays","example[38]":"Fiona’s learning the flute.","example[39]":"He plays the violin.","definition[14]":"used to refer to a type of sport or a sports event, especially in athletics or swimming","example[40]":"Who won the long jump?","example[41]":"She swam up and down, practising the crawl.","definition[15]":"used before a word or phrase that describes someone or something when you are angry, jealous, surprised etc","example[42]":"He’s stolen my parking space, the bastard!","example[43]":"I can’t get this carton open, the stupid thing.","example[44]":"‘Jamie’s won a holiday in Hawaii.’ ‘The lucky devil!’","definition[16]":"used to emphasize that the person, place, or thing you are mentioning is the famous one, or the best or most fashionable one. ‘The’ is pronounced strongly or written in a special way","example[45]":"‘Elizabeth Taylor was there.’ ‘Not the Elizabeth Taylor, surely?’","example[46]":"Miami is THE place for girls who like to live life to the full.","definition[17]":"used before the names of certain common illnesses","example[47]":"If one of the children got the measles, we all got the measles.","explanation[0]":"Don’t use the with uncountable or plural nouns to talk about a general type of thing You say","example[48]":"I like music","example[49]":"We use computers","explanation[1]":"Don’t use the with the name of a language You say","example[50]":"Do you speak English?","explanation[2]":"Don’t use the with school, prison, college, university, or church when you are talking about them in a general way You say","example[51]":" Children start school at 4 or 5","example[52]":" She spent a year in prison","explanation[3]":"You don’t use the with times and months, or normally with days You say","example[53]":"at midnight","example[54]":"on Tuesday","example[55]":"in May","explanation[4]":"You don’t normally use the with meals You say","example[56]":"Have you had breakfast?","example[57]":"Come round after dinner","explanation[5]":"You don’t normally use the with the name of a place You say","example[58]":"This is Downing Street","example[59]":"We flew to Boston","example[60]":"They love Japan","explanation[6]":"Use the when you are talking about something specific or something that the reader or listener already knows about You say","example[61]":"I didn’t like the music in the film","example[62]":"All the computers  (=the computers in this building) are down","example[63]":"They go to the school in the village","explanation[7]":"Use the with days when saying which specific one you mean You say","example[64]":"on the Tuesday before Christmas","explanation[8]":"Some places have the as part of their name","example[65]":"the Bronx","example[66]":"the UK","example[67]":"the Andes","example[68]":"the Mississippi","example[69]":"the Atlantic","definition[18]":"used before two comparative adjectives or adverbs to show that the degree of one event or situation is related to the degree of another one","example[70]":"The more he eats the fatter he gets.","example[71]":"‘When do you want it?’ ‘The sooner the better.’","definition[19]":"used before an adjective or adverb to emphasize that something is bigger, better etc than all others, or as big, good etc as it is possible for it to be","example[72]":"He likes you the best.","example[73]":"I had the worst headache last night.","definition[20]":"another form of theo-"}