{"word[0]":"waste","signpost[0]":"bad use","definition[0]":"when something such as money or skills are not used in a way that is effective, useful, or sensible","example[0]":"What a waste of all that good work!","example[1]":"excessive waste in state spending","example[2]":"Being unemployed is such a waste of your talents.","note[0]":"waste of","example[3]":"Many believe that state aid is a waste of taxpayers’ money.","signpost[1]":"unwanted materials","definition[1]":"unwanted materials or substances that are left after you have used something","example[4]":"The emphasis now is on recycling waste.","heading[0]":"– Meaning 4: unwanted materials or substances that are left after you have used something","collocation[0]":"recycle waste","example[5]":"How much of our household waste is recycled?","collocation[1]":"dispose of waste","example[6]":"environmentally friendly ways to dispose of waste","collocation[2]":"dump waste","example[7]":"They were fined for illegally dumping waste.","collocation[3]":"incinerate waste","example[8]":"For many years, solid waste was incinerated.","collocation[4]":"reprocess waste","example[9]":"The plant reprocesses nuclear waste.","collocation[5]":"household/domestic waste","example[10]":"Newspapers and magazines make up 10% of household waste.","collocation[6]":"industrial/chemical waste","example[11]":"pollution caused by industrial waste","collocation[7]":"hazardous/toxic waste","example[12]":"the illegal dumping of hazardous waste","collocation[8]":"radioactive/nuclear waste","example[13]":"plans for the safe transportation of radioactive waste","collocation[9]":"organic waste","example[14]":"Organic waste can be composted to make garden fertilizer.","collocation[10]":"human waste","example[15]":"The prison was full of the smell of human waste.","form[0]":"waste + NOUN","collocation[11]":"a waste pipe","example[16]":"a washing machine waste pipe","signpost[2]":"not use sensibly","definition[2]":"to use more money, time, energy etc than is useful or sensible","example[17]":"Leaving the heating on all the time wastes electricity.","example[18]":"Don’t waste your money on that junk!","note[1]":"waste something on somebody/something","signpost[3]":"not use fully","definition[3]":"to not make full use of someone or something","example[19]":"Hannah is wasted in that clerical job.","example[20]":"His talents were being wasted as a lawyer.","explanation[0]":"Waste is usually passive in this meaning","signpost[4]":"harm somebody","definition[4]":"to kill someone, severely injure them, or defeat them","definition[5]":"waste materials, substances etc are unwanted because the good part of them has been removed","definition[6]":"waste land is empty or not looked after by anyone","definition[7]":"unwanted materials or substances that are left after a particular process","example[21]":"The factory’s byproduct waste is used to feed pigs.","example[22]":"illegal disposal ofhazardous waste","example[23]":"Our primary business is industrial waste collection, treatment and disposal services.","example[24]":"government guidelines fortoxic waste disposal","definition[8]":"things such as money or skills that should be used effectively, but are not","example[25]":"Try as he might, the new manager couldn’t overcome the waste and inefficiency that had plagued the plant for years.","example[26]":"Sales of natural gas at present prices would be awaste of companyassets.","definition[9]":"to use more of something, especially time or money, than you need to, or use it in a way that is not sensible","example[27]":"A prominent economist has suggested that the government wasted $200 billion during the oil-price boom.","example[28]":"We waste a lot of time and legal fees on defending our trademarks rather than tending to business."}