{"word[0]":"just","example[0]":"A good strong cup of coffee is just what I need right now.","example[1]":"The house was large and roomy; just right for us.","example[2]":"She looks just like her mother.","example[3]":"Just what do you think you’re trying to do?","example[4]":"Just then (=exactly at that moment), Mrs Robovitch appeared at the bedroom door.","example[5]":"Just as (=at the exact moment when) I opened the door, the telephone started to ring.","example[6]":"A nice hot bath – just the thing (=exactly the right thing) to relax sore muscles.","example[7]":"It’s just on three o’clock.","note[0]":"just on","definition[0]":"nothing more than the thing, amount, action etc that you are mentioning","example[8]":"It’s nothing serious – just a small cut.","example[9]":"Don’t be too hard on him – he’s just a kid.","example[10]":"Can you wait just a few minutes?","example[11]":"It’s not just me – there are other people involved as well.","explanation[0]":"In written English, people often prefer to use simply rather than just, which sounds rather informal:","example[12]":"It’s simply a question of priorities.","definition[1]":"only a short time ago","example[13]":"John’s just told me that he’s getting married.","example[14]":"I’ve just been out shopping.","definition[2]":"at this moment or at that moment","example[15]":"Wait a minute – I’m just coming.","example[16]":"He was just leaving when the phone rang.","example[17]":"I’m just finishing my homework – it won’t take long.","example[18]":"The concert was just about to start.","example[19]":"It just isn’t true.","example[20]":"I just love being in the mountains.","example[21]":"It was just wonderful to see Joyce again.","example[22]":"I just wish I could believe you.","definition[3]":"only by a small amount, time, distance etc","example[23]":"I saw her just before she died.","example[24]":"It’s just under three centimetres long.","example[25]":"We moved here just after our son was born.","note[1]":"just before/after/over etc","definition[4]":"used to show that something which happens almost does not happen","synonym[0]":"barely","example[26]":"He just managed to get home before dark.","example[27]":"We could just see the coast of France in the distance.","example[28]":"Those pants only just fit you now.","example[29]":"She was earning just enough money to live on  (=enough but not more than enough).","definition[5]":"used when politely asking something or telling someone to do something","example[30]":"Could I just say a few words before we start?","example[31]":"Would you just explain to us how the system works.","definition[6]":"used when firmly telling someone to do something","example[32]":"Look, just shut up for a minute!","example[33]":"Now, just listen to what I’m telling you.","explanation[1]":"Just comes before a main verb","example[34]":"I just saw him","explanation[2]":"Just comes after ‘be’ when it is the main verb","example[35]":"She is just seventeen","explanation[3]":"Just comes after the first auxiliary verb","example[36]":"I have just seen him","bad_example[0]":"I just have seen him","definition[7]":"morally right and fair","example[37]":"Henry sincerely believed that he was fighting a just war.","example[38]":"a just settlement","example[39]":"Charlemagne was respected as a just ruler.","definition[8]":"deserved by someone","example[40]":"a just reward for their loyal service","example[41]":"What would be a just punishment for such a crime?","example[42]":"I hope that he’s caught and gets his just deserts (=is punished in the way he deserves)."}