{"word[0]":"hire","definition[0]":"to pay money to borrow something for a short period of time","example[0]":"The best way to explore the island is to hire a car.","example[1]":"What does it cost to hire a boat for a week?","definition[1]":"to employ someone for a short time to do a particular job","example[2]":"Employers hire skilled people on fixed-term contracts.","example[3]":"A City lawyer has been hired to handle the case.","note[0]":"hire somebody to do something","definition[2]":"to employ someone","example[4]":"Businesses may only hire foreign workers where an American cannot be found.","example[5]":"the power to hire and fire (=employ and dismiss people)","definition[3]":"an arrangement in which you pay a sum of money to borrow something for a short time","example[6]":"a car hire company","example[7]":"boats for hire","note[1]":"for hire","example[8]":"The crane is on hire from a local firm.","note[2]":"on hire","definition[4]":"to employ a person or an organization for a short time to do a particular job for you","example[9]":"The company has hired an investment banking firm to assist with managing its pension fund.","definition[5]":"to agree to give someone a permanent job","example[10]":"The company has just hired 250 new staff.","example[11]":"The board hashired and fired a number of top chief executives in the past few years.","example[12]":"He was hired as the company’s chairman last year.","note[3]":"hire somebody as something","definition[6]":"to pay money to use something for a period of time","example[13]":"You can hire a car at the airport.","definition[7]":"an arrangement by which someone borrows something for a period of time in exchange for money","synonym[0]":"RENTAL","example[14]":"All our equipment is available for hire.","example[15]":"The engine is on hire from a local firm.","example[16]":"We want to keep hire charges on plant and machinery to a minimum.","definition[8]":"someone who starts to work for an organization","synonym[1]":"RECRUIT","example[17]":"The firm’s hires included economist Richard Hoey and investment strategist Joseph Cohen.","example[18]":"Nearly half Andersen’s new hires are women."}