{"word[0]":"optimism","definition[0]":"a tendency to believe that good things will always happen","opposite[0]":"pessimism","example[0]":"Recent results must give some cause for optimism.","note[0]":"grounds/cause/reason for optimism","example[1]":"There are grounds for cautious optimism.","example[2]":"a new sense of optimism in the country","note[1]":"mood/sense of optimism","example[3]":"There was optimism that an agreement could be reached.","note[2]":"optimism (that)","example[4]":"I don’t share his optimism about our chances of success.","note[3]":"optimism about","collocation[0]":"great optimism","example[5]":"The team was in a mood of great optimism.","collocation[1]":"considerable optimism","example[6]":"These figures indicate that we can go into next year with considerable optimism.","collocation[2]":"cautious/guarded optimism","example[7]":"The U.N. sees cause for cautious optimism in what has been achieved so far.","example[8]":"He expressed guarded optimism about the company's future.","collocation[3]":"false optimism","example[9]":"In his speech he warned against false optimism about the immediate future.","collocation[4]":"initial/early optimism","example[10]":"There was initial optimism about a breakthrough in relations between the two countries.","collocation[5]":"new/renewed optimism","example[11]":"The new leadership has brought renewed optimism.","collocation[6]":"express optimism","example[12]":"Diplomats expressed optimism about the progress of the talks.","collocation[7]":"share somebody's optimism","example[13]":"After so many problems, I found it hard to share his optimism.","collocation[8]":"optimism grows","example[14]":"His optimism grew as the time came nearer for his release.","collocation[9]":"optimism prevails/reigns","example[15]":"Despite the crisis, optimism prevailed.","collocation[10]":"be grounds/cause/reason for optimism","example[16]":"The lower crime figures are certainly grounds for optimism.","collocation[11]":"a mood/sense of optimism","example[17]":"A mood of optimism prevails in the White House.","collocation[12]":"a wave/surge of optimism","example[18]":"The team are riding a wave of optimism after their recent victory.","collocation[13]":"be (little/no) room for optimism","example[19]":"There is little room for optimism in the current financial situation.","collocation[14]":"be full of optimism","example[20]":"The 1970s began full of optimism and confidence about world development .","definition[1]":"a feeling or belief that things will get better or be more successful in the future","example[21]":"There is an air of optimism now in Taiwan.","example[22]":"Shares gained from renewed optimism about interest-rate cuts."}