{"word[0]":"dispute","definition[0]":"a serious argument or disagreement","example[0]":"The firm is involved in a legal dispute with a rival company.","note[0]":"dispute with","example[1]":"He got into a dispute over a taxi fare.","note[1]":"dispute over","example[2]":"the bitter border dispute between the countries","note[2]":"dispute between","collocation[0]":"resolve/settle a dispute","example[3]":"It is hoped that the dispute can be resolved peacefully.","collocation[1]":"be involved in a dispute","example[4]":"The US government became involved in a dispute with China.","collocation[2]":"get into a dispute","example[5]":"We don’t want to get into a dispute with them.","collocation[3]":"be in dispute with somebody","example[6]":"He was in dispute with the company about his contract.","collocation[4]":"be locked in a dispute","example[7]":"Workers and management are locked in a bitter dispute.","collocation[5]":"a dispute arises","example[8]":"Sometimes a dispute arises between the seller and the buyer.","form[0]":"ADJECTIVES/NOUN + dispute","collocation[6]":"a bitter/fierce dispute","example[9]":"It caused a bitter dispute between the neighbouring republics.","collocation[7]":"a long-running dispute","example[10]":"India’s long-running dispute with Pakistan","collocation[8]":"an industrial dispute","example[11]":"A lot of working days are lost through industrial disputes.","collocation[9]":"a pay dispute","example[12]":"The pay dispute involved 450 staff.","collocation[10]":"a political/legal dispute","example[13]":"There was a long legal dispute between the two companies.","collocation[11]":"a domestic dispute","example[14]":"The court heard that he had been stabbed during a domestic dispute.","collocation[12]":"a border dispute","example[15]":"a border dispute between Argentina and Chile","collocation[13]":"a territorial dispute","example[16]":"The war started as the result of a territorial dispute.","definition[1]":"to say that something such as a fact or idea is not correct or true","example[17]":"The main facts of the book have never been disputed.","example[18]":"Few would dispute that travel broadens the mind.","note[3]":"dispute that","definition[2]":"to argue or disagree with someone","example[19]":"What happened next is hotly disputed.","example[20]":"Hazlitt, though much younger, was soon disputing with Wordsworth on equal terms.","note[4]":"dispute (something) with somebody","definition[3]":"to try to get control of something or win something","example[21]":"Soviet forces disputed every inch of ground.","definition[4]":"a serious disagreement between two groups of people, especially a disagreement between workers and their employers in which the workers take action to protest","example[22]":"The amount of working time lost through disputes and stoppages has fallen dramatically.","example[23]":"a pay dispute involving 450 staff","example[24]":"Several disputes have broken out between businesses competing for the best locations.","example[25]":"their long-running dispute over copyright","definition[5]":"if two groups of people are in dispute, they are involved in a disagreement","example[26]":"The EU is in dispute with the German government over the level of their production subsidies."}