{"word[0]":"politician","definition[0]":"someone who works in politics, especially an elected member of the government","example[0]":"politicians who are trying to get the minority vote","example[1]":"a British Labour politician","definition[1]":"someone who is skilled at dealing with people or using the situation within an organization to gain an advantage","example[2]":"the office politician","form[0]":"ADJECTIVES/NOUN + politician","collocation[0]":"a Labour/Republican etc politician","example[3]":"Her mother was a Labour politician.","collocation[1]":"an opposition politician","example[4]":"Opposition politicians argued that there was not enough reason to go to war.","collocation[2]":"a left-wing/right-wing politician","example[5]":"He had been under attack from right-wing politicians for some time.","collocation[3]":"a leading/prominent politician","example[6]":"The scandal ruined the careers of several leading politicians.","collocation[4]":"a senior politician","example[7]":"Talks between senior politicians in Zagreb and Belgrade took place.","collocation[5]":"a local politician","example[8]":"The plan is strongly supported by local politicians.","collocation[6]":"an elected politician","example[9]":"Are the country’s elected politicians trustworthy?","collocation[7]":"popular","example[10]":"He is the most popular politician in the country.","collocation[8]":"corrupt","example[11]":"They make quiet deals with corrupt politicians.","collocation[9]":"astute/shrewd","example[12]":"He proved to be an astute politician.","example[13]":"senior politicians","display[0]":"statesman","definition[2]":"a political or government leader, especially one who is well-respected","example[14]":"a respected elder statesman","example[15]":"great statesmen like Roosevelt and Churchill","example[16]":"He would later describe the king as ‘one of the most brilliant statesmen I have ever been privileged to meet’.","display[1]":"MP/Member of Parliament","definition[3]":"in Britain, someone who has been elected to a parliament to represent people from a particular area of the country","example[17]":"Ken Newton, MP","display[2]":"congressman","definition[4]":"a man who is a member of a congress, especially the US House of Representatives","example[18]":"a Republican congressman","display[3]":"congresswoman","definition[5]":"a woman who is a member of a congress, especially the US House of Representatives","example[19]":"Mrs McKinney was the state’s first black congresswoman.","display[4]":"senator","definition[6]":"a member of the senate, especially in the US","example[20]":"Senator Clinton","display[5]":"representative","definition[7]":"in the US, a member of the House of Representatives","example[21]":"Democratic Representatives","display[6]":"mayor","definition[8]":"someone who has been elected to lead the government of a town or city","example[22]":"Boris Johnson was elected mayor of London.","example[23]":"the former New York mayor, Rudy Giuliani","display[7]":"spin doctor","definition[9]":"someone who is used by a political party to influence people’s opinions by cleverly controlling what is reported in the news","example[24]":"The party spin doctors would like us to believe that the government is committed to improving the environment."}