{"word[0]":"lock","signpost[0]":"fasten something","definition[0]":"to fasten something, usually with a key, so that other people cannot open it, or to be fastened like this","example[0]":"Did you lock the car?","example[1]":"I can’t get this drawer to lock.","signpost[1]":"keep in a safe place","definition[1]":"to put something in a place and fasten the door, lid etc with a key","example[2]":"Lock the cat in the kitchen.","note[0]":"lock something in something","signpost[2]":"fixed position","definition[2]":"to become fixed in one position and impossible to move, or to make something become fixed","example[3]":"The wheels suddenly locked.","example[4]":"A moment later they were locked in an embrace  (=holding each other very tightly in a loving or friendly way).","example[5]":"Their eyes locked together  (=they could not look away from each other) for an instant.","example[6]":"He locked his hands around the younger man’s throat.","note[1]":"lock something around/round something","signpost[3]":"fixed situation","definition[3]":"if you are locked in a situation, you cannot get out of it","example[7]":"The two groups are locked in a vicious cycle of killing.","note[2]":"be locked in/into something","example[8]":"The company is locked into a five-year contract.","explanation[0]":"Lock is usually passive in this meaning","signpost[4]":"fastening","definition[4]":"a thing that keeps a door, drawer etc fastened and is usually opened with a key or by moving a small metal bar","example[9]":"I’m sorry, there isn’t a lock on the bathroom door.","example[10]":"The key turned stiffly in the lock.","example[11]":"a bike lock","definition[5]":"a small number of hairs on your head that grow and hang together","example[12]":"He gently pushed a lock of hair from her eyes.","note[3]":"lock of","definition[6]":"someone’s hair","example[13]":"long flowing locks","signpost[5]":"on a river etc","definition[7]":"a part of a canal or river that is closed off by gates so that the water level can be raised or lowered to move boats up or down a slope","signpost[6]":"in a fight","definition[8]":"a hold which wrestlers use to prevent their opponent from moving","example[14]":"a head lock","definition[9]":"the degree to which a vehicle’s front wheels can be turned in order to turn the vehicle","signpost[7]":"rugby","definition[10]":"a playing position in the game of rugby","definition[11]":"if two people or organizations lock horns, they start being involved in a serious disagreement or struggle with each other","example[15]":"Mr. Lorenzo locked horns with union representatives in his efforts to turn around the struggling business.","definition[12]":"if two people or organizations are locked in a battle, they are involved in a serious disagreement or struggle against each other","example[16]":"The two networks are locked in a close ratings battle.","example[17]":"The unions are locked in difficult negotiations with the company.","definition[13]":"to have complete control of something","example[18]":"The firm now has an 85% lock on the market.","example[19]":"Between them the two airlines have a virtual lock on domestic air traffic.","definition[14]":"to limit or control something","example[20]":"These currency controls put a lock on Pakistan’s dealings with the larger world."}