{"word[0]":"survival","definition[0]":"the state of continuing to live or exist","example[0]":"The doctors gave him a one in ten chance of survival.","example[1]":"A lot of small companies are having to fight for survival (=work hard in order to continue to exist).","example[2]":"Illegal hunting is threatening the survival of the species.","note[0]":"survival of","collocation[0]":"long-term survival","example[3]":"The long-term survival of polar bears is at risk.","collocation[1]":"continued survival","example[4]":"The continued survival of this species of dolphin seems unlikely.","collocation[2]":"economic survival","example[5]":"Both countries depend on wildlife-based tourism for their economic survival.","collocation[3]":"political survival","example[6]":"The prime minister is fighting for his political survival.","form[0]":"survival + NOUN","collocation[4]":"the survival rate","example[7]":"The survival rate of animals returned to the wild remains an unanswered question.","collocation[5]":"somebody’s survival instinct","example[8]":"My survival instinct told me to get up and run.","collocation[6]":"survival skills","example[9]":"They learned survival skills from the local Indian tribe.","collocation[7]":"a survival strategy","example[10]":"The best survival strategy is to avoid putting yourself in unnecessary danger.","collocation[8]":"fight/struggle for survival","example[11]":"Many construction companies are fighting for survival.","collocation[9]":"ensure the survival of something/somebody","example[12]":"Controlling land development would ensure the survival of many types of wildlife.","collocation[10]":"owe your survival to somebody/something","example[13]":"The frogs owe their survival to a conservation program.","collocation[11]":"somebody’s chance(s) of survival","example[14]":"He knew that his chances of survival were small.","collocation[12]":"somebody’s fight/struggle/battle for survival","example[15]":"Their lives had been one long struggle for survival.","definition[1]":"the state of continuing to exist, even though a situation is difficult","example[16]":"The change of strategy will ensure the firm’seconomic survival.","example[17]":"Survival in commercial business often depends on a company’s ability to expand its product line.","definition[2]":"a situation in which only the strongest and most successful people, organizations etc continue to exist","example[18]":"In today’s business climate, survival of the fittest means survival of the fastest to respond to the changing market."}