{"word[0]":"disabled","definition[0]":"someone who is disabled cannot use a part of their body properly, or cannot learn easily","note[0]":"disabled parking/toilet/access etc (=for physically disabled people)","example[0]":"a support group for parents of disabled children","example[1]":"a severely disabled polio patient","example[2]":"teachers who work with learning disabled children  (=children who have problems learning)","example[3]":"If you are elderly or physically disabled, massage can be beneficial.","note[1]":"physically/mentally disabled","definition[1]":"not able to use a part of your body properly or not able to learn normally, because of a permanent problem","example[4]":"Disabled people should have the same rights and choices as everyone else.","example[5]":"Elaine is severely disabled and relies on 24 hour care.","example[6]":"The charity provides opportunities and facilities for disabled people to take part in sport.","display[0]":"special needs","definition[2]":"if someone has special needs, they have physical or mental disabilities","example[7]":"a school for children with special needs","example[8]":"A woman whose five-year-old son has special needs has accused her local education authority of failing to provide him with a decent education.","display[1]":"learning difficulties/disabilities","definition[3]":"if someone has learning difficulties, they have difficulty learning basic skills or information","example[9]":"A child’s behavioural problems may be associated with learning difficulties.","example[10]":"special courses for students with moderate learning difficulties","display[2]":"handicapped","definition[4]":"disabled – this word is old-fashioned and is now considered offensive. It is better to say that someone has learning difficulties or has special needs.","display[3]":"wheelchair user","definition[5]":"someone who is in a wheelchair because they cannot walk","example[11]":"There is easy access for wheelchair users.","display[4]":"paraplegic","definition[6]":"someone who is unable to move the lower part of their body, including their legs","example[12]":"He had a riding accident, which left him a paraplegic.","display[5]":"quadriplegic","definition[7]":"someone who is permanently unable to move any part of their body below their neck"}