{"word[0]":"spy","plural[0]":"spies","definition[0]":"someone whose job is to find out secret information about another country, organization, or group","synonym[0]":"secret agent","note[0]":"spy plane/satellite","example[0]":"She worked as a spy for the American government.","collocation[0]":"work as a spy","example[1]":"He died while working as a government spy.","collocation[1]":"be arrested/imprisoned/shot etc as a spy","example[2]":"Anyone caught working with the Resistance was shot as a spy.","form[0]":"ADJECTIVES/NOUN + spy","collocation[2]":"a British/American etc spy","example[3]":"He was arrested on suspicion of being an American spy.","collocation[3]":"a foreign spy","example[4]":"The activities of foreign spies have increased.","collocation[4]":"an enemy spy","example[5]":"He gave information to enemy spies.","collocation[5]":"a government spy","example[6]":"They thought I was a government spy.","form[1]":"spy + NOUN","collocation[6]":"a spy story/novel/movie etc","example[7]":"John le Carré is famous for writing spy stories.","example[8]":"one of the most exciting spy movies of all time","collocation[7]":"a spy ring","example[9]":"He was well informed through his network of spies.","collocation[8]":"a spy satellite/plane","example[10]":"The Americans have denied using spy satellites to spy on China.","example[11]":"The photographs were taken by spy planes.","collocation[9]":"a spy chief","example[12]":"Britain's first woman spy chief","example[13]":"John le Carré’s fictional spy master George Smiley","definition[1]":"someone whose job is to find out secret information about another country","example[14]":"Stalin controlled a network of spies.","example[15]":"The film is basically a spy story.","display[0]":"agent/secret agent","definition[2]":"someone who works for a government or police department in order to get secret information about another country or organization","example[16]":"a secret agent working for MI5","example[17]":"He is the FBI’s best undercover agent (=one who works secretly and pretends to be someone else).","display[1]":"double agent","definition[3]":"someone who finds out an enemy country’s secrets for their own country but who also gives secrets to the enemy","example[18]":"a former CIA double agent who also worked for the KGB","display[2]":"mole","definition[4]":"someone who works for an organization while secretly giving information to its enemies","example[19]":"A mole in the government was leaking information to the press.","display[3]":"informer","definition[5]":"someone who secretly tells the police about criminal activities, especially for money","example[20]":"Acting on information from an informer, the police raided the house.","display[4]":"espionage","definition[6]":"the work that spies do","example[21]":"He is serving a 20-year prison sentence for espionage.","definition[7]":"to secretly collect information about an enemy country or an organization you are competing against","example[22]":"He was charged with spying on British military bases.","note[1]":"spy on","example[23]":"He confessed to spying for North Korea.","note[2]":"spy for","definition[8]":"to suddenly see someone or something, especially after searching for them","synonym[1]":"spot","example[24]":"Ellen suddenly spied her friend in the crowd.","heading[0]":"work that a spy does","display[5]":"spying","definition[9]":"the action of secretly collecting information about a person, country, or organization","example[25]":"Several embassy officials had been arrested for spying.","definition[10]":"spying. Espionage is more formal than spying","example[26]":"Zakharov was charged with espionage.","example[27]":"The company carried out a campaign of industrial espionage against its main rival.","example[28]":"Double agents are quite commonplace in the world of espionage.","display[6]":"surveillance","definition[11]":"activity in which the police, army, etc watch a person or place carefully because they may be connected with criminal activities","example[29]":"24-hour surveillance of the building","example[30]":"The police have had him under surveillance  (=have been watching him)for months.","display[7]":"covert operations","definition[12]":"secret military activities against an enemy","example[31]":"These planes are used by British Intelligence for covert operations."}