{"word[0]":"rescue","definition[0]":"to save someone or something from a situation of danger or harm","example[0]":"Survivors of the crash were rescued by helicopter.","example[1]":"She died trying to rescue her children from the blaze.","note[0]":"rescue somebody/something from somebody/something","definition[1]":"to remove someone from a dangerous, difficult, or unpleasant situation","example[2]":"Firefighters worked for two hours to rescue people from the building.","example[3]":"Will you rescue me if I get stuck talking to Sam?","display[0]":"come to the rescue/somebody’s rescue","definition[2]":"to come and rescue or help someone","example[4]":"It was an embarrassing moment, but fortunately Paul came to the rescue.","example[5]":"Several people saw I was in trouble, but no one came to my rescue.","definition[3]":"to prevent someone from being killed, harmed, or losing something, or to make it possible for something to continue","example[6]":"Wearing a seat belt can help save your life.","example[7]":"They saved the hospital from closure.","example[8]":"If you break down in the desert, there is no one there to save you.","display[1]":"pick somebody up","definition[4]":"to rescue someone from a dangerous place by taking them away in a boat or aircraft","example[9]":"A lifeboat picked them up two miles from the coast.","example[10]":"They spent the night near the top of the mountain, before being picked up by a helicopter.","display[2]":"bail somebody out","definition[5]":"to rescue a person, company etc from a difficult situation, by providing them with the money they need","example[11]":"A number of state-owned enterprises have been bailed out by the central bank.","example[12]":"He owed thousands of pounds and his mother had to bail him out.","definition[6]":"when someone or something is rescued from danger","example[13]":"a daring rescue at sea","example[14]":"Rescue workers arrived at the scene two hours later.","example[15]":"The rescue operation proved successful.","note[1]":"rescue mission/operation","example[16]":"Storms delayed the rescue of the crash victims.","note[2]":"rescue of","collocation[0]":"a dramatic rescue","example[17]":"A woman is in hospital following a dramatic rescue from her blazing flat.","collocation[1]":"a daring rescue","example[18]":"The lifeboat crew has been honoured for a daring rescue on the Cleveland coast.","collocation[2]":"attempt/mount a rescue","example[19]":"The stormy conditions made it impossible to mount a rescue.","form[0]":"rescue + NOUN","collocation[3]":"a rescue attempt/effort","example[20]":"One fire fighter was severely burned in the rescue attempt.","collocation[4]":"a rescue operation/mission","example[21]":"A major rescue operation was launched yesterday after two divers were reported missing.","collocation[5]":"a rescue worker","example[22]":"Rescue workers are searching through the rubble for survivors.","collocation[6]":"a rescue team","example[23]":"He was still conscious when the rescue team arrived.","collocation[7]":"a rescue helicopter/boat/ship","example[24]":"A rescue helicopter is on its way.","collocation[8]":"a rescue plan/package","example[25]":"They drew up a rescue plan that involved restructuring the firm.","definition[7]":"to save a company, country, or economic system that is in danger of failing, for example because of financial problems","example[26]":"The fund is aimed at rescuing financially troubled companies.","example[27]":"efforts to rescue the economy by lowering interest rates","definition[8]":"an occasion when a company, country, or economic system is saved from failing","example[28]":"The company faces bankruptcy unless a rescue can be negotiated.","example[29]":"The International Monetary Fundcame to the rescue.","definition[9]":"an attempt, effort etc to save a company, country, or economic system from failing","example[30]":"It’s an ambitious rescue effort, and some marketing experts question whether the strategy will be effective.","example[31]":"a last-ditch financial rescue package"}