{"past_tense[0]":"lay","past_participle[0]":"lain","third_person_singular[0]":"lies","signpost[0]":"flat position","definition[0]":"to be in a position in which your body is flat on the floor, on a bed etc","example[0]":"The dog was lying dead on the floor.","example[1]":"She would lie awake worrying.","note[0]":"lie still/awake etc","example[2]":"He was lying on the bed smoking a cigarette.","note[1]":"lie on/in etc","example[3]":"Don’t lie in the sun for too long.","example[4]":"For a few minutes he just lay there.","note[2]":"lie there","definition[1]":"to put yourself in a position in which your body is flat on the floor or on a bed","example[5]":"Lie flat on the floor.","note[3]":"lie on","example[6]":"She lay back against the pillows.","note[4]":"lie back","definition[2]":"to be in a flat position on a surface","example[7]":"The papers were lying neatly on his desk.","signpost[1]":"exist","definition[3]":"if a problem, an answer, blame etc lies somewhere, it is caused by, exists, or can be found in that thing, person, or situation","example[8]":"The strength of the book lies in the fact that the material is from classroom experience.","example[9]":"Part of the blame must lie with social services.","note[5]":"fault/blame/responsibility lies with somebody","example[10]":"The difficulty lies in providing sufficient evidence.","note[6]":"the problem/answer etc lies with/in something","example[11]":"And herein lies the key to their achievements.","note[7]":"herein/therein lies the problem/dilemma etc","definition[4]":"if a town, village, etc lies in a particular place, it is in that place","example[12]":"The town lies in a small wooded valley.","example[13]":"The Tasman Sea lies between Tasmania and Australia.","signpost[2]":"future","definition[5]":"if something lies ahead of you, lies in the future etc, it is going to happen to you in the future","example[14]":"I was wondering what lay in store for us.","example[15]":"How will we cope with the difficulties that lie ahead?","note[8]":"lie ahead","example[16]":"A blank and empty future lay before me.","note[9]":"lie before","signpost[3]":"condition","definition[6]":"to be in a particular state or condition","example[17]":"The town now lay in ruins.","example[18]":"The book lay open on the table.","note[10]":"lie empty/open/hidden etc","signpost[4]":"dead person","definition[7]":"if someone lies in a particular place, they are buried there","example[19]":"Here lies Percival Smythe  (=written on a gravestone).","definition[8]":"to deliberately tell someone something that is not true","note[11]":"lie through your teeth (=say something that is completely untrue)","example[20]":"I could tell from her face that she was lying.","example[21]":"I would never lie to you.","note[12]":"lie to","example[22]":"She lied about her age.","note[13]":"lie about","definition[9]":"if a picture, account etc lies, it does not show the true facts or the true situation","example[23]":"Statistics can often lie.","example[24]":"The camera never lies.","display[0]":"lie/tell a lie","example[25]":"She had lied to protect her son.","example[26]":"Are you accusing me of telling lies?","display[1]":"fib","definition[10]":"to lie, especially about something that is not very important – used especially by children","example[27]":"Dan’s fibbing. I didn’t hit him.","display[2]":"make something up/invent something","definition[11]":"to invent a story, explanation etc in order to deceive someone","example[28]":"I didn’t want to go so I made up an excuse and said I was busy.","example[29]":"He invented the tale to prevent his parents from finding out the truth.","display[3]":"mislead","definition[12]":"to make someone believe something that is not true by giving them false or incomplete information","example[30]":"The government misled the public over the war.","display[4]":"be economical with the truth","definition[13]":"to only tell someone part of the truth – often used when saying indirectly that someone is lying","example[31]":"He admitted that he had perhaps been economical with the truth.","display[5]":"perjure yourself/commit perjury","definition[14]":"to tell a lie in a court of law","example[32]":"He had perjured himself in court.","example[33]":"Witnesses will be prosecuted if they commit perjury.","definition[15]":"something that you say or write that you know is untrue","example[34]":"I always know when he’s telling lies.","example[35]":"I knew that soon she would hear the lies about me.","collocation[0]":"tell (somebody) a lie","example[36]":"He got into trouble for telling a lie.","collocation[1]":"believe a lie","example[37]":"How could you believe his lies?","collocation[2]":"spread lies","example[38]":"How dare you spread such vicious lies?","collocation[3]":"a complete/total/outright lie","example[39]":"Of course the whole thing was a complete lie.","example[40]":"She didn't want to tell her mother an outright lie.","collocation[4]":"a white lie","example[41]":"We all have to tell white lies sometimes.","collocation[5]":"a downright lie","example[42]":"That’s a downright lie. I never said any such thing!","collocation[6]":"a vicious lie","example[43]":"He told the court that it was a vicious lie from beginning to end.","collocation[7]":"a blatant lie","example[44]":"He felt sure Adams was not convinced by such blatant lies.","collocation[8]":"a barefaced lie","example[45]":"How can you stand there and tell me such a barefaced lie?","collocation[9]":"an elaborate lie","example[46]":"Her parents didn’t realise that it was all an elaborate lie.","collocation[10]":"a big lie","example[47]":"The lawyer said it was a ‘big lie’ that Jones had not received the message.","collocation[11]":"a pack of lies","example[48]":"Everything he had told me was a pack of lies.","definition[16]":"something you say or write that you know is untrue","example[49]":"Would you tell lies to protect a friend?","example[50]":"The allegation is a complete lie.","display[6]":"white lie","definition[17]":"a lie that you tell to avoid upsetting someone","example[51]":"We all tell white lies sometimes.","definition[18]":"a lie, especially about something that is not very important – used especially by children","example[52]":"Have you been telling fibs?","display[7]":"porky","definition[19]":"a lie – a very informal use","example[53]":"He’s been telling porkies again.","display[8]":"falsehood","definition[20]":"a statement that is not true, especially one that is intended to give people the wrong idea about someone or something","example[54]":"He described the allegations as malicious falsehoods.","display[9]":"untruth","definition[21]":"a lie – used especially when you want to avoid saying the word lie","example[55]":"Some workers go off and tell untruths about the organisations for which they are working.","display[10]":"fabrication","definition[22]":"a story or claim that someone has invented in order to deceive someone, or the act of doing this","example[56]":"The claim was described as a fabrication by the police prosecutor.","example[57]":"He dismissed the charges as pure fabrication.","display[11]":"libel","definition[23]":"the crime of writing lies that could make people have a bad opinion of someone, especially in a newspaper or magazine","example[58]":"She sued the newspaper for libel.","example[59]":"libel laws","display[12]":"slander","definition[24]":"the crime of speaking lies that could make people have a bad opinion of someone, or an untrue statement which does this","example[60]":"He’s threatening to sue them for slander.","example[61]":"a slander on the good name of the company","example[62]":"Linking his name to terrorism was a slander."}