{"word[0]":"follow","signpost[0]":"go after","definition[0]":"to go, walk, drive etc behind or after someone else","example[0]":"Are those men following us?","example[1]":"The patrol car followed the BMW for a few miles and then lost it.","example[2]":"Tom’s already gone out to Rome and his wife and children will follow shortly.","example[3]":"Peggy followed her out onto the landing.","note[0]":"follow somebody into/to etc something","signpost[1]":"happen after","definition[1]":"to happen or do something after something else","example[4]":"The agreement followed months of negotiation.","example[5]":"The assassination of Martin Luther King in 1968 was followed by that of Robert Kennedy.","example[6]":"Most EU countries have signed the agreement and the US is expected to follow shortly (=soon).","example[7]":"After weeks of intense fighting, there followed a brief period of calm.","note[1]":"there follows something","signpost[2]":"come after","definition[2]":"to come directly after something else in a series, list, or order","example[8]":"The chapters that follow deal mainly with mathematics.","example[9]":"In English, the letter Q is always followed by U.","example[10]":"We had vegetable casserole with a fruit salad to follow  (=as part of a meal).","example[11]":"There followed several pages of incomprehensible statistics.","signpost[3]":"do what somebody says","definition[3]":"to do something in the way that someone has told or advised you to do it","example[12]":"He followed the doctor’s advice and had no further trouble.","example[13]":"Follow the instructions very carefully when filling in the form.","example[14]":"They followed the plan that Elizabeth had worked out.","signpost[4]":"do the same thing","definition[4]":"to do the same thing as someone else","example[15]":"Some state schools follow the example of private schools in asking parents to donate money.","example[16]":"Environmentalists are urging the government to follow the lead of Scandinavian countries in this matter.","example[17]":"She’s just like any young woman who enjoys following the latest fashions  (=wearing fashionable clothes).","example[18]":"He does not want to follow his father into a scientific career.","note[2]":"follow somebody into something","signpost[5]":"believe in something","definition[5]":"to believe in and obey a particular set of religious or political ideas","signpost[6]":"go in particular direction","definition[6]":"to continue along a particular road, river etc","example[19]":"I followed the main road up the mountain.","example[20]":"Tom followed the track that leads to the old Roman road.","definition[7]":"to go in the same direction as something else, or to go parallel to something else","example[21]":"The road follows the line of the river.","definition[8]":"to understand something such as an explanation or story","synonym[0]":"grasp","example[22]":"I didn’t quite follow what he was saying.","example[23]":"The plot is a little difficult to follow.","note[3]":"easy/difficult/hard etc to follow","signpost[7]":"be a result","definition[9]":"to be true as a result of something else that is true","example[24]":"It doesn’t necessarily follow that you’re going to do well academically even if you’re highly intelligent.","example[25]":"The conclusion that follows from these findings is that inner city schools need more investment, not less.","note[4]":"follow from","signpost[8]":"be interested","definition[10]":"to be interested in something and in the way it develops","example[26]":"Have you been following that crime series on TV?","example[27]":"I’ve been following his progress very closely.","example[28]":"She just doesn’t understand people who follow football or any other kind of sport.","signpost[9]":"be about","definition[11]":"to show or describe someone’s life or a series of events, for example in a film or book","example[29]":"The book follows the plight of an orphaned Irish girl who marries into New York society.","signpost[10]":"watch carefully","definition[12]":"to carefully watch someone do something","example[30]":"She followed Simon with her eyes as he walked to the gate.","signpost[11]":"think about/study","definition[13]":"to study or think about a particular idea or subject and try to learn something from it","example[31]":"It turned out we were both following the same line of research.","example[32]":"If you follow that idea to its logical conclusion, we’d have to ban free speech altogether.","definition[14]":"to look at the messages sent by a particular person using the social networking service Twitter","definition[15]":"to walk, drive etc behind or after someone, for example in order to see where they are going","example[33]":"The man had followed her home to find out where she lived.","example[34]":"Follow that car!","example[35]":"He hired a detective to follow her.","display[0]":"chase","definition[16]":"to quickly run or drive after someone or something in order to catch them when they are trying to escape","example[36]":"Police chased the car along the motorway at speeds of up to 90 mph.","display[1]":"run after somebody/go after somebody","definition[17]":"to quickly follow someone or something in order to stop them or talk to them","example[37]":"I ran after him to say sorry, but he’d already got on the bus.","display[2]":"stalk","definition[18]":"to secretly follow an animal in order to kill it, or to secretly follow a person in order to attack them","example[38]":"a tiger stalking its prey","example[39]":"He had a long history of stalking women in his neighbourhood.","display[3]":"pursue","definition[19]":"to chase someone in a very determined way","example[40]":"The ship was being pursued by enemy submarines.","display[4]":"give chase","definition[20]":"to chase someone or something who is trying to escape from you","example[41]":"One of the officers gave chase and arrested the man.","example[42]":"The calf ran away and the lion gave chase.","display[5]":"tail","definition[21]":"to secretly follow someone in order to watch what they do and where they go","example[43]":"Apparently, the police had been tailing the terrorists for months.","display[6]":"track","definition[22]":"to follow and find a person or animal by looking at the marks they leave on the ground","example[44]":"The bushmen were tracking antelope in the Kalahari desert.","definition[23]":"to come or happen afterwards","example[45]":"The company’s decision to diversify follows a sharp decline in demand for its products.","example[46]":"As the recession worsened, further closures followed.","definition[24]":"to be sent or paid later","example[47]":"You can pay a deposit of £400 now, with the balance to follow within 30 days.","definition[25]":"to do something in the way that someone has told or advised you to do it, or according to the instructions that say how it should be done","example[48]":"If you’d followed my advice, we’d still be in profit.","example[49]":"The contractor was fined for failing to follow proper safety procedures.","example[50]":"Just follow the guidelines contained in this report.","definition[26]":"to act according to a particular plan or set of ideas","example[51]":"The Chancellor is expected to follow a cautious economicpolicy.","example[52]":"The company had followed the wrong strategy.","definition[27]":"to happen or develop in the same way as something else","example[53]":"These recent mergers appear to be following a trend.","example[54]":"If one company drops its prices, the others have to follow suit (=do the same thing).","definition[28]":"to do a particular job or trade","example[55]":"He intends to follow a legal career."}