{"signpost[0]":"on paper/on the ground","definition[0]":"a long thin mark on a piece of paper, the ground, or another surface","example[0]":"Draw a straight line across the top of the page.","example[1]":"Sign your name on the dotted line (=line made up of a series of dots).","example[2]":"The edges of the pitch are marked by white lines.","example[3]":"The goalkeeper just managed to stop the ball going over the line.","example[4]":"He raced towards the finishing line.","signpost[1]":"between two areas","definition[1]":"an imaginary line on the surface of the Earth, for example showing where one country or area of land stops and another begins","example[5]":"He was born in a small town just across the state line.","note[0]":"county/state line","example[6]":"They were still travelling along the same line of longitude.","note[1]":"line of latitude/longitude","signpost[2]":"of people/things","definition[2]":"a row of people or things next to each other","example[7]":"The four men were standing in a line on the other side of the table.","example[8]":"A couple of the posts were out of line (=not in a straight row).","example[9]":"There was a line of fir trees on either side of the road.","note[2]":"line of","definition[3]":"a row of people, cars etc that are waiting one behind the other","example[10]":"I looked in despair at the long line in front of the ticket office.","example[11]":"He tried to cut in line (=go in front of other people who are waiting).","example[12]":"The woman next in line began to mutter to herself.","example[13]":"Customers stood in line for 20 minutes at the cash register.","note[3]":"stand/wait in line","example[14]":"I joined the line of vehicles waiting to get into the car park.","definition[4]":"the direction or imaginary line along which something travels between two places","example[15]":"Light travels in a straight line.","example[16]":"A boat came into my line of vision (=the direction I was looking in).","example[17]":"They knew they needed to block their enemy’s supply lines (=the direction used for carrying supplies of food etc).","example[18]":"I was directly in the animal’s line of attack.","note[4]":"line of fire/attack/movement etc","signpost[3]":"on your face","definition[5]":"a line on the skin of someone’s face","example[19]":"She frowned, and deep lines appeared between her eyebrows.","example[20]":"There were fine lines around her eyes.","example[21]":"No one can avoid lines and wrinkles as they get older.","definition[6]":"a telephone wire or connection","example[22]":"I’m sorry, the line is busy (=someone is already using it).","example[23]":"There seems to be a fault on the line.","example[24]":"There was a click, then the line went dead (=suddenly stopped working completely).","example[25]":"Henry is on the line (=on the phone) from New York.","example[26]":"I got on the line to (=phoned) the hospital as soon as I heard about the accident.","example[27]":"I wished he would just get off the line.","example[28]":"I’m sorry, it’s a bad line and I can’t hear you.","example[29]":"Hold the line (=wait on the phone), please, and I’ll put you through to our sales department.","example[30]":"Do you have a separate line for your modem?","signpost[4]":"for trains","definition[7]":"a track that a train travels along","example[31]":"We were delayed because of a problem further along the line.","example[32]":"When you get to central London, take the Victoria Line to Finsbury Park.","example[33]":"The trail follows a disused railroad line along the edge of the valley.","note[5]":"railway line","signpost[5]":"between two types of thing","definition[8]":"the point at which one type of thing can be considered to be something else or at which it becomes a particular thing","example[34]":"There is a fine line between superstition and religion.","note[6]":"line between","example[35]":"The dividing line between luxuries and necessities is constantly changing.","example[36]":"Sometimes he found it hard to draw the line between work and pleasure.","example[37]":"Her remarks did not quite cross the line into rudeness.","example[38]":"Large numbers of families are living on or near the poverty line (=the point at which people are considered to be very poor).","signpost[6]":"shape/edge","definition[9]":"the outer shape of something long or tall","example[39]":"She was wearing a loose dress which softened the lines of her body.","example[40]":"a modern building with clean, elegant lines.","signpost[7]":"words","definition[10]":"a line of written words, for example in a poem or a document","example[41]":"He quoted a few lines from Shakespeare.","example[42]":"Scroll down to line 29.","definition[11]":"a remark","example[43]":"He liked to introduce himself with a witty opening line.","example[44]":"This was one of his favourite chat-up lines (=remark for impressing someone you want to attract).","definition[12]":"words that someone has to learn and say as part of a play or performance","example[45]":"Paul often messed up his lines.","example[46]":"It always took me ages to learn my lines.","signpost[8]":"opinion/attitude","definition[13]":"an opinion or attitude, especially one that someone states publicly and that influences their actions","example[47]":"Journalists are often too willing to accept the official line (=the opinion that a government states officially).","example[48]":"He found it hard to accept the party line (=the official opinion of a political party) on every issue.","example[49]":"The school takes a very tough line on drugs.","note[7]":"take a tough/firm/hard line on something","example[50]":"I can’t agree with the government’s line on immigration.","note[8]":"line on","signpost[9]":"way of doing something","definition[14]":"a particular way of doing something or of thinking about something","example[51]":"The police are following several different lines of enquiry.","example[52]":"We were both thinking along the same lines (=in the same way).","example[53]":"In South Africa, the press developed along very different lines (=in a very different way).","example[54]":"More groups will now be set up on these lines (=this way).","example[55]":"The company’s rapid success means it’s definitely on the right lines (=doing something the right way).","example[56]":"It seemed useless to pursue this line of questioning.","note[9]":"line of argument/reasoning/inquiry etc","example[57]":"Opposition parties soon realized they would have to try a different line of attack.","signpost[10]":"series of events","definition[15]":"a series of events that follow each other","example[58]":"This is the latest in a long line of political scandals.","signpost[11]":"in a war","definition[16]":"the edge of an area that is controlled by an army, where soldiers stay and try to prevent their enemy from moving forward","example[59]":"They finally broke through the German line.","example[60]":"young soldiers who were sent to the front line to fight","example[61]":"One regiment was trapped behind enemy lines.","example[62]":"Reinforcements were available just behind the lines.","signpost[12]":"in a company/organization","definition[17]":"a series of levels of authority within an organization","example[63]":"Decisions are taken by senior officers and fed down through the line of command to the ordinary soldiers.","example[64]":"There should be more direct discussion between managers and workers lower down the line.","signpost[13]":"of rope/wire","definition[18]":"a piece of strong string, rope, or wire used for a particular purpose","example[65]":"She hung the clothes out on the washing line (=line for hanging wet clothes on to dry).","example[66]":"The fishing line (=line for catching fish) snapped and the fish got away.","definition[19]":"a type of goods for sale in a shop","example[67]":"The company has just launched a new line of small, low-priced computers.","signpost[14]":"family","definition[20]":"your family, considered as the people you are related to who lived before you and the people who will live after you","example[68]":"She comes from a long line of actors.","example[69]":"It looks as if Joe might be the last of the line  (=the last in his family).","example[70]":"This particular gene is passed down through the male line.","note[10]":"the male/female line","example[71]":"Henry the Eighth wanted a male heir to ensure the Tudor line of succession.","note[11]":"line of succession","definition[21]":"the type of work someone does","example[72]":"What line of business is he in?","note[12]":"line of work/business","example[73]":"She’s keen to do something in the fashion line.","note[13]":"in the building/retail etc line","signpost[15]":"transport","definition[22]":"a company that provides transport for moving goods by sea, air, road etc","example[74]":"He runs a transatlantic shipping line.","definition[23]":"an amount of an illegal drug in powder form, arranged in a line so it can be breathed in through the nose","heading[0]":"on the ground/on the surface of something","example[75]":"The teacher put a red line through the first sentence.","example[76]":"If the ball goes over the line, it’s out of play.","display[0]":"groove","definition[24]":"a thin line that has been cut into a surface","example[77]":"Deep grooves had been cut into the stone to channel the water.","example[78]":"Lyle ran his fingernail along the groove in the table.","display[1]":"rut","definition[25]":"a deep line in the ground which has been made by the wheels of vehicles","example[79]":"The deep ruts made by the trucks were full of water.","example[80]":"The tractor’s wheels caught a rut in the field and jolted him.","display[2]":"crease/wrinkle","definition[26]":"a line on clothes, material, or paper where it has been folded or crushed","example[81]":"She was trying to smooth out the creases in her dress.","example[82]":"She had wrinkles in her skirt where she had sat.","heading[1]":"on someone’s face","example[83]":"The deep lines on his forehead showed that he was a worried man.","display[3]":"wrinkle","definition[27]":"a deep line on someone’s face caused by becoming old","example[84]":"The manufacturers claim that the cream will reduce wrinkles.","example[85]":"Even with a few wrinkles, she still looks great.","definition[28]":"to sew a piece of material onto the inside or back of another piece to make it stronger or warmer","example[86]":"Are those curtains lined?","example[87]":"a leather coat lined with silk","note[14]":"line something with something","definition[29]":"to form a layer over the inner surface of something","example[88]":"The birds use small leaves for lining their nests.","example[89]":"The cage should be lined with straw.","definition[30]":"to form rows along the sides of something","example[90]":"Crowds lined the route to the palace.","example[91]":"a tree-lined avenue","example[92]":"The street was lined with small shops.","note[15]":"be lined with something","definition[31]":"a type of product that a company makes or sells, often with several different sizes, models etc","synonym[0]":"RANGE","example[93]":"It continues to get about two-thirds of its revenue from this one product, despite repeated efforts to diversify its product line (=develop new products).","example[94]":"Hasbro, the maker of the G.I. Joe line of dolls","definition[32]":"a team of people who work together, each doing a different job but working to achieve the same thing","definition[33]":"someone’s line of work, business etc is the work that they do","example[95]":"A corporation may get into a certain line of business as a short-term objective to generate cash-flow.","definition[34]":"a company providing a system for moving goods or people by sea, air, road etc","example[96]":"a cartel that shut out rival shipping lines","definition[35]":"a telephone connection, or a telephone number you can call if you have a particular kind of question or problem","example[97]":"Our lines are open 7 days a week.","example[98]":"If you want advice, you can call our Action Line.","definition[36]":"if you ask someone you are speaking to on the telephone to hold the line, you are asking them politely to wait for a short time","example[99]":"If you will please hold the line a moment I will see if Mr Wyatt is available.","definition[37]":"if someone is on the line, they have called you on the telephone","example[100]":"Can’t it wait? I’ve got a client on the line.","definition[38]":"if your job, home etc is on the line, you risk losing it","example[101]":"They have put their homes on the line to do this deal.","example[102]":"If they fail, their reputations are on the line.","definition[39]":"if something changes in line with something else, it changes at the same rate","example[103]":"The value of these stocks is uprated each year in line with changes in the retail price index.","definition[40]":"likely to get something","example[104]":"If he delivers the goods, he should be in line for a job on the committee.","definition[41]":"if you are on line, your computer is connected to other computers or the Internet. If a computer is off line, it is not connected to other computers or the Internet","example[105]":"You can book tickets on line  (=on the Internet).","definition[42]":"if a system, arrangement or new product comes on line, it becomes available","example[106]":"New oil production wells are coming on line.","definition[43]":"to agree officially to something by writing your name on a document","example[107]":"Demand that the repairs are done before you sign on the dotted line.","definition[44]":"in a position where you can be criticized or blamed for something","example[108]":"When things go wrong, company directors are the ones in the firing line."}