{"signpost[0]":"go into","definition[0]":"to go or come into a place","example[0]":"Silence fell as I entered the room.","example[1]":"Few reporters dared to enter the war zone.","definition[1]":"if an object enters part of something, it goes inside it","example[2]":"The bullet had entered his brain.","signpost[1]":"start working","definition[2]":"to start working in a particular profession or organization, or to start studying at a school or university","example[3]":"Both the boys entered the army.","example[4]":"She entered politics in 1996.","example[5]":"He entered the Church (=became a priest) as a young man.","signpost[2]":"start an activity","definition[3]":"to start to take part in an activity, or become involved in a situation","example[6]":"He entered the election as the clear favourite.","example[7]":"The rebels were prepared to enter negotiations (=start discussing something).","definition[4]":"to put information into a computer by pressing the keys","example[8]":"Press the return key to enter the information.","example[9]":"The names are entered into a database.","note[0]":"enter something into something","definition[5]":"if you enter a computer system, you are given permission to use it by the computer","example[10]":"It won’t let you enter without a password.","signpost[3]":"write information","definition[6]":"to write information on a particular part of a form, document etc","example[11]":"Don’t forget to enter your postcode.","example[12]":"Enter your name in the space provided.","note[1]":"enter in/into","signpost[4]":"competition/examination","definition[7]":"to arrange to take part in a race, competition, examination etc, or to arrange for someone else to take part","example[13]":"At least 30 schools entered the competition.","example[14]":"Decisions about when he or she is entered for an examination should be taken very carefully.","note[2]":"enter for","signpost[5]":"period of time","definition[8]":"to begin a period of time when something happens","example[15]":"The economy has entered a period of recession.","example[16]":"The talks have now entered their third week.","note[3]":"enter its third week/sixth day/second year etc","signpost[6]":"start to exist","definition[9]":"if a new idea, thought etc enters your head, or a new quality enters something, it suddenly starts to exist there","example[17]":"A note of panic entered her voice.","example[18]":"It never entered his head that she might be seeing someone else.","note[4]":"it never entered somebody’s head/mind","signpost[7]":"official statement","definition[10]":"to make an official statement","example[19]":"Wilson entered a plea of not guilty  (=said that he was not guilty at the beginning of a court case).","example[20]":"Residents entered a number of objections to the scheme.","explanation[0]":"You enter a place","example[21]":"They entered the building through the front door","bad_example[0]":"They entered into the building","explanation[1]":"You usually use enter into when talking about starting agreements or discussions with someone","display[0]":"go","explanation[2]":"You go into a place","example[22]":"They went into the building through the front door","definition[11]":"to go or come into a place. Enter is more formal than go in","example[23]":"It appears the burglars entered the house through a back window.","example[24]":"Occupying troops entered the town on 8th April.","display[1]":"go in/into something","definition[12]":"to enter a place. Go in/into is the usual phrase to use in everyday English","example[25]":"It was getting cold so we went in.","example[26]":"He went into the cafe and ordered a drink.","display[2]":"come in/into something","definition[13]":"to enter a place – used when you are already in that place","example[27]":"Come in and sit down.","example[28]":"When you come into the village, you’ll see the church on your right.","display[3]":"get in/into something","definition[14]":"to succeed in entering a place, especially when it is difficult or it takes a long time","example[29]":"I’d lost my key so I couldn’t get in.","example[30]":"You can’t get into the club if you are under 18.","display[4]":"break in/into something","definition[15]":"to enter a building using force, for example in order to steal something","example[31]":"If anyone tries to break in, the alarm will go off.","display[5]":"burst in/into something","definition[16]":"to enter a room or building very suddenly and noisily","example[32]":"Two men with guns burst in and told us to lie on the floor.","example[33]":"He burst into my office laughing and screaming like a maniac.","display[6]":"barge in/into something","definition[17]":"to suddenly enter a room where you are not wanted because you are interrupting someone or you were not invited","example[34]":"She just barged into my room without knocking.","example[35]":"You can’t just go barging in.","display[7]":"sneak in/into something","definition[18]":"to enter a place quietly and secretly hoping that no one will notice you","example[36]":"If you’re late, just try and sneak into the back of the class.","display[8]":"slip in/into something","definition[19]":"to enter a place quietly and quickly","example[37]":"Maggie opened the door silently and slipped in.","display[9]":"trespass","definition[20]":"to enter an area of land that belongs to someone else without permission","example[38]":"The sign said ‘Trespassers will be prosecuted’.","example[39]":"Trespassing on the railway is a criminal offence in the UK.","definition[21]":"if people or goods enter a country, they arrive there","example[40]":"A lot of goods are fraudulently and illegally entering the US.","definition[22]":"if a company enters a market, it starts selling goods or services in that market","example[41]":"The financial institution entered the Texas market last year by buying 20 failed banks.","example[42]":"Konica entered the underwater camera market with a basic model costing $8.95.","definition[23]":"if a possible buyer enters a market, they start looking for something to buy there","example[43]":"Property prices soared as more young people entered the housing market.","definition[24]":"if someone enters a financial market, they buy or sell something there","example[44]":"Institutional investors repeatedly entered the market to sell as share prices rallied.","definition[25]":"to write something in an account book, on a list etc","example[45]":"Any deposits received in advance are entered in the cash book.","definition[26]":"to put information into a computer by pressing the KEYs","example[46]":"If a command is entered incorrectly, the machine will not recognize it.","definition[27]":"to legally make an agreement","example[47]":"The change to the law will protect customers who enter a contract as a result of doorstep canvassing.","definition[28]":"to start a particular career","example[48]":"Britain’s agriculture industry could be plunged into crisis as fewer young people enter farming.","definition[29]":"to say that you are guilty or not guilty of a crime in a court of law","example[49]":"He entered a plea of not guilty to the charge of causing death by reckless driving."}