{"word[0]":"process","definition[0]":"a series of actions that are done in order to achieve a particular result","example[0]":"the Israeli–Egyptian peace process","example[1]":"Repetition can help the learning process.","example[2]":"the mental processes involved in decision-making","example[3]":"Getting fit again has been a long slow process.","note[0]":"slow/lengthy/laborious etc process","example[4]":"the process of economic change","note[1]":"process of","definition[1]":"a series of things that happen naturally and result in gradual change","example[5]":"Coal forms by a slow process of chemical change.","example[6]":"the digestive process","example[7]":"the natural process of evolution","definition[2]":"a method of making or producing goods","example[8]":"the car production process","example[9]":"Recycling is an industrial process.","form[0]":"ADJECTIVES/NOUN + process","collocation[0]":"slow","example[10]":"Collecting the data is a slow process.","collocation[1]":"long/lengthy","example[11]":"Try to be patient through the long process of healing.","collocation[2]":"laborious","example[12]":"The copying of manuscripts was a laborious process.","collocation[3]":"complex","example[13]":"Getting a visa can be a complex process.","collocation[4]":"a natural process","example[14]":"Birth is a natural process.","collocation[5]":"a formal process","example[15]":"A decision will only be taken after a formal consultation process.","collocation[6]":"a mental process","example[16]":"Cats have different mental processes from dogs.","collocation[7]":"the learning process","example[17]":"The student is actively involved in the learning process.","collocation[8]":"the peace process","example[18]":"They are frustrated with the lack of progress in the peace process.","collocation[9]":"the decision-making process","example[19]":"Not all staff can participate in the decision-making process.","collocation[10]":"a selection process","example[20]":"An interview normally forms part of the selection process.","collocation[11]":"go through a process","example[21]":"A lot of companies are going through a process of change.","example[22]":"The system underwent a process of simplification.","collocation[12]":"take part in a process","example[23]":"We encourage our clients to participate in the process at every stage.","definition[3]":"to make food, materials, or goods ready to be used or sold, for example by preserving or improving them in some way","example[24]":"Goats’ cheese may be processed in many ways.","example[25]":"Two million workers are employed processing goods for electronic firms.","definition[4]":"to deal with an official document, request etc in the usual way","example[26]":"All university applications are processed through this system.","note[2]":"process an application/claim/transaction etc","definition[5]":"to deal with information using a computer","example[27]":"The new network will enable data to be processed more speedily.","definition[6]":"to print a picture from a photographic film","definition[7]":"to walk or move along in a very slow and serious way, especially as part of a group","definition[8]":"a series of actions taken to perform a particular task or achieve a particular result","example[28]":"simpler design and manufacturing processes","example[29]":"Industry executives said ABC’s plans would slow down the process.","example[30]":"the union’s disciplinary and electoral processes","definition[9]":"to have started doing something that is not yet finished","example[31]":"General Motors is in the process of beginning discussions with potential partners.","definition[10]":"to change a substance as part of the manufacture of a product","example[32]":"The refineries are processing 1.4 million barrels of crude oil a day.","example[33]":"The paper will be processed from pineapple and banana leaves.","definition[11]":"to deal with a document in the usual way","example[34]":"The service was started to help process copyright permissions more rapidly.","example[35]":"The Securities Industry Automation Corp. processes stock quotations from the major exchanges.","definition[12]":"if a computer processes information, figures etc, it uses them to produce a particular result","example[36]":"the accounts are processed by the Systems Union Sun Account system.","example[37]":"facilities for changing, deleting and processing data"}