{"word[0]":"tactic","definition[0]":"a method that you use to achieve something","example[0]":"a tactic employed to speed up the peace process","example[1]":"Republicans accuse Democrats of using delaying tactics (=something you do in order to give yourself more time) to prevent a final vote on the bill.","example[2]":"Shock tactics are being used in an attempt to stop drink drivers.","form[0]":"ADJECTIVES/NOUN + tactic","collocation[0]":"a delaying tactic","example[3]":"His enemies believed that his sickness was just another delaying tactic.","collocation[1]":"scare tactics","example[4]":"He accused the opposition of scare tactics.","collocation[2]":"shock tactics","example[5]":"The charity resorted to shock tactics to try to bring its message home.","collocation[3]":"strong-arm tactics","example[6]":"Others were furious at what they said were government strong-arm tactics over the vote.","collocation[4]":"a diversionary tactic","example[7]":"Before the attack, nearby areas were bombed as a diversionary tactic.","collocation[5]":"underhand/unfair tactics","example[8]":"I wouldn't stoop to such sneaky, underhand tactics.","collocation[6]":"use a tactic","example[9]":"We used various tactics to get their support.","collocation[7]":"employ/adopt a tactic","example[10]":"Many species of fish employ similar defence tactics.","collocation[8]":"change/switch tactics","example[11]":"Manchester United switched tactics in the second half.","collocation[9]":"resort to a tactic","example[12]":"Students resort to these tactics when they see no other way to address the problem.","collocation[10]":"a tactic works","example[13]":"Those tactics won’t work with me anymore – I know you too well.","collocation[11]":"a change of tactics","example[14]":"They trailed 2–1 at half time, but a change of tactics brought a 3–2 win.","example[15]":"Aggressive advertising tactics may mislead consumers.","example[16]":"The union has used every possible delaying tactic (=something you do to give yourself more time)."}