{"word[0]":"maximum","definition[0]":"the maximum amount, quantity, speed etc is the largest that is possible or allowed","opposite[0]":"minimum","example[0]":"The car has a maximum speed of 120 mph.","example[1]":"They made maximum use of the resources available.","example[2]":"To get the maximum benefit, do the exercises slowly.","example[3]":"Display the hologram under a strong light for maximum effect.","example[4]":"The plant is operating at maximum capacity.","example[5]":"The award will consist of a lump sum to a maximum value of $5,000.","example[6]":"Work out the maximum amount you can afford to spend.","note[0]":"maximum amount/number etc","example[7]":"She faces a maximum penalty of life in prison.","note[1]":"maximum sentence/penalty/fine etc","definition[1]":"the largest number or amount that is possible or is allowed","example[8]":"We might have a third child, but that’s the absolute maximum.","example[9]":"He faces a maximum of seven years in prison.","note[2]":"maximum of","example[10]":"The company will reimburse you up to a maximum of $1,000.","collocation[0]":"an absolute maximum","example[11]":"Entries are limited to an absolute maximum of 100 words.","collocation[1]":"the statutory/legal maximum","example[12]":"The legal maximum for election contributions was $1,000.","collocation[2]":"the agreed/stipulated/recommended maximum","example[13]":"A pregnant woman should drink no more than the recommended maximum of 4 units per week.","collocation[3]":"have a maximum","example[14]":"Each submarine will have a maximum of 128 warheads.","collocation[4]":"reach a maximum","example[15]":"These sheep reach a maximum of 70 kg at adulthood.","collocation[5]":"exceed a maximum","example[16]":"The fine must not exceed the statutory maximum.","collocation[6]":"limit/restrict to a maximum","example[17]":"The amount you will have to pay is limited to 10% of the total.","collocation[7]":"allow a maximum","example[18]":"To lose weight, allow yourself only 1,500 calories per day.","definition[2]":"the maximum amount, quantity etc is the largest that is possible or allowed","example[19]":"The maximum cost of the plan would be $9.7 million.","example[20]":"The maximum rate of income tax was cut to 35 percent.","plural[0]":"maxima","example[21]":"The company could be fined a maximum of $10,000."}