{"word[0]":"junior","definition[0]":"having a low rank in an organization or profession","opposite[0]":"senior","example[0]":"a junior doctor","example[1]":"There are several people junior to me  (=with a lower rank than me).","note[0]":"junior to","definition[1]":"relating to sport for young people below a particular age","example[2]":"the junior football club","definition[2]":"relating to a school for children below the age of 11","example[3]":"the junior classrooms","definition[3]":"relating to the year before the final year of high school or college","example[4]":"the second semester of my junior year","definition[4]":"a young person who takes part in sport for people below a particular age","example[5]":"The juniors use the courts on Tuesday night.","definition[5]":"someone who has a low rank in an organization or profession","example[6]":"an office junior","definition[6]":"a child who goes to a junior school","definition[7]":"a student in the year before the final year of high school or college","definition[8]":"a name used humorously when speaking to or about a boy or a younger man, especially your son","example[7]":"Where’s Junior?","definition[9]":"used after the name of a man or boy who has the same name as his father","example[8]":"John F. Kennedy, Jr.","definition[10]":"used after the name of a man who has the same name as his father, especially in the US","example[9]":"John J. Wallace Jr","definition[11]":"having a low or lower rank in an organization or a profession","example[10]":"Barron had refused to talk to anyone junior to Wickham.","example[11]":"Some junior employees might lack the courage to approach the boss.","definition[12]":"a junior bond, debt etc will be repaid later or have a smaller part repaid than other bonds, debts etc, if the borrower is unable to repay everything","example[12]":"senior and junior debt holders","example[13]":"The new bonds offered by Trump Plaza Associates were junior to the old ones.","example[14]":"They treated her like a junior."}