{"word[0]":"advise","definition[0]":"to tell someone what you think they should do, especially when you know more than they do about something","example[0]":"She needed someone to advise her.","example[1]":"The makers advise extreme caution when handling this material.","note[0]":"advise caution/patience/restraint etc","example[2]":"I would advise you to speak to a doctor.","note[1]":"I/we would advise somebody to do something ","example[3]":"‘Make sure that you keep the documents in a safe place, ’ Otley advised him.","note[2]":"‘ …, ’ somebody advised ","example[4]":"If you need more information, I’m sure your lawyer can advise.","note[3]":"somebody can advise ","example[5]":"Evans advised him to leave London.","note[4]":"advise somebody to do something","example[6]":"You are strongly advised to take out medical insurance when visiting China.","example[7]":"I’d advise you against saying anything to the press.","note[5]":"advise somebody against (doing) something","example[8]":"Experts advise that you should avoid being in strong sunlight for long periods.","note[6]":"advise that","definition[1]":"to be employed to give advice on a subject about which you have special knowledge or skill","example[9]":"He advises us on tax matters. ","note[7]":"advise somebody on/about something ","example[10]":"She’s been asked to advise on training the new sales team.","note[8]":"advise on something","example[11]":"He advises us on tax matters.","note[9]":"advise somebody on something","example[12]":"Matthew advises people how to invest their money.","note[10]":"advise somebody (on) how/where/what/when ","definition[2]":"to tell someone about something","example[13]":"Keep us advised of (=continue to tell us about) any new developments.","example[14]":"We’ll advise you of any changes in the delivery dates.","note[11]":"advise somebody of something","example[15]":"They advised him that the tour would proceed.","note[12]":"advise somebody that","explanation[0]":"You advise someone to do something","example[16]":"His lawyer advised him to plead guilty","bad_example[0]":"His lawyer advised to him to plead guilty","explanation[1]":"You advise someone that they should do something","example[17]":"His lawyer advised him that he should plead guilty","display[0]":"recommend","explanation[2]":"You recommend something to someone","example[18]":"One of my friends recommended the restaurant to me","explanation[3]":"You recommend that someone should do something","example[19]":"One of my friends recommended that I should go to the restaurant","display[1]":"suggest","explanation[4]":"You suggest something to someone","example[20]":"Someone suggested the idea to her","explanation[5]":"You suggest that someone should do something","example[21]":"Someone suggested that she should write a book about her experiences","definition[3]":"to tell someone what you think they should do, especially when you have more experience or knowledge than they do","example[22]":"My lawyer advised me to plead guilty.","display[2]":"give advice","definition[4]":"to advise someone about questions relating to a particular subject","example[23]":"They give advice to people about loans.","example[24]":"Can I give you some advice?","definition[5]":"to tell someone what you think they should do, especially in order to avoid problems","example[25]":"My dad told me to talk to a teacher if I was being bullied.","example[26]":"I told her not to worry.","definition[6]":"to advise someone to do something, especially after careful study of that subject","example[27]":"Doctors recommend eating five portions of fruit and vegetables each day.","example[28]":"Current guidelines recommend that young babies should sleep on their back.","definition[7]":"to tell someone your ideas about what they should do","example[29]":"I suggested they should visit the cathedral while they’re here.","display[3]":"urge","definition[8]":"to strongly advise someone to do something","example[30]":"Police have urged anyone with information about the murder to contact them."}