{"word[0]":"fund","definition[0]":"an amount of money that is collected and kept for a particular purpose","note[0]":"pension/investment/memorial etc fund","example[0]":"The fund was set up to try to save the cathedral.","definition[1]":"an organization that collects money, for example to help people who are ill, old etc","example[1]":"We give to the Children’s Fund every Christmas.","collocation[0]":"set up/establish a fund","example[2]":"They have set up a fund to build a memorial to all those who died.","collocation[1]":"manage/administer a fund","example[3]":"The fund is managed by an investment company.","collocation[2]":"launch a fund","example[4]":"They plan to launch an investment fund by raising $40m from investors.","form[0]":"ADJECTIVES/NOUN + fund","collocation[3]":"a trust fund","example[5]":"Proceeds from the sale of the house will go into a trust fund for the children.","collocation[4]":"a pension fund","example[6]":"the country’s largest private pension fund","collocation[5]":"an investment fund","example[7]":"The building is currently owned by Argo Partnership, a Toronto-based investment fund.","collocation[6]":"a campaign fund","example[8]":"These social events help to raise campaign funds.","collocation[7]":"a memorial fund","example[9]":"The work is being paid for out of the memorial fund launched after Morris’s death.","collocation[8]":"a benevolent/charitable fund","example[10]":"He contributed the sum of £1,500 to the benevolent fund.","collocation[9]":"an appeal fund","example[11]":"The appeal fund has now reached £65,000.","definition[2]":"to provide money for an activity, organization, event etc","example[12]":"The project is jointly funded by several local companies.","example[13]":"government-funded research","definition[3]":"an amount of money that is obtained and used for a particular purpose","example[14]":"They agreed to set up (=start) a $240 million international  fund through which industrialized nations can help developing countries.","definition[4]":"an organization that is responsible for obtaining and spending money for a particular purpose","example[15]":"Thanks to the European Development Fund, a fourth railway station will re-open in Wales this October.","example[16]":"The fund invests in money market deposits with a range of banks and financial institutions.","example[17]":"the World Wildlife Fund","definition[5]":"money that a person or organization has available","example[18]":"With the additional bank financing, we’ll have sufficient funds to pay our suppliers.","definition[6]":"having money, or enough money for a particular purpose","example[19]":"He promised to send repayment when he was next in funds.","example[20]":"A new spending bill was needed to keep the government in funds (=make sure the government has enough money).","definition[7]":"to have little or no money","example[21]":"The government is short of funds and needs additional revenue quickly.","example[22]":"The company ran out of funds, leaving gross debts of £900 million.","definition[8]":"used to talk about borrowing for different periods of time","definition[9]":"a company whose activity is putting money from investors into a particular type of investment or a range of investments, or an amount of money invested in this way","example[23]":"The fund will invest primarily in Asian companies.","example[24]":"The GT Growth Fund is the largest investment fund operating in Chile.","definition[10]":"to provide money for an activity, organization, or event","example[25]":"This year’s profits will be used to help fund a record £1.5 billion programme of investment over the next five years.","example[26]":"The chairwoman remains relatively unworried about the group’s ability to fund its expansion.","definition[11]":"to change the arrangements for paying a debt, so that you have more time to pay","example[27]":"Proposals to fund part of the state debt faced stubborn resistance."}