{"signpost[0]":"person/place","definition[0]":"to leave a place when someone is trying to catch you or stop you, or when there is a dangerous situation","example[0]":"He broke down the locked door and escaped.","example[1]":"He escaped from prison in October.","note[0]":"escape from/through/over etc","example[2]":"She escaped to Britain in 1938.","note[1]":"escape to","signpost[1]":"danger","definition[1]":"to get away from a dangerous or bad situation","example[3]":"They went to the hills to escape the summer heat.","example[4]":"A boy escaped unhurt when the fire in his room exploded.","note[2]":"escape unhurt/unscathed/unharmed etc","example[5]":"The youth was trying to escape the clutches of two drunken female companions.","note[3]":"escape somebody’s clutches","example[6]":"He escaped with minor injuries.","note[4]":"escape with","signpost[2]":"avoid","definition[2]":"to avoid something bad or that you do not want to happen","example[7]":"He narrowly escaped death in an avalanche.","example[8]":"The two passengers escaped serious injury.","example[9]":"They must not be allowed to escape justice.","example[10]":"It seemed impossible he would escape detection.","signpost[3]":"gas/liquid etc","definition[3]":"if gas, liquid, light, heat etc escapes from somewhere, it comes out","example[11]":"Vents allow any steam to escape if the system overheats.","definition[4]":"if a sound escapes from someone, they accidentally make that sound","example[12]":"A small laugh escaped her.","example[13]":"Holman let a weary sigh escape from his lips.","note[5]":"escape from","collocation[0]":"try/attempt to escape","example[14]":"Some prisoners tried to escape, but most were recaptured or shot.","collocation[1]":"escape injury","example[15]":"Both drivers were lucky to escape serious injury.","collocation[2]":"escape justice","example[16]":"These terrorists must not be allowed to escape justice.","collocation[3]":"escape detection","example[17]":"Some insects manage to escape detection by merging with the background.","example[18]":"He managed to escape the men’s clutches and run off.","collocation[4]":"narrowly escape something","example[19]":"The firemen narrowly escaped being killed by the explosion.","collocation[5]":"escape with your life","example[20]":"When the tunnel collapsed, the men were lucky to escape with their lives.","collocation[6]":"escape unharmed/unscathed/unhurt","example[21]":"Two policemen were killed, but the president escaped unharmed.","collocation[7]":"escape alive","example[22]":"The crew of the sinking vessel were lucky to escape alive.","example[23]":"The thief escaped through an upstairs window.","example[24]":"She managed to escape from her attacker and call the police.","display[0]":"get away","definition[5]":"to escape from someone who is chasing you, especially when there is no chance that you will be caught. Get away is more informal than escape","example[25]":"The robbers got away but left plenty of clues at the scene.","example[26]":"Don’t let him get away!","display[1]":"break free/break away","definition[6]":"to escape from someone who is holding you","example[27]":"She broke free and started running.","display[2]":"flee","definition[7]":"to leave somewhere very quickly in order to escape from danger","example[28]":"Many people were forced to flee the country.","example[29]":"The two men fled before police arrived.","display[3]":"get out","definition[8]":"to escape from a building or room","example[30]":"I was locked in the room and couldn’t get out.","display[4]":"break out","definition[9]":"to escape from prison","example[31]":"The jail is so secure that no one has ever broken out of it.","display[5]":"abscond","definition[10]":"to escape from a prison or institution where you are supposed to stay","example[32]":"Three prisoners who absconded have still not been found.","example[33]":"He absconded from a psychiatric hospital.","definition[11]":"the act of getting away from a place, or a dangerous or bad situation","example[34]":"The girl had no chance of escape.","example[35]":"Christina hoped it wouldn’t be too long before she could make her escape.","example[36]":"an escape route","example[37]":"They had a lucky escape (=were lucky not to be hurt or killed) when a car crashed into the front of their house.","example[38]":"the firm’s narrow escape from bankruptcy","definition[12]":"a way of forgetting about a bad or boring situation for a short time","example[39]":"Travel can be an escape from the routine drudgery of life.","definition[13]":"an amount of gas, liquid etc that accidentally comes out of the place where it is being kept, or an occasion when this happens","example[40]":"The lid prevents the escape of poisonous gases.","heading[0]":"– Meaning 1: the act of getting away from a place, or a dangerous or bad situation","collocation[8]":"plan an escape","example[41]":"We planned our escape carefully and waited for just the right moment.","collocation[9]":"prevent an escape","example[42]":"Walker grabbed her firmly by the wrist, preventing any chance of escape.","collocation[10]":"make your escape","example[43]":"I had to make my escape before the guards returned.","form[0]":"escape + NOUN","collocation[11]":"an escape attempt/bid","example[44]":"She made several unsuccessful escape attempts before finally getting away.","collocation[12]":"an escape plan","example[45]":"You should have an escape plan in the event of a fire.","example[46]":"All their escape routes had been blocked.","collocation[13]":"have a narrow escape","example[47]":"The team had a narrow escape from relegation last season.","collocation[14]":"have a lucky escape","example[48]":"We had a lucky escape when a tree crashed through the ceiling.","collocation[15]":"have a miraculous escape","example[49]":"Ellie had miraculous escape after a firework exploded in her hand.","collocation[16]":"a means of escape","example[50]":"She searched in vain for a means of escape.","collocation[17]":"a chance/hope/possibility of escape","example[51]":"The river offered our only hope of escape.","collocation[18]":"make good your escape","example[52]":"Dillinger handcuffed the deputy to the desk and made good his escape.","heading[1]":"– Meaning 2: a way of forgetting about a bad or boring situation for a short time","example[53]":"Drugs and alcohol are their only means of escape.","collocation[19]":"somebody’s escape route from something","example[54]":"Bankruptcy offered his only escape route from mounting debt."}