{"signpost[0]":"go back","definition[0]":"to go or come back to a place where you were before","example[0]":"It was forty five minutes before she returned.","example[1]":"Alison decided to return home.","example[2]":"He left his country, never to return.","example[3]":"Are you planning to return to Spain?","example[4]":"I have just returned from five months in Zimbabwe.","note[0]":"return from","explanation[0]":"In everyday English, people usually say come back (=return to the place where the speaker is) or go back (=return to a different place from where the speaker is), rather than return: ","example[5]":"It was forty five minutes before she came back.","example[6]":"Are you planning to go back to Spain?","signpost[1]":"give back","definition[1]":"to give or send something back, or to put something back in its place","example[7]":"Please complete the enclosed application form and return it in the envelope attached.","example[8]":"Carson returned the notebook to his pocket.","note[1]":"return something to something/somebody","example[9]":"I returned the books to the library unread.","explanation[1]":"In everyday English, people usually say that they take something back, put it back, or bring it back, rather than return it: ","example[10]":"He put the key back in his pocket.","example[11]":"Did you take the books back to the library?","signpost[2]":"feeling/situation","definition[2]":"if a feeling, situation etc returns, it starts to exist or happen again","synonym[0]":"come back","example[12]":"If the pain returns, take two of the tablets with some water.","example[13]":"David could feel his anger returning.","example[14]":"when peace finally returns to this country","explanation[2]":" In everyday English, people usually say that a feeling comes back rather than returns:","example[15]":"I’m worried that the pain will come back.","signpost[3]":"do the same","definition[3]":"to do something to someone because they have done the same thing to you","example[16]":"He smiled at her warmly and she returned his smile.","example[17]":"I phoned him twice on Friday and left messages, but he never returned my call (=he didn’t phone me).","example[18]":"Thanks very much. I’ll return the favour (=do something to help you) some day.","example[19]":"The police did not return fire (=shoot back at someone who shot at them).","definition[4]":"to answer someone","example[20]":"‘Yes, ’ he returned. ‘I’m a lucky man.’","definition[5]":"to hit the ball back to your opponent in a game such as tennis","signpost[4]":"elect","definition[6]":"to elect someone to a political position, especially to represent you in parliament","example[21]":"Yeo was returned to Parliament with an increased majority.","note[2]":"be returned to something","example[22]":"At the election, she was returned as MP for Brighton.","note[3]":"be returned as something","explanation[3]":"Return is usually passive in this meaning","signpost[5]":"profit","definition[7]":"to make a profit","example[23]":"The group returned increased profits last year.","heading[0]":"– Meaning 4: to do something to someone because they have done the same thing to you","collocation[0]":"return somebody’s call","example[24]":"I left a message but he hasn't returned my call.","collocation[1]":"return somebody’s gaze/stare","example[25]":"She kept her eyes fixed on the floor, refusing to return his gaze.","collocation[2]":"return somebody’s smile","example[26]":"Mark returned her smile.","collocation[3]":"return somebody’s love/feelings","example[27]":"Sadly, she could never return his love.","collocation[4]":"return the favour","example[28]":"Thanks a lot. I hope I'll be able to return the favour.","collocation[5]":"return fire","example[29]":"One plane opened fire on the American aircraft, which immediately returned fire.","heading[1]":"GRAMMAR: Patterns with return","explanation[4]":"You return to a place","example[30]":"The writer returned to his home town many years later","example[31]":"Hardy returned to his house in the country","bad_example[0]":"The writer returned his home town","bad_example[1]":"Hardy returned his house","explanation[5]":"You return home","example[32]":"When she returned home that night, there was a letter for her","bad_example[2]":"when she returned to home","definition[8]":"to go back or come back to a place where you were before. Return sounds more formal than go back  or come back, and is more commonly used in written English","example[33]":"She returned to the hotel hoping to find a message.","example[34]":"Alastair returned from the office late that night.","example[35]":"On Friday, I returned home around six o'clock.","definition[9]":"to go to the place where you were before, or to the place where you usually live","example[36]":"It’s cold out here – shall we go back inside?","example[37]":"When are you going back to Japan?","display[0]":"go home","definition[10]":"to go to your home again, or to the country where you were born, after you have been away from it","example[38]":"I did a bit of shopping and then went home.","example[39]":"Are you going home to Hong Kong when the course finishes?","definition[11]":"to come to the place where you are again, after going away from it","example[40]":"I’ll be away for two days – coming back on Thursday night.","example[41]":"He’s just come back from a vacation in Miami.","display[1]":"get back","definition[12]":"to arrive somewhere where you were before, especially your home or the place where you are staying","example[42]":"We got back at about 9 o'clock.","example[43]":"She couldn’t wait to get back to London.","display[2]":"turn back","definition[13]":"to turn around and go back in the direction you came from","example[44]":"We took the wrong road and had to turn back.","example[45]":"He ordered the soldiers to turn back and march south.","signpost[6]":"coming back","definition[14]":"the act of returning from somewhere, or your arrival back in a place","example[46]":"We’re all looking forward to your return!","example[47]":"I need to know the date of her return from Europe.","example[48]":"Malcolm decided to delay his return to York.","example[49]":"On his return from Canada, he joined the army.","note[4]":"on/upon somebody’s return","signpost[7]":"giving back","definition[15]":"the act of giving, putting, or sending something back","example[50]":"A mother is appealing for the safe return of her baby son.","note[5]":"return of","example[51]":"Police have arranged for the return of the stolen goods.","signpost[8]":"changing back","definition[16]":"a change back to a previous state or situation","example[52]":"The United States called for a return to democracy.","example[53]":"a return to normal","signpost[9]":"starting again","definition[17]":"when someone starts an activity again after they had stopped","example[54]":"Rose’s return to the teaching profession","example[55]":"Jean is well enough now to consider her return to work.","definition[18]":"the amount of profit that you get from something","example[56]":"The markets are showing extremely poor returns.","example[57]":"The average rates of return were 15%.","example[58]":"How can you get the best return on your investment?","note[6]":"return on","example[59]":"The returns from farming are declining.","definition[19]":"the key that you press on a computer at the end of an instruction or to move to a new line","example[60]":"Key in the file name and press return.","signpost[10]":"ticket","definition[20]":"a ticket for a journey from one place to another and back again","opposite[0]":"single","example[61]":"Can I have a return to London please?","definition[21]":"when a feeling, situation etc starts to exist or happen again","example[62]":"She felt a return of her old anxiety.","example[63]":"David had noticed the return of worrying symptoms in the last few days.","signpost[11]":"statement","definition[22]":"a statement giving written information in reply to official questions","example[64]":"an analysis of the 1851 census returns","signpost[12]":"vote","definition[23]":"a vote in an election","example[65]":"What are the returns from last night’s voting?","definition[24]":"used or paid for a journey from one place to another and back again","example[66]":"a return ticket","example[67]":"a return fare","definition[25]":"if an investment returns a particular amount of money, that is the amount of profit it makes","example[68]":"This high-performing fund has returned 20.8% a year on average over the past decade.","definition[26]":"to take a product back to the shop you bought it from to get your money back, or to get other goods in exchange for it","example[69]":"Any product purchased from Milo may be returned for a full refund.","definition[27]":"to go back to a previous activity or state","example[70]":"The mine returned to production in November.","example[71]":"The striking teachers have nowreturned to work.","definition[28]":"if you return a telephone call, you telephone someone because they have telephoned you","example[72]":"The minister didn’t return a call asking for comments on the crisis.","definition[29]":"if a bank returns a cheque, it refuses to pay it because there is not enough money in the account to do so","synonym[1]":"BOUNCE","example[73]":"If we have to return a cheque, a charge of £15 will be made.","definition[30]":"if a JURY in a law case returns its VERDICT, it says whether it thinks someone is guilty or not","definition[31]":"the amount of profit made from an investment","example[74]":"British government bonds have produced a total return of 8.52% so far this month.","example[75]":"a slump affecting the returns from investment","definition[32]":"when someone or something goes back to a previous activity or state","example[76]":"Favorable government rates have aided the company’s return to profitability.","example[77]":"the return of petroleum prices to the highest levels since mid-February","definition[33]":"an official form that is filled in and sent to the tax authorities so they can calculate how much tax is owed","example[78]":"Over 12.2 million taxpayersfiled federal returns electronically this year.","example[79]":"allegations that the company had falsified its corporate tax return","definition[34]":"the button that is pressed on a computer KEYBOARD when you have finished typing an instruction","example[80]":"Enter the filename and press Return.","definition[35]":"the act of taking or sending back a product you have bought, in order to get your money back or to get other goods in exchange","example[81]":"We accept any return for any reason and will refund or replace the product.","example[82]":"Our customer service department deals with product returns.","definition[36]":"a ticket etc that allows you to travel to a place and back again","example[83]":"The package includes the return air fare from the UK and accommodation."}