{"word[0]":"conflict","definition[0]":"a state of disagreement or argument between people, groups, countries etc","example[0]":"Marx points out the potential conflicts below the surface of society.","example[1]":"His views on the literal truth of the Bible brought him into conflict with other Christian leaders.","example[2]":"Doctors exercise considerable power and often come into conflict with politicians.","example[3]":"a lawyer specializing in conflict resolution","example[4]":"social and political conflict in the 1930s","note[0]":"political/social/industrial conflict","example[5]":"the threat of industrial conflict in the coalfields","example[6]":"conflicts over wage settlements","note[1]":"conflict over","example[7]":"the conflict between tradition and innovation","note[2]":"conflict between","example[8]":"normal kids who are in conflict with their parents","note[3]":"in conflict (with somebody)","definition[1]":"fighting or a war","example[9]":"efforts to resolve the conflict","example[10]":"For years the region has been torn apart by armed conflicts.","note[4]":"armed/military/violent conflict","example[11]":"UN troops intervened to avert a threat of violent conflict.","definition[2]":"a situation in which you have to choose between two or more opposite needs, influences etc","example[12]":"As women increasingly went out to work, the possibility of a conflict of loyalties became stronger.","example[13]":"a conflict between the demands of one’s work and one’s family","example[14]":"The principles of democracy are sometimes in conflict with political reality.","note[5]":"in conflict (with something)","definition[3]":"a situation in which you have two opposite feelings about something","example[15]":"a state of inner conflict","definition[4]":"something that you have to do at the same time that someone wants you to do something else","example[16]":"I’ve got a conflict on Friday. Can we make it Monday?","collocation[0]":"come into conflict with somebody","example[17]":"Local people have often come into conflict with planning officials.","collocation[1]":"bring somebody into conflict with somebody","example[18]":"Some of her actions have brought her into conflict with her managers.","collocation[2]":"cause/create/provoke conflict","example[19]":"Sometimes very small disagreements can cause conflict within a family.","collocation[3]":"resolve a conflict","example[20]":"You may need a lawyer to resolve a serious conflict between neighbours.","collocation[4]":"avoid conflict","example[21]":"The prime minister wants to avoid a conflict over the issue.","form[0]":"ADJECTIVES/NOUN + conflict","collocation[5]":"political/social conflict","example[22]":"Widespread unemployment often leads to social conflict.","collocation[6]":"industrial conflict","example[23]":"The industrial conflict resulted in a series of strikes.","collocation[7]":"ethnic/racial conflict","example[24]":"The ethnic conflict in the region has become violent.","collocation[8]":"family conflict","example[25]":"There are various techniques you can use to try and avoid family conflict.","collocation[9]":"bitter conflict","example[26]":"The new law provoked bitter conflict.","collocation[10]":"a source of conflict","example[27]":"Lack of money is often a source of conflict between spouses.","collocation[11]":"an area of conflict","example[28]":"There may be many areas of conflict between parents and teenagers.","collocation[12]":"conflict resolution","example[29]":"The children are learning methods of conflict resolution to use on the playground.","definition[5]":"if two ideas, beliefs, opinions etc conflict, they cannot exist together or both be true","example[30]":"new evidence which conflicts with previous findings","note[6]":"conflict with","definition[6]":"a state of disagreement between people, groups, countries etc","example[31]":"The General Strike was the most important industrial conflict of British inter-war history.","example[32]":"They are both strong-willed managers, and associates have noted signs of conflict between them.","definition[7]":"a situation in which you have to choose between two or more different needs","example[33]":"the conflict between housing the poor and minimizing taxpayer costs"}