{"signpost[0]":"feel","definition[0]":"to put your hand, finger etc on someone or something","example[0]":"She reached out to touch his arm.","example[1]":"If your house has been burgled, you shouldn’t touch anything until the police arrive.","example[2]":"‘Don’t touch me!’ she yelled.","example[3]":"A hand touched her on the shoulder.","note[0]":"touch somebody on the arm/leg etc","signpost[1]":"no space between","definition[1]":"if two things touch, or one thing touches another thing, they reach each other so that there is no space between them","example[4]":"As our glasses touched, he said ‘Cheers!’","example[5]":"Her dress was so long that it was touching the ground.","explanation[0]":"Touch is a reciprocal verb This type of verb is used when saying that two or more people or things do something that involves both or all of them It does not need to have an object  In this sentence, touch is intransitive and does not have an object","example[6]":"Their hands touched","explanation[1]":"In these sentences, touch is transitive","example[7]":"Their hands touched each other","example[8]":"His hand touched hers","signpost[2]":"affect somebody’s feelings","definition[2]":"to affect someone’s emotions, especially by making them feel sympathy or sadness","example[9]":"Her plight has touched the hearts of people around the world.","example[10]":"She could sense his concern and it touched her.","signpost[3]":"have an effect","definition[3]":"to have an effect on someone or something, especially by changing or influencing them","example[11]":"He has touched the lives of many people.","example[12]":"Unemployment remains an evil that touches the whole community.","example[13]":"He was often touched by doubt  (=doubt affected him).","type[0]":"transitive usually in negatives","signpost[4]":"use","definition[4]":"to use or handle something","example[14]":"The law doesn’t allow him to touch any of the money.","example[15]":"It’s a long time since I’ve touched a piano.","signpost[5]":"deal with somebody/something","definition[5]":"to become involved with or deal with a particular problem, situation, or person","example[16]":"He was the only lawyer who would touch the case.","example[17]":"Everything he touches turns to disaster.","example[18]":"No school would touch a teacher who had been convicted of assault.","signpost[6]":"reach an amount","definition[6]":"to reach a particular amount or level","example[19]":"At the time, the unemployment rate was touching 10 percent and rising.","signpost[7]":"hit/kick","definition[7]":"to gently hit or kick a ball – used especially in reports of sports games","example[20]":"Evans was just able to touch the ball away from Wilkinson.","definition[8]":"if an expression such as a smile touches your face, your face has that expression for a short time","example[21]":"A smile touched her lips.","signpost[8]":"relate to something","definition[9]":"to be about or to deal with a particular subject, situation, or problem","example[22]":"Though the question touched a new vein, Nelson answered promptly.","example[23]":"The discourse touches many of the issues which are currently popular.","definition[10]":"if light touches something, it shines on it","example[24]":"The sun was just touching the tops of the mountains.","definition[11]":"to put your fingers or hand onto someone or something for a very short time","example[25]":"Don’t touch the iron – it’s hot!","definition[12]":"to touch something with your fingers in order to find out about it","example[26]":"Feel how soft this material is.","example[27]":"I felt his forehead. It was cold.","display[0]":"handle","definition[13]":"to touch something and pick it up and hold it in your hands","example[28]":"Children should always wash their hands before handling food.","example[29]":"The glass was very fragile, and she handled it with great care.","example[30]":"Please do not handle the merchandise.","display[1]":"finger","definition[14]":"to touch or handle something with your fingers, especially while you are thinking of other things","example[31]":"She fingered the heavy necklace around her neck.","display[2]":"rub","definition[15]":"to move your hand over a surface while pressing it","example[32]":"Bob rubbed his eyes and yawned.","display[3]":"scratch","definition[16]":"to rub part of your body with your nails, often because it itches","example[33]":"The dog kept scratching its ear.","example[34]":"Bob scratched his head thoughtfully.","display[4]":"tickle","definition[17]":"to move your fingers lightly over someone’s body in order to make them laugh","example[35]":"The baby giggled as I tickled him.","display[5]":"grope","definition[18]":"to touch someone’s body in a sexual way when they do not want to be touched","example[36]":"The officer was accused of groping several women in his platoon.","heading[0]":"touch somebody gently or lovingly","display[6]":"stroke","definition[19]":"to move your hand gently over something, especially in a loving way","example[37]":"She stroked the child’s hair.","example[38]":"Our cat won’t let people stroke him.","display[7]":"pat","definition[20]":"to touch an animal or child lightly several times, with your hand flat","example[39]":"He knelt down to pat the dog.","example[40]":"She patted the little boy’s head.","display[8]":"pet","definition[21]":"to touch and move your hand gently over someone, especially an animal or child","example[41]":"The goats, pigs, sheep, and cows here allow you to pet them.","display[9]":"caress","definition[22]":"to gently touch a part of someone’s body in a loving way","example[42]":"a mother caressing her child","example[43]":"She caressed his cheek.","display[10]":"fondle","definition[23]":"to touch a part of someone’s body in a loving or sexual way – use this especially about touching someone in a sexual way that is not wanted","example[44]":"He tried to fondle her and she immediately pulled away from him.","signpost[9]":"touching somebody/something","definition[24]":"the action of putting your hand, finger, or another part of your body on something or someone","example[45]":"She felt a gentle touch on her shoulder.","example[46]":"He remembered the touch of her fingers on his face.","note[1]":"touch of","signpost[10]":"ability to feel things","definition[25]":"the sense that you use to discover what something feels like, by putting your hand or fingers on it","example[47]":"the sense of touch","example[48]":"Bake the cake for 30 minutes until risen and firm to the touch.","example[49]":"Visually impaired people orient themselves by touch.","note[2]":"by touch","signpost[11]":"detail/addition","definition[26]":"a small detail that improves or completes something","example[50]":"There was a vase of flowers in the room, which was a nice touch.","example[51]":"Brass pans added a decorative touch to the plain brick wall.","example[52]":"Emma was putting the finishing touches to the cake.","note[3]":"put the final/finishing touches to something","signpost[12]":"way of doing something","definition[27]":"a particular way of doing something, or the ability to do it in a particular way","example[53]":"The room was decorated with a very artistic touch.","example[54]":"Our staff combine efficient service with a personal touch (=they do things in a friendly way).","example[55]":"The feminine touch was evident throughout the house.","example[56]":"His sure touch (=confident way of doing things) and attention to detail are just as evident now.","example[57]":"Barbara has a magic touch in the garden  (=she grows things very well).","example[58]":"King obviously hasn’t lost his touch (=lost his ability) – his latest book sold in the millions.","signpost[13]":"way something feels","definition[28]":"the way that something feels and the effect it has on your skin","example[59]":"the warm touch of his lips","signpost[14]":"soccer/rugby","definition[29]":"the area outside the lines that mark the playing area","example[60]":"The ball rolled into touch.","note[4]":"into touch","definition[30]":"to telephone someone you work with, or visit them for a short time, while you are spending time somewhere else","example[61]":"I need to touch base with the office back in Boston."}