{"word[0]":"grab","signpost[0]":"with your hand","definition[0]":"to take hold of someone or something with a sudden or violent movement","synonym[0]":"snatch","example[0]":"I grabbed my bag and ran off.","example[1]":"Two men grabbed her and pushed her to the ground.","example[2]":"Kay grabbed hold of my arm to stop herself falling.","example[3]":"I managed to grab the gun from Bowen.","note[0]":"grab something from somebody/something","signpost[1]":"food/sleep","definition[1]":"to get some food or sleep quickly because you are busy","example[4]":"Why don’t you go and grab some sleep?","example[5]":"Hang on while I grab a cup of coffee.","example[6]":"Let’s grab a bite to eat before we go.","signpost[2]":"get something for yourself","definition[2]":"to get something for yourself, sometimes in an unfair way","example[7]":"Try to get there early and grab good seats.","example[8]":"Bob tried to grab all the profit.","signpost[3]":"chance/opportunity","definition[3]":"to take an opportunity, accept an invitation etc immediately","example[9]":"I think you should grab your chance to travel while you’re young.","example[10]":"She grabbed the opportunity to go to America.","example[11]":"Melanie grabbed at the invitation to go.","example[12]":"This is our chance to grab a slice of this new market.","signpost[4]":"get attention","definition[4]":"to get someone’s attention","example[13]":"The book is full of good ideas to grab your students’ attention.","example[14]":"The plight of the refugees immediately grabbed the headlines (=was the most important story in the newspapers).","definition[5]":"to take information on a computer, website etc","definition[6]":"the act of getting something quickly, especially in a dishonest way","example[15]":"a shameless power grab to eliminate opposition","example[16]":"Officials denounced the settlers’ land grab.","definition[7]":"to take or obtain something that other people also want","example[17]":"Both companies are looking to grab a share of the overseas market.","definition[8]":"an attempt to take or obtain something that other people also want","example[18]":"The company’s recent growth could slow if competitors make a grab for some of its markets.","example[19]":"British and Spanish officials complain that the idea looks suspiciously like a power-grab by Brussels  (=an attempt by Brussels to get power over something).","definition[9]":"if something is up for grabs, it is available for anyone who wants to try to obtain it","example[20]":"Argentina has already sold off its telephone company, and dozens of other assets are up for grabs.","example[21]":"A large part of the business might be put up for grabs."}