{"definition[0]":"used after a verb, noun, or adjective when an infinitive completes its meaning","example[0]":"We tried to explain.","example[1]":"It was starting to rain.","example[2]":"The manager asked them to leave.","example[3]":"an attempt to escape","example[4]":"Have you got permission to stay here?","example[5]":"Our team’s certain to win.","example[6]":"Are you ready to start?","example[7]":"This delicious dessert is easy to make  (=you can make it easily).","definition[1]":"used by itself instead of an infinitive in order to avoid repeating the same verb","example[8]":"You can drive today if you want to  (=if you want to drive).","example[9]":"I could have helped, but nobody asked me to.","definition[2]":"used after a word such as ‘how’, ‘where’, ‘who’, ‘what’, or ‘whether’ to refer to an action about which someone is not certain","example[10]":"I know where to go but I don’t know how to get there.","example[11]":"She wondered whether or not to trust him.","definition[3]":"used to show a purpose or intention","example[12]":"They left early to catch the 7.30 train.","example[13]":"To find out more about university courses, write to this address.","example[14]":"We need more money to improve transport in London.","explanation[0]":"In written English, people often use in order to rather than just to when expressing a purpose or intention, because it sounds more formal:","example[15]":"Investment has been increased in order to improve the transport system.","definition[4]":"used to refer to an action or state, when describing it","example[16]":"It’s nice to be wanted.","example[17]":"He’s finding it hard to cope.","example[18]":"To say I am disappointed is an understatement.","example[19]":"The simplest solution would be to increase the price.","definition[5]":"used to say what can or cannot be done, or what should be done","example[20]":"You’ll soon be old enough to vote in elections.","example[21]":"He did not have the energy to resist.","example[22]":"I’m too tired to go out tonight.","definition[6]":"used after the verb ‘be’ to give an order or to state arrangements for the future","example[23]":"You are to wait here until I return.","example[24]":"They are to be married on May 25th.","definition[7]":"used to say what someone discovers or experiences when they do something","example[25]":"He arrived there to find that the last train had already left.","example[26]":"The princess stepped ashore to be greeted by an enthusiastic crowd of admirers.","example[27]":"She woke to see Ben standing by the window.","definition[8]":"used to say what your attitude or purpose is in saying something","example[28]":"I’ve never heard of him, to be quite honest.","example[29]":"To begin with, let’s look at Chapter 3.","definition[9]":"used to say where someone or something goes","example[30]":"She stood up and walked to the window.","example[31]":"the road to London","example[32]":"our weekly trip to the supermarket","example[33]":"sending a spaceship to Mars","example[34]":"These people go from house to house selling goods  (=visit many different houses).","definition[10]":"used to say who receives something or is told or shown something","example[35]":"He sent presents to the children.","example[36]":"She whispered something to the girl beside her.","example[37]":"Give my best wishes to your parents when you see them.","example[38]":"Don’t show these letters to anyone else.","example[39]":"a message from the Emperor to his people","definition[11]":"used to show in which direction something is in relation to something else","example[40]":"Knutsford is about 16 miles to the south of Manchester.","example[41]":"There was a table to the left of the doorway.","definition[12]":"used to show the purpose, event, or activity for which you go somewhere","example[42]":"Sophie goes to gymnastics every Friday.","example[43]":"Did you get an invitation to their wedding?","example[44]":"Don’t forget, we’re going to a party tomorrow night.","example[45]":"If he needed help, Mother came rushing to the rescue.","definition[13]":"used to say what state someone or something is in as a result of an action or change","example[46]":"She sang the baby to sleep.","example[47]":"Wait until the lights change to green.","example[48]":"a return to a traditional way of life","definition[14]":"used to say that one thing is touching another","example[49]":"He held a knife to her throat.","example[50]":"They danced cheek to cheek.","definition[15]":"used to say where something is fastened or connected","example[51]":"He tied the rope to a tree.","example[52]":"Attach a recent photograph to your application form.","example[53]":"Cash machines are linked up to a central computer.","definition[16]":"facing something or in front of it","example[54]":"I sat with my back to the window.","example[55]":"We were standing face to face.","definition[17]":"used to show a relationship with someone or something","example[56]":"George’s sister was married to an Italian.","example[57]":"He was first cousin to King Philip VI.","example[58]":"The robbery may be linked to other crimes of violence.","definition[18]":"as far as a particular point or limit","example[59]":"She can already count from one to twenty.","example[60]":"The water came right up to our knees.","example[61]":"Temperatures dropped to 25 degrees below zero.","example[62]":"It’s ten kilometres from here to the coast.","example[63]":"She read the novel from beginning to end.","example[64]":"Does your interest in nuclear physics extend to nuclear weaponry?","definition[19]":"until and including a particular time or date","example[65]":"They stayed from Friday night to Sunday morning.","example[66]":"I’ll be on duty from 8 am to 10 pm.","definition[20]":"used to say what or who an action, attitude, situation etc affects or is related to","example[67]":"The factory clearly represents a danger to health.","example[68]":"She’s always been kind to animals.","example[69]":"his attitude to life","example[70]":"What have you done to the radio? It’s not working.","definition[21]":"used to say who someone works for","example[71]":"Jane is secretary to the managing director.","definition[22]":"used to say what something is needed for","example[72]":"I’m still waiting for an answer to my question.","example[73]":"Have you seen the key to the back door?","definition[23]":"used when comparing two things, numbers etc","example[74]":"England beat Scotland by two goals to one.","example[75]":"Yes, she was punished, but it was nothing to what she deserved.","definition[24]":"used to say who has a particular attitude or opinion about something","example[76]":"The whole thing sounds very suspicious to me.","example[77]":"Tickets cost £10 each and to some people that’s a lot of money.","example[78]":"To my mind, age does not matter; love is what matters.","definition[25]":"used to say what someone’s reaction is when something happens","example[79]":"Much to everyone’s surprise she passed the exam with distinction.","example[80]":"I discovered to my horror that my passport was missing.","definition[26]":"used when saying how much time there is before a particular event or time","note[0]":"ten to five/twenty to one etc (=ten minutes, twenty minutes etc before a particular hour)","example[81]":"It’s only two weeks to Christmas.","example[82]":"How long is it to dinner?","definition[27]":"used when talking about a rate or quantity to say how many smaller units equal a larger unit","example[83]":"We’re only getting 130 yen to the dollar at the moment.","example[84]":"There are just over four and a half litres to a gallon.","definition[28]":"used to show the relationship between two different measurements or quantities","example[85]":"The car will do over 40 miles to the gallon.","example[86]":"The scale of your map is one inch to the mile.","definition[29]":"used to say that a particular sound is heard at the same time as something happens","example[87]":"I woke to the sound of torrential rain.","example[88]":"The royal couple arrived to a fanfare of trumpets.","example[89]":"I like to exercise to music.","definition[30]":"used between two numbers when you do not know exactly what the real number or amount is","example[90]":"There must have been eighteen to twenty thousand people at the concert.","example[91]":"He drowned in 10 to 12 feet of water.","definition[31]":"used to say what the chances of something happening are","example[92]":"I’ll bet you ten to one he’ll forget all about it.","definition[32]":"if a door is pushed to, it closes or almost closes","example[93]":"The wind blew the door to."}