{"word[0]":"margin","definition[0]":"the empty space at the side of a page","example[0]":"Someone had scribbled a note in the margin.","example[1]":"Use double spacing and wide margins to leave room for comments.","definition[1]":"the difference in the number of votes, points etc that exists between the winners and the losers of a competition or election","example[2]":"They’re a world-class team and it was no surprise that they won by such a wide margin.","note[0]":"by a wide/narrow/significant etc margin","example[3]":"The bill was approved by a margin of 55 votes.","note[1]":"by a margin of 10 points/100 votes etc","definition[2]":"the difference between what it costs a business to buy or produce something and what they sell it for","example[4]":"Margins are low and many companies are struggling.","example[5]":"Within 10 years they had a gross profit margin of 50%.","definition[3]":"an additional amount of something such as time, money, or space that you include in order to make sure that you are successful in achieving something","example[6]":"It’ll take about 30 minutes to dry but I’d allow a safety margin of, say, another 10 minutes.","definition[4]":"the edge of something, especially an area of land or water","example[7]":"the western margin of southern Africa","heading[0]":"– Meaning 1: the empty space at the side of a page","collocation[0]":"wide","example[8]":"The margin should be wider.","example[9]":"The margins are very narrow, making the page look cluttered.","collocation[1]":"a generous margin","example[10]":"Leave a generous margin at the side of the page.","collocation[2]":"the right-hand margin","example[11]":"There were some notes written in the right-hand margin.","collocation[3]":"the left-hand margin","example[12]":"All typing begins at the left-hand margin.","collocation[4]":"leave a margin","example[13]":"The teacher told us to leave a margin wide enough for him to write corrections.","collocation[5]":"set the margins","example[14]":"Set the margins to have one inch on each side.","heading[1]":"– Meaning 2: the difference in the number of votes, points etc that exists between the winners and the losers of a competition or election","collocation[6]":"a large/big margin","example[15]":"By a large margin, the book sold more copies than any other this year.","collocation[7]":"a huge margin","example[16]":"They won the championship by a huge margin.","collocation[8]":"a small margin","example[17]":"Visitors from other parts of Scotland exceeded foreign visitors by only a small margin.","collocation[9]":"a narrow margin","example[18]":"The proposal passed, but only by a narrow margin.","collocation[10]":"win by a large/small etc margin","example[19]":"The party won by a huge margin.","collocation[11]":"lose by a large/small etc margin","example[20]":"He lost by only a narrow margin.","definition[5]":"the difference between the price that something is sold for and the cost of producing or buying it. A margin is usually calculated as a percentage of the price that something is sold for, unlike a MARK-UP which is calculated as a percentage of the cost of producing or buying it","example[21]":"Prices and margins were down as a result of the recession.","example[22]":"a high-margin product.","example[23]":"The car division, suffering from weak sales and tight margins (=very small ones), made an operating loss.","example[24]":"The margin on canned soup is 15% to 20%.","note[2]":"margin on","definition[6]":"if you buy shares or other investments on margin, you buy them with borrowed money","example[25]":"Individuals trading on margin sustained heavy losses during last year’s stock price declines."}