{"definition[0]":"when something happens, there is an event, especially one that is not planned","synonym[0]":"occur","example[0]":"When did the accident happen?","example[1]":"It’s impossible to predict what will happen next.","example[2]":"This was bound to happen sooner or later.","example[3]":"This kind of thing happens all the time.","example[4]":"We’ll still be friends, whatever happens.","example[5]":"Something terrible has happened.","note[0]":"something/nothing/anything happens","example[6]":"She carried on as if nothing had happened.","definition[1]":"used especially when talking about events that have not been planned","example[7]":"Something terrible has happened!","display[0]":"take place","definition[2]":"to happen – used especially when talking about events that have been planned or that have already happened","example[8]":"The conference will take place on the 16th of June.","example[9]":"The competition took place on Saturday 30th June.","definition[3]":"to happen – used especially when talking about events that have not been planned","example[10]":"The incident occurred outside the police station at around 9 pm.","display[1]":"there is/there are","definition[4]":"used when saying that a particular event happens","example[11]":"There was an earthquake about a week ago.","example[12]":"There are strikes almost every year.","display[2]":"come up","definition[5]":"to happen – used about problems, questions, or opportunities","example[13]":"There aren’t any jobs at the moment, but we’ll let you know if something comes up.","example[14]":"This question often comes up when I’m talking to students.","display[3]":"arise","definition[6]":"to happen unexpectedly – used about problems, arguments, or difficult situations","example[15]":"A dispute arose about who should receive the money.","example[16]":"It is best to deal with the problem as soon as it arises.","display[4]":"crop up","definition[7]":"to happen – used about problems or difficult situations, especially ones that are less serious, and can quickly be dealt with","example[17]":"The banks will contact their customers if a problem crops up.","display[5]":"strike","definition[8]":"to happen suddenly and unexpectedly – used about very bad events","example[18]":"The hurricane struck at around 1 am.","example[19]":"Disaster struck, and he lost all movement in his legs.","display[6]":"turn out","definition[9]":"to happen in a particular way","example[20]":"Luckily, everything turned out well.","example[21]":"How did it all turn out?"}