{"word[0]":"sometimes","definition[0]":"on some occasions but not always","example[0]":"I sometimes have to work late.","example[1]":"Sometimes, Grandma would tell us stories about her childhood in Italy.","example[2]":"‘Do you ever wish you were back in Japan?’ ‘Sometimes. Not very often.’","example[3]":"The journey takes an hour, sometimes even longer.","explanation[0]":"Sometimes usually comes before a verb","example[4]":"I sometimes see him at the supermarket","explanation[1]":"Sometimes can also come after the object of the verb","example[5]":"I see him sometimes at the supermarket","explanation[2]":"Sometimes usually comes after the verb ‘be’","example[6]":" She is sometimes late","explanation[3]":"Sometimes usually comes after an auxiliary verb such as ‘do’ or ‘have’","example[7]":"The government has sometimes tried to prevent newspapers from publishing stories","explanation[4]":"You can also use sometimes at the beginning or end of a sentence","example[8]":"Sometimes I see him at the supermarket","example[9]":"I see him at the supermarket sometimes","example[10]":"Sometimes, I wish I was still living in Tokyo.","example[11]":"He sometimes plays football with my brother.","display[0]":"occasionally","definition[1]":"used about something that only happens a few times. Occasionally is used when something happens more rarely than sometimes","example[12]":"I prefer trousers but I do wear skirts occasionally.","example[13]":"Occasionally, operations have to be cancelled.","example[14]":"On occasion, prisoners were allowed visits from their families.","display[1]":"(every) now and then/again","definition[2]":"sometimes but not often or regularly","example[15]":"We still call each other every now and then.","example[16]":"Every now and again, an invention comes along which changes people’s lives completely.","example[17]":"Even experienced doctors make mistakes from time to time.","display[2]":"every so often","definition[3]":"sometimes at fairly regular periods","example[18]":"He looked up from his book every so often.","example[19]":"Every so often, a train whizzed past.","display[3]":"at times","definition[4]":"if something happens at times, it happens sometimes but is not what usually happens","example[20]":"The job can be frustrating at times.","example[21]":"At times I’ve wondered whether I made the right decision in moving here.","display[4]":"(every) once in a while","definition[5]":"sometimes but very rarely","example[22]":"We only see each other every once in a while."}