{"word[0]":"never","definition[0]":"not at any time, or not once","example[0]":"He’s never been to Australia.","example[1]":"I’m never going back there again, not as long as I live.","example[2]":"It is never too late to give up smoking.","example[3]":"Never again (=never after a particular time) would he return to Naples.","example[4]":"Never had she been so confused.","note[0]":"never had/did/was etc","example[5]":"I’ll never ever forgive him for leaving me.","note[1]":"never ever","example[6]":"Never in all my life have I felt so humiliated.","note[2]":"never in all my life","example[7]":"She had never for one moment imagined that it could happen to her.","note[3]":"never for one moment","example[8]":"Max had never been known to leave home without telling anyone.","note[4]":"somebody/something has never been known to do something","explanation[0]":"Never usually comes before a verb","example[9]":"I never get to bed before 11","bad_example[0]":"Never I get to bed before 11","explanation[1]":"Never usually comes after the verb ‘be’","example[10]":"She was never on time ","explanation[2]":"You sometimes use never before ‘be’ to emphasize that two statements are connected","example[11]":"‘Sarah was late that day’ ‘I’m not surprised She never was on time!’","explanation[3]":"Never usually comes after the auxiliary","example[12]":"I have never liked sports","explanation[4]":"You sometimes use never before an auxiliary to emphasize that two statements are connected","example[13]":"I don’t enjoy football I never have liked sports","explanation[5]":"In writing, you can use never at the beginning of a sentence before an auxiliary to emphasize something","example[14]":"Never had she been so confused","example[15]":"Ali had never seen snow before.","example[16]":"I’ll never forget that day.","definition[1]":"used to emphasize that you mean never","example[17]":"Do you promise never ever to tell anyone else about this?","display[0]":"not once","definition[2]":"used to emphasize that you are surprised or annoyed because someone never did something","example[18]":"She’s never said thank you – not once.","example[19]":"Jo hasn’t emailed me once in six months.","display[1]":"not/never for a moment","definition[3]":"used to emphasize that you never had a particular thought or idea","example[20]":"‘Did you ever suspect he was cheating on you?’ ‘No, not for a moment.’","example[21]":"Not for one moment did she think it was a trap.","display[2]":"not/never in a million years","definition[4]":"used to say that it is completely impossible that something could ever happen","example[22]":"Dad will never agree to that – not in a million years!","display[3]":"at no time","definition[5]":"used to emphasize that something never happened","example[23]":"At no time did anyone suggest that the drug was dangerous.","example[24]":"At no time were the prisoners mistreated.","definition[6]":"used when you are very surprised by something","example[25]":"‘They’re getting married next month.’ ‘Never!’","example[26]":"He’s never going to cycle all the way to Manchester!","example[27]":"Well I never! I wouldn’t have thought she was that old!"}