{"word[0]":"town","definition[0]":"a large area with houses, shops, offices etc where people live and work, that is smaller than a city and larger than a village","example[0]":"an industrial town in the Midlands","example[1]":"I walked to the nearest town.","example[2]":"the town of Norwalk, Connecticut","note[0]":"town of","signpost[0]":"main centre","definition[1]":"the business or shopping centre of a town","example[3]":"We’re going into town tonight to see a film.","example[4]":"They have a small apartment in town.","definition[2]":"all the people who live in a particular town","example[5]":"The whole town turned out to watch the procession.","signpost[1]":"where you live","definition[3]":"the town or city where you live","example[6]":"Cam left town about an hour ago, so he should be out at the farm by now.","example[7]":"I’ll be out of town for about a week.","example[8]":"Guess who’s in town? Jodie’s sister!","example[9]":"Do you know of a good place to eat? I’m from out of town (=from a different town).","example[10]":"We’re moving to another part of town.","signpost[2]":"village","definition[4]":"several houses forming a small group around a church, shops etc","example[11]":"Rowayton is a small town of around 4,000 people.","form[0]":"ADJECTIVES/NOUN + town","collocation[0]":"small/big","example[12]":"I grew up in a small town in Iowa.","example[13]":"The nearest big town is 20 miles away.","collocation[1]":"a little town","example[14]":"a pretty little town in the French Alps","collocation[2]":"a major town","example[15]":"It is one of the UK’s biggest retailers with shops in every major town.","collocation[3]":"busy/bustling","example[16]":"The town was busy even in November.","example[17]":"The town is quiet in the summer.","example[18]":"Cannigione is a quiet little town with a scattering of shops, restaurants and cafés.","collocation[4]":"sleepy","example[19]":"Johnson grew up in the sleepy retirement town of Asheville.","collocation[5]":"a historic/ancient town","example[20]":"Visitors can go on a tour of this historic town.","collocation[6]":"an industrial town","example[21]":"Thousands moved to the newly forming industrial towns to work in the mills.","collocation[7]":"a seaside town","example[22]":"young people looking for seasonal work in seaside towns","collocation[8]":"a provincial town","example[23]":"Many provincial towns were transformed by the coming of the railway.","collocation[9]":"a market town","example[24]":"The pretty market town of Ashbourne is only 9 miles away.","collocation[10]":"somebody’s home town","example[25]":"He was buried in his home town of Leeds.","collocation[11]":"a new town","example[26]":"The design of Milton Keynes and other new towns proved unpopular.","collocation[12]":"the centre of town/the town centre","example[27]":"The hotel was right in the center of town.","collocation[13]":"the outskirts/edge of a town","example[28]":"It was six o'clock when she reached the outskirts of the town."}