{"signpost[0]":"red/blue/green etc","definition[0]":"red, blue, yellow, green, brown, purple etc","example[0]":"What colour dress did you buy?","example[1]":"What colour are his eyes?","example[2]":"The pens come in a wide range of colours.","example[3]":"I love wearing bright colours.","note[0]":"light/bright/pastel etc colour","example[4]":"The walls were a lovely reddish-brown color.","note[1]":"reddish-brown/yellowy-green/deep blue etc colour","signpost[1]":"colour in general","definition[1]":"the appearance of something as a result of the way it reflects (=throws back) light, especially when its appearance is very bright or is made up of a lot of different colours","example[5]":"Bright bold accessories are the quickest way to add colour to a room.","example[6]":"a splash of colour (=a small area of a bright colour)","example[7]":"The sky began to slowly change colour.","example[8]":"the fall colors  (=the colours of the trees in autumn)","example[9]":"In summer the gardens are a blaze of colour.","note[2]":"blaze/riot/mass of colour","example[10]":"The wine was almost pink in colour  (=was almost pink).","note[3]":"in colour","signpost[2]":"somebody’s race","definition[2]":"how dark or light someone’s skin is, which shows which race they belong to","example[11]":"Everyone has a right to a job, regardless of their race, sex, or colour.","example[12]":"people of all colors","example[13]":"the continuing battle against colour prejudice","signpost[3]":"substance","definition[3]":"a substance such as paint or dye that makes something red, blue, yellow etc","example[14]":"Wash the garment separately, as the colour may run (=come out when washed).","example[15]":"jams that contain no artificial colours or preservatives","example[16]":"our new range of eyeshadows and lip colours","note[4]":"lip/nail/eye colour","signpost[4]":"somebody’s face","definition[4]":"if you have some colour in your face, your face is pink or red, usually because you are healthy or embarrassed","example[17]":"You look a lot better today. At least you’ve got a bit of colour now.","example[18]":"One of the girls giggled nervously as colour flooded her cheeks (=her cheeks suddenly went very pink or red).","example[19]":"He stared at her, the colour draining from his face.","signpost[5]":"something interesting","definition[5]":"interesting and exciting details or qualities that someone or something has","example[20]":"The old market is lively, full of colour and activity.","example[21]":"a travel writer in search of local colour","example[22]":"Intelligent use of metaphors can add colour to your writing.","note[5]":"add/give colour to something","collocation[0]":"a red/green/blue etc colour","example[23]":"Our door was painted a bright green colour.","collocation[1]":"a reddish/greenish/bluish etc colour","example[24]":"The glass used for bottles is often a greenish colour.","collocation[2]":"a bluey/yellowy/browny colour","example[25]":"I like bluey colours best.","collocation[3]":"a bright/strong colour","example[26]":"Bright colours look good in strong sunlight.","collocation[4]":"a bold/vivid/vibrant colour","example[27]":"His paintings are known for their use of bold colours.","collocation[5]":"a rich colour","example[28]":"I love the rich colours in oriental rugs.","collocation[6]":"a dark colour","example[29]":"People tend to wear dark colours to work.","collocation[7]":"a deep colour","collocation[8]":"a neutral colour","collocation[9]":"a light/pale colour","example[30]":"Light colours make a room look larger.","collocation[10]":"a pastel colour","collocation[11]":"a warm colour","example[31]":"The old farmhouse is beautifully decorated with warm colours.","collocation[12]":"a soft colour","collocation[13]":"a subtle colour","example[32]":"Italian sweaters come in lovely subtle colours.","collocation[14]":"a loud colour","collocation[15]":"a gaudy/garish colour","collocation[16]":"contrasting colours","example[33]":"You need to have one or two contrasting colours in the room.","collocation[17]":"complementary colours","example[34]":"Plant the flowers in patches in complementary colours.","collocation[18]":"a matching colour","example[35]":"I bought some gloves and a scarf in a matching colour.","collocation[19]":"a primary colour","example[36]":"Why are children’s toys always in primary colours?","collocation[20]":"a colour matches something","example[37]":"The colour in this tin of paint doesn’t match the walls.","collocation[21]":"a colours clashes (with something)","example[38]":"Do you think the colour of this tie clashes with my shirt?","collocation[22]":"a colour fades","example[39]":"The colour of the curtains had faded in the sun.","form[0]":"colour + NOUN","collocation[23]":"a colour scheme","example[40]":"Have you decided on a colour scheme?","collocation[24]":"a colour combination/combination of colours","example[41]":"In autumn the leaves create lovely colour combinations.","collocation[25]":"a colour range/range of colours","example[42]":"There’s a wide colour range to choose from.","definition[6]":"red, blue, yellow etc","example[43]":"Blue is my favourite colour.","example[44]":"Matisse was famous for his use of colour.","display[0]":"shade","definition[7]":"a particular type of a colour","example[45]":"The dress is a light shade of pink.","example[46]":"He uses different shades of green.","display[1]":"hue","definition[8]":"a particular colour or shade of a colour","example[47]":"Her face had lost its golden hue.","display[2]":"tint","definition[9]":"a small amount of a colour in something that is mostly another colour","example[48]":"He wears sunglasses that have a pinky-orange tint.","display[3]":"tone","definition[10]":"one of the many different shades of a colour, each slightly darker, lighter, brighter etc than the next","example[49]":"Carpets in neutral tones give a feeling of space.","heading[0]":"dark colours","definition[11]":"used about a colour that is strong and fairly close to black","example[50]":"a dark blue suit","example[51]":"His eyes are dark brown.","definition[12]":"fairly dark – often used when you think this colour looks attractive","example[52]":"His eyes were a beautiful deep blue.","example[53]":"deep red lips","display[4]":"rich","definition[13]":"used about a colour that is fairly dark in a way that gives a pleasant feeling of warmth","example[54]":"The walls were painted a rich red colour.","heading[1]":"light colours","definition[14]":"used about a colour that is not dark","example[55]":"a light blue sweater","example[56]":"His T-shirt was light green.","display[5]":"pale","definition[15]":"used about a colour that is very light","example[57]":"He has very pale blue eyes.","definition[16]":"used about a colour that is light in a way that is attractive because it is not too obvious","example[58]":"She wears soft colours such as cream, which match her complexion.","display[6]":"pastel","definition[17]":"used about a colour that has a lot of white in it","example[59]":"The girls wore pastel pink sundresses.","heading[2]":"bright colours","definition[18]":"used about a colour that is strong and easy to see","example[60]":"The front door was painted bright red.","display[7]":"brilliant/vivid","definition[19]":"used about a colour that is very bright","example[61]":"I looked out at the brilliant blue sky.","example[62]":"vivid red flowers","display[8]":"colourful","definition[20]":"used about things that have many different bright colours","example[63]":"There were window boxes full of colourful flowers.","display[9]":"multicoloured","definition[21]":"used about things that have a pattern of many different bright colours","example[64]":"A multicoloured flag waved in the midday sun.","display[10]":"gaudy/garish","definition[22]":"too brightly coloured, in a way that is unattractive","example[65]":"The wallpaper was much too gaudy for me.","example[66]":"a garish orange tie","definition[23]":"to change the colour of something, especially by using dye","example[67]":"If I didn’t colour my hair I’d be totally grey.","example[68]":"Colour the icing with a little green food colouring.","example[69]":"Sunset came and coloured the sky a brilliant red.","note[6]":"colour something red/blue etc","definition[24]":"to use coloured pencils to put colours inside the lines of a picture","example[70]":"On the back page is a picture for your child to colour in.","example[71]":"She has no idea how to colour a picture – she just scribbles all over it.","definition[25]":"when someone colours, their face becomes redder because they are embarrassed","synonym[0]":"blush","example[72]":"Her eyes suddenly met his and she coloured slightly."}