{"word[0]":"since","definition[0]":"from a particular time or event in the past until the present, or in that period of time","example[0]":"We’ve been waiting here since two o’clock.","example[1]":"I haven’t played rugby since I left university.","example[2]":"She left London ten years ago, and I haven’t seen her since.","example[3]":"The factory has been here since the 1970s.","example[4]":"It was exactly five years since her father had died.","example[5]":"Since the end of the war, over five thousand prisoners have been released.","example[6]":"He lost his job five years ago, but has since found other work.","example[7]":"I left school in 1995, and since then I’ve lived in London.","example[8]":"We’ve been friends ever since we were at school together.","note[0]":"ever since","example[9]":"She’s been terrified of the sound of aircraft ever since the crash.","example[10]":"We came to the UK in 1974 and have lived here ever since.","definition[1]":"used to give the reason for something","example[11]":"Since you are unable to answer, perhaps we should ask someone else.","explanation[0]":"You use since with a time, year, date, or other point in time","example[12]":"He has been living in England since 2008","example[13]":"We’ve known about it since May","explanation[1]":"Don’t use since with a period of time","bad_example[0]":"He has been living in England since 12 years","explanation[2]":"You use the present perfect before since","example[14]":"I have liked him since we first met","example[15]":"We’ve been driving since six this morning","bad_example[1]":"I like him since we first met","explanation[3]":"You also use the past perfect before since","example[16]":"She had been waiting since five o’clock","bad_example[2]":"She was waiting since five o’clock","explanation[4]":"You use the simple past tense after since","example[17]":"He has grown since I last saw him","explanation[5]":"You use for with a period of time","example[18]":"I’ve known him for ten years","example[19]":"We’ve been waiting for hours"}