{"past_tense[0]":"ran","signpost[0]":"move quickly using your legs","definition[0]":"to move very quickly, by moving your legs more quickly than when you walk","example[0]":"The children came running out of the house.","example[1]":"Women ran screaming, with children in their arms.","example[2]":"Jane struggled free and ran for her life (=ran in order to avoid being killed).","example[3]":"Hurry! Run for it (=run as quickly as possible in order to escape)!","example[4]":"He picked up the child and ran like hell (=ran very quickly, especially in order to escape).","example[5]":"I ran down the stairs as fast as I could.","note[0]":"run down/up/to/towards etc","example[6]":"He was running towards the door.","example[7]":"She turned and ran away.","example[8]":"The boys ran off into the crowd.","example[9]":"Several people ran to help her when she fell.","note[1]":"run to do something","definition[1]":"to run a particular distance","example[10]":"Firefighters are to run 500km to raise money for a children’s charity.","example[11]":"He ran the length of the corridor.","signpost[1]":"race","definition[2]":"to run in a race","example[12]":"I’d never run a marathon before.","example[13]":"Murray has said she will consider running in the 3000 metres.","note[2]":"run in","definition[3]":"if a race is run at a particular time or in a particular place, it happens at that time or in that place","example[14]":"The Derby will be run at 3 o'clock.","signpost[2]":"organize/be in charge of","definition[4]":"to organize or be in charge of an activity, business, organization, or country","example[15]":"For a while, she ran a restaurant in Boston.","example[16]":"Many people don’t care who runs the country.","example[17]":"Courses are currently being run in London and Edinburgh.","example[18]":"Many people belong to a pension scheme run by their employers.","example[19]":"a state-run (=controlled by the government) television station","example[20]":"The hotel is well-run and extremely popular.","note[3]":"well/badly run","signpost[3]":"do something/go somewhere quickly","definition[5]":"to do something or go somewhere quickly","example[21]":"Run and ask your mother where she’s put the keys.","example[22]":"I need to run to the store for some more milk.","note[4]":"run to","signpost[4]":"buses/trains etc","definition[6]":"if a bus, train etc service runs, it takes people from one place to another at fixed times","example[23]":"The buses don’t run on Sundays.","example[24]":"The number 61 bus runs to the city centre.","definition[7]":"if a company or other organization runs a bus, train etc service, they make it operate","example[25]":"They’re running special trains to and from the exhibition.","definition[8]":"if a computer program runs, it operates","example[26]":"The software will run on any PC.","note[5]":"run on","definition[9]":"if you run a program, you make it operate","example[27]":"The RS8 system runs both Unix and MPX-32.","signpost[5]":"machine/engine","definition[10]":"if a machine or engine runs, it operates","example[28]":"She got out of the car and left the engine running.","example[29]":"Most cars run on unleaded fuel.","note[6]":"run on electricity/gas/petrol etc","example[30]":"It runs off batteries.","note[7]":"run off something","definition[11]":"if you run a machine or engine, you make it operate","example[31]":"You shouldn’t keep the engine running when the car is standing still.","example[32]":"I often run the washing machine more than once a day.","signpost[6]":"tape","definition[12]":"if a tape is running, it is recording","example[33]":"She didn’t realize the tape was running as she spoke.","definition[13]":"if you run a tape, you make it move backwards or forwards","example[34]":"Run the tape back to the beginning.","signpost[7]":"newspaper/television","definition[14]":"to print something in a newspaper or magazine, or broadcast something on television","example[35]":"The company is running a series of advertisements in national newspapers.","example[36]":"A local TV station ran her story.","definition[15]":"if a program runs on television, it is shown. If a story runs in a newspaper or magazine, it is printed","example[37]":"The series ran for 20 episodes and was extremely popular.","example[38]":"Conan Doyle’s stories ran in ‘The Strand’ magazine.","signpost[8]":"fast/out of control","definition[16]":"to move too fast or in an uncontrolled way","example[39]":"Her car ran off the road and into a tree.","example[40]":"The truck ran out of control and hit a house.","signpost[9]":"use a vehicle","definition[17]":"to own and use a vehicle","example[41]":"I can’t afford to run a car.","example[42]":"A bicycle is relatively cheap to buy and run.","signpost[10]":"take somebody in your car","definition[18]":"to take someone somewhere in your car","example[43]":"Shall I run you home?","example[44]":"Let me run you to the station.","note[8]":"run somebody to something","signpost[11]":"in an election","definition[19]":"to try to be elected in an election","example[45]":"Salinas is running for a second term as president.","note[9]":"run for","example[46]":"an attempt to encourage more women to run for office","example[47]":"Feinstein will win if she runs against Lungren.","note[10]":"run against","signpost[12]":"something long","definition[20]":"if something long such as a road or wire runs in a particular direction, that is its position, or that is where you put it","example[48]":"The road runs along a valley.","example[49]":"Developers want to run a road right through his farm.","example[50]":"Run the cables under the carpet.","example[51]":"The Sierra mountain range runs the length of the north west coast of Majorca.","signpost[13]":"move something on a surface","definition[21]":"to move something lightly along a surface","example[52]":"Charles ran his fingers through her hair.","example[53]":"Run the scanner over the bar codes.","signpost[14]":"flow","definition[22]":"to flow in a particular direction or place","example[54]":"Tears started to run down her cheeks.","example[55]":"Water was running off the roof.","signpost[15]":"tap","definition[23]":"if a tap is running, water is coming out of it, or if you run a tap, you make water come out of it","example[56]":"Did you leave the tap running?","example[57]":"He ran the tap until the water was really hot.","signpost[16]":"somebody’s nose","definition[24]":"if someone’s nose is running, liquid is flowing out of it","signpost[17]":"official papers","definition[25]":"if something runs for a particular length of time, it can officially be used for that time","example[58]":"The contract runs for a year.","example[59]":"My car insurance only has another month to run.","signpost[18]":"play/film","definition[26]":"to continue being performed regularly in one place","example[60]":"The play ran for two years.","definition[27]":"to happen in a particular way or at a particular time","example[61]":"Andy kept things running smoothly (=happening in the way they should) while I was away.","example[62]":"He was given a further three month prison sentence to run concurrently.","example[63]":"The course runs over a three year period.","signpost[19]":"amount/price","definition[28]":"to be at a particular level, amount, or price","example[64]":"Inflation was running at 5%.","note[11]":"run at","example[65]":"The cost of repairing the damage could run to $5000.","signpost[20]":"story/account etc","definition[29]":"if a story, discussion etc runs in a particular way, it has those particular words or events","example[66]":"The story runs that someone offered Lynch a further $500.","example[67]":"‘President’s marriage really over’ ran the headline in a national newspaper.","signpost[21]":"thoughts/feelings","definition[30]":"if a feeling runs through you, or a thought runs through your mind, you feel it or think it quickly","example[68]":"A feeling of excitement ran through her body as they touched.","note[12]":"run through/down","example[69]":"The same thought kept running through his mind.","example[70]":"A cold shiver ran down my back.","example[71]":"I felt a sharp pain run down my leg.","signpost[22]":"colour in clothes","definition[31]":"if colour runs, it spreads from one piece of clothing or one area of cloth to another when the clothes are wet","example[72]":"The T-shirt ran and made all my other clothes pink.","signpost[23]":"paint/ink","definition[32]":"if paint runs, it moves onto an area where you did not intend it to go","signpost[24]":"hole in clothes","definition[33]":"if a hole in tights or stockings runs, it gets bigger in a straight line","example[73]":"My five-year-old son runs everywhere.","example[74]":"I go running twice a week.","display[0]":"jog","definition[34]":"to run quite slowly for exercise over a long distance","example[75]":"A few people were jogging in the park.","display[1]":"race/dash","definition[35]":"to run somewhere as quickly as you can, especially because you have to do something urgently","example[76]":"He dashed across the road to the police station.","example[77]":"We raced to the bus stop and got there just in time.","display[2]":"sprint","definition[36]":"to run as fast as you can for a short distance","example[78]":"I saw the runners sprinting past.","example[79]":"He sprinted up the stairs.","display[3]":"tear","definition[37]":"to run very quickly and without really looking where you are going, because you are in a hurry","example[80]":"He tore down the street and around the corner.","display[4]":"charge","definition[38]":"to run quickly and with a lot of energy, so that you might knock down anyone or anything that gets in your way","example[81]":"They all charged out of the school gates at 4 o'clock.","example[82]":"Dennis charged through the door into my office.","display[5]":"take to your heels","definition[39]":"to start running away very quickly, especially to escape or because you are afraid","example[83]":"The men took to their heels as soon as they saw the police.","display[6]":"leg it","definition[40]":"to run away very quickly, in order to escape from someone or something","example[84]":"I legged it before the cops came.","display[7]":"lope","definition[41]":"to run easily with long steps – used especially about tall people with long legs","example[85]":"John loped across the street to meet me.","heading[0]":"animals running","display[8]":"trot","definition[42]":"to run fairly slowly, taking short steps – used especially about horses and dogs","example[86]":"A little dog was trotting behind her.","display[9]":"gallop","definition[43]":"if a horse gallops, it runs very quickly","example[87]":"The horse galloped off across the field.","display[10]":"bolt","definition[44]":"to suddenly run somewhere very fast, especially in order to escape","example[88]":"Suddenly a fox bolted out from beneath a hedge.","signpost[25]":"on foot","definition[45]":"a period of time spent running, or a distance that you run","example[89]":"a five-mile run","example[90]":"She usually goes for a run before breakfast.","example[91]":"He was still following me, and in a panic I broke into a run.","example[92]":"Sarah left the house at a run.","note[13]":"at a run","signpost[26]":"series","definition[46]":"a series of successes or failures","example[93]":"an unbeaten run of 19 games","example[94]":"Losing my job was the start of a run of bad luck that year.","note[14]":"run of good/bad luck","example[95]":"His extraordinary run of successes has been stopped.","note[15]":"a run of defeats/victories etc","signpost[27]":"amount produced","definition[47]":"an amount of a product produced at one time","example[96]":"a limited run of 200 copies","definition[48]":"a continuous series of performances of a play, film etc in the same place","example[97]":"His first play had a three-month run in the West End.","definition[49]":"a journey by train, ship, truck etc made regularly between two places","example[98]":"It’s only a 55-minute run from London to Brighton.","example[99]":"the daily school run (=the journey that parents make each day taking their children to and from school) British English","definition[50]":"a short journey in a car, for pleasure","example[100]":"Let’s take the car out for a run.","signpost[28]":"for animals","definition[51]":"an enclosed area where animals such as chickens or rabbits are kept","example[101]":"a chicken run","definition[52]":"a point won in cricket or baseball","example[102]":"Jones made 32 runs this afternoon.","signpost[29]":"winter sports","definition[53]":"a special area or track on a mountain for people to ski or sledge down","example[103]":"a ski run","signpost[30]":"election","definition[54]":"an attempt to be elected to an important position","example[104]":"He is preparing a run for the presidency.","signpost[31]":"in clothes","definition[55]":"a line of torn stitches in tights or stockings","definition[56]":"a set of notes played or sung quickly up or down a scale in a piece of music","signpost[32]":"card games","definition[57]":"a set of cards with numbers in a series, held by one player","definition[58]":"to control or be in charge of an organization, company, or system","example[105]":"I’ve always wanted to run my own business.","example[106]":"A well-run company should not have problems of this kind.","example[107]":"a state-run airline","definition[59]":"if you run a machine or a computer program, you make it work","example[108]":"How many times a week do you run your washing machine?","example[109]":"cars that run on unleaded petrol","definition[60]":"working fully and correctly","example[110]":"The new system won’t be up and running until next week.","definition[61]":"to continue to be VALID (legally or officially acceptable) for a particular period of time","example[111]":"My car insurance only has another year to run.","definition[62]":"to happen or take place, especially in the way that was intended","example[112]":"So far, it had all run according to plan (=happened in the way that had been planned).","example[113]":"Her job is to ensure university catering runs smoothly (=happens with no unexpected problems).","definition[63]":"to operate a bus, train, or plane service","definition[64]":"to currently be at a particular level","example[114]":"Inflation at that time was running at 10%.","definition[65]":"to have very little of something left","example[115]":"The insurance fund was running short of cash.","definition[66]":"to be doing everything later than planned or expected","example[116]":"They were running late, so I didn’t get interviewed until nearly 4 o'clock.","definition[67]":"to check or test someone or something","example[117]":"Car-rental companies are running background checks on drivers who rent for long periods.","example[118]":"She worked for a company running credit checks on people.","example[119]":"He has yet to decide whether to run for chairman.","example[120]":"the candidates who are hoping to run against the President in November","definition[68]":"to print an advertisement, a story etc in a newspaper or magazine","example[121]":"magazines that don’t run tobacco ads","example[122]":"The paper still runs articles that anger dealers.","definition[69]":"to have less or more money than is needed","example[123]":"The government is running a large budget surplus.","definition[70]":"a series of similar events, especially successes or failures","example[124]":"The company has had a run of spectacularly successful years.","note[16]":"run of","definition[71]":"when a lot of people suddenly buy a particular product","example[125]":"Controls were necessary to prevent a run on inexpensive Czech goods.","definition[72]":"when a lot of people all take their money out of a bank at the same time","example[126]":"A run on any bank could spread to other banks and threaten the entire system.","example[127]":"Even a minor bank run could bring down the system.","definition[73]":"when a lot of people sell dollars, pounds etc and their value goes down","example[128]":"Financial markets panicked, causing a run on the Brazilian currency.","definition[74]":"at a later time in the future or over a longer period of time","example[129]":"The company believes that the move will save it money in the long run.","definition[75]":"in the near future","example[130]":"The plan does provide some help in the short run.","definition[76]":"an amount of a product that is produced at one time","example[131]":"Large production runs are necessary in order to cover the massive fixed costs involved in developing new cars.","example[132]":"The book has already sold out its initial print run of 20,000 copies.","definition[77]":"run of book etc advertisements can be put anywhere in a magazine or newspaper, or on any website or part of a website, rather than in a particular place"}