{"signpost[0]":"change place","definition[0]":"to change from one place or position to another, or to make something do this","example[0]":"Please keep the doors closed while the train is moving.","example[1]":"‘Come on, ’ Sue said. No one moved.","example[2]":"Could you move your car, please? It’s blocking the road.","example[3]":"The bar was so crowded you could hardly move.","example[4]":"At Christmas, you couldn’t move for toys in this house  (=there were a lot of toys).","example[5]":"Paul couldn’t move a muscle (=could not move at all) he was so scared.","example[6]":"The plane moved slowly along the runway, then stopped.","note[0]":"move quickly/slowly/steadily etc","example[7]":"He moved closer to her.","note[1]":"move away/out/to/towards etc","example[8]":"Becca moved down the steps and into the yard.","example[9]":"I could hear someone moving around upstairs.","note[2]":"move about/around","signpost[1]":"new house/office","definition[1]":"if a person or company moves, or if you move them, they go to live or work in a different place","example[10]":"We’ve moved seven or eight times in the last five years.","example[11]":"The company is moving its sales center downtown.","example[12]":"My parents kept moving house because of my dad’s job.","note[3]":"move house/home","example[13]":"When are you moving to Memphis?","note[4]":"move to/into/from","example[14]":"They’ve moved into bigger offices in London.","example[15]":"He had to move his mother into a nursing home.","note[5]":"move somebody to/into/from etc something","signpost[2]":"change opinion etc","definition[2]":"to change from one opinion or way of thinking to another","example[16]":"Neither side is willing to move on the issue of territory.","example[17]":"The two political parties have moved closer towards each other in recent months.","note[6]":"move towards/away from","example[18]":"At this stage, children move further away from the influence of their parents, and depend more on their friends.","definition[3]":"to persuade someone to change their opinion","example[19]":"She won’t be moved – it doesn’t matter what you say to her.","definition[4]":"to make progress in a particular way or at a particular rate","example[20]":"Things moved quickly once the contract was signed.","example[21]":"The negotiations seem to be moving in the right direction.","example[22]":"The plan should boost employment and get things moving in the economy.","note[7]":"get/keep things moving","signpost[3]":"take action","definition[5]":"to start taking action, especially in order to achieve something or deal with a problem","example[23]":"You’ll have to move fast if you want to get a place on the course.","note[8]":"move fast/quickly/swiftly","example[24]":"The governor has yet to move on any of the recommendations in the report.","note[9]":"move on/against","signpost[4]":"change job/class etc","definition[6]":"to change to a different job, class etc, or to make someone change to a different job, class etc","synonym[0]":"transfer","example[25]":"Several students were moved from the beginners’ class into the intermediate one.","note[10]":"move somebody to/into/from something","example[26]":"He spent five years at KLP, before moving to IMed as a manager.","definition[7]":"to make someone feel strong emotions, especially of sadness or sympathy","example[27]":"His speech moved the audience to tears.","example[28]":"Russell was deeply moved by what he heard.","note[11]":"be deeply/genuinely/profoundly moved","signpost[5]":"cause somebody to do something","definition[8]":"to cause someone to do something","example[29]":"Seeing her there had moved him to think about the time they had together.","note[12]":"move somebody to do something","example[30]":"I have never before felt moved to write, but I feel I must protest.","note[13]":"be/feel moved to do something","signpost[6]":"time/order","definition[9]":"to change the time or order of something","example[31]":"Could we move the meeting to Thursday?","note[14]":"move something to/from something","signpost[7]":"change subject","definition[10]":"to start talking or writing about a different subject","example[32]":"We seem to be moving away from the main point of the discussion.","note[15]":"move away from/off/to etc","definition[11]":"to change the position of one of the objects used to play a game such as chess","signpost[8]":"at a meeting","definition[12]":"to officially make a proposal at a meeting","example[33]":"They want to move an amendment to the bill.","note[16]":"move an amendment","example[34]":"The chairman moves that the meeting be adjourned.","note[17]":"move that","example[35]":"I move to approve the minutes as read.","note[18]":"move to do something","signpost[9]":"go fast","definition[13]":"to travel very fast","example[36]":"This car can really move!","signpost[10]":"be bought","definition[14]":"if things of a particular kind are moving, they are being bought, especially at a particular rate","example[37]":"The highest-priced homes are still moving slowly.","explanation[0]":"Move belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[1]":"In this sentence, ‘the store’ is the object of move","example[38]":"They moved the store to bigger premises","explanation[2]":"In this sentence, ‘the store’ is the subject of move","example[39]":"The store moved to bigger premises","definition[15]":"to go to a different place, or change the position of your body","example[40]":"Sarah moved away from the window.","example[41]":"Every time I move I get a pain in my left shoulder.","display[0]":"sway","definition[16]":"to move slowly from one side to the other","example[42]":"The branches swayed in the wind.","example[43]":"Donny swayed drunkenly as he walked back to his car.","definition[17]":"to move repeatedly from one side to another, with small gentle movements","example[44]":"He rocked backward and forward in his chair.","example[45]":"The boat rocked from side to side with the waves.","display[1]":"wobble","definition[18]":"to move unsteadily from side to side","example[46]":"The bike wobbled a bit, but she soon got it under control.","display[2]":"fidget","definition[19]":"to keep moving or playing with your fingers, hands, feet etc, because you are bored or nervous","example[47]":"Diana fidgeted nervously with her pencil.","display[3]":"squirm","definition[20]":"to make very small movements from side to side with your body, especially because you feel uncomfortable","example[48]":"By the end of the hour, most of the children were squirming in their seats.","display[4]":"wriggle","definition[21]":"to make small movements from side to side, especially in order to get into or out of something","example[49]":"The dog wriggled under the fence and escaped into the street.","example[50]":"She managed to wriggle into the dress, but it was much too tight.","display[5]":"twitch","definition[22]":"if part of your body twitches, it makes small movements that you cannot control","example[51]":"A muscle on Yang’s face twitched.","display[6]":"stir","definition[23]":"to make a movement – used especially when describing a situation in which no one moves, or someone wakes up","example[52]":"In the village a dog barked but no one stirred.","example[53]":"The sleeping child stirred and opened her eyes.","display[7]":"budge","definition[24]":"to move – used when you are trying hard to make something move, often without success","example[54]":"The piano wouldn’t budge.","heading[0]":"to move to a different house, office etc","example[55]":"They’ve moved back to Santiago.","example[56]":"My brother’s helping us move house.","display[8]":"relocate","definition[25]":"to move to a different place – used about companies, organizations, and people who work for them","example[57]":"NATO’s main headquarters relocated to Brussels.","example[58]":"Klein is relocating to London to head up the investment banking team.","heading[1]":"not moving","display[9]":"still","definition[26]":"not moving – use this especially about people who are not moving, or about places where there is no wind","example[59]":"There was no wind and the trees were completely still.","example[60]":"Keep still while I tie your shoes.","display[10]":"stationary","definition[27]":"not moving – use this about cars, trains, or objects","example[61]":"The truck swerved and hit a stationary vehicle.","display[11]":"immobile","definition[28]":"not moving or not able to move, especially because of fear or tiredness","example[62]":"As the disease progressed, she became increasingly immobile.","display[12]":"motionless","definition[29]":"completely still – used especially in literature","example[63]":"Kemp sat motionless as the verdict was read.","definition[30]":"not moving because there is no wind – use this about air and water","example[64]":"The lake was calm.","display[13]":"be at a standstill","definition[31]":"if traffic is at a standstill it is not moving","example[65]":"Traffic was at a standstill on the motorway.","signpost[11]":"decision/action","definition[32]":"something that you decide to do in order to achieve something","example[66]":"She’s still thinking about her next move.","example[67]":"Most of the council members are reluctant to make such a drastic move.","example[68]":"The authorities have made no move to resolve the conflict.","example[69]":"Taking the position was a good career move (=a decision that will improve the type of jobs you can do).","example[70]":"She decided to learn as much about it as she could, which seemed like a wise move.","note[19]":"a good/wise/smart etc move","example[71]":"It seems there could be moves afoot to close the centre.","note[20]":"there are moves afoot (to do something)","example[72]":"the Board’s recent moves to cut interest rates","definition[33]":"when someone moves for a short time in a particular direction","example[73]":"Good gymnasts rehearse their moves mentally before a competition.","example[74]":"He made no move to come any nearer.","example[75]":"Martin made a move towards the door.","example[76]":"One false move (=move in the wrong direction) and I’ll shoot.","example[77]":"His green eyes followed Cissy’s every move.","note[21]":"watch/follow somebody’s every move","signpost[12]":"progress/change","definition[34]":"a change, especially one which improves a situation","example[78]":"Much more research is being done, which is a move in the right direction.","example[79]":"the country’s move towards democracy","note[22]":"move towards/from/against/to","example[80]":"a move away from traditional industries such as coal mining","definition[35]":"when you change the position of one of the objects in a game such as chess","example[81]":"Several moves later, Ron took his king.","example[82]":"It’s your move, Janet  (=it is your turn to move an object).","signpost[13]":"going to a new place","definition[36]":"when you leave one house, office etc, and go to live or work in a different one","example[83]":"The move to a larger office building is long overdue.","heading[2]":"– Meaning 1: something that you decide to do in order to achieve something","collocation[0]":"make a move","example[84]":"We made the move mainly for financial reasons.","collocation[1]":"make no move","example[85]":"The government made no move to hold the promised elections.","collocation[2]":"welcome the move","example[86]":"Environmentalists welcomed the move to limit the length of fishing nets.","collocation[3]":"oppose a move","example[87]":"Union members have opposed the move.","collocation[4]":"support a move","example[88]":"The move was supported by the government.","collocation[5]":"a move is aimed at doing something/is designed to do something","example[89]":"The move is aimed at strengthening its business in the region.","form[0]":"ADJECTIVES/NOUN + move","collocation[6]":"an important move","example[90]":"I cannot decide on such an important move on my own.","collocation[7]":"a bold/daring move","example[91]":"The writers made a bold move by killing off the main character.","collocation[8]":"a good/smart/wise move","example[92]":"I’m not sure it was a good move giving him the job.","collocation[9]":"the right move","example[93]":"He hoped he had made the right move in telling his father.","collocation[10]":"an unprecedented move","example[94]":"Barcelona began the unprecedented move of shipping in drinking water.","collocation[11]":"somebody’s next move","example[95]":"What should happen next? What’s our next move?","collocation[12]":"a bad move","example[96]":"It was a bad move letting him come here in the first place.","collocation[13]":"a false/wrong move","example[97]":"One wrong move and the business might never recover.","collocation[14]":"the first move","example[98]":"She waited for Michael to make the first move.","collocation[15]":"a career move","example[99]":"It looked like a good career move, with the possibility of promotion later.","collocation[16]":"there are moves afoot to do something","example[100]":"There are moves afoot to change things.","collocation[17]":"a move in the right direction","example[101]":"The decision seemed to be a move in the right direction.","heading[3]":"– Meaning 2: when someone moves for a short time in a particular direction","example[102]":"She made a move towards the door.","example[103]":"He made no move to stop her.","example[104]":"His eyes followed Cissy’s every move.","example[105]":"One false move, and she’d fall over the edge.","collocation[18]":"a sudden move","example[106]":"She made a sudden move towards me from the doorway.","definition[37]":"if a product moves, or if a shop, dealer etc moves it, it sells very quickly","example[107]":"These computer games are moving very fast. The kids love them.","example[108]":"The company isn’t moving enough product.","definition[38]":"to change to a different job, department etc, or to make someone change to a different job, department etc","example[109]":"She’s just moved from the sales department.","note[23]":"move (somebody) to/from something","definition[39]":"to officially make a suggestion at a meeting","example[110]":"The chairman moved that the meeting be adjourned.","definition[40]":"to go to live or work in a different place","note[24]":"move to","example[111]":"They’ve moved into a bigger office.","note[25]":"move into"}