{"word[0]":"poll","definition[0]":"the process of finding out what people think about something by asking many people the same question, or the record of the result","synonym[0]":"opinion poll","example[0]":"A recent poll found that 80% of Californians support the governor.","example[1]":"Polls indicate that education is the top issue with voters.","example[2]":"Labour is ahead in the polls.","example[3]":"The latest public opinion poll showed that 25% of us consider ourselves superstitious.","example[4]":"a poll conducted by ‘USA Today’","note[0]":"conduct/carry out/do a poll","example[5]":"a poll on eating habits","note[1]":"poll on","example[6]":"a poll of 1,000 people","note[2]":"poll of","definition[1]":"the process of voting in an election, or the number of votes recorded","example[7]":"Labour won the election with 40% of the poll.","example[8]":"The result of the poll won’t be known until around midnight.","collocation[0]":"carry out/take/do a poll","example[9]":"A similar poll was carried out among academics in the United States.","example[10]":"A poll taken last month gave the Democrats a seven-point lead.","collocation[1]":"conduct a poll","example[11]":"The poll was conducted with a sample of 1,023 adults.","collocation[2]":"a poll shows/indicates/suggests something","example[12]":"Polls show that older voters are most concerned about economic issues.","collocation[3]":"a poll finds something","example[13]":"Our poll found that 29 percent rated his performance as good.","form[0]":"poll + NOUN","collocation[4]":"poll results/findings","example[14]":"The poll results are very encouraging.","collocation[5]":"a poll rating","example[15]":"His poll ratings keep slipping.","form[1]":"ADJECTIVES/NOUN + poll","collocation[6]":"an opinion poll","example[16]":"A recent opinion poll showed strong support for the government.","collocation[7]":"an exit poll","example[17]":"The exit polls said that 46 percent of women had voted for Obama.","collocation[8]":"a popularity poll","example[18]":"In most popularity polls, he is in fourth or fifth place.","collocation[9]":"a local/national/statewide etc poll","example[19]":"Local polls show him leading by only two or three points.","collocation[10]":"somebody’s lead in the polls","example[20]":"Labour soon regained its lead in the polls.","collocation[11]":"somebody’s standing in the polls","example[21]":"The president's standing in the polls declined sharply.","collocation[12]":"be ahead/leading in the polls","example[22]":"The good news is that we are ahead in the polls.","collocation[13]":"be behind/trailing in the polls","example[23]":"At the moment the Democrats are trailing in the polls.","definition[2]":"to ask a lot of people the same questions in order to find out what they think about a subject","example[24]":"18% of the women we polled said their husbands had a drinking problem.","definition[3]":"to get a particular number of votes in an election","example[25]":"Labour polled just 4% of the vote.","definition[4]":"an occasion when a large number of people are asked questions, to find out about the public’s opinions or behaviour","example[26]":"MORIconducted a poll among senior managers to get their views on taxation.","example[27]":"A recentopinion poll put him in third place.","example[28]":"According to our poll, Scandinavians buy shares more than other Europeans.","definition[5]":"an election to choose a government or a political representative","example[29]":"The ruling Social Democrats suffered their worst defeat at the polls in 60 years.","example[30]":"In Oklahoma, voters may go to the polls (=vote in an election) as early as September.","definition[6]":"an occasion when the members of a company vote for or against something in a meeting","example[31]":"Both directors were elected after a poll of shareholders.","definition[7]":"the number of votes recorded at an election","example[32]":"The winning party must gain at least 50% of the poll.","definition[8]":"to try to find out about the public’s behaviour or opinions by questioning a large number of people","example[33]":"47% of office workers polled said that eye strain was a serious concern."}