{"word[0]":"consultation","definition[0]":"a discussion in which people who are affected by or involved in something can give their opinions","note[0]":"consultation paper/document","example[0]":"There will be a public consultation exercise to ask for people’s views.","note[1]":"consultation process/exercise/period","example[1]":"The decision was reached after consultation with parents and teachers.","note[2]":"consultation with","example[2]":"He’s calling for urgent consultations between the government and the oil industry to resolve the problem.","note[3]":"consultation between","example[3]":"The plans were drawn up in consultation with engineers.","note[4]":"in consultation with somebody","definition[1]":"a meeting with a professional person, especially a doctor, for advice or treatment","example[4]":"A follow-up consultation was arranged for two weeks’ time.","definition[2]":"the process of getting advice from a professional person","example[5]":"Trained parenting experts are available for consultation by telephone.","definition[3]":"the process of looking for information or help in a book","example[6]":"Leaflets were regularly displayed for consultation by students.","collocation[0]":"hold a consultation","example[7]":"Further consultations will be held with local residents.","collocation[1]":"begin a consultation","example[8]":"French and German officials began consultations with officials from the other four nations.","collocation[2]":"require consultation","example[9]":"Any decision on military action would require consultation.","collocation[3]":"public consultation","example[10]":"The first public consultations considered environmental and health issues.","collocation[4]":"full consultation","example[11]":"No decision will be made until there has been full consultation with farmers.","collocation[5]":"prior consultation","example[12]":"New educational policies should be based on prior consultation with teachers.","collocation[6]":"proper consultation","example[13]":"Has there been proper consultation with the local communities?","collocation[7]":"further consultation","example[14]":"It is recommended that further consultation should take place.","collocation[8]":"close consultation","example[15]":"The changes followed close consultation with government officials.","collocation[9]":"wide/widespread/extensive consultation","example[16]":"Strong recommendations were made after wide consultation.","collocation[10]":"joint consultation","example[17]":"Committees can be used for joint consultation between employers and employees.","collocation[11]":"formal consultation","example[18]":"Better methods of formal consultation are needed.","form[0]":"consultation + NOUN","collocation[12]":"a consultation paper/document","example[19]":"He produced a consultation document on public transport proposals for the city.","collocation[13]":"the consultation process/period","example[20]":"an eight-week consultation process","collocation[14]":"a consultation exercise","example[21]":"The public consultation exercise was undertaken to gauge public reaction.","definition[4]":"a discussion in which people can give their opinions, before a decision is made","example[22]":"Following extensive consultation with staff, the company introduced a new salary structure.","example[23]":"The plans for the supermarket were drawn up in consultation with local residents.","example[24]":"a consultation document","definition[5]":"a meeting with a professional person for advice or treatment","example[25]":"He was only allowed one brief consultation with his lawyers on the morning before the trial began."}