{"word[0]":"lease","definition[0]":"a legal agreement which allows you to use a building, car etc for a period of time, in return for rent","example[0]":"The landlord refused to renew his lease.","example[1]":"The 99-year lease expired in 1999.","example[2]":"Do you understand all the terms of the lease?","example[3]":"They took out a lease on a seven-acre field.","note[0]":"lease on","collocation[0]":"have/hold a lease","example[4]":"Who has the lease on the flat?","collocation[1]":"take (out) a lease","example[5]":"He took a seven-year lease on the place.","collocation[2]":"renew a lease","example[6]":"The company decided not to renew the lease on the office.","collocation[3]":"grant somebody a lease","example[7]":"The landlord may grant a lease for a short or long period.","collocation[4]":"sign a lease","example[8]":"He refused to sign the new lease because the rent was too high.","collocation[5]":"a lease runs","example[9]":"The lease will run for 21 years.","collocation[6]":"a lease runs out","example[10]":"Their lease runs out in June.","collocation[7]":"a short/short-term lease","example[11]":"These flats are let on short leases to students.","collocation[8]":"a long/long-term lease","example[12]":"We’re negotiating a long-term lease on the building.","collocation[9]":"a 20/30/40 etc year lease","example[13]":"The company has acquired the building on a 30-year lease.","collocation[10]":"the current/existing lease","example[14]":"The current lease still has 12 years to run.","form[0]":"lease + NOUN","collocation[11]":"a lease agreement","example[15]":"The organization has signed a lease agreement on a 50-acre site.","collocation[12]":"a lease payment","example[16]":"He is struggling to afford the lease payments on the office.","collocation[13]":"the terms of a lease","example[17]":"Under the terms of the lease, the tenants have to pay for any repairs.","definition[1]":"to use a building, car etc under a lease","example[18]":"I’m interested in leasing your cottage.","example[19]":"They lease the site from the council.","note[1]":"lease something from somebody","definition[2]":"to let someone use a building, car etc under a lease","example[20]":"The building was leased to a health club.","note[2]":"lease something to somebody","definition[3]":"if you lease something to someone, you give them the right to use it for a particular period of time in return for payment","example[21]":"The local authority leased him the property.","note[3]":"lease somebody something","example[22]":"AT&T leased the building to Sony and said it would find cheaper space elsewhere.","example[23]":"We lease the land out to the forestry people.","note[4]":"lease something out (to somebody)","definition[4]":"if you lease something from someone, you pay them to let you use it for a particular period of time","example[24]":"All its scientific equipment is leased from another company.","definition[5]":"a legal contract that allows a person or organization to make payments to use something for a particular period of time","example[25]":"The initialterm of the lease (=the time that it lasts) is 10 years, with three additional 10-year renewal options.","example[26]":"The company leases cars to corporate fleets and then sells them when the leases expire (=end)."}