{"word[0]":"image","signpost[0]":"public opinion","definition[0]":"the opinion people have of a person, organization, product etc, or the way a person, organization etc seems to be to the public","example[0]":"attempts to improve the image of the police","note[0]":"image of","signpost[1]":"idea in mind","definition[1]":"a picture that you have in your mind, especially about what someone or something is like or the way they look","example[1]":"He had the clearest image in his mind of his mother and father.","example[2]":"He had no visual image of her, only her name.","signpost[2]":"picture/what you see","definition[2]":"a picture of an object in a mirror or in the lens of a camera","example[3]":"She peered closely at her image in the mirror.","definition[3]":"a picture on the screen of a television, cinema, or computer","example[4]":"Jill Sharpe was little more than a name, a glossy image on a television screen.","definition[4]":"a picture or shape of a person or thing that is copied onto paper or is cut in wood or stone","example[5]":"carved images","signpost[3]":"description","definition[5]":"a word, phrase, or picture that describes an idea in a poem, book, film etc","example[6]":"He paints a very romantic image of working-class communities.","form[0]":"ADJECTIVES/NOUN + image","collocation[0]":"a good/positive image","example[7]":"We want to give people a positive image of the town.","collocation[1]":"a bad/negative image","example[8]":"It’s difficult to explain why the industry has such a bad image.","example[9]":"Many negative images of women are found in the media.","collocation[2]":"a wholesome/clean-cut image","example[10]":"The recent scandal has damaged his clean-cut image.","collocation[3]":"an upmarket image","example[11]":"The company is trying to promote an upmarket image.","collocation[4]":"a downmarket image","example[12]":"The store has struggled to break away from its downmarket image.","collocation[5]":"the traditional image of something","example[13]":"They want to improve the traditional image of English food.","collocation[6]":"the popular image of something","example[14]":"The popular image of the spy as a glamorous figure of mystery is far from the reality.","collocation[7]":"somebody’s/something’s public image","example[15]":"Her public image does not reflect the way she behaves in private.","collocation[8]":"somebody’s screen image","example[16]":"He had cultivated a screen image as a ruthless tough guy.","collocation[9]":"a macho image","example[17]":"He was keen to project a macho image in this film.","collocation[10]":"have an image","example[18]":"The product has a rather downmarket image.","collocation[11]":"create an image","example[19]":"The company is trying to create an image of quality and reliability.","collocation[12]":"improve your image","example[20]":"The casino industry was keen to improve its image.","collocation[13]":"damage your image","example[21]":"Has this scandal damaged the company’s image?","collocation[14]":"live up to your image","example[22]":"He has certainly lived up to his wild rock-star image.","collocation[15]":"present/project/promote an image","example[23]":"He presented an image of himself as an energetic young leader.","collocation[16]":"cultivate an image","example[24]":"He was trying to cultivate an image of himself as an intellectual.","collocation[17]":"tarnish an image","example[25]":"His behaviour has tarnished the image of the sport.","collocation[18]":"clean up your image","example[26]":"The pop star promised to clean up his image after he was released from prison.","collocation[19]":"lose/shed an image","example[27]":"The party struggled to lose its image of being somewhat old-fashioned.","form[1]":"image + NOUN","collocation[20]":"an image problem","example[28]":"Politicians have an image problem as far as many young people are concerned.","definition[6]":"the general opinion that most people have of a person, organization, product etc","example[29]":"Law suits hurt a company’s image and may hinder future fund raising.","example[30]":"A good advertising campaign will promote a company’s corporate image while reminding consumers of the products it makes.","definition[7]":"a picture on the screen of a computer or television","example[31]":"A small company is leading the way in using lasers to create three-dimensional models from computer images."}