{"word[0]":"unfair","definition[0]":"not right or fair, especially because not everyone has an equal opportunity","synonym[0]":"unjust","example[0]":"an unfair advantage","example[1]":"laws aimed at preventing unfair competition","example[2]":"Many employers have recognized that age discrimination is unfair.","example[3]":"She won £20,000 for unfair dismissal (=being illegally made to leave your job).","collocation[0]":"very/most unfair","example[4]":"We live in a very unfair world.","collocation[1]":"totally unfair","example[5]":"It’s totally unfair to blame one player when the team doesn’t play well.","collocation[2]":"extremely/grossly unfair","example[6]":"The system was extremely unfair.","collocation[3]":"a little/slightly unfair","example[7]":"You’re being slightly unfair on him.","collocation[4]":"blatantly/manifestly/demonstrably unfair","example[8]":"The newspaper called the judge’s ruling ‘blatantly unfair.’","display[0]":"unfair/not fair","example[9]":"The present welfare system is grossly unfair.","example[10]":"It’s not fair that people are paying different prices for the same tickets.","definition[1]":"not fair or right according to the principles of a particular society","example[11]":"He believed it was an illegal and unjust war.","example[12]":"unjust laws","display[1]":"unequal","definition[2]":"unfair because people are treated in different ways or because some people have more power than others","example[13]":"We live in a deeply unequal society.","example[14]":"the unequal distribution of global resources","display[2]":"inequitable","definition[3]":"unfair because people are treated in different ways, or because some people have more power than others","example[15]":"inequitable tax laws","example[16]":"The system is inequitable, because it makes it possible for rich people to buy a place at university.","display[3]":"biased","definition[4]":"unfairly against or in favour of a particular group","example[17]":"biased reporting","example[18]":"There were claims that prison bosses were racially biased.","example[19]":"The policy was biased against women.","example[20]":"The trade laws are biased in favour of rich countries.","heading[0]":"treating people unfairly because of their race, sex, age etc","display[4]":"prejudiced","definition[5]":"treating someone unfairly and having an unreasonable dislike of them because of their race, sex etc, or because they are old, disabled etc","example[21]":"The media had very prejudiced attitudes towards disabled people.","example[22]":"I don’t want to sound prejudiced, but I do think women are better at this type of job.","display[5]":"racist","definition[6]":"treating someone unfairly because of their race","example[23]":"racist remarks","example[24]":"Children pick up racist attitudes from their parents.","display[6]":"sexist","definition[7]":"treating someone unfairly because of their sex","example[25]":"He had made sexist comments to several women in the office.","example[26]":"The show was about two female inspectors who had trouble with their sexist bosses.","display[7]":"ageist","definition[8]":"treating someone unfairly because of their age – used especially when old people are unfairly treated","example[27]":"Ageist attitudes result in older people being discriminated against in the workplace.","display[8]":"homophobic","definition[9]":"treating someone unfairly because they are homosexual","example[28]":"Many of his songs are homophobic.","definition[10]":"not right or fair","example[29]":"The new taxation system was widely regarded as unfair.","example[30]":"poverty wages and unfair working conditions","definition[11]":"not giving a fair opportunity to everyone","example[31]":"The current law is not equitable, since it gives an unfair advantage to pilots who belong to a union.","example[32]":"U.S. workers feel threatened by unfair competition from abroad."}