{"word[0]":"individual","definition[0]":"considered separately from other people or things in the same group","example[0]":"Each individual leaf on the tree is different.","example[1]":"the needs of the individual customer","definition[1]":"belonging to or intended for one person rather than a group","example[2]":"Children get more individual attention in small classes.","example[3]":"You can have the bathroom designed to suit your individual needs.","example[4]":"individual portions of jam","definition[2]":"an individual style, way of doing things etc is different from anyone else’s – usually used to show approval","synonym[0]":"distinctive","example[5]":"a tennis player with a highly individual style","example[6]":"a very individual way of dressing","definition[3]":"a person, considered separately from the rest of the group or society that they live in","example[7]":"the rights of the individual","example[8]":"Each individual receives two genes, one inherited from each parent.","example[9]":"Most churches were built with donations from private individuals (=ordinary people, rather than the government or companies).","definition[4]":"a person of a particular kind, especially one who is unusual in some way","example[10]":"a strange-looking individual","collocation[0]":"an ordinary individual","example[11]":"Ordinary individuals need no more than 3–5 grams of salt per day.","collocation[1]":"a talented/gifted individual","example[12]":"He had taken a group of talented individuals and built a superb team.","collocation[2]":"an outstanding individual","example[13]":"We need a few outstanding individuals to act as leaders.","collocation[3]":"a private individual","example[14]":"Few shares in the company are owned by private individuals.","collocation[4]":"a particular individual","example[15]":"The writer is addressing a general reader rather than a particular individual.","collocation[5]":"a single individual","example[16]":"Equipment of this kind is not something a single individual could afford.","collocation[6]":"a wealthy individual","example[17]":"Large ranches are often owned by corporations or wealthy individuals.","collocation[7]":"selected individuals","example[18]":"Selected individuals were invited to the dinner.","collocation[8]":"isolated individuals","example[19]":"Society does not consist of isolated individuals.","collocation[9]":"like-minded individuals","example[20]":"The message board is a forum where like-minded individuals can communicate.","collocation[10]":"treat somebody as an individual","example[21]":"Each student must be treated as an individual.","collocation[11]":"a group of individuals","example[22]":"We need to perform as a team rather than a group of individuals.","collocation[12]":"the needs of the individual","example[23]":"The fitness program is adapted to the needs of the individual.","example[24]":"The rights of the individual must be protected.","collocation[13]":"freedom of the individual","example[25]":"We live in a society which prizes the freedom of the individual.","collocation[14]":"respect for the individual","example[26]":"The policies are based on respect for the individual.","collocation[15]":"individuals vary","example[27]":"Individuals vary in their ability to adapt to change."}