{"word[0]":"phrase","definition[0]":"a group of words that have a particular meaning when used together, or which someone uses on a particular occasion","example[0]":"Who first used the phrase ‘survival of the fittest’?","example[1]":"Shakespeare’s plays are full of well-known phrases.","definition[1]":"a group of words without a finite verb, especially when they are used to form part of a sentence, such as ‘walking along the road’ and ‘a bar of soap’","definition[2]":"a short group of musical notes that is part of a longer piece","collocation[0]":"a famous/well-known phrase","example[2]":"We all hear the phrase \"greenhouse gasses\", but do you know what it really means?","collocation[1]":"a memorable phrase","example[3]":"Who was it who used that memorable phrase \"a monumental error of judgement\"?","collocation[2]":"a colourful phrase","example[4]":"His conversation is full of colourful phrases.","collocation[3]":"a well-turned phrase","example[5]":"She creates lifelike characters with a few well-turned phrases.","example[6]":"What was the phrase he used to describe her?","example[7]":"I’ve never heard of the phrase before.","example[8]":"The president often used the phrase ‘War on terror’.","definition[3]":"a fixed phrase which is used in a language and has a particular meaning","example[9]":"a colloquial expression (=an informal expression used in everyday spoken language)","example[10]":"The old-fashioned expression ‘in the family way’ means pregnant.","example[11]":"a common English expression","example[12]":"I was absolutely knackered, if you’ll pardon the expression (=used when you think someone might be offended by the words you have used).","display[0]":"idiom","definition[4]":"a group of words that has a special meaning which you cannot guess from the meanings of each separate word","example[13]":"‘Under the weather’ is an idiom which means ‘ill’.","display[1]":"cliché","definition[5]":"a phrase that is boring and no longer original because people use it a lot","example[14]":"The phrase ‘at the end of the day’ has become a real cliché.","example[15]":"There is some truth in the old cliché that time is a great healer.","display[2]":"saying/proverb","definition[6]":"a well-known phrase that gives advice about life","example[16]":"Do you know the saying ‘A problem shared is a problem halved’?","example[17]":"There is an old Chinese proverb which states ‘A journey of a thousand miles starts with a single step’.","display[3]":"slogan","definition[7]":"a short phrase that is easy to remember, especially one that is used in advertising","example[18]":"advertising slogans","example[19]":"Protesters were shouting anti-government slogans.","display[4]":"motto","definition[8]":"a phrase that expresses a person’s or organization’s beliefs and aims","example[20]":"The school motto was ‘Truth and Honour’.","definition[9]":"to express something in a particular way","example[21]":"Polly tried to think how to phrase the question.","example[22]":"Sorry, I phrased that badly.","definition[10]":"to perform music in order to produce the full effect of separate musical phrases"}