{"word[0]":"liability","definition[0]":"legal responsibility for something, especially for paying money that is owed, or for damage or injury","example[0]":"Tenants have legal liability for any damage they cause.","note[0]":"liability for","example[1]":"your liability to capital gains tax","note[1]":"liability to","example[2]":"The court ruled there was no liability to pay any refund.","note[2]":"liability to do something","definition[1]":"someone or something that is likely to cause problems for someone","example[3]":"A kid like Tom would be a liability in any classroom.","example[4]":"The outspoken minister has become a liability to the government.","form[0]":"ADJECTIVES/NOUN + liability","collocation[0]":"full liability","example[5]":"The driver of the other car accepted full liability for the accident.","collocation[1]":"limited liability","example[6]":"Limited liability encourages managers to take more risks with shareholder funds than they would otherwise.","collocation[2]":"unlimited liability","example[7]":"Under the agreement, the insurance company has unlimited liability.","collocation[3]":"legal liability","example[8]":"What is the legal liability of an employer in the event of an accident at work?","collocation[4]":"criminal liability","example[9]":"A child under the age of ten cannot face criminal liability for its acts.","collocation[5]":"civil liability","example[10]":"A company operating a ship which spills oil into the sea will face civil liability.","collocation[6]":"tax liability","example[11]":"The government is planning to increase the tax liability on company cars.","collocation[7]":"personal liability","example[12]":"Directors can incur personal liability for errors made by their companies.","collocation[8]":"have liability","example[13]":"The parents of these children may have some liability.","collocation[9]":"accept/admit liability","example[14]":"The company accepts no liability for any loss, inconvenience, or delay caused by a cancellation of train services.","collocation[10]":"assume liability","example[15]":"You would then assume the tax liability for the account.","collocation[11]":"incur liability","example[16]":"The transfer of property will not incur a liability to inheritance tax.","collocation[12]":"deny liability","example[17]":"The defendants continued to deny liability for Peck's death.","collocation[13]":"escape/avoid liability","example[18]":"The defendant escaped liability by proving that he had taken all possible measures to avoid the accident.","form[1]":"liability + NOUN","collocation[14]":"a liability claim","example[19]":"A liability claim was made by a consumer injured by the product.","collocation[15]":"liability insurance/cover","example[20]":"Many house and contents insurance policies have provision for liability insurance for claims of negligence against you.","plural[0]":"liabilities","definition[2]":"an amount of money owed by a business to a supplier, lender etc","example[21]":"In its bankruptcy filing, the company listed liabilities of $363.7 million and assets of $141.3 million.","example[22]":"The business has a liability as it owes money to the mortgage provider.","definition[3]":"the responsibility that a person or organization has for loss, damage, or injury caused to others, or for payment of debts","example[23]":"The new law would double airlines’ liability for lost luggage to $2,500.","example[24]":"The company admitted liability for its negligence from the start.","example[25]":"The firm has denied liability, and isn’t discussing settlement terms."}