{"word[0]":"confusion","definition[0]":"when you do not understand what is happening or what something means because it is not clear","example[0]":"The diversion led to considerable confusion.","note[0]":"create/lead to confusion","example[1]":"There was some confusion as to whether we had won or lost.","note[1]":"confusion about/over/as to","definition[1]":"a situation in which someone wrongly thinks that a person or thing is someone or something else","example[2]":"To avoid confusion, the teams wore different colours.","example[3]":"There is a confusion in the public mind between psychology and psychiatry.","note[2]":"confusion between","definition[2]":"a feeling of not being able to think clearly about what you should say or do, especially in an embarrassing situation","example[4]":"His confusion at meeting her there was quite apparent.","example[5]":"Matt stared at her in confusion.","note[3]":"in confusion","definition[3]":"a very confusing situation, that usually has a lot of noise and action, so that it is difficult for someone to understand it or control it","synonym[0]":"chaos","example[6]":"a scene of indescribable confusion","example[7]":"There was a confusion of shouts and orders as the ship prepared to depart.","note[4]":"confusion of","collocation[0]":"cause/create confusion","example[8]":"English spelling often causes confusion for learners.","collocation[1]":"lead to/result in confusion","example[9]":"The differing instructions led to confusion.","collocation[2]":"add to the confusion","example[10]":"There were a lot of rumours, which added to the confusion.","collocation[3]":"throw/plunge somebody into confusion","example[11]":"The unexpected news threw us all into confusion.","collocation[4]":"clear up the confusion","example[12]":"The chairman said that he would try to clear up the confusion.","collocation[5]":"confusion arises","example[13]":"The confusion arose because of a complete misunderstanding.","collocation[6]":"great confusion","example[14]":"We looked at each other in great confusion.","collocation[7]":"complete/total/utter confusion","example[15]":"Candy's eyes showed her total confusion.","collocation[8]":"considerable confusion","example[16]":"The movie jumps backwards and forwards in time, which causes considerable confusion.","collocation[9]":"general confusion","example[17]":"There was general confusion about the effects of the new law.","collocation[10]":"mental confusion","example[18]":"Mental confusion is one of the symptoms of the disease.","collocation[11]":"a state of confusion","example[19]":"People were in a state of confusion and close to panic.","collocation[12]":"(in order) to avoid confusion","example[20]":"Doctors should explain their instructions to patients carefully, to avoid any confusion."}