{"word[0]":"account","signpost[0]":"description","definition[0]":"a written or spoken description that says what happens in an event or process","example[0]":"Chomsky’s account of how children learn their first language","example[1]":"a blow-by-blow account of how England lost to Portugal","note[0]":"blow-by-blow account","example[2]":"Eye-witness accounts told of the unprovoked shooting of civilians.","note[1]":"eye-witness/first-hand account","example[3]":"This gives a first-hand account of the war.","example[4]":"He was too shocked to give an account of what had happened.","note[2]":"account of","signpost[1]":"at a bank","definition[1]":"an arrangement in which a bank keeps your money safe so that you can pay more in or take money out","example[5]":"My salary is paid into my bank account.","example[6]":"I’ve opened an account with Barclay’s Bank.","example[7]":"My husband and I have a joint account (=one that is shared between two people).","signpost[2]":"with a shop/company","definition[2]":"an arrangement that you have with a shop or company, which allows you to buy goods or use a service now and pay for them later","synonym[0]":"credit account","example[8]":"Can you charge this to my account please?","example[9]":"an unlimited-use Internet account","signpost[3]":"bill","definition[3]":"a statement that shows how much money you owe for things you have bought from a shop","example[10]":"James left the restaurant, settling his account by credit card.","note[3]":"pay/settle your account","signpost[4]":"arrangement to sell goods","definition[4]":"an arrangement to sell goods and services to another company over a period of time","example[11]":"Our sales manager has secured several big accounts recently.","collocation[0]":"give an account","example[12]":"Marshall gave the police his account of how the fight started.","collocation[1]":"provide an account","example[13]":"Freud has provided an account of the human psyche’s stages of development.","collocation[2]":"write an account","example[14]":"He later wrote an account of his experiences during the war.","collocation[3]":"read an account","example[15]":"Have you read his account of the journey?","form[0]":"ADJECTIVES/NOUN + account","collocation[4]":"a detailed account","example[16]":"She gave me a detailed account of what happened at the meeting.","collocation[5]":"a full account","example[17]":"It is not possible to give a full account of what we discussed.","collocation[6]":"a short account","example[18]":"What follows is a short account of the legal procedure.","collocation[7]":"a brief account","example[19]":"The class were asked to write a brief account of their holidays.","collocation[8]":"a clear account","example[20]":"I’ve tried to write a clear account of the incident.","collocation[9]":"an accurate account","example[21]":"Both newspapers gave fairly accurate accounts of what had happened.","collocation[10]":"a true account","example[22]":"The book is a true account of his life and death.","collocation[11]":"a blow-by-blow account","example[23]":"Rosemary gave me a blow-by-blow account of their trip.","collocation[12]":"a graphic account","example[24]":"He wrote a graphic account of his time in jail.","collocation[13]":"a vivid account","example[25]":"I read a vivid account of his experiences in Egypt.","collocation[14]":"an eye-witness account","example[26]":"an eye-witness account of the attack","collocation[15]":"a first-hand account","example[27]":"a first-hand account of life in the refugee camps","collocation[16]":"conflicting accounts","example[28]":"There were conflicting accounts of what actually happened.","example[29]":"He provided the police with a detailed account of what he saw.","definition[5]":"something you say or write that gives details about what something or someone is like","example[30]":"The report gave a brief description of the problem.","display[0]":"story","definition[6]":"an account of something that has happened which may not be true – used especially when people are telling each other about something","example[31]":"I don’t think he was honest enough to tell us the full story.","example[32]":"Her parents did not believe her story.","display[1]":"report","definition[7]":"a written or spoken account of a situation or event, giving people the information they need, especially after studying something as part of your job","example[33]":"The UN will issue a report on the incident.","example[34]":"Initial police reports suggest she was murdered.","display[2]":"version","definition[8]":"a particular person’s account of an event, which is different from the account that another person gives","example[35]":"Her version of events has been contradicted by other witnesses.","definition[9]":"an arrangement between a bank and a customer that allows the customer to pay in and take out money; BANK ACCOUNT","example[36]":"She used her first pay check to open an account (=to start one).","example[37]":"80% of people have held an account (=had one) with the same bank for five years or more.","example[38]":"They were unhappy with service at the bank and closed their account there.","definition[10]":"words written on a cheque to show that the account to which it relates has been closed","definition[11]":"a record showing a particular part of the finances of a business","definition[12]":"the complete set of records showing money coming into and going out of a business, its profits, and its financial situation","example[39]":"The new accounts contain more bad news for shareholders.","definition[13]":"the department of a company that deals with its accounts","example[40]":"She works in accounts.","definition[14]":"an arrangement between a buyer and a seller for payment to be made some time after the buyer receives the goods or services","example[41]":"No interest is charged provided the account is settled (=the money owed is paid) in full every month.","example[42]":"All clients are sent a monthly account statement (=list of goods or services bought and money owed).","definition[15]":"paid as part of the total amount that needs to be paid","example[43]":"We’ll pay you half of your fee on account.","definition[16]":"to be paid for later","example[44]":"Most of this equipment was bought on account.","definition[17]":"an organization that is a regular client of a company, especially an ADVERTISING AGENCY","example[45]":"The agency won several major accounts this year.","example[46]":"He’s always on the road calling on key accounts (=important clients)."}