{"word[0]":"match","definition[0]":"an organized sports event between two teams or people","note[0]":"cricket/football/tennis etc match","example[0]":"It’s our last match of the season.","example[1]":"They’re preparing for a big (=important) match tomorrow.","example[2]":"McClaire’s goal earned him the title of man of the match (=the person in a team who plays best).","example[3]":"Good teams win their home matches.","note[1]":"home/away match","example[4]":"the match between Nigeria and Ireland","note[2]":"match against/between/with","definition[1]":"a small wooden or paper stick with a special substance at the top, that you use to light a fire, cigarette etc","example[5]":"a box of matches","example[6]":"Don’t let your children play with matches.","example[7]":"I tore up the letter and put a match to it  (=made it burn, using a match).","example[8]":"Peg struck a match and lit the candle.","note[3]":"strike/light a match","signpost[0]":"colours/patterns","definition[2]":"something that is the same colour or pattern as something else, or looks attractive with it","example[9]":"That shirt’s a perfect match for your blue skirt.","note[4]":"match for","signpost[1]":"good opponent","definition[3]":"someone who is much stronger, cleverer etc than their opponent","example[10]":"Carlos was no match for the champion.","example[11]":"This time you’ve met your match, Adam Burns! I’m not giving up without a fight!","example[12]":"Guerrilla tactics proved more than a match for the Soviet military machine.","signpost[2]":"marriage","definition[4]":"a marriage or two people who are married","note[5]":"a match made in heaven (=a marriage of two people who are exactly right for each other)","example[13]":"They’re a perfect match.","example[14]":"Claire made a good match (=married someone suitable).","signpost[3]":"suitability","definition[5]":"a situation in which something is suitable for something else, so that the two things work together successfully","example[15]":"We need to establish a match between students’ needs and teaching methods.","note[6]":"match between","collocation[0]":"go to a match","example[16]":"I love going to football matches.","collocation[1]":"watch a match","example[17]":"I watched the match on TV.","collocation[2]":"play a match","example[18]":"We played the match in heavy rain.","collocation[3]":"lose a match","example[19]":"They lost the match, despite playing very well.","collocation[4]":"win a match","example[20]":"Do you think we'll win our next match?","collocation[5]":"draw a match","example[21]":"United have drawn their last two matches.","collocation[6]":"have a match","example[22]":"Do we have a match on Sunday?","collocation[7]":"postpone a match","example[23]":"Our first match was postponed because of bad weather.","collocation[8]":"miss a match","example[24]":"He missed two matches because of an ankle injury.","collocation[9]":"level the match","example[25]":"Woods won the last two holes to level the match.","collocation[10]":"clinch the match","example[26]":"Ronaldo clinched the match with a brilliant goal.","collocation[11]":"referee a match","example[27]":"The matches are refereed by the children's parents.","collocation[12]":"a match kicks off","example[28]":"The match kicks off at 3.30 pm.","form[0]":"ADJECTIVES/NOUN + match","collocation[13]":"great/brilliant","example[29]":"We're sure it's going to be another great match.","collocation[14]":"exciting","example[30]":"The match could not have been more exciting.","collocation[15]":"thrilling","example[31]":"There were some thrilling matches at Wimbledon this year.","example[32]":"At this stage of the competition, every match is tough.","example[33]":"Germany won the match, although it was close.","collocation[16]":"an important/crucial match","example[34]":"Luckily, all their players are fit for such an important match.","collocation[17]":"a big match","example[35]":"Are you going to watch the big match on TV?","collocation[18]":"a football/rugby/tennis etc match","example[36]":"There was a rugby match going on on the school field.","collocation[19]":"a home match","example[37]":"They have won their last five home matches.","collocation[20]":"an away match","example[38]":"This is their last away match of the season.","collocation[21]":"a live match","example[39]":"There is a live match on TV every Wednesday evening.","collocation[22]":"a friendly match","example[40]":"Fitness is still important in friendly matches.","collocation[23]":"a qualifying match","example[41]":"They won all their qualifying matches.","collocation[24]":"a semi-final match","example[42]":"Spain beat Russia in their semi-final match last night.","form[1]":"phrase","collocation[25]":"man of the match","example[43]":"Henri was named man of the match.","signpost[4]":"look good together","definition[6]":"if one thing matches another, or if two things match, they look attractive together because they are a similar colour, pattern etc","example[44]":"We painted the cabinets green to match the rug.","example[45]":"Do you think this outfit matches?","example[46]":"a beech dining table with four chairs to match  (=chairs that match it)","example[47]":"Her bag matched her shoes","bad_example[0]":"Her bag matched with her shoes","bad_example[1]":"Her bag matched to her shoes","signpost[5]":"look the same","definition[7]":"two things that match look the same because they are a pair","example[48]":"Your socks don’t match.","signpost[6]":"seem the same","definition[8]":"if two things match, or if one matches the other, there is no important difference between them","example[49]":"The suspect matched the descriptions provided by witnesses.","example[50]":"Their actions do not match their words.","example[51]":"The copy closely matches the original.","note[7]":"match exactly/closely/perfectly","definition[9]":"to be suitable for a particular person, thing, or situation","synonym[0]":"suit","example[52]":"Teaching materials should match individual students’ needs.","example[53]":"We’ll help you find a home that will match your requirements.","example[54]":"a well-matched pair","note[8]":"well-matched/ill-matched","definition[10]":"to put two people or things together that are similar to or somehow connected with each other","example[55]":"Can you name the animals and match them to the correct countries?","note[9]":"match something to/with somebody/something","example[56]":"All checked-in baggage must be matched with a passenger travelling on the aircraft.","signpost[7]":"be equal","definition[11]":"to be equal to something in value, size, or quality","example[57]":"His strength is matched by his intelligence.","example[58]":"Few cities in Europe can match the cultural richness of Berlin.","example[59]":"Fancy designer labels tend to come with fancy price tags to match.","example[60]":"The two candidates are fairly evenly matched.","note[10]":"evenly/equally matched","signpost[8]":"make equal","definition[12]":"to make something equal to something else","example[61]":"Lindsey matched her steps to those of the other girl as they walked.","note[11]":"match something to something","example[62]":"an attempt to match financial resources to need","signpost[9]":"give money","definition[13]":"to give a sum of money that is equal to a sum given by someone else","example[63]":"The government has promised to match any private donations to the earthquake fund.","definition[14]":"if you are matched against someone else in a game or competition, you are competing against them","example[64]":"Federer was matched against Nadal in the final.","note[12]":"be matched against/with somebody","explanation[0]":"Match is usually passive in this meaning","definition[15]":"if something matches something else, they look good together because they are very similar in colour or style","example[65]":"a black suit with a handbag and shoes to match","example[66]":"The earrings matched her eyes.","display[0]":"go with something","definition[16]":"to look good with something else – Go with is very common in everyday English","example[67]":"Do you think that blue wallpaper will go with the carpet?","display[1]":"go together","definition[17]":"if two things go together, they look good when they are worn or seen with each other. Go together is very common in everyday English","example[68]":"That jacket and skirt don’t really go together.","example[69]":"The blue and the yellow go together well.","display[2]":"complement","definition[18]":"if a piece of clothing or a colour  complements  something, it makes it look more attractive","example[70]":"A simple string of pearls will complement any outfit.","display[3]":"well coordinated/perfectly coordinated","definition[19]":"if clothes, decorations etc are well or perfectly coordinated, they look good together because they have similar colours and styles","example[71]":"Her outfits are always perfectly coordinated."}