{"word[0]":"level","definition[0]":"the amount or degree of something, compared to another amount or degree","example[0]":"Inflation fell to its lowest level in 30 years.","example[1]":"Increased supplies are needed to meet the level of demand.","note[0]":"level of","example[2]":"Dolphins show a high level of intelligence.","signpost[0]":"standard","definition[1]":"a particular standard of skill or ability, for example in education or sport","example[3]":"Few athletes can compete at international level.","note[1]":"beginner/advanced/national etc level","example[4]":"an advanced-level coursebook","example[5]":"Students at this level may have problems with basic grammar.","note[2]":"at ... level","example[6]":"What level do you think you’re at?","signpost[1]":"height","definition[2]":"the height of something in relation to the ground or to another object","example[7]":"Skirts this year are just above knee level.","note[3]":"eye/knee/shoulder etc level","example[8]":"Check the water level in the car radiator.","note[4]":"water/oil etc level","example[9]":"Your arms should be at the same level as your desk.","signpost[2]":"floor/ground","definition[3]":"a floor or area of ground that is at a particular height, especially when you can go up or down to other floors or areas","example[10]":"Didn’t we park the car on Level 2?","note[5]":"on ... level","example[11]":"The town is built on different levels.","example[12]":"The medical center is on one level  (=so that you do not have to go up or down).","signpost[3]":"rank of job","definition[4]":"a particular position in a system that has different ranks of importance","example[13]":"Further talks at ministerial level were held.","note[6]":"at board/management/senior etc level","example[14]":"Training is offered at each level in the department.","signpost[4]":"way of understanding","definition[5]":"a way of considering or understanding something","example[15]":"I agree with you, but only on a theoretical level.","note[7]":"on a personal/practical/superficial etc level","example[16]":"The story can be understood on many different levels.","definition[6]":"a tool used for checking that a surface is flat","synonym[0]":"spirit-level","form[0]":"ADJECTIVES/NOUN + level","example[17]":"The level of salt in his diet was too high.","example[18]":"The level of violent crime is lower than ten years ago.","collocation[0]":"a record level","example[19]":"Sales have reached record levels.","collocation[1]":"noise/pollution levels","example[20]":"Noise levels are unacceptably high.","collocation[2]":"price/income/wage levels","example[21]":"Wage levels had failed to keep up with inflation.","collocation[3]":"stress level","example[22]":"I find exercise helps with my stress levels.","collocation[4]":"energy/fitness level","example[23]":"Her fitness level is better than that of most 20-year-olds.","collocation[5]":"a level rises/goes up/increases","example[24]":"The level of unemployment has increased.","collocation[6]":"a level falls/goes down/decreases","example[25]":"Pollution levels have fallen slightly.","collocation[7]":"achieve/reach a level","example[26]":"China’s imports of wheat reached record levels.","collocation[8]":"remain/stay at a level","example[27]":"The fees are likely to remain at current levels.","collocation[9]":"maintain a level","example[28]":"It's difficult to maintain the same level of physical fitness.","collocation[10]":"increase a level","example[29]":"Healthy eating can increase your energy level.","collocation[11]":"reduce a level","example[30]":"He made an effort to reduce his stress levels.","definition[7]":"flat and not sloping in any direction","example[31]":"The floors in the old house were not completely level.","example[32]":"a level surface suitable for wheelchairs","definition[8]":"two things that are level are at the same height as each other","example[33]":"The curtains aren’t quite level.","example[34]":"Your eyes should be level with the top of the screen.","note[8]":"level with","definition[9]":"two sports teams, competitors etc that are level have the same number of points","example[35]":"They finished level, with ten points each.","example[36]":"Before the weekend, Madrid was level with Barcelona.","definition[10]":"having the same value or position as something or someone else","example[37]":"He cycled along beside her, keeping level.","example[38]":"Borrowing rates rose to over 8%, roughly level with those in America.","definition[11]":"to make something flat and smooth","example[39]":"Workers leveled the wet concrete with a piece of wood.","example[40]":"Cover with a layer of sand and level it off.","definition[12]":"to knock down or destroy a building or area completely","example[41]":"Bombs levelled a large part of the town.","definition[13]":"to make the score in a game or competition equal","example[42]":"He slipped the ball into the net to level the score at 1–1.","example[43]":"United went ahead but the visitors levelled in the 73rd minute.","definition[14]":"the measured amount of something that exists at a particular time or in a particular place","example[44]":"The longer poor performance continues, the more comfortable employees become with their lower level of productivity.","definition[15]":"all the people or jobs within an organization, industry etc that have similar importance and responsibility","example[45]":"Due to the importance of the issue, negotiations will have to be held at a more senior level.","example[46]":"We need to recruit more employees at the management level."}