{"word[0]":"emphasis","plural[0]":"emphases","definition[0]":"special attention or importance","example[0]":"a change of emphasis in government policy","example[1]":"The course places emphasis on practical work.","note[0]":"put/place emphasis on something","example[2]":"In Japan there is a lot of emphasis on politeness.","note[1]":"emphasis on","definition[1]":"special importance that is given to a word or phrase by saying it louder or higher, or by printing it in a special way","example[3]":"‘And I can assure you, ’ she said with emphasis, ‘that he is innocent.’","example[4]":"The emphasis should be on the first syllable.","collocation[0]":"put emphasis on something","example[5]":"We need to put greater emphasis on planning.","example[6]":"The airline is accused of placing more emphasis on profit than on safety.","collocation[1]":"place/lay emphasis on something","example[7]":"The coach has placed the emphasis firmly on youth by including three teenagers in the team.","collocation[2]":"give emphasis to something","example[8]":"Since league tables were introduced, schools have given even greater emphasis to exam results.","collocation[3]":"shift the emphasis","example[9]":"With drug addicts, we need to shift the emphasis from punishment to treatment.","collocation[4]":"add emphasis","example[10]":"Put bullet points before each statement to add emphasis.","collocation[5]":"the emphasis shifts/moves","example[11]":"The emphasis is now shifting away from oil towards renewable sources of energy.","collocation[6]":"great emphasis","example[12]":"The company places great emphasis on customer care.","collocation[7]":"a strong/heavy emphasis","example[13]":"There is a strong emphasis on research in the university.","collocation[8]":"the main emphasis","example[14]":"The main emphasis must be on quality, not quantity.","collocation[9]":"particular/special emphasis","example[15]":"The new legislation places particular emphasis on energy conservation.","collocation[10]":"increased/increasing emphasis","example[16]":"Recently, there has been an increasing emphasis on creating more jobs.","collocation[11]":"considerable emphasis","example[17]":"Most religions put considerable emphasis on the importance of marriage.","collocation[12]":"a change of emphasis","example[18]":"There has been a change of emphasis in the government’s foreign policy."}