{"word[0]":"procedure","definition[0]":"a way of doing something, especially the correct or usual way","example[0]":"On board, we were given the usual talk on safety procedures (=what to do if an accident happens, or to prevent an accident).","example[1]":"This is standard procedure for getting rid of toxic waste.","note[0]":"correct/proper/normal etc procedure","example[2]":"All schools have disciplinary procedures they must follow.","note[1]":"legal/court/parliamentary etc procedures","example[3]":"What’s the procedure for applying for a visa?","note[2]":"procedure for","definition[1]":"a medical treatment or operation","example[4]":"Liposuction is a minor surgical procedure.","form[0]":"ADJECTIVES/NOUN + procedure","collocation[0]":"the correct/proper procedure","example[5]":"What's the correct procedure for applying for a grant?","collocation[1]":"normal/standard procedure","example[6]":"It’s standard procedure to take photographs of the scene of the crime.","collocation[2]":"a legal procedure","example[7]":"Adoption was not made a legal procedure until 1926.","collocation[3]":"a disciplinary procedure","example[8]":"Unacceptable behaviour will be dealt with through our usual disciplinary procedures.","collocation[4]":"a complaints procedure","example[9]":"The company has a standard complaints procedure.","collocation[5]":"a selection procedure","example[10]":"An interview is an important part of our selection procedure.","collocation[6]":"a safety procedure","example[11]":"Apparently the accidents were due to inadequate safety procedures.","collocation[7]":"follow a procedure","example[12]":"It’s important that you always follow the correct procedure.","collocation[8]":"go through a procedure","example[13]":"We had to go through the whole procedure again.","definition[2]":"the official or accepted way of doing something, especially something that is done often","example[14]":"We have hired an accounting firm to evaluate our audit procedures.","example[15]":"a lapse in procedure (=an occasion when the normal procedure is not followed)","example[16]":"The police complaints procedure provides a formal mechanism for citizens to lodge complaints about instances of police misconduct.","example[17]":"The bank must review its procedure for maintaining adequate loan-loss reserves."}