{"word[0]":"yield","definition[0]":"to produce a result, answer, or piece of information","example[0]":"Our research has only recently begun to yield important results.","signpost[0]":"crops/profits","definition[1]":"to produce crops, profits etc","example[1]":"Each of these oilfields could yield billions of barrels of oil.","example[2]":"The tourist industry yielded an estimated $2.25 billion for the state last year.","example[3]":"These investments should yield a reasonable return.","example[4]":"high-yielding crops","note[0]":"high-yielding/low-yielding","explanation[0]":"In everyday English, people usually say that something produces a result, a profit etc rather than yields it:","example[5]":"Each cow produces almost 20 litres of milk a day.","signpost[1]":"agree unwillingly","definition[2]":"to allow yourself to be forced or persuaded to do something or stop having something","example[6]":"The military has promised to yield power.","example[7]":"Further action may be necessary if the leaders do not yield to diplomatic pressure.","example[8]":"Finally she yielded to temptation and helped herself to a large slice of cake.","example[9]":"The hijackers refuse to yield to demands to release the passengers.","note[1]":"yield to","explanation[1]":"In everyday English, people usually say someone gives in to pressures, demands etc rather than yields to them:","example[10]":"I very much doubt the boss will give in to her demands.","signpost[2]":"traffic","definition[3]":"to allow other traffic on a bigger road to go first","example[11]":"Yield to traffic on the left.","signpost[3]":"move/bend/break","definition[4]":"to move, bend, or break because of physical force or pressure","example[12]":"Ideally, the surface should yield slightly under pressure.","signpost[4]":"give up fighting","definition[5]":"to stop fighting and accept defeat","synonym[0]":"surrender","definition[6]":"the amount of profits, crops etc that something produces","example[13]":"The average milk yield per cow has doubled.","example[14]":"Shareholders are expecting a higher yield this year.","note[2]":"high/low yield","example[15]":"a yield of over six percent","note[3]":"yield of","definition[7]":"the amount of money that you get from an investment, especially bonds","example[16]":"investments with high yields","example[17]":"Many investors are buying stocks because of low yields in other securities.","definition[8]":"the amount of something that is produced, such as crops","example[18]":"Farmers who practise intensive farming are aiming for maximum yields for minimum cost.","definition[9]":"the average amount of money that an AIRLINE gets from each of its passengers for each mile that they fly or by a hotel from each of its guests for each night they stay","example[19]":"The airline’s passenger revenue yield rose from 12.8 cents to 12.95 cents.","example[20]":"Officials have said their pricing strategy, known as yield management, is merely a sophisticated approach to supply and demand.","definition[10]":"to produce income or profits","example[21]":"Mining shares often yield a high level of return.","definition[11]":"to produce a product, crop etc","example[22]":"These rice fields now yield 145,000 tons a year.","definition[12]":"to produce a result, answer, or a piece of information","example[23]":"The discussions failed to yield any useful results.","example[24]":"Writing to the agents yielded no reply."}