{"word[0]":"bargain","definition[0]":"something you buy cheaply or for less than its usual price","example[0]":"There are no bargains in the clothes shops at the moment.","example[1]":"It’s an attractive little home, and I think it’s a bargain.","example[2]":"That second-hand table was a real bargain.","example[3]":"Good watches don't come at bargain prices.","example[4]":"Bargain hunters (=people looking for things to buy at low prices) queued outside the store for hours.","definition[1]":"an agreement, made between two people or groups, to do something in return for something else","example[5]":"I’ve kept my side of the bargain and I expect you to keep yours.","example[6]":"Management and unions have struck a bargain over wage increases.","note[0]":"make/strike a bargain","collocation[0]":"a real bargain","example[7]":"In the market you can sometimes pick up a real bargain.","collocation[1]":"an absolute bargain","example[8]":"£59.99 is an absolute bargain.","collocation[2]":"a brilliant/amazing bargain","example[9]":"The house they bought was an amazing bargain.","collocation[3]":"look for/search for a bargain","example[10]":"She began looking for bargains at car boot sales.","collocation[4]":"get a bargain","example[11]":"Everyone likes to think they are getting a bargain.","collocation[5]":"find a bargain","example[12]":"Investors may be able to find some bargains this year.","collocation[6]":"pick up/snap up a bargain","example[13]":"You can often pick up a bargain at an auction.","collocation[7]":"offer a bargain","example[14]":"The Regency hotel is offering off-season bargains.","form[0]":"bargain + NOUN","collocation[8]":"a bargain price","example[15]":"In the sales you can get a fully fitted kitchen at a bargain price.","collocation[9]":"a bargain buy","example[16]":"This remains a bargain buy at £3.99.","collocation[10]":"a bargain hunter","example[17]":"Bargain hunters queued for hours before the store opened.","collocation[11]":"bargain hunting","example[18]":"They're off to do some bargain hunting at the January sales.","collocation[12]":"a bargain basement","example[19]":"Everything is reduced to clear in the bargain basement!","definition[2]":"to discuss the conditions of a sale, agreement etc, for example to try and get a lower price","example[20]":"workers bargaining for better pay","note[1]":"bargain for","example[21]":"They bargained over the level of wages.","note[2]":"bargain over","example[22]":"women bargaining with traders","note[3]":"bargain with","definition[3]":"something you buy cheaply or for less than the usual price","example[23]":"The company’s shares are a bargain at the current level.","example[24]":"He made a lot of money by buying houses at bargain prices and reselling them.","definition[4]":"an agreement between two people or groups to do something in return for something else","example[25]":"Management and unions have managed to strike a bargain whereby unions have accepted more flexible working in return for better pay.","example[26]":"Football is important to Sky TV, and the clubs will now try todrive a hard bargain (=make a bargaining agreement very much to their advantage) on future TV rights.","definition[5]":"an occasion when particular shares, bonds etc are bought or sold on a financial market. The number of bargains in a particular period of time is one measurement of the level of economic activity","example[27]":"In government securities, the number of bargains per day has averaged nearly 3,300.","definition[6]":"to discuss the conditions of a sale, agreement etc in order to get the greatest advantage for yourself"}