{"word[0]":"bribe","definition[0]":"to illegally give someone, especially a public official, money or a gift in order to persuade them to do something for you","example[0]":"The only way we could get into the country was by bribing the border officials.","example[1]":"He bribed one of the guards to smuggle out a note.","note[0]":"bribe somebody to do something","definition[1]":"to offer someone, especially a child, something special in order to persuade them to do something","example[2]":"Sam wouldn’t do her homework until I bribed her with ice cream.","note[1]":"bribe somebody with something","definition[2]":"money or a gift that you illegally give someone to persuade them to do something for you","example[3]":"The officials said that they had been offered bribes before an important game.","example[4]":"A Supreme Court judge was charged with taking bribes.","note[2]":"accept/take a bribe","definition[3]":"something special offered to someone, especially a child, in order to persuade them to do something","collocation[0]":"offer somebody a bribe","example[5]":"Some sportsmen have been offered bribes to perform badly.","example[6]":"Any officials who accept bribes will face criminal charges.","collocation[1]":"give somebody a bribe","example[7]":"They issued passports to people who gave them bribes.","collocation[2]":"pay a bribe","example[8]":"It was claimed that the company paid bribes to win the contract.","form[0]":"bribe + NOUN","collocation[3]":"bribe money","example[9]":"The mayor is accused of accepting bribe money.","definition[4]":"an amount of money or something valuable that someone gives you to persuade you to help them or do something dishonest for them","example[10]":"US citizens are forbidden by law from offering bribes to officials of foreign governments.","example[11]":"He was to be included in the investigation for allegedly accepting bribes.","definition[5]":"to dishonestly give money to someone to persuade them to do something that will help you","example[12]":"His office-equipment firm had bribed politicians to win public-works contracts."}