{"word[0]":"face","signpost[0]":"front of your head","definition[0]":"the front part of your head, where your eyes, nose, and mouth are","example[0]":"She had a beautiful face.","example[1]":"Her face was white with fear.","example[2]":"A big smile spread across his face.","example[3]":"I felt like punching him in the face.","definition[1]":"an expression on someone’s face","example[4]":"I’ll never forget my father’s face – I’d never seen him so upset before.","definition[2]":"a person","note[0]":"famous/well-known face (=someone who is famous from television, magazines, films etc)","example[5]":"Gordon is a familiar face (=someone who you know or have seen many times before) at the Shrewsbury Flower Show.","example[6]":"It’s the same old faces (=people who you see often, especially too often) at our meetings every week.","example[7]":"She looked around at the sea of faces (=lots of people seen together) in the cafeteria.","example[8]":"There are a few new faces in class this year.","note[1]":"new/different face","signpost[1]":"mountain/cliff","definition[3]":"the face of a mountain, cliff etc is a steep vertical surface or side","example[9]":"The cliff face was starting to crumble into the sea.","example[10]":"a sheer  (=very steep) rock face","example[11]":"He fell and died while attempting to climb the north face of Mont Blanc.","note[2]":"face of","signpost[2]":"clock","definition[4]":"the front part of a clock or watch, where the numbers and hands are","signpost[3]":"mine","definition[5]":"the part of a mine from which coal, stone etc is cut","signpost[4]":"outside surface","definition[6]":"one of the outside surfaces of an object or building","example[12]":"A cube has six faces.","definition[7]":"the part of a racket or bat etc that you use to hit the ball","collocation[0]":"pretty/beautiful/handsome etc","example[13]":"Her face was beautiful in the morning light.","collocation[1]":"round/oval/square","example[14]":"Her face was round and jolly.","collocation[2]":"thin/narrow","example[15]":"Tears rolled down her thin face.","collocation[3]":"pale/dark","example[16]":"His face suddenly became pale and I thought he was going to faint.","collocation[4]":"an angular face","example[17]":"She stared at his dark, angular face.","collocation[5]":"sad/serious","example[18]":"Maggie looked at him with a sad face.","collocation[6]":"happy/smiling","example[19]":"Shelley looked at the children’s happy faces.","collocation[7]":"a grinning face","example[20]":"He looked down at the boy’s grinning face.","example[21]":"Beth’s angry face stared fiercely at her husband.","collocation[8]":"worried/anxious","example[22]":"My father watched us go with a worried face.","collocation[9]":"puzzled","example[23]":"He looked at his son’s puzzled face.","collocation[10]":"blank/impassive","example[24]":"What was she really thinking behind that blank face?","collocation[11]":"wrinkled/lined","example[25]":"His wrinkled face must once have been handsome.","collocation[12]":"scowling","example[26]":"He looked around and saw his boss's scowling face behind him.","collocation[13]":"a long face","example[27]":"What’s the long face for?","collocation[14]":"somebody’s face goes/turns red","example[28]":"His face went red with embarrassment.","collocation[15]":"somebody’s face goes/turns pale","example[29]":"I saw her face go pale when he walked in.","collocation[16]":"somebody’s face lights up/brightens","example[30]":"Denise’s face lit up when she heard the news.","collocation[17]":"somebody’s face darkens","example[31]":"She handed him the letter and his face darkened.","collocation[18]":"somebody’s face falls","example[32]":"Her face fell when she saw who it was.","collocation[19]":"pull/make a face","example[33]":"Here’s a funny photo of Joe pulling a face.","collocation[20]":"somebody’s face is contorted with anger/rage","example[34]":"Eve’s face was contorted with anger as she picked up the broken vase.","collocation[21]":"a look/expression on somebody’s face","example[35]":"She had a rather surprised look on her face.","example[36]":"I could tell by the look on Dan’s face that he was disappointed.","collocation[22]":"a smile/grin/frown on somebody’s face","example[37]":"There was a mischievous grin on her face.","example[38]":"He was reading the newspaper with a frown on his face.","collocation[23]":"you can see something in somebody’s face","example[39]":"She could see the despair in his face.","collocation[24]":"something is written all over somebody’s face","example[40]":"You’re jealous – it’s written all over your face!","collocation[25]":"you should have seen somebody’s face","example[41]":"You should have seen his face when I told him that I was resigning.","collocation[26]":"a face like thunder","example[42]":"The boss had a face like thunder when he arrived this morning.","signpost[5]":"difficult situation","definition[8]":"if you face or are faced with a difficult situation, or if a difficult situation faces you, it is going to affect you and you must deal with it","example[43]":"Emergency services are facing additional problems this winter.","example[44]":"The president faces the difficult task of putting the economy back on its feet.","example[45]":"McManus is facing the biggest challenge of his career.","example[46]":"As the project comes to an end, many workers now face an uncertain future.","example[47]":"He must face the prospect of financial ruin.","example[48]":"the difficulties faced by the police","example[49]":"If he is found guilty, he faces up to 12 years in jail.","example[50]":"He was the first member of the former government to face criminal charges.","note[3]":"face charges/prosecution","example[51]":"I was faced with the awful job of breaking the news to the girl’s family.","note[4]":"be faced with something","signpost[6]":"admit a problem exists","definition[9]":"to accept that a difficult situation or problem exists, even though you would prefer to ignore it","example[52]":"Many couples refuse to face the fact that there are problems in their marriage.","example[53]":"You’ve got to face facts, Rachel. You can’t survive on a salary that low.","example[54]":"He had to face the awful truth that she no longer loved him.","example[55]":"Face it,  kid. You’re never going to be a rock star.","signpost[7]":"talk/deal with somebody","definition[10]":"to talk or deal with someone, when this is unpleasant or difficult for you","example[56]":"You’re going to have to face him sooner or later.","example[57]":"I don’t know how I’m going to face her after what happened.","example[58]":"The accident left her feeling depressed and unable to face the world (=be with people and live a normal life).","signpost[8]":"be opposite","definition[11]":"to be opposite someone or something, or to be looking or pointing in a particular direction","example[59]":"The two men stood facing each other, smiling.","example[60]":"When he turned to face her, he seemed annoyed.","example[61]":"Lunch is served on the terrace facing the sea.","example[62]":"a south-facing garden","note[5]":"south-facing/west-facing etc","example[63]":"The dining room faces east.","note[6]":"face north/east etc","signpost[9]":"opponent/team","definition[12]":"to play against an opponent or team in a game or competition","example[64]":"Martinez will face Robertson in tomorrow’s final.","collocation[27]":"face a problem","example[65]":"She told me about some of the problems she was facing.","collocation[28]":"face a difficulty","example[66]":"The hotel’s owners were facing financial difficulties.","collocation[29]":"face a challenge","example[67]":"The coal industry faces serious challenges.","collocation[30]":"face the task of doing something","example[68]":"He faced the task of preparing a three-course meal for 50 people.","collocation[31]":"face a danger","example[69]":"He has the courage to face danger in spite of fear.","collocation[32]":"face opposition","example[70]":"The government faced opposition from the Liberal Democrats.","collocation[33]":"face charges","example[71]":"He faces charges of fraud and theft.","collocation[34]":"face an uncertain/difficult future","example[72]":"The company is facing an uncertain future.","collocation[35]":"face the prospect of something","example[73]":"Many coastal cities face the prospect of disastrous flooding."}