{"word[0]":"flip","definition[0]":"to move something with a quick sudden movement so that it is in a different position","example[0]":"He flipped the top off the bottle and poured himself a drink.","example[1]":"She flipped the lid of the box open and looked inside.","example[2]":"He flipped the paper over and started writing on the back.","note[0]":"flip over","signpost[0]":"turn in the air","definition[1]":"to make a flat object such as a coin go upwards and turn over in the air","synonym[0]":"toss","example[3]":"We flipped a coin to see who would go first.","example[4]":"There’s quite an art to flipping pancakes.","definition[2]":"to suddenly become very angry or upset","synonym[1]":"lose it","example[5]":"I just flipped and started shouting.","signpost[1]":"turn a switch","definition[3]":"to move a switch so that a machine or piece of electrical equipment starts or stops","synonym[2]":"flick","example[6]":"Anna flipped the switch that opened the front gate.","example[7]":"Josie flipped on the radio.","note[1]":"flip something on/off","signpost[2]":"turn pages","definition[4]":"to turn the pages of a book or newspaper quickly, especially because you are looking for something","example[8]":"He picked up the newspaper and flipped straight to the sports pages.","example[9]":"I flipped through my address book but couldn’t find her phone number.","note[2]":"flip through","definition[5]":"to buy a house and then sell it again quickly for a profit, usually after improving it","definition[6]":"an action in which you make a flat object such as a coin go upwards and turn over in the air","example[10]":"In the end the decision was made by the flip of a coin.","definition[7]":"a movement in which you jump up and turn over in the air, so that your feet go over your head","synonym[3]":"somersault","example[11]":"I tripped and almost did a backward flip down the stairs.","definition[8]":"an action in which you turn the pages of a book or newspaper quickly, especially because you are looking for something","example[12]":"I had a quick flip through my cookery books and found a recipe that sounded quite nice.","definition[9]":"not said or meant seriously","synonym[4]":"flippant","example[13]":"I was fed up with his flip comments.","past_tense[0]":"flipped","definition[10]":"to buy shares and sell them soon after to make a quick profit","example[14]":"Some speculative accounts were flipping the stock for a profit"}