{"definition[0]":"the past participle of break","signpost[0]":"piece of equipment","definition[1]":"not working properly","example[0]":"The CD player’s broken again.","example[1]":"Do you know how the phone got broken (=became broken)?","definition[2]":"in small pieces because it has been hit, dropped etc","example[2]":"Mind the broken glass.","example[3]":"Wrap it up well so it doesn’t get broken (=become broken) in the mail.","signpost[1]":"bone","definition[3]":"cracked because you have had an accident","example[4]":"a badly broken leg","example[5]":"Gibbs had an X-ray, which revealed no broken bones.","signpost[2]":"not continuous","definition[4]":"interrupted and not continuous","example[6]":"a broken white line","example[7]":"a long noisy night of broken sleep","definition[5]":"extremely weak mentally or physically because you have suffered a lot","example[8]":"He returned from the war a broken man.","definition[6]":"if something is broken, it does not work properly","example[9]":"I think my watch is broken.","example[10]":"The camera got broken when we were on holiday.","example[11]":"The birds had gotten into the cabin through a broken window.","example[12]":"In the corner of the room were a broken chair and a rickety old desk.","display[0]":"out of order","definition[7]":"if a machine, especially one used by the public, is out of order, it is not working for a temporary period","example[13]":"Every phone I tried was out of order.","example[14]":"The toilets were all out of order.","definition[8]":"if a computer system is down, it is not working","example[15]":"The computer system was down all afternoon, so we went home.","example[16]":"The network went down at 11:00 and we lost the whole morning’s work.","display[1]":"on the blink","definition[9]":"if a piece of electrical equipment is on the blink, it sometimes works and sometimes does not","example[17]":"My TV’s on the blink again.","example[18]":"The car’s air conditioning went on the fritz just as we reached Dallas.","display[2]":"there’s something wrong with something","definition[10]":"used when saying that a car, machine etc does not work properly and you do not know why","example[19]":"There’s something wrong with my car; I think it might be the battery.","example[20]":"There was something wrong with the photocopier, so we called in the service company.","example[21]":"If the VCR has something wrong with it, take it back to the store.","display[3]":"something has had it","definition[11]":"used when saying that a car, machine etc is completely broken and cannot be repaired","example[22]":"I’m afraid the bike’s had it."}