{"signpost[0]":"persons","definition[0]":"used as the plural of ‘person’ to refer to men, women, and children","example[0]":"How many people were at the meeting?","example[1]":"At least 40 people were killed.","example[2]":"the people who live next door","definition[1]":"people in general, or people other than yourself","example[3]":"I don’t care what people think.","example[4]":"People can be really mean sometimes.","example[5]":"The hotel was full of business people.","note[0]":"theatre/business etc people","signpost[1]":"country/race","definition[2]":"the people who belong to a particular country, race, or area","example[6]":"He pledged that he would never lie to the American people.","note[1]":"the British/American etc people","example[7]":"the Basques, a people of northwestern Spain","note[2]":"people of","example[8]":"the peoples of Europe","signpost[2]":"to get attention","definition[3]":"used to get the attention of a group of people","example[9]":"Listen up, people!","explanation[0]":"People is followed by a plural verb","example[10]":"The American people are proud of their democracy","bad_example[0]":"The American people is proud of its democracy","example[11]":"Most people know that smoking causes lung cancer.","example[12]":"People are the same everywhere.","display[0]":"folk","example[13]":"Louisa's parents were country folk and believed very much in herbal remedies.","example[14]":"They looked like two ordinary folk.","example[15]":"There are still folk around here who remember the old days.","display[1]":"the public","definition[4]":"ordinary people, not people who belong to the government or are members of a particular company or organization","example[16]":"This information should be made available to the public.","display[2]":"population","definition[5]":"all the people who live in a particular area","example[17]":"The majority of the population were farmers.","example[18]":"The city has a population of 11 million.","display[3]":"the human race","definition[6]":"all the people in the world, considered as a group","example[19]":"the origins of the human race","display[4]":"mankind","definition[7]":"people in general – used especially when talking about their history or development, or how something affects their existence. Some people think that the word mankind seems to make women seem unimportant, and prefer to use humankind instead","example[20]":"Travelling into space was a great advance for mankind.","display[5]":"populace","definition[8]":"the people who live in a country – a very formal use","example[21]":"It is a country where 80% of the populace live in poverty.","definition[9]":"if a country or area is peopled by people of a particular type, they live there","synonym[0]":"inhabit","example[22]":"an island peopled by hardy sea folk","note[3]":"be peopled by/with somebody","definition[10]":"if a story or someone’s imagination is peopled by people of a particular type, it is full of them","example[23]":"Her world was peopled with imaginary friends.","explanation[1]":"People is usually passive","definition[11]":"a US magazine that contains short articles and pictures of famous people, especially people who appear on television and in films","definition[12]":"a British tabloid newspaper sold every Sunday, which is known for printing shocking articles about famous people, especially about their relationships and their sexual experiences"}