{"word[0]":"length","signpost[0]":"size","definition[0]":"the measurement of how long something is from one end to the other","example[0]":"We measured the length and width of the living room.","example[1]":"Some fish can grow to a length of four feet.","note[0]":"a length of 1 metre/2 feet etc","example[2]":"The hotel pool is 15 metres in length.","note[1]":"2 feet/10 metres etc in length","example[3]":"You’ll need several pieces of string of different lengths.","definition[1]":"the amount of time that you spend doing something or that something continues","example[4]":"He wasn’t left alone for any length of time.","note[2]":"(not) for any length of time","example[5]":"Your pension will depend on your length of employment.","note[3]":"length of","example[6]":"What’s the average length of stay in hospital?","explanation[0]":"In everyday English, people usually talk about how long something is in space or time, rather than using the noun length:","signpost[1]":"books/films etc","definition[2]":"the amount of writing in a book, or the amount of time that a film, play etc continues","example[7]":"We had to cut the length of the book by one third.","example[8]":"Films of this length  (=as long as this) are pretty unusual.","note[4]":"of this length","definition[3]":"a piece of something long and thin","note[5]":"a length of rope/pipe/wire etc","signpost[2]":"in races","definition[4]":"the measurement of a horse, boat etc from one end to the other – used when saying how far the horse, boat etc is ahead of another","example[9]":"The horse won by three lengths.","signpost[3]":"swimming","definition[5]":"the distance from one end of a swimming pool to the other","example[10]":"She does at least 20 lengths a day.","note[6]":"do/swim a length","collocation[0]":"measure the length of something","example[11]":"The children measured the length of their shadows at three different times of day.","collocation[1]":"have a length of 1 metre/2 feet etc","example[12]":"These leaves have a length of about 7 cm.","collocation[2]":"grow to/reach a length of 2 metres/8 feet etc","example[13]":"A blue whale can reach a length of 100 feet.","collocation[3]":"run the length of something","example[14]":"A long corridor ran the length of the building.","collocation[4]":"the total length","example[15]":"The total length of the completed railway line will be almost 650 kilometres.","collocation[5]":"an average length","example[16]":"These worms grow to an average length of about 1 metre.","collocation[6]":"the whole/full/entire length of something","example[17]":"The camera looks down the full length of the street.","collocation[7]":"medium length","example[18]":"All the girls had short or medium length hair.","collocation[8]":"equal/unequal length","example[19]":"She drew two lines of equal length.","collocation[9]":"a maximum/minimum length","example[20]":"This species of fish can reach a maximum length of 12 inches."}