{"word[0]":"naked","definition[0]":"not wearing any clothes or not covered by clothes","synonym[0]":"nude","note[0]":"stark naked (also buck naked/naked as a jaybird American English) (=completely naked)","example[0]":"The children ran naked through the yard.","example[1]":"a picture of a naked man","example[2]":"They found the body lying half naked in the grass.","example[3]":"The governor ordered the prisoner to be stripped naked and whipped.","explanation[0]":"In everyday English, people often say that someone has nothing on or doesn’t have anything on rather than say they are naked:","example[4]":"They ran through the yard with nothing on.","definition[1]":"weak and unable to protect yourself","example[5]":"Standing in front on his first day of teaching, Brad felt completely naked.","definition[2]":"not wearing any clothes or not covered by clothes – used especially when this seems rather shocking","example[6]":"a naked man","example[7]":"He got out of bed naked, and answered the telephone.","example[8]":"his naked chest","display[0]":"have nothing on/not have anything on","definition[3]":"to not be wearing any clothes. This phrase is very commonly used in everyday English instead of saying that someone is naked","example[9]":"Can you wait a minute? I've got nothing on!","example[10]":"The little boy didn’t have anything on when he answered the door!","definition[4]":"used about feet, legs, arms etc that are not covered by clothes","example[11]":"The sand was too hot to walk on in bare feet.","definition[5]":"naked – used especially when talking about naked people in paintings, films etc","example[12]":"a nude portrait of his wife","display[1]":"undressed","definition[6]":"not wearing any clothes, especially because you have just taken them off in order to go to bed, have a bath etc","example[13]":"Sara was undressed and ready for bed but Jenny was fully clothed.","example[14]":"Wearily she got undressed and stepped into the shower.","display[2]":"topless","definition[7]":"if a woman is topless, she is not wearing any clothes on the upper part of her body, so that her breasts are not covered","example[15]":"a topless waitress","display[3]":"in the nude","example[16]":"Men and women swam together in the nude and thought nothing of it.","display[4]":"in your birthday suit","example[17]":"He likes to sleep in his birthday suit. He says pyjamas are uncomfortable.","display[5]":"go commando","definition[8]":"to not wear any underwear","example[18]":"In summertime, he likes to go commando.","display[6]":"in the buff","definition[9]":"not wearing any clothes – a very informal use","example[19]":"a beach where you can sunbathe in the buff"}