{"word[0]":"authority","plural[0]":"authorities","signpost[0]":"power","definition[0]":"the power you have because of your official position","example[0]":"Only the president has the authority to declare war.","note[0]":"the authority to do something","example[1]":"Several countries claim authority over the islands.","note[1]":"authority over","example[2]":"I need to speak to someone in authority (=who has a position of power).","note[2]":"in authority","definition[1]":"an official organization or a government department that has the power to make decisions, and has particular responsibilities","example[3]":"the local authority","example[4]":"East Sussex Education Authority","example[5]":"the San Diego Water Authority","example[6]":"Welsh health authorities face a £13m deficit this year.","definition[2]":"someone who knows a lot about a subject and whose knowledge and opinions are greatly respected","example[7]":"Mr Li is a leading authority on Chinese food.","note[3]":"authority on","signpost[1]":"permission","definition[3]":"official permission to do something","example[8]":"The attack took place under the authority of the UN Security Council.","note[4]":"under the authority of somebody","example[9]":"No one may enter without my authority.","note[5]":"without somebody’s authority","signpost[2]":"personal quality","definition[4]":"a quality in the way you speak or behave which makes people obey you","example[10]":"Jack’s air of quiet authority","collocation[0]":"have authority","example[11]":"Teachers should have the authority to discipline their students.","example[12]":"He has no authority over us anymore.","collocation[1]":"exercise/exert your authority","example[13]":"In practice it’s very difficult for the president to exercise his authority.","example[14]":"He was one of those people who want to wield authority over others.","collocation[2]":"abuse/misuse your authority","example[15]":"The mayor was accused of abusing his authority and taking bribes.","collocation[3]":"establish/assert/impose/stamp your authority","example[16]":"The new manager was anxious to establish her authority.","example[17]":"Robertson quickly stamped his authority on the team.","example[18]":"The State Department pressed him to take bolder steps to assert his authority.","collocation[4]":"lose your authority","example[19]":"He’s worried that he is losing his authority over the party.","collocation[5]":"undermine/weaken somebody’s authority","example[20]":"I wasn’t trying to undermine your authority.","collocation[6]":"exceed/overstep your authority","example[21]":"A higher court decided that the judge had exceeded his authority.","collocation[7]":"challenge somebody’s authority","example[22]":"There had been no-one to really challenge his authority.","collocation[8]":"full/complete/total authority","example[23]":"The manager has full authority to make decisions.","collocation[9]":"absolute authority","example[24]":"In those days, the emperor had absolute authority.","collocation[10]":"parental authority","example[25]":"The younger children are more likely to resist parental authority.","collocation[11]":"governmental authority","example[26]":"Their failure undermined governmental authority.","collocation[12]":"presidential authority","example[27]":"A number of constitutional amendments have increased presidential authority.","collocation[13]":"legal authority","example[28]":"US agents have legal authority to bring criminals back from overseas.","collocation[14]":"be in a position of authority","example[29]":"I’ve never been in a position of authority before.","collocation[15]":"have an air of authority","example[30]":"The commander had an unmistakeable air of authority.","collocation[16]":"a challenge to somebody’s authority","example[31]":"The leadership saw the demonstrations as a challenge to their authority.","collocation[17]":"an authority figure","example[32]":"The teacher is an authority figure, like the parent.","definition[5]":"an official organization which controls a particular activity and checks that the rules and laws relating to it are being obeyed","example[33]":"Illinois’ metropolitan rail authority","example[34]":"the Financial Services Authority","definition[6]":"the organizations that are in charge of a particular country or area or a particular activity","example[35]":"The weak currency could force the authorities to raise interest rates.","definition[7]":"the power that a person or organization has because of their official or legal position","example[36]":"I wouldn’t have taken the job unless I had the authority to run the division.","example[37]":"The bankruptcy court lacked the authority to rule on this subject.","definition[8]":"the power given by an importer to a bank in the exporter’s country to allow the exporter to arrange a BILL OF EXCHANGE","definition[9]":"the power given by an importer to a bank in the exporter’s country to pay a BILL OF EXCHANGE"}