{"definition[0]":"the things that a person or animal does","example[0]":"It is important to reward good behaviour.","example[1]":"She complained of her boss’s inappropriate behavior towards her.","note[0]":"behaviour towards","example[2]":"the effects of alcohol on human behaviour","definition[1]":"the things that something in science normally does","example[3]":"the behaviour of human chromosomes","note[1]":"behaviour of","collocation[0]":"good/bad","example[4]":"The boys were suspended from school for bad behaviour.","example[5]":"His good behaviour did not last long.","collocation[1]":"normal/abnormal","example[6]":"They thought their son’s behaviour was perfectly normal.","example[7]":"Were there any signs of abnormal behaviour?","collocation[2]":"aggressive/violent/threatening","example[8]":"His behavior became increasingly violent.","collocation[3]":"antisocial","example[9]":"antisocial behaviour such as spitting and swearing in public","collocation[4]":"acceptable/unacceptable","example[10]":"This sort of behavior is completely unacceptable.","collocation[5]":"appropriate/inappropriate","example[11]":"Within the official school framework there are penalties for inappropriate behaviour.","collocation[6]":"human/animal behaviour","example[12]":"the scientific study of human behaviour","example[13]":"detailed observations of animal behaviour","collocation[7]":"criminal behaviour","example[14]":"There are many theories as to what causes criminal behaviour.","collocation[8]":"sexual behaviour","example[15]":"a survey of human sexual behaviour","form[0]":"behaviour + NOUN","collocation[9]":"behaviour problems","example[16]":"She teaches children with behaviour problems.","collocation[10]":"standards of behaviour","example[17]":"declining standards of behaviour among young people","example[18]":"It’s a parent’s job to instruct children in acceptable standards of behaviour.","collocation[11]":"a pattern of behaviour","example[19]":"Different patterns of behaviour exist in different cultures.","collocation[12]":"change your behaviour","example[20]":"He has no reason to change his behaviour.","collocation[13]":"influence somebody’s behaviour","example[21]":"The genes we inherit influence our behaviour.","definition[2]":"the way someone behaves","example[22]":"Chemicals added to food may be responsible for children’s bad behaviour.","example[23]":"Tatsuya apologized for his behaviour towards me.","display[0]":"conduct","definition[3]":"the way someone behaves in public or in their job – used mainly in official or legal contexts","example[24]":"Bates was arrested and charged with disorderly conduct (=noisy and violent).","example[25]":"The committee found him guilty of unsatisfactory professional conduct.","display[1]":"manner","definition[4]":"the way someone behaves when they are talking to or dealing with other people, which is shown in their expression, their voice etc","example[26]":"She had a pleasant friendly manner.","example[27]":"Suddenly his whole manner changed, and he started shouting.","example[28]":"His initial manner towards her had been rather formal.","display[2]":"demeanour","definition[5]":"the way someone looks and behaves, which shows you something about their character or feelings","example[29]":"She maintained a calm demeanour at all times.","example[30]":"Wenger’s demeanour suggested that he was not happy with the situation.","display[3]":"antics","definition[6]":"someone’s behaviour – used when you think it is silly, funny, strange, or annoying","example[31]":"The drunken antics of some English football fans has brought shame on the country.","example[32]":"The actor is becoming known for his increasingly bizarre off-screen antics.","definition[7]":"the way that someone or something acts in different situations","example[33]":"They have changed their buying behavior and are postponing major purchases.","example[34]":"The market’s crash forced money managers to rethink basic assumptions about market behaviour.","example[35]":"seminars that attempt to change attitudes and behaviors among white male managers"}