{"signpost[0]":"intention","definition[0]":"something you have decided to do","example[0]":"His plan is to get a degree in economics and then work abroad for a year.","example[1]":"Do you have any plans for the weekend?","example[2]":"There’s been a change of plan – we’re not going to Ibiza after all.","example[3]":"Your best plan would be to take a taxi.","note[0]":"the best plan","signpost[1]":"method/arrangement","definition[1]":"a set of actions for achieving something in the future, especially a set of actions that has been considered carefully and in detail","example[4]":"The chairman outlined the company’s plans for achieving a 10% growth in sales.","note[1]":"plan for","example[5]":"There are plans to turn the site of the factory into a park.","note[2]":"plan to do something","signpost[2]":"map","definition[2]":"a drawing similar to a map, showing roads, towns, and buildings","example[6]":"a street plan of London","note[3]":"plan of","signpost[3]":"drawing","definition[3]":"a drawing of a building, room, or machine as it would be seen from above, showing the shape, size, and position of the walls, windows, and doors","definition[4]":"a drawing that shows exactly how something will be arranged","example[7]":"I have to organise a seating plan for the dinner.","heading[0]":"– Meaning 1: something you have decided to do","collocation[0]":"have plans","example[8]":"I have no plans to retire yet.","collocation[1]":"change your plans","example[9]":"We had to change our plans at the last minute.","collocation[2]":"abandon/give up your plans","example[10]":"The city authorities have abandoned their plans to host the Super Bowl.","collocation[3]":"cancel your plans","example[11]":"The weather got worse, and we had to cancel our plans to have the party outdoors.","collocation[4]":"shelve a plan","example[12]":"The plan had to be shelved because of lack of money.","collocation[5]":"a change of plan","example[13]":"The day before my flight, my boss phoned and said there’d been a change of plan.","collocation[6]":"somebody’s immediate plans","example[14]":"So what are your immediate plans after graduation?","example[15]":"I think the best plan is to take the train.","heading[1]":"– Meaning 2: a set of actions for achieving something in the future, especially a set of actions that has been considered carefully and in detail","collocation[7]":"have a plan","example[16]":"Don’t worry – I have a plan.","collocation[8]":"make plans","example[17]":"Mary has been busy making plans for her wedding.","collocation[9]":"come up with a plan","example[18]":"The chairman must come up with a plan to get the club back on its feet.","collocation[10]":"devise/formulate/draw up a plan","example[19]":"He devised a daring plan to steal two million dollars.","example[20]":"The company has already drawn up plans to develop the site.","collocation[11]":"carry out a plan","example[21]":"The bombers were arrested by the security forces before they could carry out their plans.","collocation[12]":"keep to/stick to a plan","example[22]":"We’re sticking to our original plan.","collocation[13]":"abandon/scrap a plan","example[23]":"The plan was scrapped because it was too expensive.","collocation[14]":"announce/unveil a plan","example[24]":"The government unveiled its plans for a shake-up of the health system.","collocation[15]":"approve a plan","example[25]":"The plan was approved at a board meeting on 24 December.","collocation[16]":"reject a plan","example[26]":"The plan was rejected on the grounds that it would cost too much money.","collocation[17]":"outline a plan","example[27]":"They listened as he outlined his plan.","collocation[18]":"implement a plan","example[28]":"To implement its plans, the company has entered into a partnership with another software developer.","example[29]":"The plans will be shelved until an alternative access to the site can be found.","form[0]":"ADJECTIVES/NOUN + plan","collocation[19]":"ambitious","example[30]":"The plan was very ambitious, but it worked.","collocation[20]":"detailed","example[31]":"The generals drew up detailed plans for the invasion.","collocation[21]":"cunning/clever/ingenious","example[32]":"They devised a cunning plan to get back their money.","example[33]":"The gang devised a cunning plan to rob the bank.","collocation[22]":"a five-year/ten-year etc plan","example[34]":"Unesco has a 25-year plan to provide basic education to all.","collocation[23]":"a grand plan","example[35]":"Marrying the countess was all part of his grand plan.","collocation[24]":"a master plan","example[36]":"The governors came up with a master plan for saving the school.","collocation[25]":"a business plan","example[37]":"We’ve developed a business plan to take over the company.","collocation[26]":"a peace plan","example[38]":"Both sides have agreed to implement the UN peace plan.","collocation[27]":"a rescue plan","example[39]":"Which rescue plan offers the company the best prospects of survival?","collocation[28]":"an action plan","example[40]":"My accountant developed a detailed action plan with specific targets.","collocation[29]":"go according to plan","example[41]":"If everything goes according to plan, we’ll finish in January.","collocation[30]":"a plan of action","example[42]":"Ministers are discussing a plan of action to deal with the crisis.","collocation[31]":"a plan of attack","example[43]":"At this stage, you go back to the office and work on a plan of attack.","collocation[32]":"a plan of campaign","example[44]":"What we need now is a plan of campaign.","example[45]":"Leaders outlined a plan to end the fighting.","display[0]":"plot/conspiracy","definition[5]":"a secret plan to do something bad or illegal, made by a group of people","example[46]":"There was a plot to assassinate the president.","example[47]":"a terrorist conspiracy","display[1]":"scheme","definition[6]":"an official plan that is intended to help people","example[48]":"The government has introduced a new scheme to help young people find work.","display[2]":"strategy","definition[7]":"a carefully designed plan which is intended to achieve a particular purpose over a long period of time","example[49]":"the company’s business strategy","example[50]":"The government’s economic strategy has been criticized by many experts.","example[51]":"We need to develop effective strategies for combating the sale of counterfeit goods.","display[3]":"initiative","definition[8]":"a new plan for dealing with a particular problem or for achieving a particular aim","example[52]":"a peace initiative","example[53]":"a major new initiative to tackle street crime","display[4]":"policy","definition[9]":"a plan that members of a government, political party, company etc agree on, that states how they intend to deal with a particular subject or problem","example[54]":"the government’s immigration policy","example[55]":"It’s company policy to allow people to work from home.","display[5]":"programme","definition[10]":"a series of activities that a government or organization organizes, which aims to achieve something important and will continue for a long time","example[56]":"a five-year programme which will create 2,000 new jobs","example[57]":"federal programs for low-income housing","definition[11]":"to think carefully about something you want to do, and decide how and when you will do it","example[58]":"He immediately began planning his escape.","example[59]":"Talks are planned for next week.","example[60]":"The wedding was fine and everything went as planned (=happened the way it had been planned).","example[61]":"Now that you’re pregnant you’ll have to plan ahead.","note[4]":"plan ahead/plan for the future","example[62]":"Maria didn’t plan to kill Fiona. It was an accident.","definition[12]":"to intend to do something","example[63]":"The former president is planning a return to politics.","example[64]":"He said he planned to write his essay tonight.","example[65]":"When do you plan on going to Geneva?","note[5]":"plan on doing something","definition[13]":"to think about something you are going to make, and decide what it will be like","synonym[0]":"design","example[66]":"Planning a small garden is often difficult.","example[67]":"The system needs to be planned carefully.","definition[14]":"to think carefully about something you want to do in the future, and decide exactly how you will do it","example[68]":"We’ve been planning this visit for months — you can’t cancel now.","example[69]":"The whole operation went exactly as planned","example[70]":"A business mustplan ahead (=make plans for a long time in the future), making use of sales and market forecasts.","example[71]":"The company is planning a major investment programme.","example[72]":"The company plans to spend $739.9 million on capital improvements next year.","definition[15]":"a set of actions for achieving something in the future, especially one that has been considered carefully and in detail","example[73]":"the government’s five-year economic plan","example[74]":"The two companies had considered merging some years earlier, but the plan fell through (=the plan was not completed).","example[75]":"If everything goes according to plan (=happens in the way that was arranged), the first stage of the project will be completed by December.","example[76]":"The company’s plans for growth are threatened by their inability to find, keep, and manage key staff.","example[77]":"The President is working on a plan to turn around the economy  (=make the economy successful again).","definition[16]":"your second plan, which you will use if things do not happen as you expect","example[78]":"Always have a plan B in case your original choice of career does not work out.","definition[17]":"something you have decided to do or achieve","example[79]":"What are your career plans?","example[80]":"There’s been a change of plan. The meeting’s on Monday instead of this afternoon.","example[81]":"The developer has plans for 625 homes  (=intends to build 625 homes) northwest of the airport.","definition[18]":"a drawing of a building, room, or machine as it would be seen from above, showing the shape, measurements, position of the walls etc","example[82]":"a floor-by-floor plan of the three-storey building."}