{"word[0]":"lose","past_tense[0]":"lost","signpost[0]":"stop having attitude/quality etc","definition[0]":"to stop having a particular attitude, quality, ability etc, or to gradually have less of it","example[0]":"I’ve lost my appetite.","example[1]":"By the time the ambulance arrived, Douglas had lost consciousness.","example[2]":"The business community has lost confidence in the government.","note[0]":"lose confidence/interest/hope etc","example[3]":"Carol lost interest in ballet in her teens.","example[4]":"Try not to lose heart (=become sad and hopeless) – there are plenty of other jobs.","example[5]":"A settlement was reached in which neither side lost face.","note[1]":"lose face","example[6]":"You’re looking slim. Have you lost weight?","note[2]":"lose weight/height/speed etc","example[7]":"The plane emptied its fuel tanks as it started losing altitude.","example[8]":"Mr Eyer may lose the sight in one eye.","note[3]":"lose your sight/hearing/voice/balance etc","example[9]":"The tour was postponed when the lead singer lost his voice.","example[10]":"Julian lost his balance and fell.","example[11]":"This latest movie proves Altman is by no means losing his touch.","note[4]":"lose your touch","example[12]":"When he was writing, he lost all sense of time.","note[5]":"lose all sense of time/direction/proportion etc","example[13]":"We must never lose sight of the fact that man must work in harmony with nature.","note[6]":"lose sight of something","signpost[1]":"not win","definition[1]":"to not win a game, argument, election, war etc","opposite[0]":"win","example[14]":"They played so badly they deserved to lose.","example[15]":"Klinger lost his seat in the election.","example[16]":"Arkansas just lost three games in a row.","example[17]":"He just can’t bear to lose an argument.","example[18]":"Freddie died in 1982 after losing his battle against AIDS.","example[19]":"The government lost by one vote.","note[7]":"lose (something) by 1 goal/10 votes/20 points etc","example[20]":"The Communist candidate lost by a whisker (=a very small amount).","example[21]":"The Beavers have dropped only one game since losing to Oregon in January.","note[8]":"lose to","example[22]":"It was a rash decision, and it lost him the race  (=caused him to lose the race).","note[9]":"lose somebody something","signpost[2]":"cannot find something","definition[2]":"to become unable to find someone or something","example[23]":"I’ve lost the tickets for tonight’s show.","example[24]":"I followed her on foot, but lost her in the crowd.","example[25]":"It was thought the manuscript had been lost forever.","example[26]":"The parcel must have got lost in the post.","note[10]":"be/get lost in the post","example[27]":"He lost track of her after her family moved away.","note[11]":"lose track of something/somebody","example[28]":"Don’t try to walk in a heavy snowstorm as you may lose sight of your vehicle.","note[12]":"lose sight of something/somebody","signpost[3]":"stop having something","definition[3]":"if you lose something that is important or necessary, you then no longer have it, especially because it has been taken from you or destroyed","example[29]":"David’s very upset about losing his job.","example[30]":"Hundreds of people lost their homes in the floods.","example[31]":"My family lost everything in the war.","example[32]":"He was over the limit and will lose his licence.","example[33]":"Ninety naval aircraft were lost and thirty damaged.","example[34]":"He’s lost a lot of blood but his life is not in danger.","example[35]":"If you hesitate, you may lose the opportunity to compete altogether.","note[13]":"lose a chance/opportunity","example[36]":"He lost his leg in a motorcycle accident.","note[14]":"lose an arm/leg/eye etc","example[37]":"We were losing customers to cheaper rivals.","note[15]":"lose something to somebody/something","example[38]":"She was about to lose her husband to a younger woman.","example[39]":"California has lost 90% of its wetlands to development.","example[40]":"the mistakes which lost him his kingdom  (=caused him to lose his kingdom)","signpost[4]":"death","example[41]":"a memorial to honor those who lost their lives in the war","definition[4]":"if you lose a relative or friend, they die – use this when you want to avoid saying the word ‘die’","example[42]":"One woman in Brooklyn lost a husband and two sons in the gang wars.","example[43]":"Sadly, Anna lost the baby (=her baby died before it was born).","example[44]":"Peter was lost at sea when his ship sank.","example[45]":"He lost his father to cancer  (=his father died of cancer) last year.","note[16]":"lose somebody to cancer/AIDS etc","definition[5]":"if you lose money, you then have less money than you had before","example[46]":"Creditors and investors stand to lose (=risk losing) vast sums after the company’s collapse.","example[47]":"A lot of people lost their shirts (=lost a lot of money) on Ferraris in the eighties.","example[48]":"It’s a great deal – we can’t lose!","example[49]":"The company is in debt after losing an estimated $30 million on its dotcom enterprise.","note[17]":"lose on","example[50]":"The stock market crash lost the banks £70 million  (=caused them to lose £70 million).","definition[6]":"if you lose time, you do not make progress as quickly as you want to or should","example[51]":"Come on, there’s no time to lose (=do not waste time).","example[52]":"Vital minutes were lost because the ambulance took half an hour to arrive.","note[18]":"lose time/2 days/3 hours etc","example[53]":"In 1978,29 million days were lost in industrial action.","example[54]":"Murdock lost no time in taking out a patent for his invention.","note[19]":"lose no time in doing something","definition[7]":"if a watch, clock etc loses time, it runs too slowly and shows an earlier time than it should","definition[8]":"if you lose someone who is chasing you, you manage to escape from them","example[55]":"There’s a better chance of losing him if we take the back route.","signpost[5]":"confuse somebody","definition[9]":"to confuse someone when you are trying to explain something to them","example[56]":"Explain it again – you’ve lost me already.","signpost[6]":"remove something","definition[10]":"to remove a part or feature of something that is not necessary or wanted","example[57]":"You could lose the last paragraph to make it fit on one page.","definition[11]":"to stop having something any more, or to have less of it","example[58]":"The industry has lost 60,000 jobs.","example[59]":"After a boardroom battle, Dixon lost control of the company.","example[60]":"They lost business by not giving credit.","example[61]":"We started losing customers to cheaper rivals.","note[20]":"lose something to somebody","example[62]":"The big national chains were losing market share to independent one-person operations.","definition[12]":"to have less money than you had before or to spend more money than you are receiving","example[63]":"We all lost money when the firm collapsed.","example[64]":"The group is estimated to have lost $36 million last year.","example[65]":"lost revenue","example[66]":"The resulting crisis of confidence lost the bank (=caused the bank to lose) £30 million in deposits.","definition[13]":"to fall to a lower figure or price","example[67]":"In Tokyo, the Nikkei stock index lost 644.82 to close at 17,791.55.","example[68]":"Its shares lost 25p to 104p on the results.","definition[14]":"to become less in value or to lose an advantage","example[69]":"Sterling lost ground against the euro.","example[70]":"When the bid failed to appear, shares lost ground.","definition[15]":"to lose a lot of money","example[71]":"When the recession came, many companies lost their shirts."}