{"signpost[0]":"where somebody/something starts","definition[0]":"starting at a particular place or position","example[0]":"How do you get from here to Colchester?","example[1]":"an empire stretching from Syria to Spain","example[2]":"The hotel is on the main road from Newport.","example[3]":"Ernest twice ran away from home.","signpost[1]":"distance away","definition[1]":"used when talking about the distance between places or people to mention one of the places or people","example[4]":"We live about five miles from Boston.","example[5]":"a large Victorian house only fifty yards from my workplace","example[6]":"He was standing only a few feet away from me.","signpost[2]":"when something starts","definition[2]":"starting at a particular time","example[7]":"He’ll be here tomorrow from about seven o'clock onwards.","example[8]":"We’re going to tell her on her birthday – that’s two weeks from today.","example[9]":"From now on, I will only be working in the mornings.","example[10]":"housewives who work from morning to night (=without stopping)","signpost[3]":"original condition","definition[3]":"used to say what condition or situation something is in before it changes","example[11]":"translating from French into English","example[12]":"When she arrived, things just went from bad to worse (=got even worse)!","signpost[4]":"range","definition[4]":"used to mention the two ends of a range","example[13]":"Prices range from £10,000 to over £100,000.","note[0]":"from something to something","example[14]":"a place where you can buy anything from a handgun to a rocket launcher","signpost[5]":"position when watching","definition[5]":"used to say where someone is when they see or watch something","example[15]":"From the top of the hill, you can see for miles.","example[16]":"There’s a man watching us from behind that fence.","signpost[6]":"being removed","definition[6]":"used to say where something is before it is removed","example[17]":"She pulled her chair away from her desk.","example[18]":"Philip snatched the book from my hand.","example[19]":"He took a knife from his pocket.","example[20]":"Subtract three from fifteen.","signpost[7]":"absent","definition[7]":"used to say where someone would normally be, when they are not there","example[21]":"The boy’s absence from class has been noted.","example[22]":"I have a brother, but he’s away from home at present.","signpost[8]":"origin","definition[8]":"used to say where something was or who had it before you obtained it","example[23]":"I got the idea from Colin.","example[24]":"Do you know where the information came from?","example[25]":"Gray caught smallpox from his nephew.","example[26]":"I’ll show you a short extract from one of our training videos.","example[27]":"We usually buy our cheese from a shop in the market.","example[28]":"You have to choose the right answer from a list.","signpost[9]":"sent/given by somebody","definition[9]":"used to say who sends or gives something","example[29]":"He had received a bill for nineteen dollars from St Peter’s hospital.","example[30]":"I had a phone call from John.","example[31]":"You need to get permission from the owner.","example[32]":"with lots of love from Elaine  (=used at the end of a letter or on a card)","signpost[10]":"place of birth/work","definition[10]":"used to say where someone was born, where they live, or where they work","example[33]":"We invited speakers from all the regions.","example[34]":"Students from all faculties will have access to the machines.","example[35]":"There’s a man from the tax office on the phone.","example[36]":"I’m from Yorkshire  (=I was born in Yorkshire).","definition[11]":"used to state the cause of something","example[37]":"mothers who are exhausted from all the sleepless nights","example[38]":"Death rates from accidents have been on the increase.","example[39]":"a patient suffering from stomach pains","example[40]":"The community benefits from having an excellent health service.","signpost[11]":"forming opinions","definition[12]":"used to say what made you form a particular opinion","example[41]":"From what I’ve read, the company seems to be in difficulties.","example[42]":"It’s obvious from a quick glance that the plan has changed dramatically.","definition[13]":"used to say how a subject is being considered","example[43]":"These changes are ideal from my point of view.","example[44]":"We have spent a lot of time looking at the problem from all angles.","signpost[12]":"made of something","definition[14]":"used to say what substance is used to make something","example[45]":"Bread is made from flour, water, and yeast.","example[46]":"a cabinet constructed from chipboard","signpost[13]":"prevented","definition[15]":"used to say what is prevented or forbidden","example[47]":"These problems have prevented me from completing the work.","note[1]":"from doing something","example[48]":"people who have been disqualified from driving","example[49]":"Tourist coaches will be banned from entering the city centre.","signpost[14]":"harm","definition[16]":"used to mention something bad that you do not want to affect someone or something","example[50]":"ways of protecting yourself from attack","example[51]":"I will keep you safe from harm.","signpost[15]":"difference","definition[17]":"used when you are comparing things or people to mention one of the things or people","example[52]":"She’s quite different from her sister.","example[53]":"Our two cats are so alike, I can never tell one from the other."}