{"word[0]":"lean","past_tense[0]":"leaned","definition[0]":"to move or bend your body in a particular direction","example[0]":"They were leaning forward, facing each other.","note[0]":"lean forward/back/over etc","example[1]":"Lean back and enjoy the ride.","example[2]":"She leant towards him and listened.","definition[1]":"to support yourself in a sloping position against a wall or other surface","example[3]":"He was leaning on the bridge, watching the boats go by.","note[1]":"lean against/on","definition[2]":"to put something in a sloping position where it is supported, or to be in that position","example[4]":"A huge mirror was leaning against the wall.","note[2]":"lean (something) against/on something","example[5]":"He leant his bicycle against the fence.","definition[3]":"to slope or bend from an upright position","example[6]":"trees leaning in the wind","definition[4]":"thin in a healthy and attractive way","example[7]":"He was lean, tall, and muscular.","definition[5]":"lean meat does not have much fat on it","opposite[0]":"fatty","definition[6]":"a lean organization, company etc uses only as much money and as many people as it needs, so that nothing is wasted","definition[7]":"a lean period is a very difficult time because there is not enough money, business etc","example[8]":"His wife was a source of constant support during the lean years.","definition[8]":"using the most effective methods and the fewest employees possible","example[9]":"In the struggle to turn the company into a lean commercial outfit, some lines have been discontinued altogether.","definition[9]":"lean manufacturing uses methods and techniques to produce goods as cheaply as possible, for example by using as few workers as possible and using JUST-IN-TIME methods, where parts are delivered only when they are needed","example[10]":"American companies are learning the tricks of lean manufacture.","example[11]":"a lean year for business","example[12]":"Many Welsh tourist attractions are having a very lean time."}