{"word[0]":"wash","signpost[0]":"wash something","definition[0]":"to clean something using water and a type of soap","example[0]":"This shirt needs washing.","example[1]":"It’s your turn to wash the dishes.","signpost[1]":"wash yourself","definition[1]":"to clean your body with soap and water","example[2]":"Amy washed and went to bed.","example[3]":"She had a hot bath and washed her hair.","example[4]":"I’m just going to wash my hands.","example[5]":"When a cat has finished eating, it often washes itself.","signpost[2]":"flow","definition[2]":"if a river, sea etc washes somewhere, or if something carried by the river or sea is washed somewhere, it flows or moves there","example[6]":"The waves washed against the shore.","example[7]":"The sea washed over her.","example[8]":"The young man was washed overboard (=pushed from a boat into the sea by the force of the water) in the storm.","example[9]":"The body was washed ashore (=brought to the shore by waves).","definition[3]":"to clean something with soap and water","example[10]":"Our car needs washing.","example[11]":"Make sure that you wash your hands.","display[0]":"do the washing","definition[4]":"to wash clothes that need to be washed","example[12]":"Did you do the laundry this morning?","example[13]":"I do the washing on Wednesdays and Saturdays.","display[1]":"do the washing up","definition[5]":"to wash all the cups, plates, knives etc that you have used during a meal","example[14]":"If you do the cooking tonight, I’ll do the washing up.","example[15]":"Who’s going to do the dishes?","display[2]":"cleanse","definition[6]":"to make something completely clean, especially using a special substance","example[16]":"Carefully cleanse the cut to get rid of any grit or dirt.","display[3]":"rinse","definition[7]":"to wash something with water in order to remove soap or dirt","example[17]":"I’ll just rinse the lettuce under the tap.","display[4]":"scrub","definition[8]":"to make something very clean, using a stiff brush and water, or soap and water","example[18]":"Lou was on her knees, scrubbing the kitchen floor.","display[5]":"mop","definition[9]":"to wash a floor with a wet mop (=special stick with thick threads on the end)","example[19]":"A cleaner mopped the floor between the beds.","signpost[3]":"act of cleaning","definition[10]":"an act of cleaning something using soap and water","example[20]":"Those jeans need a good wash (=a thorough wash).","example[21]":"I’ll just have a quick wash before we go out.","definition[11]":"clothes that are to be washed, are being washed, or have just been washed","example[22]":"You’d better put that shirt in the wash.","example[23]":"Do you need me to put another wash on?","signpost[4]":"skin","definition[12]":"a liquid used to clean your skin","example[24]":"an anti-bacterial facial wash","definition[13]":"a very thin transparent layer of paint or colour","definition[14]":"a written abbreviation of Washington","definition[15]":"a wide bay (=an area of sea that curves inwards towards the land) on the east coast of England between Norfolk and Lincolnshire"}