{"signpost[0]":"untrue","definition[0]":"a statement, story etc that is false is completely untrue","example[0]":"Please decide whether the following statements are true or false.","example[1]":"false accusations","explanation[0]":"In everyday English, people usually say not true rather than false, apart from in the fixed expression true or false:","definition[1]":"based on incorrect information or ideas","example[2]":"I don’t want to give you any false hopes.","example[3]":"The statement gives us a false impression that we understand something when we do not.","example[4]":"false assumptions about people of other cultures","example[5]":"a false sense of security (=a feeling of being safe when you are not really safe)","signpost[1]":"not real","definition[2]":"not real, but intended to seem real and deceive people","example[6]":"The drugs were hidden in a suitcase with a false bottom.","example[7]":"The man had given a false name and address.","definition[3]":"artificial","note[0]":"false teeth/hair/eyelashes etc","signpost[2]":"not sincere","definition[4]":"not sincere or honest, and pretending to have feelings that you do not really have","example[8]":"She’s so false.","example[9]":"a false laugh","example[10]":"‘You played brilliantly.’ ‘Not really, ’ Ian replied with false modesty.","example[11]":"He uses a false name.","definition[5]":"made to look or seem like something else, especially something worth a lot more money","example[12]":"fake fur","example[13]":"a fake Rolex watch","example[14]":"fake designer goods","example[15]":"a fake $100 bill","display[0]":"forged","definition[6]":"a forged  official document or bank note has been illegally made to look like a real one","example[16]":"a forged passport","example[17]":"a forged £50 note","display[1]":"counterfeit","definition[7]":"counterfeit money or goods have been illegally made to look exactly like something else","example[18]":"How do you detect counterfeit currency?","example[19]":"counterfeit drugs","display[2]":"imitation","definition[8]":"made to look real – used especially about guns, bombs etc or about materials","example[20]":"The two men used an imitation firearm to carry out the robbery.","example[21]":"imitation leather/silk/silver","display[3]":"phoney/phony","definition[9]":"false – used when you think someone is deliberately trying to deceive people","example[22]":"She put on a phoney New York accent.","example[23]":"The doctors were accused of supplying phoney medical certificates.","example[24]":"There’s something phoney about him.","example[25]":"phony advertisements","display[4]":"spurious","definition[10]":"false and giving a wrong impression about someone or something","example[26]":"spurious claims","example[27]":"That’s a spurious argument.","example[28]":"The company was trying to get some spurious respectability by using our name.","definition[11]":"not true or real, but intended to look real in order to deceive people","example[29]":"false and misleading advertisements","example[30]":"Firms issuing false certificates might be subject to lawsuits.","definition[12]":"something that you think will save money but which will really cost you more","example[31]":"It’s a false economy to hire unqualified staff."}