{"word[0]":"shy","comparative[0]":"shyer","superlative[0]":"shyest","definition[0]":"nervous and embarrassed about meeting and speaking to other people, especially people you do not know","example[0]":"He was a quiet shy man.","example[1]":"a shy smile","example[2]":"As a teenager, I was painfully shy (=extremely shy).","example[3]":"Oh, have you gone all shy, Jenny?","note[0]":"go all shy","example[4]":"She was very shy with strangers.","note[1]":"shy with","example[5]":"He was too shy to come and sit by me in class.","note[2]":"shy to do something","definition[1]":"unwilling to do something or get involved in something","example[6]":"Employees are urged not to be shy about reporting incidents of sexual harassment.","note[3]":"be shy about/of (doing) something","definition[2]":"used to say that someone does not like something and therefore tries to avoid it","example[7]":"Although publicity-shy, he recently agreed to be interviewed.","definition[3]":"shy animals get frightened easily and are unwilling to come near people","synonym[0]":"timid","example[8]":"Deer are shy creatures.","display[0]":"bashful","definition[4]":"shy and not willing to say very much","display[1]":"self-conscious","definition[5]":"worried and embarrassed about what you look like or what other people think of you","definition[6]":"not brave or confident","display[2]":"reserved","definition[7]":"not liking to express your emotions or talk about your problems","display[3]":"introverted","definition[8]":"thinking a lot about your own interests, problems etc, and not liking to be with other people","display[4]":"withdrawn","definition[9]":"quiet and not wanting to talk to other people, especially because you are unhappy","display[5]":"antisocial","definition[10]":"not liking to meet people and talk to them","display[6]":"retiring","definition[11]":"not wanting to be with other people","definition[12]":"if a horse shies, it makes a sudden movement away from something because it is frightened","example[9]":"The horse shied, throwing Darrel from his saddle."}