{"word[0]":"select","definition[0]":"to choose something or someone by thinking carefully about which is the best, most suitable etc","synonym[0]":"choose","example[0]":"a group of students selected at random","example[1]":"He had hopes of being selected for the national team.","note[0]":"select somebody for something","example[2]":"York was selected as the site for the research centre.","note[1]":"select somebody/something as something","example[3]":"They selected the winner from six finalists.","note[2]":"select somebody/something from something","example[4]":"Simon’s been selected to go to the conference.","note[3]":"select somebody to do something","explanation[0]":"In everyday English, people usually say choose rather than select:","example[5]":"They chose the winner from six finalists.","definition[1]":"a select group of people or things is a small special group that has been chosen carefully","example[6]":"The party was small and select.","example[7]":"Honorary degrees are handed out to a select few.","definition[2]":"only lived in, visited, or used by a small number of rich people","synonym[1]":"exclusive","example[8]":"a select block of flats","definition[3]":"to choose something from a group of things, after thinking carefully about which is the best, most useful, most profitable etc","example[9]":"The board hasn’t yet set a timetable for selecting a chief executive.","example[10]":"Investors shouldn’t select a stock fund just because it has low annual costs.","definition[4]":"if you select words or pictures on a computer screen, you use the MOUSE to make them change colour, before moving, cutting, or saving them","example[11]":"To copy a sentence, first select it and then press Control+C.","definition[5]":"used, visited, or bought only by a small group of people","synonym[2]":"EXCLUSIVE","example[12]":"Haute couture designers create superexpensive clothes that are sold to a select few customers worldwide.","example[13]":"This flat is situated on a small select development."}