{"word[0]":"except","definition[0]":"used to introduce the only person, thing, action, fact, or situation about which a statement is not true","example[0]":"The office is open every day except Sundays.","example[1]":"You can have any of the cakes except this one.","example[2]":"Everyone went except for Scott and Dan.","note[0]":"except for","example[3]":"She felt fine except for being a little tired.","example[4]":"Clarissa could think of nothing to say except that she was so sorry.","note[1]":"except (that)","example[5]":"Staff are not permitted to make personal phone calls except in an emergency.","note[2]":"except in/by/to etc","example[6]":"Benson kept the studio locked except when he was working there.","note[3]":"except when/where/if","example[7]":"She had nothing to do except spend money.","note[4]":"except do something","example[8]":"He wouldn’t talk about work, except to say that he was busy.","note[5]":"except to do something","definition[1]":"used to give the reason why something was not done or did not happen","example[9]":"Liz would have run, except that she didn’t want to appear to be in a hurry.","definition[2]":"used to mention a fact that makes what you have just said seem less true","example[10]":"I have earrings just like those, except they’re blue.","example[11]":"A date book would make a great gift, except that a lot of people already have one.","heading[0]":"GRAMMAR: Patterns with except","explanation[0]":"You use except before a noun","example[12]":"The shop is open every day except Sunday","example[13]":"She invited everyone except Tom","explanation[1]":"except for someone or something","example[14]":"The shop is open every day except for Sunday","example[15]":"She invited everyone except for Tom","bad_example[0]":"except of","explanation[2]":"You say except (that)   That is often omitted in spoken English","example[16]":"The twins look very similar, except one is taller than the other","explanation[3]":"You say except when/where/if","example[17]":"I cycle to work, except when it rains","example[18]":"You have to attend, except if you’re ill","explanation[4]":"When/where/if are not omitted","bad_example[1]":"I cycle to work, except it rains","bad_example[2]":"You have to attend, except you’re ill","definition[3]":"used when saying that a statement does not include a particular person or thing. At the beginning of a sentence, you must use except for, not just except, before a noun","example[19]":"The office is open every day except  Sundays.","example[20]":"Except for a man walking his dog, the park was empty.","example[21]":"Most of the critics liked the play, except for one critic on the ‘Los Angeles Times’.","example[22]":"Except for a few years in the early sixties and seventies, inflation has been a continuing feature of American life since World War II.","example[23]":"The area looks very much like the state of Iowa, except that  it is surrounded by beautiful snow-covered mountains.","example[24]":"Except in an emergency, these doors must remain closed.","display[0]":"apart from/aside from","definition[4]":"used when mentioning one or two things that do not fit the main thing that you are saying","example[25]":"Aside from one or two minor errors, this is an excellent piece of research.","example[26]":"The films were all made in Hollywood, apart from one, which was made in the UK.","example[27]":"The weather was not very good in the first week. Apart from that, it was a good holiday.","display[1]":"excluding/not including","definition[5]":"used when saying that something, especially a total number or amount, does not include a particular thing or person. Excluding is more formal than not including","example[28]":"The software costs $49.95, not including tax.","example[29]":"Excluding  students, the total number of unemployed rose from 2 million to 2.3 million.","display[2]":"with the exception of","definition[6]":"except for one particular person or thing","example[30]":"Denmark has more wind turbines than any other place in the world, with the exception of California.","example[31]":"With the exception of skin cancer, breast cancer is the most common cancer among women.","display[3]":"but","definition[7]":"used especially after words such as nothing, all, any, anyone, everything or everyone when saying that something is the only thing, or someone is the only person","example[32]":"There is nothing but trees, for mile after mile.","example[33]":"The garment covers everything but the eyes.","example[34]":"All but a few of her family died of the disease.","definition[8]":"used for mentioning the only person or thing which is not included in what you are saying","example[35]":"Every man she had ever loved, save her father, was now dead.","definition[9]":"to not include something","example[36]":"High technology equipment would be excepted from any trade agreement.","note[6]":"except something from something"}