{"word[0]":"exaggerate","definition[0]":"to make something seem better, larger, worse etc than it really is","example[0]":"I couldn’t sleep for three days – I’m not exaggerating.","example[1]":"It’s difficult to exaggerate the importance of sleep.","note[0]":"it’s easy/difficult/impossible to exaggerate something","collocation[0]":"it is difficult/hard/impossible to exaggerate something","example[2]":"It is difficult to exaggerate the strength of people’s feelings on this matter.","collocation[1]":"it is easy to exaggerate something","example[3]":"It’s all too easy to exaggerate the importance of these rather minor factors.","collocation[2]":"exaggerate the importance/significance (of something)","example[4]":"Personally, I think society exaggerates the importance of marriage.","collocation[3]":"exaggerate the extent of something","example[5]":"The army exaggerated the extent to which the operation was a success.","collocation[4]":"exaggerate the impact (of something)","example[6]":"We believe the Chancellor is exaggerating the impact these proposals will have.","collocation[5]":"exaggerate the size (of something)","example[7]":"I’m sure Tommy is exaggerating the size of the problem.","collocation[6]":"exaggerate the effect (of something)","example[8]":"He yawned widely, exaggerating the effect by stretching his arms wide.","definition[1]":"to say that something is much bigger, better, worse, more important etc than it really is","example[9]":"He exaggerated his own achievements.","example[10]":"These claims are wildly exaggerated.","example[11]":"The grass in the garden was about three feet high – I’m not exaggerating.","display[0]":"blow something (up) out of all proportion","definition[2]":"to say a situation or event is a lot worse or much more serious than it really is","example[12]":"The problem really has been blown up out of all proportion.","display[1]":"make too much of something","definition[3]":"to treat something that has happened as though it were more important or serious than it really is – used especially when saying that you should not do this","example[13]":"She loved the fact that he’d sent her flowers, but she didn’t want to make too much of it in case it meant nothing.","example[14]":"It's probably nothing – children often get these strange ideas. You shouldn’t make too much of them","display[2]":"overemphasize","definition[4]":"to say that a part of something is more important and has a bigger effect than is really true, especially in relation to other things","example[15]":"The importance of cleanliness in the preparation of food cannot be overemphasized.","example[16]":"Historians have tended to overemphasize the role of the monarchy in British history.","display[3]":"overstate","definition[5]":"to describe something in a way that makes it sound more important or serious than it really is","example[17]":"Sometimes she overstates her case.","example[18]":"The importance of advertising can hardly be overstated.","display[4]":"overplay","definition[6]":"to make something seem more important than it is, in the way that you talk about it or treat it","example[19]":"The media has greatly overplayed this issue.","display[5]":"glorify","definition[7]":"to make someone or something seem much better, less harmful etc than they really are – used when you think it is wrong to do this","example[20]":"His films glorify violence.","example[21]":"My father never glorified war.","example[22]":"These images were produced in order to glorify the empire.","display[6]":"talk something up","definition[8]":"to talk about something in a way that makes it appear more important, interesting, or successful than it really is, especially to get someone’s support or interest","example[23]":"At the interview, he talked up his experience of working in sales.","example[24]":"The government tried to talk up the threat posed by these countries, in order to justify an increase in military spending.","display[7]":"overrated","definition[9]":"if you think someone or something is overrated, you think they are not nearly as good as people claim","example[25]":"I think her books are overrated.","example[26]":"As a player he’s overrated.","display[8]":"idealized","definition[10]":"an idealized image, view, picture etc of someone or something shows them as being much better than they really are","example[27]":"His books give an idealized picture of English rural life.","example[28]":"her friend’s idealized view of marriage"}