{"word[0]":"feature","definition[0]":"a part of something that you notice because it seems important, interesting, or typical","example[0]":"Air bags are a standard feature in most new cars.","example[1]":"Striped tails are a common feature of many animals.","example[2]":"The hotel’s only redeeming features (=things that make it acceptable) were that it was cheap and near the city centre.","example[3]":"One of the distinguishing features (=features that are different from other things of the same sort) of modern banking is its dependence on computers.","example[4]":"The most distinctive feature of the dinosaurs was their size.","note[0]":"main/important/significant etc feature","example[5]":"An important feature of Van Gogh’s paintings is their bright colours.","note[1]":"feature of","definition[1]":"a piece of writing about a subject in a newspaper or a magazine, or a special report on television or on the radio","example[6]":"a feature on holidaying with your dog","note[2]":"feature on","definition[2]":"a part of someone’s face, such as their eyes, nose etc","example[7]":"He had fine delicate features.","example[8]":"Her eyes were her best feature.","definition[3]":"a part of the land, especially a part that you can see","example[9]":"Hedges are an important feature of the landscape in Britain.","definition[4]":"a film being shown at a cinema","note[3]":"double feature (=when two films are shown together)","example[10]":"There were a couple of short cartoons before the main feature.","form[0]":"ADJECTIVES/NOUN + feature","collocation[0]":"a common feature","example[11]":"Pine trees are a common feature of the Swedish landscape.","collocation[1]":"a striking feature","example[12]":"Her long blonde hair is her most striking feature.","collocation[2]":"a distinguishing feature","example[13]":"A long beak is one of the bird’s distinguishing features.","collocation[3]":"a unique feature","example[14]":"A unique feature of this guitar is its shape.","collocation[4]":"an unusual feature","example[15]":"The church’s most unusual feature is this window.","collocation[5]":"a standard feature","example[16]":"Airbags are now a standard feature on most cars.","collocation[6]":"a regular feature","example[17]":"Delays and cancellations are a regular feature of air travel.","collocation[7]":"a recurring feature","example[18]":"Humour is a recurring feature of her novels.","collocation[8]":"an important feature","example[19]":"The final-year project is an important feature of all undergraduate courses.","collocation[9]":"a significant feature","example[20]":"Bad weather was a significant feature in the accident.","collocation[10]":"a central feature","example[21]":"Cultural diversity is a central feature of modern British society.","collocation[11]":"a key feature","example[22]":"Private ownership is a key feature of capitalism.","collocation[12]":"the main feature","example[23]":"The main feature of the square is the Gothic cathedral.","collocation[13]":"an attractive feature","example[24]":"The house had many attractive features, notably the large garden.","collocation[14]":"a design feature","example[25]":"The building incorporates many interesting design features.","collocation[15]":"a safety feature","example[26]":"The car has more safety features than its rivals in the same price range.","collocation[16]":"a redeeming feature","example[27]":"The hotel’s only redeeming feature was its view of the bay","definition[5]":"to include or show something as a special or important part of something, or to be included as an important part","example[28]":"The exhibition features paintings by Picasso.","example[29]":"a cruise ship featuring extensive spa facilities","example[30]":"Violence seems to feature heavily in all of his books.","note[4]":"feature prominently/strongly/heavily etc","example[31]":"A study of language should feature in an English literature course.","note[5]":"feature in","example[32]":"Pupils visited some of the websites featured in the article.","note[6]":"be featured in something","example[33]":"The film featured Brando as the Godfather.","note[7]":"feature somebody as something","definition[6]":"to show a film, play etc","example[34]":"The Retro Theatre is featuring films by Frank Capra this week."}