{"word[0]":"firm","definition[0]":"a business or company, especially a small one","example[0]":"She works for an electronics firm.","note[0]":"electronics/advertising/law etc firm","example[1]":"Kevin is with a firm of accountants in Birmingham.","note[1]":"a firm of accountants/solicitors/builders etc","form[0]":"ADJECTIVES/NOUN + firm","collocation[0]":"a large/big firm","example[2]":"He is managing director of a large firm.","collocation[1]":"a small firm","example[3]":"He trained with a small firm in Cardiff.","collocation[2]":"a medium-sized firm","example[4]":"The law will not effect medium-sized firms with less than 100 employees.","collocation[3]":"an engineering/building/electronics etc firm","example[5]":"Fred worked for an electronics firm.","collocation[4]":"a law/accounting/advertising etc firm","example[6]":"She was offered a job with a law firm.","collocation[5]":"a British/American Swiss etc firm","example[7]":"British firms are competing with a number of foreign companies.","collocation[6]":"a local firm","example[8]":"The equipment was supplied by a local firm.","collocation[7]":"a foreign firm","example[9]":"There has been renewed competition from foreign firms.","collocation[8]":"a family firm","example[10]":"The business grew from a small family firm into a large company.","collocation[9]":"a firm of solicitors/accountants/surveyors etc","example[11]":"Ms Shaw is a partner in a firm of solicitors.","collocation[10]":"work for a firm","example[12]":"Chris has been working for this firm for nearly 20 years.","collocation[11]":"join a firm","example[13]":"He joined the firm when he was in his early twenties.","collocation[12]":"leave a firm","example[14]":"She left the firm in 2007.","collocation[13]":"a firm employs somebody","example[15]":"The firm employs more than 200 people.","collocation[14]":"a firm produces something","example[16]":"Our firm produces computer software for the business market.","collocation[15]":"a firm supplies something","example[17]":"The firm supplies office furniture to local businesses.","definition[1]":"not completely hard, but not soft, and not easy to bend into a different shape","example[18]":"The sofa cushions are fairly firm.","example[19]":"a firm green apple","example[20]":"Most doctors recommend sleeping on a firm mattress.","definition[2]":"strongly fixed in position, and not likely to move","synonym[0]":"secure","example[21]":"Make sure the ladder feels firm before you climb up.","example[22]":"A concrete foundation was poured after digging down to firm ground.","example[23]":"Mount the tanks side by side on a firm base.","definition[3]":"not likely to change","example[24]":"Blackpool remains a firm favourite with holidaymakers from Northern Ireland.","example[25]":"Corey was always a firm believer in prayer.","example[26]":"They made a firm offer (=offered to pay a particular amount) on the house over the weekend.","example[27]":"Diana and Laura have been firm friends (=close friends) since their early teens.","example[28]":"Our client hasn’t reached a firm decision on the matter yet.","note[2]":"firm conviction/commitment/belief etc","definition[4]":"showing in the way that you behave or speak that you are the person in control and that you are not likely to change your answer, belief etc","example[29]":"Cal replied with a polite but firm ‘no’.","example[30]":"What this country needs is firm leadership.","example[31]":"You need to be firm with her or she’ll try to take advantage of you.","note[3]":"be firm with somebody","definition[5]":"if the value of a particular country’s money is firm, it does not fall in value","synonym[1]":"steady","example[32]":"The pound is still firm against the dollar.","note[4]":"firm against","definition[6]":"to press down on soil to make it harder or more solid","definition[7]":"a company or business, especially one which is quite small","example[33]":"The eight-volume guide contains entries for 700,000 lawyers and 44,000law firms.","example[34]":"afirm of chartered accountants","example[35]":"The auditing services market is dominated by a small number of large accounting firms.","definition[8]":"if prices on a financial market firm to a particular level, they rise to that level","example[36]":"Sales volume hit £53 million as the shares firmed 19p to 126p.","note[5]":"firm to","definition[9]":"firm decisions, judgements, or offers are final and not likely to be changed","example[37]":"The Confederation of British Industry said it was too early to make firm forecasts about demand.","example[38]":"The airline hasfirm orders for 20 Airbus A321 medium-range jets.","definition[10]":"stocks, shares, prices etc which are firm have been rising and do not seem likely to fall","example[39]":"The Federal Reserve chairman implied that the US would keepinterest rates firm.","example[40]":"OPEC members needfirm prices to maintain their revenues.","example[41]":"The dollar ended the week on a firm note (=with a steady price)."}