{"word[0]":"apology","plural[0]":"apologies","definition[0]":"something that you say or write to show that you are sorry for doing something wrong","example[0]":"The minister had to issue a formal public apology for his remarks.","note[0]":"apology for","example[1]":"She finally received an apology from the company.","note[1]":"apology from","example[2]":"an apology to passengers for any inconvenience caused","note[2]":"apology to","definition[1]":"a statement in which you defend something you believe in after it has been criticized by other people","example[3]":"an apology for Christianity","collocation[0]":"make an apology","example[4]":"I hope you are going to make an apology.","collocation[1]":"issue an apology","example[5]":"North Korea issued an official apology for the incident.","collocation[2]":"get/receive an apology","example[6]":"He received a formal apology from the company.","collocation[3]":"offer an apology","example[7]":"We would like to offer our sincere apologies for the delay.","collocation[4]":"accept somebody’s apology","example[8]":"Please accept my apologies for having to cancel our meeting.","collocation[5]":"demand an apology","example[9]":"China continued to demand a full apology from the US.","collocation[6]":"owe somebody an apology","example[10]":"I’m afraid I owe you an apology.","collocation[7]":"publish an apology","example[11]":"The newspaper group was forced to publish a full apology.","collocation[8]":"mumble/mutter an apology","example[12]":"He bumped into me and mumbled an apology.","collocation[9]":"my sincere/profound apologies","example[13]":"Firstly, my sincere apologies for not having contacted you earlier.","example[14]":"‘I have been guilty of making some insensitive remarks, ’ said Wright, who offered his profound apologies to everyone concerned.","collocation[10]":"a public apology","example[15]":"The authorities published a public apology in the newspaper.","collocation[11]":"a formal apology","example[16]":"Russia is demanding a formal apology.","collocation[12]":"an official apology","example[17]":"The company has made an official apology and is offering compensation.","collocation[13]":"a written apology","example[18]":"The police sent a written apology to the family.","collocation[14]":"a full apology","example[19]":"The prime minister made a full apology in the House of Commons.","collocation[15]":"an abject apology","example[20]":"The BBC issued an abject apology for insulting the Queen.","collocation[16]":"profuse apologies","example[21]":"Moira telephoned with profuse apologies for the misunderstanding.","collocation[17]":"a letter of apology","example[22]":"We agreed to write a letter of apology."}