{"word[0]":"hammer","definition[0]":"a tool with a heavy metal part on a long handle, used for hitting nails into wood","definition[1]":"a tool like this with a wooden head used to make something flat, make a noise etc","example[0]":"an auctioneer’s hammer","definition[2]":"the part of a gun that hits the explosive charge that fires a bullet","definition[3]":"a heavy metal ball on a wire with a handle at the end, which you throw as far as possible as a sport","signpost[0]":"piano","definition[4]":"a wooden part of a piano that hits the strings inside to make a musical sound","signpost[1]":"hit with a hammer","definition[5]":"to hit something with a hammer in order to force it into a particular position or shape","example[1]":"the sound of hammering and sawing","example[2]":"Hammer the nails into the back of the frame.","note[0]":"hammer something in/into something","example[3]":"All afternoon, Martin had been hammering away in the conservatory.","note[1]":"hammer away (at something)","signpost[2]":"hit repeatedly","definition[6]":"to hit something many times, especially making a loud noise","synonym[0]":"pound","example[4]":"The rain was hammering against the window.","example[5]":"Daniella hammered at the door.","note[2]":"hammer at","signpost[3]":"hurt with problems","definition[7]":"to hurt someone or something by causing them a lot of problems","example[6]":"British industry was being hammered by the recession.","signpost[4]":"hit hard","definition[8]":"to hit or kick something very hard","example[7]":"Robinson hammered the ball into the goal.","definition[9]":"to strongly criticize or attack someone for something they have said or done","example[8]":"The president has been hammered for his lack of leadership.","signpost[5]":"heart","definition[10]":"if your heart hammers, you feel it beating strongly and quickly","example[9]":"She stood outside the door, her heart hammering.","definition[11]":"to defeat someone completely at a sport","example[10]":"Arsenal hammered Manchester United 5–0.","definition[12]":"to be sold at an AUCTION","example[11]":"The paintings come under the hammer at Sotheby’s in November.","definition[13]":"to sell a large amount of stocks, shares etc at one time, causing prices to fall"}