{"word[0]":"climb","signpost[0]":"move up/down","definition[0]":"to move up, down, or across something using your feet and hands, especially when this is difficult to do","example[0]":"Harry climbed the stairs.","example[1]":"Boys were climbing trees along the river bank.","example[2]":"The wall is too high to climb over.","note[0]":"climb up/down/along etc","example[3]":"They climbed up into the loft of the old barn.","signpost[1]":"temperature/prices etc","definition[1]":"to increase in number, amount, or level","synonym[0]":"go up","example[4]":"The temperature has climbed steadily since this morning.","example[5]":"Inflation climbed 2% last month.","example[6]":"The divorce rate had climbed to almost 30% of all marriages.","note[1]":"climb to","signpost[2]":"with difficulty","definition[2]":"to move into, out of, or through something slowly and awkwardly","example[7]":"The bus pulled in, and we climbed aboard.","example[8]":"John climbed through the window into the kitchen.","note[2]":"climb through/over/into etc","example[9]":"I turned the TV on and climbed into bed.","signpost[3]":"path/sun/plane","definition[3]":"to move gradually to a higher position","example[10]":"The roller coaster climbs 91 feet and reaches speeds of 45 miles an hour.","example[11]":"The path climbs high into the hills.","note[3]":"climb into/up etc","example[12]":"The plane climbed to 11,600 feet to try to get above the clouds.","definition[4]":"to climb mountains or rocks as a sport","example[13]":"Hillary and Tenzing were the first men to climb Mount Everest.","example[14]":"She loves to hike and climb.","definition[5]":"to grow up a wall or other structure","note[4]":"climbing rose/plant","signpost[4]":"in a list","definition[6]":"to move higher in a list of teams, records etc as you become more popular or successful","example[15]":"The song climbed to number two in the US charts.","signpost[5]":"in your life/job","definition[7]":"to move to a better position in your social or professional life","example[16]":"Steve climbed rapidly in the sales division.","example[17]":"men who climbed the career ladder in the 1980s","definition[8]":"to move up, down, or across something using your hands and feet","example[18]":"Most kids love climbing trees.","example[19]":"Several fans climbed onto the roof of the arena to get a better view.","example[20]":"She climbed down the ladder.","display[0]":"ascend","definition[9]":"to climb up something","example[21]":"He began to ascend the narrow winding staircase.","example[22]":"the first man to ascend Mount Everest","definition[10]":"to climb up something such as a slope or stairs","example[23]":"He went up the steps to the platform.","example[24]":"Sonia was quiet as they went up the hill.","display[1]":"scale","definition[11]":"to climb to the top of something such as a high wall or fence","example[25]":"Somehow the men had scaled the twenty-foot wall without setting off the alarm.","example[26]":"Protestors scaled the walls of the building and hung banners.","example[27]":"Rescuers had to scale a one-thousand-foot cliff before they could reach the injured climber.","display[2]":"clamber","definition[12]":"to climb somewhere with difficulty, using your hands to help you","example[28]":"At last we saw the two girls clambering down the slope to safety.","example[29]":"Everyone clambered onto the back of the truck.","display[3]":"scramble","definition[13]":"to climb somewhere quickly and with difficulty, using your hands to help you, especially when you are walking","example[30]":"They scrambled up the steep rocky bank.","signpost[6]":"movement upwards","definition[14]":"a process in which you move up towards a place, especially while using a lot of effort","example[31]":"a long steady climb to the top","definition[15]":"an increase in value or amount","example[32]":"The dollar continued its climb against the yen.","example[33]":"a steady climb in house prices","note[5]":"climb in","signpost[7]":"improvement","definition[16]":"the process of improving something, especially your professional or social position","example[34]":"a slow climb out of the recession","example[35]":"the Labour Party’s climb to power","signpost[8]":"list/competition","definition[17]":"a process in which someone or something reaches a higher position in a list or in a competition because of being popular or successful","example[36]":"the Giants’ climb from twelfth to fifth in the league","example[37]":"the song’s steady climb up the charts","signpost[9]":"rock/mountain","definition[18]":"a steep rock, cliff, or mountain that you climb up","example[38]":"one of the hardest rock climbs in the world"}