{"word[0]":"mock","definition[0]":"to laugh at someone or something and try to make them look stupid by saying unkind things about them or by copying them","synonym[0]":"make fun of","example[0]":"Opposition MPs mocked the government’s decision.","example[1]":"‘Running away?’ he mocked.","example[2]":"It’s easy for you to mock, but we put a lot of work into this play.","definition[1]":"to make something seem completely useless","example[3]":"Violent attacks like this mock the peace process.","definition[2]":"to laugh at and say unkind things about a person, institution, belief etc, to show that you do not have a high opinion of them. Mock is a formal word – in everyday English people usually say make fun of","example[4]":"The press mocked his attempts to appeal to young voters.","example[5]":"She was mocked by other pupils in her class.","example[6]":"You shouldn’t mock the afflicted!  (=you should not make fun of people who cannot help having problems – used especially ironically, when really you think it is funny too)","display[0]":"make fun of somebody/something","definition[3]":"to make someone or something seem stupid by making unkind jokes about them","example[7]":"Peter didn’t seem to realize that they were making fun of him.","example[8]":"It used to be fashionable to make fun of the European Parliament.","display[1]":"laugh at somebody/something","definition[4]":"to make unkind or funny remarks about someone or something, because they seem stupid or strange","example[9]":"I don’t want the other kids to laugh at me.","example[10]":"People would laugh at the idea nowadays.","display[2]":"poke fun at somebody/something","definition[5]":"to make someone or something seem silly by making jokes about them, especially in a way that is funny but not really cruel","example[11]":"a TV series that regularly poked fun at the government","example[12]":"He’s in no position to poke fun at other people’s use of English!","display[3]":"ridicule","definition[6]":"to make unkind remarks that make someone or something seem stupid","example[13]":"Catesby ridiculed his suggestion.","example[14]":"His ideas were widely ridiculed at the time.","example[15]":"Scientists ridiculed him for doubting the existence of the greenhouse effect.","display[4]":"deride","definition[7]":"to make remarks that show you think that something is stupid or useless – often used when you think that the people who do this are wrong","example[16]":"Some forms of alternative medicine – much derided by doctors – have been shown to help patients.","example[17]":"the system that Marxists previously derided as ‘bourgeois democracy’","definition[8]":"not real, but intended to be very similar to a real situation, substance etc","example[18]":"war games with mock battles","example[19]":"a mock interview","example[20]":"mock marble floors","definition[9]":"used to show that an attitude or feeling is pretended, not real","example[21]":"a mock-serious expression","example[22]":"His frown was mock-severe.","definition[10]":"copying a particular style, especially a style of building","example[23]":"a mock-Tudor house"}