{"word[0]":"minority","plural[0]":"minorities","definition[0]":"a small group of people or things within a much larger group","opposite[0]":"majority","note[0]":"minority report (=a report by a minority of a group who do not agree with the others)","example[0]":"Gaelic is still spoken in Ireland by a minority.","example[1]":"Gay men are a small but significant minority.","note[1]":"small/tiny/substantial/significant minority","example[2]":"Only a minority of people supported these new laws.","note[2]":"minority of","explanation[0]":"In this meaning, minority is usually followed by a singular verb","example[3]":"A small minority refuses to cooperate","example[4]":"A small minority refuse to cooperate","definition[1]":"a group of people of a different race, religion etc from most other people in that country","example[5]":"People from ethnic minorities often face prejudice.","example[6]":"the very large Russian minorities in Ukraine and Moldova","example[7]":"children from minority groups","example[8]":"the teaching of minority languages in schools","example[9]":"a school with a high proportion of minority students","note[3]":"minority leader/businessman/student etc","definition[2]":"someone who belongs to a group like this","example[10]":"Businesses are under pressure to hire minorities and women.","definition[3]":"the period of time when someone is below the age at which they become legally responsible for their actions","collocation[0]":"a small minority","example[11]":"She is one of a small minority of women working in engineering.","collocation[1]":"a tiny minority","example[12]":"Only a tiny minority of the population actually commit crimes.","collocation[2]":"a large minority","example[13]":"A large minority of women feel happier when their husbands leave them.","collocation[3]":"a substantial/sizeable minority","example[14]":"A sizeable minority of people sleep less than five hours a night without problems.","collocation[4]":"a significant minority","example[15]":"A significant minority of older people have difficulty in caring for themselves.","collocation[5]":"be in a minority","example[16]":"Male students are in a minority in this class.","collocation[6]":"represent a minority","example[17]":"Old people still only represent a minority of the population.","collocation[7]":"form a minority","example[18]":"This type of cell forms a minority of the cells in the nervous system.","collocation[8]":"affect a minority","example[19]":"The side effects only affect a minority of people who take the drug.","form[0]":"minority + NOUN","collocation[9]":"a minority group","example[20]":"It’s ridiculous to refer to women as a minority group.","collocation[10]":"a minority interest","example[21]":"Jazz is a minority interest, but it is still an important part of musical studies.","collocation[11]":"a minority opinion/view","example[22]":"This is a minority view among scientists.","collocation[12]":"a minority stake","example[23]":"IBM has bought a minority stake in the computer company.","collocation[13]":"a minority shareholder","example[24]":"A minority shareholder with 10% of voting rights refused to accept the plan.","definition[4]":"less than half of the people or things in a particular group","example[25]":"He insists that only a minority of workers at the factory want the union."}