{"word[0]":"sell","past_tense[0]":"sold","signpost[0]":"give something for money","definition[0]":"to give something to someone in exchange for money","opposite[0]":"buy","example[0]":"If you offer him another hundred, I think he’ll sell.","example[1]":"He regrets selling all his old records.","example[2]":"Toni’s selling her car for £700.","note[0]":"sell something for £100/$50/30p etc","example[3]":"Tony had to sell the business at a loss.","note[1]":"sell something at a profit/loss","example[4]":"I won’t sell you my shares!","note[2]":"sell somebody something","example[5]":"The vase was sold to a Dutch buyer.","note[3]":"sell something to somebody","signpost[1]":"make something available","definition[1]":"to offer something for people to buy","example[6]":"Do you sell cigarettes?","example[7]":"a job selling advertising space","example[8]":"Smoke alarms sell for as little as five pounds.","note[4]":"sell at/for £100/$50/30p etc","signpost[2]":"make somebody want something","definition[2]":"to make people want to buy something","example[9]":"Scandal sells newspapers.","example[10]":"The car’s new design will help sell it to consumers.","signpost[3]":"be bought","definition[3]":"to be bought by people","example[11]":"Tickets for the concert just aren’t selling.","example[12]":"Her last book sold millions of copies.","example[13]":"All the new houses have been sold.","example[14]":"Anti-age creams always sell well.","note[5]":"sell well/badly","signpost[4]":"idea/plan","definition[4]":"to try to make someone accept a new idea or plan, or to become accepted","example[15]":"It’s all right for Washington, but will it sell in small-town America?","example[16]":"Joe’s completely sold on the concept.","note[6]":"be sold on (doing) something","example[17]":"It’s hard for any government to sell new taxes to the electorate.","example[18]":"managers selling employees the new working hours","example[19]":"He sold his motorcycle.","example[20]":"The shop sells old furniture.","example[21]":"Do you sell books on gardening?","display[0]":"export","definition[5]":"to send goods to another country to be sold","example[22]":"Which countries export oil to the United States?","display[1]":"deal in something","definition[6]":"to buy and sell a particular type of goods as part of your business","example[23]":"He deals in antiques.","display[2]":"put something up for sale/put something on the market","definition[7]":"to make something available to be bought","example[24]":"When the painting was first put up for sale, no one thought that it would be worth so much money.","example[25]":"The farm was put up for sale.","display[3]":"sell up","definition[8]":"to sell your house or your business so that you can move to a different place or do something different","example[26]":"They’re thinking of selling up and moving to Canada.","display[4]":"auction something/sell something at auction","definition[9]":"to sell things at a special event to the person who offers the most money","example[27]":"The contents of his home will be auctioned.","display[5]":"flog","definition[10]":"to sell something, especially something that is of low quality","example[28]":"A man at the market was flogging £10 watches.","display[6]":"peddle","definition[11]":"to sell cheap things in the street. Also used about selling illegal drugs and pornography","example[29]":"Street vendors peddled American and British cigarettes.","example[30]":"People who peddle drugs to children should be severely punished.","display[7]":"traffic in something","definition[12]":"to buy and sell large quantities of illegal goods or people","example[31]":"They trafficked in illegal weapons.","example[32]":"The gang were involved in people-trafficking.","example[33]":"drug-trafficking","definition[13]":"to give someone property, assets, goods, services etc in return for money","example[34]":"Chrysler plans to raise cash byselling assets.","example[35]":"Investors are selling more aggressively ahead of quarterly earnings reports.","example[36]":"Canada’s largest oil and gas concern will be sold to the public through a series of share issues.","example[37]":"He was forced to sell the magazine for $29.1 million.","note[7]":"sell something for","definition[14]":"to make something available for people to buy","example[38]":"In most countries, the firm sells its hi-fi equipment under the name Kenwood.","definition[15]":"to be offered for sale at a particular price","example[39]":"High-priced desktop computers sell for $20,000 and up.","definition[16]":"to encourage people to buy something","example[40]":"Reebok hopes their new promotion will sell the sportswear range.","definition[17]":"to be bought in large quantities","example[41]":"Corporate bonds issued this year have sold fast.","example[42]":"Many companies are developing packaging that both protects the environment and sells.","definition[18]":"to impress people with your abilities and good qualities","example[43]":"He believes in his company, and he sells himself, marketing his own beliefs.","definition[19]":"a product, idea, service etc that you sell or try to sell","example[44]":"Despite spending more than £10 million on ads, the product was atough sell (=difficult to sell).","example[45]":"There was a lack of confidence that the computer would be an easy sell (=easy to sell).","definition[20]":"when a salesperson uses a lot of pressure to make a customer buy something","example[46]":"A successful salesperson has to be good at the hard sell.","definition[21]":"when someone tries to encourage and persuade a customer to buy something, rather than using a lot of pressure","example[47]":"The soft sell works in four out of five cases."}