{"definition[0]":"a belief in one or more gods","example[0]":"The U.S. Constitution promises freedom of religion.","example[1]":"a course on philosophy and religion","definition[1]":"a particular system of this belief and all the ceremonies and duties that are related to it","example[2]":"people of different religions","example[3]":"the Islamic religion","example[4]":"The tribe practised a religion that mixed native beliefs and Christianity.","definition[2]":"a set of beliefs about a god, and the ceremonies and customs that go with these beliefs. Also used when talking about all religions in general","example[5]":"Judaism is one of the great religions of the world.","example[6]":"African tribal religions","example[7]":"a lecture on the role of religion in society","display[0]":"faith","definition[3]":"a religion, especially one of the large important world religions. Also used when talking about religious belief in general","example[8]":"The school welcomes children of all faiths.","example[9]":"His religious faith was always deeply important to him.","display[1]":"belief","definition[4]":"the act of believing in a god or gods, or the ideas that someone believes because of their religion","example[10]":"We all have the right to freedom of belief.","example[11]":"They were persecuted because of their religious beliefs.","display[2]":"denomination","definition[5]":"a religious group that has slightly different beliefs from other groups who belong to the same religion","example[12]":"The church is the largest Christian denomination in the United States.","display[3]":"sect","definition[6]":"a group of people who have their own set of religious beliefs and customs, especially a group that has separated from a larger group","example[13]":"He became a member of a Buddhist sect.","example[14]":"There are two sects in Islam - the Sunni and the Shi'a.","example[15]":"an obscure religious sect","display[4]":"the church","definition[7]":"the Christian religion in general","example[16]":"How great is the influence of the church in present-day society?","example[17]":"The church has a lot to say about this.","display[5]":"the Catholic/Protestant etc church","definition[8]":"one of the separate groups within the Christian religion","example[18]":"the Methodist Church","display[6]":"cult","definition[9]":"an extreme religious group that is not part of an established religion – often used to show disapproval","example[19]":"The suicides have been linked to a strange religious cult.","example[20]":"the traditional pagan cults of Ancient Rome","display[7]":"creed","definition[10]":"the religion that you belong to, and the set of beliefs that you accept in order to belong to it – often used in phrases when saying that your religion should not affect how you are treated","example[21]":"There must be no discrimination because of race, colour, or creed.","example[22]":"You will be rewarded whatever your race or creed.","display[8]":"faith community","definition[11]":"a group of people who share the same religious beliefs – used especially in official contexts","example[23]":"the benefits of living within a supportive faith community"}