{"word[0]":"complex","definition[0]":"consisting of many different parts and often difficult to understand","synonym[0]":"complicated","example[0]":"a complex system of highways","example[1]":"Photosynthesis is a highly complex process.","example[2]":"Peter seemed to have an instant understanding of the most complex issues.","example[3]":"It was a very complex relationship between two complex people.","definition[1]":"a complex word or sentence contains a main part and one or more other parts","definition[2]":"a group of buildings, or a large building with many parts, used for a particular purpose","example[4]":"The town has one of the best leisure complexes in the country.","example[5]":"a three-story apartment complex","definition[3]":"an emotional problem in which someone is unnecessarily anxious about something or thinks too much about something","example[6]":"I used to have a complex about my looks.","form[0]":"types of complex","collocation[0]":"a leisure complex","example[7]":"The new leisure complex includes a swimming pool, a sauna and a gym.","collocation[1]":"a shopping complex","example[8]":"Some old buildings were pulled down to make space for a new shopping complex.","collocation[2]":"a sports complex","example[9]":"The sports complex also has six tennis courts.","collocation[3]":"an entertainment complex","example[10]":"There are plans for an entertainment complex with cinemas and a bowling alley.","collocation[4]":"a holiday complex","example[11]":"The lively holiday complex has plenty of nightclubs, bars, and restaurants.","collocation[5]":"a housing/residential complex","example[12]":"Architects designed the residential complexes near the beach.","collocation[6]":"a retail/commercial complex","example[13]":"a ten-screen movie theater and retail complex","collocation[7]":"an office/museum/hospital etc complex","example[14]":"a 120-acre office complex near Las Vegas","collocation[8]":"an apartment complex","example[15]":"a luxury apartment complex on Fulton Street"}