{"word[0]":"prepare","signpost[0]":"make something","definition[0]":"to make a meal or a substance","example[0]":"Prepare the sauce while the pasta is cooking.","example[1]":"When we got home, Stephano was busy preparing dinner.","definition[1]":"to write a document, make a programme etc","example[2]":"Health and safety officers will investigate the site and prepare a report.","example[3]":"Green set himself the task of preparing a map of this remote area.","signpost[1]":"make plans/arrangements","definition[2]":"to make plans or arrangements for something that will happen in the future","synonym[0]":"get ready","example[4]":"The prosecution wanted more time to prepare their case.","example[5]":"The 45-year-old explorer has been preparing for his latest expedition to the Arctic.","note[0]":"prepare for","example[6]":"Her parents were busy preparing to go on holiday.","note[1]":"prepare to do something","explanation[0]":"In everyday English, people usually say that someone gets ready for something rather than prepares for it:","example[7]":"We’re getting ready to move next week.","signpost[2]":"make something ready","definition[3]":"to make something ready to be used","example[8]":"Prepare the soil, then plant the seedlings eight inches apart.","example[9]":"Coulthard’s team were up all night preparing the car for the race.","note[2]":"prepare something for somebody/something","signpost[3]":"make yourself ready","definition[4]":"to make yourself mentally or physically ready for something that you expect to happen soon","example[10]":"The Chicago Bears are busy preparing themselves for the big game.","note[3]":"prepare yourself for a race/fight etc","example[11]":"The letter arrived, and we prepared ourselves for bad news.","note[4]":"prepare yourself (for something)","example[12]":"Can you just give me a couple more moments to prepare myself?","example[13]":"Buy the album, and prepare to be amazed.","signpost[4]":"make somebody ready","definition[5]":"to provide someone with the training, skills, experience etc that they will need to do a job or to deal with a situation","example[14]":"a course that prepares students for English examinations","note[5]":"prepare somebody for something","example[15]":"Schools should do more to prepare children for the world of work.","example[16]":"What does a coach do to prepare his team for the Superbowl?","heading[0]":"to prepare for an event","definition[6]":"to make plans or arrangements for something that will happen in the future so that you will be ready when it happens","example[17]":"He only had a few hours to prepare for the interview.","example[18]":"The family are preparing to move to Queensland.","definition[7]":"to prepare for something. Get ready is less formal than prepare and is the usual phrase to use in everyday English","example[19]":"Smith has been busy getting ready for the race.","example[20]":"The army was getting ready to attack.","display[0]":"make preparations","definition[8]":"to prepare for an event that needs a lot of planning","example[21]":"The couple are making preparations for their wedding next year.","display[1]":"gear up","definition[9]":"to prepare for an important event – used about companies, organizations, cities etc","example[22]":"Stores are gearing up for the busy Christmas shopping period.","example[23]":"The city is gearing up for the Olympics.","heading[1]":"to prepare something so it can be used","example[24]":"Have you prepared your speech?","example[25]":"Groundsmen were preparing the pitch for tomorrow’s game.","display[2]":"get something ready","definition[10]":"to prepare something. Get something ready is less formal than prepare and is the usual phrase to use in everyday English","example[26]":"They were getting the ship ready to sail.","display[3]":"set (something) up","definition[11]":"to prepare equipment so that it is ready to be used","example[27]":"It will take a few minutes to set the camera up.","example[28]":"The band was setting up on the stage."}