{"definition[0]":"not more than a particular number, age etc","example[0]":"Naomi was only 17 when she got married.","example[1]":"There are only a few cars on the island.","example[2]":"It’s only eight o'clock.","definition[1]":"used to say that something or someone is not very important, serious etc","example[3]":"It was only a joke.","example[4]":"It’s an interesting job, but it’s only temporary.","example[5]":"They’re only small cuts, nothing life-threatening.","definition[2]":"nothing or no one except a particular person or thing","example[6]":"Only the president can authorize a nuclear attack.","example[7]":"We use only the best ingredients.","example[8]":"The car park is for staff only.","note[0]":"women/men/residents etc only","definition[3]":"used to say that something happens or is possible in one particular situation or place and no others, or for one particular reason","example[9]":"I’ll tell you, but only if you don’t tell anyone else.","example[10]":"I ate the food, but only because I was starving.","example[11]":"The transfer takes place only when the data is complete.","explanation[0]":"Only usually comes between the subject and the main verb","example[12]":"I only  saw two people","explanation[1]":"Only usually comes between an auxiliary verb and a main verb","example[13]":"I can only see two people","explanation[2]":"When you want to emphasize what you are saying, you sometimes use only at the beginning of a sentence, and put the auxiliary verb before the subject","example[14]":"Only later did  I understand what she meant","example[15]":"Only by improving social and economic conditions can good health be achieved","definition[4]":"no earlier than a particular time","example[16]":"‘When did you email her?’ ‘Only yesterday.’","note[1]":"only yesterday/last week/recently","example[17]":"Only then did she tell him about the attack.","note[2]":"only then did/would/could etc somebody do something","definition[5]":"used to say that there is one person, thing, or group in a particular situation and no others","example[18]":"I was the only woman there.","example[19]":"He is our only child.","example[20]":"I was the only one who disagreed.","example[21]":"Cutting costs is the only solution.","example[22]":"She’s the only person for this job.","definition[6]":"used like ‘but’ to give the reason why something is not possible","synonym[0]":"except (that)","example[23]":"I’d offer to help, only I’m really busy just now."}