{"word[0]":"participate","definition[0]":"to take part in an activity or event","example[0]":"Some members refused to participate.","example[1]":"They welcomed the opportunity to participate fully in the life of the village.","example[2]":"Everyone in the class is expected to participate actively in these discussions.","note[0]":"participate in","explanation[0]":"In everyday English, people usually say take part  rather than participate: ","example[3]":"She refused to take part in any of the activities.","definition[1]":"to do an activity together with other people","example[4]":"He always participates in classroom activities.","example[5]":"The people should have the right to participate in discussions about their future.","example[6]":"There are many ways people can participate in sports.","example[7]":"Who will be participating?","display[0]":"take part","definition[2]":"to participate in something. Take part is less formal that participate and is more common in everyday English","example[8]":"Nearly 500 teams took part in the competition.","example[9]":"She was asked to take part in a TV debate on drugs.","example[10]":"Anyone who is over 18 can take part.","display[1]":"play a part/role","definition[3]":"to take part in something in a useful way","example[11]":"Everyone can play a part in improving the security of their neighborhood.","example[12]":"Schneider played a key role in getting the organization started.","display[2]":"be involved","definition[4]":"to take part in an activity in some way","example[13]":"He has denied being involved in the murder.","example[14]":"It was a big project and many people were involved.","display[3]":"be active in something","definition[5]":"to actively take part in the work of an organization such as a political group or church","example[15]":"He is very active in the church’s work with homeless people.","example[16]":"She is no longer active in politics.","display[4]":"compete","definition[6]":"to take part in a competition or race","example[17]":"Athletes from all over the world will be competing.","example[18]":"She’s hoping to compete in the Olympic Games.","definition[7]":"if someone participates in the management of a company, they help make important decisions, for example by being on the BOARD OF DIRECTORS","example[19]":"Investors can participate in the management of the company they invest in, but must keep ownership at less than 50%.","definition[8]":"if employees of a company participate in its profits, they receive part of them","example[20]":"The workers have a stake in the corporation’s success and they participate in its growth and profits.","definition[9]":"if investors who are members of MUTUALs (=financial institutions such as some insurance companies, without shareholders) participate in their profits, they receive a share of the profits in addition to the normal payments from their investments"}