{"word[0]":"criminal","definition[0]":"relating to crime","example[0]":"Experts cannot agree on the causes of criminal behaviour.","example[1]":"I was sure he was involved in some kind of criminal activity.","example[2]":"She has not committed a criminal offence (=a crime).","example[3]":"He was arrested and charged with criminal damage (=damaging someone’s property illegally).","example[4]":"The doctor was found guilty of criminal negligence (=not taking enough care to protect people you are responsible for).","definition[1]":"relating to the part of the legal system that is concerned with crime","example[5]":"The case will be tried in a criminal court.","example[6]":"We have no faith in the criminal justice system.","example[7]":"The police are investigating the matter, and he may face criminal charges (=be officially accused of a crime).","example[8]":"She usually deals with serious criminal cases.","example[9]":"a criminal lawyer","definition[2]":"wrong, dishonest, and unacceptable","synonym[0]":"wicked","example[10]":"It seems criminal that teachers are paid so little money.","heading[0]":"– Meaning 1: relating to crime","collocation[0]":"criminal activity","example[11]":"There was no evidence of any criminal activity.","collocation[1]":"a criminal offence/act","example[12]":"Cruelty to animals is a criminal offence.","collocation[2]":"criminal behaviour","example[13]":"Is it possible that the tendency to criminal behaviour is inherited?","collocation[3]":"criminal wrongdoing","example[14]":"The investigation cleared him of any criminal wrongdoing.","collocation[4]":"criminal damage","example[15]":"He was charged with criminal damage to his boss's car.","collocation[5]":"criminal negligence","example[16]":"Charges of criminal negligence were brought against senior staff.","collocation[6]":"a criminal investigation","example[17]":"The FBI is conducting a criminal investigation into the bombing.","heading[1]":"– Meaning 2: relating to the part of the legal system that is concerned with crime","collocation[7]":"the criminal justice system","example[18]":"How effective is our criminal justice system?","collocation[8]":"criminal law","example[19]":"I’m more interested in criminal law than civil law.","collocation[9]":"a criminal charge","example[20]":"He’s been arrested on a very serious criminal charge.","collocation[10]":"a criminal record","example[21]":"It can be hard for someone with a criminal record to find work.","collocation[11]":"a criminal case","example[22]":"The crown court usually deals with criminal cases.","collocation[12]":"a criminal trial","example[23]":"His year-long criminal trial ended in October.","collocation[13]":"criminal proceedings","example[24]":"Criminal proceedings have been started against the officers connected with the events.","collocation[14]":"a criminal court","example[25]":"The trial will take place in an international criminal court.","definition[3]":"someone who is involved in illegal activities or has been proved guilty of a crime","example[26]":"Police have described the man as a violent and dangerous criminal.","example[27]":"a convicted criminal (=someone who has been found guilty of a crime)","example[28]":"The new law will ensure that habitual criminals (=criminals who commit crimes repeatedly) receive tougher punishments than first-time offenders.","example[29]":"Teenagers should not be sent to prison to mix with hardened criminals (=criminals who have committed and will continue to commit a lot of crimes).","definition[4]":"someone who is involved in illegal activities or has been proved guilty of a crime. Criminal is used especially about someone who often does things that are illegal","example[30]":"Criminals are stealing people's credit card details off the Internet.","example[31]":"He is one of the most wanted criminals in the United States.","display[0]":"offender","definition[5]":"someone who breaks the law","example[32]":"The courts should impose tougher punishments on offenders.","example[33]":"a special prison for young offenders","display[1]":"crook","definition[6]":"a dishonest person, especially one who steals money and who you cannot trust","example[34]":"Some politicians are crooks, but not all of them.","example[35]":"They're just a bunch of crooks.","display[2]":"felon","definition[7]":"someone who has committed a serious crime","example[36]":"Convicted felons should not be allowed to profit from their crimes.","display[3]":"the culprit","definition[8]":"the person who has done something wrong or illegal","example[37]":"The culprits were never found.","example[38]":"If I ever catch the culprit, he or she is in big trouble.","example[39]":"The culprits were just six years old.","display[4]":"delinquent","definition[9]":"a young person who behaves badly and is likely to commit crimes – used especially in the phrase juvenile delinquent","example[40]":"He later worked with juvenile delinquents in a Florida youth services program.","display[5]":"accomplice","definition[10]":"someone who helps a criminal to do something illegal","example[41]":"Police believe the murderer must have had an accomplice.","heading[2]":"different types of criminal","display[6]":"thief","definition[11]":"someone who steals things","example[42]":"Car thieves have been working in the area.","example[43]":"The thieves stole over £5,000 worth of jewellery.","display[7]":"robber","definition[12]":"someone who steals money or valuable things from a bank, shop etc – used especially when someone sees the person who is stealing","example[44]":"a masked robber armed with a shotgun","example[45]":"They were the most successful bank robbers in US history.","display[8]":"burglar","definition[13]":"someone who goes into people’s homes in order to steal","example[46]":"The burglars broke in through a window.","display[9]":"shoplifter","definition[14]":"someone who takes things from shops without paying for them","example[47]":"The cameras have helped the store catch several shoplifters.","display[10]":"pickpocket","definition[15]":"someone who steals things from people’s pockets, especially in a crowd","example[48]":"A sign warned that pickpockets were active in the station.","display[11]":"conman/fraudster","definition[16]":"someone who deceives people in order to get money or things","example[49]":"Conmen tricked the woman into giving them her savings, as an ‘investment’.","display[12]":"forger","definition[17]":"someone who illegally copies official documents, money, artworks etc","example[50]":"a forger who fooled museum curators","display[13]":"counterfeiter","definition[18]":"someone who illegally copies money, official documents, or goods","example[51]":"Counterfeiters in Colombia are printing almost perfect dollar bills.","display[14]":"pirate","definition[19]":"someone who illegally copies and sells another person’s work","example[52]":"DVD pirates","display[15]":"mugger","definition[20]":"someone who attacks and robs people in public places","example[53]":"Muggers took his money and mobile phone.","display[16]":"murderer","definition[21]":"someone who deliberately kills someone else","example[54]":"His murderer was sentenced to life imprisonment.","example[55]":"the murderer of civil rights activist Medgar Evers","example[56]":"He is a mass murderer (=someone who kills a large number of people).","display[17]":"serial killer","definition[22]":"someone who kills several people, one after the other over a period of time, in a similar way","example[57]":"Shipman was a trusted family doctor who became Britain's worst serial killer.","display[18]":"rapist","definition[23]":"someone who forces someone else to have sex","example[58]":"Some rapists drug their victims so that they become unconscious.","display[19]":"sex offender","definition[24]":"someone who is guilty of a crime related to sex","example[59]":"Too many sex offenders are released from prison early.","display[20]":"vandal","definition[25]":"someone who deliberately damages public property","example[60]":"Vandals broke most of the school’s windows.","display[21]":"arsonist","definition[26]":"someone who deliberately sets fire to a building","example[61]":"The warehouse fire may have been the work of an arsonist.","definition[27]":"not allowed by law and able to be punished by law","example[62]":"The investigation uncovered serious criminal activity.","example[63]":"allegations of possible criminal conduct involving company directors","definition[28]":"dealing with legal cases that involve crime","example[64]":"forensic tests involved in criminal and civil court cases","definition[29]":"someone who is involved in illegal activity or has been found guilty of a crime"}