{"word[0]":"ashamed","definition[0]":"feeling very sorry and embarrassed because of something you have done","example[0]":"Everyone cries sometimes – it’s nothing to be ashamed of.","example[1]":"Alan was deeply ashamed when he remembered what he’d said.","note[0]":"deeply/bitterly/thoroughly ashamed","example[2]":"I felt ashamed of the things I’d said to him.","note[1]":"ashamed of/at","example[3]":"I’m ashamed to admit that I’ve never read any of his books.","note[2]":"be ashamed to do something","example[4]":"She felt ashamed that she had missed her sister’s wedding.","note[3]":"ashamed that","example[5]":"You should be ashamed of yourself.","note[4]":"be/feel ashamed of yourself","definition[1]":"feeling uncomfortable because someone does something that embarrasses you","example[6]":"Many children feel ashamed of their parents.","note[5]":"ashamed of","example[7]":"Their behaviour makes me ashamed to be British.","note[6]":"ashamed to be/do something","explanation[0]":"You feel ashamed of something or someone","example[8]":"She was ashamed of her behaviour ","example[9]":"You should be ashamed of yourself!","display[0]":"embarrassed","explanation[1]":"You feel embarrassed by something or someone","example[10]":"I was embarrassed by the fact that I knew nothing about cars","example[11]":"Minna felt embarrassed by her parents","explanation[2]":"You feel embarrassed about something","example[12]":"He was clearly embarrassed about what had happened","definition[2]":"feeling very sorry and embarrassed because of something you have done, or someone connected with you has done","example[13]":"She felt deeply ashamed of her son’s behaviour.","display[1]":"humiliated","definition[3]":"very ashamed and upset, because someone has made you look weak or stupid, especially in front of other people","example[14]":"I came out of the class feeling humiliated.","display[2]":"mortified","definition[4]":"extremely ashamed and embarrassed, especially about something you have done accidentally","example[15]":"She’ll be mortified when she realizes her mistake.","example[16]":"a mortified expression","display[3]":"shamefaced","definition[5]":"showing by the expression on your face that you are ashamed about something","example[17]":"Paul came into my office looking shamefaced and apologized for what he had done.","display[4]":"feel guilty","definition[6]":"to feel worried and unhappy because you know that you have done something wrong. Feel bad  is more informal than feel guilty","example[18]":"He felt guilty about lying to his parents.","example[19]":"I felt bad about letting the team down.","display[5]":"lose face","definition[7]":"to lose people’s respect for you, especially by doing something that makes you look weak or stupid in front of other people","example[20]":"He feels he’ll lose face if he admits to his staff that he was wrong."}