{"word[0]":"robbery","plural[0]":"robberies","definition[0]":"the crime of stealing money or things from a bank, shop etc, especially using violence","example[0]":"Police are investigating a series of bank robberies in South Wales.","example[1]":"He received a 10 year prison sentence for armed robbery (=robbery using a gun).","example[2]":"He admitted attempted robbery and was given a suspended sentence.","definition[1]":"the crime of stealing money or other things from a bank, shop etc, especially by using threats or violence","example[3]":"Mobile phones are a common target in street robberies.","example[4]":"Armed robbery is a serious offence.","display[0]":"theft","definition[2]":"the crime of stealing something, especially when the person they are stolen from is not present","example[5]":"Car thefts are on the increase.","example[6]":"Security has been tightened since the theft of a $150,000 oil painting.","display[1]":"burglary","definition[3]":"the crime of entering a house or other building illegally and stealing things","example[7]":"Most burglaries occur when a house or apartment is empty.","example[8]":"He was charged with burglary.","display[2]":"break-in","definition[4]":"an occasion when someone breaks a door or window in order to enter a place and steal things","example[9]":"The break-in was the eighth on our street this year.","example[10]":"There’s been a break-in at the newsagents.","display[3]":"mugging","definition[5]":"a violent attack on someone in the street in order to rob them","example[11]":"There have been a number of muggings outside downtown hotels.","display[4]":"raid","definition[6]":"an attack on a bank, shop etc, especially one in which the thieves use weapons","example[12]":"The gang carried out an armed raid on a post office.","display[5]":"bank job","definition[7]":"a carefully planned robbery of a bank","example[13]":"The money from the bank job was quickly taken out of the country.","display[6]":"larceny","definition[8]":"the crime of stealing something from someone, without using force or threats. This word is used mainly in American English. It is now old-fashioned in British English","example[14]":"He pleaded guilty in New York to nine counts of grand larceny  (=stealing things that are worth a lot of money).","example[15]":"They were suspected of being involved in petty larceny  (=stealing things that are not worth a lot of money)."}