{"word[0]":"compare","definition[0]":"to consider two or more things or people, in order to show how they are similar or different","example[0]":"The report compares the different types of home computer available.","example[1]":"Compare and contrast the main characters of these two novels.","note[0]":"compare and contrast","example[2]":"The police compared the suspect’s fingerprints with those found at the crime scene.","note[1]":"compare something/somebody with something/somebody","example[3]":"Davies’ style of writing has been compared to Dickens’.","note[2]":"compare something/somebody to something/somebody","definition[1]":"to be better or worse than something else","example[4]":"The quality of English wines can now compare with wines from Germany.","note[3]":"compare (favourably/unfavourably) with something","example[5]":"How does life in Britain compare with life in the States?","example[6]":"The imported fabric is 30% cheaper and compares favourably  (=is as good) in quality.","example[7]":"Scientists compared the results of both experiments.","example[8]":"The woman’s body was identified by comparing her teeth with dental records.","display[0]":"make/draw a comparison","definition[2]":"to compare two or more things or people and say how they are similar","example[9]":"In her article, she makes a comparison between people’s lives now and 50 years ago.","example[10]":"It is possible to draw a comparison between  the two poets’ work.","display[1]":"draw an analogy","definition[3]":"to say that two situations are similar – a rather formal use","example[11]":"Some people have attempted to draw an analogy between America’s invasion of Iraq  and the war in Vietnam.","display[2]":"draw a parallel","definition[4]":"to say that some features of things are similar, especially things that are actually very different – a rather formal use","example[12]":"He draws a parallel between football and religion.","example[13]":"Parallels can be drawn between her work and that of Picasso.","display[3]":"contrast","definition[5]":"to compare two things, situations etc, in order to show how they are different from each other","example[14]":"In her novel she contrasts the lives of two families in very different circumstances.","display[4]":"make/draw a distinction between","definition[6]":"to say that you think two things are very different","example[15]":"The author draws a distinction between allowing death to occur, and causing it.","example[16]":"It is important to make a distinction between people’s fears about crime and the amount of crime that really happens.","display[5]":"measure somebody/something against somebody/something","definition[7]":"to compare two people or things, in order to judge which is better, bigger etc","example[17]":"As a young actress, she was nervous of being measured against her famous father.","example[18]":"Murray’s progress is often measured against that of Nadal."}