{"word[0]":"woman","plural[0]":"women","signpost[0]":"female person","definition[0]":"an adult female person","example[0]":"I was talking to a woman I met on the flight.","example[1]":"married women","example[2]":"a popular women’s magazine","example[3]":"When a woman is pregnant, the levels of hormones in her body change.","example[4]":"Ireland’s first woman president","note[0]":"woman priest/doctor etc","example[5]":"women artists","signpost[1]":"any woman","definition[1]":"women in general","example[6]":"A woman’s work is never done  (=used to say that women have a lot to do).","signpost[2]":"partner","definition[2]":"a word meaning a wife or girlfriend, which many women find offensive","example[7]":"Did he bring his new woman with him?","signpost[3]":"form of address","definition[3]":"a rude way of speaking to a woman when you are angry, annoyed etc","signpost[4]":"servant","definition[4]":"a female servant or person who does cleaning work for you in your house","definition[5]":"a female adult person","example[8]":"a young woman with dark brown hair","display[0]":"lady","definition[6]":"a polite word for a woman – used especially when you do not know the woman, or when the person you are talking to does not know the woman","example[9]":"A glass of white wine please, for this lady here.","example[10]":"The young lady stood up and shook my hand.","display[1]":"girl","definition[7]":"a young female person – usually used about someone younger than about twenty","example[11]":"a very pretty girl","example[12]":"teenage girls","definition[8]":"a woman – used especially when you are giving information about women, for example in formal surveys and reports","example[13]":"Females account for 46% of Internet users.","heading[0]":"relating to women","definition[9]":"relating to women or girls","example[14]":"female voters","example[15]":"Advertisers try to sell things by using images of the female body.","display[2]":"feminine","definition[10]":"used about qualities that are considered to be typical of women","example[16]":"You must not cry or show any other feminine weakness.","example[17]":"the ideal of feminine beauty","display[3]":"womanly","definition[11]":"behaving, dressing etc in a way that is thought to be typical of or suitable for a woman – used to show approval","example[18]":"her womanly figure","example[19]":"the womanly virtues of compassion and patience","display[4]":"girly/girlie","definition[12]":"behaving or dressing in a way that is thought to be typical of young girls, or suitable for a girl – often used disapprovingly","example[20]":"Stop being so girly! It's only a mouse!","example[21]":"a very girlie pink dress","display[5]":"effeminate","definition[13]":"a man who is effeminate looks or behaves like a woman","example[22]":"His long blonde hair made him look rather effeminate.","example[23]":"a pale effeminate-looking young man","definition[14]":"a British weekly magazine for women, especially popular with married women who have families"}