{"word[0]":"carriage","signpost[0]":"vehicle pulled by horse","definition[0]":"a vehicle with wheels that is pulled by a horse, used in the past","definition[1]":"one of the parts of a train where passengers sit","signpost[1]":"movement of goods","definition[2]":"the act of moving goods from one place to another or the cost of moving them","example[0]":"Canals were originally built for the carriage of coal.","example[1]":"It costs £45.50 including carriage.","signpost[2]":"machine part","definition[3]":"a moving part of a machine that supports or moves another part","example[2]":"the carriage of a typewriter","signpost[3]":"position of body","definition[4]":"used when describing the position of someone’s body as they walk, stand, or sit","example[3]":"her graceful carriage","signpost[4]":"for moving heavy objects","definition[5]":"something with wheels that is used to move a heavy object, especially a gun","definition[6]":"when goods are moved by vehicle from one place to another","synonym[0]":"FREIGHT","example[4]":"The receipts for carriage of timber have formed an important proportion of revenue.","definition[7]":"the cost of moving goods from one place to another","example[5]":"Prices exclude carriage and VAT.","example[6]":"There is a carriage fee of £68.","definition[8]":"used to show that the carriage of a delivery of goods will be paid for by their buyer","example[7]":"All goods are sold carriage forward.","definition[9]":"used to show that the seller will pay for the carriage of a delivery of goods","definition[10]":"used on the debit side of a TRADING ACCOUNT to show payments for the carriage on goods bought by a business. This amount is included as part of the cost of buying the goods","definition[11]":"used on the debit side of the profit and loss account to show payments for carriage on goods sold by a business. This amount is included in the sale price of the goods","definition[12]":"used to show that the seller will pay the carriage on a delivery of goods as far as the address of the buyer"}