{"definition[0]":"the place where two areas of air of different temperatures meet, often shown as a line on weather maps","note[0]":"warm/cold front (=an area of warm or cold air)","signpost[0]":"illegal activities","definition[1]":"a legal business that someone operates in order to hide the illegal activities that they are involved in","example[0]":"The casino was used as a front for cross-border smuggling operations.","note[1]":"front for","signpost[1]":"hide feelings","definition[2]":"if you put on a front, you behave in a way that is happier, braver etc than you really feel","example[1]":"His arrogance is just a front. Deep down he’s really insecure.","example[2]":"When disciplining children, it is important that parents present a united front  (=show that they both feel the same about a situation).","example[3]":"Jenny didn’t want Adam to see how worried she was. So she put on a brave front.","note[2]":"put on/show a front","definition[3]":"used in the name of a political party or unofficial military organization","example[4]":"the People’s Liberation Front","signpost[2]":"war","definition[4]":"the area where fighting happens in a war","synonym[0]":"front line","example[5]":"He joined the army, and was immediately sent to the front.","example[6]":"Her husband was shot down over the Western Front.","signpost[3]":"church","definition[5]":"a side of a large important church building","example[7]":"the west front of Rouen cathedral","definition[6]":"at, on, or in the front of something","example[8]":"Two of his front teeth had been knocked out.","example[9]":"the front cover of ‘Hello!’ magazine","example[10]":"the front wheel of his bicycle","example[11]":"the dog’s front legs","example[12]":"We walked up the front steps and into the reception area.","note[3]":"front door/garden/porch etc","example[13]":"We got there an hour early in order to get seats in the front row.","note[4]":"front seat/row","definition[7]":"a front organization is a legal one that is run in order to hide a secret or illegal activity","example[14]":"a front organization for importing heroin","definition[8]":"a front vowel sound is made by raising your tongue at the front of your mouth, such as the vowel sound in ‘see’","definition[9]":"if someone fronts something such as a musical group or a television programme, they lead it and are the person that the public sees most","example[15]":"Fronted by Alan Hull, the band had a number of memorable hits.","definition[10]":"if a building or area of land is fronted by something, or fronts onto it, it faces that thing","example[16]":"The house was fronted by a large ornamental lake.","example[17]":"The hotel entrance fronted onto a busy road.","definition[11]":"a person, organization, system etc used to hide something secret or illegal","example[18]":"His family kept a shop as a front for dealing in stolen goods.","definition[12]":"used to talk about something in relation to money, inflation, employment etc","example[19]":"There is a slight improvement on the jobs front with 30% of directors saying they expect to recruit more this year.","definition[13]":"more successful than other people or organizations in a business or activity","example[20]":"The Data System is just part of a massive development programme to keep us in front and to offer our clients the best licensed taxi service there is.","definition[14]":"to have to see someone in authority because you have done something wrong","example[21]":"My whole section was called in front of the manager.","definition[15]":"if you pay for something up front, you pay for it before you receive it","example[22]":"You have to pay a lot up front before you start getting the benefits of the system.","definition[16]":"to lead an organization because you are the person with the highest rank","example[23]":"The group’s European operation is fronted by Peter Collins."}