{"word[0]":"sadness","definition[0]":"the state of feeling sad","synonym[0]":"unhappiness","example[0]":"There was a touch of sadness in his voice  (=he sounded a little sad).","example[1]":"His relief was tinged with sadness (=he also felt rather sad).","example[2]":"She sensed Beth’s deep sadness.","note[0]":"great/deep sadness","example[3]":"It was with great sadness that we learned of his death.","definition[1]":"a sad feeling, caused especially when a happy time is ending, or when you feel sorry about someone else’s unhappiness","example[4]":"Charles felt a great sense of sadness and loss.","example[5]":"I noticed a little sadness in her eyes.","definition[2]":"the unhappy feeling you have when you are in a very difficult or unpleasant situation, especially when this lasts for a long time","example[6]":"After years of unhappiness, she finally decided to leave him.","example[7]":"She was a tense, nervous young woman, whose deep unhappiness was obvious to all those around her.","example[8]":"You do not know how much pain and unhappiness you have caused.","display[0]":"sorrow","definition[3]":"the feeling of being very sad, especially because someone has died or because terrible things have happened to you","example[9]":"There seemed to be nowhere to go to be alone with her sorrow.","example[10]":"His heart was filled with great sorrow after her death.","display[1]":"misery","definition[4]":"great unhappiness, caused especially by living or working in very bad conditions","example[11]":"The cold weather is with us again and the misery of the homeless is increasing.","example[12]":"Thousands of families were destined to a life of misery.","example[13]":"The misery and pain he caused were, for him, merely a measure of his success.","display[2]":"despair","definition[5]":"a feeling of great unhappiness, because very bad things have happened and you have no hope that anything will change","example[14]":"At the end of the month, she still had no job and was tired, frustrated, and close to despair.","display[3]":"grief","definition[6]":"great sadness that you feel when someone you love has died","example[15]":"He was overcome with grief when his wife died.","display[4]":"heartache","definition[7]":"a strong feeling of great sadness, especially because you miss someone you love","example[16]":"She remembered the heartache of the first Christmas spent away from her sons.","display[5]":"depression","definition[8]":"a mental illness that makes someone feel so unhappy that they  have no energy or hope for the future, and they cannot live a normal life","example[17]":"He slipped into a depression in which he hardly ate or even left his room.","display[6]":"despondency","definition[9]":"a feeling of being very unhappy and without hope","example[18]":"She felt useless, and this contributed to her despondency.","display[7]":"melancholy","definition[10]":"a feeling of sadness, that you feel even though there is no particular reason for it","example[19]":"Modigliani expressed his melancholy through his painting."}