{"word[0]":"wish","definition[0]":"if you wish to do something or you wish to have it done for you, you want to do it or want to have it done","synonym[0]":"like","example[0]":"You may leave now, if you wish.","example[1]":"The cook will prepare whatever you wish.","example[2]":"‘I’d like it to be ready by six.’ ‘Just as you wish, sir.’","note[0]":"(just) as you wish","example[3]":"I wish to make a complaint.","note[1]":"wish to do something","example[4]":"If you wish to discuss this matter further please do not hesitate to contact me.","explanation[0]":"In everyday English, people usually say want rather than wish:","example[5]":"I want to see the manager.","example[6]":"You can go, if you want.","definition[1]":"to want something to be true although you know it is either impossible or unlikely","example[7]":"I wish I didn’t have to go to work today.","note[2]":"wish (that)","example[8]":"I wish that I could afford a new car.","example[9]":"He wished Emily were with him.","example[10]":"Sometimes I wish I had never been born.","heading[0]":"GRAMMAR: Patterns with wish","explanation[1]":"You wish that you could do something","example[11]":"I wish I could speak Spanish","bad_example[0]":"I wish I can speak Spanish","explanation[2]":"You wish that something would happen","example[12]":"I wish it would stop raining","example[13]":"I wish you wouldn’t do that","explanation[3]":"You wish that you had done something","example[14]":"I wish I had paid more attention in class ","example[15]":"She wished she hadn’t said that she was bored","explanation[4]":"You wish that you could have done something","example[16]":"I wish I could have seen his face!","explanation[5]":"In everyday spoken English, you say I wish I was","example[17]":"I wish I was back home in Hong Kong","explanation[6]":"In more formal English, especially in American English, you use I wish I were","example[18]":"I wish I were back home in Hong Kong","explanation[7]":"I wish I were is often used when talking about things that are impossible","example[19]":"I wish I were you! ","example[20]":"I wish I were younger","definition[2]":"to say that you hope someone will have good luck, a happy life etc","example[21]":"My friends wished me well in my new job.","note[3]":"wish somebody well","example[22]":"We wish you a Merry Christmas and a Happy New Year!","note[4]":"wish somebody something","example[23]":"We wish them every happiness in their new home.","example[24]":"He shook my hand and wished me luck.","definition[3]":"to want something to happen or to want to have something, especially when it seems unlikely or impossible","example[25]":"It was no use wishing for the impossible.","note[5]":"wish for","example[26]":"She was like the sister I never had but always wished for.","definition[4]":"to silently ask for something you want and hope that it will happen by magic or good luck – used especially in children’s stories","example[27]":"One day she found a magic ring that brought her whatever she wished for.","definition[5]":"a desire to do something, to have something, or to have something happen","example[28]":"It’s important to listen to the wishes of the patient.","note[6]":"wish of","example[29]":"Despite her wish to continue working, she was forced to retire at the age of 62.","definition[6]":"a silent request for something to happen as if by magic","example[30]":"Close your eyes and make a wish.","collocation[0]":"make a wish","example[31]":"He blew out the candles and made a wish.","collocation[1]":"get/have your wish","example[32]":"She wanted him to leave, and she got her wish.","collocation[2]":"grant/fulfil somebody's wish","example[33]":"His parents would now be able to grant his wish.","collocation[3]":"express a wish","example[34]":"He expressed a wish to go to the United States.","collocation[4]":"respect somebody’s wishes","example[35]":"We have to respect his wishes.","collocation[5]":"ignore somebody’s wishes","example[36]":"It is important not to ignore the wishes of the patient.","collocation[6]":"somebody's wish comes true","example[37]":"His wish came true when he was called up to play for England.","collocation[7]":"somebody’s greatest/deepest wish","example[38]":"Her greatest wish was to see her parents again.","collocation[8]":"somebody’s last/final/dying wish","example[39]":"Her last wish was to be buried in her husband’s grave.","collocation[9]":"a fervent wish","example[40]":"To die for Ireland was the fervent wish of every true patriot.","collocation[10]":"contrary to somebody's wishes","example[41]":"Contrary to her parents' wishes, she decided not to go to university.","collocation[11]":"in accordance with somebody's wishes","example[42]":"In accordance with his wishes, he was buried next to his first wife."}