{"word[0]":"when","definition[0]":"at what time","example[0]":"When are we leaving?","example[1]":"When did you first meet Dr Darnall?","example[2]":"When will the work be finished?","example[3]":"I don’t know when I’ll see her again.","example[4]":"I’ll tell you when to stop.","note[0]":"when to do something","definition[1]":"at or during the time that something happens","example[5]":"Leonard was nine when his father died.","example[6]":"When the family came here from Russia, they were penniless.","example[7]":"When he was in the air force he flew Tornado jets.","definition[2]":"after or as soon as something happens","example[8]":"When the meal was finished, Rachel washed up and made coffee.","example[9]":"I’ll phone you again when I get home.","definition[3]":"used to mention a type of event or situation when talking about what happens on occasions of that type","example[10]":"When lead is added to petrol, it improves the car’s performance.","example[11]":"When mixed with water the powder forms a smooth paste.","example[12]":"He always wears glasses except when playing football.","definition[4]":"used to show which particular time or occasion you are talking about","example[13]":"The best moment was when he scored the winning goal.","example[14]":"There are times when I hate him.","example[15]":"She remembered the day when Paula had first arrived.","note[1]":"the day/time/afternoon etc when","definition[5]":"even though something is true","example[16]":"Why does she steal things when she could easily afford to buy them?","definition[6]":"used to introduce a fact or statement that makes something seem surprising","example[17]":"When you consider that the airline handled 80 million passengers last year, the accident figures are really very small.","heading[0]":"GRAMMAR: Choosing the right tense","explanation[0]":"You use the present tense with when","example[18]":"What are you planning to do when you leave college?","explanation[1]":"Don’t use ‘will’ in the clause after when","bad_example[0]":"What are you planning to do when you will leave college?","explanation[2]":"You can also use the present perfect tense with when","example[19]":"What are you planning to do when your course has finished?","explanation[3]":"When talking about the past, you can use the past perfect tense with when","example[20]":"When the rain had stopped, they went outside","example[21]":"Call me when you get home.","example[22]":"When I got here, the place was empty.","display[0]":"while","definition[7]":"during the time that something is happening – used to emphasize that something is continuing","example[23]":"I’ll make the salad while you set the table.","example[24]":"While we were on holiday, our house was burgled.","display[1]":"whenever","definition[8]":"used in order to emphasize that something always happens when another thing happens","example[25]":"He visits his mother whenever he can.","example[26]":"You can come and talk to me whenever you have a problem.","display[2]":"by the time","definition[9]":"used in order to say that one thing has or will have already happened when something else happens","example[27]":"By the time a child is five, he will have watched hundreds of hours of television."}