{"word[0]":"research","plural[0]":"researches","definition[0]":"serious study of a subject, in order to discover new facts or test new ideas","example[0]":"Gould was helped in his researches by local naturalists.","example[1]":"research into the causes of cancer","note[0]":"research into/on","definition[1]":"the activity of finding information about something that you are interested in or need to know about","example[2]":"It’s a good idea to do some research before you buy a house.","collocation[0]":"do/carry out research","example[3]":"The research was carried out by a team of scientists at Edinburgh University.","example[4]":"Little research has been conducted into the subject.","collocation[1]":"undertake research","example[5]":"They are planning to undertake research into the genetic causes of the disease.","collocation[2]":"scientific research","example[6]":"Our conclusions are based on scientific research.","collocation[3]":"medical research","example[7]":"The charity raises money for medical research.","collocation[4]":"historical research","example[8]":"This is a fascinating piece of historical research.","collocation[5]":"basic research","example[9]":"He wants to conduct basic research into the nature of human cells.","collocation[6]":"extensive research","example[10]":"Extensive research has proved the theory wrong.","collocation[7]":"painstaking research","example[11]":"She spent years carrying out painstaking historical research.","collocation[8]":"pioneering research","example[12]":"Watson did pioneering research on the long-term effects of dieting.","form[0]":"research + NOUN","collocation[9]":"a research project/programme","example[13]":"The research project will be funded by the Medical Research Council.","collocation[10]":"research findings","example[14]":"He will present his research findings at the conference.","collocation[11]":"research work","example[15]":"Doctor Fox received world-wide acclaim for her research work on breast cancer.","collocation[12]":"a research team","example[16]":"The professor will head a research team working on the effects of climatic change on agriculture.","collocation[13]":"a research student","example[17]":"He supervised many research students.","collocation[14]":"a research grant","example[18]":"Have you applied for a research grant?","collocation[15]":"an area/field of research","example[19]":"This is a very exciting area of research.","collocation[16]":"a piece of research","example[20]":"A recent piece of research shows why marriages break up.","collocation[17]":"a body of research","example[21]":"There is a large body of research which indicates that passive smoking causes cancer.","definition[2]":"careful detailed work that is done in order to find out more about a subject, especially as a part of a scientific or academic project","example[22]":"Billions of dollars have been spent on research into the causes and treatment of cancer.","example[23]":"The University has for a long time been a leading centre for research in this field.","definition[3]":"the studies that have been done on a particular subject","example[24]":"Faraday is famous for his work on electricity.","example[25]":"A lot of work has been done on hydrogen-powered cars.","example[26]":"Their work had an enormous influence on the study of genetics.","display[0]":"study","definition[4]":"a piece of work in which someone examines a particular subject in order to find out more about it, and writes about what they have found","example[27]":"The study showed that 25 percent of adults do not eat breakfast at all, compared with 14 percent in 1961.","example[28]":"Recent studies suggest that our sense of smell is closely linked with the part of the brain that deals with memory.","display[1]":"experiment","definition[5]":"a scientific test in order to find out what happens when you do something","example[29]":"They carried out a series of experiments (=they did a series of experiments) in order to try to prove their theory.","example[30]":"Experiments have shown that there is an increased risk of some forms of cancer.","definition[6]":"to study a subject in detail, especially in order to discover new facts or test new ideas","example[31]":"He’s been researching material for a documentary.","example[32]":"Ten years ago I began researching into the role of women in trade unions.","note[1]":"research into","explanation[0]":"In everyday English, people often use the expression do research rather than the verb to research:","example[33]":"She’s been doing some research into the history of the area.","definition[7]":"to get all the necessary facts and information for something","example[34]":"This book has been very well researched.","definition[8]":"study of a subject to find out new things about it or to test new ideas, products etc","example[35]":"A leading pharmaceutical company will finance the research.","example[36]":"What sets us apart from the rest of the industry is that we do research on our products to prove our claims.","definition[9]":"an organization or department where new ideas and products are developed, tested etc","example[37]":"a research centre to test US-made Honda parts","example[38]":"These studies were conducted in more than 160 independent universities and research institutions in 23 countries."}