{"past_tense[0]":"became","definition[0]":"to start to have a feeling or quality, or to start to develop into something","example[0]":"The weather became warmer.","example[1]":"Slowly my eyes became accustomed to the darkness.","example[2]":"Helen became increasingly anxious about her husband’s strange behaviour.","example[3]":"Pollution from cars has become a major problem.","definition[1]":"to start to have a job or position","example[4]":"George became king at the age of 54.","example[5]":"When did you first want to become a teacher?","definition[2]":"to be suitable for someone, or to look attractive on them","synonym[0]":"suit","example[6]":"Blue really becomes her.","example[7]":"Don’t try to be clever – it doesn’t become you.","explanation[0]":"Become is a linking verb This type of verb links the subject of the sentence with an adjective or noun","example[8]":"It became more difficult","example[9]":"She hoped to become a lawyer","example[10]":"His parents became worried when he was late home from school.","example[11]":"Violent crime is becoming a major problem.","example[12]":"She became more confident when she joined a drama group.","definition[3]":"to start to have a feeling or quality. Get  is less formal than become and is much more commonly used in everyday English","example[13]":"I was getting very tired.","example[14]":"Make sure you’re home before it gets dark.","display[0]":"go","definition[4]":"to become something – used about things becoming a different colour, or things or people becoming worse in some way","example[15]":"Her hair was going grey.","example[16]":"He went blind.","example[17]":"I think I’m going mad.","display[1]":"turn","definition[5]":"to become something – used about things becoming a different colour, or the weather or people’s behaviour changing","example[18]":"The water had turned bright green.","example[19]":"The weather is expected to turn cold again.","example[20]":"He suddenly turned nasty.","display[2]":"grow","definition[6]":"to gradually become something","example[21]":"People were growing impatient.","example[22]":"The rich grew richer.","display[3]":"come undone/loose/apart","definition[7]":"to become undone, loose, or separated into pieces","example[23]":"The screws had come loose.","display[4]":"change into something","definition[8]":"to become something completely different","example[24]":"The caterpillar changed into a beautiful butterfly."}