{"word[0]":"continue","definition[0]":"to not stop happening, existing, or doing something","example[0]":"He will be continuing his education in the US.","example[1]":"I felt too sick to continue.","example[2]":"The flood of refugees continued unabated.","note[0]":"continue unabated/apace/unchecked","example[3]":"Sheila continued to work after she had her baby.","note[1]":"continue to do something","example[4]":"He was permitted to continue with his work while in prison.","note[2]":"continue with","example[5]":"The strike continued for another four weeks.","note[3]":"continue for","example[6]":"Most elderly people want to continue living at home for as long as they can.","note[4]":"continue doing something","definition[1]":"to start again, or start doing something again, after an interruption","synonym[0]":"resume","example[7]":"After a brief ceasefire, fighting continued.","example[8]":"Rescue teams will continue the search tomorrow.","example[9]":"He picked up his book and continued reading.","definition[2]":"to go further in the same direction","example[10]":"We continued along the road for some time.","note[5]":"continue down/along/into etc","example[11]":"The road continues northwards to the border.","definition[3]":"to stay in the same job, situation etc","example[12]":"Miss Silva will continue as publishing director.","note[6]":"continue as","definition[4]":"to say more after an interruption","example[13]":"‘And so, ’ he continued, ‘we will try harder next time.’","heading[0]":"to continue doing something","definition[5]":"to not stop doing something that you are already doing","example[14]":"We need the money to continue our work.","example[15]":"They continued arguing for a long time.","example[16]":"Despite all the warnings, many people continue to smoke.","example[17]":"Sometimes she just couldn’t see the point of continuing.","example[18]":"My teacher advised me to continue with my studies.","definition[6]":"to continue doing something. Go on is less formal than continue, and is the phrase that people usually use in everyday English","example[19]":"Dan went on talking but she was no longer listening.","example[20]":"He carried on with his day job.","example[21]":"Sheehan has carried on with her campaign.","display[0]":"keep (on) doing something","definition[7]":"to continue doing something for a long time – especially so that you feel tired or annoyed","example[22]":"We kept on walking until we got to the top of the hill.","example[23]":"The man kept staring at me.","display[1]":"persevere","definition[8]":"to continue trying to do something in a very patient and determined way, in spite of difficulties. Persevere sounds rather formal","example[24]":"He didn’t know any English, but he persevered and became a good student.","example[25]":"Her health was rapidly declining but she persevered with her duties.","example[26]":"Stevenson persevered in his efforts to discover what had really happened.","example[27]":"Children today seem less willing to seek out challenges and persevere in the face of adversity.","heading[1]":"to continue to happen","definition[9]":"to happen without stopping","example[28]":"The good weather seems likely to continue.","example[29]":"Unless there are serious negotiations, the fighting will continue.","example[30]":"Some people have lost work, and this will continue to happen until the computer system is fixed.","example[31]":"The review process is expected to continue for several weeks.","display[2]":"last","definition[10]":"to continue – use this to say how long something continues for","example[32]":"I know my good luck won’t last forever.","example[33]":"It’s not certain how long the ceasefire will last.","example[34]":"The trial lasted for six days.","example[35]":"The meeting lasted until lunchtime.","example[36]":"The training period lasted from July 2 to August 25.","definition[11]":"to continue, especially for a long time","example[37]":"Disputes between neighbours can go on for years.","display[3]":"carry on","definition[12]":"to continue, especially when there are problems","example[38]":"The game carried on despite the injury of two players.","display[4]":"drag on","definition[13]":"to continue for much longer than necessary or for longer than you want","example[39]":"The meeting dragged on for another hour.","example[40]":"The talks dragged on, with no apparent hope of achieving a peaceful solution.","display[5]":"persist","definition[14]":"if something bad persists, it continues to exist or happen","example[41]":"See your doctor if the symptoms persist.","example[42]":"If adverse weather conditions persist, the game will be cancelled."}