{"word[0]":"ask","signpost[0]":"question","definition[0]":"to speak or write to someone in order to get an answer, information, or a solution","example[0]":"‘What’s your name?’ she asked.","example[1]":"Don’t ask him – he won’t know.","example[2]":"That kid’s always asking awkward questions.","example[3]":"I asked him where he lived.","note[0]":"ask who/what/where etc","example[4]":"We’ll have to ask someone the way to the station.","note[1]":"ask somebody something","example[5]":"Go and ask Tom whether he’s coming tonight.","note[2]":"ask somebody if/whether","example[6]":"Visitors usually ask about the history of the castle.","note[3]":"ask (somebody) about something","example[7]":"I’ll ask around, see if I can find you a place to stay.","note[4]":"ask around","signpost[1]":"for help/advice etc","definition[1]":"to make a request for help, advice, information etc","example[8]":"If you need anything, you only have to ask.","example[9]":"Ask John to mail those letters tomorrow.","note[5]":"ask somebody to do something","example[10]":"Karen asked to see the doctor.","note[6]":"ask to do something","example[11]":"Some people find it difficult to ask for help.","note[7]":"ask for","example[12]":"He repeatedly asked Bailey for the report.","note[8]":"ask somebody for something","example[13]":"Ask your mom if you can come with us.","note[9]":"ask (somebody) if/whether you can do something","example[14]":"Was it too much to ask that he be allowed some privacy?","note[10]":"ask that","signpost[2]":"price","definition[2]":"to want a particular amount of money for something you are selling","example[15]":"How much is he asking?","example[16]":"They’re asking a fortune for that house.","example[17]":"He’s asking £2,000 for his car.","note[11]":"ask $50/$1,000 etc for something","type[0]":"transitive usually + adverb/preposition","signpost[3]":"invite","definition[3]":"to invite someone to your home, to go out with you etc","example[18]":"Let’s ask them to have dinner with us some time.","example[19]":"Jerry’s too scared to ask her out.","note[12]":"ask somebody out","example[20]":"Don’t leave them standing on the doorstep – ask them in!","note[13]":"ask somebody in","example[21]":"We must ask our new neighbours over for a drink.","note[14]":"ask somebody over/round","signpost[4]":"demand","definition[4]":"if you ask something of someone, you want them to do it for you","example[22]":"It would be better if he cooperated, but perhaps I’m asking too much.","example[23]":"You have no right to ask anything of me.","note[15]":"ask something of somebody","example[24]":"Expecting the children to do an hour’s homework after school is asking a lot of them.","heading[0]":"– Meaning 2: to make a request for help, advice, information etc","collocation[0]":"ask for help","example[25]":"Don’t be afraid to ask for help.","collocation[1]":"ask for assistance","example[26]":"You can call this number to ask for assistance.","collocation[2]":"ask for advice/ask somebody’s advice","example[27]":"If you are in any doubt, ask for advice.","collocation[3]":"ask for information","example[28]":"I wrote asking for information about language classes.","collocation[4]":"ask for directions","example[29]":"At the station he asked for directions to the museum.","collocation[5]":"ask for details","example[30]":"Please ask for details of the full range of tickets available.","collocation[6]":"ask for somebody’s opinion","example[31]":"Dad always liked being asked for his opinion.","collocation[7]":"ask for somebody’s support","example[32]":"Labour councillors asked for our support for the proposal.","collocation[8]":"ask for permission","example[33]":"The two men entered without bothering to ask for permission.","collocation[9]":"ask for an explanation","example[34]":"When he asked for an explanation, no one could give him an answer.","heading[1]":"GRAMMAR: Patterns with ask","explanation[0]":"You ask someone something","example[35]":"They asked me some difficult questions at the interview","bad_example[0]":"ask to someone","explanation[1]":"You  ask someone to do something","example[36]":"I asked him to open the window","explanation[2]":"You ask someone if or whether something is true","example[37]":"Ask them if they want anything to drink","explanation[3]":"When you report what someone asked, use a verb in the past tense","example[38]":"She asked if I wanted to go","bad_example[1]":"She asked if I want to go","heading[2]":"ask a question","definition[5]":"to speak or write to someone to get an answer","example[39]":"Did you ask about the price?","example[40]":"They asked me a lot of questions.","display[0]":"inquire/enquire","definition[6]":"to ask someone for information about something","example[41]":"I’m writing to inquire about the job that was advertised in yesterday’s ‘Times’.","definition[7]":"to ask a question in a firm or angry way","example[42]":"‘Why didn’t you call me?’, she demanded.","display[1]":"interview","definition[8]":"to ask someone questions, to find out if they are suitable for a job, or as part of a television or radio interview","example[43]":"When they interviewed me for the job, they didn’t mention the salary.","example[44]":"David Letterman has interviewed all the stars.","display[2]":"poll","definition[9]":"to officially ask a lot of people in order to find out their opinion on something","example[45]":"Over 1,000 people were polled for the report.","example[46]":"64% of the people we polled said that they approved of the way the government had handled the crisis.","heading[3]":"to ask someone about a crime","display[3]":"question/interview","definition[10]":"to ask someone a lot of questions in order to get information about a crime","example[47]":"He was arrested and questioned by the police.","example[48]":"Detectives are interviewing the father of the missing girl.","display[4]":"interrogate","definition[11]":"to ask someone a lot of detailed questions, often in an aggressive way","example[49]":"The men were interrogated by the US authorities for over six hours.","display[5]":"cross-examine","definition[12]":"to ask someone questions in court about the statements they made","example[50]":"A second lawyer began to cross-examine the witness.","display[6]":"somebody is helping the police with their inquiries","definition[13]":"used in news reports when saying that the police are asking someone questions about a crime – especially when they think this person is guilty, but have not yet charged them","example[51]":"He is helping the police with their inquiries in connection with the murder of Diane Jones.","heading[4]":"to ask for something","definition[14]":"to tell someone you want them to give you something","example[52]":"I’m going to ask for a pay rise.","definition[15]":"to ask for food or drink in a restaurant","example[53]":"We ordered some more coffee.","example[54]":"Have you ordered yet?","definition[16]":"to ask for something in a firm way, insisting that someone gives you what you ask for","example[55]":"They’re demanding immediate payment.","example[56]":"If the goods are faulty, you can demand a refund.","display[7]":"request","example[57]":"The pilot requested permission to land.","example[58]":"I enclose the information you requested.","display[8]":"beg/plead","definition[17]":"to ask for something in an urgent way, because you want it very much and will be very unhappy if you do not get it","example[59]":"He begged me for some money.","example[60]":"I’m not going to plead for forgiveness.","display[9]":"nag/pester","definition[18]":"to keep asking someone for something, in an annoying way","example[61]":"She keeps nagging me for a new phone.","example[62]":"People were pestering him for his autograph.","definition[19]":"if someone is asking a particular price for something, that is the price at which they are selling it","example[63]":"How much are they asking for their house?","note[16]":"ask something for something","definition[20]":"to make someone leave their job","synonym[0]":"dismiss","example[64]":"The previous manager was asked to leave, after it was found that he had been misusing company funds."}