{"signpost[0]":"make somebody/something do what you want","definition[0]":"the ability or power to make someone or something do what you want or make something happen in the way you want","example[0]":"The disease robs you of muscle control.","example[1]":"Artists like to have some control over where their works are hung in a gallery.","example[2]":"She’s a good teacher who has control of her class.","example[3]":"Students are encouraged to take control of their own learning, rather than just depending on the teacher.","example[4]":"Excessive drinking can make you lose control of your own life.","example[5]":"‘Do you need any help?’ ‘No. It’s under control, thanks.’","example[6]":"Dogs are allowed on the trails if they are kept under control.","example[7]":"The car spun out of control and hit a tree.","example[8]":"Flight delays do occur, for reasons that are outside our control.","example[9]":"Babies are born with very little control over their movements.","note[0]":"control of/over","signpost[1]":"power","definition[1]":"the power to make the decisions about how a country, place, company etc is organized or what it does","example[10]":"The press was freed from political control.","example[11]":"By the end of the year, the rebels had control over the northern territories.","example[12]":"The Johnson family has effective control of the company, owning almost 60% of the shares.","example[13]":"China gained control of the island in 1683.","example[14]":"His son is being trained to take control of the family business.","example[15]":"The Democrats lost control of Congress in the last election.","example[16]":"The Conservatives are hoping to regain control of the city council.","example[17]":"Jordan asked for editorial control of the project.","note[1]":"control of","example[18]":"Anti-government forces are still in control of the area.","note[2]":"in control (of something)","example[19]":"The college was under the control of a group of trustees.","note[3]":"under the control of somebody","example[20]":"The whole of this area came under Soviet control after World War II.","signpost[2]":"way of limiting something","definition[2]":"an action, method, or law that limits the amount or growth of something, especially something that is dangerous","example[21]":"pest control","example[22]":"an agreement on arms control (=control of the amount of weapons a country has)","example[23]":"Police used fire hoses and dogs for crowd control.","example[24]":"Rent controls ensured that no one paid too much for housing.","note[4]":"rent/price/wage etc controls","example[25]":"the introduction of tighter controls on immigration","note[5]":"tight/rigid controls","example[26]":"the control of inflation","example[27]":"The authorities imposed strict controls on the movement of cattle.","note[6]":"control on","example[28]":"Firefighters had the blaze under control by 9:44 p.m.","note[7]":"under control","example[29]":"Shea used diet and exercise to bring her weight under control.","example[30]":"The Federal Reserve Bank raised interest rates to keep inflation under control.","signpost[3]":"ability to stay calm","definition[3]":"the ability to remain calm even when you feel very angry, upset, or excited","example[31]":"There were sudden tears in his eyes and he paused, fighting for control.","example[32]":"Davidson lost control of himself and started yelling.","example[33]":"Small children can’t be expected to have the same self-control (=ability to control their emotions and behaviour) as an adult.","example[34]":"Her voice is under control, but she is almost shaking with anger.","example[35]":"I felt calm and in control.","note[8]":"in control","signpost[4]":"machine/vehicle","definition[4]":"the thing that you press or turn to make a machine, vehicle, television etc work","example[36]":"the TV remote control","example[37]":"the volume control on the radio","example[38]":"a car with manual controls","example[39]":"Belton, at the controls, made a perfect landing.","note[9]":"at the controls","signpost[5]":"people who organize an activity","definition[5]":"the people who direct an activity or who check that something is done correctly, the place where this is done, or the process of doing it","example[40]":"air-traffic control","example[41]":"Please stop at passport control.","example[42]":"computers used for stock control","signpost[6]":"scientific test","definition[6]":"a person, group etc against which you compare another person or group that is very similar, in order to see if a particular quality is caused by something or happens by chance","example[43]":"A control group of non-smoking women was compared to four groups of women smokers.","note[10]":"control group/population/sample etc","definition[7]":"a thing that you already know the result for that is used in a scientific test, in order to show that your method is working correctly","definition[8]":"a particular button on a computer that allows you to do certain operations","example[44]":"Press control and F2 to exit.","definition[9]":"to have the power to make the decisions about how a country, place, company etc is organized or what it does","note[11]":"Labour-/Republican-/Democrat- etc controlled","example[45]":"The Democrats continued to control the Senate until last year.","example[46]":"a huge company controlling half the world’s coffee trade","definition[10]":"to limit the amount or growth of something, especially something that is dangerous","example[47]":"a chemical used to control weeds","example[48]":"an economic plan to control inflation","example[49]":"Development in areas of outstanding natural beauty is strictly controlled.","example[50]":"Strict measures were taken to control the spread of foot and mouth disease.","definition[11]":"to make someone or something do what you want, or make something happen in the way that you want","example[51]":"Police had to be called in to control the crowds.","example[52]":"a skilled rider controlling a spirited horse","definition[12]":"if you control your emotions, your voice, your expression etc, you succeed in behaving calmly and sensibly, even though you feel angry, upset, or excited","example[53]":"Sarah took a deep breath, trying to control her anger.","example[54]":"He controlled the urge to laugh.","example[55]":"Newman controlled himself with an effort.","note[12]":"control yourself","signpost[7]":"machine/process/system","definition[13]":"to make a machine, process, or system work in a particular way","example[56]":"a radio-controlled toy car","example[57]":"A thermostat controls the temperature in the building.","example[58]":"The valves in the heart control how quickly the blood is pumped around the body.","note[13]":"control how/what/which etc","signpost[8]":"check something","definition[14]":"to make sure that something is done correctly","synonym[0]":"check","example[59]":"The company strictly controls the quality of its products.","definition[15]":"to have power over a country, place, company etc, and decide what happens there","example[60]":"The Democrats controlled the US Congress.","example[61]":"Government forces now control the city.","definition[16]":"to make the important everyday decisions concerning a company, organization, country etc, so that it can continue to operate","example[62]":"He runs a software company in New York.","example[63]":"The parents want to run the school themselves.","example[64]":"The government is unfit to run the country.","example[65]":"The charity runs a medical clinic in one of the poorest parts of the city.","display[0]":"be in charge of somebody/something","definition[17]":"to have control over something, or responsibility for a group of people","example[66]":"She is in charge of training new employees.","example[67]":"I left him in charge of the children while I was out.","display[1]":"manage","definition[18]":"to be in charge of a company, especially one that someone else owns","example[68]":"In 1963, she opened a furniture store, and her son has managed it since 1985.","display[2]":"be in power","definition[19]":"if a group or leader is in power, they have political control of a country","example[69]":"Abe resigned after less than a year in power.","example[70]":"It was the first time a democratically elected government had been in power.","display[3]":"rule","definition[20]":"if a leader or political group rules a country, they have political control of that country","example[71]":"President Assad ruled the country for almost 30 years.","example[72]":"The same party has ruled Japan for many years.","display[4]":"supervise","definition[21]":"to be in charge of a group of workers or students and make sure that they do their work properly","example[73]":"Professor Braude supervised the research team.","example[74]":"He’s supervising the building work.","definition[22]":"an action taken to make sure that something does not increase too much","example[75]":"Devaluations were combined with wage and price controls and reductions in state spending.","example[76]":"Private rented accommodation has been freed of rent controls, taking it beyond the reach of the young homeless.","definition[23]":"if someone has control of shares in a company, they own them","example[77]":"Krupp said it had control of other blocks of Hoesch shares.","definition[24]":"if someone has control of a company, they own more than half its shares, or enough shares to be able to decide how the company is managed","example[78]":"CFS and Mr Vernes were battling for control of the Victoire insurance group.","example[79]":"Publicis purchased a little over 50% of Inovasi to gain control.","example[80]":"India is to sell stakes in state-owned companies to overseas investors while retaining majority control.","definition[25]":"a button on a computer that allows you to do operations when used with another button","example[81]":"Press control D to delete text.","definition[26]":"to have the power to make someone or something do what you want","example[82]":"U.S. offices of foreign banks now control roughly a quarter of U.S. banking assets.","example[83]":"The government controls the production and distribution of all national newspapers.","definition[27]":"to limit something or prevent it from increasing too much","example[84]":"To help control costs, the company cut salaries by between 2% and 25% last month.","example[85]":"Romania will control skyrocketing food prices by setting ceilings for items such as meat.","example[86]":"new measures to control inflation","definition[28]":"to check that something is as it should be","example[87]":"Checkers control the quality of products as they come off the production line.","definition[29]":"to own shares","example[88]":"Mr Kahn now controls 854,236 common shares, or about 40% of Mercury’s stock.","definition[30]":"to own more than half the shares of a company, or enough shares to decide how the company should be managed","example[89]":"The Agnelli family controls the car group through a variety of holding companies.","definition[31]":"if a company or product controls a particular part of a market, its products account for a large amount of the sales in that market","example[90]":"De Beers controls 80% of the rough, uncut diamond market."}