{"word[0]":"reward","definition[0]":"something that you get because you have done something good or helpful or have worked hard","example[0]":"The school has a system of rewards and punishments to encourage good behaviour.","example[1]":"Parents often give their children rewards for passing exams.","note[0]":"reward for (doing) something","definition[1]":"money that is offered to people for helping the police to solve a crime or catch a criminal","example[2]":"A reward of $20,000 has been offered.","note[1]":"reward of","example[3]":"a reward for information leading to the capture of the murderers","note[2]":"reward for","heading[0]":"– Meaning 1: something that you get because you have done something good or helpful or have worked hard","collocation[0]":"great/big/high","example[4]":"The rewards for those who invested at the right time are high.","example[5]":"Some athletes took drugs because the rewards were great and they thought they could get away with it.","collocation[1]":"little reward","example[6]":"They have to work very hard for very little reward.","collocation[2]":"financial/economic reward","example[7]":"It’s a difficult job, but the financial rewards are considerable.","example[8]":"I’m not doing it for monetary reward.","collocation[3]":"material rewards","example[9]":"They think money and material rewards are more important than quality of life.","collocation[4]":"tangible rewards","example[10]":"The prize motivates people by offering them the prospect of a tangible reward for their efforts.","collocation[5]":"rich rewards","example[11]":"Top athletes can expect rich rewards if they win.","collocation[6]":"personal reward","example[12]":"I admire people who help the poor for no personal reward.","collocation[7]":"get/receive your reward","example[13]":"If you work hard, you will get your reward.","collocation[8]":"reap rewards","example[14]":"She is now reaping the rewards of all her hard work.","collocation[9]":"bring rewards","example[15]":"Winning the title brings huge financial rewards.","collocation[10]":"deserve a reward","example[16]":"The team have worked really hard and deserve some reward.","heading[1]":"– Meaning 2: money that is offered to people for helping the police to solve a crime or catch a criminal","collocation[11]":"offer a reward","example[17]":"The store has offered a £500 reward for information leading to a conviction.","collocation[12]":"claim a reward","example[18]":"He contacted the police, hoping to claim the reward money offered by the bank.","collocation[13]":"a £10,000/$500 etc reward","example[19]":"The $100,000 reward Levitz’s family offered in the days after her disappearance still stands.","collocation[14]":"a large/substantial reward","example[20]":"Despite a substantial reward being offered, the painting has never been found.","form[0]":"reward + NOUN","collocation[15]":"reward money","example[21]":"'Anyone who gives me the information that leads to an arrest will get the reward money, ' he repeated.","definition[2]":"to give something to someone because they have done something good or helpful or have worked for it","example[22]":"The club’s directors rewarded him with a free season ticket.","note[3]":"reward somebody with something","example[23]":"She wanted to reward the cleaners for their efforts.","note[4]":"reward somebody for (doing) something","example[24]":"He gave the children some chocolate to reward them for behaving well.","definition[3]":"something that you receive because you have done something good or helpful","example[25]":"Officials were often posted abroad as a reward for loyal service.","definition[4]":"money that you earn for doing a job or providing a service","example[26]":"Working as a lawyer can bring big financial rewards.","example[27]":"Her success has brought her little commercial reward.","example[28]":"the economic rewards that come with tourism","definition[5]":"money earned by an investment","example[29]":"Investors are hoping for big rewards.","example[30]":"It has reaped huge rewards (=gained them) in the stock market.","definition[6]":"an amount of money offered to someone in return for some information about something","example[31]":"The bank is offering a £100,000 reward for information.","definition[7]":"to give someone something such as money because they have done something good or helpful","example[32]":"a bonus system that rewards workers who meet targets","example[33]":"The best managers are rewarded with greater responsibility."}