{"word[0]":"praise","definition[0]":"to say that you admire and approve of someone or something, especially publicly","note[0]":"praise somebody/something to the skies (=praise someone or something very much)","example[0]":"Jane was praised by her teacher.","example[1]":"a highly praised novel","example[2]":"The mayor praised the rescue teams for their courage.","note[1]":"praise somebody/something for (doing) something","definition[1]":"to give thanks to God and show your respect to Him, especially by singing in a church","example[3]":"The film was praised by the critics when it first came out.","example[4]":"The report praises staff in both schools.","example[5]":"It’s important to praise children.","display[0]":"congratulate","definition[2]":"to tell someone that you think it is good that they have achieved something","example[6]":"I congratulated him on his success.","example[7]":"The government should be congratulated for what they have achieved.","display[1]":"compliment","definition[3]":"to say to someone that you like how they look, or you like something they have done","example[8]":"She complimented me on my new hairstyle.","example[9]":"He complimented my cooking.","display[2]":"flatter","definition[4]":"to praise someone in order to please them or get something from them, even though you do not mean it","example[10]":"He had persuaded her to buy it by flattering her and being charming.","example[11]":"You’re just flattering me!","display[3]":"rave about something","definition[5]":"to talk about something you enjoy or admire in an excited way, and say that it is very good. Rave is rather informal, whereas enthuse is much more formal and is used mainly in written English","example[12]":"Everyone is raving about the movie.","example[13]":"She enthused about the joys of motherhood.","display[4]":"applaud","definition[6]":"to publicly praise a decision, action, idea etc","example[14]":"Business leaders applauded the decision.","example[15]":"A spokesperson applauded the way the festival had been run.","display[5]":"commend","definition[7]":"to praise someone or something, especially officially","example[16]":"After the battle, Andrew Jackson commended him for ‘his courage and fidelity’.","example[17]":"The officers should be commended for their prompt action.","display[6]":"hail somebody/something as something","definition[8]":"to describe someone or something in a way that shows you have a very good opinion of them, especially in newspapers, on television reports etc","example[18]":"The book was hailed as a masterpiece.","example[19]":"Journalists and music writers hailed the band as ‘the next big thing’.","example[20]":"He is being hailed as the new James Dean.","definition[9]":"words that you say or write in order to praise someone or something","opposite[0]":"criticism","example[21]":"It's important to give children plenty of praise and encouragement.","example[22]":"Her teacher was full of praise for her work.","example[23]":"His first novel received high praise.","example[24]":"Gregory was singled out  (= he was chosen in particular) for  special praise.","example[25]":"The film has won praise from audiences and critics alike.","example[26]":"He wrote a poem in praise of his hero.","note[2]":"in praise of somebody/something","definition[10]":"the expression of respect and thanks to God","example[27]":"Let us give praise unto the Lord.","example[28]":"songs of praise","collocation[0]":"give somebody praise","example[29]":"Give your dog plenty of praise when it behaves well.","collocation[1]":"get praise","example[30]":"His actions did not get the praise they deserved.","collocation[2]":"win/earn/receive praise","example[31]":"The trade deal won praise from the American business community.","collocation[3]":"deserve praise","example[32]":"She deserves praise for all the charity work she does.","collocation[4]":"be singled out for praise","example[33]":"His work was singled out for praise by the examiners.","collocation[5]":"heap/lavish praise on somebody","example[34]":"Ireland's manager has heaped praise on his team.","collocation[6]":"shower somebody with praise","example[35]":"Taiwan's media lately showered praise on Li Yundi, the 18-year-old piano prodigy.","collocation[7]":"high praise","example[36]":"The film won high praise from critics and audiences alike.","collocation[8]":"special praise","example[37]":"My sister was constantly singled out for special praise.","collocation[9]":"lavish praise","example[38]":"United’s captain received lavish praise from his manager.","collocation[10]":"faint praise","example[39]":"He wins faint praise as ‘the only candidate with a grain of sense’.","collocation[11]":"be full of praise for somebody","example[40]":"Captain Jones was full of praise for his men.","collocation[12]":"have nothing but praise for somebody/something","example[41]":"Passengers had nothing but praise for the pilot.","collocation[13]":"words of praise","example[42]":"She still had some words of praise for her ex-husband’s wit and charm."}