{"word[0]":"house","plural[0]":"houses","signpost[0]":"where someone lives","definition[0]":"a building that someone lives in, especially one that has more than one level and is intended to be used by one family","note[0]":"move house British English (=leave your house and go to live in another one)","example[0]":"a four-bedroom house","example[1]":"Why don’t you all come over to our house for coffee?","example[2]":"every room in the house","note[1]":"in a house","example[3]":"We met at Alison’s house.","note[2]":"at somebody’s house","definition[1]":"all the people who live in a house","example[4]":"He gets up at six and disturbs the whole house.","definition[2]":"a large public building used for a particular purpose","definition[3]":"used in the names of large buildings, especially offices","example[5]":"the BBC television studios at Broadcasting House","definition[4]":"a building used for a particular purpose","definition[5]":"a group of people who make the laws of a country","note[3]":"the House of Commons/Lords/Representatives/Assembly","example[6]":"The president will address both houses of Congress.","example[7]":"the Speaker of the House","signpost[1]":"company","definition[6]":"a company, especially one involved in a particular area of business","example[8]":"America’s oldest publishing house","example[9]":"a small independent software house","example[10]":"an auction house","example[11]":"a famous Italian fashion house","signpost[2]":"theatre","definition[7]":"the part of a theatre, cinema etc where people sit","example[12]":"The show has been playing to full houses.","example[13]":"The house was half empty.","example[14]":"The house lights went down and the music started.","definition[8]":"the people who have come to watch a performance","example[15]":"The show has been playing to packed houses since it opened.","note[4]":"full/packed/empty house","definition[9]":"in some schools, one of the groups that children of different ages are divided into to compete against each other, for example in sports competitions","signpost[3]":"royal family","definition[10]":"an important family, especially a royal family","example[16]":"the House of Windsor","definition[11]":"house music","collocation[0]":"live in a house","example[17]":"They live in a really big house in Hampstead.","collocation[1]":"buy a house","example[18]":"We bought this house when Liam was just a baby.","collocation[2]":"rent a house","example[19]":"While he was working in London, Ken rented a house in Fulham.","collocation[3]":"sell a house","example[20]":"We decided to sell the house and move back to Seattle.","collocation[4]":"put your house on the market","example[21]":"They put the house on the market and began looking for an apartment.","collocation[5]":"move into/out of a house","example[22]":"We’re moving into our new house next week.","collocation[6]":"build a house","example[23]":"They’re building a house on land overlooking Galway Bay.","collocation[7]":"put up a house","example[24]":"I think they’ve ruined the village by putting up these new houses.","collocation[8]":"renovate a house","example[25]":"He makes money by renovating old houses and selling them on.","collocation[9]":"decorate a house","example[26]":"If we’re going to decorate the house, let’s get professionals in.","collocation[10]":"do up a house","example[27]":"We’ve been doing up the house bit by bit since we first moved in.","form[0]":"ADJECTIVES/NOUN + house","collocation[11]":"a private house","example[28]":"It was a residential neighborhood of private houses.","collocation[12]":"a rented house","example[29]":"She shares a rented house with three other students.","collocation[13]":"a council house","example[30]":"The rent rise is a blow to council house tenants.","collocation[14]":"a Georgian/Victorian/Edwardian etc house","example[31]":"They live in a lovely old Edwardian house with high ceilings.","form[1]":"house + NOUN","collocation[15]":"house prices","example[32]":"House prices have tripled over the last ten years.","collocation[16]":"a house owner","example[33]":"All house owners must pay council tax.","collocation[17]":"a house purchase","example[34]":"A solicitor can help you with the legal aspects of a house purchase.","collocation[18]":"house hunting","example[35]":"Have you had any success with your house hunting?","definition[12]":"a building that someone lives in, especially one that is intended for one family, person, or couple to live in","example[36]":"Annie and Rick have just bought their first house.","example[37]":"The price of houses is going up all the time.","display[0]":"detached house","definition[13]":"a house that is not joined to another house","example[38]":"a detached four-bedroomed house","display[1]":"semi-detached house","definition[14]":"a house that is joined to another house on one side","display[2]":"terraced house","definition[15]":"one of a row of houses that are joined together","display[3]":"townhouse","definition[16]":"one of a row of houses that are joined together. In British English, townhouse is often used about a large and impressive house in a fashionable area of a city","example[39]":"an 18th-century townhouse in Bath","display[4]":"cottage","definition[17]":"a small house in the country – used especially about houses in the UK","example[40]":"a little cottage in the country","example[41]":"a thatched cottage (=with a roof made of straw)","display[5]":"bungalow","definition[18]":"a small house that is all on one level","example[42]":"Bungalows are suitable for many elderly people.","display[6]":"country house","definition[19]":"a large house in the countryside, especially one that is of historical interest","example[43]":"The hotel was originally an Edwardian country house.","display[7]":"mansion","definition[20]":"a very large house","example[44]":"the family’s Beverly Hills mansion","display[8]":"mobile home","definition[21]":"a type of house that can be pulled by a large vehicle and moved to another place","display[9]":"ranch house","definition[22]":"a long narrow house that is all on one level","example[45]":"a California ranch house","display[10]":"duplex","definition[23]":"a house that is divided into two separate homes","heading[0]":"an apartment","display[11]":"apartment","definition[24]":"a set of rooms where someone lives that is part of a house or bigger building. In British English, people usually say flat. Apartment is used about large and expensive flats, or in advertisements","example[46]":"His apartment is on the eighth floor.","example[47]":"In London, I shared a flat with some other students.","display[12]":"condominium","definition[25]":"one apartment in a building with several apartments, owned by the people who live in them","example[48]":"a 10-unit condominium complex","heading[1]":"a group of houses","display[13]":"development","definition[26]":"a group of new houses or other buildings that are all planned and built together on the same piece of land","example[49]":"The site is to be used for a new housing development.","display[14]":"estate","definition[27]":"an area where a large group of houses have all been built together at the same time","example[50]":"She grew up on a council estate in Leeds.","definition[28]":"to provide someone with a place to live","example[51]":"The refugees are being housed in temporary accommodation.","note[5]":"house in","definition[29]":"if a building, place, or container houses something, it is kept there","example[52]":"the plastic case that houses the batteries","example[53]":"The collection is currently housed in the British Museum.","definition[30]":"a company, especially one that produces books, lends money, or designs clothes","example[54]":"the French fashion house, Yves Saint Laurent","definition[31]":"used in the names of some office buildings","definition[32]":"if work is done in house, it is done in a company’s offices by the company’s own staff. If work is done out of house, it is done outside the offices by people who are not directly employed by the company","example[55]":"We used to handle our advertising in house.","example[56]":"a team of out-of-house lawyers","definition[33]":"to try to make your business more PROFITABLE by getting rid of parts of the business or staff that are making you lose money","example[57]":"They have been clearing house before the relaunch of the company.","definition[34]":"provided free to a customer by a restaurant, bar etc"}