{"word[0]":"operate","definition[0]":"to use and control a machine or equipment","example[0]":"The Lewis family operated a number of boats on the canal.","example[1]":"Clive was experienced in operating the computers.","definition[1]":"if a machine operates in a particular way, it works in that way","example[2]":"Check that the equipment is operating in a safe manner.","note[0]":"operate in/at","example[3]":"The bus is designed to operate in all weather conditions.","example[4]":"Most freezers operate at below –18°C.","signpost[0]":"business/organization","definition[2]":"if a business or organization operates in a particular place or way, it works in that place or way","example[5]":"a design company operating from offices in Seattle","note[1]":"operate in/within/from","example[6]":"A playgroup operates on the campus.","example[7]":"They were trying to reduce operating costs.","definition[3]":"to control a business or organization","example[8]":"Nuns are operating an emergency hospital.","signpost[1]":"system/process/service","definition[4]":"if a system, process, or service operates, or if you operate it, it works","example[9]":"The whole tax system is now operating more efficiently.","example[10]":"The new law doesn’t operate in our favour.","example[11]":"The car parks operate a pay-as-you-leave system.","example[12]":"The bus company operates a Monday to Saturday service.","definition[5]":"to cut into someone’s body in order to repair or remove a part that is damaged","example[13]":"Doctors had to operate to remove the bullet.","example[14]":"the surgeon who operated on Taylor’s knee","note[2]":"operate on","definition[6]":"to do your job or try to achieve things in a particular way","example[15]":"Most people just can’t operate in noisy crowded conditions.","example[16]":"Older children often like to operate independently.","signpost[2]":"soldiers/police","definition[7]":"if soldiers or police officers are operating in an area, they are working in that area","example[17]":"Security patrols now operate in some of the most dangerous parts of the city.","note[3]":"operate in","example[18]":"enemy submarines operating in the Mediterranean","signpost[3]":"laws/principles","definition[8]":"to have an effect on something","example[19]":"the laws of evolution operating on each species","example[20]":"the software necessary to operate the machine","definition[9]":"if a machine, factory etc operates in a particular way, it works in that way","example[21]":"The factory will operate at half capacity for about two months.","definition[10]":"if a business, system etc operates in a particular way, it works in that way","example[22]":"differences between the way the two countries’ economies operate","example[23]":"The company will continue to operate as an independent subsidiary.","note[4]":"operate as","definition[11]":"if a business, system etc operates in or from a particular place, it is based there or offers goods or services from there","example[24]":"a discount chain operating in the Mid-Atlantic region","note[5]":"operate in/from/out of","example[25]":"a new airline operating out of St Petersburg","definition[12]":"if a person or organization operates a business, system etc, they manage it and make it work","example[26]":"He operates a trucking business in Norway.","example[27]":"the costs of operating the plant"}