{"word[0]":"deliver","signpost[0]":"take something somewhere","definition[0]":"to take goods, letters, packages etc to a particular place or person","example[0]":"The morning mail has just been delivered.","example[1]":"Do you deliver on Saturdays?","example[2]":"I’m having some flowers delivered for her birthday.","example[3]":"They set off to deliver supplies to an isolated village.","note[0]":"deliver something to somebody","signpost[1]":"do something you should do","definition[1]":"to do or provide the things you are expected to, because you are responsible for them or they are part of your job","example[4]":"the costs of delivering adequate nursing care","example[5]":"the failure of some services to deliver the goods (=do what they have promised)","example[6]":"The company will deliver on its promises.","definition[2]":"to help a woman give birth to her baby, or to give birth to a baby","example[7]":"They rushed her to hospital where doctors delivered her baby.","signpost[2]":"blow/shock etc","definition[3]":"to give something such as a blow, shock, or warning to someone or something","example[8]":"He delivered a strong warning about the dangers facing the government.","definition[4]":"to put someone into someone else’s control","example[9]":"Sharett had betrayed him and delivered him to the enemy.","note[1]":"deliver somebody to somebody","signpost[3]":"votes","definition[5]":"to get the votes or support of a particular group of people in an election","example[10]":"He cannot deliver the Latino vote.","signpost[4]":"make somebody free of something","definition[6]":"to help someone escape from something bad or evil","example[11]":"‘Deliver us from evil, ’ she prayed.","note[2]":"deliver somebody from something","definition[7]":"to take goods or mail to a place","example[12]":"An average of 52 tankers a day deliver 462 million gallons of crude oil, gasoline and other petroleum products to the U.S.","example[13]":"The new computers will be delivered next week.","definition[8]":"to provide or achieve something that other people benefit from","example[14]":"Since January 2005, the fund has delivered an annual return of 14.7%.","example[15]":"Good government can deliver a high level of services while maintaining fiscal discipline.","example[16]":"The question is whether the company can deliver on these commitments.","note[3]":"deliver on"}