{"word[0]":"lead","past_tense[0]":"led","type[0]":"intransitive, transitive usually + adverb/preposition","signpost[0]":"take somebody somewhere","definition[0]":"to take someone somewhere by going in front of them while they follow, or by pulling them gently","example[0]":"The manager led the way through the office.","example[1]":"A nurse took her arm and led her to a chair.","note[0]":"lead somebody to/into etc something","example[2]":"The horses were led to safety.","example[3]":"She was led away from the courtroom in tears.","note[1]":"lead somebody away/down etc","signpost[1]":"go in front","definition[1]":"to go in front of a line of people or vehicles","example[4]":"A firetruck was leading the parade.","signpost[2]":"be in charge","definition[2]":"to be in charge of an organization, country, or team, or a group of people who are trying to do something","example[5]":"He has led the party for over twenty years.","example[6]":"Some people say she is too old to lead the country (=be in charge of its government).","example[7]":"Beckham led his team to victory.","example[8]":"a man who was born to lead","example[9]":"a communist-led strike","example[10]":"The investigation will be led by Inspector Scarfe.","note[2]":"lead an investigation/inquiry/campaign","example[11]":"They are leading a campaign to warn teenagers about the dangers of drug abuse.","example[12]":"The rebellion was led by the King’s brother.","note[3]":"lead a revolt/rebellion/coup etc","example[13]":"Nelson preferred to lead the attack himself from the front.","note[4]":"lead an attack/assault","signpost[3]":"cause something to happen","definition[3]":"to cause something to happen or cause someone to do something","example[14]":"the events that led to the start of the First World War","note[5]":"lead to","example[15]":"A degree in English could lead to a career in journalism.","example[16]":"Her trusting nature often led her into trouble.","note[6]":"lead somebody into something","example[17]":"What led him to kill his wife?","note[7]":"lead somebody to do something","example[18]":"His actions could lead to him losing his job.","note[8]":"lead to somebody doing something","signpost[4]":"cause somebody to believe something","definition[4]":"to make someone believe something, especially something that is not true","example[19]":"Our research led us to the conclusion that the present system is unfair.","example[20]":"He had led everyone to believe that his family was very wealthy.","note[9]":"lead somebody to believe/expect/understand something","example[21]":"The hotel was terrible, and not at all what we had been led to expect.","signpost[5]":"influence","definition[5]":"to influence someone to make them do something that is wrong","example[22]":"He’s not a bad boy. He’s just easily led (=it is easy for other people to persuade him to do things that he should not do).","example[23]":"His brother led him into a life of crime.","signpost[6]":"be more successful","definition[6]":"to be more successful than other people, companies, or countries in a particular activity","example[24]":"US companies lead the world in biotechnology.","note[10]":"lead the world/market/pack/field","example[25]":"The Swedes have led the way in data protection.","note[11]":"lead the way","signpost[7]":"be winning","definition[7]":"to be winning a game, competition etc","opposite[0]":"lose","example[26]":"At half-time, Brazil led 1–0.","example[27]":"With 15 laps to go, Schumacher led the race.","example[28]":"The polls showed Obama leading Romney by 3 percent.","example[29]":"Nadal was leading by two sets.","note[12]":"lead by ten points/two goals etc","signpost[8]":"path/door etc","definition[8]":"used to say where a path, wire etc goes or what place is on the other side of a door","example[30]":"The path led down to a small lake.","note[13]":"lead to/towards","example[31]":"the major artery leading from the heart","note[14]":"lead from/out of","example[32]":"the door leading into the hallway","note[15]":"lead into","example[33]":"The riverside path leads visitors to a small chapel.","note[16]":"lead somebody to/into something","signpost[9]":"life","definition[9]":"if you lead a particular kind of life, that is what your life is like","note[17]":"lead a life of luxury/poverty etc","example[34]":"They lead a nomadic existence.","example[35]":"If the operation succeeds, Carly will be able to lead a normal life.","note[18]":"lead a normal/quiet/busy etc life","example[36]":"He has led a charmed life (=been very fortunate).","example[37]":"She now leads the life of a recluse.","note[19]":"lead the life of a ...","example[38]":"Joe had been leading a double life, seeing an ex-model while his wife believed he was on business.","note[20]":"lead a double life","signpost[10]":"discussion etc","definition[10]":"to control the way a discussion, conversation etc develops","example[39]":"I tried to lead the conversation back to the subject of money.","signpost[11]":"card game","definition[11]":"to play a particular card as your first card in one part of a card game","definition[12]":"to take a person or animal somewhere by going in front of them while they follow, or by pulling them gently","example[40]":"Rachel led Jo into the kitchen.","example[41]":"She was leading a horse, which seemed to have a bad leg.","definition[13]":"to take someone somewhere with you when you have the transport, know the way, are paying etc","example[42]":"I took her to see a film.","example[43]":"Matt’s taking me in his car.","display[0]":"guide","definition[14]":"to take someone through or to a place you know, showing them the way","example[44]":"Ali guided us through the streets to his house on the edge of the town.","definition[15]":"to take someone to a place such as a table in a restaurant or a hotel room and leave them there","example[45]":"A waitress showed us to our table.","example[46]":"We were shown to our seats near the front of the theatre.","definition[16]":"to show someone which direction to go using your hand or a sign","example[47]":"The sign back there pointed this way.","display[1]":"escort","definition[17]":"to take someone somewhere, protecting them, guarding them, or showing them the way","example[48]":"He was escorted from the court by police.","example[49]":"The president’s car will be escorted by a military convoy.","display[2]":"usher","definition[18]":"to show someone the way to a room or building nearby, usually as part of your job","example[50]":"His housekeeper ushered us into the living room.","display[3]":"shepherd","definition[19]":"to carefully take someone somewhere – used especially about a group of people","example[51]":"The police shepherded thousands of people to safety in the cathedral.","definition[20]":"to tell someone where to go or how to get somewhere","example[52]":"He directed us to a café a few blocks away.","example[53]":"Can you direct me to the station?","definition[21]":"the amount or distance by which one competitor is ahead of another","example[54]":"The Chicago Bulls had a narrow lead (=were winning by a small number of points).","example[55]":"The Socialists now have a commanding lead over their opponents.","note[21]":"lead over","definition[22]":"if someone follows someone else’s lead, they do the same as the other person has done","example[56]":"Other countries are likely to follow the U.S.'s lead.","example[57]":"The Government should give industry a lead in tackling racism  (=show what other people should do).","example[58]":"The black population in the 1960s looked to Ali for a lead (=looked to him to show them what they should do).","definition[23]":"a piece of information that may help you to solve a crime or mystery","synonym[0]":"clue","example[59]":"The police have checked out dozens of leads, but have yet to find the killer.","definition[24]":"the main acting part in a play, film etc, or the main actor","example[60]":"Powers was cast in the lead role (=he was chosen to play it).","example[61]":"the film’s romantic lead","example[62]":"He will play the lead role in ‘Hamlet’.","note[22]":"play the lead/the lead role","example[63]":"They were having trouble casting the female lead.","note[23]":"the male/female lead","definition[25]":"a piece of rope, leather, or chain for holding or controlling a dog","synonym[1]":"leash","example[64]":"All dogs must be kept on a lead.","note[24]":"on a lead","definition[26]":"a wire used to connect a piece of electrical equipment to the power supply","collocation[0]":"be in the lead","example[65]":"He was in the lead after the first lap of the race.","collocation[1]":"have the lead","example[66]":"He has a one-shot lead in the golf tournament.","collocation[2]":"take the lead","example[67]":"Lewis Hamilton has just taken the lead in the Monaco Grand Prix.","collocation[3]":"put somebody in the lead","example[68]":"Ronaldo’s goal put Portugal in the lead.","collocation[4]":"give somebody the lead","example[69]":"A goal in the 10th minute gave England the lead.","collocation[5]":"extend/increase/stretch somebody’s lead","example[70]":"The Australian rugby team extended its lead with a try from Stirling Mortlock.","collocation[6]":"throw away a lead","example[71]":"Arsenal threw away a two-goal lead.","collocation[7]":"blow a lead","example[72]":"They managed to blow a 22-point lead.","collocation[8]":"share the lead","example[73]":"At the end of the first round, two golfers share the lead.","form[0]":"ADJECTIVES/NOUN + lead","collocation[9]":"a big lead","example[74]":"The Bruins had a big lead at half-time.","collocation[10]":"a clear lead","example[75]":"The ruling Labour Party has a clear lead in the opinion polls.","collocation[11]":"a comfortable lead","example[76]":"The Wildcats had a comfortable lead in the first half.","collocation[12]":"a commanding lead","example[77]":"Alonso raced into a commanding lead.","collocation[13]":"an early lead","example[78]":"Liverpool took an early lead with a goal from Steven Gerrard.","collocation[14]":"a one-shot/two-goal/three point etc lead","example[79]":"Goals by Keane and Lennon gave Tottenham a two-goal lead.","definition[27]":"a soft heavy grey metal that melts easily and is poisonous, used on roofs, or in the past for water pipes. It is a chemical element: symbol Pb","definition[28]":"the central part of a pencil that makes the marks when you write","definition[29]":"bullets","example[80]":"They filled him full of lead.","definition[30]":"to be in charge of something such as an important activity, a group of people, or an organization","example[81]":"The manager had led a series of projects that improved productivity in his region.","example[82]":"a new management team led by Roger Shute","definition[31]":"to be more successful than other people, companies, or countries in a particular activity or area of business","example[83]":"Printing banknotes is one area where Britain leads the world.","example[84]":"a company that leads the field in software applications","definition[32]":"to happen before something else","example[85]":"Typically, stockmarkets lead the recovery of the real economy by four to six months.","definition[33]":"to be the first to do something, especially something good or successful, which is likely to encourage others to do the same thing","example[86]":"Large grocery multiples and the oil companies have led the way in retail modelling.","definition[34]":"a piece of information such as a list of telephone numbers that may help someone selling something to find customers","example[87]":"The in-house sales team deals with all telephone sales leads.","definition[35]":"when you are in front of or better than everyone else you are competing with","example[88]":"The company has a substantial lead over its main competitors."}