{"word[0]":"sink","past_tense[0]":"sank","past_participle[0]":"sunk","signpost[0]":"in water","definition[0]":"to go down below the surface of water, mud etc","opposite[0]":"float","example[0]":"Their motorboat struck a rock and began to sink.","example[1]":"The kids watched as the coin sank to the bottom of the pool.","example[2]":"The heavy guns sank up to their barrels in the mud.","signpost[1]":"boat","definition[1]":"to damage a ship so badly that it sinks","example[3]":"A luxury yacht was sunk in a bomb attack yesterday.","signpost[2]":"move lower","definition[2]":"to move downwards to a lower level","example[4]":"The sun was sinking behind the coconut palms.","example[5]":"Her chin sank onto her chest, and she looked despairing.","signpost[3]":"fall/sit down","definition[3]":"to fall down or sit down heavily, especially because you are very tired and weak","example[6]":"The minister sank to his knees (=he went down into a kneeling position) and prayed.","example[7]":"She let out a groan and sank into a chair.","note[0]":"sink into/to/down/back etc","example[8]":"He let go of her shoulders and she sank at once to the floor.","example[9]":"Marion sank down on a rock, and wept.","signpost[4]":"get worse","definition[4]":"to gradually get into a worse condition","example[10]":"The doctor said that the boy was sinking fast (=getting weaker and about to die).","example[11]":"They lost all their money and sank into desperate poverty.","note[1]":"sink into","example[12]":"The good mood left me and I sank into depression.","signpost[5]":"lower amount/value","definition[5]":"to go down in amount or value","synonym[0]":"drop","example[13]":"Shares in the company have sunk as low as 620p.","example[14]":"The population of the village sank to just a few families.","note[2]":"sink to","definition[6]":"if your voice sinks, it becomes very quiet","example[15]":"Her voice sank to a whisper.","note[3]":"sink to/into","signpost[6]":"use something sharp","definition[7]":"to put your teeth or something sharp into someone’s flesh, into food etc","example[16]":"The dog sank its teeth into my arm.","note[4]":"sink something into something","example[17]":"She sank her fork into the pie.","signpost[7]":"dig into ground","definition[8]":"if you sink something such as a well or part of a building, you dig a hole to put it into the ground","example[18]":"A well was sunk in the back garden, and water could be pumped up into the kitchen.","definition[9]":"to spend a lot of money on something","example[19]":"They sank their entire savings into their house.","note[5]":"sink something in/into something","definition[10]":"to put a ball into a hole or basket in games such as golf or basketball","definition[11]":"to drink alcohol, especially in large quantities","example[20]":"We sank a few pints at the pub first.","definition[12]":"a large open container that you fill with water and use for washing yourself, washing dishes etc","example[21]":"Dirty plates were piled high in the sink."}