{"definition[0]":"if you notice something or someone, you realize that they exist, especially because you can see, hear, or feel them","example[0]":"He noticed a woman in a black dress sitting across from him.","example[1]":"I didn’t notice any smoke.","example[2]":"Have you noticed any change in him?","example[3]":"He never seems to notice when people take advantage of him.","example[4]":"I noticed that her hands were shaking.","note[0]":"notice (that)","example[5]":"She hadn’t noticed before quite how grey his hair was.","note[1]":"notice who/what/how etc","example[6]":"Did you notice him leaving the party early?","note[2]":"notice somebody/something doing something","explanation[0]":"Notice is not used in the progressive You say","example[7]":"I notice you’re wearing glasses","bad_example[0]":"I’m noticing you’re wearing glasses","definition[1]":"to realize that something is there or that something is happening, because you can see, hear, or feel it","example[8]":"I noticed that he was rather quiet during dinner.","example[9]":"Children don’t seem to notice the cold.","example[10]":"‘Julie’s home.’ ‘Yes, I noticed her bicycle outside.’","display[0]":"detect","definition[2]":"to notice something that is difficult to see, hear etc because it is very small, faint, or unclear. Detect is used about people and machines, and is more formal than notice","example[11]":"X-ray telescopes can now detect virtually every type of astronomical object.","example[12]":"He thought he detected a flicker of interest in her eyes.","display[1]":"spot","definition[3]":"to notice something, especially something that is difficult to see or that you see for a short time only. Spot is more informal than notice","example[13]":"Can you spot the difference between these two pictures?","example[14]":"I’m glad you spotted the mistake before it was too late.","display[2]":"become aware/conscious","definition[4]":"to gradually begin to notice that something is happening or is true","example[15]":"I became aware that Mum was getting a lot older.","example[16]":"Tessa became conscious of a feeling of guilt.","display[3]":"can tell","definition[5]":"to be able to notice something because you can see, smell, hear it etc","example[17]":"I could tell that she had been drinking.","example[18]":"Can you tell I’ve lost weight?","display[4]":"something/somebody catches your eye","definition[6]":"used to say that you suddenly notice something or someone because they are interesting, attractive, or good at something","example[19]":"I saw this shirt in the shop window and it just caught my eye.","example[20]":"Clarke caught the eye of boss Bryan Robson when he scored for Newry last week.","display[5]":"observe","definition[7]":"to notice something as a result of watching or studying it closely","example[21]":"Psychologists observed that the mice became more aggressive in smaller cages.","display[6]":"perceive","definition[8]":"to notice something, especially that something is happening, or is true, or needs to be done","example[22]":"The company quickly perceived the need for change.","example[23]":"Doctors perceive that they do not have adequate time to spend with their patients.","display[7]":"witness","definition[9]":"to see something happen because you are there at the time","example[24]":"People have witnessed some great economic changes during the last ten years.","display[8]":"miss","definition[10]":"to not notice something because it is difficult to see","example[25]":"It’s easy to miss the entrance – the sign is hidden behind a tree.","signpost[0]":"attention","definition[11]":"when you notice or pay attention to someone or something","example[26]":"I waved but they took no notice.","example[27]":"I hope you’ll take notice of what I’m going to tell you.","example[28]":"This problem may have escaped your notice so far  (=you may not have noticed it).","example[29]":"This never came to my notice (=I never knew about this).","example[30]":"There are several important matters that I’d like to bring to your notice (=that I would like you to know about).","example[31]":"I did not take much notice of her suggestions.","note[3]":"not take any/much notice (of something)","signpost[1]":"on paper","definition[12]":"a written or printed statement that gives information or a warning to people","example[32]":"The notice on the wall said ‘No smoking’.","example[33]":"I’ll put up a notice about the meeting.","example[34]":"obituary notices (=about people who have just died) in the newspaper","signpost[2]":"time to prepare","definition[13]":"information or a warning about something that is going to happen","example[35]":"Union members served strike notice (=warned that they would go on strike) late last night.","example[36]":"They didn’t give me sufficient notice.","note[4]":"sufficient/reasonable notice","example[37]":"When you’re on the mailing list, you’ll receive advance notice of upcoming events.","note[5]":"advance/prior notice","example[38]":"They closed the factory, giving the workers only a week’s notice.","note[6]":"ten days’/three months’ etc notice","example[39]":"Firefighters were prepared to rush out at a moment’s notice.","example[40]":"These rules are subject to change without notice.","note[7]":"without notice","example[41]":"his failure to give notice of his intention to alter the property","note[8]":"notice of","example[42]":"I’ve been given notice to quit my flat  (=I have been told that I must leave by a certain date).","note[9]":"notice to do something","signpost[3]":"book/play etc","definition[14]":"a statement of opinion, especially one written for a newspaper or magazine, about a new play, book, film etc","synonym[0]":"review","example[43]":"The new play got mixed notices (=some good, some bad) in the newspapers.","heading[0]":"– Meaning 1: when you notice or pay attention to someone or something","collocation[0]":"take notice","example[44]":"I began to take notice when the subject of money came up.","collocation[1]":"take no notice/not take any notice","example[45]":"The other passengers took no notice of what was happening.","collocation[2]":"come to somebody’s notice","example[46]":"This problem first came to our notice last summer.","collocation[3]":"escape somebody’s notice","example[47]":"It had not escaped his notice that Phil seemed interested in Jean.","collocation[4]":"bring something to somebody’s notice","example[48]":"It has been brought to my notice that employees are smoking in the restrooms.","collocation[5]":"attract notice","example[49]":"She didn’t want to attract notice, so she dressed very plainly.","heading[1]":"– Meaning 3: information or a warning about something that is going to happen","collocation[6]":"give notice","example[50]":"To withdraw money from this type of savings account, you must give the bank 30 days’ notice.","collocation[7]":"serve notice","example[51]":"They have served notice that they intend to take legal action against the company.","collocation[8]":"have/receive notice","example[52]":"If I’d had more notice, I could have done a better job.","collocation[9]":"need notice","example[53]":"The company requires a month’s notice of any holiday time you would like to take.","collocation[10]":"advance notice","example[54]":"We had no advance notice of the attack.","collocation[11]":"reasonable notice","example[55]":"Did you receive reasonable notice of the court case?","collocation[12]":"ten days’/three months’/five minutes’ etc notice","example[56]":"His contract said he must give three months’ notice if he decides to leave the job.","collocation[13]":"no notice","example[57]":"We received no notice of the changes.","collocation[14]":"at short notice","example[58]":"Thank you for coming to help at such short notice.","collocation[15]":"at a moment’s notice","example[59]":"He’d be ready to leave at a moment’s notice.","example[60]":"Trains may be cancelled without notice.","collocation[16]":"until further notice","example[61]":"On the door was a sign: ‘Library closed until further notice’.","collocation[17]":"notice to quit","example[62]":"The new owner gave all the tenants notice to quit.","example[63]":"These rules are subject to change without notice (=no notice needs to be given).","example[64]":"Either party may terminate the contract with three months’ notice.","example[65]":"An employer who wants to dismiss an employee must give proper notice.","definition[15]":"to officially warn someone that something is going to happen","example[66]":"The tenant has the right to serve notice on the landlord if they fail to carry out the rent review.","definition[16]":"a formal document warning someone about something or asking them to do something","definition[17]":"the period of time that someone works after they say that they are going to leave their job, or after they have been told to leave their job","example[67]":"The employee need not work out the period of notice if he prefers not to.","definition[18]":"to tell your employer that you are going to leave your job","definition[19]":"if a property owner gives someone notice to quit, or notice of eviction, they tell them to leave the property by a particular date","example[68]":"Once a Notice to Quit has been served upon you, and has expired, your landlord has the legal right to order you to leave your accommodation."}