{"word[0]":"partner","signpost[0]":"marriage etc","definition[0]":"one of two people who are married, or who live together and have a sexual relationship","example[0]":"Discuss your worries with your partner.","example[1]":"Only 29% of lone parents receive financial support from their former partners.","example[2]":"a sexual partner","definition[1]":"one of the owners of a business","example[3]":"She’s a partner in a law firm.","example[4]":"The senior partner has retired.","signpost[1]":"dancing/games etc","definition[2]":"someone you do a particular activity with, for example dancing or playing a game against two other people","example[5]":"Clare’s my tennis partner.","example[6]":"Take your partners for the next dance.","signpost[2]":"country/organization","definition[3]":"a country or organization that another country or organization has an agreement with","example[7]":"Nigeria is our principal trading partner in Africa.","example[8]":"The group is a junior partner (=less important group) in the PLO’s governing coalition.","definition[4]":"to be someone’s partner in a dance, game etc","example[9]":"I used to partner him in tennis matches.","definition[5]":"a company that works with another company in a particular activity, or invests in the same activity","example[10]":"British Airways is actively seeking partners for joint ventures.","example[11]":"The company and its equity partners have invested in six energy projects.","definition[6]":"someone who starts a new business with someone else by investing in it","example[12]":"Like all new business partners, the three founders of the company hoped for smooth teamwork.","definition[7]":"a member of certain types of business or professional groups, for example partnerships of lawyers, architects etc","example[13]":"Donald Andres, a tax partner at accountants Ernst & Young","definition[8]":"a country that invests in another or is invested in by another, or that trades with another","example[14]":"China is an important economic partner and provider of oil for North Korea.","example[15]":"Exports won’t boom this year because so many of America’s major trading partners are going through tough times, too.","definition[9]":"to be someone’s partner in a business project","example[16]":"Creative Labs have partnered another company to design and produce some of the best speakers on the market today.","example[17]":"The cellular phone company has partnered with a company that lays phone lines in urban areas to compete with local phone carriers.","note[0]":"partner (up) with somebody","example[18]":"The company has partnered up with a number of stores to provide a flower delivery service."}