{"signpost[0]":"door/container etc","definition[0]":"not closed, so that things, people, air etc can go in and out or be put in and out","opposite[0]":"closed","example[0]":"He threw the door open and ran down the stairs.","example[1]":"an open window","example[2]":"The gates swung silently open.","example[3]":"The bar door flew open and a noisy group burst in.","example[4]":"All the windows were wide open (=completely open).","example[5]":"She looked at the open suitcase with surprise.","example[6]":"There was an open bottle of wine on the table.","signpost[1]":"eyes/mouth","definition[1]":"not closed, so that your eyelids or your lips are apart","example[7]":"I was so sleepy, I couldn’t keep my eyes open.","example[8]":"He was fast asleep with his mouth wide open.","signpost[2]":"not enclosed","definition[2]":"not enclosed, or with no buildings, walls, trees etc","example[9]":"There was open ground at the end of the lane.","example[10]":"open spaces such as parks and gardens","example[11]":"A shoal of fish swam past heading for the open sea (=part of the sea away from land).","example[12]":"The car’s performance is good, especially going fast on the open road (=a road without traffic where you can drive fast).","example[13]":"At weekends people want to leave the town for open countryside.","note[0]":"open countryside/country","signpost[3]":"not covered","definition[3]":"without a roof or cover","example[14]":"The president was riding with his wife in an open car.","example[15]":"Martin was struggling with the sails on the open deck.","example[16]":"an open drain","example[17]":"Many of the tombs had been robbed and left open to the sky.","note[1]":"open to the sky/air/elements","signpost[4]":"business/building etc","definition[4]":"ready for business and allowing customers, visitors etc to enter","example[18]":"The museum is open daily in the summer months.","example[19]":"The offices are also open at weekends.","example[20]":"After the security alert, most of the firms affected were open for business on Monday morning.","example[21]":"The villagers are anxious that their local school is kept open.","example[22]":"I declare this exhibition open  (=officially say that it is now open).","signpost[5]":"not restricted","definition[5]":"allowing everyone, or everyone in a group, to take part in something, know about something, or have a chance to win something","example[23]":"an open meeting","example[24]":"The men’s race appears wide open (=anyone could win it).","example[25]":"The painting would fetch several hundred dollars on the open market (=a market in which anyone can buy or sell).","example[26]":"The competition is open to all readers in the UK.","note[2]":"open to","example[27]":"In many schools, governors’ meetings are not open to the public.","example[28]":"The discussion was then thrown open for the audience’s questions.","signpost[6]":"opportunity","definition[6]":"if an opportunity, a possible action, a job etc is open to you, you have the chance to do it","example[29]":"The job is being kept open for her.","example[30]":"There is only one course of action open to the local authority.","example[31]":"The 1960s was a period when greater opportunities were open to women.","example[32]":"So what other options are open to us?","signpost[7]":"not secret","definition[7]":"actions, feelings, intentions etc that are open are not hidden or secret","example[33]":"Her father watched her with open admiration.","example[34]":"open hostility between the two nations","example[35]":"The party was calling for more open government (=when the government makes information freely available).","example[36]":"The case will be tried in open court (=in a court where everything is public).","example[37]":"It is an open secret (=it is supposed to be secret, but most people know about it) that she is having an affair with another man.","definition[8]":"honest and not wanting to hide any facts from other people","example[38]":"his friendly, open manner","example[39]":"The couple are quite open with each other about their feelings.","note[3]":"open with","example[40]":"She was quite open about her ambitions.","note[4]":"open about","definition[9]":"not fastened","example[41]":"the open neck of his shirt","example[42]":"She was wearing an open jacket.","signpost[8]":"not yet decided","definition[10]":"needing more discussion or thought before a decision can be made","example[43]":"The matter remains an open question.","example[44]":"Officers investigating her death are keeping their options open.","note[5]":"keep/leave your options open","example[45]":"The new rates of pay are open to negotiation.","example[46]":"The test results are open to interpretation.","signpost[9]":"not blocked","definition[11]":"if a road or line of communication is open, it is not blocked and can be used","example[47]":"We try to keep the mountain roads open all through the winter.","signpost[10]":"spread apart","definition[12]":"spread apart instead of closed, curled over etc","example[48]":"At night the flowers were open.","example[49]":"Johnson raised an open hand.","example[50]":"He was sitting in bed with a book lying open  (=with its pages apart so it can be read) on his knees.","signpost[11]":"door/window etc","definition[13]":"to move a door, window etc so that people, things, air etc can pass through, or to be moved in this way","example[51]":"Jack opened the window.","example[52]":"He opened the drawer of the desk.","example[53]":"She heard a door open and then close.","signpost[12]":"container/package","definition[14]":"to unfasten or remove the lid, top, or cover of a container, package etc","example[54]":"Louise opened a bottle of wine.","example[55]":"He opened the letter and began to read it.","example[56]":"The children were opening their presents.","example[57]":"Mark was about to open a beer when the doorbell rang.","definition[15]":"to raise your eyelids so that you can see, or to be raised in this way","example[58]":"Barry was awake long before he opened his eyes.","example[59]":"Carrie smelled coffee and her eyes opened reluctantly.","signpost[13]":"mouth","definition[16]":"to move your lips apart, or to be moved in this way","example[60]":"He opened his mouth but couldn’t think what to say.","signpost[14]":"start operating","definition[17]":"if a place such as an office, shop, restaurant etc opens or is opened, it starts operating or providing a service","example[61]":"Sarah had recently opened an office in Genoa.","example[62]":"French and Scandinavian offices are due to open in the autumn.","example[63]":"The Forestry Commission has opened a plant centre selling rare plants.","example[64]":"The centre has been a great success since it opened its doors a year ago.","signpost[15]":"shop/restaurant etc","definition[18]":"to start business, letting in customers or visitors, at a particular time","example[65]":"What time do the banks open?","example[66]":"The bakery opens early.","signpost[16]":"start an activity","definition[19]":"to start an activity, event, or set of actions","example[67]":"The US attorney’s office has opened an investigation into the matter.","example[68]":"An inquest into the deaths will be opened next week.","definition[20]":"to make a document or computer program ready to use","example[69]":"Click on this icon to open the File Manager.","signpost[17]":"meeting/event","definition[21]":"if a meeting etc opens or is opened in a particular way, it starts in that way","example[70]":"Hughes, opening the Conference, made a dramatic plea for peace.","example[71]":"The concert opens with Beethoven’s Egmont Overture.","signpost[18]":"official ceremony","definition[22]":"to perform a ceremony in which you officially state that a building is ready to be used","example[72]":"The new County Hall building was officially opened by the King.","signpost[19]":"spread/unfold","definition[23]":"to spread something out or unfold something, or to become spread out or unfolded","example[73]":"She opened her umbrella.","example[74]":"John opened his hand to show her he wasn’t holding anything.","example[75]":"The flowers only open during bright weather.","example[76]":"I sat down and opened my book.","example[77]":"She opened the curtains  (=pulled the two curtains apart).","example[78]":"Dave opened his arms  (=stretched his arms wide apart) to give her a hug.","signpost[20]":"make a way through","definition[24]":"to make it possible for cars, goods etc to pass through a place","example[79]":"They were clearing away snow to open the tunnel.","example[80]":"The peace treaty promises an end to war and opens the borders between the two countries.","signpost[21]":"film/play etc","definition[25]":"to start being shown to the public","example[81]":"Paula and Rachael star as mother and daughter in the play, which opens tonight.","example[82]":"The film opened yesterday to excellent reviews.","explanation[0]":"Open belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[1]":"In this sentence, ‘the door’ is the object of open","example[83]":"She opened the door","explanation[2]":"In this sentence, ‘the door’ is the subject of open","example[84]":"The door opened","definition[26]":"used about a door, window, container, package, letter, your eyes, or your mouth","example[85]":"I opened the door quietly.","example[86]":"She was nervous about opening the letter.","example[87]":"Open your mouth wide.","display[0]":"unlock","definition[27]":"to open a door, drawer, box etc with a key","example[88]":"You need a key to unlock the safe.","display[1]":"unscrew","definition[28]":"to open a lid on a bottle, container etc by turning it","example[89]":"I carefully unscrewed the lid of the jar.","display[2]":"force open","definition[29]":"to open a drawer, window, cupboard etc using force","example[90]":"The door was locked so we had to force it open.","display[3]":"unwrap","definition[30]":"to open a package by removing the paper that covers it","example[91]":"The children were busy unwrapping their Christmas presents.","display[4]":"unfasten/undo","definition[31]":"to make something no longer fastened or tied, for example a seat belt or a piece of clothing","example[92]":"He unfastened the top button of his shirt.","example[93]":"I was so full I had to undo my belt.","definition[32]":"one of the important international sports competitions, especially for golf, such as the British Open Championship and the US Open Championship, or for tennis, such as the French, US and Australian Open competitions","definition[33]":"if a shop, bank, restaurant etc is open, it is allowing customers to enter and is ready to serve them","example[94]":"The bank is open till 12.00 on Saturdays.","example[95]":"The shop was open for business on every day of the year.","definition[34]":"if a financial market is open, buying and selling on it are possible","example[96]":"Among Asian and Pacific markets that were open, stocks overall had a mixed performance.","definition[35]":"if a country is open to foreign products, they can be sold there without restrictions such as high import taxes","example[97]":"Many people think the country is far less open to foreign products than Europe or the US.","definition[36]":"if something is sold on the open market, it is available for anyone to buy","example[98]":"The shares would be purchased on the open market or in privately negotiated transactions.","definition[37]":"to be ready to consider people’s offers for something you are selling","example[99]":"The company said it was open to offers from potential buyers.","definition[38]":"if something is open to discussion, you can discuss it and suggest changes","example[100]":"The number of board seats they will have, like all other terms of the proposal, is open to negotiation.","definition[39]":"in a court of law where everything is public","example[101]":"I am giving this judgment in open court at the request of all parties.","definition[40]":"if a shop, office, financial market etc opens at a particular time, it starts business at that time","example[102]":"Oil prices softened $1 a barrel as European and Asian markets opened yesterday.","definition[41]":"if a new business opens or is opened, someone starts it","example[103]":"She plans to open a chain of restaurants.","definition[42]":"if shares, bonds etc open at a particular price, they have that price when the financial market on which they are traded opens for business","example[104]":"Platinum opened lower following Japanese sales of platinum overnight.","definition[43]":"if a country opens its markets to foreign goods, it allows them to be sold there, or it reduces restrictions on them","example[105]":"The US and Europe would open their markets in agriculture and textiles to developing nations by cutting quotas and subsidies.","definition[44]":"to start a new account at a financial institution, for example by putting money into it","example[106]":"Private clients are asked to produce an initial deposit of at least $10,000 to open an account.","definition[45]":"the beginning of a trading session on a financial market","example[107]":"The dollar was quoted at 116.77 yen, down slightly from 118.80 yen at the open.","example[108]":"US wheat prices might slip at the open of trading today."}