{"word[0]":"legislation","definition[0]":"a law or set of laws","example[0]":"It is a very important piece of legislation.","example[1]":"The government is bringing in legislation to combat this problem.","note[0]":"introduce/bring in legislation","example[2]":"the legislation on abortion","note[1]":"legislation on","example[3]":"new legislation to protect children","note[2]":"legislation to do something","example[4]":"The company can be prosecuted under the new legislation.","note[3]":"under new/existing/current etc legislation","example[5]":"The government will introduce legislation to force brewers to list the ingredients in their beers.","collocation[0]":"pass legislation","example[6]":"Legislation was passed banning the use of child labour.","collocation[1]":"legislation allows something","example[7]":"It was a huge change when Russia passed legislation to allow the sale of private property.","collocation[2]":"legislation prevents something","example[8]":"Legislation prevents the import and export of certain types of drug.","collocation[3]":"legislation requires something","example[9]":"Legislation requires newspapers to be printed on recycled paper.","collocation[4]":"draft legislation","example[10]":"She is a member of the committee that is drafting the legislation.","collocation[5]":"enact legislation","example[11]":"Much legislation has been enacted to control pollution.","collocation[6]":"propose legislation","example[12]":"The government proposed legislation on data protection.","collocation[7]":"a piece of legislation","example[13]":"The most important piece of legislation was the Prevention of Fraud Act.","form[0]":"ADJECTIVES/NOUN + legislation","collocation[8]":"existing/current etc legislation","example[14]":"The existing legislation may need to be amended.","collocation[9]":"new legislation","example[15]":"The Government has promised new legislation to deal with the problem.","collocation[10]":"safety legislation","example[16]":"Safety legislation requires all construction workers to wear protective headgear .","collocation[11]":"national legislation","example[17]":"National legislation defines the powers of local authorities.","collocation[12]":"government legislation","example[18]":"New government legislation will force manufacturers to label their products more accurately.","collocation[13]":"federal legislation","example[19]":"Federal legislation is drafted primarily by the staffs of the congressional committees.","collocation[14]":"anti-terrorism legislation","example[20]":"The House Of Representatives is expected to pass new anti-terrorism legislation today.","example[21]":"Under the new legislation, employers will be required to offer up to 12 weeks of paid sick-leave per year.","example[22]":"He introduced legislation to increase the minimum wage.","definition[1]":"the act of making laws","example[23]":"The fundamental purpose of legislation is to create, amend or repeal law."}