{"word[0]":"hint","definition[0]":"something that you say or do to suggest something to someone, without telling them directly","example[0]":"There have been hints that he may take up coaching.","example[1]":"‘Look, I can’t tell you.’ ‘Oh, come on, give me a hint.’","example[2]":"I made it clear I wasn’t interested in him, but he didn’t take the hint.","example[3]":"Miles had been dropping heavy hints about the cost of petrol.","note[0]":"hint about/as to","definition[1]":"a very small amount or sign of something","example[4]":"‘When?’ he asked with a hint of impatience.","note[1]":"hint of","example[5]":"We shall have to turn back if there’s the slightest hint of fog.","definition[2]":"a useful piece of advice about how to do something","note[2]":"helpful/handy hints","example[6]":"helpful hints on looking after houseplants","note[3]":"hint on/about","collocation[0]":"give (somebody) a hint","example[7]":"Come on, what is it? Give me a hint.","collocation[1]":"drop a hint","example[8]":"She was dropping quite a few hints about what she'd like for her birthday.","collocation[2]":"take a/the hint","example[9]":"Mark took the hint and shut up.","collocation[3]":"get the hint","example[10]":"I looked hopefully at the cake, but he didn't get the hint.","collocation[4]":"a broad/strong/heavy hint","example[11]":"He had dropped a heavy hint that they might get married.","collocation[5]":"a subtle/gentle hint","example[12]":"I'm sick of her subtle hints that I'm not welcome here.","collocation[6]":"a vague hint","example[13]":"In his article, he gave only vague hints as to what he had actually done.","collocation[7]":"I can take a hint","example[14]":"All right, I can take a hint. I'm leaving.","definition[3]":"to suggest something in an indirect way, but so that someone can guess your meaning","synonym[0]":"imply","example[15]":"What are you hinting at?","note[4]":"hint at","example[16]":"He hinted strongly that he might be prepared to send troops in.","note[5]":"hint (that)"}