{"word[0]":"introduce","signpost[0]":"when people meet","definition[0]":"if you introduce someone to another person, you tell them each other’s names for the first time","example[0]":"Have you two been introduced? Tom, this is Greg.","example[1]":"June, let me introduce you to Bob.","note[0]":"introduce somebody to somebody","example[2]":"May I introduce myself? My name is Meg Johnson.","note[1]":"introduce yourself","signpost[1]":"new system/product","definition[1]":"to bring a plan, system, or product into use for the first time","example[3]":"They want to introduce a system of identity cards.","example[4]":"The store have introduced a new range of food for children.","explanation[0]":"In everyday British English, people often say bring in a plan, law, system etc rather than introduce it:","example[5]":"They want to bring in a system of identity cards.","signpost[2]":"bring something to a place","definition[2]":"to bring a type of thing somewhere for the first time","example[6]":"The grey squirrel was introduced into Britain from North America.","note[2]":"introduce something to/into something","signpost[3]":"new experience","definition[3]":"to show someone something or tell them about it for the first time","example[7]":"Malcolm introduced me to the joys of wine-tasting.","note[3]":"introduce somebody to something/introduce something to somebody","signpost[4]":"programme/public event","definition[4]":"to speak at the beginning of and sometimes during a television or radio programme, or at the beginning of a public event","example[8]":"Jim Adams will introduce tonight’s programme.","signpost[5]":"start a change","definition[5]":"to make something new start to happen or exist in a situation","example[9]":"The peace agreement has introduced a feeling of optimism here.","definition[6]":"to formally present a possible new law to be discussed","example[10]":"Several senators introduced legislation aimed at sexual harassment.","signpost[6]":"put something into something","definition[7]":"to put something carefully into something else","example[11]":"Fuel was introduced into the jet pipe.","note[4]":"introduce something into something","definition[8]":"to make a new product or service available for the first time","example[12]":"The drug was introduced in the mid-1990s.","definition[9]":"to make stocks, shares etc available on the stock exchange for the first time","example[13]":"The Chicago Mercantile Exchange introduced futures and options on the Nikkei Index of 225 Tokyo stocks.","definition[10]":"to bring a system, law, method etc into use for the first time","example[14]":"The company has introduced a new pay system for senior executives.","example[15]":"Toy safety legislation was introduced in 1967.","definition[11]":"to help someone get to know a new person or product","example[16]":"The company has been introducing clients to private banks for several years.","note[5]":"introduce somebody/something to somebody/something","example[17]":"It is not always easy to introduce customers to new and unusual varieties of food.","definition[12]":"to formally present a new law so that it can be discussed and voted on by a parliament, CONGRESS etc","example[18]":"The Democratic candidate vowed to introduce a bill to restore the tax."}