{"word[0]":"unusual","definition[0]":"different from what is usual or normal","example[0]":"an unusual feature","example[1]":"unusual circumstances","example[2]":"It’s unusual for Dave to be late.","example[3]":"It’s not unusual (=it is quite common) to feel very angry in a situation like this.","collocation[0]":"very/most/highly unusual","example[4]":"Gandhi was a most unusual politician.","collocation[1]":"extremely unusual","example[5]":"We’ve not had any snow yet, which is extremely unusual.","collocation[2]":"rather/somewhat/quite/fairly unusual","example[6]":"The design of the house was somewhat unusual.","collocation[3]":"nothing unusual","example[7]":"There is nothing unusual about the arrangement.","collocation[4]":"something unusual","example[8]":"We want to know if anyone saw something unusual last night.","collocation[5]":"anything unusual","example[9]":"Did you notice anything unusual about him?","heading[0]":"events/situations","definition[1]":"different from what usually happens","example[10]":"We had snow in May, which is very unusual.","definition[2]":"not happening very often, or existing only in small numbers","example[11]":"Violent crimes are rare.","example[12]":"Hatton gathered many rare plants from all over the world.","display[0]":"exceptional","definition[3]":"very unusual and happening very rarely","example[13]":"Ninety-day visas can be extended only in exceptional circumstances.","example[14]":"The presence of a jury in a civil trial is now quite exceptional.","display[1]":"out of the ordinary","definition[4]":"unusual and surprising or special","example[15]":"It was a small village where nothing out of the ordinary ever seemed to happen.","display[2]":"freak","definition[5]":"extremely unusual and unexpected – used about an accident, storm etc","example[16]":"A freak wave wrecked most of the seafront.","example[17]":"Their car was crushed by a tree in a freak accident.","display[3]":"unprecedented","definition[6]":"if something is unprecedented, it has never happened before – often used about successes and achievements","example[18]":"An unprecedented number of students have received top grades.","example[19]":"This kind of deal is unprecedented.","display[4]":"unheard of","definition[7]":"if something is unheard of, it has never happened or been done before – used especially when something seems very surprising to people at that time","example[20]":"In our small town, this kind of crime was almost unheard of.","example[21]":"unheard-of luxuries such as electric windows and air-conditioning","heading[1]":"people/behaviour/methods etc","display[5]":"eccentric","definition[8]":"behaving in a way that seems rather strange but not frightening","example[22]":"The house was owned by an eccentric millionaire.","example[23]":"eccentric behaviour","display[6]":"unconventional","definition[9]":"very different from the way people usually behave, think, dress etc, often in a way that seems interesting","example[24]":"His parents had a rather unconventional lifestyle, and let their children do whatever they pleased.","example[25]":"His approach to business may seem unconventional, but he certainly gets results.","display[7]":"unorthodox","definition[10]":"unorthodox ideas or methods are different from the usual ones, and therefore seem surprising to many people","example[26]":"He is known for his unorthodox political views.","example[27]":"unorthodox teaching methods"}