{"word[0]":"finance","definition[0]":"the management of money by governments, large organizations etc","example[0]":"leasing and other forms of business finance","example[1]":"Russia’s finance minister","example[2]":"the world of high finance (=financial activities involving very large amounts of money)","definition[1]":"money provided by a bank or other institution to help buy or do something","synonym[0]":"funding/funds","example[3]":"We need to raise finance for further research.","note[0]":"finance for","definition[2]":"to provide money, especially a lot of money, to pay for something","synonym[1]":"fund","example[4]":"The concerts are financed by the Arts Council.","definition[3]":"money provided or lent, for example by a bank for INVESTMENT (=when money is put into buildings, equipment, etc to produce goods and services) or CONSUMPTION (=when people buy goods and services)","example[5]":"The building society is Scotland’s biggest source of finance for house building.","example[6]":"The European Investment Bank would provide finance for a range of activities including regional development activity.","example[7]":"The next step was to obtain finance in order to start manufacturing and selling full-sized engines.","example[8]":"If you are selling a larger property, which is paid for, and buying a smaller one, then you will not have to raise finance (=obtain it).","definition[4]":"the management of money by countries, organizations, and people","example[9]":"The appointment of a top finance executive as vice chairman suggests that finance will play a prominent role in the company’s future.","example[10]":"Russia’s finance minister said he expects the ruble to stabilize soon.","definition[5]":"the study of the management and use of money","example[11]":"He is professor of finance at Wharton Business School.","definition[6]":"the money that an organization or person has, and the way that they manage it","example[12]":"Italian state finances are about the worst of any major world economy.","example[13]":"The television network hired McKinsey to conduct an overall strategic review of its structure, operations and finances.","definition[7]":"to give or lend money, especially a large amount of money, to pay for something","example[14]":"The new company will be financed by a total of $200 million in equity and $300 million in bank debt."}