{"word[0]":"different","definition[0]":"not like something or someone else, or not like before","opposite[0]":"similar","example[0]":"The place looks completely different now.","example[1]":"They decided to try a radically different approach.","example[2]":"We found women had significantly different political views from men.","example[3]":"a slightly different way of doing things","example[4]":"What actually happened was subtly different from the PR people’s version.","example[5]":"The show is refreshingly different from most exhibitions of modern art.","example[6]":"The publishing business is no different from any other business in this respect.","example[7]":"It’s a different world here in London.","example[8]":"Our sons are very different from each other.","note[0]":"different from","example[9]":"Her jacket’s different to mine.","note[1]":"different to","example[10]":"He seemed different than he did in New York.","note[2]":"different than","heading[0]":"GRAMMAR: Prepositions with different","explanation[0]":"You usually say different from","example[11]":"Their home is different from ours","explanation[1]":"In American English, people also say different than","example[12]":"Their home is different than ours","explanation[2]":"In spoken British English, people also say different to","example[13]":"Their home is different to ours","bad_example[0]":"Their home is different of ours","definition[1]":"used to talk about two or more separate things of the same basic kind","synonym[0]":"various","example[14]":"Different people reacted in different ways.","example[15]":"I looked in lots of different books but couldn’t find anything about it.","example[16]":"There are many different types of fabric.","note[3]":"different types/kinds etc","definition[2]":"another","example[17]":"I think she’s moved to a different job now.","definition[3]":"unusual, often in a way that you do not like","example[18]":"‘What did you think of the film?’ ‘Well, it was certainly different.’","definition[4]":"if something or someone is different, they are not like something or someone else, or they are not like they were before","example[19]":"You look different. Have you had your hair cut?","example[20]":"We’ve painted the door a different colour.","example[21]":"The cultures of the two countries are very different.","display[0]":"unique","definition[5]":"very different, special, or unusual and the only one of its kind. Don’t use words such as very before unique","example[22]":"The book is certainly very rare, and possibly unique.","example[23]":"the unique wildlife of the Galapagos Islands","display[1]":"distinctive","definition[6]":"having a special feature or appearance that makes something different from other things, and makes it easy to recognize","example[24]":"Male birds have distinctive blue and yellow markings.","display[2]":"unlike","definition[7]":"completely different from a particular person or thing","example[25]":"In Britain, unlike the United States, the government provides health care.","display[3]":"have nothing in common","definition[8]":"if two people have nothing in common, they do not have the same interests or opinions and therefore cannot form a friendly relationship","example[26]":"Apart from the fact that we went to the same school, we have absolutely nothing in common.","display[4]":"there’s no/little resemblance","definition[9]":"used when saying that two people or things seem very different","example[27]":"There’s no resemblance between the two sisters at all.","example[28]":"The final product bore no resemblance to the original proposal (=it was very different).","display[5]":"dissimilar","definition[10]":"not the same as something else","example[29]":"These four politically dissimilar states have all signed a treaty of friendship and cooperation.","display[6]":"be like chalk and cheese","definition[11]":"if two people are like chalk and cheese, they are completely different","example[30]":"It’s hard to believe that they’re brothers – they’re like chalk and cheese!","display[7]":"be (like) apples and oranges","definition[12]":"used when saying that two people or things are very different","example[31]":"You can't compare residential and commercial real estate markets. It's apples and oranges.","example[32]":"Obama and Romney are apples and oranges.","example[33]":"Comparing homemade soup to canned soup is really comparing apples and oranges."}