{"word[0]":"proposal","definition[0]":"a plan or suggestion which is made formally to an official person or group, or the act of making it","example[0]":"the government’s proposals for regulation of the industry","note[0]":"proposal for","example[1]":"The committee put forward a proposal to reduce the time limit.","note[1]":"proposal to do something","example[2]":"They rejected proposals that the president should be directly elected.","note[2]":"proposal that","definition[1]":"when you ask someone to marry you","example[3]":"She politely declined his proposal of marriage.","note[3]":"marriage proposal/proposal of marriage","collocation[0]":"make a proposal","example[4]":"I'd like to make a proposal.","collocation[1]":"put forward/submit a proposal","example[5]":"They put forward a proposal for a joint research project.","collocation[2]":"come up with a proposal","example[6]":"The sales staff came up with an innovative proposal.","collocation[3]":"draw up a proposal","example[7]":"A committee of experts drew up proposals for a constitution.","collocation[4]":"approve/accept a proposal","example[8]":"The proposal was approved by the committee.","collocation[5]":"support/back a proposal","example[9]":"Not one of these organizations supports the government's proposals.","collocation[6]":"reject a proposal","example[10]":"Councillors had twice rejected proposals for a new village school.","collocation[7]":"consider a proposal","example[11]":"We shall consider their proposals carefully.","collocation[8]":"discuss a proposal","example[12]":"He had discussed the proposal with the Egyptian president.","collocation[9]":"vote on a proposal","example[13]":"Shareholders will vote on the proposal on May 5.","form[0]":"ADJECTIVES/NOUN + proposal","collocation[10]":"a detailed proposal","example[14]":"They drew up a detailed proposal and submitted it to the Department of Energy.","collocation[11]":"a specific/concrete proposal","example[15]":"The report will make specific proposals for further investigation.","collocation[12]":"a research proposal","example[16]":"Applicants should submit a short research proposal on their chosen topic.","collocation[13]":"a budget/tax proposal","example[17]":"Criticism of the budget proposals was voiced by the International Monetary Fund.","collocation[14]":"a peace proposal","example[18]":"The Israeli government responded positively to the US peace proposals.","collocation[15]":"a formal proposal","example[19]":"Schools made formal written proposals.","definition[2]":"a plan or idea which is suggested formally to an official person, or when this is done","example[20]":"The President is facing a battle to get Congress to accept hisbudget proposals.","example[21]":"I made a proposal for opening an office in Seoul, complete with projected costings.","example[22]":"The Senate rejected a proposal to limit the program to two years.","example[23]":"The company had to put forward a proposal that layoffs be considered.","definition[3]":"an official document in which you give details about yourself or your property when you are buying an INSURANCE POLICY"}