{"word[0]":"promote","definition[0]":"to help something to develop or increase","example[0]":"a meeting to promote trade between Taiwan and the UK","example[1]":"Fertilizer promotes leaf growth.","signpost[0]":"better job","definition[1]":"to give someone a better more responsible job in a company","opposite[0]":"demote","example[2]":"Helen was promoted to senior manager.","note[0]":"promote somebody to something","explanation[0]":"Promote is often passive in this meaning","signpost[1]":"sell","definition[2]":"to help sell a new product, film etc by offering it at a reduced price or by advertising it","example[3]":"She’s in London to promote her new book.","definition[3]":"if a sports team is promoted, they play in a better group of teams the next year","opposite[1]":"relegate","example[4]":"They have been promoted to the First Division.","note[1]":"be promoted to something","explanation[1]":"Promote is usually passive in this meaning","definition[4]":"to try to persuade people to support or use something","example[5]":"John Major promoted the idea of a classless society.","definition[5]":"to be responsible for arranging a large public event such as a concert or a sports game","definition[6]":"to help something develop, grow, become more successful etc, or encourage something to happen","example[6]":"The CBI is in favour of promoting alliances between small businesses.","example[7]":"Oftel favors firm controls on pricing to helppromote competition.","example[8]":"Capital spending enables companies to reduce costs, increase employment and generallypromote economic growth.","definition[7]":"to try hard to sell a product or service by advertising it widely, reducing its price etc","example[9]":"The book will be heavily promoted by publisher Random House.","example[10]":"We need a credible strategy for promoting high-definition television.","definition[8]":"to give someone a better paid, more responsible job in a company or organization","example[11]":"He turned increasingly to Mr. Barr for help and eventually promoted him to deputy attorney general.","example[12]":"Univision Holdings Inc. has promoted four executives to new posts as part of a reorganization.","definition[9]":"to be responsible for arranging a large public entertainment event, especially a musical or sports event","example[13]":"The athletics events are promoted jointly by industrial and commercial sponsors."}