{"word[0]":"correct","definition[0]":"having no mistakes","opposite[0]":"incorrect","example[0]":"If my calculations are correct, we’re about ten miles from Exeter.","example[1]":"Score one point for each correct answer.","example[2]":"You are absolutely correct, the Missouri is the longest river in the US.","example[3]":"The sentence is grammatically correct, but doesn’t sound natural.","note[0]":"factually/grammatically/anatomically etc correct","explanation[0]":"In everyday English, people usually say right rather than correct:","example[4]":"Are you sure you’ve got the right address?","definition[1]":"suitable and right for a particular situation","example[5]":"What’s the correct procedure in cases like this?","example[6]":"The correct way to lift heavy weights is to make sure that your back is straight.","definition[2]":"correct behaviour is formal and polite","synonym[0]":"proper","example[7]":"It was not considered correct for young ladies to go out on their own.","collocation[0]":"a correct answer","example[8]":"Lucy got fourteen out of twenty correct answers.","collocation[1]":"a correct entry","example[9]":"The first five correct entries will win £50.","collocation[2]":"correct information","example[10]":"I’m not sure that I’ve been given the correct information.","collocation[3]":"correct spelling","example[11]":"Copying does not teach correct spelling.","collocation[4]":"correct pronunciation","example[12]":"The dictionary will help you learn the correct pronunciation.","collocation[5]":"absolutely/perfectly/entirely correct","example[13]":"What he said was perfectly correct.","collocation[6]":"not strictly correct","example[14]":"The grammar in this sentence is not strictly correct.","collocation[7]":"grammatically correct","example[15]":"Simple sentences are more likely to be grammatically correct than long complex ones.","collocation[8]":"factually correct","example[16]":"Articles in the newspaper are not always factually correct.","collocation[9]":"broadly/essentially correct","example[17]":"All the evidence suggests that the results of his research are essentially correct.","collocation[10]":"prove correct","example[18]":"Fortunately, my memory proved correct.","definition[3]":"to make something right or to make it work the way it should","example[19]":"Some eyesight problems are relatively easy to correct.","example[20]":"You have the right to see a copy of your file, and to correct any mistakes you may find.","explanation[1]":"In everyday British English, people usually say put  something right rather than correct something:","example[21]":"The problem should be fairly easy to put right.","definition[4]":"to show someone that something is wrong, and make it right","example[22]":"Correct my pronunciation if it’s wrong.","example[23]":"‘She’s in Ireland now.’ ‘She was, ’ Farrell corrected him.","example[24]":"‘I, ’ Lady Deverill corrected herself, ‘we are very happy here.’","note[1]":"correct yourself","definition[5]":"if a teacher corrects a student’s written work, he or she writes marks on it to show the mistakes in it"}