{"word[0]":"reminder","definition[0]":"something that makes you notice, remember, or think about something","example[0]":"The drop in stock prices serves as a reminder  (=is a reminder) that investing is a form of gambling.","example[1]":"The damaged church was preserved as a stark reminder of the horrors of war.","note[0]":"constant/painful/vivid etc reminder","example[2]":"a reminder of the dangers of drinking and driving","note[1]":"reminder of","example[3]":"Occasional bursts of gunfire are a reminder that the rebels are still active.","note[2]":"reminder that","definition[1]":"something, for example a letter, that reminds you to do something which you might have forgotten","example[4]":"a reminder from the dentist for your check-up","collocation[0]":"a constant/permanent reminder","example[5]":"Peter's letters to me are a constant reminder of the happiness we shared.","collocation[1]":"a timely reminder","example[6]":"This is a timely reminder to people that they should be careful with strangers.","collocation[2]":"a salutary reminder","example[7]":"The earthquake in China is a salutary reminder of how fragile human existence can be.","collocation[3]":"a painful/uncomfortable reminder","example[8]":"This violence is a painful reminder that peace is still a long way away.","collocation[4]":"a stark/sharp reminder","example[9]":"This incident is a stark reminder of the dangers police officers face every day.","collocation[5]":"a vivid reminder","example[10]":"Their performance was a vivid reminder of just why this band has remained so successful.","collocation[6]":"a powerful/potent reminder","example[11]":"The soldiers' deaths are a powerful reminder of the price we pay for freedom.","collocation[7]":"a poignant reminder","example[12]":"I see Kathy's death as a poignant reminder that we sometimes really are powerless.","collocation[8]":"a grim/sobering/chilling reminder","example[13]":"They passed the armed guard, a grim reminder of the ever-present threat of terrorism.","collocation[9]":"a gentle reminder","example[14]":"It was meant to be a gentle reminder rather than a criticism.","collocation[10]":"serve as/act as a reminder","example[15]":"The photograph will serve as a lovely reminder of your visit.","collocation[11]":"provide/offer a reminder","example[16]":"The case has provided a chilling reminder of how violently some people react to foreigners.","definition[2]":"a letter telling someone that they have not paid a bill, and must do so","example[17]":"Its computers send electronic reminders to members’ personal computers."}