{"word[0]":"transport","definition[0]":"a system or method for carrying passengers or goods from one place to another","example[0]":"commuters who travel on public transport (=buses, trains etc)","example[1]":"It’s easier to get to the college if you have your own transport (=a car, bicycle etc).","example[2]":"Improved rail transport is essential for business.","note[0]":"air/rail/road transport","example[3]":"Horses were the only means of transport.","note[1]":"means/mode/form of transport","explanation[0]":"In this meaning, transport is an uncountable noun and has no plural form You say","example[4]":"Public transport is very cheap","bad_example[0]":"public transports","definition[1]":"the process or business of taking goods from one place to another","example[5]":"Canals were used for the transport of goods.","note[2]":"transport of","definition[2]":"a ship or aircraft for carrying soldiers or supplies","form[0]":"ADJECTIVES/NOUN + transport","collocation[0]":"road transport","example[6]":"Buses are the safest form of road transport in this country.","collocation[1]":"rail transport","example[7]":"Freight delivery costs could be reduced substantially by using rail transport.","collocation[2]":"air transport","example[8]":"The air transport industry is presently going through a period of change.","collocation[3]":"public transport","example[9]":"We recommend that you travel by public transport.","collocation[4]":"private transport","example[10]":"77 percent of respondents in the survey had regular access to private transport.","form[1]":"transport + NOUN","collocation[5]":"the transport system","example[11]":"We will create a better, more integrated transport system.","collocation[6]":"transport costs","example[12]":"We must ensure that transport costs are kept low.","collocation[7]":"transport links","example[13]":"The region has good transport links to the capital.","collocation[8]":"a means/mode/form of transport","example[14]":"Horses and carts were the only means of transport.","collocation[9]":"have your own transport","example[15]":"The supermarket offers a free bus service for customers who do not have their own transport.","definition[3]":"to take goods, people etc from one place to another in a vehicle","example[16]":"trucks used for transporting oil","example[17]":"The statue was transported to London.","note[3]":"transport somebody/something to something","definition[4]":"to send a criminal to a distant country such as Australia as a punishment in the past","definition[5]":"the process or business of moving goods from one place to another by rail, air, ship etc","example[18]":"One of the biggest growth areas was transport, with revenues up 80%.","definition[6]":"a system for carrying passengers or goods from one place to another","example[19]":"Today, there are greater opportunities for profits from export, with the advantages of modern transport.","example[20]":"Regions with good transport links and a high quality workforce will be at a competitive advantage in bidding for inward investment.","definition[7]":"to take goods from one place to another by rail, air, ship etc","example[21]":"The crops are transported down the Mississippi River for export."}