{"definition[0]":"the letters and packages that are delivered to you","example[0]":"You shouldn't read other people's mail.","example[1]":"He found a mountain of mail waiting for him.","example[2]":"She promised to forward my mail to my new address  (=send it from your old home or office to your new one).","example[3]":"He gets sacks of fan mail (=letters from people who admire him).","example[4]":"hate mail (=letters from people who hate you)","definition[1]":"the system of collecting and delivering letters and packages","example[5]":"The mail here’s really slow and unreliable.","example[6]":"The product will be sold mainly through the mail.","example[7]":"Most reports are sent via internal mail  (=a system of sending documents to people inside the same organization).","example[8]":"I sent my application by registered mail.","note[0]":"registered/express/first-class etc mail","example[9]":"I’ll put the check in the mail tomorrow.","note[1]":"in the mail","example[10]":"Did you send the document by mail?","note[2]":"by mail","definition[2]":"messages that are sent and received on a computer","synonym[0]":"email","example[11]":"I check my mail a couple of times a day.","example[12]":"She's just received another mail message from them.","definition[3]":"armour made of small pieces of metal, worn by soldiers in the Middle Ages","collocation[0]":"send mail","example[13]":"Please do not send personal mail to my work address.","collocation[1]":"get/receive mail","example[14]":"Did we get any mail this morning?","collocation[2]":"the mail comes/arrives","example[15]":"The mail had come late that day.","collocation[3]":"the mail goes (out)","example[16]":"What time does the mail go out?","collocation[4]":"read your mail","example[17]":"The first thing he did was read his mail.","collocation[5]":"open your mail","example[18]":"She opened her mail as she ate her breakfast.","collocation[6]":"forward/redirect somebody's mail","example[19]":"The post office will forward your mail for a limited time.","collocation[7]":"deliver the mail","example[20]":"The postman had just delivered the mail.","collocation[8]":"sort mail","example[21]":"Some mail still has to be sorted by hand.","form[0]":"ADJECTIVES/NOUN + mail","collocation[9]":"personal/private mail","example[22]":"He accused her of reading his private mail.","collocation[10]":"fan mail","example[23]":"He gets so much fan mail he had to employ a secretary to deal with it.","collocation[11]":"hate mail","example[24]":"She got threatening phone calls and hate mail.","collocation[12]":"junk mail","example[25]":"I only ever get junk mail and bills.","collocation[13]":"registered mail","example[26]":"You have to sign for registered mail.","definition[4]":"to send a letter or package to someone","example[27]":"The weekly newsletter is mailed to women all over the country.","note[3]":"mail something to somebody","definition[5]":"to send a document to someone using a computer","example[28]":"Can you mail it to me as an attachment?","definition[6]":"another name for The Daily Mail","definition[7]":"the system of collecting or delivering letters, packages etc","example[29]":"Your cheque is in the mail (=I have just mailed it to you).","example[30]":"Do not send cash through the mail.","example[31]":"The company sells its computers by mail.","definition[8]":"the letters, packages etc that are sent to a particular person at a particular time","example[32]":"The first thing he does when he arrives in the office is check his mail.","example[33]":"My secretary sorts through the incoming mail (=mail being received).","example[34]":"All outgoing mail (=mail being sent) must have a stamp on it.","example[35]":"a sorting machine that processes first-class mail (=letters sent by the fastest normal mail service) by ZIP code","definition[9]":"messages sent by email","example[36]":"Have you read your mail yet?","example[37]":"I got five mails this morning.","example[38]":"The letter was mailed last Thursday.","definition[10]":"to send someone a message by email","example[39]":"You can phone, fax, or mail me at the office."}