{"word[0]":"withdraw","past_tense[0]":"withdrew","past_participle[0]":"withdrawn","signpost[0]":"not take part","definition[0]":"to stop taking part in an activity, belonging to an organization etc, or to make someone do this","example[0]":"A knee injury forced her to withdraw from the competition.","note[0]":"withdraw from","example[1]":"calls for Britain to withdraw from the European Union","example[2]":"Parents have the right to withdraw their children from religious education lessons if they wish.","note[1]":"withdraw something/somebody from something","signpost[1]":"stop supporting","definition[1]":"to stop giving support or money to someone or something, especially as the result of an official decision","example[3]":"One of the minority parties had withdrawn its support for Chancellor Kohl.","example[4]":"Union members will vote on whether to withdraw their labour (=stop working).","example[5]":"a government decision to withdraw funding","signpost[2]":"change your mind","definition[2]":"if you withdraw a threat, offer, request etc, you say that you no longer will do what you said","example[6]":"After much persuasion he agreed to withdraw his resignation.","signpost[3]":"say something is not true","definition[3]":"if you withdraw a remark, criticism, statement etc, you say that what you said earlier was completely untrue","synonym[0]":"retract","example[7]":"He refused to withdraw his remarks and was expelled from the Party.","example[8]":"The newspaper has agreed to withdraw its allegations.","signpost[4]":"product/service","definition[4]":"if a product or service is withdrawn, it is no longer offered for sale or use","example[9]":"The drug has been withdrawn from the market for further tests.","note[2]":"withdraw something from sale/from the market","signpost[5]":"leave a place","definition[5]":"if an army withdraws, or if it is withdrawn, it leaves a place","example[10]":"the USA’s decision to withdraw 40,000 troops from western Europe","definition[6]":"to leave a place, especially in order to be alone or go somewhere quiet","example[11]":"We withdrew to the garden for a private talk.","note[3]":"withdraw to","definition[7]":"to take money out of a bank account","synonym[1]":"take out","example[12]":"I’d like to withdraw £500 from my current account.","note[4]":"withdraw something from something","explanation[0]":"In everyday English, people often say that someone takes or gets money out rather than withdraws it:","example[13]":"Can we stop off at the bank? I need to get some money out.","definition[8]":"if you withdraw your hand, arm, finger etc from somewhere, you move it from there to where it was before","example[14]":"Claudia withdrew her hand from his.","definition[9]":"to take an object out from inside something","example[15]":"She withdrew a document from her briefcase.","signpost[6]":"stop communicating","definition[10]":"to become quieter, less friendly, and only concerned about your own thoughts","example[16]":"Many depressed people just withdraw into themselves.","example[17]":"Ralph has withdrawn from the other kids.","note[5]":"withdraw into/from","example[18]":"You can withdraw cash from ATMs in any town or city.","definition[11]":"to remove something or take it back, often because of an official decision","example[19]":"They offered her the job but then withdrew the offer after checking her references.","definition[12]":"if a company withdraws a product or service, it stops making it available, either for a period of time or permanently","example[20]":"Previous testing showed no safety problems, but the company decided to withdraw the product so the incidents could be investigated.","example[21]":"The drug has been withdrawn from the market for further testing.","definition[13]":"to say that something you said earlier was completely untrue","definition[14]":"to no longer take part in something or to no longer belong to a particular organization","example[22]":"The Bank of New York withdrew as a primary dealer of U.S. government securities.","note[6]":"withdraw as","example[23]":"His decision to withdraw from active management was a blow to the company."}