{"word[0]":"earthquake","definition[0]":"a sudden shaking of the Earth’s surface that often causes a lot of damage","example[0]":"An earthquake measuring 6.1 on the Richter scale struck southern California on June 28.","example[1]":"The city is in an earthquake zone.","collocation[0]":"big/large","example[2]":"This is the biggest earthquake ever recorded in this area.","example[3]":"The town experiences dozens of small earthquakes every year.","example[4]":"Flights were cancelled after a powerful earthquake shook the northwest of the country.","collocation[1]":"a major earthquake","example[5]":"If a major earthquake hits a large city, millions could die.","collocation[2]":"a minor earthquake","example[6]":"Minor earthquakes are relatively common.","collocation[3]":"a great/massive earthquake","example[7]":"1906 is remembered for the great earthquake that destroyed San Francisco.","collocation[4]":"a severe/devastating earthquake","example[8]":"The whole town was flattened by a devastating earthquake.","collocation[5]":"an earthquake happens","example[9]":"Scientists cannot predict when an earthquake will occur.","collocation[6]":"an earthquake hits/strikes a place","example[10]":"The region was  struck by a major earthquake last year.","collocation[7]":"an earthquake destroys/damages something","example[11]":"The earthquake completely destroyed all the buildings on the island.","collocation[8]":"an earthquake measures 5/6.4 etc on the Richter Scale","example[12]":"The earthquake, which measured 7.6 on the Richter scale, left more than 20,000 homeless.","collocation[9]":"the magnitude of an earthquake","example[13]":"Measuring stations identify the location and magnitude of an earthquake within a few minutes of the event.","definition[1]":"a sudden shaking of the Earth’s surface","example[14]":"The earthquake destroyed homes, telephone lines and roads.","display[0]":"quake","definition[2]":"an earthquake – used especially in journalism","example[15]":"More than 2000 people died when a quake hit the island of Flores.","display[1]":"tremor","definition[3]":"a small movement in the Earth’s surface in which the ground shakes slightly","example[16]":"He was awoken by a series of tremors during the night.","display[2]":"aftershock","definition[4]":"further movements in the Earth’s surface that happen after a larger earthquake","example[17]":"In the days after the earthquake, the area suffered a series of aftershocks.","display[3]":"tsunami","definition[5]":"an ocean wave caused by an earthquake under the water","example[18]":"There was no warning of the approaching tsunami."}