{"word[0]":"scramble","signpost[0]":"climb","definition[0]":"to climb up, down, or over something quickly and with difficulty, especially using your hands to help you","example[0]":"They tried to scramble up the cliff.","note[0]":"scramble up/down/over etc","example[1]":"She scrambled down the tree as quickly as she could.","signpost[1]":"move quickly","definition[1]":"to move somewhere in a hurried awkward way","example[2]":"Alan scrambled out of the way.","note[1]":"scramble to/out/from etc","example[3]":"Micky scrambled to his feet  (=stood up very quickly and awkwardly) and hurried into the kitchen.","signpost[2]":"do something quickly","definition[2]":"to try to do something difficult very quickly","example[4]":"They were scrambling to give the impression that the situation was under control.","note[2]":"scramble to do something","signpost[3]":"compete","definition[3]":"to struggle or compete with other people to get or reach something","example[5]":"Thousands of people will be scrambling for tickets.","note[3]":"scramble for","signpost[4]":"information/message","definition[4]":"to use special equipment to mix messages, radio signals etc into a different form, so that they cannot be understood by other people without the correct equipment","example[6]":"Our conversation will be electronically scrambled.","signpost[5]":"mix","definition[5]":"to mix words, ideas, sentences etc so that they are not in the right order and do not make sense","example[7]":"The words in each sentence are scrambled.","definition[6]":"if a military plane scrambles, it goes up into the air very quickly in order to escape or to attack an enemy","definition[7]":"a difficult climb in which you have to use your hands to help you","example[8]":"The village was a 20-minute scramble away.","definition[8]":"a situation in which people compete with and push each other in order to get what they want","example[9]":"the usual scramble for the bathroom every morning","example[10]":"a scramble to carry the baggage into the house","definition[9]":"a situation in which something has to be done very quickly, with a lot of rushing around","example[11]":"It was a mad scramble trying to get things ready in time.","definition[10]":"a motorcycle race over rough ground"}