{"word[0]":"freeze","past_tense[0]":"froze","past_participle[0]":"frozen","definition[0]":"if a liquid or something wet freezes or is frozen, it becomes hard and solid because the temperature is very cold","example[0]":"The lake had frozen overnight.","definition[1]":"to preserve food for a long time by keeping it at a very low temperature, or to be preserved in this way","example[1]":"I think I’ll freeze that extra meat.","example[2]":"Tomatoes don’t freeze well.","signpost[0]":"machine/engine","definition[2]":"if a machine, engine, pipe etc freezes, the liquid inside it becomes solid with cold, so that it does not work properly","example[3]":"The water pipes have frozen.","signpost[1]":"feel cold","definition[3]":"to feel very cold","example[4]":"I nearly froze to death watching that football match.","signpost[2]":"wages/prices","definition[4]":"if a government or company freezes wages, prices etc, they do not increase them for a period of time","example[5]":"The government has been forced to cut spending and freeze public-sector wages.","signpost[3]":"money/property","definition[5]":"to legally prevent money in a bank from being spent, property from being sold etc","example[6]":"The court froze their assets.","signpost[4]":"stop moving","definition[6]":"to stop moving suddenly and stay completely still and quiet","example[7]":"I froze and listened; someone was in my apartment.","example[8]":"She froze with horror.","note[0]":"freeze with","definition[7]":"to stop a DVD or video in order to be able to look at a particular part of it","example[9]":"He froze the picture on the screen.","definition[8]":"a time when people are not allowed to increase prices or pay","note[1]":"a price/pay/wage freeze","example[10]":"a freeze on pay rises","note[2]":"freeze on","definition[9]":"the stopping of some activity or process","example[11]":"The government have imposed a freeze on civil service appointments.","definition[10]":"a period of extremely cold weather","definition[11]":"a short period of time, especially at night, when the temperature is extremely low","definition[12]":"if a government or company freezes prices, wages etc, they keep them at a particular level","example[12]":"The company cut executive salaries by 10%, all remaining salaries were frozen.","example[13]":"The president froze fuel prices and set a ceiling on prices for basic foodstuffs.","definition[13]":"to legally prevent money in a bank from being taken out, property from being sold etc, for example because there is a disagreement concerning it","example[14]":"A federal judge froze more than $20 million in FundAmerica bank accounts last Friday after several California investors sued Mr Edwards.","definition[14]":"to stop an activity or a proposed activity for a period of time","example[15]":"The airline froze hiring and instructed employees to reduce spending.","example[16]":"Mr Smith has frozen plans to develop the record company.","definition[15]":"if a computer or a computer screen freezes, the image on the screen will not change because of a problem with the computer","example[17]":"My computer froze and I had to reboot it.","definition[16]":"when prices, wages etc are fixed at a particular level","example[18]":"They said the cable television industry was abusing its market position, and called for a mandatory price freeze in cable rates.","example[19]":"The prime minister called for a pay freeze to help keep inflation down.","definition[17]":"when an activity is stopped for a period of time","example[20]":"If the government imposes a freeze on the roads programme, up to 20,000 jobs could be lost.","example[21]":"In an effort to reduce overheads, they laid off a quarter of the staff and initiated a hiring freeze (=when a company does not take new employees)."}