{"word[0]":"recall","type[0]":"intransitive, transitive not in progressive","signpost[0]":"remember something","definition[0]":"to remember a particular fact, event, or situation from the past","example[0]":"You don’t happen to recall his name, do you?","example[1]":"As I recall, it was you who suggested this idea in the first place.","example[2]":"I seem to recall I’ve met him before somewhere.","note[0]":"recall (that)","example[3]":"I don’t recall seeing any cars parked outside.","note[1]":"recall doing something","example[4]":"I can’t recall who gave me the information.","note[2]":"recall what/how/where etc","definition[1]":"to officially tell someone to come back to a place or group","example[5]":"Cole was recalled to the squad to replace the injured Quinn.","note[3]":"recall somebody to something","example[6]":"The Ambassador was recalled from Washington.","note[4]":"recall somebody from something","definition[2]":"if a company recalls one of its products, it asks people who have bought it to return it because there may be something wrong with it","example[7]":"The cars had to be recalled due to an engine fault.","definition[3]":"to bring information back onto the screen of a computer","signpost[1]":"be similar to something","definition[4]":"if something recalls something else, it makes you think of it because it is very similar","example[8]":"The furnishings recall the 1960s.","definition[5]":"to vote to remove someone from their political position","signpost[2]":"memory","definition[6]":"the ability to remember something that you have learned or experienced","example[9]":"A child’s recall is usually accurate.","example[10]":"He had total recall  (=remembered everything) of every play in the game.","signpost[3]":"order to return","definition[7]":"an official order telling someone to return to a place, especially before they expected to","example[11]":"the recall of their ambassador","note[5]":"recall of","definition[8]":"when a company asks people to return a product they have bought because there may be something wrong with it","definition[9]":"a vote to remove someone from their political position, or the act of being removed by a vote","example[12]":"the recall of four city council members","definition[10]":"if a company recalls one of its products, it asks customers to return it because there may be something wrong with it","example[13]":"The company was forced to recall one range of cereals after several packets were found to be contaminated.","definition[11]":"to officially tell someone to come back","example[14]":"The U.S. recalled its ambassador in protest.","example[15]":"Some 30,000 auto workers were recalled from layoffs.","definition[12]":"to remember something that you have seen or heard, such as an advertisement","example[16]":"Consumers’ ability to recall TV commercials has dropped steadily."}