{"comparative[0]":"tougher","superlative[0]":"toughest","definition[0]":"difficult to do or deal with","note[0]":"when the going gets tough (the tough get going) informal (=used to say that when a situation becomes difficult, strong people take the necessary action to deal with it)","example[0]":"It was a tough race.","example[1]":"She’s had a tough life.","example[2]":"The company admitted that it had been a tough year.","example[3]":"Tough decisions will have to be made.","example[4]":"The reporters were asking a lot of tough questions.","example[5]":"It was a tough call (=a difficult decision), but we had to cancel the game because of the weather.","example[6]":"I find his books pretty tough going (=difficult to read).","example[7]":"Gage predicted the president’s proposal would be a tough sell (=something that is difficult to persuade someone about) before Congress. American English","example[8]":"The family has had a tough time of it these last few months.","note[1]":"have a tough time (of it)","example[9]":"It’s tough being married to a cop.","note[2]":"it’s tough doing something","example[10]":"Having to stay indoors all day is tough on a kid.","note[3]":"be tough on somebody","signpost[0]":"strong person","definition[1]":"physically or emotionally strong and able to deal with difficult situations","note[4]":"tough cookie/customer informal (=someone who is very determined to do what they want and not what other people want)","example[11]":"The men who work on the oil rigs are a tough bunch.","example[12]":"He’s as tough as nails – a good man to have on the team.","note[5]":"as tough as nails/as tough as old boots","signpost[1]":"strong material","definition[2]":"not easily broken or made weaker","example[13]":"tough, durable plastic","example[14]":"a very tough, hard-wearing cloth","signpost[2]":"strict/firm","definition[3]":"very strict or firm","example[15]":"The EU is taking a tough line with the UK over this issue.","example[16]":"My mother was very tough on my sister.","note[6]":"tough on/with","example[17]":"It’s time to get tough with drunk drivers.","signpost[3]":"violent area","definition[4]":"a tough part of a town has a lot of crime or violence","example[18]":"a tough area of Chicago","note[7]":"tough neighborhood/area/part of town etc","signpost[4]":"violent person","definition[5]":"likely to behave violently and having no gentle qualities","example[19]":"one of football’s most notorious tough guys","example[20]":"tough young thugs looking for trouble","definition[6]":"difficult to cut or eat","opposite[0]":"tender","example[21]":"The meat was tough and hard to chew.","example[22]":"the tough outer leaves of the cabbage","definition[7]":"someone who often behaves in a violent way","definition[8]":"in a way that shows you are very determined","example[23]":"Washington played tough in the second half of the game.","example[24]":"You’re talking tough now but you wait until you get into the interview."}