{"word[0]":"blaze","definition[0]":"a big dangerous fire – used especially in news reports","example[0]":"It took almost 100 firemen to bring the blaze under control.","example[1]":"Helicopters were used to help fight the blaze.","note[0]":"fight/tackle/control a blaze","example[2]":"a huge chemical factory blaze","note[1]":"house/factory/barn etc blaze","definition[1]":"a fire burning with strong bright flames","example[3]":"I lit the fire and soon had a cheerful blaze going.","signpost[0]":"light/colour","definition[2]":"very bright light or colour","example[4]":"the blaze of light from the security lamps","note[2]":"blaze of","example[5]":"The garden is a blaze of colour at this time of year.","definition[3]":"a sudden show of very strong emotion","example[6]":"A blaze of anger flashed across his face.","definition[4]":"a white mark, especially one down the front of a horse’s face","collocation[0]":"fight a blaze","example[7]":"Nearly 80 firefighters fought the blaze for three hours on Sunday.","collocation[1]":"tackle a blaze","example[8]":"Fire crews were called out to tackle a blaze at a house near York.","collocation[2]":"control a blaze","example[9]":"It took more than an hour to control the blaze at the hotel.","collocation[3]":"bring a blaze under control","example[10]":"For more than four hours they battled to bring the blaze under control.","collocation[4]":"put out/extinguish a blaze","example[11]":"Staff managed to put out the blaze before firemen arrived.","collocation[5]":"a blaze breaks out","example[12]":"The blaze broke out on the third floor of the building.","collocation[6]":"a blaze spreads","example[13]":"The blaze quickly spread to a neighbouring house.","form[0]":"NOUN + blaze","collocation[7]":"a house/factory/car etc blaze","example[14]":"Three people were badly hurt in a house blaze.","definition[5]":"to burn very brightly and strongly","example[15]":"The room was warm, with a fire blazing in the hearth.","definition[6]":"to shine with a very bright light","example[16]":"A huge truck was advancing towards us, its headlights blazing.","example[17]":"The sun blazed down as we walked along the valley.","type[0]":"usually in progressive","definition[7]":"if someone’s eyes are blazing, their eyes are shining brightly because they are feeling a very strong emotion, usually anger","example[18]":"Linda leapt to her feet, her dark eyes blazing with anger.","note[3]":"blaze with","definition[8]":"if guns blaze, they fire bullets quickly and continuously","example[19]":"An enemy plane roared overhead, its guns blazing."}