{"word[0]":"safe","comparative[0]":"safer","superlative[0]":"safest","signpost[0]":"not in danger","definition[0]":"not in danger of being harmed, lost, or stolen","opposite[0]":"unsafe","example[0]":"She doesn’t feel safe in the house on her own.","example[1]":"Make sure you keep these documents safe.","example[2]":"Your money will be as safe as houses.","note[0]":"be (as) safe as houses","example[3]":"The birds’ nests are high up, safe from predators.","note[1]":"safe from","signpost[1]":"not harmed or lost","definition[1]":"not harmed, lost, or stolen","example[4]":"Your family are all safe.","example[5]":"The missing children were found safe and sound.","note[2]":"safe and sound/well","signpost[2]":"not causing harm","definition[2]":"not likely to cause any physical injury or harm","opposite[1]":"dangerous","example[6]":"Flying is one of the safest forms of travel.","example[7]":"Don’t go near the edge – it isn’t safe.","example[8]":"a safe working environment","example[9]":"The water is treated to make it safe to drink.","note[3]":"safe to use/drink/eat etc","example[10]":"We watched from a safe distance.","note[4]":"(at/from) a safe distance","example[11]":"Drivers should keep a safe distance from the car in front.","example[12]":"Women are safer drivers than men.","note[5]":"safe driver","example[13]":"Is it safe to swim here?","note[6]":"it is safe (for somebody) to do something","example[14]":"play areas that are safe for children","note[7]":"safe for","signpost[3]":"no risk","definition[3]":"not involving any risk and very likely to be successful","example[15]":"a safe investment","example[16]":"a safe method of contraception","example[17]":"I think it’s safe to say that the future is looking pretty good.","note[8]":"it’s safe to say/assume (that)","signpost[4]":"subject","definition[4]":"a safe subject of conversation is not likely to upset anyone or make people argue","example[18]":"I kept to safe subjects, like the weather.","signpost[5]":"no problem","definition[5]":"used to say that something is good and that there is no problem","example[19]":"‘How’s your new boss?’ ‘She’s safe.’","definition[6]":"not in danger of being harmed, lost, or stolen. Also used about a place where someone or something is safe","example[20]":"I don’t feel safe around here.","example[21]":"Keep your valuables in a safe place.","display[0]":"secure","definition[7]":"if something is secure, it is safe from thieves and criminals. Also used about a place where something is safe","example[22]":"How do I know that my personal details are secure?","example[23]":"The money is in a very secure place.","display[1]":"well protected","definition[8]":"not likely to be damaged or harmed by something","example[24]":"The equipment was well protected from the rain.","example[25]":"Always make sure that you are well protected from the sun.","display[2]":"out of harm’s way","definition[9]":"in a place where someone or something cannot be hurt or damaged","example[26]":"She put the glass vases on the top shelf, out of harm’s way.","example[27]":"Make sure that he stays out of harm’s way.","heading[0]":"not harmed or damaged","example[28]":"The children are all safe.","display[3]":"OK/all right","definition[10]":"safe and not hurt","example[29]":"I was glad to hear that you were OK.","display[4]":"unharmed","definition[11]":"not hurt","example[30]":"The kidnappers released the young man unharmed.","display[5]":"unscathed","definition[12]":"not hurt or damaged, after an accident, an attack, or a dangerous experience – used when you are surprised by this","example[31]":"The baby escaped unscathed.","example[32]":"Miraculously, the old part of the city remained unscathed.","display[6]":"in one piece","definition[13]":"not harmed or damaged, especially after a journey or a dangerous experience","example[33]":"I’m glad you’re home in one piece.","display[7]":"out of danger","definition[14]":"safe, after being in a dangerous situation","example[34]":"As soon as they were out of danger, they stopped for a rest.","example[35]":"His doctors say he is out of danger.","definition[15]":"used by young people to show approval of something","example[36]":"‘Alex is having a party.’ ‘Oh, safe!’","definition[16]":"a strong metal box or cupboard with special locks where you keep money and valuable things","definition[17]":"said by young people as a greeting","definition[18]":"not likely to cause any harm or injury","example[37]":"Our products are safe when used correctly.","example[38]":"Recycling is a safer and cheaper alternative to burning waste.","definition[19]":"not in danger of being lost, harmed, or stolen","example[39]":"How safe is your job?","example[40]":"With this software, users should be safe from virus attacks.","definition[20]":"not involving any risk and very likely to succeed","example[41]":"The dollar is usually regarded as a safe investment.","example[42]":"In a weak economy, precious metals stocks are a safe haven for investors  (=people who invest in them are unlikely to lose money).","definition[21]":"to not take any risks","example[43]":"Bankers are playing it safe by investing in well-established blue chip stocks.","definition[22]":"a strong metal box or other container with strong locks, where you keep your money and other valuable things"}