{"word[0]":"put somebody/something on","definition[0]":"to put a piece of clothing on your body","opposite[0]":"take off","example[0]":"He took off his uniform and put on a sweater and trousers.","example[1]":"I’ll have to put my glasses on; I can’t read the sign from here.","signpost[0]":"on skin","definition[1]":"to put make-up, cream etc on your skin","example[2]":"I’ve got to put this cream on twice a day.","signpost[1]":"affect/influence something","definition[2]":"to do something that affects or influences someone or something else","example[3]":"The government put a limit on imports of textiles.","example[4]":"Pat was putting pressure on him to leave his wife.","signpost[2]":"start equipment","definition[3]":"to make a light or a piece of equipment start working by pressing or turning a button or switch","synonym[0]":"switch on","example[5]":"He got up and put on the light.","example[6]":"Shall I put the kettle on?","definition[4]":"to put a record, tape, or CD into a machine and start playing it","example[7]":"She put on some music while they ate.","signpost[3]":"pretend","definition[5]":"to pretend to have a particular feeling, opinion, way of speaking etc especially in order to get attention","example[8]":"Sheila’s not really that upset; she’s just putting it on.","example[9]":"Leaving the court, the families all tried to put on a brave face (=not show that they were sad or worried).","definition[6]":"to become fatter and heavier","synonym[1]":"gain","example[10]":"Rosie’s put on five kilos since she quit smoking.","signpost[4]":"event/concert/play etc","definition[7]":"to arrange for a concert, play etc to take place, or to perform in it","example[11]":"One summer the children put on a play.","signpost[5]":"show what you can do","definition[8]":"to show what you are able to do or what power you have","example[12]":"The team need to put on another world-class performance.","definition[9]":"to start cooking something","example[13]":"Shall I put the pasta on now?","signpost[6]":"provide something","definition[10]":"to provide a service for people, especially a special one","example[14]":"BA is putting on extra flights to cover the Christmas rush.","definition[11]":"used to tell someone that you think they are joking","example[15]":"He wouldn’t do that – you’re putting me on.","signpost[7]":"risk money","definition[12]":"to risk an amount of money on the result of a game, race etc","synonym[2]":"bet","example[16]":"We put £50 on Brazil to win the Cup.","signpost[8]":"add","definition[13]":"to add an amount of money or tax onto the cost of something","example[17]":"Can smokers really complain if more tax is put on cigarettes?","definition[14]":"to give someone the telephone so that they can talk to someone who is telephoning","example[18]":"Can you put Janet on?","definition[15]":"something you say or do to try to make someone believe something that is not true","definition[16]":"to add an amount of money onto the price or cost of something","example[19]":"The new tax could put another ten cents on the price of gas.","example[20]":"At the close of trading, Sears put on 2 to 92p.","example[21]":"Turnover put on almost £70 million to £337.5 million."}