{"word[0]":"kick","definition[0]":"to hit something with your foot","example[0]":"There was a scuffle and he kicked me in the stomach.","note[0]":"kick somebody in the stomach/face/shin etc","example[1]":"Billy was kicking a ball around the yard.","note[1]":"kick something down/over/around etc","example[2]":"The police kicked the door down.","definition[1]":"to move your legs as if you are kicking something","example[3]":"He kicked off his shoes and lay back on the bed.","example[4]":"a row of dancers kicking their legs in the air","example[5]":"A horse trotted past, kicking up dust from the road.","definition[2]":"a movement of your foot or leg, usually to hit something with your foot","example[6]":"Brazil scored with the last kick of the match.","example[7]":"Rory aimed a kick at her leg and missed.","example[8]":"kung fu kicks","example[9]":"If the door won’t open, just give it a good kick.","definition[3]":"the act of kicking the ball in a sports game such as football, or the ball that is kicked and the direction it goes in","example[10]":"Benjamin struck a post with an overhead kick.","example[11]":"Pearce came forward to take the free kick.","note[2]":"free/penalty kick","definition[4]":"something that you enjoy because it is exciting","synonym[0]":"thrill","example[12]":"Gerald gets a kick out of dressing as a woman.","note[3]":"get a kick out of/from (doing) something","example[13]":"It gives her a kick to get you into trouble.","note[4]":"give somebody a kick","example[14]":"She used to steal from shops for kicks.","note[5]":"do something (just) for kicks","collocation[0]":"give something a kick","example[15]":"The door was stuck; he gave it a kick.","collocation[1]":"get a kick","example[16]":"He got a kick on the ankles from Anne.","collocation[2]":"aim a kick at somebody/something","example[17]":"Lifting her foot, she aimed a kick at her brother.","collocation[3]":"a good kick","example[18]":"The only way to make the drinks dispenser work is to give it a good kick.","collocation[4]":"a hard kick","example[19]":"A hard kick to the knee could cause a lot of damage.","collocation[5]":"a high kick","example[20]":"The dance routine was full of high kicks."}