{"word[0]":"citizen","definition[0]":"someone who lives in a particular town, country, or state","example[0]":"We need our schools to teach students to be good citizens.","example[1]":"The mayor urged citizens to begin preparing for a major storm.","definition[1]":"someone who legally belongs to a particular country and has rights and responsibilities there, whether they are living there or not","example[2]":"At the time, there were over 2,000 British citizens living in Iraq.","heading[0]":"– Meaning 1 : someone who lives in a particular town, country, or state","collocation[0]":"a good citizen","example[3]":"One of the aims of education is to produce good citizens.","collocation[1]":"a law-abiding citizen","example[4]":"Most of the people in this town are law-abiding citizens.","collocation[2]":"a respectable/decent citizen","example[5]":"There are gangs on the streets who are terrorizing respectable citizens.","collocation[3]":"an upstanding/upright citizen","example[6]":"The rest of his family are honest upright citizens.","collocation[4]":"a model citizen","example[7]":"His neighbours described him as a model citizen.","collocation[5]":"an ordinary citizen","example[8]":"The government is not aware of the views of ordinary citizens.","collocation[6]":"a senior citizen","example[9]":"There are special clubs for senior citizens.","collocation[7]":"somebody’s fellow citizens","example[10]":"70% of our fellow citizens live in poverty.","collocation[8]":"a private citizen","example[11]":"Laws exist to protect private citizens.","collocation[9]":"a leading/prominent citizen","example[12]":"The protests were led by leading citizens in the community.","example[13]":"In order to become a US citizen, you need to have a Permanent Resident card.","example[14]":"All British citizens have the right to live in the UK.","example[15]":"Good citizens understand that they have a responsibility to the community.","display[0]":"national","definition[2]":"a citizen of a country who is living in another country","example[16]":"She insisted that foreign nationals were safe in the country.","example[17]":"Russians nationals were ordered to leave.","example[18]":"Her husband is a French national.","display[1]":"resident","definition[3]":"someone who lives in a particular street or area","example[19]":"There have been complaints by local residents about the building work.","example[20]":"She was a resident of Chicago for many years.","display[2]":"native","definition[4]":"someone who was born in a particular country but moved to another country – used when describing a person or their life","example[21]":"Picasso was a native of Spain, although he spent much of his life in France.","display[3]":"subject","definition[5]":"someone who was born in a country that has a king or queen, and has a right to live there","example[22]":"Northern Ireland citizens are British subjects.","display[4]":"alien","definition[6]":"someone who is not a legal citizen of the country they are living or working in – used in official contexts","example[23]":"Employers cannot hire illegal aliens."}