{"word[0]":"jump","signpost[0]":"upwards","definition[0]":"to push yourself up into the air, or over or away from something etc, using your legs","example[0]":"How high can you jump?","example[1]":"Fans were jumping up and down (=jumping repeatedly) and cheering.","example[2]":"We managed to jump clear of the car before it hit the wall.","note[0]":"jump clear (of something)","example[3]":"He jumped over the wall and ran off.","note[1]":"jump over/across/onto etc something","definition[1]":"to go over or across something by jumping","example[4]":"He jumped the gate, landing on the concrete.","signpost[1]":"downwards","definition[2]":"to let yourself drop from a place that is above the ground","example[5]":"The cats jumped down and came to meet us.","example[6]":"Three people saved themselves by jumping from the window.","note[2]":"jump from/out of/onto etc something","signpost[2]":"move fast","definition[3]":"to move quickly or suddenly in a particular direction","synonym[0]":"leap","example[7]":"Matt jumped up to answer the phone.","note[3]":"jump up/back/in etc","example[8]":"We all jumped in a taxi.","example[9]":"She jumped to her feet and left.","signpost[3]":"in fear/surprise","definition[4]":"to make a quick sudden movement because you are surprised or frightened","example[10]":"Marcia jumped. ‘What’s that noise?’","example[11]":"Sorry, I didn’t mean to make you jump (=surprise or frighten you).","example[12]":"Don’t shout. I nearly jumped out of my skin (=was very shocked or frightened)!","definition[5]":"to increase or improve suddenly and by a large amount","example[13]":"Profits jumped to £2.6 million last year.","note[4]":"jump (from ...) to something","example[14]":"Norway jumped from ninth to third place.","signpost[4]":"keep changing","definition[6]":"to change quickly and often from one idea, place, position etc to another – used to show disapproval","example[15]":"Cathy kept jumping from one topic to another.","note[5]":"jump from something to something","example[16]":"I’ve been jumping about the file instead of working straight through it.","note[6]":"jump about/around (something)","signpost[5]":"miss a stage","definition[7]":"to move suddenly to a further part of a book, discussion etc leaving out the part in between","example[17]":"I’m afraid I jumped a couple of chapters.","example[18]":"The movie suddenly jumped ahead to the future.","note[7]":"jump to","definition[8]":"if a machine or piece of equipment jumps, it moves suddenly because something is wrong with it","example[19]":"Why does the video keep jumping like this?","definition[9]":"to attack someone suddenly","example[20]":"Somebody jumped him in the park last night.","definition[10]":"to jump-start a car","definition[11]":"to push yourself up into the air, over something etc, using your legs","example[21]":"The cat jumped up onto the table.","example[22]":"He jumped over the stream.","example[23]":"His horse jumped the fence successfully.","display[0]":"skip","definition[12]":"to move forwards with little jumps between your steps, especially because you are feeling happy","example[24]":"The little girl was skipping down the street.","display[1]":"hop","definition[13]":"to jump or move around on one leg","example[25]":"He was hopping around because he’d injured his foot.","definition[14]":"to suddenly jump up high or a long way","example[26]":"The deer leapt over the fence.","example[27]":"Tina leapt onto the boat as it was moving away.","example[28]":"Fish were leaping out of the water.","display[2]":"bounce","definition[15]":"to jump up and down several times, especially on something that has springs in it","example[29]":"Children love bouncing on beds.","display[3]":"dive","definition[16]":"to jump into water with your head and arms first","example[30]":"Zoë dived into the swimming pool.","display[4]":"vault","definition[17]":"to jump over something in one movement, using your hands or a pole to help you","example[31]":"He vaulted the ticket barrier and ran for the exit.","example[32]":"Ben tried to vault over the bar.","signpost[6]":"up","definition[18]":"an act of pushing yourself suddenly up into the air using your legs","example[33]":"the best jump of the competition","example[34]":"a dancer famous for his impressive jumps","definition[19]":"an act of letting yourself drop from a place that is above the ground","example[35]":"Douglas made his first 10,000-foot parachute jump yesterday.","note[8]":"do/make a jump","definition[20]":"a sudden large increase in an amount or value","example[36]":"a jump in inflation rates","note[9]":"jump in","definition[21]":"a large or sudden change, especially one that improves things","example[37]":"The new law is a great jump forward for human rights.","signpost[7]":"something you jump over","definition[22]":"a fence, gate, or wall that a person or horse has to jump over in a race or competition","example[38]":"Her horse cleared all the jumps in the first round.","definition[23]":"to increase suddenly by a large amount","example[39]":"Share prices jumped by almost 8% yesterday.","example[40]":"Imports jumped 12% to $5.6 billion.","definition[24]":"to leave a company or organization, especially because it is not very good or very successful","example[41]":"Their chairman jumped ship for a similar position with a German electronics firm.","definition[25]":"a sudden large increase","example[42]":"The company reported an 11% jump in sales last year.","example[43]":"another big jump in crude oil prices","definition[26]":"to have or get an advantage over another person or company","example[44]":"AT&T is trying to get a jump on its rivals in the videophone market."}