{"word[0]":"tension","signpost[0]":"nervous feeling","definition[0]":"a nervous worried feeling that makes it impossible for you to relax","example[0]":"The tension was becoming unbearable, and I wanted to scream.","example[1]":"Exercise is the ideal way to relieve tension after a hard day.","note[0]":"reduce/relieve/ease etc tension","signpost[1]":"no trust","definition[1]":"the feeling that exists when people or countries do not trust each other and may suddenly attack each other or start arguing","example[2]":"In those days, there was a great deal of racial tension on campus.","note[1]":"political/racial/social etc tension","example[3]":"The obvious tension between Warren and Anne made everyone else uncomfortable.","note[2]":"tension between","signpost[2]":"different influences","definition[2]":"if there is tension between two things, there is a difference between the needs or influences of each, and that causes problems","example[4]":"In business, there’s always a tension between the needs of customers and shareholders.","signpost[3]":"tightness","definition[3]":"tightness or stiffness in a wire, rope, muscle etc","example[5]":"Tension in the neck muscles can cause headaches.","example[6]":"Muscle tension can be a sign of stress.","definition[4]":"the amount of force that stretches something","example[7]":"This wire will take 50 pounds tension.","example[8]":"There was a lot of tension on the wire before it snapped.","note[3]":"tension on","heading[0]":"– Meaning 1: a nervous worried feeling that makes it impossible for you to relax","collocation[0]":"unbearable","example[9]":"The tension was almost unbearable by the time we reached the decisive last round.","collocation[1]":"nervous tension","example[10]":"The night before the wedding my mother was in a state of nervous tension.","collocation[2]":"high tension","example[11]":"There was a moment of high tension as the firemen entered the burning building.","collocation[3]":"dramatic tension","example[12]":"This uncertainty adds to the film’s dramatic tension.","collocation[4]":"reduce/ease/relieve tension","example[13]":"Breathing deeply helps to clear my mind and reduce tension.","collocation[5]":"sense the tension","example[14]":"She could sense the tension in the room.","collocation[6]":"a state of tension","example[15]":"Marjorie lived in a constant state of tension waiting for his phone calls.","collocation[7]":"an atmosphere of tension","example[16]":"Voting took place in an atmosphere of tension.","heading[1]":"– Meaning 2: the feeling that exists when people or countries do not trust each other and may suddenly attack each other or start arguing","collocation[8]":"racial tension","example[17]":"Racial tension boiled over and riots quickly spread.","collocation[9]":"social tension","example[18]":"The economic crisis was accompanied by mounting social tension.","collocation[10]":"political tension","example[19]":"The heightened political tension could easily spill over into violence.","collocation[11]":"tension is/remains high","example[20]":"After the election, political tension remains high.","collocation[12]":"increasing/growing/mounting/rising tension","example[21]":"There are reports of increasing tension in some areas.","collocation[13]":"heightened tension","example[22]":"a time of heightened tension between the two countries","collocation[14]":"defuse tension","example[23]":"He searched for ways of defusing racial tension.","collocation[15]":"raise/increase the tension","example[24]":"The arrests only served to raise the tension.","collocation[16]":"a source of tension","example[25]":"This agreement should remove a major source of tension among America’s allies."}