{"definition[0]":"the temperature and other conditions such as sun, rain, and wind","example[0]":"What’s the weather like today?","example[1]":"The weather turned bitterly cold.","explanation[0]":"You often say the weather","example[2]":"The weather seems to be getting worse","explanation[1]":"You also often use weather with an adjective such as good or bad","example[3]":"We had good weather all week ","example[4]":"Games are sometimes cancelled because of bad weather","explanation[2]":"Don’t use weather with ‘a’","bad_example[0]":"We had a good weather","collocation[0]":"good/nice/lovely","example[5]":"We’ll go out if the weather is good.","collocation[1]":"glorious/beautiful/perfect","example[6]":"It was glorious weather, so we decided to go for a picnic.","example[7]":"Several flights were cancelled owing to bad weather.","collocation[2]":"awful/dreadful/terrible weather","example[8]":"We came home early because of the awful weather.","example[9]":"Drink lots of water in hot weather.","example[10]":"The weather was cold and grey.","collocation[3]":"fine/sunny/fair/dry","example[11]":"If the weather is fine, we’ll eat outside.","example[12]":"Water pot plants daily during spells of dry weather.","collocation[4]":"wet/rainy","example[13]":"I’m so sick of this wet weather.","collocation[5]":"windy/stormy","example[14]":"In windy weather, water from the fountain is blown onto the paths.","collocation[6]":"have good/bad etc weather","example[15]":"We have had lovely weather all week.","collocation[7]":"the weather turns","example[16]":"The weather had turned mild.","collocation[8]":"the weather holds (out)","example[17]":"The forecast said the weather should hold until Tuesday.","collocation[9]":"the weather breaks","example[18]":"We got almost all the harvest in before the weather broke.","form[0]":"weather + NOUN","collocation[10]":"the weather forecast","example[19]":"What’s the weather forecast like for the weekend?","collocation[11]":"the weather map","example[20]":"The weather map shows a band of rain coming in from the east.","collocation[12]":"weather conditions","example[21]":"The rescue was difficult because of the appalling weather conditions.","collocation[13]":"weather patterns","example[22]":"Changes in weather patterns are thought to be caused by global warming","collocation[14]":"a weather station","collocation[15]":"a weather centre","example[23]":"The London Weather Centre has issued a warning that there could be extremely heavy rain and high winds over the next 24 hours.","collocation[16]":"weather permitting","example[24]":"Breakfast is served on the terrace, weather permitting.","definition[1]":"use this to talk about whether it is hot or cold outside or whether it is raining, snowing, windy etc","example[25]":"What was the weather like on your vacation?","example[26]":"a period of warm sunny weather","display[0]":"climate","definition[2]":"the usual weather conditions in a particular country or area","example[27]":"Queensland has a warm tropical climate.","example[28]":"the climate of southern Florida","display[1]":"the outlook","definition[3]":"what the weather will probably be like for the next few days","example[29]":"The outlook for the weekend is for continued sunny weather.","display[2]":"conditions","definition[4]":"the weather at a particular time, especially when considering how this will affect a planned event or activity","example[30]":"Conditions are perfect for today’s boat race.","example[31]":"Freezing conditions are making the roads extremely hazardous.","display[3]":"the elements","definition[5]":"weather, especially bad weather","example[32]":"The equipment had been left exposed to the elements.","definition[6]":"to come through a very difficult situation safely","example[33]":"The company weathered the storm of objections to the scheme.","example[34]":"Northern Ireland weathered the recession better than any other region in the UK.","definition[7]":"if rock, wood, or someone’s face is weathered by the wind, sun, rain etc, or if it weathers, it changes colour or shape over a period of time","example[35]":"The brick has weathered to a lovely pinky-brown.","example[36]":"Her face was weathered by the sun.","definition[8]":"if a company, business etc weathers a difficult situation, it manages to come through it safely","example[37]":"Small businesses were less able toweather the recession.","example[38]":"The company hasweathered the slump better than its competitors."}