{"word[0]":"temper","definition[0]":"a tendency to become angry suddenly or easily","example[0]":"That temper of hers will get her into trouble one of these days.","example[1]":"According to Nathan, Robin has quite a temper.","example[2]":"Theo needs to learn to control his temper.","example[3]":"Be careful, he’s got a pretty violent temper.","note[0]":"quick/bad/fiery etc temper","example[4]":"Mason’s temper flared when he spotted his girlfriend kissing another man.","note[1]":"tempers flare","definition[1]":"the way you are feeling at a particular time, especially when you are feeling angry for a short time","example[5]":"Pete hit his brother in a fit of temper.","example[6]":"Watch out – she’s been in a foul temper all day.","note[2]":"be in a bad/foul temper","example[7]":"Her boss would fly into a temper if a project wasn’t done on time.","note[3]":"fly into a temper","example[8]":"It’s no use talking to him when he’s in a temper.","note[4]":"in a temper","definition[2]":"the general attitude that people have in a particular place at one time","example[9]":"the temper of life in Renaissance Italy","note[5]":"temper of","heading[0]":"– Meanings 1,2, 3 & 4","collocation[0]":"a quick/short temper","example[10]":"He’s got a quick temper, which gets him into trouble.","collocation[1]":"a bad/terrible/nasty temper","example[11]":"He ran back home in a terrible temper.","collocation[2]":"a fiery/violent/explosive temper","example[12]":"Over the years, my sister has learned to control her fiery temper.","collocation[3]":"have a temper","example[13]":"Grandad had quite a temper, so we usually tried to keep out of his way.","collocation[4]":"be in a temper","example[14]":"She banged doors and screamed at her mother when she was in a temper.","collocation[5]":"control/keep your temper","example[15]":"She tried to speak calmly and control her temper.","collocation[6]":"lose your temper","example[16]":"It was hot and I was beginning to lose my temper.","example[17]":"He flew into a temper at the slightest thing.","collocation[7]":"somebody’s temper flares","example[18]":"On bad days, Elaine’s temper would flare into a violent rage.","collocation[8]":"a fit/flash/burst of temper","example[19]":"A businessman assaulted his wife and son in a fit of temper, a court heard yesterday.","collocation[9]":"tempers get/become frayed","example[20]":"People were pushing each other, and tempers were becoming frayed.","collocation[10]":"a temper tantrum","example[21]":"My nephew has temper tantrums if he can’t get his own way.","definition[3]":"to make something less severe or extreme","example[22]":"The heat in this coastal town is tempered by cool sea breezes.","note[6]":"temper something with/by something","definition[4]":"to make metal as hard as is needed by heating it and then putting it in cold water","example[23]":"tempered steel"}