{"word[0]":"management","definition[0]":"the activity of controlling and organizing the work that a company or organization does","example[0]":"a lack of management skills","example[1]":"a management consultant","example[2]":"management training courses","example[3]":"good management and co-operation with staff","note[0]":"good/bad management","definition[1]":"the people who are in charge of a company or organization","note[1]":"middle management (=the people in charge of small groups within an organization)","example[4]":"The management has agreed to the policy.","example[5]":"The shareholders demanded a change in management.","example[6]":"management decisions","example[7]":"The factory is under new management.","example[8]":"It is difficult to retain top management.","note[2]":"senior/top management","example[9]":"a member of the senior management team","explanation[0]":"In this meaning, management is usually followed by a singular verb","example[10]":"The management is bringing in a new IT system","example[11]":"The management are bringing in a new IT system","definition[2]":"the way that people control and organize different situations that happen in their lives or their work","note[3]":"crisis management (=when you deal with an unusually difficult or dangerous situation)","example[12]":"traffic management","example[13]":"The successful applicant will have experience in project management.","example[14]":"courses in time management","example[15]":"careful management of the economy","note[4]":"management of","definition[3]":"the activity or skill of directing and controlling the work of a company or organization, or part of it","example[16]":"In banking as in every other business, good management is essential.","example[17]":"She blames the industry’s difficulties on bad management.","example[18]":"He spent 14 years with IBM in sales, marketing and general management.","example[19]":"He hasn’t been on the job long enough to establish his own distinctmanagement style (=way of managing).","definition[4]":"the people who are in charge of a particular company or organization at different levels, rather than ordinary employees","example[20]":"Management is finding ways to cut costs and improve revenue.","example[21]":"The entire management team will be restructured.","example[22]":"The management are blaming workers for the decision.","example[23]":"Should marketing management be involved in specifying detailed advertising copy?","definition[5]":"the activity of controlling and dealing with something","example[24]":"the management of resources, including fish stocks and oil"}