{"word[0]":"green","definition[0]":"having the colour of grass or leaves","example[0]":"beautiful green eyes","example[1]":"Raw coffee beans are green in colour.","example[2]":"a dark green dress","note[0]":"dark/light/pale/bright green","signpost[0]":"grassy","definition[1]":"covered with grass, trees, bushes etc","example[3]":"green fields","signpost[1]":"fruit/plant","definition[2]":"not yet ready to be eaten, or very young","example[4]":"The bananas are still green.","example[5]":"tiny green shoots of new grass","signpost[2]":"environment","definition[3]":"connected with the environment or its protection","example[6]":"green issues such as the greenhouse effect and global warming","example[7]":"He was an early champion of green politics.","definition[4]":"harming the environment as little as possible","example[8]":"We need to develop greener cleaning products.","example[9]":"The industry has promised to go green (=change so that it harms the environment less).","signpost[3]":"without experience","definition[5]":"young and lacking experience","synonym[0]":"naive","example[10]":"I was pretty green then; I had a lot of things to learn.","definition[6]":"looking pale and unhealthy because you are ill","note[1]":"look green about/around the gills (=look pale and ill)","example[11]":"George looked a bit green the next morning.","definition[7]":"the colour of grass and leaves","example[12]":"a room decorated in pale blues and greens","example[13]":"different shades of green","definition[8]":"a level area of grass, especially in the middle of a village","example[14]":"I walked home across the green.","definition[9]":"a smooth flat area of grass around each hole on a golf course","example[15]":"the 18th green","definition[10]":"someone who belongs to or supports a political party which thinks the protection of the environment is very important","example[16]":"The Greens have 254 candidates in the election.","definition[11]":"to fill an area with growing plants in order to make it more attractive","example[17]":"Existing derelict land is needed for greening the cities.","definition[12]":"to make a person or organization realize the importance of environmental problems","definition[13]":"connected with protecting the environment or harming it as little as possible","example[18]":"These revelations will damage the company’s green image.","example[19]":"Voters see very little difference between the main political parties on green issues."}