{"word[0]":"future","definition[0]":"likely to happen or exist at a time after the present","note[0]":"future wife/husband/son-in-law etc (=someone who will be your wife, husband, son-in-law etc)","example[0]":"We are now more able to predict future patterns of climate change.","example[1]":"We’ve been able to save this land from development and preserve it for future generations.","example[2]":"the debate over the future development of the European Union","definition[1]":"the form of a verb used for talking about things that are going to happen","example[3]":"the future tense","definition[2]":"what someone or something will do or what will happen to them in the future","example[4]":"The islands should have the right to decide their own future.","example[5]":"a leader who will shape the organization’s future ","example[6]":"Ferguson is optimistic about the future of the business.","note[1]":"future of","collocation[0]":"predict the future","example[7]":"No-one can predict the future of boxing.","collocation[1]":"foretell the future","example[8]":"Some people think that dreams can foretell the future.","collocation[2]":"see/look into the future","example[9]":"I wish I could see into the future.","collocation[3]":"look to the future","example[10]":"She could now look to the future with confidence.","collocation[4]":"plan for the future","example[11]":"As soon as she knew she was pregnant, she started to plan for the future.","collocation[5]":"face a bleak/grim etc future","example[12]":"Many pensioners face a bleak future.","collocation[6]":"shape somebody's future","example[13]":"Your boss is the one who writes your evaluations, recommends you for promotions and shapes your future.","collocation[7]":"somebody’s/something’s future lies in/with something","example[14]":"The country’s economic future lies with its skilled workforce.","collocation[8]":"the future looks good/bright etc","example[15]":"The future looks good for the company.","collocation[9]":"great/good","example[16]":"The country has a great future.","collocation[10]":"bright/promising","example[17]":"Her future as a tennis player looks promising.","collocation[11]":"uncertain","example[18]":"The college's future is now uncertain.","collocation[12]":"bleak/grim/dark","example[19]":"The theatre is losing money and its future looks bleak.","collocation[13]":"the immediate future","example[20]":"There will be no major changes in the immediate future.","collocation[14]":"the near future","example[21]":"A new product launch is planned for the near future.","collocation[15]":"the distant future","example[22]":"I don't worry about what might happen in the distant future.","collocation[16]":"the dim and distant future","example[23]":"He plans to get married in the dim and distant future.","collocation[17]":"for/in the foreseeable future","example[24]":"The population is expected to keep growing for the foreseeable future.","collocation[18]":"in the not too distant future","example[25]":"We’re planning to go there again in the not too distant future.","collocation[19]":"somebody’s hopes/fears/plans for the future","example[26]":"What are your hopes for the future?","collocation[20]":"somebody’s worries/concerns about the future","example[27]":"their worries about the future of the English countryside","collocation[21]":"what the future holds","example[28]":"He is worried about what the future holds for the company.","heading[0]":"the time after now","display[0]":"the future","example[29]":"What will life be like in the future?","example[30]":"The company is hoping to expand in the near future (=soon).","display[1]":"from now on","definition[3]":"used when saying that something will always happen in the future, starting from now","example[31]":"From now on, I’m not letting anyone borrow my car.","example[32]":"The meetings will be held once a month from now on.","example[33]":"From now on, you will have to make your own lunch.","example[34]":"From now on, homeowners will have to get a city permit if they want to build an addition onto their homes.","display[2]":"years/days etc to come","definition[4]":"for a long time in the future","example[35]":"In years to come, people will look back on the 20th century as a turning point in history.","example[36]":"Nuclear power stations will still be needed for a long time to come.","display[3]":"in the long/short/medium term","definition[5]":"use this to talk about what will happen over a period from now until a long, short etc time in the future","example[37]":"We don’t know what will happen in the long term.","example[38]":"In the short term, things look good.","example[39]":"Aid to these countries is bound to run into billions of dollars in the long term.","display[4]":"on the horizon","definition[6]":"used when talking about what is likely to happen in the future","example[40]":"There are some big changes on the horizon.","heading[1]":"what will happen to somebody/something","display[5]":"somebody’s/something’s future","definition[7]":"what will happen to someone or something","example[41]":"He knew that his future was in films.","example[42]":"Shareholders will meet to decide the company’s future.","display[6]":"fate","definition[8]":"someone or something’s future – used especially when you are worried that something bad could happen","example[43]":"The fate of the hostages remains uncertain.","example[44]":"The show’s fate lies in the hands of TV bosses.","display[7]":"destiny","definition[9]":"what will happen to someone in their life, especially something important","example[45]":"Sartre believed that everyone is in charge of their own destiny.","example[46]":"He thinks that it is his destiny to lead the country.","display[8]":"the outlook","definition[10]":"what will happen, especially concerning business, the economy, or the weather","example[47]":"The economic outlook looks good.","example[48]":"Here is the weather outlook for tomorrow.","display[9]":"prospect","definition[11]":"the idea or possibility that something will happen","example[49]":"the awful prospect of another terrorist attack","example[50]":"Prospects for a peace settlement don’t look too good.","display[10]":"fortune","definition[12]":"what will happen to a person, organization etc in the future – used especially when talking about whether or not they will be successful","example[51]":"Fans are hoping for a change in the club’s fortunes.","example[52]":"Two years ago, my financial fortunes took a turn for the better  (=they improved).","example[53]":"In 1680 he decided that his fortune lay in the theatre."}