{"word[0]":"permanent","definition[0]":"continuing to exist for a long time or for all the time in the future","opposite[0]":"temporary","example[0]":"He gave up a permanent job in order to freelance.","example[1]":"a permanent change in your eating habits","example[2]":"The blindness that the disease causes will be permanent.","example[3]":"Miller soon became a permanent fixture (=someone or something that is always there) on the team.","definition[1]":"continuing forever, for a very long time, or for the rest of your life","example[4]":"She has permanent damage to her eyesight.","example[5]":"the search for a permanent solution to the problem","example[6]":"They’ve offered her the job on a permanent basis.","display[0]":"lasting","definition[2]":"continuing for a very long time – used especially when something continues to affect someone or something for a long time","example[7]":"The experience left a lasting impression on him.","example[8]":"Things that happen in early childhood can have a lasting effect on your life.","example[9]":"Shelley was to have a lasting influence on him.","example[10]":"Is there any hope for a lasting peace in the Middle East?","display[1]":"never-ending","definition[3]":"continuing so long that you think it will never end – used especially when something needs a lot of effort","example[11]":"Keeping the house clean is a never-ending battle.","example[12]":"It was a never-ending task.","example[13]":"The search was never-ending.","display[2]":"perpetual","definition[4]":"a perpetual state or feeling seems to be there all the time – used especially about something that is very annoying, worrying, or tiring","example[14]":"For many working mothers, balancing the demands of children and job is a perpetual challenge.","example[15]":"The people live in a perpetual state of fear.","display[3]":"everlasting","definition[5]":"continuing forever – used especially in the following phrases","example[16]":"Gold is the symbol of everlasting love.","example[17]":"He promised them everlasting life.","display[4]":"eternal","example[18]":"Do you believe in eternal life?","example[19]":"the secret of eternal youth","example[20]":"She has my eternal gratitude (=I will always be grateful to her).","example[21]":"You’re always the eternal optimist.  (=you always think that good things will happen)","definition[6]":"a perm1","definition[7]":"a contract, job etc that is intended to continue for a long time or for ever","example[22]":"The company has created 650 permanent jobs.","example[23]":"He is acting chief executive, and under consideration for a permanent appointment.","definition[8]":"an employee, worker etc whom a company intends to employ for a long time or for ever","example[24]":"The company said some of the plant’s 900 permanent employees would be reassigned."}