{"definition[0]":"the end of something, especially something pointed","example[0]":"lights on the wing tips of aeroplanes","example[1]":"He kissed the tip of her nose.","note[0]":"tip of","example[2]":"the southern tip of South America","definition[1]":"a small amount of additional money that you give to someone such as a waiter or a taxi driver","example[3]":"Did you leave a tip?","example[4]":"a $5 tip","example[5]":"I gave the guy a big tip.","note[1]":"large/generous/big tip","definition[2]":"a helpful piece of advice","example[6]":"Perhaps she could give us a few tips.","example[7]":"gardening tips","example[8]":"handy tips for decorating a small flat","note[2]":"handy tip","example[9]":"This week's magazine has some tips on healthy eating.","note[3]":"tip on/for","signpost[0]":"waste","definition[3]":"an area where unwanted waste is taken and left","synonym[0]":"dump","example[10]":"a rubbish tip","example[11]":"I’ll take this lot to the tip.","signpost[1]":"untidy","definition[4]":"an extremely dirty or untidy place","example[12]":"The house was an absolute tip.","signpost[2]":"horse race","definition[5]":"special information about which horse will win a race","signpost[3]":"warning","definition[6]":"a secret warning or piece of information, especially to police about illegal activities","example[13]":"Acting on a tip, the police were able to find and arrest Upton.","heading[0]":"– Meaning 2: a small amount of additional money that you give to someone such as a waiter or a taxi driver","collocation[0]":"leave a tip","example[14]":"Aren’t you going to leave a tip?","collocation[1]":"give somebody a tip","example[15]":"Kim gave the driver a tip.","collocation[2]":"a big/large/generous tip","example[16]":"The service was great and we left a large tip.","collocation[3]":"a 5%/10% etc tip","example[17]":"A 15% tip is customary in restaurants.","collocation[4]":"a £2/$5 tip","example[18]":"He gave the waitress a $10 tip.","heading[1]":"– Meaning 3: a helpful piece of advice","example[19]":"He gave me some tips on how to improve my game.","collocation[5]":"pass on a tip","example[20]":"The writer passes on many tips that she has learned over the years.","collocation[6]":"follow a tip","example[21]":"To keep your bike in good condition, follow these simple tips.","collocation[7]":"pick up a tip","example[22]":"If you listen to the show, you’ll pick up some really useful gardening tips.","form[0]":"ADJECTIVES/NOUN + tip","collocation[8]":"a good/useful/helpful/handy tip","example[23]":"Go to their website to find useful tips on buying and selling a home.","collocation[9]":"a simple tip","example[24]":"He has some simple tips for saving money when you're at the supermarket.","collocation[10]":"cooking tips","example[25]":"Most recipes come with added cooking tips.","example[26]":"Marie was always willing to share her gardening tips.","collocation[11]":"beauty tips","example[27]":"The article contains some useful beauty tips.","collocation[12]":"safety tips","example[28]":"Ensure the safety of your family with a few simple safety tips from the Fire Service.","signpost[4]":"lean","definition[7]":"to move into a sloping position, so that one end or side is higher than the other, or to make something do this","synonym[1]":"tilt","example[29]":"His helmet had tipped forward and the boy pushed it back.","note[4]":"tip forward/back/to etc","example[30]":"Eric fell asleep, his head gently tipping to one side.","example[31]":"‘So what?’ asked Brian, tipping his chair back on its rear legs.","note[5]":"tip something forward/back etc","definition[8]":"to pour something from one place or container into another","example[32]":"Tip the onions and oil into a large ovenproof dish.","note[6]":"tip something onto/into something","example[33]":"Ben tipped the contents of the drawer onto the table.","example[34]":"Shall I tip the water out?","note[7]":"tip something out","signpost[5]":"give money","definition[9]":"to give an additional amount of money to someone such as a waiter or taxi driver","example[35]":"Did you tip the waiter?","example[36]":"I tipped him $5.","note[8]":"tip somebody something","signpost[6]":"be likely to succeed","definition[10]":"if someone or something is tipped to do something, people think that they are most likely to succeed in doing it","example[37]":"He had been widely tipped to get the new post of deputy director.","note[9]":"widely/strongly/hotly tipped","example[38]":"the man tipped to become the next president","note[10]":"be tipped to do something","example[39]":"He’s tipped as a future world champion.","note[11]":"be tipped for/as something","explanation[0]":"Tip is usually passive in this meaning","definition[11]":"a piece of advice about what is likely to happen, for example about which shares are likely to go up or down in value","example[40]":"a stock market tip","example[41]":"Many clients boast about their broker or their man in the City who gives them tips.","definition[12]":"a small amount of additional money that you give to someone such as a waiter in order to thank them for their services","example[42]":"She gave the taxi driver a £5 tip.","definition[13]":"to say who you think is most likely to do something or be successful","example[43]":"He’s tipped to replace the chief executive.","example[44]":"Journalists are tipping her for rapid promotion.","note[12]":"tip somebody for something","definition[14]":"to give advice about something, for example about which shares are likely to go up or down in value","example[45]":"These shares were tipped in the Investor’s Chronicle.","example[46]":"Technology-company profits, expected to rise by 29% at the start of the quarter, are now tipped to rise by only 10%.","definition[15]":"to give a small amount of additional money to someone such as a waiter in order to thank them for their services","example[47]":"He tipped the taxi driver £2.","example[48]":"According to the waiters, she always tips generously."}