{"signpost[0]":"buying or selling goods or services","definition[0]":"the activity of making money by producing or buying and selling goods, or providing services","example[0]":"Students on the course learn about all aspects of business.","example[1]":"Carl began in the music business by running a recording studio.","example[2]":"We do business with a number of Italian companies.","example[3]":"He has a wide range of business interests.","explanation[0]":"Don’t use ‘the business’ when talking in general about the activity of making money You say","example[4]":"Tourism is good for business","bad_example[0]":"Tourism is good for the business","signpost[1]":"company","definition[1]":"an organization such as a company, shop, or factory that produces or sells goods or provides a service","example[5]":"She now has her own $25 million home-shopping business.","example[6]":"They don’t know how to run a business.","example[7]":"The company began as a small family business.","signpost[2]":"how much work a company has","definition[2]":"the amount of work a company does or the amount of money it makes","example[8]":"We’re now doing twice as much business as we did last year.","example[9]":"Exports account for 72% of overall business.","example[10]":"Business is slow during the summer.","note[0]":"business is good/bad/slow etc","example[11]":"Perot was in Europe, drumming up business for his new investment company.","note[1]":"drum up business","signpost[3]":"for your job","definition[3]":"work that you do as part of your job","example[12]":"She’s in New York this week on business (=for her work).","example[13]":"Hi Maggie! Is this phone call business or pleasure?","example[14]":"useful business contacts","example[15]":"We discussed the idea over a business lunch.","note[2]":"business trip/meeting etc","signpost[4]":"what someone should be involved in","definition[4]":"if something is not your business or none of your business, you should not be involved in it or ask about it","example[16]":"It was not her business, she decided, to ask where the money came from.","example[17]":"It’s none of your business how much I weigh.","example[18]":"‘Who’s that girl you were with?’ ‘Mind your own business (=Don’t ask questions about something that does not concern you)!’","example[19]":"‘Are you going out with Kate tonight?’ ‘That’s my business  (=it doesn’t concern you, so don’t ask me questions about it)’.","definition[5]":"if it is someone’s business to do something, it is their duty or responsibility to do it","example[20]":"It is the business of government to listen to the various groups within society.","note[3]":"it is the business of somebody to do something","signpost[5]":"things to be dealt with","definition[6]":"things that need to be done or discussed","example[21]":"Okay, let’s get down to business (=start doing or discussing something).","example[22]":"‘Is there any other business?’ the chairman asked.","signpost[6]":"matter","definition[7]":"a situation or activity, especially one that you have a particular opinion about or attitude towards","example[23]":"Tanya found the whole business ridiculous.","example[24]":"Leon regards keeping fit as a serious business.","note[4]":"a serious/strange/funny etc business","heading[0]":"– Meaning 1: the activity of making money by producing or buying and selling goods, or providing services","collocation[0]":"do business","example[25]":"A lot of firms are keen to do business in Japan.","collocation[1]":"conduct business","example[26]":"It is not a sensible way to conduct business.","collocation[2]":"go into business","example[27]":"A lot of university graduates want to go into business.","collocation[3]":"set up/start up in business","example[28]":"The bank gave me a loan to help me set up in business.","collocation[4]":"stay in business","example[29]":"Even if they manage to stay in business for another year, their long-term survival remains under threat.","example[30]":"Some stores are finding it hard to stay in business.","collocation[5]":"go out of business","example[31]":"In a recession smaller firms often go out of business.","form[0]":"NOUN + business","collocation[6]":"the music/entertainment/computer etc business","example[32]":"He started out working in the computer business.","form[1]":"business + NOUN","collocation[7]":"a business deal","example[33]":"Negotiation is the most important part of a business deal.","collocation[8]":"business activities","example[34]":"His wife refused to get involved in his business activities.","collocation[9]":"business interests","example[35]":"Both companies have substantial business interests in Indonesia.","collocation[10]":"the business community","example[36]":"There was pressure on the government from the business community.","collocation[11]":"the business world","example[37]":"You need to be flexible in today’s highly competitive business world.","collocation[12]":"business studies","example[38]":"She did business studies at college.","heading[1]":"– Meaning 2: an organization such as a company, shop, or factory that produces or sells goods or provides a service","collocation[13]":"have/own a business","example[39]":"Nick owned a software business in Boston.","collocation[14]":"run a business","example[40]":"There’s plenty of advice available on how to run your own business.","collocation[15]":"start/set up a business","example[41]":"When you’re starting a business, you have to work longer hours.","collocation[16]":"take over a business","example[42]":"When my father retired, I took over the business.","collocation[17]":"build (up)/develop a business","example[43]":"He spent years trying to build a business in Antigua.","collocation[18]":"establish a business","example[44]":"She overcame many financial difficulties to establish her business.","collocation[19]":"a business succeeds","example[45]":"Making a business succeed is not simple.","collocation[20]":"a business collapses/fails","example[46]":"35% of small businesses fail in the first year of operation.","form[2]":"ADJECTIVES/NOUN + business","collocation[21]":"a small business","example[47]":"Many small businesses have been badly hit by the recession.","collocation[22]":"a medium-sized business","example[48]":"They offer services to small and medium-sized businesses.","collocation[23]":"a software/catering/construction etc business","example[49]":"His girlfriend runs a catering business.","collocation[24]":"a family business","example[50]":"For many years the hotel was a family business.","collocation[25]":"an import/export business","example[51]":"Kingwell had an export business in New Zealand.","collocation[26]":"a successful/profitable/thriving business","example[52]":"Within a few years she had established a thriving business in London.","collocation[27]":"a viable business","example[53]":"It soon became clear that the restaurant was not a viable business.","collocation[28]":"a business partner","example[54]":"Margie was his wife and also his business partner.","collocation[29]":"a business manager","example[55]":"We need to take on a business manager to deal with some of the admin.","collocation[30]":"a business customer/client","example[56]":"We’re providing our business customers with reliable, proven Internet technology.","definition[8]":"the activity of making money by producing, buying, or selling goods, or providing services","example[57]":"Business in Europe has been badly affected by economic conditions in the US.","example[58]":"He works in the advertising business.","display[0]":"trade","definition[9]":"the buying and selling of goods and services, especially between countries","example[59]":"Trade between European countries became easier after the introduction of the Euro.","example[60]":"a trade agreement","display[1]":"commerce","definition[10]":"the buying and selling of goods and services. Commerce is more formal than business, and is used when talking about business activities in general","example[61]":"One of the roles of the federal government is to regulate commerce.","example[62]":"London became a great centre of commerce.","example[63]":"the local chamber of commerce (=an organization which the companies and shops in an area belong to)","display[2]":"e-commerce","definition[11]":"the buying and selling of goods and services on the Internet","example[64]":"E-commerce is a fast-growing part of the US economy.","definition[12]":"the production, buying, and selling of goods or services for profit","example[65]":"We are in business to create profit.","example[66]":"The company says it will never do business with the bank again.","example[67]":"Mr Guerlain learned the perfume business in Grasse.","definition[13]":"to start working in the production, buying, and selling of goods or services","example[68]":"She wanted to quit working as a hostess and go into business on her own.","definition[14]":"to stop operating as a company, usually because of BANKRUPTCY","example[69]":"1,800 furniture store companies went out of business last year.","definition[15]":"used to say that profit is the most important thing","example[70]":"With these guys, business is business, and charity and public works are not part of it.","definition[16]":"the work that you do as part of your job","example[71]":"Adam’s in Argentina on business.","example[72]":"Companies are looking hard at the need for many business trips.","definition[17]":"a person or organization that produces and sells goods or services","example[73]":"Do you want to manage your own business?","example[74]":"She runs a business finding and restoring old cars.","example[75]":"He works for a catering business.","definition[18]":"the amount of work a company has or is doing","example[76]":"Soon he had so much business he had to subcontract.","example[77]":"The company isn’t doing much business in Japan.","example[78]":"The economy is growing, jobs are plentiful and business is good.","example[79]":"The promotional fares are designed to drum up business (=increase it) during the slower fall period.","definition[19]":"work that must be done in a particular job or period of time","example[80]":"We discussed this week’s business.","example[81]":"the routine business of government","definition[20]":"to start dealing with an important subject","example[82]":"He offers juice or tea before getting down to business.","definition[21]":"used to tell you that a shop or business is working normally when you might think it was working in a different way, or was closed","example[83]":"The retailer says it intends to do business as usual during its reorganization.","example[84]":"The market is shut today for Bastille day, but tomorrow it is business as usual."}