{"word[0]":"forward","definition[0]":"towards a place or position that is in front of you","opposite[0]":"backwards","example[0]":"He leaned forward, his elbows resting on the table.","example[1]":"The crowd surged forwards.","example[2]":"She took another small step forward.","definition[1]":"towards greater progress, improvement, or development","example[3]":"We agreed that the sensible way forward was for a new company to be formed.","example[4]":"After the Labour Party conference, he stated that we could now go forward as a united party.","example[5]":"Britain is now ready to move forward.","definition[2]":"towards the future in a way that is hopeful","example[6]":"I felt that at last I could begin to look forward.","definition[3]":"if you put a clock or a watch forward, you change it so that it shows a later time, for example when the time changes to British Summer Time","example[7]":"We put our watches forward by 2 hours.","example[8]":"The clocks go forward this weekend.","definition[4]":"in or towards the front part of a ship","definition[5]":"closer to a person, place, or position that is in front of you","opposite[1]":"backward","example[9]":"Army roadblocks prevented any further forward movement.","example[10]":"Always enter or leave a helicopter from a forward direction.","definition[6]":"at or near the front of a ship, vehicle, building etc","opposite[2]":"rear","example[11]":"We sat in one of the forward sections of the train.","definition[7]":"too confident and friendly in dealing with people you do not know very well","example[12]":"My father thinks she’s far too forward for a young girl.","definition[8]":"to send letters, goods etc to someone when they have moved to a different address","synonym[0]":"send on","example[13]":"Would you make sure that you forward my mail promptly?","definition[9]":"to send letters, information etc to someone","example[14]":"Flight times will be forwarded to you with your travel documentation.","note[0]":"forward something to somebody","definition[10]":"to help something to develop so that it becomes successful","synonym[1]":"further","example[15]":"a good chance to forward my career","definition[11]":"an attacking player on a team in sports such as football and basketball","definition[12]":"to send goods, documents, money etc somewhere, often after receiving them from somewhere else","example[16]":"These investors get company financial reports and dividends forwarded to them by their brokers.","example[17]":"The US embassy in San Jose had already forwarded the papers to the Costa Rican government.","definition[13]":"a forward TRANSACTION (=when something is bought and sold) is one in which a fixed amount of a currency or a COMMODITY (=oil, metal, farm product etc) is bought at a fixed price for delivery on a fixed future date","example[18]":"Zinc producers should view any strong rises in forward prices as forward selling opportunities.","example[19]":"The government plans to open a futures market for forward trading of agricultural goods vulnerable to price changes.","definition[14]":"used on a BILL OF LADING to show that the costs of sending goods is to be paid by the person receiving them when they are delivered"}