{"word[0]":"obligation","definition[0]":"a moral or legal duty to do something","example[0]":"Employers have an obligation to treat all employees equally.","example[1]":"Parents are under a legal obligation to educate their children.","example[2]":"You are under no obligation to buy any more books.","example[3]":"Greater resources are needed to meet these obligations.","example[4]":"the rights and obligations imposed on them by treaties","example[5]":"The government must pay for health care for war veterans – it is an obligation we owe to them.","example[6]":"a moral obligation to help the poor","example[7]":"He stayed with the team out of a sense of obligation.","example[8]":"America’s obligation to its allies","note[0]":"obligation to","collocation[0]":"have an obligation","example[9]":"Citizens have an obligation to obey the law.","collocation[1]":"feel an obligation","example[10]":"When his mother died, he felt an obligation to continue her work.","collocation[2]":"meet/fulfil/honour an obligation","example[11]":"The company has been unable to meet its financial obligations.","example[12]":"All member states must fulfil their obligations according to the EC treaty.","example[13]":"The government failed to honour its obligations under the terms of the agreement.","collocation[3]":"impose an obligation","example[14]":"A contract imposes certain obligations on employees and employers.","collocation[4]":"owe an obligation to somebody","example[15]":"He owed an obligation of loyalty to his king.","collocation[5]":"an obligation arises","example[16]":"the obligations arising out of the treaty","collocation[6]":"be under an obligation","example[17]":"The landlord is under an obligation to repair the house.","collocation[7]":"be under no obligation","example[18]":"An accused man is under no obligation to say anything.","collocation[8]":"a sense of obligation","example[19]":"the sense of obligation that you feel towards your family","collocation[9]":"a moral/legal/social obligation","example[20]":"We have a moral obligation to take care of our environment.","collocation[10]":"a statutory obligation","example[21]":"The Local Authority has a statutory obligation to provide education.","collocation[11]":"a contractual obligation","example[22]":"The company must refund your money in line with their contractual obligations.","collocation[12]":"a binding obligation","example[23]":"These clauses are legally binding obligations on both parties.","definition[1]":"a legal or moral duty to do something","example[24]":"I think companies should have a legal obligation to recycle their products at the ends of their lives.","note[1]":"obligation to do something","example[25]":"It’s our obligation to provide a telephone service at the lowest possible cost.","example[26]":"We’ve fulfilled our obligation to the creditors and shareholders.","example[27]":"The firm failed to meet its contractual obligations (=do what the contract said it should do).","definition[2]":"to have to do something because it is a legal or moral duty","example[28]":"The water company is under an obligation to enhance drinking water standards.","example[29]":"The government is under no obligation to finance the museum.","note[2]":"be under no obligation to do something","definition[3]":"if you are invited to look at a product or service without obligation, you can look at it without having to buy it","example[30]":"This mortgage advice is completely free and without obligation."}