{"word[0]":"corner","signpost[0]":"where two lines/edges meet","definition[0]":"the point at which two lines or edges meet","example[0]":"He pulled a dirty handkerchief out by its corner and waved it at me.","example[1]":"a three-cornered hat","note[0]":"three-cornered/four-cornered etc","example[2]":"Their initials were sewn on the corner of every pillow.","note[1]":"corner of","example[3]":"The TV station’s name appears in the corner of the screen.","note[2]":"in the corner (of something)","example[4]":"Jessie sat on the corner of her bed.","note[3]":"on the corner (of something)","definition[1]":"the point where two roads meet","example[5]":"kids hanging around on street corners","example[6]":"Ruth walked with her as far as the corner of the road.","example[7]":"The hotel is on the corner of 5th and Maine.","note[4]":"on the corner","example[8]":"Several women were standing at the corner, talking to two police officers.","note[5]":"at the corner","definition[2]":"a point in a road where it turns sharply","example[9]":"He had tried to take the corner too quickly, and had lost control of the car.","example[10]":"The petrol station is around the corner.","signpost[1]":"corner of a room/box","definition[3]":"the place inside a room or box where two walls or sides meet","example[11]":"I reserved a corner table in my favourite restaurant.","note[6]":"corner table/seat","example[12]":"There was an old piano in the corner of the living room.","signpost[2]":"mouth/eye","definition[4]":"the sides of your mouth or eyes","example[13]":"A tear appeared in the corner of his eye.","signpost[3]":"difficult situation","definition[5]":"a difficult situation that you cannot easily escape from","example[14]":"The writers have painted themselves into a corner by killing off all the most popular characters in the first series.","example[15]":"He found himself in a tight corner (=a very difficult situation) looking for a way to get out.","example[16]":"Don’t let your enemies back you into a corner.","note[7]":"back/box/force/push somebody into a corner","definition[6]":"a kick or hit that one team is allowed to take from one of the corners of their opponent’s end of the field","definition[7]":"any of the four corners of the area in which the competitors fight in boxing or wrestling, especially one of the two corners where the competitors go in between rounds","signpost[4]":"distant place","definition[8]":"a distant place in another part of the world","example[17]":"People came from the four corners of the world (=from lots of different places) to make America their new home.","example[18]":"She’s gone off to work in some remote corner of the world.","heading[0]":"– Meaning 1: the point at which two lines or edges meet","collocation[0]":"the top/bottom corner","example[19]":"The ball flew straight into the top corner of the net.","collocation[1]":"the left/left-hand corner","example[20]":"We followed the path to the left-hand corner of the field.","collocation[2]":"the right/right-hand corner","example[21]":"Put your address in the top right-hand corner of the page.","collocation[3]":"the southeast/northwest etc corner of something","example[22]":"I was staying in the southwest corner of the island.","collocation[4]":"the four corners of something","example[23]":"Each team was based in one of the four corners of the pool.","collocation[5]":"the far/opposite corner of something","example[24]":"Something was moving in the far right corner of the garden.","collocation[6]":"a quiet corner","example[25]":"He sat on his own in a quiet corner of the library.","collocation[7]":"a shady corner","example[26]":"Plant the herbs in a shady corner of the garden.","form[0]":"ADJECTIVES/NOUN + corner","collocation[8]":"a tight/sharp corner","example[27]":"Go slowly because there’s a sharp corner up ahead.","collocation[9]":"a blind corner","example[28]":"The car had come speeding around a blind corner much too fast.","collocation[10]":"a street corner","example[29]":"There’s a newspaper shop on the street corner.","collocation[11]":"turn the corner","example[30]":"I walked on and turned the corner into Church Road.","collocation[12]":"come/go around a corner","example[31]":"At that moment, a police car came around the corner.","collocation[13]":"round a corner","example[32]":"A tall good-looking man rounded the corner.","collocation[14]":"take a corner","example[33]":"He took the corner too fast and crashed into a tree.","collocation[15]":"disappear around a corner","example[34]":"We watched the two boys disappear around the corner.","collocation[16]":"cut a corner","example[35]":"I crashed into a motorcyclist who had cut the corner.","collocation[17]":"stand on a corner","example[36]":"She stood on the corner saying goodnight to Michael.","definition[9]":"to force a person or animal into a position from which they cannot easily escape","example[37]":"Once the dog was cornered, he began to growl.","definition[10]":"to go to someone who is trying to avoid you, and make them listen to you","example[38]":"Later, he cornered Jenny on the stairs and asked her what was wrong.","definition[11]":"if a car corners, it goes around a corner or bend in the road","definition[12]":"to gain control of the whole supply of a particular type of goods or services","example[39]":"Singapore has made significant efforts to corner the market in this type of specialised service company."}