{"word[0]":"continual","definition[0]":"continuing for a long time without stopping","synonym[0]":"constant","example[0]":"five weeks of continual rain","example[1]":"the Japanese business philosophy of continual improvement","definition[1]":"repeated many times, often in a way that is harmful or annoying","example[2]":"She has endured house arrest and continual harassment by the police.","definition[2]":"continuing for a long time without stopping, or happening many times in a way that is annoying or causes problems","example[3]":"There has been a continual improvement in standards.","example[4]":"There were continual interruptions all day.","example[5]":"The couple were having continual arguments and they decided that the best thing to do was to split up.","display[0]":"continuous","definition[3]":"continuing without stopping","example[6]":"a continuous process of change","example[7]":"I've had six continuous hours of meetings.","example[8]":"The machines have remained in continuous service over the last six years without any problem.","definition[4]":"used when saying that something does not stop or always stays the same, or that something keeps happening. Constant is often used about things that are worrying, frightening, or difficult","example[9]":"There is a constant stream of water coming out of the ground.","example[10]":"The plane was traveling at a constant speed of 650 kilometres an hour.","example[11]":"The refugees live in constant fear of attack.","example[12]":"There is always the constant threat of war.","example[13]":"His illness makes life a constant struggle for him and his parents.","example[14]":"The photographs are a constant reminder  (=something that makes you keep remembering something) of what happened in Bosnia.","display[1]":"uninterrupted","definition[5]":"continuing for a long time without anything stopping it – used especially when it is important for something to continue","example[15]":"Women with small babies seldom get more than two or three hours of uninterrupted sleep.","example[16]":"The nation has enjoyed nine years of uninterrupted economic growth.","example[17]":"The system helps to maintain an uninterrupted flow of traffic.","example[18]":"an uninterrupted view of the mountains","display[2]":"non-stop","definition[6]":"continuing for a long time without stopping – used especially about rain, journeys, work, or entertainment","example[19]":"two days of nonstop rain","example[20]":"a nonstop flight to Tokyo","example[21]":"The concert will be seven hours of non-stop entertainment.","example[22]":"They worked non-stop.","display[3]":"on-going","definition[7]":"if work or a situation is on-going, it will continue into the future, though there will be pauses in it","example[23]":"The police said the investigation is on-going.","example[24]":"ongoing negotiations","display[4]":"solid","definition[8]":"used when emphasizing that you do something all through a period of time, with no breaks at all","example[25]":"After eight solid hours of driving, I was exhausted.","example[26]":"It took two solid weeks of work to fix the tunnel."}