{"word[0]":"protect","definition[0]":"to keep someone or something safe from harm, damage, or illness","example[0]":"Are we doing enough to protect the environment?","example[1]":"The cover protects the machine from dust.","note[0]":"protect somebody/something from something","example[2]":"Physical exercise can protect you against heart disease.","note[1]":"protect somebody/something against something","example[3]":"Waxing your car will help protect against rust.","note[2]":"protect against something","definition[1]":"if an insurance company protects your home, car, life etc, it agrees to pay you money if things are stolen or damaged or you are hurt or killed","synonym[0]":"cover","example[4]":"Unemployment insurance means that you are partially protected if you lose your job.","explanation[0]":"Protect is usually passive in this meaning","definition[2]":"to help the industry and trade of your own country by taxing or restricting foreign goods","example[5]":"Don’t worry, I’ll protect you.","example[6]":"The government wants to protect the environment.","example[7]":"Eating healthily helps to protect against many diseases.","display[0]":"give/offer/provide protection","definition[3]":"to protect someone from something harmful","example[8]":"Wearing a hat offers some protection from the sun.","example[9]":"The drug can give protection against cancer.","example[10]":"The law provides no protection.","display[1]":"guard","definition[4]":"to protect a person, place, or object by staying near them and watching them","example[11]":"Police officers guarded the entrance to the building.","example[12]":"He is guarded by armed men.","definition[5]":"to protect someone or something when they are in danger of being harmed or destroyed","example[13]":"Local people are fighting to save the theatre from demolition.","example[14]":"Emergency aid could save millions of people who are threatened with starvation.","display[2]":"preserve","definition[6]":"to keep something, especially buildings or the environment, from being harmed, destroyed, or changed too much","example[15]":"The organization works to preserve forests.","example[16]":"There is little money for preserving historic buildings.","display[3]":"safeguard","definition[7]":"to protect something important, such as people’s rights, interests, jobs, health etc","example[17]":"The deal will safeguard 200 jobs at the factory.","example[18]":"Laws should do more to safeguard the rights of victims.","display[4]":"shield","definition[8]":"to put something in front of something else to protect it. Also used to talk about protecting people from unpleasant situations","example[19]":"He lifted his hand to shield his eyes from the light.","example[20]":"They thought the public should be shielded from the truth.","display[5]":"shelter","definition[9]":"to provide a place where someone or something is protected from the weather or from danger","example[21]":"The village is sheltered by a belt of trees.","example[22]":"His family had sheltered Jews during the war.","display[6]":"harbour","definition[10]":"to help and protect someone who has done something illegal, and prevent the police from finding them","example[23]":"He is accused of harbouring suspected terrorists.","definition[11]":"to keep someone or something safe from harm, damage, bad influences etc","example[24]":"laws protecting the rights of disabled people","example[25]":"P&G wants to protect its $180 million investment by obtaining a 10-year extension of three patents.","example[26]":"The wage index system protects workers against inflation.","note[3]":"protect (somebody/something) against","definition[12]":"to try to help an industry in your own country by taxing foreign goods that are competing with it, so limiting the number that can be imported","example[27]":"For decades, the Mexican government protected its domestic growers by regulating corn imports.","definition[13]":"to provide insurance against damage to your home, car, etc","example[28]":"Having unemployment insurance means that you are partially protected if you lose your job."}