{"signpost[0]":"to a lower position","definition[0]":"to or towards a lower place or position","opposite[0]":"up","example[0]":"David bent down to tie his shoelace.","example[1]":"Get down off the table.","example[2]":"Tears were streaming down my face.","example[3]":"The sun was going down and it would soon be dark.","example[4]":"They came running down the stairs.","example[5]":"She stood on a balcony looking down into the courtyard.","example[6]":"Glancing down the list of runners, I noticed a familiar name.","example[7]":"Her hair came down to her waist.","example[8]":"Ken fell asleep face down  (=with his face towards the ground) on the couch.","signpost[1]":"in a lower place","definition[1]":"in a lower place or position","example[9]":"We heard the sound of laughter down below.","example[10]":"The bathroom is down those stairs.","example[11]":"Halfway down the page, there was the item I was looking for.","signpost[2]":"to lie/sit","definition[2]":"into a sitting or lying position","example[12]":"Please sit down.","example[13]":"I think I’ll go and lie down for a while.","signpost[3]":"along","definition[3]":"at or to a place that is further along something such as a road or path","example[14]":"A young man came hurrying down the street.","example[15]":"She looked down the road to see if anyone was coming.","example[16]":"There is a pleasant little cafe bar a hundred yards down the road.","example[17]":"The bus stop is a bit further down on the left-hand side.","signpost[4]":"south","definition[4]":"in or towards the south","example[18]":"They drove all the way down from Boston to Miami.","example[19]":"They sailed down the east coast of Africa.","example[20]":"Now he’s bought a villa down south.","example[21]":"a trip down Mexico way","signpost[5]":"somewhere local","definition[5]":"at or to a place that is not far away","example[22]":"She’s just gone down to the shops.","example[23]":"I saw her down at the station this morning.","definition[6]":"away from the place where a river starts","example[24]":"Chunks of ice came floating down the river.","signpost[6]":"fastened to a surface","definition[7]":"used with verbs that mean ‘fasten’ to show that something is fastened firmly to the surface or object below it","example[25]":"The coffin lid had been nailed down.","signpost[7]":"less","definition[8]":"at or towards a level or amount that is less","example[26]":"Keep your speed down.","example[27]":"House prices have come down in recent months.","example[28]":"Turn the radio down.","example[29]":"Sharif cut his report down to only three pages.","note[0]":"down to","signpost[8]":"losing","definition[9]":"losing to an opponent by a certain number of points","example[30]":"Swindon were six points down at one stage.","note[1]":"two goals down/three points down etc","signpost[9]":"written","definition[10]":"used with verbs that mean ‘write’ to show that you write something on paper or in a book","example[31]":"I’ll write down the address for you.","example[32]":"Start by jotting down a few ideas.","example[33]":"Let’s put you down as self-employed.","signpost[10]":"on a list","definition[11]":"if you are down for something, your name is on a list of people who want to do something or are intended to do something","example[34]":"Purvis is down for the 200 metre freestyle event.","note[2]":"down for","example[35]":"We’ve already put his name down for nursery school.","example[36]":"I’ve got you down to do the table decorations.","note[3]":"down to do something","signpost[11]":"to later times","definition[12]":"from an earlier time in history to a later time or to people who are born in later times","example[37]":"a person whose words and actions have inspired millions of people down the centuries","example[38]":"This knowledge was handed down in the family from father to son.","example[39]":"The story has been passed down the generations for a thousand years.","example[40]":"traditions that have come down to us from medieval times","signpost[12]":"paid immediately","definition[13]":"paid to someone immediately","example[41]":"A top quality freezer for only £20 down and £5 a week for a year.","signpost[13]":"every part","definition[14]":"from top to bottom","example[42]":"I want you to wash my car down.","signpost[14]":"swallowed","definition[15]":"in or into your stomach as a result of swallowing","example[43]":"Meg’s been very ill and can’t keep her food down.","example[44]":"He gulped down the coffee.","signpost[15]":"sad","definition[16]":"unhappy or sad","example[45]":"Tim’s been feeling down.","definition[17]":"if a computer is down, it is not working","signpost[16]":"leaving university","definition[18]":"used to say that someone leaves or has left a university at the end of a period of study","example[46]":"Sarah came down from Oxford in 1966.","note[4]":"down from","signpost[17]":"completed","definition[19]":"already done or completed","example[47]":"Well, you’ve passed your second test, so it’s two down and four more to go.","definition[20]":"used to tell a jumping dog to get down","definition[21]":"to drink or eat something quickly","example[48]":"He downed the coffee in one gulp.","definition[22]":"to knock or force someone to the ground","example[49]":"O'Malley downed his opponent in the first round.","definition[23]":"soft hair like a baby’s","definition[24]":"the soft fine feathers of a bird","definition[25]":"one of the four chances that an American football team has to move forward when it is their turn to have the ball","definition[26]":"at or towards the bottom or end of something","example[50]":"downstairs","example[51]":"downriver  (=nearer to where it goes into the sea)","definition[27]":"used to show that something is being made smaller or less important","opposite[1]":"up-","example[52]":"to downgrade a job  (=make it less important)","example[53]":"to downsize a company  (=reduce the number of jobs in it)","definition[28]":"used to show that something is bad or negative","example[54]":"the downside of a situation  (=the negative part of it)","example[55]":"down-market products  (=low quality products)","definition[29]":"if an amount or the level of something goes down, it falls to a lower amount or level","example[56]":"By lunchtime, the 100-index was down 4.2 at 3053.1.","example[57]":"59% of companies report sales volume down on a year ago.","example[58]":"The cuts have taken the company’s UK workforce down by 30%","definition[30]":"money paid as a first payment towards a larger sum. Cash down can also mean paying for something immediately in notes and coins rather than with a cheque","example[59]":"The sum of money to be paid is $50 cash down and ten monthly installments of $5.","definition[31]":"if a machine, system, or piece of electrical equipment is down, it is not working","example[60]":"My system went down over the weekend and I didn’t get any emails.","example[61]":"The printer can be used even when the telecommunication lines are down.","definition[32]":"if the people who work in a factory down tools, they refuse to work","example[62]":"Workers downed tools in protest against the redundancies."}