{"word[0]":"may","definition[0]":"if something may happen or may be true, there is a possibility that it will happen or be true but this is not certain","synonym[0]":"might","example[0]":"I may be late, so don’t wait for me.","example[1]":"Some chemicals may cause environmental damage.","example[2]":"There may not be enough money to pay for the repairs.","example[3]":"Well, I may have been wrong.","example[4]":"They may have called while you were out.","example[5]":"It may be that Minoan ships were built and repaired here.","example[6]":"Your job may well involve some travelling  (=it is fairly likely).","signpost[0]":"possible to do something","definition[1]":"if something may be done, completed etc in a particular way, that is how it is possible to do it","synonym[1]":"can","example[7]":"The problem may be solved in a number of different ways.","signpost[1]":"allowed","definition[2]":"used to say that someone is allowed to do something","example[8]":"Thank you. You may go now.","example[9]":"There is a set of rules to show what members may and may not do.","example[10]":"You may sit down or stand, just as you wish.","example[11]":"No one may own more than 10% of the shares.","definition[3]":"used to ask politely for permission to do something","example[12]":"May I come in and wait?","example[13]":"May we use your office for a few minutes?","signpost[2]":"in polite expressions","definition[4]":"used to say, ask, or suggest something in a polite way","example[14]":"All these things, if I may say so, are entirely irrelevant.","example[15]":"Who, may I ask, is Wotherspoon?","example[16]":"May I suggest that you consider the matter further before taking any action.","signpost[3]":"although","definition[5]":"used to say that even though one thing is true, something else which seems very different is also true","example[17]":"I may be slow, but at least I don’t make stupid mistakes.","example[18]":"Although this may sound like a simple process, great care is needed.","example[19]":"Strange as it may seem, I always felt I belonged here.","signpost[4]":"purpose","definition[6]":"used after ‘so that’ or ‘in order that’ to say that someone does something in order to make something else possible","example[20]":"The hero sacrifices his life so that his friend may live.","explanation[0]":"You say May I? when asking for permission","example[21]":"May I ask you a question?","explanation[1]":"You say you may when giving someone permission","example[22]":" You may go now","explanation[2]":"You say that something may happen or be true","example[23]":"I may be late","example[24]":"He may be in his office","explanation[3]":"You say that something may have happened","example[25]":"They may have already gone home","explanation[4]":"You use may not in negative sentences","example[26]":" I may not be here much longer","example[27]":"He may not have understood what you said","explanation[5]":"In everyday English, you can use might in the same way as may to say that something is possible","explanation[6]":"that something might happen or be true","example[28]":"I might be late","example[29]":"He might be in his office","explanation[7]":"that something might have happened","example[30]":"They might have already gone home","explanation[8]":"In everyday English, you can also use might not or mightn’t","example[31]":"I might not be here much longer","example[32]":"He mightn’t have understood","definition[7]":"the white or pink flowers of the hawthorn","definition[8]":"the fifth month of the year, between April and June","example[33]":"She started work here last May.","note[0]":"next/last May","example[34]":"The theatre opened in May.","note[1]":"in May","example[35]":"We don’t have any meetings on May 6th, do we?","note[2]":"on May 6th","example[36]":"An agreement was signed on 6th May 1977.","note[3]":"on 6th May","example[37]":"Michael’s getting married May 6.","note[4]":"May 6"}