{"word[0]":"twist","definition[0]":"to turn a part of your body around or change your position by turning","example[0]":"He twisted his head slightly, and looked up at her.","example[1]":"She twisted round, so that she could see the dog better.","note[0]":"twist round/around","definition[1]":"if you twist your mouth or features, you smile in an unpleasant way or look angry, disapproving etc","example[2]":"His mouth twisted in a humourless smile.","signpost[0]":"bend","definition[2]":"to bend or turn something, such as wire, hair, or cloth, into a particular shape","example[3]":"She twisted her handkerchief into a knot.","note[1]":"twist something into something","example[4]":"Twist the two ends of the wire together.","note[2]":"twist something together","definition[3]":"to wind something around or through an object","example[5]":"She twisted a silk scarf round her neck.","note[3]":"twist something round/around/through etc something","example[6]":"Ann twisted some daisies through Katherine’s thick brown hair.","signpost[1]":"turn","definition[4]":"to turn something in a circle using your hand","example[7]":"Jack twisted the cap off the bottle.","note[4]":"twist something off (something)","signpost[2]":"road/river","definition[5]":"if a road, river etc twists, it changes direction in a series of curves","example[8]":"The road twisted between spectacular mountains.","signpost[3]":"words","definition[6]":"to change the true or intended meaning of a statement, especially in order to get some advantage for yourself","example[9]":"He’s always trying to twist my words and make me look bad.","definition[7]":"an unexpected feature or change in a situation or series of events","example[10]":"By an amazing twist of fate, we met again in Madrid five years later.","example[11]":"The robbery took a deadly new twist as the robber pulled out a gun.","note[5]":"a new/cruel/unexpected/strange etc twist","example[12]":"an unexpected twist in the plot","definition[8]":"a twisting action or movement","example[13]":"He smiled, a slow cynical twist of his lips.","definition[9]":"a bend in a river or road","definition[10]":"a small piece of something that is twisted into a particular shape","example[14]":"a twist of lemon","note[6]":"twist of"}