{"word[0]":"volume","definition[0]":"the amount of sound produced by a television, radio etc","example[0]":"Can you turn the volume up?","note[0]":"turn the volume up/down","explanation[0]":"In everyday English, people usually say turn  something up or turn something down rather than use the noun volume:","example[1]":"Can you turn the TV up a bit?","example[2]":"She’s always yelling at us to turn our music down.","signpost[0]":"amount of something","definition[1]":"the total amount of something, especially when it is large or increasing","example[3]":"The volume of traffic on the roads has increased dramatically in recent years.","note[1]":"volume of","example[4]":"the volume of trade","signpost[1]":"space filled","definition[2]":"a measurement of the amount of space that a substance or object fills, or the amount of space in a container","example[5]":"The volume of the container measures 10,000 cubic metres.","example[6]":"an instrument for measuring the volume of a gas","signpost[2]":"book","definition[3]":"a book that is part of a set, or one into which a very long book is divided","example[7]":"The period from 1940–45 is in volume 9.","definition[4]":"a book","example[8]":"a volume of Keats’s poetry","definition[5]":"all the copies of a particular magazine printed in one particular year","definition[6]":"the amount of space that a substance or object contains or fills","example[9]":"The US gallon is about five-sixths the volume of the UK gallon.","definition[7]":"the total amount of something","example[10]":"The volume of exports was up 4% on the previous 4 months.","example[11]":"the high volume of traffic at O'Hare airport","example[12]":"59% of companies reported that sales volume was lower than a year ago.","example[13]":"The telephone company began offering a new volume discount (=price reduction for using a large amount of goods or services) for business customers.","definition[8]":"the total amount of activity on a stockmarket, usually measured by the number of shares that have been traded in a particular period of time","example[14]":"Volume dropped sharply to 113.5 million shares."}