{"signpost[0]":"become different/make something different","definition[0]":"to become different, or to make something become different","example[0]":"Susan has changed a lot since I last saw her.","example[1]":"Changing your eating habits is the best way to lose weight.","example[2]":"The leaves on trees change colour in the autumn.","example[3]":"He changed from being a nice lad to being rude and unhelpful.","note[0]":"change (from something) to something","example[4]":"The hissing sound gradually changed into a low hum.","note[1]":"change into","example[5]":"A witch had changed him into a mouse.","note[2]":"change somebody/something into something","example[6]":"Mueller changed his name to Miller when he became a U.S. citizen.","note[3]":"change something to something","signpost[1]":"start doing/using something different","definition[1]":"to stop doing or using one thing, and start doing or using something else instead","synonym[0]":"switch","example[7]":"She changed jobs in May.","example[8]":"The ship changed course and headed south.","example[9]":"The company has had to change direction because of developments in technology.","example[10]":"Piper awkwardly tried to change the subject (=talk about something else).","example[11]":"The company has recently changed to a more powerful computer system.","signpost[2]":"replace something","definition[2]":"to put or use something new or different in place of something else, especially because it is old, damaged, or broken","example[12]":"Three boys were changing a tyre by the side of the road.","example[13]":"When I lost my keys, we had to change all the locks.","example[14]":"How often do you change cars  (=buy a new car and sell the old one)?","example[15]":"The time of the meeting has been changed from 11:00 to 10:30.","note[4]":"change something (from something) to something","definition[3]":"to take off your clothes and put on different ones","example[16]":"Francis came in while Jay was changing.","example[17]":"Change your dress – that one looks dirty.","example[18]":"You’d better go and get changed.","example[19]":"Sara changed into her swimsuit and ran out for a quick swim.","note[5]":"change into/out of","definition[4]":"to put a clean nappy on a baby, or to put clean clothes on a baby or small child","example[20]":"I bathed him and changed his diaper.","example[21]":"Can you change the baby?","signpost[3]":"bed","definition[5]":"to take the dirty sheets off a bed and put on clean ones","signpost[4]":"exchange goods","definition[6]":"to take back to a shop something that you have bought and get something different instead, especially because there is something wrong with it","example[22]":"I bought these gloves for my daughter, but they’re too large. Can I change them for a smaller size?","note[6]":"change something for something","definition[7]":"to give a customer something different instead of what they have bought, especially because there is something wrong with it","example[23]":"I’m sure the shop will change them for you.","signpost[5]":"exchange money","definition[8]":"to get smaller units of money that add up to the same value as a larger unit","example[24]":"Can you change a £20 note?","definition[9]":"to get money from one country for the same value of money from another country","example[25]":"I want to change my dollars into pesos, please.","note[7]":"change something into/for something","signpost[6]":"trains/buses/aircraft","definition[10]":"to get off one train, bus, or aircraft and onto another in order to continue your journey","note[8]":"all change! (=used to tell passengers to get off a train because it does not go any further)","example[26]":"I had to change planes in Denver.","note[9]":"change trains/buses/planes etc","example[27]":"Passengers for Liverpool should change at Crewe.","note[10]":"change at","signpost[7]":"gear","definition[11]":"to put the engine of a vehicle into a higher or lower gear in order to go faster or slower","example[28]":"Change into second gear as you approach the corner.","note[11]":"change (into/out of) gear","example[29]":"Change down before you get to the hill.","note[12]":"change up/down","definition[12]":"if the wind changes, it starts to blow in a different direction","collocation[0]":"dramatically/drastically/radically","example[30]":"People’s work environment has changed dramatically in the past twenty years.","example[31]":"His life had completely changed since he met Anya.","collocation[1]":"considerably","example[32]":"He has changed considerably in four years.","collocation[2]":"significantly","example[33]":"The legal system has changed significantly since the rule was established.","collocation[3]":"fundamentally","example[34]":"The political situation has fundamentally changed.","collocation[4]":"rapidly/quickly","example[35]":"The market for phones is changing rapidly.","collocation[5]":"slowly/gradually","example[36]":"Things are gradually changing.","collocation[6]":"change overnight","example[37]":"Old habits cannot be changed overnight.","collocation[7]":"changing circumstances/conditions","example[38]":"The human brain adapts quickly to changing conditions.","collocation[8]":"changing attitudes","example[39]":"Changing attitudes cause traditional ways of life to disappear.","collocation[9]":"the changing role of somebody","example[40]":"the changing role of women in society","collocation[10]":"changing patterns of work/behaviour etc","example[41]":"Changing patterns of work mean that more people are able to work from home.","collocation[11]":"a changing environment","example[42]":"In order to survive, you must adapt to a changing environment.","collocation[12]":"a changing world","example[43]":"Children are growing up in a changing world.","collocation[13]":"changing times","example[44]":"We live in changing times.","explanation[0]":"Change belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[1]":"In this sentence, ‘the password’ is the object of change","example[45]":"They’ve changed the password","explanation[2]":"In this sentence, ‘the password’ is the subject of change","example[46]":"The password has changed","heading[0]":"to change something","definition[13]":"to make someone or something different","example[47]":"Unfortunately, there’s nothing we can do to change the situation.","example[48]":"Being at college has changed her – she’s much more confident now.","display[0]":"alter","definition[14]":"to change something so that it is better or more suitable","example[49]":"You can alter the colour and size of the image using a remote control.","example[50]":"Can we alter the date of the meeting?","display[1]":"adapt","definition[15]":"to change something slightly in order to improve it or make it more suitable","example[51]":"How much would it cost to adapt the existing equipment?","example[52]":"You can adapt the recipe to suit your own requirements.","display[2]":"adjust","definition[16]":"to make small changes in the position or level of something in order to improve it or make it more suitable","example[53]":"How do you adjust the volume on the television?","example[54]":"He adjusted his tie in the mirror.","display[3]":"modify","definition[17]":"to make small changes to something such as a piece of equipment, a set of ideas, or a way of behaving in order to improve it or use it in a different way","example[55]":"He’s modified his opinions since then.","example[56]":"a modified version of the original program","display[4]":"reform","definition[18]":"to change a law, system, organization etc so that it is fairer or more effective","example[57]":"plans to reform the tax system","example[58]":"Health care needs to be completely reformed.","display[5]":"revise","definition[19]":"to change a plan, idea, law etc because of new information and ideas","example[59]":"In July, China revised the rules for foreign investment.","example[60]":"The findings could force the scientists to revise their ideas about climate change.","display[6]":"reorganize","definition[20]":"to change the way that a system or organization works","example[61]":"We’ve had to reorganize our database.","example[62]":"During the 1980s, the government reorganized the civil service.","display[7]":"restructure","definition[21]":"to make big changes to the way something is organized, especially a large political or economic system or a big company, in order to make it more effective","example[63]":"The company has been restructured from top to bottom.","heading[1]":"to change something completely","display[8]":"transform","definition[22]":"to change something completely, especially so that it is much better","example[64]":"Well, you’ve certainly transformed this place – it looks great!","example[65]":"Putin transformed the Russian economy.","display[9]":"revolutionize","definition[23]":"to completely and permanently change the way people do something or think about something, especially because of a new idea or invention","example[66]":"Computers have revolutionized the way we work.","example[67]":"This important discovery revolutionized our understanding of the universe.","heading[2]":"to change something in order to deceive people","display[10]":"distort","definition[24]":"to explain facts, statements etc in a way that makes them seem different from what they really are","example[68]":"The judge said that she had deliberately tried to distort the facts.","example[69]":"Don’t try to distort the truth.","display[11]":"twist","definition[25]":"to dishonestly change the meaning of a piece of information or of something that someone has said, in order to get an advantage for yourself or to support your own opinion","example[70]":"He accused reporters of twisting his words.","example[71]":"In her article she twisted the meaning of what I said.","display[12]":"misrepresent","definition[26]":"to give people a wrong idea about someone or their opinions, by what you write or say","example[72]":"I hope I have not misrepresented her opinion.","example[73]":"He’s taking legal action to stop the film, claiming it grossly misrepresents him.","signpost[8]":"things becoming different","definition[27]":"the process or result of something or someone becoming different","example[74]":"I find it hard to cope with change.","example[75]":"scientists worried about climatic change","example[76]":"No major changes were made to the book.","example[77]":"She had a change of heart (=change in attitude) and decided to stay.","example[78]":"Family life has undergone dramatic change in recent years.","example[79]":"There was a change for the better in the patient’s condition.","note[13]":"change for the better/worse","example[80]":"the sweeping political changes after the fall of communism","note[14]":"social/political/economic etc change","example[81]":"changes in the immigration laws","note[15]":"change in","example[82]":"A change in personality may mean your teenager has a drug problem.","example[83]":"a change of temperature","note[16]":"change of","signpost[9]":"from one thing to another","definition[28]":"the fact of one thing or person being replaced by another","example[84]":"The car needs an oil change.","example[85]":"The government has made some major policy changes.","example[86]":"a change of government","example[87]":"a change of address","example[88]":"the gradual change from grasslands to true desert","note[17]":"change from something to something","signpost[10]":"pleasant new situation","definition[29]":"a situation or experience that is different from what happened before, and is usually interesting or enjoyable","note[18]":"a change is as good as a rest (=used to say that starting to do something different is as good as having a rest)","example[89]":"‘Ron’s buying the drinks.’ ‘That makes a change.’","note[19]":"it/that makes a change","example[90]":"The patients benefit greatly from a change of scenery.","note[20]":"change of scene/air/pace etc","example[91]":"The morning was cool; a welcome change from the heat of the day before.","note[21]":"change from","example[92]":"How about dinner out for a change?","note[22]":"for a change","definition[30]":"the money that you get back when you have paid for something with more money than it costs","example[93]":"Here’s your change, sir.","definition[31]":"money in the form of coins, not paper money","example[94]":"Matt emptied the loose change from his pockets.","example[95]":"A beggar asked for some spare change (=coins that you do not need).","example[96]":"I have about a dollar in change.","note[23]":"in change","definition[32]":"coins or paper money that you give in exchange for the same amount of money in a larger unit","example[97]":"Excuse me, have you got change for a pound?","note[24]":"change for £1/$10","example[98]":"Can you make change for $20?","note[25]":"make change","signpost[11]":"train/bus/aircraft","definition[33]":"a situation in which you get off one train, bus, or aircraft and get on another in order to continue your journey","example[99]":"Even with a change of trains, the subway is quicker than a cab at rush hour.","collocation[14]":"big/major","example[100]":"Going to a new school is a big change for children.","collocation[15]":"slight/small/minor","example[101]":"The proposed changes were relatively minor.","collocation[16]":"gradual","example[102]":"There has been a gradual change in the weather.","collocation[17]":"dramatic/drastic/radical","example[103]":"The Industrial Revolution was a period of dramatic change.","example[104]":"The change in blood pressure was not significant.","collocation[18]":"marked","example[105]":"There was a marked change in his behaviour.","collocation[19]":"fundamental","example[106]":"Reducing waste requires a fundamental change in attitude.","example[107]":"Demands for political and social change are growing.","collocation[20]":"sweeping changes","example[108]":"There are likely to be sweeping changes in the company.","collocation[21]":"far-reaching changes","example[109]":"The Internet has brought about far-reaching changes in the way we work.","collocation[22]":"make a change","example[110]":"We've had to make some changes to the design.","collocation[23]":"introduce a change","example[111]":"A number of changes were introduced to the curriculum.","collocation[24]":"bring (about) change","example[112]":"The war brought about radical social change.","example[113]":"Treatment is aimed at effecting a change in the child’s negative behaviour.","collocation[25]":"see/notice/observe a change","example[114]":"I saw a big change in her when I met her again.","collocation[26]":"undergo a change","example[115]":"The body undergoes a number of changes during this time.","collocation[27]":"signal a change","example[116]":"Does this move signal a change in US foreign policy?","collocation[28]":"the pace/rate of change","example[117]":"People sometimes feel alarmed by the pace of technological change.","definition[34]":"a situation in which someone or something becomes different, or the act of making something different","example[118]":"There was a sudden change in the weather.","example[119]":"We are living in a period of great change.","example[120]":"He was told to make some slight changes to his essay.","display[13]":"alteration","definition[35]":"a change, especially a small one that happens naturally or gradually, or one that is made in order to improve something","example[121]":"I noticed a slight alteration in her behaviour.","example[122]":"They had to make some alterations to their original theory.","definition[36]":"a change made to a system or law in order to improve it","example[123]":"He called for a reform of our outdated voting system.","example[124]":"Many people opposed the economic reforms.","display[14]":"shift","definition[37]":"a change, especially in people’s attitudes or in the way they do things, or in the position of someone or something","example[125]":"a shift in public opinion about the war","example[126]":"There has been a noticeable shift in government policy on education.","example[127]":"There needs to be a major shift away from road transport to rail transport.","example[128]":"After he died, there was a dramatic shift in the balance of power.","display[15]":"swing","definition[38]":"a big change, especially in someone’s opinions or moods","example[129]":"There has been a big swing toward the Democrats  (=many more people are supporting them).","example[130]":"The drug can cause mood swings.","display[16]":"fluctuation","definition[39]":"a change in something – used when something changes often","example[131]":"fluctuations in the value of the dollar","example[132]":"temperature fluctuations","example[133]":"fluctuations in his mood","example[134]":"There has been some fluctuation in productivity levels.","heading[3]":"a great change","display[17]":"transformation","definition[40]":"a change in which something or someone becomes completely different","example[135]":"There has been a complete transformation in his attitude since he became a father.","example[136]":"her transformation from shy local girl to famous movie actress","display[18]":"revolution","definition[41]":"a complete change in ways of thinking or working","example[137]":"The 1970s saw the beginnings of a new technological revolution.","example[138]":"Einstein’s General Theory of Relativity started a revolution in scientific thinking.","display[19]":"shake-up","definition[42]":"a situation in which a lot of changes are very quickly made in a system or organization in order to make it more effective","example[139]":"The department has not performed well and is badly in need of a shake-up.","example[140]":"The Administration is planning a thorough shake-up of the welfare system.","display[20]":"U-turn","definition[43]":"a complete change in the plans of a government or political party so that it decides to do the opposite of what it originally said it would do","example[141]":"The government was forced to do a U-turn after angry protests about their taxation policy.","definition[44]":"to exchange a unit of money for smaller units that add up to the same value","definition[45]":"to exchange money in one currency into money of another currency","example[142]":"I want to change these dollars into Euros.","definition[46]":"to exchange something that you have bought, especially because there is something wrong with it","example[143]":"We will only change goods accompanied by a receipt.","definition[47]":"if property changes hands, it passes from one owner to another","example[144]":"Volume was heavy on the NYSE, where about 2.19 billion shares changed hands.","definition[48]":"the money you get back when you have paid for something with more money than it costs","example[145]":"She received a forged banknote in her change.","example[146]":"You won’t get much change from a ten pound note here.","definition[49]":"money in the form of coins and notes of low value","example[147]":"I didn’t have any small change for the telephone."}