{"word[0]":"recognition","definition[0]":"the act of realizing and accepting that something is true or important","example[0]":"official recognition of the need for jail reform","note[0]":"formal/official recognition","example[1]":"Don’s recognition of the importance of Suzy in his life","note[1]":"recognition of","example[2]":"There is general recognition that the study techniques of many students are weak.","note[2]":"recognition that","definition[1]":"public respect and thanks for someone’s work or achievements","example[3]":"He has achieved recognition and respect as a scientist.","example[4]":"The importance of voluntary organizations in the economy still needs to be given recognition.","example[5]":"He was presented with a gold watch in recognition of his service to the company.","note[3]":"in recognition of something","definition[2]":"the act of knowing someone or something because you have known or learned about them in the past","example[6]":"He stared at her, but there was no sign of recognition.","example[7]":"The bakery business has changed beyond all recognition in the last 10 years.","note[4]":"change beyond/out of all recognition","definition[3]":"the act of officially accepting that an organization, government, person etc has legal or official authority","example[8]":"the government’s failure to achieve international recognition","note[5]":"international/diplomatic recognition","example[9]":"the recognition of Latvia as an independent state","heading[0]":"– Meaning 2: public respect and thanks for someone’s work or achievements","collocation[0]":"achieve recognition","example[10]":"Toni has been striving to achieve recognition for the past ten years.","collocation[1]":"receive/be given/get recognition","example[11]":"Younger women artists are now getting wider recognition.","collocation[2]":"win/gain recognition","example[12]":"The company has won recognition for its customer service.","collocation[3]":"deserve recognition","example[13]":"They deserve recognition for the tremendous job they are doing.","collocation[4]":"national/international/worldwide recognition","example[14]":"Like many pianists, he first achieved international recognition by winning a competition.","collocation[5]":"public recognition","example[15]":"He won public recognition for his work when he was awarded an MBE.","collocation[6]":"professional recognition","example[16]":"My father craved professional recognition.","collocation[7]":"proper recognition","example[17]":"Frank Norris has never received proper recognition as a great novelist.","collocation[8]":"wider recognition","example[18]":"She deserves wider recognition.","definition[4]":"when people know who a person is or what something is, or know something about them as soon as they see them or hear their name","example[19]":"We are bigger than most companies and ourname recognition is higher.","example[20]":"The company is focused on building brand recognition through marketing campaigns.","definition[5]":"when a machine can recognize something"}