{"word[0]":"cash","definition[0]":"money in the form of coins or notes rather than cheques, credit cards etc","example[0]":"Cash was taken during a burglary of the apartment.","example[1]":"The traffic police will accept fines in cash immediately.","note[0]":"in cash","example[2]":"The shop charges less if the customer pays in cash.","example[3]":"Health and education need cash from the government.","example[4]":"A phone line to help children in trouble has been closed due to lack of cash.","example[5]":"Charity workers must constantly raise more cash (=collect more money) for the needy.","example[6]":"The company found itself strapped for cash (=without enough money) to pay taxes.","heading[0]":"– Meaning 2: money","collocation[0]":"raise cash","example[7]":"She organized a series of events to raise cash for cancer charities.","collocation[1]":"provide cash","example[8]":"Campaigners are urging the government to provide more cash for health care.","collocation[2]":"generate cash","example[9]":"The website generates cash from advertising, and by charging for downloads.","collocation[3]":"pay (by) cash","example[10]":"They won’t take credit cards, so you have to pay cash.","collocation[4]":"spare cash","example[11]":"You should put any spare cash into a savings account.","form[0]":"cash + NOUN","collocation[5]":"cash flow","example[12]":"The company was having a few problems with cash flow.","collocation[6]":"a cash crisis","example[13]":"the cash crisis in some developing countries","collocation[7]":"a cash prize","example[14]":"The winner will get a cash prize of £10,000.","collocation[8]":"a cash boost","example[15]":"Conservation projects in the region are being given a cash boost of £40,000.","collocation[9]":"cash resources","example[16]":"The organization’s cash resources are limited.","collocation[10]":"a cash reserve","example[17]":"Experts always advise people to build up a cash reserve.","collocation[11]":"a cash crop","example[18]":"The land is used to grow cash crops like cocoa, tea, and coffee.","collocation[12]":"be strapped for cash","example[19]":"Many airlines are strapped for cash at the moment.","definition[1]":"money in the form of notes and coins, rather than cheques, credit cards etc","example[20]":"I’m bringing $400 in traveller’s cheques and $100 in cash.","example[21]":"All deals are done in hard cash or by bank transfer.","definition[2]":"to pay for something immediately with money or a cheque, rather than at a later time","example[22]":"Are you paying cash or do you have an account?","definition[3]":"money rather than shares, bonds etc","example[23]":"Instead of paying cash for their bonds, they can offer bondholders common shares.","example[24]":"The real debt crisis won’t come until next year, when it must start paying cash instead of paper to some debt holders.","definition[4]":"money that is immediately available, for example in bank accounts or in the form of shares etc that can be easily sold","example[25]":"The company has $1 billion in ready cash and the ability to borrow much more.","definition[5]":"having more money going out of a business than coming in","definition[6]":"having more money coming into a business than going out","definition[7]":"to exchange a cheque etc for cash","example[26]":"Can you cash my traveller’s cheques here?"}