{"word[0]":"more","type[0]":"used before an adjective or adverb to form the comparative","definition[0]":"having a particular quality to a greater degree","opposite[0]":"less","example[0]":"You’ll have to be more careful next time.","example[1]":"Can’t it be done more quickly?","example[2]":"Children generally feel much more confident working in groups.","note[0]":"much/a lot/far more","example[3]":"It was a lot more expensive than I had expected.","note[1]":"more ... than","example[4]":"Your health is more important than anything else.","example[5]":"Children can often do these puzzles more easily than adults.","example[6]":"Selling goods abroad is no more difficult  (=not more difficult) than selling to the home market.","heading[0]":"GRAMMAR: Comparatives","explanation[0]":"More is not used before the -er form of an adjective or adverb You say","example[7]":"The train is quicker than the bus","bad_example[0]":"The train is more quicker","definition[1]":"used to say that something happens a greater number of times or for longer","example[8]":"I promised Mum that I’d help more with the housework.","example[9]":"You need to get out of the house more.","example[10]":"He travels around a lot more now that he has a car.","example[11]":"Children are using the library more than they used to.","note[2]":"more than","definition[2]":"used to say that something happens to a greater degree","example[12]":"She cares a lot more for her dogs than she does for me.","example[13]":"It’s his manner I dislike, more than anything else.","definition[3]":"a greater amount or number","example[14]":"We should spend more on health and education.","example[15]":"Diane earns a lot more than I do.","example[16]":"Our plane took off more than two hours late.","note[3]":"more than 10/100 etc","example[17]":"More than a quarter of the students never finished their courses.","example[18]":"More people are buying new cars than ever before.","note[4]":"more (...) than","example[19]":"Viewers want better television, and more of it.","note[5]":"more of","example[20]":"Perhaps next year more of us will be able to afford holidays abroad.","definition[4]":"an additional number or amount","example[21]":"I really am interested. Tell me more.","example[22]":"We need five more chairs.","example[23]":"I have no more questions.","example[24]":"Can I have a little more time to finish?","note[6]":"a little/many/some/any more","example[25]":"Are there any more sandwiches?","example[26]":"You’d better take some more of your medicine.","example[27]":"Don’t waste any more of my time.","definition[5]":"in addition to an amount or number","example[28]":"Can I have some more coffee?","example[29]":"I have one more question.","example[30]":"It only costs a few dollars more.","display[0]":"further","definition[6]":"as well as the ones that you have already mentioned","example[31]":"She will remain in hospital for further tests.","example[32]":"They waited for a further two hours.","display[1]":"supplementary","definition[7]":"in addition to the main part of something","example[33]":"Supplementary information is available on request.","example[34]":"a supplementary question","example[35]":"supplementary income","display[2]":"extra","definition[8]":"in addition to the usual or standard cost, time, amount etc","example[36]":"They let the kids stay up an extra hour.","example[37]":"Some stores charge extra for delivery.","example[38]":"Postage is extra.","display[3]":"additional","definition[9]":"more than the basic amount or the amount that you expected or agreed. Additional  is more formal than extra","example[39]":"An evening job would provide additional income.","example[40]":"There may be an additional charge for paying bills by credit card."}