{"word[0]":"error","definition[0]":"a mistake","example[0]":"There must be an error in our calculations.","note[0]":"error in","explanation[0]":"Error is rather formal and is mainly used when talking about computers or in some fixed expressions such as human error. In everyday English, people usually use mistake:","example[1]":"There must be a mistake somewhere.","definition[1]":"a mistake when you are working on a computer, which means that the computer program cannot do what you want it to do","example[2]":"an error message","collocation[0]":"make an error","example[3]":"We made too many errors, and that cost us the game.","collocation[1]":"commit an error","example[4]":"He knew he had committed a grave error of judgement.","collocation[2]":"have/contain an error","example[5]":"If the data contains errors, the results will be wrong.","collocation[3]":"find/spot/notice an error","example[6]":"His accountant spotted several errors in his tax return.","collocation[4]":"realize your error","example[7]":"By the time she realized her error, it was too late.","collocation[5]":"correct an error","example[8]":"We will rectify the error as soon as possible.","collocation[6]":"avoid errors","example[9]":"He resolved to learn from his mistakes and avoid similar errors in the future.","collocation[7]":"compound an error","example[10]":"He refused to listen to our advice, which compounded the error.","collocation[8]":"an error arises/occurs","example[11]":"If an error occurs, you will have two more chances to re-enter your password.","form[0]":"ADJECTIVES/NOUN + error","collocation[9]":"a common error","example[12]":"a common error which students often make when writing essays","collocation[10]":"a serious/bad error","example[13]":"The police made a serious error, which resulted in a young man’s death.","collocation[11]":"a small/minor error","example[14]":"The letter contained some minor spelling errors.","collocation[12]":"a glaring error","example[15]":"There is a glaring error on page 10, where his date of death is given as 2053, not 1003.","collocation[13]":"a huge/monumental error","example[16]":"It was a monumental error to attack from the north.","collocation[14]":"a grave error","example[17]":"He has committed a grave error.","collocation[15]":"a fatal error","example[18]":"Telling your staff they are not important is a fatal error.","collocation[16]":"an unfortunate error","example[19]":"An unfortunate error resulted in confidential information being released to the press.","collocation[17]":"a grammatical/spelling/typing error","example[20]":"You lose marks if your paper contains spelling errors.","collocation[18]":"a clerical/administrative error","example[21]":"The applications forms were sent to the wrong addresses due to a clerical error.","collocation[19]":"a factual error","example[22]":"The article contains many factual errors.","collocation[20]":"a tactical error","example[23]":"Both parties have made tactical errors in the run-up to the election.","collocation[21]":"a random error","example[24]":"This may seem like a random error, but in fact it is repeated once in every 5,000 samples.","collocation[22]":"human error","example[25]":"Automatic checks reduce the danger of human error.","collocation[23]":"computer error","example[26]":"An on-board computer error meant that the plane’s systems shut down for a few vital seconds.","collocation[24]":"pilot/driver error","example[27]":"Investigators believe the crash was caused by pilot error.","collocation[25]":"somebody’s past errors","example[28]":"If we fail to learn from our past errors, we are doomed to repeat them.","collocation[26]":"a margin of error","example[29]":"We have to allow for a small margin of error in the calculations.","example[30]":"The confusion was the result of a computer error.","example[31]":"The company has made some strategic errors.","definition[2]":"used in formal documents to say that mistakes and things that have been forgotten should also be taken into account"}