{"word[0]":"calculate","definition[0]":"to find out how much something will cost, how long something will take etc, by using numbers","example[0]":"These instruments calculate distances precisely.","example[1]":"I’m trying to calculate how much paint we need.","note[0]":"calculate how much/how many etc","example[2]":"Sally calculated that she’d have about £100 left.","note[1]":"calculate (that)","example[3]":"Rates are calculated on an hourly basis.","note[2]":"calculate something on something","explanation[0]":"In more formal English, you say it is calculated that","example[4]":"It is calculated that over $16 billion has been spent on the project","definition[1]":"to guess something using as many facts as you can find","example[5]":"Researchers calculated that this group was at a higher risk of heart disease.","example[6]":"It’s difficult to calculate what effect all these changes will have on the company.","note[3]":"calculate how/what/whether etc","definition[2]":"to find out an amount, price, or value by adding numbers together","example[7]":"The students calculated the cost of printing 5000 copies of their book.","display[0]":"work out","definition[3]":"to calculate something. Work out is less formal than calculate, and is more common in everyday English","example[8]":"You need to work out how much you will need to borrow.","display[1]":"figure out","definition[4]":"to calculate an amount","example[9]":"We still haven't figured out how much it's all going to cost.","example[10]":"the method for figuring welfare payments","display[2]":"count","definition[5]":"to find out the total number of things or people in a group by looking at each one and adding them all together","example[11]":"The teacher counted the children as they got on the bus.","definition[6]":"to add a number of things together to get a final number","example[12]":"Once the scores have been totaled, we will announce the winner.","example[13]":"Okay, now let's total up who had the most points.","display[3]":"quantify","definition[7]":"to say how much something costs, how much of it there is, how serious or effective it is etc","example[14]":"I think it's difficult to quantify the cost at the moment, for a variety of reasons.","example[15]":"How do you quantify the benefits of the treatment?","example[16]":"a reliable method for quantifying the amount of calcium in the blood","display[4]":"assess","definition[8]":"to calculate what the value or cost of something is, or decide how good, bad etc something is","example[17]":"The value of the paintings was assessed at $20 million.","example[18]":"They are still assessing the damage.","example[19]":"We need to have a better way of assessing students' progress.","display[5]":"estimate","definition[9]":"to guess an amount, price, or number as exactly as you can, based on the knowledge you have","example[20]":"The police department estimates that the number of violent crimes will decrease by 2%.","display[6]":"put a figure on something","definition[10]":"to say what you think the exact total amount or value of something is, especially when it is a lot","example[21]":"It's hard to put a figure on it, but the final cost is likely to be over £225 million.","example[22]":"The company has refused to put a figure on its losses.","display[7]":"project","definition[11]":"to calculate what an amount will be in the future, using the information you have now","example[23]":"The company projects sales of $4 million this year.","heading[0]":"different ways of calculating","display[8]":"add","definition[12]":"to put two or more numbers together to find the total","example[24]":"If you add 7 and 5, you get 12.","display[9]":"subtract/take away","definition[13]":"to reduce one number by another number. take something away sounds more informal than subtract","example[25]":"If you subtract 12 from 15, you get 3.","display[10]":"multiply","definition[14]":"to add a number to itself a particular number of times","example[26]":"4 multiplied by 10 is 40.","display[11]":"divide","definition[15]":"to calculate how many times one number contains another number","example[27]":"10 divided by 2 equals 5."}