{"word[0]":"disadvantage","definition[0]":"something that causes problems, or that makes someone or something less likely to be successful or effective","opposite[0]":"advantage","example[0]":"Criminal behaviour can be linked to economic disadvantage.","example[1]":"The disadvantage of the material is that it fades in strong sunlight.","note[0]":"disadvantage of","example[2]":"There are some big disadvantages to marriage – you do lose a lot of your freedom.","note[1]":"disadvantage to","collocation[0]":"the main disadvantage","example[3]":"The main disadvantage of iron as a material is its weight.","collocation[1]":"a big/great/major disadvantage","example[4]":"This method has one major disadvantage: its cost.","collocation[2]":"a serious/severe disadvantage","example[5]":"Public transport is very bad here, which is a serious disadvantage.","collocation[3]":"a slight/minor disadvantage","example[6]":"Children who are young in their school year sometimes have a slight disadvantage.","collocation[4]":"a further/additional/added disadvantage","example[7]":"It’s a very small garden and it has the further disadvantage of facing north.","collocation[5]":"social/economic/educational disadvantage","example[8]":"Unemployment often leads to social disadvantage.","collocation[6]":"have a disadvantage","example[9]":"Cheap air travel has considerable environmental disadvantages.","collocation[7]":"suffer (from) a disadvantage","example[10]":"Working-class boys suffer disadvantages in the educational system.","collocation[8]":"overcome a disadvantage","example[11]":"She was able to overcome the disadvantages of race and poverty.","collocation[9]":"somebody is at a disadvantage","example[12]":"The company was at a disadvantage compared with its competitors.","collocation[10]":"put/place somebody at a disadvantage","example[13]":"Not speaking English might put you at a disadvantage.","collocation[11]":"be/work to the disadvantage of somebody","example[14]":"This system works to the disadvantage of women.","collocation[12]":"advantages and disadvantages","example[15]":"Discuss the advantages and disadvantages of working from home.","collocation[13]":"the advantages outweigh the disadvantages","example[16]":"The advantages of building the new road would outweigh the disadvantages.","definition[1]":"a bad feature that something has, which makes it less good or less useful than other things","example[17]":"What do you think are the disadvantages of nuclear energy?","example[18]":"This car uses a lot of fuel, which is a major disadvantage.","display[0]":"drawback","definition[2]":"a bad feature that something has, although it has advantages that are usually more important","example[19]":"One of the main drawbacks is the price.","display[1]":"bad point","definition[3]":"a bad feature that something has","example[20]":"All of these designs have both their good points and bad points.","display[2]":"the downside","definition[4]":"the disadvantage of a situation that in most other ways seems good or enjoyable","example[21]":"It’s a great job. The only downside is that I don’t get much free time.","definition[5]":"to make someone less likely to be successful or to put them in a worse situation than others"}