{"word[0]":"party","plural[0]":"parties","signpost[0]":"for fun","definition[0]":"a social event when a lot of people meet together to enjoy themselves by eating, drinking, dancing etc","example[0]":"We’re having a small party this evening to celebrate our wedding anniversary.","example[1]":"the party spirit (=the way someone feels when they are really enjoying a party)","example[2]":"The university threw a party to welcome them.","note[0]":"throw/give a party","example[3]":"Are you going to the party tonight?","note[1]":"go/come to a party","example[4]":"I met John at a party a couple of months ago.","note[2]":"at a party","signpost[1]":"in politics","definition[1]":"a political organization with particular beliefs and aims, which you can vote for in elections","example[5]":"I have always voted for the Labour Party.","example[6]":"He failed to win the party’s nomination for president.","example[7]":"The conference is open to all party members.","definition[2]":"a group of people who go somewhere together or do a job together","example[8]":"There were several students in our party.","example[9]":"A search party was sent out to look for the missing climbers.","example[10]":"a rescue party","example[11]":"Admission is free for school parties.","example[12]":"a party of tourists","note[3]":"party of","explanation[0]":"In meanings 2 and 3, party is usually followed by a singular verb","example[13]":"The party has accepted the need for change","example[14]":"The party  have accepted the need for change","signpost[2]":"in an argument/law","definition[3]":"one of the people or groups who are involved in a legal argument or agreement","example[15]":"helping the two parties to reach an agreement","example[16]":"He sees himself as the innocent party in this dispute.","note[4]":"guilty/innocent party","heading[0]":"– Meaning 1: a social event when a lot of people meet together to enjoy themselves by eating, drinking, dancing etc","collocation[0]":"have a party","example[17]":"We’re having a party on Saturday night.","collocation[1]":"hold a party","example[18]":"The party was held at his flat.","example[19]":"Staff threw a party to celebrate the news.","collocation[2]":"host a party","example[20]":"The party was hosted by the Danish ambassador.","collocation[3]":"go to/come to a party","example[21]":"Are you going to Tom’s party?","example[22]":"About 500 people will attend a party in her honour.","collocation[4]":"invite somebody to a party","example[23]":"I’ve been invited to Greg’s party next weekend.","collocation[5]":"gatecrash a party","example[24]":"Some older boys tried to gatecrash the party.","collocation[6]":"a party is in full swing","example[25]":"At 3 am, the party was still in full swing.","collocation[7]":"there is a party going on","example[26]":"Somewhere near the hotel there was a party going on.","collocation[8]":"a party breaks up","example[27]":"The party broke up a little after midnight.","form[0]":"ADJECTIVES/NOUN + party","collocation[9]":"a birthday party","example[28]":"They met at her sister’s 18th birthday party.","collocation[10]":"a Christmas/Halloween etc party","example[29]":"I hope you’re going to the office Christmas party.","collocation[11]":"a big/small party","example[30]":"I don’t really like going to big parties.","collocation[12]":"a dinner party","example[31]":"It’s a favorite topic of conversation at fashionable dinner parties these days.","collocation[13]":"a cocktail party","example[32]":"I first met him at a cocktail party at the American embassy.","collocation[14]":"a fancy dress party","example[33]":"She went to the fancy dress party as Snow White.","collocation[15]":"an office party","example[34]":"I danced with my boss at the office party.","collocation[16]":"a surprise party","example[35]":"Amy has planned a surprise party for his birthday.","collocation[17]":"a farewell/leaving party","example[36]":"You didn’t come to Ken’s farewell party, did you?","collocation[18]":"a street party","example[37]":"Thousands flocked to the street party on Princess Street to celebrate New Year.","collocation[19]":"a lavish party","example[38]":"He threw lavish parties for his celebrity friends.","form[1]":"party + NOUN","collocation[20]":"the party spirit","example[39]":"There’ll be plenty of free champagne to get the party spirit going.","collocation[21]":"be in a party mood","example[40]":"Kate wasn’t really in a party mood, so she stayed home.","collocation[22]":"party games","example[41]":"The children had great fun playing party games.","collocation[23]":"a party dress","example[42]":"The little girls were wearing white party dresses.","heading[1]":"– Meaning 2: a political organization with particular beliefs and aims, which you can vote for in elections","collocation[24]":"a political party","example[43]":"The Labour Party and the Conservative Party are the two main political parties in Britain.","collocation[25]":"the Labour/Democratic etc Party","example[44]":"The leadership race within the Republican Party is almost over.","collocation[26]":"an opposition party","example[45]":"The tax increase was criticized by opposition parties.","collocation[27]":"the ruling party","example[46]":"The ruling party’s level of support grew throughout the year.","collocation[28]":"a right-wing/left-wing party","example[47]":"Support for the right-wing parties was strongest among young working-class men.","collocation[29]":"a party member","example[48]":"He’s been a Conservative party member for 20 years.","collocation[30]":"the party leader","example[49]":"He met with opposition party leaders.","collocation[31]":"a party candidate","example[50]":"The seat was won by the Socialist Party candidate with 68% of the vote.","collocation[32]":"the party faithful","example[51]":"His policies appeal to the party faithful.","collocation[33]":"a party activist","example[52]":"Campaign literature is distributed by unpaid party activists.","collocation[34]":"party policy","example[53]":"There has been a change in party policy.","collocation[35]":"a party conference","example[54]":"He will give a speech at the Tory party conference this morning.","collocation[36]":"the party chairman","example[55]":"He resigned as Conservative party chairman.","collocation[37]":"a party official","example[56]":"The incident has angered senior party officials.","collocation[38]":"a party wins/loses an election","example[57]":"Do you think the Labour Party can win the next election?","collocation[39]":"join a party","example[58]":"Bloomfield joined the Communist Party in 1946.","collocation[40]":"form/found a party","example[59]":"The two politicians broke away from the PDF to form a new political party.","collocation[41]":"a party is in power","example[60]":"From 1945 until 1951 the Labour Party was in power in Britain.","collocation[42]":"a party comes to power","example[61]":"The ruling party came to power in May 2001.","example[62]":"We’re having a party for Sarah’s 40th birthday.","example[63]":"I met my boyfriend at a party.","display[0]":"get-together","definition[4]":"an informal party","example[64]":"Christmas is the perfect time for a family get-together.","definition[5]":"a large formal party where people dance","example[65]":"the end of term ball","display[1]":"rave","definition[6]":"a large party which is held outside or in an empty building, where people dance to music and take illegal drugs","display[2]":"reception","definition[7]":"a large formal party, especially one after a wedding or to welcome an important person","example[66]":"The wedding reception is at a nearby hotel.","example[67]":"a reception for the Thai Foreign Minister","example[68]":"They attended a White House reception to mark the Queen’s visit.","display[3]":"function","definition[8]":"a large formal or official party","example[69]":"He has been asked to play at many corporate functions (=an official party held by a company).","display[4]":"celebration","definition[9]":"a party or special event that is organized in order to celebrate something","example[70]":"the country’s 50th anniversary celebrations","example[71]":"It was a 21st birthday celebration which Mary would never forget.","display[5]":"bash","definition[10]":"a party, especially a big one that a lot of famous people go to – used especially in journalism","example[72]":"the star’s birthday bash","example[73]":"a picture of him at a Hollywood bash","example[74]":"a showbiz bash","display[6]":"do","definition[11]":"a party","example[75]":"We’re having a do to celebrate Margaret’s birthday.","display[7]":"dinner party","definition[12]":"a party where people are invited to someone’s house for an evening meal","example[76]":"I met him at a dinner party.","display[8]":"house-warming (party)","definition[13]":"a party that you have when you move into a new house","example[77]":"We’re having a house-warming next week.","display[9]":"cocktail party","definition[14]":"a party that people go to in order to talk and have a drink together for a few hours","display[10]":"fancy-dress party","definition[15]":"a party where people dress in special clothes, for example to look like a famous person or a character in a story","display[11]":"hen party","definition[16]":"a social event just before a wedding, for a woman who is getting married and her female friends","display[12]":"stag night","definition[17]":"a social event just before a wedding, for a man who is getting married and his male friends","display[13]":"baby/wedding shower","definition[18]":"an event at which people give presents to a woman who is going to have a baby or get married","definition[19]":"to enjoy yourself with a group of other people by drinking alcohol, eating, dancing etc","example[78]":"Let’s party!","definition[20]":"the people or group of people involved in a legal case, argument, agreement etc","example[79]":"It is difficult to obtain a ruling from the court if the other party contests  (=officially disagrees with) the decision.","example[80]":"copies of relevant correspondence between the parties","definition[21]":"when two people are involved in a legal case, a third party is anyone who is not directly involved but might be affected by it","example[81]":"Touche Ross was criticised for not allowing third parties to see their report.","example[82]":"Switch from comprehensive tothird party insurance (=insurance covering anyone affected by an accident, as well as the person who takes out the insurance) if your car’s value has fallen.","definition[22]":"an organization whose members share the same political beliefs and aims and which tries to get elected to government. The word ‘party’ is often used in the name of the organization","example[83]":"India’s Bharatiya Janata Party"}