{"word[0]":"description","definition[0]":"a piece of writing or speech that gives details about what someone or something is like","example[0]":"The booklet gives a brief description of each place.","example[1]":"Berlin sounds fascinating from your description.","example[2]":"an accurate description of the event","note[0]":"description of","collocation[0]":"give (somebody) a description","example[3]":"She was unable to give the police a description of her attacker.","collocation[1]":"provide a description","example[4]":"The diary provides a clear description of farming life in the 1850s.","collocation[2]":"issue a description","example[5]":"Police have issued a description of the two men they are looking for.","collocation[3]":"fit/match a description","example[6]":"The first man they arrested did not fit the description given by the victim.","collocation[4]":"somebody answering a description","example[7]":"A young girl answering  this description has been seen in Spain.","example[8]":"Her descriptions of the natural world are very good.","example[9]":"He gave us a clear description of the situation in the city.","collocation[5]":"detailed","example[10]":"Some of his descriptions of the island are very detailed.","example[11]":"I don't think the hotel's description of its facilities was very accurate.","collocation[6]":"vivid","example[12]":"The book contains some vivid descriptions of his childhood.","example[13]":"We have a perfect description of the man we are looking for.","collocation[7]":"a full description","example[14]":"Please give a full description of your responsibilities in your present job.","collocation[8]":"a long/lengthy description","example[15]":"I didn't want to hear a lengthy description of their holiday.","collocation[9]":"a brief/short description","example[16]":"There's only a brief description of the hotel on the Internet.","collocation[10]":"a general description","example[17]":"He started by giving us a general description of the manufacturing process.","collocation[11]":"a graphic description","example[18]":"The book has some graphic descriptions of life in the prison camp."}