{"definition[0]":"easy to notice or understand","example[0]":"The obvious way of reducing pollution is to use cars less.","example[1]":"It was obvious that Gina was lying.","note[0]":"it is obvious (that)","example[2]":"It might be obvious to you, but it isn’t to me.","note[1]":"obvious to","definition[1]":"behaving in a way that shows you want something very badly, when other people think this behaviour is not suitable","example[3]":"I know you really like him, but you don’t have to be so obvious about it.","collocation[0]":"seem/appear obvious","example[4]":"It seems obvious to me that he is guilty.","collocation[1]":"sound obvious","example[5]":"This may sound obvious, but don’t forget to put your name on your paper.","collocation[2]":"become obvious","example[6]":"It soon became obvious that the boy was not really interested.","collocation[3]":"an obvious reason","example[7]":"The plan, for obvious reasons, was being kept secret.","collocation[4]":"an obvious example","example[8]":"This case is an obvious example of what can go wrong.","collocation[5]":"an obvious question","example[9]":"The obvious question is: why?","collocation[6]":"the obvious answer","example[10]":"There is no obvious answer to their problem.","collocation[7]":"glaringly/blindingly obvious","example[11]":"The cause of her problems is glaringly obvious.","collocation[8]":"transparently/patently/blatantly obvious","example[12]":"His interest in her was blatantly obvious.","collocation[9]":"painfully obvious","example[13]":"It became painfully obvious that she and Edward had nothing in common.","collocation[10]":"immediately obvious","example[14]":"The cause of the pain was not immediately obvious.","collocation[11]":"fairly/quite obvious","example[15]":"There are some fairly obvious signs of a poor diet.","definition[2]":"something that is obvious is very easy to notice or understand – used especially when you are surprised that other people cannot notice it","example[16]":"There is an obvious connection between the two murders.","example[17]":"It was obvious that something was wrong.","definition[3]":"easy to notice that something is true, so that you feel sure about it and have no doubts","example[18]":"It was clear to me that my father was dying.","example[19]":"There are clear signs of an economic recovery.","display[0]":"noticeable","definition[4]":"very easy to notice, especially because you can see, hear, smell, or feel something","example[20]":"Steroid drugs cause a noticeable change in someone’s behaviour.","example[21]":"Road noise tends to be more noticeable in certain weather conditions.","display[1]":"conspicuous","definition[5]":"very easy to notice, because of being different from things around them","example[22]":"a conspicuous white spot on the bird’s wings","example[23]":"She tried to make herself look less conspicuous.","example[24]":"Don’t leave your valuables in a conspicuous place.","display[2]":"unmistakable","definition[6]":"extremely obvious, so that you cannot possibly confuse something with something else","example[25]":"the unmistakable sound of gunfire","example[26]":"The flower’s scent is unmistakable.","display[3]":"self-evident","definition[7]":"facts, ideas etc that are self-evident  are obvious and true, although some people may not accept them or know about them","example[27]":"The facts in this case are self-evident and cannot be denied.","example[28]":"We hold these truths to be self-evident  (=we believe that they are obvious and true – from the American Declaration of Independence).","display[4]":"blatant","definition[8]":"use this about something that someone does which is clearly bad, but which they do not seem to be ashamed of","example[29]":"a blatant lie","example[30]":"The bill is a blatant attempt to limit our right to free speech.","display[5]":"can tell","definition[9]":"to know that something must be true because you can see signs that show this","example[31]":"Even though it was dark, she could tell it was him.","example[32]":"How can you tell if you’ve broken your arm?"}