{"word[0]":"dislike","definition[0]":"to think someone or something is unpleasant and not like them","opposite[0]":"like","example[0]":"Why do you dislike her so much?","example[1]":"I dislike being the centre of attention.","note[0]":"dislike doing something","explanation[0]":"In everyday English, people usually say don’t like rather than dislike:","example[2]":"Why don’t you like her?","example[3]":"He doesn’t like being criticized.","explanation[1]":"Dislike is used with an -ing form, not an infinitive You dislike doing something","example[4]":"I dislike eating dinner alone","bad_example[0]":"I dislike to eat dinner alone","explanation[2]":"Dislike is not used in the progressive You say","example[5]":"Tell us what you dislike about it","bad_example[1]":"Tell us what you are disliking about it","definition[1]":"to not like someone or something. Dislike is stronger than not like, and is used especially in written English","example[6]":"She disliked him as soon as she met him.","example[7]":"Chemistry was the only subject he disliked at school.","display[0]":"not like","example[8]":"Why did you invite Claire? You know I don’t like her.","example[9]":"I don’t really like getting up in the morning when it’s dark.","display[1]":"not be very keen on something","definition[2]":"used to say that you do not like something, but in a polite or gentle way","example[10]":"I’m not very keen on Chinese food.","example[11]":"She’s never been very fond of his books.","display[2]":"not think much of somebody/something","definition[3]":"to not like someone or something because you do not have a good opinion of them","example[12]":"We’ve tried that restaurant twice and we don’t think much of it.","example[13]":"I worked with him for years and I didn’t think much of him.","display[3]":"not be somebody’s kind of thing","definition[4]":"to not be the kind of thing you enjoy – used about activities, films, books etc","example[14]":"Detective stories aren’t really my kind of thing.","display[4]":"go off somebody/something","definition[5]":"to stop liking someone or something that you used to like","example[15]":"Dan and I went out together for six months and then I just went off him.","display[5]":"put somebody off somebody/something","definition[6]":"to make you stop liking someone or something","example[16]":"I was terrible at sport at school and it totally put me off doing any kind of exercise.","definition[7]":"a feeling of not liking someone or something","opposite[1]":"liking","example[17]":"They took an instant dislike to each other  (=they disliked each other immediately).","example[18]":"His colleagues regarded him with intense dislike.","note[1]":"intense/acute/violent etc dislike","example[19]":"She shared her mother’s dislike of housework.","note[2]":"dislike of","example[20]":"Truman had a strong dislike for communism.","note[3]":"dislike for"}