{"word[0]":"scandal","definition[0]":"an event in which someone, especially someone important, behaves in a bad way that shocks people","example[0]":"It caused quite a scandal when he left his wife.","example[1]":"The college has recently been involved in a drugs scandal.","example[2]":"He has been at the centre of a political scandal.","example[3]":"a major scandal involving the government","example[4]":"a series of financial scandals","example[5]":"a sex scandal that ruined his reputation","example[6]":"They had already left the country when the scandal broke.","definition[1]":"talk about dishonest or immoral things that famous or important people are believed to have done","example[7]":"The magazine is full of gossip and scandal.","collocation[0]":"cause a scandal","example[8]":"The vicar caused a scandal by having an affair with a young woman.","collocation[1]":"be involved in a scandal","example[9]":"A senior government official is involved in a political scandal.","collocation[2]":"be implicated in a scandal","example[10]":"One of the ministers implicated in the scandal resigned.","collocation[3]":"be at the centre of a scandal","example[11]":"The banker at the centre of the scandal has disappeared.","collocation[4]":"uncover/expose a scandal","example[12]":"The scandal was uncovered by a journalist.","collocation[5]":"a scandal breaks","example[13]":"When the scandal broke in 1990, it forced the resignation of the bank's chairman.","collocation[6]":"a scandal erupts","example[14]":"A major scandal erupted in Washington last year.","collocation[7]":"the scandal surrounding something","example[15]":"They had tried to protect the prime minster from the scandal surrounding the arms sales.","form[0]":"ADJECTIVES/NOUN + scandal","collocation[8]":"a big/major scandal","example[16]":"The president was forced to resign following a major scandal.","collocation[9]":"a financial scandal","example[17]":"He was suspected of involvement in a major financial scandal.","collocation[10]":"a political scandal","example[18]":"The Health Secretary now finds himself at the centre of a political scandal.","collocation[11]":"a corruption scandal","example[19]":"a major police corruption scandal","collocation[12]":"a sex scandal","example[20]":"There are rumours of a sex scandal involving senior government ministers.","collocation[13]":"a public scandal","example[21]":"The award was soon the centre of a public scandal.","collocation[14]":"the Watergate/Whitewater etc scandal","example[22]":"The name of Richard Nixon will forever be associated with the Watergate scandal.","collocation[15]":"the worst scandal","example[23]":"Total losses resulting from India's worst financial scandal amounted to Rs31,000 million.","collocation[16]":"a hint/whiff of scandal","example[24]":"He vowed that no hint of scandal would ever be attached to him."}