{"word[0]":"establish","definition[0]":"to start a company, organization, system, etc that is intended to exist or continue for a long time","synonym[0]":"found","example[0]":"The city of Boerne was established by German settlers in the 1840s.","example[1]":"Our goal is to establish a new research centre in the North.","explanation[0]":"In everyday English, people usually say set up or start a company or organization, rather than use establish:","example[2]":"The company was set up in 1976.","definition[1]":"to begin a relationship with someone or a situation that will continue","example[3]":"Hungary established diplomatic relations with Chile in 1990.","note[0]":"establish relations/links/contact etc (with somebody)","example[4]":"I wondered why he should bother to try and establish contact with me.","definition[2]":"to find out facts that will prove that something is true","example[5]":"The police must establish the facts of the case before proceeding.","example[6]":"The autopsy established that he had been murdered.","note[1]":"establish that","example[7]":"I was never able to establish whether she was telling the truth.","note[2]":"establish whether/if","definition[3]":"to make people accept that you can do something, or that you have a particular quality","example[8]":"He’d already begun to establish quite a reputation as a journalist.","example[9]":"He had three years in which to establish himself as prime minister.","note[3]":"establish yourself (as/in)","definition[4]":"to start a company or organization, especially one that exists for a long time","example[10]":"The company was established in 1899.","example[11]":"He established a new research centre in Dublin.","example[12]":"Most of the money will be used to establish local industries and mobilize the work-force.","display[0]":"set up","definition[5]":"to start a new company or organization. Set up is less formal than establish, and is the usual phrase to use in everyday English","example[13]":"Kate and her partner are setting up their own printing business.","example[14]":"Dad set up as a builder in 1990 and now he employs over twenty men.","definition[6]":"to start a business that provides services to the public, such as a shop, restaurant, or hotel","example[15]":"He opened his first restaurant in 1995.","example[16]":"They just opened a new supermarket on Van Nuys Boulevard.","definition[7]":"to start a company or an organization such as a school or a hospital, especially by providing the money for it – used about something that was started a long time ago","example[17]":"Who originally founded the college?","example[18]":"The bank was founded 60 years ago in Munich.","display[1]":"inaugurate","definition[8]":"to start an organization with an official ceremony","example[19]":"Twenty years after the airport was inaugurated, it introduced its first transatlantic flights.","definition[9]":"to start a company, organization, system etc that is intended to exist for a long time","example[20]":"My grandfather established the family business in 1938."}