{"word[0]":"estimate","definition[0]":"a calculation of the value, size, amount etc of something made using the information that you have, which may not be complete","example[0]":"We just need an estimate of the number of people who will come.","definition[1]":"a statement of how much it will probably cost to build or repair something","example[1]":"The garage said they’d send me an estimate for the work.","note[0]":"estimate for","collocation[0]":"make an estimate","example[2]":"Insurers have to make an estimate of the risk involved.","collocation[1]":"give an estimate","example[3]":"The builder gave me an estimate of £10,000.","collocation[2]":"provide (somebody with) an estimate","example[4]":"Could you ask him if he can provide us with an estimate?","collocation[3]":"put an estimate on something","example[5]":"It is impossible to put an estimate on the value of the manuscript.","collocation[4]":"an estimate puts something at something","example[6]":"Independent estimates put the number of refugees at 50,000.","collocation[5]":"base an estimate on something","example[7]":"The government based its estimate on data from the 2008 census.","collocation[6]":"a rough/approximate estimate","example[8]":"Can you give me a rough estimate of how much the repairs will cost?","collocation[7]":"an accurate/reliable estimate","example[9]":"It’s hard to put an accurate estimate on the number of people affected.","collocation[8]":"a conservative estimate","example[10]":"By conservative estimates, 2.5 million people die each year from smoking cigarettes.","collocation[9]":"an official estimate","example[11]":"According to official army estimates, more than 500 rebels had been killed.","collocation[10]":"current/recent estimates","example[12]":"According to current estimates, the country can expect 200,000 visitors in the next three years.","collocation[11]":"the latest estimates","example[13]":"The latest estimates are that sea levels could rise by about 20 cm by 2050.","collocation[12]":"earlier/previous estimates","example[14]":"These amounts are much higher than those given in previous estimates.","collocation[13]":"the original estimate","example[15]":"The final cost was nearly three times the original estimate.","collocation[14]":"according to an estimate","example[16]":"According to some estimates, an acre of forest is cleared every minute.","collocation[15]":"estimates range/vary from ... to ...","example[17]":"Estimates of the number of homeless people in the city range from 6,000 to 10,000.","definition[2]":"to try to judge the value, size, speed, cost etc of something, without calculating it exactly","example[18]":"The tree is estimated to be at least 700 years old.","note[1]":"be estimated to be/have/cost etc","example[19]":"Organizers estimated the crowd at 50,000.","note[2]":"estimate something at something","example[20]":"Scientists estimate that smoking reduces life expectancy by around 12 years on average.","note[3]":"estimate that","example[21]":"It is not easy to estimate how many people have the disease.","note[4]":"estimate how many/what etc","explanation[0]":"In more formal English, you say it is estimated that something is true","example[22]":"It is estimated that the statue weighs 60 tons","definition[3]":"a calculation of what the value, size, amount etc of something will probably be","example[23]":"They were able to give us a rough estimate (=a not very exact one) of the cost.","example[24]":"Even the most conservative estimates (=deliberately low) suggest we need to build one million new homes.","synonym[0]":"QUOTATION","example[25]":"Get several estimates before starting any building work.","example[26]":"Nuclear power stations are notoriously unreliable and construction costs go way over original estimates.","definition[4]":"to calculate what you think the value, size, amount etc of something is or will probably be","example[27]":"Officials estimate that supply has exceeded demand by £7.5 billion since the beginning of 2005.","example[28]":"The value of the deal is estimated at £12 million."}