{"signpost[0]":"thing","definition[0]":"a solid thing that you can hold, touch, or see but that is not alive","example[0]":"an everyday object such as a spoon","example[1]":"a small metal object","example[2]":"scientists studying plants, animals, or inanimate objects (=things that are not alive)","signpost[1]":"aim","definition[1]":"the purpose of a plan, action, or activity","example[3]":"My object was to explain the decision simply.","example[4]":"The customer will benefit most, and that is the object of the exercise (=the purpose of what you are doing).","example[5]":"The object of the game is to improve children’s math skills.","note[0]":"object of","definition[2]":"a noun or pronoun representing the person or thing that something is done to, for example ‘the house’ in ‘We built the house.’","definition[3]":"a noun or pronoun representing the person or thing that is joined by a preposition to another word or phrase, for example ‘the table’ in ‘He sat on the table.’","definition[4]":"the person who is involved in the result of an action, for example ‘her’ in ‘I gave her the book.’","definition[5]":"a combination of written information on a computer and instructions that act on the information, for example in the form of a document or a picture","example[6]":"multimedia data objects","definition[6]":"to feel or say that you oppose or disapprove of something","example[7]":"If no one objects, I would like Mrs Harrison to be present.","example[8]":"Mr Chairman, I object. That is an unfair allegation.","note[1]":"I object","example[9]":"Robson strongly objected to the terms of the contract.","note[2]":"object to (doing) something","example[10]":"I objected to having to rewrite the article.","explanation[0]":"You object to something","example[11]":"She objected to my suggestion","bad_example[0]":"She objected my suggestion","definition[7]":"to state a fact or opinion as a reason for opposing or disapproving of something","example[12]":"‘My name’s not Sonny, ’ the child objected.","example[13]":"The group objected that the policy would prevent patients from receiving the best treatment.","note[3]":"object that","definition[8]":"to complain or protest about something, or to feel that you oppose it or disapprove of it","example[14]":"The mayor considered contracting out garbage collection, but the unions objected.","example[15]":"The banks objected to the proposal fiercely.","note[4]":"object to","definition[9]":"a solid thing, especially something you can hold or touch","example[16]":"The firms sell products ranging from art objects to vintage cars.","definition[10]":"the intended result of a plan, action, activity, or document","synonym[0]":"AIM","example[17]":"Our object is to keep costs down.","example[18]":"The object of a contract of sale is to transfer the property from the seller to the buyer.","example[19]":"Applying for extra amounts in loans defeats the object (=does not have the intended result), because the students then get themselves further into debt.","definition[11]":"the things that a company has been formed to do and the types of goods or services that it has been formed to deal in","example[20]":"The objects of a business dictate what sort of organisation structure it needs.","definition[12]":"used to say that you do not care how much money is spent on something","example[21]":"It would appear that money is no object for the people behind this offer.","definition[13]":"a combination of DATA (=written information) and instructions acting on the data, for example in the form of a document or a picture"}