{"word[0]":"request","definition[0]":"a polite or formal demand for something","example[0]":"They have made an urgent request for international aid.","note[0]":"request for","example[1]":"requests from customers for more information","note[1]":"request from","example[2]":"Anderson repeated his request that we postpone the meeting.","note[2]":"request that","example[3]":"The study was done at the request of the Chairman.","note[3]":"at somebody’s request","example[4]":"Further details will be sent on request.","note[4]":"on request","example[5]":"There were no flowers at the funeral, by request.","note[5]":"by request","definition[1]":"a piece of music that is played on the radio because someone has asked for it","collocation[0]":"make a request","example[6]":"I’d like to make a request.","collocation[1]":"submit/put in a request","example[7]":"The request was first submitted a number of months ago.","example[8]":"He has put in a request for two weeks' holiday.","collocation[2]":"agree to a request","example[9]":"The judge granted his request.","example[10]":"Diana was happy to agree to his request.","collocation[3]":"refuse/reject a request","example[11]":"He rejected their request for a meeting.","example[12]":"This request was turned down because of the cost.","collocation[4]":"receive a request","example[13]":"They had received two urgent requests for assistance.","collocation[5]":"consider a request","example[14]":"After carefully considering this request, the council rejected it.","collocation[6]":"respond to a request","example[15]":"Thank you to those who responded to our request for information last month.","collocation[7]":"ignore a request","example[16]":"They ignored repeated requests to leave the property.","collocation[8]":"a formal request","example[17]":"The government made a formal request for food aid.","collocation[9]":"a special request","example[18]":"Do you have any special requests?","collocation[10]":"an urgent request","example[19]":"The family made an urgent request on television for help in finding their daughter.","collocation[11]":"a reasonable request","example[20]":"It seemed like a reasonable request.","collocation[12]":"a strange/unusual request","example[21]":"This is rather an unusual request.","collocation[13]":"a written request","example[22]":"If you wish to take you child on holiday during the school term, you must make a formal written request.","collocation[14]":"repeated requests","example[23]":"The bank would not reveal its figures, despite repeated requests.","definition[2]":"to ask for something in a polite or formal way","example[24]":"To request more information, please call our toll-free number.","example[25]":"You have to request permission if you want to take any photographs.","example[26]":"The prosecution has requested that all charges against Hodgkins be dropped.","example[27]":"All club members are requested to attend the annual meeting.","note[6]":"request somebody to do something","example[28]":"The Police Committee requested a grant from the Government to cover the extra expense.","note[7]":"request something from somebody","heading[0]":"GRAMMAR: Patterns with request","explanation[0]":"You request something","example[29]":"I requested permission to leave early","explanation[1]":"In everyday English, you request that someone does something","example[30]":"They request that he finishes the work by Friday","explanation[2]":"In more formal English, you request that someone do something, using the base form of the verb  (=the infinitive without ‘to’)","example[31]":"She requested that she be allowed to leave","explanation[3]":"You say that someone is requested to do something This pattern is used especially on official notices and announcements","example[32]":"Passengers are requested not to throw things out of the window","definition[3]":"to officially or formally ask for something","example[33]":"Enclosed, please find the information you requested.","example[34]":"The state has requested that the companies provide data on lead levels in their products.","definition[4]":"an official or formal demand for something","example[35]":"The fund group received 150,000 requests for its prospectus.","example[36]":"Bank officials meet today to consider a request for further credit from the troubled newspaper group.","example[37]":"A free sample copy will be provided on request."}