{"word[0]":"fitness","definition[0]":"when you are healthy and strong enough to do hard work or play sports","example[0]":"an exercise programme to improve your fitness","example[1]":"Running marathons requires a high level of physical fitness.","definition[1]":"the degree to which someone or something is suitable or good enough for a particular situation or purpose","example[2]":"He questioned McNeil’s fitness for high office.","note[0]":"fitness for","example[3]":"The doctor will first determine your fitness to receive the anaesthetic.","note[1]":"fitness to do something","collocation[0]":"improve your fitness","example[4]":"You can improve your fitness by going for a daily run.","collocation[1]":"increase your fitness","example[5]":"Aerobic exercise, such as jogging or cycling, will increase your fitness.","collocation[2]":"work on your fitness","example[6]":"He's working on his fitness in preparation for the New York marathon.","collocation[3]":"maintain your fitness","example[7]":"She worked hard to maintain her fitness while pregnant.","collocation[4]":"physical fitness","example[8]":"You need a reasonable level of physical fitness for this job.","collocation[5]":"general fitness","example[9]":"Swimming is good for your mobility and general fitness.","collocation[6]":"personal fitness","example[10]":"The gym offers personal fitness training by professionals.","form[0]":"fitness + NOUN","collocation[7]":"fitness levels","example[11]":"His fitness levels are as good as someone much younger.","collocation[8]":"a fitness programme","example[12]":"Get working on a fitness programme to suit you.","collocation[9]":"fitness training","example[13]":"The players have to do a lot of fitness training.","collocation[10]":"a fitness instructor","example[14]":"He was offered work as a fitness instructor.","collocation[11]":"a fitness room","example[15]":"Other facilities in the hotel include a fitness room and a sauna.","collocation[12]":"fitness equipment","example[16]":"We sell a range of exercise and fitness equipment for the home.","collocation[13]":"a fitness fanatic","example[17]":"My son's something of a fitness fanatic, and works out every day.","collocation[14]":"a fitness test","example[18]":"Chris Pike is facing a fitness test before tomorrow's match.","collocation[15]":"health and fitness","example[19]":"books about health and fitness"}