{"word[0]":"panic","definition[0]":"a sudden strong feeling of fear or nervousness that makes you unable to think clearly or behave sensibly","example[0]":"a feeling of sheer panic (=complete panic)","example[1]":"She got into a panic when she couldn’t find the tickets.","example[2]":"The whole nation is in a state of panic following the attacks.","example[3]":"She suffers from terrible panic attacks.","example[4]":"The children fled in panic.","note[0]":"in (a) panic","definition[1]":"a situation in which people are suddenly made very anxious, and make quick decisions without thinking carefully","example[5]":"a wave of panic selling in Hong Kong","note[1]":"panic buying/selling","example[6]":"the recent panic over the safety of baby milk","note[2]":"panic over/about","definition[2]":"a situation in which you have a lot to do and not much time to do it in","example[7]":"the usual last minute panic just before the deadline","collocation[0]":"there was (a) panic","example[8]":"When the shooting started, there was panic.","collocation[1]":"cause panic","example[9]":"The earthquake caused widespread panic.","collocation[2]":"feel panic","example[10]":"He felt a mild panic.","collocation[3]":"get into a panic","example[11]":"There’s no need to get into a panic.","collocation[4]":"throw/send somebody into a panic","example[12]":"The innocent question threw her into a panic.","collocation[5]":"panic breaks out","example[13]":"Suddenly, everything went dark and panic broke out.","collocation[6]":"panic sets in","example[14]":"Before panic could set in, she realised that the clock was fast.","collocation[7]":"panic ensues","example[15]":"Panic ensued as people ran out of the burning building.","collocation[8]":"panic rises within somebody","example[16]":"She felt panic rising within her.","collocation[9]":"panic spreads","example[17]":"Panic spread as news of the invasion reached Paris.","collocation[10]":"a big/huge panic","example[18]":"There was a big panic about the virus last year.","collocation[11]":"growing/mounting/rising panic","example[19]":"She quickly packed a bag, trying all the time to control her mounting panic.","collocation[12]":"total/sheer panic","example[20]":"A wave of total panic swept across her.","collocation[13]":"blind panic","example[21]":"He ran to the library in blind panic.","collocation[14]":"sudden panic","example[22]":"Florrie exclaimed in sudden panic: ‘I’ve left my bag on the bus!’","collocation[15]":"mild panic","example[23]":"There was a note of mild panic in her voice.","collocation[16]":"momentary panic","example[24]":"Her momentary panic faded.","collocation[17]":"a state of panic","example[25]":"She was in a constant state of panic that he would carry out his threat.","collocation[18]":"a sense/feeling of panic","example[26]":"She looked out to sea with a rising sense of panic.","collocation[19]":"a wave/surge of panic","example[27]":"A sudden wave of panic overcame him.","collocation[20]":"a panic attack","example[28]":"He had had a panic attack in the street.","definition[3]":"to suddenly feel so frightened that you cannot think clearly or behave sensibly, or to make someone do this","example[29]":"He started to panic when he saw the gun.","example[30]":"Don’t panic! We’ll soon get you out of there.","example[31]":"The protests became more violent and many people were panicked into leaving the country.","note[3]":"panic somebody into doing something","definition[4]":"a feeling of great fear and anxiety that makes you act without thinking","example[32]":"The stock market crash left an air of panic from which many individual investors still haven’t recovered.","example[33]":"By announcing future price increases, the administration touched off a consumer panic.","definition[5]":"when people are so anxious or worried about the future that they buy or sell goods, shares etc without thinking carefully first","example[34]":"Manila shares plunged 10.9% in panic selling.","example[35]":"At a supermarket in Brussels, panic buying got so furious that the managers stopped trying to put sugar, coffee and mineral water on the shelves.","past_tense[0]":"panicked","definition[6]":"to suddenly become so frightened and anxious that you do things without thinking clearly, or to make someone do this","example[36]":"Financial markets panicked, causing a run on the currency  (=causing the currency to lose a lot of its value).","example[37]":"Crowds of depositors, many panicked by fears they would lose their life savings, formed outside the banks."}