{"word[0]":"investment","definition[0]":"the use of money to get a profit or to make a business activity successful, or the money that is used","example[0]":"We plan to buy some property as an investment.","example[1]":"That year, Japanese investment in American real estate totaled $13.06 billion.","note[0]":"investment in","example[2]":"Each of us was required to put up a minimum investment of £5,000.","note[1]":"investment of","definition[1]":"something that you buy or do because it will be useful later","example[3]":"The lessons cost me over £500, but I consider them a good investment.","note[2]":"a good/sound investment","definition[2]":"when you spend a large amount of time, energy, emotion etc on something","example[4]":"a huge investment of time and effort","heading[0]":"– Meaning 1 : the use of money to get a profit or to make a business activity successful, or the money that is used","collocation[0]":"make an investment (in something)","example[5]":"We have made a huge investment in our website.","collocation[1]":"attract investment","example[6]":"The company is trying to attract investment from overseas.","collocation[2]":"stimulate/encourage investment","example[7]":"The government has cut taxes in order to stimulate investment.","collocation[3]":"protect your investment","example[8]":"It's best to invest in several funds, in order to protect your investment.","collocation[4]":"recoup your investment","example[9]":"Investors will have to take legal action to recoup their investment.","collocation[5]":"a good investment","example[10]":"Property is usually a good investment.","collocation[6]":"a bad/poor investment","example[11]":"The shares turned out to be a poor investment.","collocation[7]":"a big/major/massive/huge investment","example[12]":"Developing a new computer system is always a big investment for any organisation.","collocation[8]":"a safe investment","example[13]":"Electricity shares are still a safe investment.","collocation[9]":"a wise investment","example[14]":"A pension might be a wise investment.","collocation[10]":"a risky investment","example[15]":"Risky investments usually have higher yields.","collocation[11]":"foreign/overseas investment","example[16]":"The government is eager to attract foreign investment to fund building projects.","collocation[12]":"a long-term investment","example[17]":"Buying a house is a long-term investment.","collocation[13]":"a short-term investment","example[18]":"Interest rates will be cut on short-term investments.","collocation[14]":"private investment","example[19]":"Public expenditure in declining areas will attract future private investment.","collocation[15]":"public investment","example[20]":"There have been drastic cuts in public investment in housing.","collocation[16]":"capital investment","example[21]":"A huge capital investment will have to be made to maintain the buildings.","form[0]":"investment + NOUN","collocation[17]":"an investment scheme","example[22]":"Most investment schemes are subject to tax.","collocation[18]":"an investment opportunity","example[23]":"She took advantage of a unique investment opportunity.","collocation[19]":"an investment adviser","example[24]":"He has served as an investment adviser for several major banks.","collocation[20]":"an investment banker","example[25]":"He is an investment banker at a prestigious Wall Street firm.","collocation[21]":"investment income","example[26]":"The rate of taxation on investment income is set to increase.","collocation[22]":"investment funds","example[27]":"The city is in a good position to attract new investment funds.","collocation[23]":"the (rate of) return on an investment","example[28]":"We expect a high return on our investment.","definition[3]":"when money is put into a business in order to make it more successful and profitable, or the money that is put into a business","example[29]":"tax cuts aimed at stimulating investment","example[30]":"More investment is also needed to develop the food-processing industry in rural areas.","example[31]":"Mr Olsen founded the company with a $70,000 investment in 1957.","example[32]":"The Postal Service has made an extremely large investment in automated technology.","example[33]":"Investment in manufacturing has fallen by 18.8 percent in the past year.","definition[4]":"something you buy, such as shares, bonds, or property, in order to make a profit","example[34]":"Bondholders favor lower interest rates because they increase the worth of their investments.","example[35]":"The top rate of taxation on investment income (=income from investments) reached 98 percent.","definition[5]":"an amount of money that you invest","example[36]":"They want a good return on their investment.","example[37]":"Some international funds demand a minimum initial investment of only $1,000 or even less.","definition[6]":"when you buy shares, bonds, property etc in order to make a profit","example[38]":"They derived their wealth from investment in property."}