{"word[0]":"quote","definition[0]":"to repeat exactly what someone else has said or written","example[0]":"He quoted a short passage from the Bible.","example[1]":"A military spokesman was quoted as saying that the border area is now safe.","example[2]":"She quoted from a newspaper article.","note[0]":"quote from","example[3]":"Can I quote you on that?","note[1]":"quote somebody on something","definition[1]":"to give a piece of information that is written down somewhere","example[4]":"You can order by phoning our hotline and quoting your credit card number.","example[5]":"He quoted a figure of 220 deaths each year from accidents in the home.","definition[2]":"to give something as an example to support what you are saying","synonym[0]":"cite","example[6]":"Mr Jackson quoted the case of an elderly man who had been evicted from his home.","example[7]":"He quoted the example of France as a country with a good rail service.","note[2]":"quote something as something","example[8]":"The nurses’ union was quoted as an example of a responsible trade union.","definition[3]":"to tell a customer the price you will charge them for a service or product","example[9]":"They quoted a price of £15,000.","example[10]":"The firm originally quoted £6,000 for the whole job.","note[3]":"quote something for something","definition[4]":"to give the price of a share or currency","example[11]":"The pound was quoted this morning at just under $1.46.","example[12]":"The company is now quoted on the stock exchange (=people can buy and sell shares in it).","definition[5]":"a sentence or phrase from a book, speech etc which you repeat in a speech or piece of writing because it is interesting or amusing","synonym[1]":"quotation","example[13]":"a quote from the minister’s speech","definition[6]":"a statement of how much it will probably cost to build or repair something","synonym[2]":"estimate","example[14]":"Always get a quote before proceeding with repair work.","example[15]":"Hotels often quote a special rate for groups who use the hotel on a regular basis.","example[16]":"The company’s shares were quoted at $35.375, down 12.5 cents.","note[4]":"be quoted at","example[17]":"The dollar was quoted at 124.85 yen.","definition[7]":"a written statement of how much something will cost, for example some building work","synonym[3]":"QUOTATION","example[18]":"Always get a quote before proceeding with work."}