{"definition[0]":"people who write reports for newspapers, radio, or television","example[0]":"the freedom of the press","example[1]":"The press has been very nasty about him.","definition[1]":"reports in newspapers and on radio and television","note[0]":"tabloid/popular etc press","example[2]":"To judge from the press, the concert was a great success.","example[3]":"press reports","example[4]":"The band has received good press coverage (=the reports written about something in newspapers).","example[5]":"The story was widely covered in the national press.","note[1]":"local/national etc press","signpost[0]":"printing","definition[2]":"a business that prints and sometimes also sells books","example[6]":"the Clarendon Press","definition[3]":"a machine that prints books, newspapers, or magazines","definition[4]":"a piece of equipment used to put weight on something in order to make it flat or to force liquid out of it","example[7]":"a trouser press","example[8]":"a flower press","definition[5]":"a light steady push against something small","example[9]":"Give the button another press.","type[0]":"singular + of","definition[6]":"a crowd of people pushing against each other","form[0]":"ADJECTIVES/NOUN + press","collocation[0]":"the national press","example[10]":"There was very little about the incident in the national press.","collocation[1]":"the local press","example[11]":"Evening classes are advertised in the local press.","collocation[2]":"the British/American etc press","example[12]":"The British press have blamed other countries for North Sea pollution.","collocation[3]":"the foreign press","example[13]":"African countries want the foreign press to report African affairs.","collocation[4]":"the quality press","example[14]":"The book received excellent reviews in the quality press.","collocation[5]":"the tabloid/popular press","example[15]":"He regularly appeared in the tabloid press alongside well-known actresses.","collocation[6]":"the gutter press","example[16]":"The gutter press enjoyed printing the sensational story.","collocation[7]":"a free press","example[17]":"I am glad that we have a free press in this country.","collocation[8]":"talk/speak to the press","example[18]":"He is reluctant to talk to the press.","collocation[9]":"tell the press something","example[19]":"‘It was a really tough decision, ’ she told the press.","collocation[10]":"leak something to the press","example[20]":"The confidential report was leaked to the press.","form[1]":"press + NOUN","example[21]":"According to press reports, he was suffering from exhaustion.","collocation[11]":"press coverage","example[22]":"The event received a lot of press coverage.","collocation[12]":"a press photographer","example[23]":"A group of press photographers was waiting for her outside.","signpost[1]":"against something","definition[7]":"to push something firmly against a surface","example[24]":"Manville kept his back pressed flat against the wall.","example[25]":"She pressed the gas pedal and the car leapt forwards.","example[26]":"He pressed a card into her hand before leaving.","signpost[2]":"button","definition[8]":"to push a button, switch etc to make a machine start, a bell ring etc","example[27]":"Lily pressed the switch and plunged the room into darkness.","example[28]":"Press control, alt, delete to log on to the computer.","definition[9]":"to make clothes smooth using a hot iron","synonym[0]":"iron","example[29]":"I’ll need to press my suit.","definition[10]":"to move in a particular direction by pushing","example[30]":"The car rocked as the crowd pressed hard against it.","definition[11]":"to try hard to persuade someone to do something, especially by asking them many times","example[31]":"I felt that if I had pressed him he would have lent me the money.","example[32]":"I was pressing my claim for custody of the child.","example[33]":"The police pressed her to remember all the details.","note[2]":"press somebody to do something","example[34]":"The manufacturers are pressing the government for action.","note[3]":"press somebody for something","example[35]":"We must continue to press for full equality.","note[4]":"press for","signpost[3]":"heavy weight","definition[12]":"to put pressure or a weight on something to make it flat, crush it etc","example[36]":"pressed flowers","example[37]":"At this stage the grapes have to be pressed.","signpost[4]":"hold somebody/something close","definition[13]":"to hold someone or something close to you","example[38]":"He reached out and pressed her to him.","note[5]":"press somebody/something to you","definition[14]":"to offer something to someone and try to make them take it","example[39]":"I pressed money on him, but he refused to take it.","note[6]":"press something on somebody","signpost[5]":"exercise","definition[15]":"to push a weight up from your chest using only your arms, without moving your legs or feet","signpost[6]":"record","definition[16]":"to make a copy of a record, CD etc","definition[17]":"to push something down or against a surface with your fingers or foot","example[40]":"The doctor gently pressed her stomach.","example[41]":"To move forward, press the accelerator.","example[42]":"I pressed ‘delete’ and started again.","display[0]":"squeeze","definition[18]":"to press something inwards from both sides","example[43]":"It’s one of those balls that make a funny noise when you squeeze it.","example[44]":"Squeeze the lemon and add the juice to the sauce.","display[1]":"squash","definition[19]":"to press something against a surface accidentally and damage it by making it flat","example[45]":"Don’t squash the tomatoes.","example[46]":"He sat on my hat and squashed it.","display[2]":"crush","definition[20]":"to press something very hard so that it breaks into very small pieces, or is very badly damaged","example[47]":"Crush two cloves of garlic.","example[48]":"The front of the car was completely crushed in the crash.","display[3]":"mash","definition[21]":"to press cooked vegetables or fruit until they are soft and smooth","example[49]":"Mash the potatoes while they are warm.","example[50]":"Babies love mashed bananas.","display[4]":"grind","definition[22]":"to press something solid until it becomes a powder, using a machine or tool","example[51]":"the machine that grinds the corn","example[52]":"freshly ground coffee","definition[23]":"to try hard to persuade someone to do something","example[53]":"Investor Harold Simmons is pressing to have the company’s annual meeting delayed.","example[54]":"Finance Ministry officials are pressing the brokerage houses to eliminate the problem.","example[55]":"The extension will give the union more time to press Chrysler to keep the plant open.","definition[24]":"if someone presses a claim, demand etc, they continue trying to get it accepted","example[56]":"China is pressing its claim to the scattered territories, some of which have oil-drilling potential.","example[57]":"We will continue to press our case vigorously in the courts.","definition[25]":"to say officially that someone has done something illegal and must go to court","example[58]":"A Citicorp official said the bank would not be pressing charges.","example[59]":"The government is pressing a civil action to get the money from investors.","definition[26]":"the people writing for the newspapers, radio, or television","example[60]":"The judgement reflected badly on the press, including his own newspaper.","example[61]":"a meeting with the financial press","definition[27]":"reports in the newspapers and on radio and television","example[62]":"a savage attack on the banking sector inthe local press reports.","example[63]":"Criticism from the investigation committee could lead to some unpleasant press coverage (=reports in the newspapers, on television etc).","example[64]":"The FBI has been getting a bad press lately  (=there have been a lot of reports criticizing it in the newspapers etc).","definition[28]":"a business that prints and sometimes sells books","example[65]":"a small independent press","example[66]":"the University of Chicago Press"}