{"word[0]":"quarrel","definition[0]":"an angry argument or disagreement","example[0]":"Jacob left after a quarrel with his wife.","note[0]":"quarrel with","example[1]":"They had a quarrel about some girl.","note[1]":"quarrel about/over","example[2]":"Had there been any quarrel between you?","note[2]":"quarrel between","definition[1]":"a reason to disagree with something or argue with someone","example[3]":"I have no quarrel with the court’s verdict.","example[4]":"My only quarrel with this plan is that it’s going to take far too long.","collocation[0]":"have a quarrel","example[5]":"We had a terrible quarrel last night.","collocation[1]":"pick a quarrel","example[6]":"Members of the gang were picking quarrels with strangers.","collocation[2]":"patch up a quarrel","example[7]":"The brothers eventually patched up their quarrel.","collocation[3]":"a quarrel breaks out","example[8]":"A fresh quarrel broke out between the players.","form[0]":"ADJECTIVES/NOUN + quarrel","collocation[4]":"a family quarrel","example[9]":"Your family quarrels are none of my concern.","collocation[5]":"a lovers’ quarrel","example[10]":"Outside, two teenagers were having a lovers’ quarrel.","example[11]":"They are locked in a bitter quarrel over ownership of the land.","collocation[6]":"violent","example[12]":"That morning, after a violent quarrel, she threatened him with a kitchen knife.","example[13]":"Soon afterwards, they had their first serious quarrel.","collocation[7]":"an old quarrel","example[14]":"Now is the time to patch up old quarrels.","definition[2]":"to have an argument","example[15]":"I wish you two would stop quarreling.","example[16]":"I always seem to be quarrelling with my parents.","example[17]":"We’re not going to quarrel about a few dollars.","note[3]":"quarrel about","explanation[0]":"Quarrel is a reciprocal verb This type of verb is used when saying that two or more people do something that involves both or all of them","example[18]":"The brothers quarrelled","example[19]":"The brothers quarrelled with each other","example[20]":"He quarrelled with his brother"}