{"word[0]":"while","definition[0]":"during the time that something is happening","example[0]":"They arrived while we were having dinner.","example[1]":"While she was asleep, thieves broke in and stole her handbag.","example[2]":"She met Andy while working on a production of ‘Carmen’.","definition[1]":"all the time that something is happening","example[3]":"Would you look after the children while I do the shopping?","heading[0]":"GRAMMAR: Choosing the right tense","explanation[0]":"You use the present tense, not ‘will’, with while when you are talking about the future","example[4]":"I hope to visit the British Museum while I am in London","bad_example[0]":"I hope to visit the British Museum while I will be in London","definition[2]":"used to emphasize the difference between two situations, activities etc","example[5]":"Schools in the north tend to be better equipped, while those in the south are relatively poor.","definition[3]":"in spite of the fact that","synonym[0]":"although","example[6]":"While never a big eater, he did snack a lot.","example[7]":"While there was no conclusive evidence, most people thought he was guilty.","definition[4]":"during the time that you are doing something, or something is happening","example[8]":"I bought a magazine while I was waiting for the train.","example[9]":"While we were on holiday, my bag was stolen.","display[0]":"meanwhile","definition[5]":"at the same time as something else is happening","example[10]":"They’re still working on our bedroom. Meanwhile, we’re sleeping downstairs.","example[11]":"The Russians, meanwhile, declared war on August 8.","display[1]":"in the meantime","definition[6]":"during the period of time between now and a future event, or between two events in the past","example[12]":"More aid is expected soon, but in the meantime these people are going hungry.","example[13]":"My new job hadn’t started, so in the meantime I tried to write a book.","display[2]":"whilst","definition[7]":"while. Whilst sounds a little more formal than while","example[14]":"One American plane was forced to land whilst flying over North Korea.","example[15]":"Whilst all this was going on, the performers were getting ready for the show."}