{"definition[0]":"to make something happen, especially something bad","example[0]":"Heavy traffic is causing delays on the freeway.","example[1]":"The fire caused £15,000 worth of damage.","example[2]":"Sorry, I didn’t mean to cause offence (=offend you).","example[3]":"The policy changes have caused great uncertainty for the workforce.","note[0]":"cause concern/uncertainty/embarrassment etc","example[4]":"I’m sorry if I caused any confusion.","example[5]":"You’ve caused us all a lot of unnecessary worry.","note[1]":"cause somebody trouble/problems etc","example[6]":"The oil spill is causing problems for coastal fisheries.","note[2]":"cause something for somebody","example[7]":"What caused you to change your mind?","note[3]":"cause somebody/something to do something","explanation[0]":"In everyday English, people usually use the expression make somebody do something rather than cause somebody to do something:","example[8]":"What made you change your mind?","heading[0]":"– Meaning 1 : to make something happen, especially something bad","collocation[0]":"cause a problem","example[9]":"The heavy rain has been causing serious problems on the roads.","collocation[1]":"cause trouble","example[10]":"I decided not to complain because I didn’t want to cause trouble.","collocation[2]":"cause damage","example[11]":"A fire had broken out and caused severe damage to the roof.","collocation[3]":"cause (a) disease","example[12]":"Scientists are trying to find out what causes the disease.","collocation[4]":"cause injury","example[13]":"Rugby is one of the sports that are most likely to cause injury.","collocation[5]":"cause pain","example[14]":"The infection can cause severe pain.","collocation[6]":"cause death","example[15]":"The famine caused the death of up to 400,000 people.","collocation[7]":"cause (a) delay","example[16]":"Bad weather caused delays at many airports.","collocation[8]":"cause an accident","example[17]":"75% of accidents are caused by speeding.","collocation[9]":"cause chaos/disruption","example[18]":"Floods caused chaos across much of the country.","collocation[10]":"cause concern/alarm","example[19]":"Environmental issues are causing widespread concern.","collocation[11]":"cause confusion","example[20]":"Teachers say the reforms will cause confusion in schools.","collocation[12]":"cause offence/embarrassment","example[21]":"How can I refuse the invitation without causing offence?","explanation[1]":"Someone or something causes something","example[22]":"Investigators are trying to find out what caused the accident","explanation[2]":"Something causes a person or thing to do something","example[23]":"The warmer temperatures caused the ice caps to melt","example[24]":"The injury caused him to lose the game","bad_example[0]":"cause that someone does something","explanation[3]":"Someone or something makes another person or thing do something","example[25]":"The warmer temperatures made the ice caps melt","example[26]":"The injury made him lose the game","bad_example[1]":"make someone/something to do something","example[27]":"Bad weather has caused a lot of problems on the roads.","example[28]":"The fault caused the whole computer system to shut down.","display[0]":"make somebody/something do something","definition[1]":"to cause someone to do something, or cause something to happen. Make is less formal than cause, and is the usual word to use in everyday English","example[29]":"What made you decide to become a teacher?","example[30]":"I’m sorry, I didn’t mean to make you cry.","example[31]":"Gravity is the force which makes the planets move round the Sun.","display[1]":"be responsible for something","definition[2]":"if someone or something is responsible for something bad, they caused it to happen","example[32]":"The excessive heat was responsible for their deaths.","example[33]":"A small militant group was responsible for the bombing.","display[2]":"bring about something","definition[3]":"to make something happen – used especially about changes or improvements","example[34]":"The Internet has brought about enormous changes in society.","example[35]":"It’s important that we do everything we can to bring about peace.","display[3]":"result in something","definition[4]":"if an action or event results in something, it makes that thing happen","example[36]":"The fire resulted in the deaths of two children.","example[37]":"The decision is likely to result in a large number of job losses.","display[4]":"lead to something","definition[5]":"to cause something to happen eventually after a period of time","example[38]":"The information led to several arrests.","example[39]":"A poor diet in childhood can lead to health problems later in life.","display[5]":"trigger","definition[6]":"if one event triggers another, it suddenly makes the second event happen","example[40]":"The incident triggered a wave of violence.","example[41]":"An earthquake off Java’s southern coast triggered a tsunami.","display[6]":"precipitate","definition[7]":"to make a very serious event happen very suddenly, which will affect a lot of people","example[42]":"The withdrawal of foreign investment would precipitate an economic crisis.","example[43]":"The assassination of Archduke Franz Ferdinand precipitated World War I.","definition[8]":"a person, event, or thing that makes something happen","example[44]":"It’s our job to establish the cause of the fire.","example[45]":"Breast cancer is the leading cause of death for American women in their 40s.","note[4]":"cause of","definition[9]":"a fact that makes it right or reasonable for you to feel or behave in a particular way","example[46]":"His father has good cause to be proud of him.","note[5]":"have (good) cause to do something","example[47]":"Many people are worried about the economy, and with good cause.","note[6]":"with/without good cause","example[48]":"There is no cause for alarm.","note[7]":"cause for","example[49]":"The patient’s condition is giving cause for concern.","example[50]":"The present political climate gives little cause for optimism.","definition[10]":"an aim, belief, or organization that a group of people support or fight for","example[51]":"My father fought for the Nationalist cause.","example[52]":"You can get fit, and at the same time raise money for a worthy cause.","example[53]":"Please give generously – it’s all in a good cause (=done in order to help people).","example[54]":"her lifelong devotion to the cause of women’s rights","example[55]":"He has championed the cause of independence  (=he has supported it publicly).","definition[11]":"a case that is brought to a court of law","heading[1]":"– Meaning 1: a person, event, or thing that makes something happen","collocation[13]":"a common cause of something","example[56]":"Alcohol is the most common cause of road accidents.","collocation[14]":"the main/primary cause of something","example[57]":"Smoking is the main cause of lung disease.","collocation[15]":"a major/leading cause of something","example[58]":"In this country, debt is a major cause of homelessness.","example[59]":"Drug abuse is the leading cause of crime and violence.","collocation[16]":"a direct/indirect cause","example[60]":"Government policies are the direct cause of the problems facing the economy.","collocation[17]":"the root cause","example[61]":"People often deal with the symptoms rather than the root cause of a problem.","collocation[18]":"the fundamental/underlying cause","example[62]":"The underlying cause of insomnia is often anxiety.","collocation[19]":"the probable/likely cause","example[63]":"The probable cause of the fire was faulty wiring.","collocation[20]":"discover/find the cause","example[64]":"An investigation has failed to discover the cause of the epidemic.","collocation[21]":"determine/establish/identify the cause","example[65]":"A team of experts is at the scene of the accident, trying to determine the cause.","collocation[22]":"investigate the cause","example[66]":"Police are still investigating the cause of the fire.","collocation[23]":"the cause of death","example[67]":"A snake bite was the cause of death.","collocation[24]":"die of/from natural causes","example[68]":"He died from natural causes, believed to be a heart attack.","collocation[25]":"cause and effect","example[69]":"What happened was simply a question of cause and effect.","heading[2]":"– Meaning 3: an aim, belief, or organization that a group of people support or fight for","collocation[26]":"a good cause","example[70]":"The money we are raising is for a good cause.","collocation[27]":"a worthy/deserving cause","example[71]":"The Red Cross is a very worthy cause.","collocation[28]":"a just cause","example[72]":"The rebels believed that they were fighting for a just cause.","collocation[29]":"a noble cause","example[73]":"He died for a noble cause.","collocation[30]":"the Nationalist/Republican etc cause","example[74]":"The election results were a serious blow to the Nationalist cause.","collocation[31]":"support a cause","example[75]":"Giving money is only one way of supporting a good cause.","collocation[32]":"fight for a cause","example[76]":"Young people often want to fight for a cause.","collocation[33]":"champion a cause","example[77]":"He has championed the cause of renewable energy since the 1980s.","collocation[34]":"advance/further/promote a cause","example[78]":"He did much to advance the cause of freedom.","collocation[35]":"be committed to a cause","example[79]":"We are committed to the cause of racial justice.","collocation[36]":"be sympathetic to a cause","example[80]":"They hope the new president will be sympathetic to their cause.","explanation[4]":"You say the cause of something","example[81]":"What was the cause of the problem?","bad_example[2]":"the cause for the problem","explanation[5]":"You say there is cause for concern/alarm/complaint etc","example[82]":"The doctor said there was cause for concern","bad_example[3]":"There was a cause for concern","explanation[6]":"You say the reason for something","example[83]":"What do you think was the reason for their success?","bad_example[4]":"the reason of their success","explanation[7]":"You talk about the reason why something happens","example[84]":"Can you tell me the reason why you did this?"}