{"word[0]":"practise","definition[0]":"to do an activity, often regularly, in order to improve your skill or to prepare for a test","example[0]":"They moved the furniture back to practise their dance routine.","example[1]":"It gives students the opportunity to practice their speaking skills.","example[2]":"Today we’re going to practise parking.","note[0]":"practise doing something","example[3]":"She’s practicing for her piano recital.","note[1]":"practise for","example[4]":"Everybody wants to practise their English on me.","note[2]":"practise something on somebody","explanation[0]":"Practise is followed by an -ing form, not an infinitive You say","example[5]":"We practised hitting the ball","bad_example[0]":"We practised to hit the ball","definition[1]":"to use a particular method or custom","example[6]":"This technique is widely practised in Europe  (=many people use it).","definition[2]":"to work as a doctor or lawyer","example[7]":"When she has completed her training, she intends to practise in the UK.","example[8]":"Gemma is now practising as a dentist.","note[3]":"practise as","definition[3]":"if you practise a religion, system of ideas etc, you live your life according to its rules","example[9]":"They are free to practice their religion openly.","definition[4]":"to do an activity many times in order to improve your skill or to prepare for a test","example[10]":"The course will give you a chance to practise your language skills.","example[11]":"He was practising his golf swing.","example[12]":"You need to practise regularly if you're going to be a good piano player.","definition[5]":"to practise physical movements or activities in preparation for a race or game","example[13]":"He's training for the Olympics.","display[0]":"rehearse","definition[6]":"to practise a play, speech, or music in preparation for a public performance","example[14]":"She's in New York where she's rehearsing her new play.","example[15]":"The band are currently rehearsing for their world tour.","display[1]":"work on something","definition[7]":"to practise a particular skill so that your general performance improves","example[16]":"You need to work on your listening comprehension.","display[2]":"go/run through something","definition[8]":"to practise something such as a speech, play, or piece of music by reading or playing it from the beginning to the end","example[17]":"I'll just run through the speech one more time.","definition[9]":"to work in a particular profession, especially medicine or law","example[18]":"He practised law for 15 years.","example[19]":"Firms are adopting the system of practicing in larger partnerships and teams.","example[20]":"Students must reach the highest standards to allow them to practise as actuaries."}