{"word[0]":"crown","signpost[0]":"hat for king/queen","definition[0]":"a circle made of gold and decorated with jewels, worn by kings and queens on their heads","definition[1]":"a circle, sometimes made of things such as leaves or flowers, worn by someone who has won a special honour","signpost[1]":"tooth","definition[2]":"an artificial top for a damaged tooth","signpost[2]":"head","definition[3]":"the top part of a hat or someone’s head","example[0]":"a hat with a high crown","example[1]":"auburn hair piled high on the crown of her head","note[0]":"crown of","signpost[3]":"hill","definition[4]":"the top of a hill or something shaped like a hill","example[2]":"They drove to the crown of Zion hill and on into town.","example[3]":"The masonry at the crown of the arch is paler than on either curve.","definition[5]":"the position you have if you have won an important sports competition","example[4]":"Can she retain her Wimbledon crown?","example[5]":"He went on to win the world crown in 2001.","definition[6]":"the standard unit of money in some European countries","example[6]":"Swedish crowns","definition[7]":"an old British coin. Four crowns made a pound.","definition[8]":"a mark, sign, badge etc in the shape of a crown, used especially to show rank or quality","definition[9]":"to place a crown on the head of a new king or queen as part of an official ceremony in which they become king or queen","example[7]":"Louis was crowned at Reims in 814.","example[8]":"In 1896 Nicholas was crowned as Tsar.","note[1]":"crown somebody (as) king/queen etc","definition[10]":"to give someone a title for winning a competition","example[9]":"She was crowned Wimbledon champion.","definition[11]":"to make something perfect or complete, by adding an achievement etc","example[10]":"a long career crowned with a peaceful retirement","note[2]":"crown somebody with something","definition[12]":"to put a protective top on a damaged tooth","definition[13]":"to hit someone on the head","definition[14]":"the government of a country such as Britain that is officially led by a king or queen","example[11]":"The islands are possessions of the Crown.","definition[15]":"the English name for a unit of currency used in Denmark, Norway, and Sweden","example[12]":"The Swedish drug company had pre-tax profits of 545 million crowns."}