{"word[0]":"petition","definition[0]":"a written request signed by a lot of people, asking someone in authority to do something or change something","example[0]":"They wanted me to sign a petition against experiments on animals.","example[1]":"Local residents have drawn up a petition to protest the hospital closure.","example[2]":"petition drive American English (=an attempt to get a lot of people to sign a petition)","example[3]":"a petition against the new road","note[0]":"petition for/against","definition[1]":"an official letter to a law court, asking for a legal case to be considered","example[4]":"She is threatening to file a petition for divorce.","note[1]":"petition for","definition[2]":"a formal prayer or request to someone in authority or to God","collocation[0]":"sign a petition","example[5]":"Five hundred villagers have signed the petition.","collocation[1]":"draw up a petition","example[6]":"They are drawing up a petition which will be presented to the Archbishop.","collocation[2]":"organize a petition","example[7]":"Local residents organized a petition against the closure of the library.","collocation[3]":"present/deliver a petition","example[8]":"A group of pensioners went to London to present the petition.","collocation[4]":"a petition calling for something/demanding something","example[9]":"A petition calling for an inquiry was signed by 15,118 people.","collocation[5]":"a petition opposing something","example[10]":"458 local people signed a petition opposing the move.","form[0]":"petition + NOUN","collocation[6]":"a petition drive","example[11]":"More than 20,000 signatures were gathered by the petition drive.","definition[3]":"to ask the government or an organization to do something by sending them a petition","example[12]":"Villagers petitioned the local authority to provide better bus services.","note[2]":"petition somebody to do something","example[13]":"Residents are petitioning against the new road.","note[3]":"petition against/for","definition[4]":"to make a formal request to someone in authority, to a court of law, or to God","example[14]":"More and more couples are petitioning for divorce.","example[15]":"He will file the petition early next week."}