{"word[0]":"set something ↔ aside","definition[0]":"to keep something, especially money, time, or a particular area, for a special purpose","example[0]":"Try to set aside some time each day for exercise.","example[1]":"a room that had been set aside for visitors","definition[1]":"to decide not to consider a particular feeling or thing because something else is more important","example[2]":"Both sides agreed to set aside the question of independence.","definition[2]":"to officially state that a previous legal decision or agreement no longer has any effect","example[3]":"The judge set aside the verdict of the lower court.","definition[3]":"if a farmer sets aside land, he or she agrees not to grow any crops on it, and accepts a payment from the government for this","definition[4]":"an arrangement in the European Union in which a government pays farmers to leave some of their fields empty, in order to avoid producing too much of a crop and to keep the price higher","definition[5]":"an arrangement in the US in which a local government helps small businesses to develop by making financial help available to them","example[4]":"In 1976, Connecticut established one of the nation’s first set-aside programs.","definition[6]":"an amount of money that is kept so that it can be used for a special purpose","synonym[0]":"reserve","definition[7]":"to keep something, especially a particular amount of money, so that it can be used for a special purpose","example[5]":"$500,000 were set aside in a ‘reserve account’, the government document said.","definition[8]":"to officially cancel an earlier legal decision or agreement","example[6]":"The judgeset aside a jury verdict awarding £3.2 million to a private firm in a contract dispute.","definition[9]":"an amount of money kept so that it can be used for a special purpose","synonym[1]":"RESERVE","example[7]":"The bank is increasing its set-aside at the rate of roughly $50 million a quarter.","definition[10]":"an arrangement in which a local government helps small businesses to develop by making loans etc available to them","example[8]":"In 1976, Connecticut established one of the nation’s firstset-aside programs."}