{"word[0]":"there","explanation[0]":"You use there are before a plural noun    You will sometimes hear native speakers say this is in informal conversation, but it is grammatically incorrect","example[0]":"There are a lot of problems","bad_example[0]":"There is a lot of problems","explanation[1]":"Instead of saying there is, you often say there’s","example[1]":"There’s one small problem","explanation[2]":"There cannot be omitted","bad_example[1]":"Is one small problem","heading[0]":"USAGE: Spelling","explanation[3]":"Don’t confuse there and their You write  Don’t write","example[2]":"They love their jobs","bad_example[2]":"They love there jobs","definition[0]":"in or to a particular place that is not where you are","example[3]":"We could go back to my cottage and have lunch there.","example[4]":"Scotland? I’ve always wanted to go there.","example[5]":"Hold it right there and don’t move.","example[6]":"Can you pass me that wine glass there?","example[7]":"Look, there’s that bookshop I was telling you about.","example[8]":"Who’s that man over there?","example[9]":"It’s too far to drive there and back in one day.","example[10]":"Are we going to get there (=arrive) before the banks close?","example[11]":"I know there’s a mouse under there somewhere.","note[0]":"out/in/under etc there","example[12]":"We flew to Miami and from there to La Paz.","definition[1]":"if something is there, it exists","example[13]":"The chance was there, but I didn’t take it.","example[14]":"The countryside is there for everyone to enjoy.","example[15]":"Three months after the operation, the pain was still there.","definition[2]":"at or to a particular point in time, in a process, or in a story","example[16]":"Let’s stop there and I’ll tell you the rest of the story tomorrow.","example[17]":"She got a divorce, but her troubles didn’t end there.","example[18]":"There’s still a lot of work to do, but we’re getting there (=coming to the end of the process) slowly.","definition[3]":"used to refer to something that someone has said when you are answering them","example[19]":"That’s true. I agree with you there.","example[20]":"‘Why did the system fail?’ ‘Well, there you’ve got me – I really don’t know.’","definition[4]":"used when greeting someone or calling to them","example[21]":"Hi there, you must be Laura.","example[22]":"Hey, you there! Watch out!","definition[5]":"used when you want to speak to someone on the telephone and someone else answers","example[23]":"Hello, Georgie, is your mother there?","definition[6]":"used to express satisfaction that you have been proved right or that you have done what you intended to do","example[24]":"There! I’ve done it! I’ve resigned.","example[25]":"There, what did I tell you? I knew it wouldn’t work."}