{"word[0]":"argue","definition[0]":"to disagree with someone in words, often in an angry way","example[0]":"We could hear the neighbours arguing.","example[1]":"Gallacher continued to argue with the referee throughout the game.","note[0]":"argue with","example[2]":"They were arguing about how to spend the money.","note[1]":"argue about","example[3]":"The children were arguing over which TV programme to watch.","note[2]":"argue over","explanation[0]":"Argue is a reciprocal verb This type of verb is used when saying that two or more people do something that involves both or all of them","example[4]":"He and the waiter started arguing","example[5]":"He and the waiter started arguing with each other ","example[6]":"He started arguing with the waiter","explanation[1]":"You argue with someone","example[7]":"I wish you two would stop arguing with each other!","explanation[2]":"You argue about something or over something","example[8]":"Let’s not argue about/over small details","definition[1]":"to state, giving clear reasons, that something is true, should be done etc","example[9]":"She argued the case for changing the law.","example[10]":"The researchers put forward a well-argued case for banning the drug.","example[11]":"They argued the point (=discussed it) for hours without reaching a conclusion.","example[12]":"Croft argued that a date should be set for the withdrawal of troops.","note[3]":"argue that","example[13]":"It could be argued that a dam might actually increase the risk of flooding.","example[14]":"Baker argued against cutting the military budget.","note[4]":"argue for/against (doing) something","definition[2]":"to show that something clearly exists or is true","example[15]":"The statement argues a change of attitude by the management.","definition[3]":"to speak angrily to someone because you disagree with them about something","example[16]":"Those two are always arguing.","example[17]":"We rarely argue with each other.","display[0]":"have an argument","definition[4]":"to argue with someone for a period of time about a particular thing","example[18]":"She had a long argument with the man who was selling the tickets.","display[1]":"have a row","definition[5]":"to have an argument with someone, especially with your boyfriend, girlfriend, or a member of your family","example[19]":"She was upset because she’d had a fight with her boyfriend.","example[20]":"The couple at the next table were having a row.","display[2]":"quarrel","definition[6]":"to argue with someone, especially for a long time and about many different things","example[21]":"The children quarrel all the time.","display[3]":"squabble","definition[7]":"to argue about unimportant things","example[22]":"The kids were squabbling over what to watch on TV.","display[4]":"fall out with somebody","definition[8]":"to have a big argument with someone that results in you stopping having a friendly relationship with them","example[23]":"I’ve fallen out with my best friend.","display[5]":"be at each other’s throats","definition[9]":"if two people are at each other’s throats, they are always arguing in a very angry way","example[24]":"His parents are constantly at each other’s throats."}