{"word[0]":"now","signpost[0]":"at the present time","definition[0]":"at this time","example[0]":"They now live in the city centre.","example[1]":"There’s nothing I can do about this right now (=exactly now).","example[2]":"Please try to be more careful from now on (=starting from now).","example[3]":"There are a lot of bargains in the shops just now.","note[0]":"just now","example[4]":"Sonia should have been home by now. Do you think she’s OK?","note[1]":"by now","example[5]":"Until now, doctors have been able to do very little to treat this disease.","note[2]":"up to now/until now","example[6]":"Just leave your shoes on the back porch for now.","note[3]":"for now","example[7]":"The bell has rung – stop writing now.","example[8]":"If we leave now, we’ll be there before dark.","signpost[1]":"realizing","definition[1]":"used when you know or understand something because of something you have just seen, just been told etc","example[9]":"Having met the rest of the family, she now saw where he got his temper from.","definition[2]":"used when getting someone’s attention before continuing what you are saying or changing the subject","example[10]":"Now, let’s move on to the question of payment.","definition[3]":"used at the beginning of a sentence when asking for information","example[11]":"Now, what did you say your name was?","definition[4]":"used when pausing when you are thinking what to say next","example[12]":"Now, let’s see, oh yes – they wanted to know what time you’ll be back on Friday.","definition[5]":"used to say that if the situation was different, something different would happen","example[13]":"Now if I’d been in charge there’s no way I’d have let them use the van.","definition[6]":"used to make someone calm, or comfort them when they are angry, upset etc","example[14]":"Come on now, don’t cry.","definition[7]":"used when telling or reminding someone to do something","example[15]":"Now hurry up! I haven’t got all day.","example[16]":"Don’t forget now, you have a dental appointment Thursday afternoon.","example[17]":"Where are you living now?","example[18]":"The population is much larger now than it used to be.","display[0]":"currently","definition[8]":"now – used when describing what a situation is like","example[19]":"The firm currently employs 113 people.","example[20]":"Currently, the starting salary is around £20,000.","display[1]":"at the moment","definition[9]":"now – used when talking about a short period of time, after which the situation is likely to change","example[21]":"I think she’s at lunch at the moment – can I ask her to call you back?","example[22]":"At the moment I’m working in a restaurant, but I’m hoping to go to college.","display[2]":"at present/at the present time","definition[10]":"now – used when you do not expect something that is true now to be permanent","example[23]":"Many areas are inaccessible at present due to heavy snow.","example[24]":"The official currency is the crown, presently about 30 to the dollar.","display[3]":"for the time being","definition[11]":"now – used when a situation is likely to change, especially because an arrangement is only temporary","example[25]":"You can stay here for the time being, until you find a flat.","definition[12]":"because of something or as a result of something","example[26]":"Now that we know each other a little better, we get along fine.","example[27]":"I’m going to relax now the school year is over.","example[28]":"Now that I think of it, I acted the same way when I was his age.","definition[13]":"a large US organization started in 1966, which works for legal, economic, and social equality between women and men. Its first president was Betty Friedan, who also helped to start it"}