{"word[0]":"brush","signpost[0]":"object for cleaning/painting","definition[0]":"an object that you use for cleaning, painting, making your hair tidy etc, made with a lot of hairs, bristles, or thin pieces of plastic, fastened to a handle","example[0]":"a scrubbing brush","signpost[1]":"trees","definition[1]":"small bushes and trees that cover an area of land","definition[2]":"branches that have broken off bushes and trees","definition[3]":"a movement in which you brush something to remove dirt, make something smooth, tidy etc","example[1]":"I’ll just give my hair a quick brush.","definition[4]":"a quick light touch, made by chance when two things or people pass each other","example[2]":"the brush of her silk dress as she walked past","definition[5]":"a time when you only just avoid an unpleasant situation or argument","example[3]":"A brush with death can make you appreciate life more.","example[4]":"His first brush with the law came when he was 16.","note[0]":"brush with","signpost[2]":"tail","definition[6]":"the tail of a fox","signpost[3]":"clean/make tidy","definition[7]":"to clean something or make something smooth and tidy using a brush","example[5]":"Don’t forget to brush your teeth.","signpost[4]":"remove","definition[8]":"to remove something with a brush or with your hand","example[6]":"Ella brushed the crumbs off her jacket.","note[1]":"brush something off/from etc something","example[7]":"He brushed the tears from his eyes.","signpost[5]":"touch lightly","definition[9]":"to touch someone or something lightly when passing them","example[8]":"Something brushed her shoulders.","example[9]":"I felt her hair brush against my arm.","note[2]":"brush against","example[10]":"Nell brushed past him in the doorway.","note[3]":"brush past","signpost[6]":"put something on something","definition[10]":"to put a liquid onto something using a brush","example[11]":"Brush the pastry with milk.","note[4]":"brush something with something","example[12]":"Brush a little oil over the top of the pizza.","note[5]":"brush something over/onto something"}