{"word[0]":"should","signpost[0]":"right thing","definition[0]":"used to say what is the right or sensible thing to do","example[0]":"He shouldn’t be so selfish.","example[1]":"Children shouldn’t be allowed to play in the street.","example[2]":"‘I don’t care what people think.’ ‘Well, you should.’","example[3]":"Why shouldn’t I smoke if I want to?","definition[1]":"used to say what would have been right or sensible, but was not done","example[4]":"They should have called the police.","definition[2]":"used to give or ask for advice","example[5]":"What should I do?","example[6]":"Should I trust him?","example[7]":"You should read his new book.","example[8]":"I should stay in bed if I were you.","signpost[1]":"expected thing","definition[3]":"used to say that you expect something to happen or be true","example[9]":"It should be a nice day tomorrow.","example[10]":"Try phoning Robert – he should be home by now.","example[11]":"Australia should win this match.","example[12]":"‘Artistic people can be very difficult sometimes.’ ‘Well, you should know – you married one.’","definition[4]":"used to say what was expected, but did not happen","example[13]":"It was an easy test and he should have passed, but he didn’t.","signpost[2]":"correct thing","definition[5]":"used to say what is the correct amount, the correct way of doing something etc","example[14]":"Every sentence should start with a capital letter.","example[15]":"What do you mean, there are only ten tickets? There should be twelve.","example[16]":"White wine, not red, should be served with fish.","signpost[3]":"orders","definition[6]":"used in official orders and instructions","example[17]":"Passengers should proceed to Gate 12.","signpost[4]":"after 'that'","definition[7]":"used in a clause beginning with ‘that’ after particular adjectives and verbs","example[18]":"It’s strange that you should say that.","example[19]":"It is essential that he should have a fair trial.","example[20]":"The residents demanded that there should be an official inquiry.","definition[8]":"used to talk about something that may possibly happen or be true","example[21]":"Naturally, he was nervous in case anything should go wrong.","example[22]":"What if I should fall sick and not be able to work?","example[23]":"Should you need any help  (=if you need any help), you can always phone me at the office.","note[0]":"should somebody/something do something","signpost[5]":"imagined situations","definition[9]":"used after ‘I’ or ‘we’ to say what you would do if something happened or was true","example[24]":"If anyone treated me like that, I should complain to the manager.","example[25]":"I should be surprised if many people voted for him.","signpost[6]":"requesting/offering","definition[10]":"used to politely ask for something, offer to do something, or say that you want to do something","example[26]":"I should be grateful if you could provide me with some information.","example[27]":"‘What can I get you?’ ‘I should like a long cool drink.’","example[28]":"We should be delighted to help in any way we can.","example[29]":"I should like to thank you all for coming here tonight.","signpost[7]":"past intentions/expectations","definition[11]":"used as the past tense of ‘shall’ after ‘I’ or ‘we’ to say what you intended or expected to do","example[30]":"We knew that we should be leaving the next day."}