{"word[0]":"each","definition[0]":"every one of two or more things or people, considered separately","example[0]":"She had a bottle in each hand.","example[1]":"Grill the fish for five minutes on each side.","example[2]":"Each member of the team is given a particular job to do.","example[3]":"We each have our own skills.","example[4]":"When the children arrive, you give them each a balloon.","example[5]":"There are four bedrooms, each with its own shower and WC.","example[6]":"The tickets cost £20 each  (=each ticket costs £20).","example[7]":"You get two cookies each  (=every one of you gets two cookies).","example[8]":"There are 250 blocks of stone, and each one weighs a ton.","example[9]":"a disease that affects about 10 million people each year","note[0]":"each day/week/month etc","example[10]":"I’m going to ask each of you to speak for three minutes.","note[1]":"each of","heading[0]":"GRAMMAR: Patterns with each","explanation[0]":"Each is used before a singular noun with a singular verb","example[11]":"Each item was thoroughly checked","explanation[1]":"Each  can also be used before ‘of’ and a plural noun The verb should still be singular","example[12]":"Each of these people has some useful talent or experience","explanation[2]":"You usually use ‘his’, ‘her’, ‘himself’, or ‘herself’ after each","example[13]":"Each boy is issued with his own locker","example[14]":"Each of them tried it for herself","explanation[3]":"However, you can use ‘they’, ‘them’, ‘their’ etc when you do not want to say whether people are male or female","example[15]":"Each individual has a right to express their views","explanation[4]":"Don’t use each in negative clauses Use none","example[16]":"None of the answers was correct","bad_example[0]":"Each of the answers was not correct","heading[1]":"USAGE: Each, every","explanation[5]":"It is often correct to use either each  or  every, but they have slightly different meanings","explanation[6]":"Use  each when you are thinking about the people or things in a group separately, one by one","example[17]":"Each student came forward to receive a medal","example[18]":"Each time you exercise, you get a little stronger","explanation[7]":"Use every when you are thinking about the whole group of people or things together, with no exceptions","example[19]":"Every student was given a prize","example[20]":"You have to enter your password every time you log on","explanation[8]":"Don’t use each after words such as ‘almost’, ‘nearly’, or ‘not’ Use every","example[21]":"Almost every window was broken","example[22]":"Not every child enjoyed the party"}