{"word[0]":"most","type[0]":"used before an adjective or adverb to form the superlative","definition[0]":"having the greatest amount of a particular quality","opposite[0]":"least","example[0]":"She’s one of the most experienced teachers in the district.","example[1]":"The most important thing is to stay calm.","example[2]":"A recent study showed that gardening is easily the most popular activity among the over 50s.","example[3]":"We shall find out which system works most effectively.","example[4]":"It is the kind of tea most often served in Chinese restaurants.","heading[0]":"GRAMMAR: Comparatives","explanation[0]":"Most is not used before the -est form of an adjective or adverb You say","example[5]":"This exercise is one of the hardest","bad_example[0]":"This exercise is one of the most hardest","definition[1]":"to a greater degree or more times than anything else","example[6]":"What annoyed him most was the way she wouldn’t even listen.","example[7]":"I guess the food I eat most is pasta.","example[8]":"Most of all, I just felt sad that it was over.","example[9]":"Thank you for a most interesting evening.","example[10]":"I was most surprised to hear of your engagement.","example[11]":"He plays poker most every evening.","heading[1]":"USAGE: The most, the more","explanation[1]":"You use the most  when you are comparing one person or thing with all others","example[12]":"It was the most terrifying experience of my life","explanation[2]":"In spoken English, you can also use the most  when comparing just two people or things  However, some people think that this is incorrect and use (the) more to compare two people or things","example[13]":"Which is the most enjoyable – tennis or squash?","example[14]":"Which is the more enjoyable – tennis or squash?","definition[2]":"nearly all of the people or things in a group, or nearly all of something","synonym[0]":"the majority","example[15]":"Like most people, I try to take a vacation every year.","example[16]":"Most research in this field has been carried out by the Russians.","example[17]":"Some were barefoot, most were in rags.","example[18]":"Most of the time it’s very quiet here.","note[0]":"most of the time/most days etc","example[19]":"Most evenings we just stay in and watch TV.","example[20]":"It was Sunday and most of the shops were shut.","note[1]":"most of","example[21]":"Most of what Hannah told me wasn’t true.","definition[3]":"a larger amount or number than anyone or anything else","example[22]":"The animal that caused most trouble was a little black puppy.","example[23]":"The team that scores the most points wins.","note[2]":"the most","example[24]":"Which class has the most children in it?","example[25]":"It’s unfair that you should have to pay the most when you earn so little.","definition[4]":"the largest number or amount possible","example[26]":"The aim is to help patients to obtain most benefit from their treatment.","example[27]":"The most you can hope to achieve is just to get him to listen to your ideas.","heading[2]":"GRAMMAR: Patterns with most","explanation[3]":"You use most before plural nouns to talk about people or things in general","example[28]":"Most people disagree","bad_example[1]":"The most people disagree","explanation[4]":"You say most of the","example[29]":"Most of the shops are closed","bad_example[2]":"most of shops","explanation[5]":"You say most of my/her/his etc or many of them/us/you","example[30]":"Most of my friends are at university","example[31]":"Most of them are women","definition[5]":"nearest to something","example[32]":"the northernmost town in Sweden  (=the town that is furthest to the north)","example[33]":"the topmost branches of the tree"}