{"word[0]":"equity","definition[0]":"a situation in which all people are treated equally and no one has an unfair advantage","opposite[0]":"inequity","example[0]":"a society run on the principles of equity and justice","definition[1]":"the amount of money that you would have left if you sold your house and paid off the money you borrowed to buy the house","definition[2]":"the principle that a fair judgment must be made in a situation where the existing laws do not provide an answer","definition[3]":"a trade union in the UK for actors and actresses in film, theatre, TV, and radio","definition[4]":"a trade union in the US for actors and actresses who perform in the theatre. Its full name is the Actor's Equity Association.","plural[0]":"equities","definition[5]":"the capital that a company has from shares rather than from loans","example[1]":"The CEO has been moving toward the use of equity rather than debt.","example[2]":"The strong stock market will encourage more companies to use equity to finance acquisitions.","example[3]":"SAS will need to raise additional equity to complete the SKr20 billion of aircraft purchases it plans.","example[4]":"They plan to raise $100m by releasing at least 5% of equity in the company.","definition[6]":"trading in companies’ shares on a stockmarket, rather than trading on other types of market","example[5]":"investors seeking to place funds in equities","example[6]":"Milan equities finished mostly higher.","definition[7]":"in MORTGAGE or HIRE PURCHASE lending, the amount that would be left for the borrower if the property or asset was sold and the remaining loan repaid","example[7]":"They have seen the equity in their home rise tenfold.","note[0]":"equity in","definition[8]":"the principle that a fair judgement must be made where the existing laws do not provide a clear answer in a particular case","example[8]":"The courts have been willing to look at the settlement of arguments on the basis of equity rather than strict legal principle."}