{"definition[0]":"a living creature such as a dog or cat, that is not an insect, plant, bird, fish, or person","example[0]":"furry little animals","example[1]":"The cosmetics have not been tested on animals.","example[2]":"Beth is an animal lover (=someone who likes animals).","example[3]":"cattle, sheep, and other domestic animals","note[0]":"wild/domestic/farm animals","definition[1]":"any living creature that is not a plant or a person","example[4]":"He can’t stand cruelty to animals of any sort.","example[5]":"the animal welfare movement in Britain","example[6]":"the enormous diversity of the animal kingdom","definition[2]":"any living creature, including people","example[7]":"Man is a highly intelligent animal.","definition[3]":"someone who behaves in a cruel, violent, or very rude way","example[8]":"Football hooligans are just animals.","definition[4]":"a living thing such as a dog, cow, or tiger, but not an insect, fish, or bird","example[9]":"farm animals such as cows, sheep, and pigs","example[10]":"People are becoming more concerned about animal welfare.","display[0]":"creature","definition[5]":"an animal – used especially when describing a particular animal’s characteristics or when referring to animals generally","example[11]":"The cheetah is a magnificent creature.","example[12]":"all the living creatures in the sea","display[1]":"beast","definition[6]":"an animal, especially a large or dangerous one","example[13]":"To most people, lions are savage beasts.","example[14]":"a wild beast","display[2]":"living thing","definition[7]":"an animal considered as one of a group of things that grow and then die, including humans and plants","example[15]":"The only living things we saw were dogs and cats.","display[3]":"species","definition[8]":"a group of animals whose members are similar and can breed together to produce young animals","example[16]":"Seven species of birds of prey have been observed.","display[4]":"mammal","definition[9]":"an animal that drinks milk from its mother’s body when it is young","example[17]":"Humans, dogs, and whales are all mammals.","display[5]":"vertebrate","definition[10]":"a living creature that has a backbone","example[18]":"viruses that affect chickens, monkeys, and most other vertebrates","display[6]":"invertebrate","definition[11]":"a living creature that does not have a backbone","example[19]":"earthworms and other small invertebrates"}