{"word[0]":"defence","signpost[0]":"protection","definition[0]":"the act of protecting something or someone from attack","example[0]":"a firm commitment to the defense of human rights","example[1]":"The first line of defence is a smoke detector.","example[2]":"In Britain, the defence of the country has historically been left to the navy.","note[0]":"defence of","definition[1]":"something that can be used to protect something or someone from attack","example[3]":"The area’s flood defences need repair.","example[4]":"The immune system is the body’s defence against infection.","note[1]":"defence against","definition[2]":"all the systems, people, materials etc that a country uses to protect itself from attack","example[5]":"calls for a national debate on defence","example[6]":"the Defense Department","definition[3]":"all the armies, weapons, structures etc that are available to defend a place","example[7]":"The invading army easily overcame the town’s defences.","signpost[1]":"against criticism","definition[4]":"something that you say or do in order to support someone or something that is being criticized","example[8]":"Evelyn Waugh came to Wilson’s defence and acknowledged the brilliance of the book’s themes.","note[2]":"come/leap to somebody’s defence","example[9]":"Jean wrote a letter to the paper in Angela’s defense.","note[3]":"in somebody’s/something’s defence","example[10]":"a philosophical defence of nationalism","signpost[2]":"in a law court","definition[5]":"the things that are said in a court of law to prove that someone is not guilty of a crime","example[11]":"Major has a good defence and believes he will win the case.","example[12]":"a defence lawyer","definition[6]":"all the lawyers who try to prove in a court of law that someone is not guilty of a crime","example[13]":"The defense called only one witness.","signpost[3]":"emotions","definition[7]":"something you do or a way of behaving that prevents you from seeming weak or being hurt by others","example[14]":"Liz dropped her defences and began to relax.","definition[8]":"the players on a sports team whose main job is to try to prevent the other team from getting points","form[0]":"defence + NOUN","collocation[0]":"a defence force","example[15]":"The country's defence forces are on standby in case of an attack.","collocation[1]":"a defence system","example[16]":"Is the national defence system adequate?","collocation[2]":"a defence policy","example[17]":"Ministers in Brussels have been discussing a possible European defence policy.","collocation[3]":"defence spending/expenditure","example[18]":"There were plans to cut defence spending by one billion pounds.","collocation[4]":"the defence budget","example[19]":"They have called for the defence budget to be increased.","collocation[5]":"the Defence Department","example[20]":"This is secret information, known only to the Defence Department.","collocation[6]":"the Defence Secretary","example[21]":"The Defence Secretary is under pressure to resign.","definition[9]":"the things that are said in a court of law to try to prove that someone is not guilty of a crime","example[22]":"I am unhappy about the way my barrister is conducting my defence.","definition[10]":"the lawyers in a court of law who try to prove that someone is not guilty of a crime","example[23]":"the chief witness for the defence","example[24]":"The defense argued that the case should be dropped.","definition[11]":"actions taken by a company to prevent a takeover that it does not want"}