{"definition[0]":"to turn your eyes towards something, so that you can see it","example[0]":"We sneaked out while Jessie’s mom wasn’t looking.","example[1]":"If you look carefully you can see that the painting represents a human figure.","example[2]":"Gina covered her eyes, afraid to look.","example[3]":"‘It’s time we left, ’ Ian said, looking at his watch.","note[0]":"look at","example[4]":"The men all turned to look at her as she entered the room.","example[5]":"Dad looked up from his paper and smiled.","note[1]":"look away/over/down etc","example[6]":"‘We can’t go out in this weather, ’ said Bob, looking out of the window.","heading[0]":"GRAMMAR: Prepositions with look","explanation[0]":"You look at someone or something","example[7]":"She was looking at the baby","example[8]":"I looked at the screen","bad_example[0]":"She was looking to the baby","bad_example[1]":"I looked to the screen","explanation[1]":"If you look to someone, you depend on them","example[9]":"He always looked to his father for advice","definition[1]":"to try to find something","example[10]":"I looked everywhere but Jimmy was nowhere to be found.","example[11]":"Could you help me look for my contact lens?","note[2]":"look for","example[12]":"If you’re looking for a bargain, try the local market.","example[13]":"Try looking under the bed.","note[3]":"look in/under/between etc","signpost[0]":"seem","definition[2]":"to seem","example[14]":"From the way things look at the moment, the Republicans are unlikely to win this election.","example[15]":"You made me look really stupid in front of all my friends!","example[16]":"The future’s looking good.","note[4]":"look good/bad etc","example[17]":"It looks as if it might rain later.","note[5]":"it looks as if/as though/like","example[18]":"It looks like they won’t be needing us anymore.","definition[3]":"to have a particular appearance","example[19]":"How do I look?","example[20]":"What did the man look like?","example[21]":"My sister doesn’t look anything like me.","example[22]":"You look tired. You should go to bed.","note[6]":"look tired/happy/sad etc","example[23]":"He looked as if he hadn’t washed for a week.","note[7]":"look as if/as though/like","explanation[2]":"Look is a linking verb in meanings 3 and 4 This type of verb links the subject of the sentence with an adjective or noun","example[24]":"It looks windy outside","example[25]":"You look beautiful","example[26]":"She made him look a fool","signpost[1]":"face a direction","definition[4]":"if a building looks in a particular direction, it faces that direction","example[27]":"The cabin looks east, so we get the morning sun.","definition[5]":"to turn your eyes towards someone or something, so that you can see them","example[28]":"You should never look directly at the sun.","example[29]":"After a while, he turned and looked at me.","display[0]":"have/take a look","definition[6]":"to look at something quickly, especially in order to find or check something","example[30]":"I’ll have a look in my desk.","example[31]":"Take a look at this!","display[1]":"glance","definition[7]":"to look at someone or something for a short time and then look quickly away","example[32]":"Damien glanced nervously at his watch.","display[2]":"peek/peep","definition[8]":"to look quickly at something – used especially when you are not supposed to look, or when you are looking through a small gap","example[33]":"The door was open so he peeked inside.","example[34]":"Katy peeped at her birthday present on the table.","display[3]":"peer","definition[9]":"to look very carefully, especially because you cannot see well","example[35]":"Kenji was peering at the screen.","display[4]":"glare","definition[10]":"to look at someone in an angry way","example[36]":"She glared at me as I got up to leave.","display[5]":"stare","definition[11]":"to look at someone or something for a long time without moving your eyes","example[37]":"It’s rude to stare.","example[38]":"She stared straight into the camera.","display[6]":"gaze","definition[12]":"to look at someone or something for a long time, often without realizing that you are doing it","example[39]":"She gazed out of the window.","example[40]":"He lay on his bed gazing at the ceiling.","display[7]":"gape","definition[13]":"to look at someone or something for a long time, usually with your mouth open, because you are very shocked or surprised","example[41]":"People gaped at him with wide-open mouths.","display[8]":"regard","definition[14]":"to look at someone or something, especially in a particular way","example[42]":"He regarded her steadily.","definition[15]":"used to tell someone to look at something that you think is interesting, surprising etc","example[43]":"Look! There’s a fox!","definition[16]":"used to get someone’s attention so that you can suggest something or tell them something","example[44]":"Look. Why don’t you think about it and give me your answer tomorrow?","example[45]":"Look, I’ve had enough of this. I’m going home.","definition[17]":"an act of looking at something","example[46]":"I took one look at the coat and decided it wasn’t worth £50.","example[47]":"Let me have a look at that – I think it’s mine.","note[8]":"have/take a look (at somebody/something)","example[48]":"Take a good look at the photo and see if you recognize anyone in it.","example[49]":"I have a special interest in old houses. Do you mind if I take a look around?","note[9]":"have/take a look around","definition[18]":"an expression that you make with your eyes or face","example[50]":"Why has Jake been giving me dirty looks (=unfriendly looks) all morning?","example[51]":"Mike gave him such a severe look he didn’t dare argue.","note[10]":"give somebody a look","definition[19]":"an act of examining something and thinking about it","example[52]":"I asked the vet to have a quick look at the puppies as well.","example[53]":"It’s time to take a fresh look at the old problem of low pay.","example[54]":"This month, take a long hard look (=examine very carefully) at where your money is going.","example[55]":"Have you had a chance to take a look at my proposal yet?","definition[20]":"an attempt to find something","example[56]":"I can’t find them anywhere. Have a look yourself.","example[57]":"She had a good look (=searched carefully) through the files.","definition[21]":"the appearance that someone or something has","example[58]":"The area has a very seedy look to it.","example[59]":"Mr Flynn had a tired, ill look in his eyes.","example[60]":"We should turn back now. It’s getting dark and I don’t like the look of those rain clouds.","note[11]":"not like the look of somebody/something","signpost[2]":"way something seems","definition[22]":"the way something seems to be","example[61]":"The neighbours are back from holiday by the looks of it (=that is how it seems).","example[62]":"I don’t like the look of this new policy  (=I do not like the way it seems).","signpost[3]":"fashion","definition[23]":"a particular style in clothes, hair, furniture etc","example[63]":"The hippy look is back again.","example[64]":"Let me have a look at the map.","example[65]":"I took a quick look around the room.","definition[24]":"a quick look at something before looking away again","example[66]":"Susan cast a quick glance at me  (=she looked quickly at me).","example[67]":"He could not resist a sidelong glance   (=quickly looking to the side) to see what was happening on the other side of the road.","display[9]":"glimpse","definition[25]":"a short look at someone or something in which you do not see them very clearly","example[68]":"Fans were hoping to catch a glimpse of the singer as he left the hotel.","example[69]":"I had only a fleeting glimpse   (=a very quick look) of the two men as they ran away.","definition[26]":"a long steady look","example[70]":"Eddie fixed his gaze on the floor.","example[71]":"She looked up and met his gaze (=looked at him when he was looking at her).","definition[27]":"a long direct look, especially in an unfriendly way or in a way that shows you are surprised","example[72]":"He was watching me with a cold stare.","example[73]":"My cheery ‘Good Morning’ was met with a blank stare (=a stare which shows no emotion).","definition[28]":"an angry look at someone","example[74]":"She gave him a hostile glare as he entered the room.","display[10]":"frown","definition[29]":"a confused or annoyed look","example[75]":"‘Anyway, ’ she said with a frown, ‘I don’t see how there could be a connection.’"}