{"word[0]":"facility","plural[0]":"facilities","definition[0]":"a special part of a piece of equipment or a system which makes it possible to do something","example[0]":"Is there a call-back facility on this phone?","example[1]":"a bank account with an overdraft facility","definition[1]":"a place or building used for a particular activity or industry, or for providing a particular type of service","example[2]":"a top-secret research facility","example[3]":"the finest indoor sports facility in the US","definition[2]":"a natural ability to do something easily and well","synonym[0]":"talent","example[4]":"She has an amazing facility for languages.","note[0]":"facility for","form[0]":"ADJECTIVES/NOUN + facilities","collocation[0]":"sports/sporting facilities","example[5]":"Have you checked out the local sports facilities?","collocation[1]":"leisure/recreational facilities","example[6]":"The leisure facilities include a sauna and a gym.","collocation[2]":"hotel facilities","example[7]":"Make use of the hotel facilities, which are excellent.","collocation[3]":"parking facilities","example[8]":"The building has parking facilities for twenty cars.","collocation[4]":"educational facilities","example[9]":"We aim to improve the provision of educational facilities such as libraries.","collocation[5]":"training facilities","example[10]":"The company plans to set up in-house training facilities.","collocation[6]":"computing facilities","example[11]":"The department provides excellent computing facilities for students.","collocation[7]":"childcare facilities","example[12]":"More women would work if there were better childcare facilities.","collocation[8]":"catering/restaurant/cooking facilities","example[13]":"The rooms all have cooking facilities and a fridge.","collocation[9]":"communal facilities","example[14]":"Communal facilities at the campsite were well-maintained.","collocation[10]":"shared facilities","example[15]":"The less expensive rooms have shared facilities.","collocation[11]":"provide facilities","example[16]":"Recycling facilities are provided by the local council.","collocation[12]":"offer facilities","example[17]":"A wide range of facilities is offered.","collocation[13]":"use the facilities","example[18]":"Guests are welcome to use all the hotel’s facilities.","collocation[14]":"make use of the facilities","example[19]":"We hope students make use of the new facilities.","collocation[15]":"facilities include something","example[20]":"The centre’s facilities include an outdoor swimming pool.","collocation[16]":"a range of facilities","example[21]":"The range of facilities offered by this hotel is superb.","definition[3]":"special buildings or equipment that have been provided for a particular use, such as sports activities, shopping or travelling","example[22]":"The hotel’s leisure facilities include a large indoor pool, sauna and sun terrace.","example[23]":"modern health-care facilities","definition[4]":"a place or large building that is used to make or provide a particular product or service","example[24]":"Torness Harbour has the best permanent docking facility on Scotland’s south-east coast.","definition[5]":"an arrangement made by a bank for its customers which lets them use the services the bank offers. These services would include, for example, borrowing or investing money","example[25]":"MIT has put in place a £20 millionloan facility for investment in European bonds.","example[26]":"The company has now secured new credit facilities to finance the purchase of the oilfield.","definition[6]":"a special feature of a piece of equipment that allows it to do certain useful things, in addition to the things the equipment normally does","example[27]":"IBM have urged businesses to increase their back-up facilities (=systems that can be used if the main one stops working)."}