{"word[0]":"hurt","signpost[0]":"injure somebody","definition[0]":"to injure yourself or someone else","example[0]":"Was anyone hurt in the accident?","example[1]":"Put that thing down – you might hurt someone with it.","example[2]":"He hurt his knee playing football.","note[0]":"hurt your arm/leg/nose etc","example[3]":"Be careful you don’t fall and hurt yourself.","note[1]":"hurt yourself","signpost[1]":"feel pain","definition[1]":"to feel pain in part of your body","example[4]":"My back hurts.","example[5]":"Where does it hurt?","example[6]":"It hurts when I try to move my leg.","example[7]":"My shoulder hurts like hell.","note[2]":"hurt like hell","signpost[2]":"cause pain","definition[2]":"to cause pain in a part of your body","example[8]":"The sun’s hurting my eyes.","signpost[3]":"insult somebody","definition[3]":"to make someone feel very upset, unhappy, sad etc","example[9]":"I didn’t mean to hurt your feelings.","example[10]":"What hurts is that he never even said goodbye.","note[3]":"it hurts (somebody) to do something","example[11]":"It hurt me to think that you hated me.","signpost[4]":"bad effect","definition[4]":"to have a bad effect on someone or something, especially by making them less successful or powerful","example[12]":"Foreign competition has hurt the company’s position in the market.","definition[5]":"to damage part of your body, or someone else’s body","example[13]":"She slipped on the ice and hurt herself badly.","example[14]":"Be careful you don’t hurt anyone with that knife.","display[0]":"injure","definition[6]":"to hurt yourself quite severely, or to be hurt in an accident or fighting","example[15]":"One of our players has injured his leg, and will be out of the game for weeks.","example[16]":"Four people have been seriously injured on the Arizona highway.","definition[7]":"to deliberately hurt someone using a weapon such as a knife or gun","example[17]":"The gunmen shot and killed twelve people and wounded three others.","display[1]":"maim","definition[8]":"to hurt someone very severely, especially so that they lose an arm, leg etc, often as the result of an explosion","example[18]":"In countries where there are landmines, people are killed and maimed daily.","definition[9]":"to hurt a part of your body by breaking a bone in it","example[19]":"The X-ray showed that I had broken my wrist.","display[2]":"bruise","definition[10]":"to hurt a part of your body when you fall on it or hit it, causing a dark mark to appear on your skin","example[20]":"Cathy fell off her bike and bruised her legs badly.","display[3]":"sprain/twist","definition[11]":"to hurt your knee, wrist, shoulder etc by suddenly twisting it while you are moving","example[21]":"I jumped down from the wall and landed awkwardly, spraining my ankle.","display[4]":"strain/pull","definition[12]":"to hurt one of your muscles by stretching it or using it too much","example[22]":"When you are lifting heavy loads, be careful not to strain a back muscle.","display[5]":"dislocate","definition[13]":"to damage a joint in your body in a way that moves the two parts of the joint out of their normal position","example[23]":"Our best batsman dislocated his shoulder during training.","display[6]":"paralyse","definition[14]":"to make someone lose the ability to move part or all of their body","example[24]":"A climbing accident had left him paralysed from the chest down.","heading[0]":"when part of your body feels painful","definition[15]":"if part of your body hurts, it feels painful","example[25]":"My chest hurts when I cough.","display[7]":"ache","definition[16]":"to hurt with a continuous pain","example[26]":"I’d been walking all day and my legs were really aching.","display[8]":"throb","definition[17]":"to feel a bad pain that comes and goes again in a regular and continuous way","example[27]":"Lou had a terrible headache and his whole head seemed to be throbbing.","display[9]":"sting","definition[18]":"to feel a sharp pain, or to make someone feel this, especially in your eyes, throat, or skin","example[28]":"My throat stings every time I swallow.","example[29]":"This injection may sting a little.","display[10]":"smart","definition[19]":"to hurt with a sudden sharp pain – used especially about your eyes, or your skin where something has hit you","example[30]":"Her eyes were smarting from the thick smoke.","example[31]":"Jackson’s face was still smarting from the punch.","display[11]":"burn","definition[20]":"to feel very hot and painful or uncomfortable","example[32]":"Be careful because this chemical will make your skin burn.","example[33]":"His eyes were burning because of the gas.","display[12]":"pinch","definition[21]":"if something you are wearing pinches you, it is too tight and presses painfully on your skin","example[34]":"The shirt was a bit too small and it was pinching my neck.","display[13]":"something is killing me","definition[22]":"used when something feels very painful","example[35]":"My legs are killing me.","example[36]":"These shoes are killing me.","display[14]":"a bad back/leg/arm etc","definition[23]":"if you have a bad back/leg/arm etc, it feels painful","example[37]":"He’s off work with a bad back.","type[0]":"not usually before noun","definition[24]":"suffering pain or injury","synonym[0]":"injured","example[38]":"Sometimes players get hurt in training.","example[39]":"Fortunately, no one was seriously hurt.","note[4]":"badly/seriously hurt","definition[25]":"very upset or unhappy because someone has said or done something unkind, dishonest, or unfair","example[40]":"Rachel felt hurt and betrayed.","example[41]":"He’s no good for you, Jenny. You’ll only get hurt again.","example[42]":"his hurt pride","example[43]":"She wore a hurt expression on her face.","example[44]":"Alice was deeply hurt that she hadn’t been invited.","note[5]":"very/deeply hurt","definition[26]":"a feeling of great unhappiness because someone, especially someone you trust, has treated you badly or unfairly","example[45]":"She saw the hurt in his eyes.","example[46]":"all the hurts and wrongs of the past"}