{"word[0]":"happiness","definition[0]":"the state of being happy","example[0]":"Juliet’s eyes shone with happiness.","example[1]":"We want our children to have the best possible chance of happiness.","collocation[0]":"great happiness","example[2]":"His grandchildren bring him great happiness.","collocation[1]":"true/real happiness","example[3]":"At last, she found true happiness with a man she loved.","collocation[2]":"perfect/pure/sheer happiness","example[4]":"The birth of my child was a moment of sheer happiness.","collocation[3]":"human happiness","example[5]":"One of the greatest sources of human happiness is love.","collocation[4]":"personal happiness","example[6]":"In Oxford, he at last found personal happiness and intellectual fulfilment.","collocation[5]":"lasting happiness","example[7]":"Leonie had found a lasting happiness in her relationship with Jim.","collocation[6]":"future happiness","example[8]":"Living together before you marry is no guarantee of future happiness.","collocation[7]":"domestic happiness","example[9]":"After six years with Joe, the normality of domestic happiness bored her.","collocation[8]":"marital happiness","example[10]":"Does being similar to your wife or husband lead to marital happiness?","collocation[9]":"find happiness","example[11]":"It’s a story about a music composer who unexpectedly finds happiness as a teacher.","collocation[10]":"bring (somebody) happiness","example[12]":"He wrongly believes that money can bring happiness.","collocation[11]":"achieve happiness","example[13]":"He would never achieve true happiness until he took control of his life.","collocation[12]":"be filled with happiness","example[14]":"As I drove back home, I was filled with happiness.","collocation[13]":"glow with happiness","example[15]":"The bride’s face seemed to glow with happiness.","collocation[14]":"wish somebody (every) happiness/wish (every) happiness to somebody","example[16]":"I would like you to join me in wishing every happiness to Annabelle and Steven.","collocation[15]":"a feeling of happiness","example[17]":"Being by the ocean gave her a feeling of great happiness.","collocation[16]":"the pursuit of happiness","example[18]":"The Declaration of Independence guarantees ‘liberty’ and ‘the pursuit of happiness.’","definition[1]":"the feeling of being happy","example[19]":"Happiness is more important than money.","example[20]":"I could see the happiness in her eyes.","display[0]":"pleasure","definition[2]":"the feeling you have when you enjoy doing something, or when something happens that you enjoy","example[21]":"Are you taking the trip for business or pleasure?","example[22]":"His music has given pleasure to a great many people over the years.","display[1]":"cheerfulness","definition[3]":"happy feelings, which show in your expression, your voice, and your behaviour","example[23]":"'Morning, everybody!' she said with a loud cheerfulness.","example[24]":"His normal cheerfulness seemed to have returned.","display[2]":"satisfaction","definition[4]":"the feeling you have when you have done something well, or when something is as good as it should be","example[25]":"She stood back and looked at her work with satisfaction.","example[26]":"He gets a lot of satisfaction from helping young people in his coaching job.","display[3]":"contentment","definition[5]":"a quietly happy and satisfied feeling","example[27]":"Joey sighed with contentment, snuggling down in his warm bed.","display[4]":"joy","definition[6]":"a feeling of great happiness","example[28]":"The sisters hugged and cried tears of joy.","example[29]":"It was a day of great joy for the whole town.","example[30]":"Most people would be jumping with joy.","display[5]":"delight","definition[7]":"the feeling you have when you are very pleased and excited because something good has happened","example[31]":"They watched with delight as their new son started walking.","example[32]":"To her delight, she discovered the perfect wedding present.","display[6]":"bliss","definition[8]":"a feeling of very great happiness and great pleasure – used when something has a great effect on your senses","example[33]":"Lying in the warm sun and listening to the sea felt like sheer bliss  (=complete bliss).","example[34]":"Her idea of bliss is to be curled up on the sofa watching a romantic comedy with a big bowl of popcorn.","example[35]":"The happy couple looked a picture of domestic bliss.","display[7]":"elation","definition[9]":"a feeling of great happiness and excitement, especially because you have achieved something or something good has happened to you","example[36]":"As they reached the top, the climbers experienced a moment of elation.","example[37]":"Her mood suddenly changed from tears and misery to a feeling of elation.","display[8]":"euphoria","definition[10]":"an extremely strong feeling of happiness and excitement, especially because you have achieved something, or because of the effects of a drug","example[38]":"The euphoria that new parents feel quickly changes to exhaustion.","example[39]":"The euphoria of Ireland’s amazing victory over England last Sunday has died away.","example[40]":"The drug produces a feeling of euphoria.","display[9]":"ecstasy","definition[11]":"an extremely strong feeling of happiness and pleasure, especially sexual pleasure","example[41]":"It was a moment of sheer ecstasy  (=complete ecstasy).","example[42]":"the ecstasy of their love-making"}