{"word[0]":"stand","past_tense[0]":"stood","signpost[0]":"be on feet","definition[0]":"to support yourself on your feet or be in an upright position","example[0]":"It looks like we’ll have to stand – there are no seats left.","example[1]":"She stood in the doorway.","example[2]":"Stand still (=do not move) and listen to me.","example[3]":"Don’t just stand there (=stand and not do anything) – help me!","example[4]":"If he stood on tiptoe, he could reach the shelf.","note[0]":"stand on tiptoe/stand on your toes","example[5]":"They just stood there laughing.","note[1]":"stand (somewhere) doing something","example[6]":"We stood watching the rain fall.","definition[1]":"to rise to an upright position","example[7]":"Smiling, she stood and closed the blinds.","definition[2]":"to step a short distance","example[8]":"Stand clear of the doors, please.","note[2]":"stand clear of something","example[9]":"She stood back to let him in.","note[3]":"stand back/aside","definition[3]":"to accidentally step on or in something","example[10]":"Don’t stand in that puddle!","note[4]":"stand on/in","type[0]":"intransitive, transitive usually + adverb/preposition","signpost[1]":"in a particular position","definition[4]":"to be upright in a particular position, or to put something or someone somewhere in an upright position","example[11]":"A lamp stood on the table.","example[12]":"Near the railway station stood a hotel.","example[13]":"Some remains of the original house still stand.","example[14]":"Can you stand that pole in the corner for now?","note[5]":"stand something on/in etc something","example[15]":"I closed the lid and stood the case against the wall.","example[16]":"Stand Molly up on a chair so she can see.","note[6]":"stand somebody (up) on something","signpost[2]":"in a state/condition","definition[5]":"to be or stay in a particular state or condition","note[7]":"stand in awe of somebody (=admire them, be afraid of them, or both)","example[17]":"The kitchen door stood open so she went in.","example[18]":"I will know within the next month or two how I stand  (=what my situation is).","example[19]":"countries that have stood together (=stayed united) in times of crisis","example[20]":"scores of derelict houses standing empty","note[8]":"stand empty/idle","example[21]":"I’m not too thrilled with the way things stand (=the state that the situation is in) at the moment.","example[22]":"The evidence, as it stands (=as it is now), cannot be conclusive.","example[23]":"Where do things stand in terms of the budget?","note[9]":"where/how do things stand?","example[24]":"He urged the whole community to stand united and to reject terrorism.","note[10]":"stand united/divided","example[25]":"We should stand ready to do what is necessary to guarantee the peace.","note[11]":"stand prepared/ready to do something","type[1]":"transitive usually in questions and negatives","signpost[3]":"accept a situation","definition[6]":"to be able to accept or deal well with a difficult situation","synonym[0]":"tolerate","example[26]":"She’s a strong woman who stands no nonsense from anyone.","example[27]":"I couldn’t stand the thought of leaving Danielle.","note[12]":"can/could stand something","example[28]":"I’ve had about as much as I can stand of your arguing!","example[29]":"I don’t know if I can stand the waiting any longer.","example[30]":"How can you stand Marty coming home late all the time?","note[13]":"can stand somebody doing something","signpost[4]":"be good enough","definition[7]":"to be good or strong enough to last a long time or to experience a particular situation without being harmed, damaged etc","example[31]":"Linen can stand very high temperatures.","example[32]":"His poetry will stand the test of time (=stay popular).","signpost[5]":"not move","definition[8]":"to stay in a particular place without moving","example[33]":"The car’s been standing in the garage for weeks.","example[34]":"The mixture was left to stand at room temperature for 15 minutes.","example[35]":"The train was already standing at the platform.","signpost[6]":"height","definition[9]":"to be a particular height","example[36]":"The trophy stands five feet high.","example[37]":"John stood six feet tall.","signpost[7]":"level/amount","definition[10]":"to be at a particular level or amount","example[38]":"Illiteracy rates are still thought to stand above 50 percent.","example[39]":"His former workforce of 1,300 now stands at 220.","note[14]":"stand at","signpost[8]":"rank/position","definition[11]":"to have a particular rank or position when compared with similar things or people","synonym[1]":"rank","example[40]":"The president stands high in the public opinion polls.","example[41]":"How do their sales stand in relation to those of similar firms?","example[42]":"His book could stand alongside the best.","signpost[9]":"election","definition[12]":"to try to become elected to a council, parliament etc","example[43]":"She announced her intention to stand for parliament.","note[15]":"stand for","type[2]":"intransitive not in progressive","signpost[10]":"decision/offer","definition[13]":"if a decision, offer etc stands, it continues to exist, be correct, or be valid","example[44]":"Despite protests, the official decision stood.","example[45]":"My offer of help still stands.","definition[14]":"a liquid that stands does not flow or is not made to move","example[46]":"standing pools of marsh water","definition[15]":"to be on your feet in an upright position","example[47]":"There were no seats, so we had to stand.","example[48]":"When we entered, Stephen was standing by his desk.","display[0]":"be on your feet","definition[16]":"to be standing, especially for a long time","example[49]":"If you have young kids, you’re on your feet all day.","example[50]":"I’d been on my feet since 7 o'clock and I needed to sit down.","example[51]":"The crowd were all on their feet clapping and calling for more.","display[1]":"get up","definition[17]":"to stand after you have been sitting or lying down","example[52]":"He got up and turned off the TV.","example[53]":"Mum fell in her flat and was unable to get up.","display[2]":"stand up","definition[18]":"to stand after you have been sitting, or to be in a standing position","example[54]":"I stood up when she came in and shook her hand.","example[55]":"It’s generally better to do this exercise standing up.","display[3]":"get to your feet","definition[19]":"to stand up, especially slowly or when it is difficult for you","example[56]":"My attorney got slowly to his feet, breathing heavily.","definition[20]":"to stand after you have been sitting, especially at a formal event","example[57]":"As the bride entered the cathedral, the congregation rose.","example[58]":"Audience members rose to their feet, cheering and clapping.","signpost[11]":"for support","definition[21]":"a piece of furniture or equipment used to hold or support something","note[16]":"coat stand/hat stand (=for hanging coats or hats on)","example[59]":"a music stand","example[60]":"a cake stand","example[61]":"He adjusted the microphone stand.","signpost[12]":"for selling","definition[22]":"a table or small structure used for selling or showing things","example[62]":"a hotdog stand","example[63]":"an exhibition stand","example[64]":"The shop was crowded with display stands and boxes.","example[65]":"One week, three magazines hit the stands (=became available to buy) with Peace Corps stories.","signpost[13]":"opinion/attitude","definition[23]":"a position or opinion that you state firmly and publicly","example[66]":"She was accused of not taking a stand on feminism or civil rights.","example[67]":"the Republicans’ conservative stand on social and environmental issues","note[17]":"stand on","signpost[14]":"oppose/defend","definition[24]":"a strong effort to defend yourself or to oppose something","example[68]":"We have to take a stand against racism.","note[18]":"take/make/mount a stand (against something)","signpost[15]":"cricket","definition[25]":"the period of time in which two batsmen are playing together in a game of cricket, or the points that they get during this time","signpost[16]":"taxis/buses","definition[26]":"a place where taxis or buses stop and wait for passengers","example[69]":"There’s a taxi stand on Glen Road.","signpost[17]":"trees","definition[27]":"a group of trees of one type growing close together","example[70]":"a stand of eucalyptus trees","note[19]":"stand of","example[71]":"Inflation currently stands at 4%.","example[72]":"Your bank balance currently stands at £720.92.","definition[28]":"to be in, stay in, or get into a particular state","example[73]":"The law, as it stood, favoured the developers.","example[74]":"I don’t see a serious challenge to London as a financial centre as things stand currently.","example[75]":"The committee stands divided (=disagrees completely) on this issue.","example[76]":"There are currently 65 industrial premises standing empty.","definition[29]":"to continue to exist, be correct, or be VALID","example[77]":"The court of appeal has ruled that the conviction should stand.","definition[30]":"to refuse to change a decision, plan etc","example[78]":"Harry’s standing pat on his decision to fire Janice.","note[20]":"stand pat on","definition[31]":"someone’s opinion about something, or the official rule about something","example[79]":"The voters want to know where the President stands on taxes.","note[21]":"where somebody stands on","definition[32]":"to be brought to a court of law to have your case examined and judged","example[80]":"The two men stood trial for allegedly attempting to receive stolen property.","note[22]":"stand trial for","definition[33]":"to pay money as a promise that someone will return to court to be judged","definition[34]":"to be the person in a court of law who is being judged for a crime","example[81]":"He now stands accused by the city council of serious mismanagement of the museum’s financial affairs.","note[23]":"stand accused of","definition[35]":"to be likely to do or have something","example[82]":"We stand to make a lot of money from the merger.","definition[36]":"to try to become elected to a parliament, board of directors etc","example[83]":"He will not be standing for election as vice president this year.","example[84]":"Who’s standing for the Democrats in the 44th district?","definition[37]":"to depend on something for success","example[85]":"A product will stand or fall by its quality.","definition[38]":"a small structure for selling or showing things","example[86]":"Come by our stand at the exhibition and see the new products.","example[87]":"He did not take a stand on the proposed regulations."}