{"word[0]":"boyfriend","definition[0]":"a man that you are having a romantic relationship with","definition[1]":"a boy or man that you have a romantic relationship with, especially for a fairly long time","example[0]":"Josh was my first boyfriend.","display[0]":"partner","definition[2]":"the person you are married to, or the person you are living with and having a sexual relationship with","example[1]":"Sweden allows gay partners to receive many of the same benefits that married couples get.","example[2]":"Partners are also welcome.","display[1]":"fiancé","definition[3]":"the man whom a woman is going to marry","example[3]":"Her fiancé was killed in the war.","display[2]":"lover","definition[4]":"someone who you have a sexual relationship with, without being married to them","example[4]":"A few nights later, they became lovers.","display[3]":"ex","definition[5]":"a woman’s former husband or boyfriend","example[5]":"Her ex has caused a lot of trouble for her.","display[4]":"old flame","definition[6]":"someone who was your boyfriend in the past","example[6]":"In a box in the closet, I found love letters from one of her old flames.","display[5]":"man","definition[7]":"a woman’s husband or boyfriend","example[7]":"She’ll always stand by her man.","display[6]":"sweetheart","definition[8]":"the person that you love","example[8]":"They were childhood sweethearts.","display[7]":"beau","definition[9]":"a woman’s boyfriend or lover – a very old-fashioned use","example[9]":"Does she have a beau?","display[8]":"toy boy","definition[10]":"a young man who is having a sexual relationship with an older woman","example[10]":"A woman with a toy boy gets a lot more disapproving looks than a man with a younger woman.","display[9]":"sugar daddy","definition[11]":"an older man who gives a younger woman presents and money in return for their company and often for sex","example[11]":"I can imagine her cashing checks from some mysterious sugar daddy.","display[10]":"be going out with somebody","definition[12]":"if you are going out with a boy or man, you have him as your boyfriend","example[12]":"She’s been going out with Jack for a couple of months."}