{"word[0]":"chip","definition[0]":"a long thin piece of potato cooked in oil","example[0]":"fish and chips","example[1]":"a bag of chips","definition[1]":"a thin flat round piece of food such as potato cooked in very hot oil and eaten cold","example[2]":"a bag of potato chips","definition[2]":"a small piece of silicon that has a set of complicated electrical connections on it and is used to store and process information in computers","example[3]":"the age of the silicon chip","example[4]":"chip technology","definition[3]":"a small piece of wood, stone, metal etc that has been broken off something","example[5]":"Wood chips covered the floor of the workshop.","example[6]":"a chocolate chip cookie  (=one that contains small pieces of chocolate)","definition[4]":"a small hole or mark on a plate, cup etc where a piece has broken off","example[7]":"There’s a chip in this bowl.","note[0]":"chip in","definition[5]":"a small flat coloured piece of plastic used in games such as poker or blackjack to represent a particular amount of money","definition[6]":"a hit in golf, or a kick in football or rugby, that makes the ball go high into the air for a short distance","signpost[0]":"accidentally break (something)","definition[7]":"if you chip something, or if it chips, a small piece of it breaks off accidentally","example[8]":"Gary fell and chipped one of his front teeth.","example[9]":"He chipped a bone in his knee and was carried off the pitch.","example[10]":"These plates chip really easily.","example[11]":"The paint had chipped off the gate.","note[1]":"chip off","signpost[1]":"remove something","definition[8]":"to remove something, especially something hard that is covering a surface, by hitting it with a tool so that small pieces break off","example[12]":"Archaeologists were carefully chipping away at the rock.","example[13]":"Chip out the plaster with a steel chisel.","definition[9]":"to hit a golf ball or kick a football or a rugby ball so that it goes high into the air for a short distance","example[14]":"United scored just before half-time when Adcock cleverly chipped the ball over the keeper.","signpost[2]":"potatoes","definition[10]":"to cut potatoes into thin pieces ready to be cooked in hot oil","signpost[3]":"microchip","definition[11]":"to put a microchip in an animal, person, or thing to identify or give information about them","definition[12]":"a small electronic device, used in a computer to store information, organize the computer’s operating system, run programs etc","synonym[0]":"MICROCHIP","example[15]":"Each chip can hold 100 times the information contained on a standard magnetic-stripe card.","definition[13]":"a share in a company","example[16]":"Brokers will start bidding for chips in the company as soon as the London market opens."}