{"word[0]":"feed","past_tense[0]":"fed","signpost[0]":"give food","definition[0]":"to give food to a person or animal","example[0]":"Have you fed the cat?","example[1]":"She was too weak to feed herself.","note[0]":"feed yourself","example[2]":"Several children were feeding bread to the ducks.","note[1]":"feed something to somebody","example[3]":"They were fed well on her mother’s home cooking.","note[2]":"feed somebody on/with something","definition[1]":"to provide enough food for a group of people","example[4]":"groceries to feed a family of five","example[5]":"The prison is required to feed and clothe the prisoners.","definition[2]":"to give a special substance to a plant, which helps it grow","example[6]":"Feed the tomatoes once a week.","example[7]":"Feed houseplants with a liquid fertilizer.","note[3]":"feed something with something","signpost[1]":"animal/baby","definition[3]":"if a baby or an animal feeds, they eat","example[8]":"Frogs generally feed at night.","example[9]":"Let your baby feed as long as she wants.","definition[4]":"to put information into a computer over a period of time","example[10]":"Figures are fed into the computer, which then predicts the likely profit.","note[4]":"feed something into something","signpost[2]":"supply something","definition[5]":"to supply something, especially a liquid, gas, or electricity","example[11]":"The public baths are fed by natural springs.","example[12]":"The sound is fed directly to the headphones.","note[5]":"feed something to something","example[13]":"Laura crouched by the fire, feeding it with dry sticks.","signpost[3]":"put something into something","definition[6]":"to put something into something else, especially gradually and through a small hole","example[14]":"Shelton fed the electricity meter.","example[15]":"A tube was fed down the patient’s throat into her stomach.","note[6]":"feed something into/through something","example[16]":"She fed her last two coins into the machine for a cup of coffee.","signpost[4]":"increase emotion","definition[7]":"to increase the strength of an emotion, desire etc","example[17]":"Her depression grew, fed by her bitter experiences.","definition[8]":"to give someone information or ideas over a period time","example[18]":"She feeds the media with stories, which is a way of getting free advertising.","note[7]":"feed somebody with something","example[19]":"US intelligence had been feeding false information to a KGB agent.","definition[9]":"to throw or hit a ball to someone else on your team, especially so that they can make a point","example[20]":"He fed the ball to Jol, who scored.","signpost[5]":"tv/radio","definition[10]":"to send a television or radio programme somewhere so that it can be broadcast","definition[11]":"one of the times when you give milk to a small baby","example[21]":"the two a.m. feed","signpost[6]":"animal food","definition[12]":"food for animals","example[22]":"fish feed","signpost[7]":"supply","definition[13]":"a tube or piece of equipment which supplies a machine with something, especially fuel","signpost[8]":"tv/radio/computer","definition[14]":"when a television or radio signal, computer information etc is sent somewhere, or the connection that is used to do this","example[23]":"a live satellite feed from the space station","signpost[9]":"meal","definition[15]":"a big meal","definition[16]":"to pass to a later stage in a process or system","example[24]":"The data is fed into computers for analysis.","note[8]":"feed into something","example[25]":"Tax increases and spending curbs by state and local governments feed into the private sector.","example[26]":"Reductions in corporation tax, which are still feeding through the economy, will be worth £1 billion to industry in the next year.","note[9]":"feed through something","example[27]":"Growth across the portfolio was 7%, which feeds through into higher dividend income.","note[10]":"feed through into something","definition[17]":"a way of supplying something that is needed for a particular process or activity","example[28]":"Traders on each of the four markets will be able to view listings on the others via a common data feed.","definition[18]":"a television or radio signal, computer information etc is sent somewhere, or the connection that is used to do this","example[29]":"a live satellite feed from the White House","definition[19]":"food for farm animals","example[30]":"cattle feed"}