{"word[0]":"spread","signpost[0]":"affect more people/places","definition[0]":"if something spreads or is spread, it becomes larger or moves so that it affects more people or a larger area","example[0]":"Fire quickly spread through the building.","note[0]":"spread through","example[1]":"He watched the dark stain spread over the gray carpet.","note[1]":"spread over","example[2]":"The disease spread rapidly amongst the poor.","note[2]":"spread among","example[3]":"The cancer had spread to her liver.","note[3]":"spread (from something) to something","example[4]":"Revolution quickly spread from France to Italy.","signpost[1]":"information/ideas","definition[1]":"to become known about or used by more and more people","example[5]":"News of the explosion spread swiftly.","example[6]":"The news spread like wildfire  (=very quickly).","example[7]":"Word spread quickly that she was leaving.","example[8]":"Buddhism spread to China from India.","note[4]":"spread to/through/over etc","definition[2]":"to tell a lot of people about something","example[9]":"Andy loves spreading rumours about his colleagues.","example[10]":"They are spreading the word about the benefits of immunization.","signpost[2]":"open/arrange","definition[3]":"to open something out or arrange a group of things so that they cover a flat surface","example[11]":"a table spread with a white cloth","example[12]":"Papers and photos were spread across the floor.","note[5]":"spread something over/across/on something","example[13]":"He spread the map out on the desk.","signpost[3]":"throughout an area","definition[4]":"to cover or exist across a large area","example[14]":"the forest that spread over the whole of that region","example[15]":"The company has more than 2,500 shops spread throughout the UK.","note[6]":"spread throughout","signpost[4]":"soft substance","definition[5]":"to put a soft substance over a surface, or to be soft enough to be put over a surface","example[16]":"If you warm up the butter, it’ll spread more easily.","example[17]":"Spread the nut mixture evenly over the bottom.","example[18]":"He spread plaster on the walls.","note[7]":"spread something on/over something","example[19]":"Spread the toast thinly with jam.","note[8]":"spread something with something","signpost[5]":"arms/fingers etc","definition[6]":"if you spread your arms, fingers, or legs, you move them far apart","example[20]":"He shrugged and spread his hands.","signpost[6]":"over time","definition[7]":"to do something over a period of time, rather than at one time","example[21]":"There will be 12 concerts spread throughout the summer.","example[22]":"Could I spread the repayments over a longer period?","note[9]":"spread something over something","signpost[7]":"share","definition[8]":"to share or divide something among several people or things","example[23]":"They want the country’s wealth to be more evenly spread.","example[24]":"The bills are sent out on different dates to spread the workload on council staff.","note[10]":"spread the load/burden","signpost[8]":"smile/look","definition[9]":"if an expression spreads over someone’s face, it slowly appears on their face","example[25]":"A slow smile spread over her face.","note[11]":"spread over/across","definition[10]":"if money, effort etc is spread thin, it is being used for many things so there is not enough for each thing","example[26]":"They complained that resources were spread too thinly.","definition[11]":"to try to do too many things at the same time so that you do not do any of them effectively","collocation[0]":"a disease spreads/is spread","example[27]":"The disease is spread by mosquitoes.","collocation[1]":"a cancer/infection spreads","example[28]":"The cancer had spread to his brain.","collocation[2]":"news/word spreads","example[29]":"As news of his death spread, his army disintegrated.","collocation[3]":"spread the news/the word","example[30]":"He has been spreading the word about ways to beat heart disease.","collocation[4]":"spread a story","example[31]":"When Brown’s hotel burned down, Clark spread the rumor that Forsyth was to blame.","collocation[5]":"a story spreads","example[32]":"It was the sort of story that would spread like wildfire.","collocation[6]":"spread lies/gossip","example[33]":"How dare you spread such vicious lies!","example[34]":"Has someone been spreading malicious gossip?","collocation[7]":"spread terror/panic","example[35]":"The murders were clearly intended to spread terror.","collocation[8]":"fire spreads","example[36]":"The fire had spread to a nearby shed.","collocation[9]":"violence/fighting spreads","example[37]":"There is no indication that the violence is likely to spread.","collocation[10]":"somebody’s fame/reputation spreads","example[38]":"Their musical fame has spread far beyond their native country.","collocation[11]":"spread rapidly/quickly","example[39]":"The fire spread rapidly, consuming many of the houses.","collocation[12]":"spread like wildfire","example[40]":"The news spread like wildfire through the town.","definition[12]":"when something affects or is known about by more people or involves a larger area","example[41]":"an attempt to stop the spread of nuclear weapons","note[12]":"spread of","example[42]":"the rapid spread of cholera in Latin America","signpost[9]":"soft food","definition[13]":"a soft substance made from vegetable oil that is used like butter","example[43]":"one slice of toast with a low-fat spread","definition[14]":"a soft food which you spread on bread","note[13]":"cheese/chocolate etc spread","signpost[10]":"range","definition[15]":"a range of people or things","example[44]":"We have a good spread of ages in the department.","note[14]":"wide/broad/good spread of something","example[45]":"a broad spread of investments","definition[16]":"the total area in which something exists","example[46]":"the geographical spread of the company’s hotels","signpost[11]":"large meal","definition[17]":"a large meal for several guests on a special occasion","example[47]":"Tom’s mum laid on a huge spread.","signpost[12]":"hand/wings","definition[18]":"the area covered when the fingers of a hand, or a bird’s wings, are fully stretched","signpost[13]":"bed cover","definition[19]":"a bedspread","definition[20]":"the difference between the prices at which something is bought and sold, or the interest rates for lending and borrowing money","example[48]":"the spread between the city banks’ loan rates and deposit rates","note[15]":"spread between","definition[21]":"the number of points between the scores of two opposing teams","example[49]":"a four-point spread","signpost[14]":"farm","definition[22]":"a large farm or ranch","definition[23]":"to share work, responsibility, or money among several people","example[50]":"Companies may want to spread their equity widely among stable, long-term shareholders.","definition[24]":"to pay for something gradually over a period of time","example[51]":"I asked if I could spread out the repayments.","example[52]":"Spread your premium payments over 12 monthly instalments.","example[53]":"The cost is spread out over ten years.","definition[25]":"to become widely used or known about","example[54]":"Deregulation is spreading across the whole of Europe.","definition[26]":"to reduce the chance of a large loss by sharing the risk of insuring someone or something with other insurance companies","definition[27]":"a range of people or things, especially investments","example[55]":"The bank is keen to broaden its spread of risks.","example[56]":"The assets represent a wide spread of fixed interest stocks, equity shares and property.","definition[28]":"the difference between the interest rate a bank pays on DEPOSITs (=money put in the bank) and the interest rate it charges on loans","example[57]":"Banks must maintain an adequate spread between borrowing and lending rates.","definition[29]":"the difference between two rates of interest. Interest on company bonds is often set in relation to the interest on particular government bonds","example[58]":"The noncallable notes were priced at a spread of 87.5 basis points  (=0.875%) over the yield on the Treasury’s 10-year note.","definition[30]":"the difference between the buying price and the selling price of shares, UNIT TRUSTs etc","example[59]":"The spread between the bid and ask prices for the options is ¼ to ½ point $25 to $50 an option.","definition[31]":"the difference between the buying price and the selling price of a currency, or between two rates for a currency","example[60]":"The policy of frequent devaluations of the Nicaraguan currency is designed to eliminate the spread between official and black-market exchange rates.","definition[32]":"the difference between the price a financial institution pays to buy shares from the company that ISSUEs them (=makes them available) and the higher price the firm charges to investors who buy them","example[61]":"The underwriting spread can range from 3.5% to 7% of the offering price.","definition[33]":"in a MONETARY SYSTEM (=an arrangement where the values of currencies move in relation to each other within certain limits), the difference between the highest valued currency and the lowest","example[62]":"The dollar remained the grid’s strongest currency, with the spread between it and the weakest currency widening to 11%."}