{"word[0]":"print","signpost[0]":"words","definition[0]":"to produce words, numbers, or pictures on paper, using a machine which puts ink onto the surface","example[0]":"I need to make a few changes before I print the document.","example[1]":"The company’s name was printed in bold letters across the top of the page.","example[2]":"a printed letter","example[3]":"The printer’s switched on but it won’t print.","example[4]":"As a newspaper publisher he understood the power of the printed word (=words that are printed on paper).","definition[1]":"when a computer document prints, a printed copy of it is produced","example[5]":"Press return, then the document should print.","signpost[1]":"books/newspapers","definition[2]":"to produce many printed copies of a book, newspaper etc","example[6]":"Over five million copies of the paper are printed every day.","example[7]":"When the book was first written no publisher would print it.","signpost[2]":"in a newspaper","definition[3]":"to print a report of something or a letter, speech etc in a newspaper or magazine","synonym[0]":"publish","example[8]":"‘The Express’ was the first paper to print the story.","example[9]":"‘The Telegraph’ has printed numerous articles on this subject over the last three years.","example[10]":"I wrote to the newspaper but my letter wasn’t printed.","definition[4]":"to produce a photograph from a photographic film","example[11]":"It usually takes a couple of hours for the pictures to be developed and printed.","definition[5]":"to decorate cloth with a pattern that is put all over its surface by a machine","example[12]":"a skirt printed with brightly coloured flowers","example[13]":"a printed silk shirt","signpost[3]":"write","definition[6]":"to write words by hand without joining the letters","example[14]":"Please print your name clearly in the top right-hand corner of the page.","signpost[4]":"make a mark","definition[7]":"to make a mark on a surface or in a soft substance by pressing something on to it","example[15]":"The mark of the man’s shoe was printed in the mud.","note[0]":"print something on/in something","definition[8]":"writing that has been printed, for example in books or newspapers","example[16]":"There was no print at all on the backs of the tickets.","example[17]":"Very little of his poetry actually got into print  (=was printed).","example[18]":"It must be really exciting to see your work in print.","note[1]":"in print","example[19]":"the pleasure of seeing my name in print","signpost[5]":"letters","definition[9]":"the letters in which something is printed","example[20]":"The book is also available in large print.","example[21]":"The print quality of the new printer is excellent.","definition[10]":"a mark that is made on a surface by something that has been pressed onto it","example[22]":"His feet left deep prints in the soft soil.","definition[11]":"cloth, especially cotton, on which a coloured pattern has been printed","example[23]":"a lovely selection of floral prints","example[24]":"She was wearing a cotton print dress.","definition[12]":"a photograph that has been produced from a film","example[25]":"Why don’t you order an extra set of prints?","example[26]":"a colour print","definition[13]":"a picture that is made by cutting lines onto a piece of metal or wood and then printing it onto paper","definition[14]":"a copy of a painting that is produced by taking a photograph of it and printing it onto paper","definition[15]":"to produce words, numbers, pictures etc on paper, using a machine that puts ink onto the surface","example[27]":"The system prints each transaction on the customer’s passbook.","example[28]":"Kodak’s new desktop machine prints16 pages a minute.","example[29]":"The electronic sorters can only read bar codes printed on the lower right-hand corner of letters.","note[2]":"print something on something","definition[16]":"to produce many copies of a document, newspaper, book etc in printed form","example[30]":"His company lost a contract to print 20,000 temporary auto license tags for Tennessee.","example[31]":"Estonia hired a foreign firm to print banknotes to replace the ruble.","definition[17]":"to put a letter, speech, article etc in a book, newspaper etc","synonym[1]":"PUBLISH","example[32]":"‘Newsday’ printed the story on Dec. 8.","example[33]":"An apology was printed in yesterday’s edition.","definition[18]":"if a computer prints words on a screen, they appear on the screen","example[34]":"After a delay of four seconds, the translated sentence is printed on a computer screen.","definition[19]":"to write words or letters by hand without joining the letters together, so that they look like the letters in a book","example[35]":"Print your name at the top and sign the declaration at the bottom of page 2.","definition[20]":"information and news in books, newspapers etc, rather than in other MEDIA","example[36]":"European services concentrate on print, while in the U.S. the emphasis is on television.","example[37]":"We send information to clients using both print and electronic media.","definition[21]":"if a book is in print, new copies of it are still being printed and it is easily available. If it is out of print, it is no longer being printed","example[38]":"His small publishing firm has kept classics by American writers in print.","example[39]":"‘Diary of a Nobody’ was published in 1892, and has never been out of print.","definition[22]":"the details in a legal document, contract etc that many people do not take the time to read, but that may have serious effects","example[40]":"Even cardholders who pay their bills in full are advised to read the small print carefully.","example[41]":"advertisements that display low ticket prices but hide surcharges in the fine print"}