{"word[0]":"develop","signpost[0]":"grow","definition[0]":"to grow or change into something bigger, stronger, or more advanced, or to make someone or something do this","example[0]":"Knowledge in the field of genetics has been developing very rapidly.","example[1]":"Corsica has developed its economy around the tourist industry.","example[2]":"exercises to develop muscle strength","example[3]":"Chicago developed into a big city in the late 1800s.","note[0]":"develop into","example[4]":"It’s hard to believe that a tree can develop from a small seed.","note[1]":"develop from","signpost[1]":"new idea/product","definition[1]":"to design or make a new idea, product, system etc over a period of time","example[5]":"Scientists are developing new drugs to treat arthritis.","example[6]":"She should have developed her own style instead of copying him.","example[7]":"Researchers are developing technology for the US military.","definition[2]":"to start to have a feeling or quality that then becomes stronger","example[8]":"He had developed a certain affection for me.","example[9]":"It was in college that he developed a taste for (=started to like) rugby football.","example[10]":"The children are beginning to develop a sense of responsibility.","note[2]":"develop a sense/awareness/knowledge of something","signpost[2]":"skill/ability","definition[3]":"if you develop a skill or ability, or if it develops, it becomes stronger or more advanced","example[11]":"The course is designed to help students develop their speaking skills.","signpost[3]":"disease","definition[4]":"if you develop a disease or illness, or if it develops, you start to have it","example[12]":"Some alcoholics develop liver disease.","example[13]":"Pneumonia can develop very quickly.","signpost[4]":"fault/problem","definition[5]":"to begin to have a physical fault","example[14]":"The oil tank had developed a small crack.","example[15]":"The plane developed engine trouble and was forced to land.","signpost[5]":"problem/difficulty","definition[6]":"if a problem or difficult situation develops, it begins to happen or exist, or it gets worse","example[16]":"Trouble is developing in the cities.","example[17]":"Regional clashes could develop into larger quarrels.","signpost[6]":"idea/argument","definition[7]":"to make an argument or idea clearer, by studying it more or by speaking or writing about it in more detail","example[18]":"We will develop a few of these points in the seminar.","definition[8]":"to use land for the things that people need, for example by taking minerals out of it or by building on it","example[19]":"The land was developed for low-cost housing.","signpost[7]":"photography","definition[9]":"to make a photograph out of a photographic film, using chemicals","example[20]":"Did you ever get the pictures developed?","definition[10]":"to grow or gradually change into a larger, stronger, or more advanced state","example[21]":"Once a stock market develops in the Czech Republic, the bank’s customers will be offered investment accounts.","example[22]":"The city developed into a major trading center.","example[23]":"The Pacific Rim has developed from being a satellite of Japan into an economic base of its own.","example[24]":"The company wants to develop its European operations.","note[3]":"develop something","example[25]":"He developed the company’s laptop market, which was a great success.","definition[11]":"to plan and make a new product or provide a new service","example[26]":"We have developed a new-generation microprocessor for our top-of-the-range computers.","example[27]":"It takes time to develop and market new software.","definition[12]":"to build on land, or improve existing buildings","example[28]":"The building contractor is developing a site in Piccadilly Circus.","definition[13]":"to use a natural substance or product in order to make a profit","example[29]":"The venture will explore for and develop oil and natural gas in the Sindh province of Pakistan.","definition[14]":"to create a plan, policy, or idea","example[30]":"The country must develop a viable national energy policy.","example[31]":"We have developed a very positive plan for the store’s future."}