{"word[0]":"concept","definition[0]":"an idea of how something is, or how something should be done","example[0]":"a new concept in business travel","example[1]":"our basic concepts of decent human behaviour","example[2]":"It’s very simple, once you grasp the concept.","example[3]":"the concept of total patient care","note[0]":"concept of","example[4]":"the concept of infinite space","example[5]":"the concept that we are citizens of one world","note[1]":"concept that","collocation[0]":"a new concept","example[6]":"Part of a  teacher’s job is to introduce new concepts to students.","collocation[1]":"a basic/fundamental concept","example[7]":"The children are taught the basic concepts of mathematics.","collocation[2]":"a key/central/important concept","example[8]":"The title tells you something about the central concept of the poem.","collocation[3]":"a difficult concept","example[9]":"Difficult concepts can sometimes be explained by diagrams or graphs.","collocation[4]":"a simple concept","example[10]":"Cause and effect is a fairly simple concept.","collocation[5]":"the whole concept of something","example[11]":"Some people reject the whole concept of evolution.","collocation[6]":"a general/broad concept","example[12]":"The book begins with some general historical concepts.","collocation[7]":"an abstract concept","example[13]":"He finds it hard to grasp abstract concepts.","collocation[8]":"a theoretical concept","example[14]":"The theoretical concepts of psychology, for example Freud’s ideas, are also useful in the study of literature.","collocation[9]":"a legal/mathematical/marketing etc concept","example[15]":"Democracy is a very important political concept.","collocation[10]":"an alien concept","example[16]":"In many countries, queuing for a bus is an alien concept.","collocation[11]":"an ambiguous/vague concept","example[17]":"Creativity is an ambiguous concept.","collocation[12]":"have a concept of something","example[18]":"Animals have no concept of their own mortality.","collocation[13]":"understand a concept","example[19]":"The class will help you understand the basic concepts of physics.","collocation[14]":"grasp a concept","example[20]":"Children often grasp new concepts more quickly than adults.","collocation[15]":"introduce a concept","example[21]":"The first year of the course introduces the basic concepts of management.","collocation[16]":"develop a concept","example[22]":"The Greeks developed the concept of a scientific theory.","definition[1]":"an idea for a product","example[23]":"the management of an R&D process, from an original concept through to marketing, manufacture and end-use","definition[2]":"a rule or idea saying how something should be done","definition[3]":"an economic idea stating that companies should make products which customers say they want, rather than products customers have to be persuaded to buy","definition[4]":"an economic idea stating that companies should continuously try to improve their products because customers prefer to buy products with the best quality, features, and performance","definition[5]":"an economic idea stating that companies should continuously try to manufacture and deliver their products without wasting time, money, or energy because customers want goods that are low in price and easy to obtain","example[24]":"The main objective of firms adhering to the production concept is to minimize costs, yet still maintain product quality.","definition[6]":"an economic idea stating that companies should try to sell the products they already have, rather than develop new products"}