{"word[0]":"opportunity","plural[0]":"opportunities","definition[0]":"a chance to do something or an occasion when it is easy for you to do something","example[0]":"I’d like to take this opportunity to thank you all.","example[1]":"a rare opportunity to see inside this historic building","note[0]":"opportunity to do something","example[2]":"Games and songs provide an opportunity for classroom interaction.","note[1]":"opportunity for","definition[1]":"a chance to get a job or improve your situation at work","example[3]":"There are fewer opportunities for new graduates this year.","collocation[0]":"have opportunity","example[4]":"I was lucky enough to have the opportunity to travel.","collocation[1]":"take/use opportunity","example[5]":"Several employees took the opportunity to retire early.","collocation[2]":"seize/grasp an opportunity","example[6]":"She saw an opportunity to speak to him, and seized it.","collocation[3]":"miss/lose an opportunity","example[7]":"Dwyer never missed an opportunity to criticize her.","collocation[4]":"give somebody opportunity","example[8]":"The children should be given the opportunity to make their own choices.","collocation[5]":"get an opportunity","example[9]":"I decided to go, as I might never get this opportunity again.","collocation[6]":"provide/present/open up an opportunity","example[10]":"The course also provides an opportunity to study Japanese.","collocation[7]":"an opportunity comes (along/up)","example[11]":"We had outgrown our house when the opportunity came up to buy one with more land.","collocation[8]":"an opportunity arises","example[12]":"Perhaps she would explain later, if the opportunity arose.","collocation[9]":"a good/great/wonderful etc opportunity","example[13]":"It's a great opportunity to try new things.","collocation[10]":"the ideal/perfect opportunity","example[14]":"I'd been wanting to try sailing, and this seemed like the ideal opportunity.","collocation[11]":"a golden opportunity","example[15]":"The council has missed a golden opportunity to improve the town centre.","collocation[12]":"a rare/unique opportunity","example[16]":"a unique opportunity to stay in a real castle","collocation[13]":"a once-in-a-lifetime opportunity","example[17]":"For many athletes, the Olympics are a once-in-a-lifetime opportunity.","collocation[14]":"a wasted/lost/missed opportunity","example[18]":"Many people see the failed talks as a missed opportunity for peace.","collocation[15]":"ample opportunity/plenty of opportunity","example[19]":"There will be ample opportunity for shopping.","collocation[16]":"limited/little opportunity","example[20]":"They had little opportunity to discuss the issue beforehand.","collocation[17]":"a photo opportunity","example[21]":"Parents will always look for good photo opportunities at their kid's graduation ceremony.","collocation[18]":"at the first/earliest opportunity","example[22]":"He decided to leave school at the earliest opportunity.","collocation[19]":"at every (possible) opportunity","example[23]":"She went to the museum at every opportunity.","collocation[20]":"a window of opportunity","example[24]":"The other team started making mistakes, but we didn't take advantage of this window of opportunity.","collocation[21]":"a land of opportunity","example[25]":"America was then seen as a land of opportunity.","collocation[22]":"the opportunity of a lifetime","example[26]":"The winner of the contest got the opportunity of a lifetime – the chance to work with a top fashion designer.","definition[2]":"a chance for you to do something successfully","example[27]":"This is an excellent career opportunity for a recent graduate.","example[28]":"In order to make money, you will need to identify market opportunities.","example[29]":"an investment opportunity","example[30]":"a significant business opportunity"}