{"word[0]":"engagement","signpost[0]":"before marriage","definition[0]":"an agreement between two people to marry, or the period of time they are engaged","note[0]":"engagement ring (=a ring that a man gives a woman to show that they are engaged)","example[0]":"Tony was stunned when Lisa suddenly broke off their engagement  (=finished it).","example[1]":"Their engagement was announced in the paper.","note[1]":"engagement of/to","signpost[1]":"arrangement to do something","definition[1]":"an official arrangement to do something, especially one that is related to your work","example[2]":"His excuse of a prior engagement was accepted.","example[3]":"The princess will continue to carry out royal engagements.","note[2]":"official/public/royal etc engagement","example[4]":"This is his only public speaking engagement on the tour.","signpost[2]":"involvement","definition[2]":"when you become involved with someone or something in order to understand them","example[5]":"a strategy of engagement and cooperation with China","note[3]":"engagement with/in","example[6]":"Many students pass without any real engagement in learning.","signpost[3]":"fighting","definition[3]":"fighting between armies etc","example[7]":"military rules of engagement","signpost[4]":"employment","definition[4]":"an official arrangement to employ or pay someone to do a particular job","example[8]":"Please sign to indicate your acceptance of the terms of engagement.","signpost[5]":"machine parts","definition[5]":"the fitting together of the working parts of a machine","heading[0]":"– Meaning 1: an agreement between two people to marry, or the period of time they are engaged","collocation[0]":"announce your engagement","example[9]":"The couple are expected to announce their engagement today.","collocation[1]":"break off your engagement","example[10]":"Were you surprised when Toni broke off your engagement?","example[11]":"Neither of them wanted a long engagement.","example[12]":"They were married last month after a short engagement.","form[0]":"engagement + NOUN","collocation[2]":"engagement ring","example[13]":"Jerry bought her a beautiful sapphire engagement ring.","heading[1]":"– Meaning 2: an official arrangement to do something, especially one that is related to your work","collocation[3]":"have an engagement","example[14]":"I don't have any engagements tomorrow.","collocation[4]":"carry out an engagement","example[15]":"Last year, the princess carried out over 300 official engagements.","collocation[5]":"cancel an engagement","example[16]":"He instructed his secretary to cancel all his engagements.","collocation[6]":"an official engagement","example[17]":"This is the prime minister's first official engagement since the elections.","collocation[7]":"a public engagement","example[18]":"She appeared with her husband at many public engagements.","collocation[8]":"an important engagement","example[19]":"He had an important engagement with his solicitor.","collocation[9]":"a previous/prior engagement","example[20]":"I'm sorry I can't be there, but I have a previous engagement.","collocation[10]":"a speaking engagement","example[21]":"I've been turning down speaking engagements to concentrate on writing my memoirs.","definition[6]":"when you arrange to employ someone or to pay someone to do something for you","example[22]":"the engagement of supply teachers by schools","definition[7]":"an arrangement to meet someone or attend an event","example[23]":"the Prime Minister’s official engagements","example[24]":"He was unable to attend because of a prior engagement (=one already arranged).","definition[8]":"used to show that a price given by a seller can be changed"}