{"word[0]":"tap","signpost[0]":"water/gas","definition[0]":"a piece of equipment for controlling the flow of water, gas etc from a pipe or container","note[0]":"cold/hot tap (=the tap that cold or hot water comes from)","example[0]":"Tap water (=water that comes out of a tap) is usually heavily treated with chemicals.","example[1]":"She went into the bathroom and turned on the taps.","example[2]":"I washed my hands under the kitchen tap.","note[1]":"kitchen/bath/garden tap","signpost[1]":"a light hit","definition[1]":"an act of hitting something lightly, especially to get someone’s attention","example[3]":"She felt a tap on her shoulder.","note[2]":"tap at/on","example[4]":"There was a tap at the door.","signpost[2]":"dancing","definition[2]":"dancing in which you wear special shoes with pieces of metal on the bottom which make a loud sharp sound on the floor","definition[3]":"an act of secretly listening to someone’s telephone, using electronic equipment","example[5]":"The police had put a tap on his phone line.","signpost[3]":"barrel","definition[4]":"a specially shaped object used for letting liquid out of a barrel, especially beer","heading[0]":"– Meaning 1: a piece of equipment for controlling the flow of water, gas etc from a pipe or container","collocation[0]":"turn on a tap","example[6]":"Run some cold water into the bath before turning on the hot tap.","collocation[1]":"turn off a tap","example[7]":"I forgot to turn the tap off.","collocation[2]":"run a tap","example[8]":"She stood at the sink, running the tap to get a glass of cold water.","collocation[3]":"a tap is running","example[9]":"I think you must have left the tap running.","collocation[4]":"a tap is dripping","example[10]":"If the tap is dripping, change the washer.","form[0]":"ADJECTIVES/NOUN + tap","collocation[5]":"the cold/hot tap","example[11]":"She scrubbed her hands under the cold tap.","collocation[6]":"the kitchen/bath/garden tap","example[12]":"The water coming out of the kitchen tap had an odd smell.","collocation[7]":"a mixer tap","example[13]":"He fitted a mixer tap to the bath.","collocation[8]":"a running tap","example[14]":"Wash the cut under a running tap.","collocation[9]":"a dripping tap","example[15]":"I could hear a dripping tap.","collocation[10]":"a leaking/leaky tap","example[16]":"The leaky tap had left a stain in the washbasin.","form[1]":"tap + NOUN","collocation[11]":"tap water","example[17]":"In the test, people preferred tap water to bottled mineral waters.","heading[1]":"– Meaning 2: an act of hitting something lightly, especially to get someone’s attention","collocation[12]":"a gentle/light/soft tap","example[18]":"There was a gentle tap on the door.","collocation[13]":"a sharp tap","example[19]":"A few sharp taps with a hammer will force the nail through the surface.","collocation[14]":"give something/somebody a tap","example[20]":"She gave the dog a gentle tap with her umbrella.","signpost[4]":"hit lightly","definition[5]":"to hit your fingers lightly on something, for example to get someone’s attention","example[21]":"He turned as someone tapped him on the shoulder.","note[3]":"tap somebody on the shoulder/arm/chest etc","example[22]":"I went up and tapped on the window.","note[4]":"tap on","example[23]":"Mark tapped his fingers on the tabletop impatiently.","note[5]":"tap something on/against/from etc something","example[24]":"She tapped ash from her cigarette.","definition[6]":"to make a regular pattern of sounds with your fingers or feet, especially when you are listening to music","example[25]":"She tapped her feet in time to the music.","example[26]":"a toe-tapping tune","signpost[5]":"energy/money","definition[7]":"to use or take what is needed from something such as an energy supply or an amount of money","example[27]":"People are tapping into the power supply illegally.","example[28]":"We hope that additional sources of funding can be tapped.","signpost[6]":"ideas","definition[8]":"to make as much use as possible of the ideas, experience, knowledge etc that a group of people has","example[29]":"Your adviser’s experience is there to be tapped.","example[30]":"helping people tap into training opportunities","definition[9]":"to listen secretly to someone’s telephone by using a special piece of electronic equipment","example[31]":"Murray’s phone calls to Australia were tapped.","signpost[7]":"tree","definition[10]":"to get liquid from the trunk of a tree by making a hole in it","signpost[8]":"player","definition[11]":"if a football club taps a player from another team, it illegally tries to persuade that player to join its team","definition[12]":"ready for immediate use when you need it","example[32]":"Foreign currency loans provide you with cash on tap in the appropriate currency."}