{"word[0]":"explain","definition[0]":"to tell someone about something in a way that is clear or easy to understand","example[0]":"He carefully explained the procedure.","example[1]":"The librarian will explain how to use the catalogue system.","note[0]":"explain (to somebody) why/how/what etc","example[2]":"Let me explain what I mean.","example[3]":"He explained that it had been a difficult film to make.","note[1]":"explain that","example[4]":"I explained the situation to my bank manager.","note[2]":"explain something to somebody","definition[1]":"to give a reason for something or to be a reason for something","example[5]":"Wait! I can explain everything.","example[6]":"How can you explain that sort of behaviour?","example[7]":"She explained that she had been ill.","example[8]":"I’ll explain why I don’t believe your story.","note[3]":"explain why/how/what etc","example[9]":"That still doesn’t explain how he was able to hide the body.","explanation[0]":"You explain something to someone","example[10]":"Alan explained the system to me","bad_example[0]":"Alan explained me the system","bad_example[1]":"Alan explained to me the system","definition[2]":"to give someone the information they need to understand something","example[11]":"She explained how to use the software.","example[12]":"Doctors usually explain the risks of the treatment to patients.","definition[3]":"to explain something. People often use tell instead of explain in everyday conversation","example[13]":"He told me how to get to his house.","example[14]":"The book tells you how to improve your health through diet.","definition[4]":"to explain to someone how to do something by doing it while they watch you","example[15]":"Ellen showed me how to work the coffee maker.","display[0]":"demonstrate","definition[5]":"to explain to someone how to do something by doing it while they watch you, especially when it is part of your job","example[16]":"The cabin crew demonstrated the safety procedures to the passengers.","example[17]":"A qualified instructor will demonstrate how to use the equipment properly.","display[1]":"go through something","definition[6]":"to explain something carefully, especially one step at a time","example[18]":"Mrs. Riddell went through the homework assignment.","display[2]":"set out something","definition[7]":"to explain a series of ideas, reasons or opinions in an organized way in writing or in a speech","example[19]":"In his speech, he intended to set out the party’s policies on education."}