{"word[0]":"website","definition[0]":"a place on the Internet where you can find information about something, especially a particular organization","example[0]":"For more information on weight loss and healthy eating, visit our website.","example[1]":"Responses will be posted (=put)  on the website.","note[0]":"on a website","collocation[0]":"have a website","example[2]":"Does the company have its own website?","collocation[1]":"visit a website","example[3]":"You can visit the university’s website to get more information.","collocation[2]":"post something on a website","example[4]":"She posted the photos on her website.","collocation[3]":"download something from a website","example[5]":"Home study materials can be downloaded from their website.","collocation[4]":"design a website","example[6]":"Students learn how to design their own websites.","collocation[5]":"create a website","example[7]":"The pupils created a website on Henry VIII.","collocation[6]":"launch a website","example[8]":"The government has launched a website containing information on environmental issues.","collocation[7]":"bookmark a website","example[9]":"If you're looking for good local hiking trails, bookmark this website.","collocation[8]":"an official website","example[10]":"The International Olympic Committee’s official website has a lot of interesting information.","collocation[9]":"a hit on a website","example[11]":"There have already been 5000 hits on our website.","collocation[10]":"a page of a website","example[12]":"The website only has three pages.","collocation[11]":"a link to a website","example[13]":"His home page has a link to the website.","explanation[0]":"You see or put something on a website","example[14]":"You can find details on our website","bad_example[0]":"You can find details in our website","definition[1]":"a place on the Internet where you can find information about something, especially a particular organization. All websites have an address which begins with ‘htt/p:/’","synonym[0]":"site","example[15]":"The website is regularly updated."}