{"word[0]":"career","definition[0]":"a job or profession that you have been trained for, and which you do for a long period of your life","example[0]":"a teaching career","example[1]":"He realized that his acting career was over.","example[2]":"a physiotherapist who wanted to make a dramatic career change by becoming an author","example[3]":"Nurses want an improved career structure (=better opportunities to move upwards in their jobs).","example[4]":"Career prospects within the company are excellent.","note[0]":"career development/advancement/progression etc","example[5]":"a career in journalism","note[1]":"career in","definition[1]":"the period of time in your life that you spend doing a particular activity","example[6]":"She had not had a very impressive school career up till then.","example[7]":"My career as an English teacher didn’t last long.","example[8]":"Beating the defending champion has to be the highlight of my career.","collocation[0]":"a successful career","example[9]":"David had had a successful career in banking.","collocation[1]":"a distinguished/brilliant career","example[10]":"She retired last year after a distinguished career as a barrister.","collocation[2]":"a glittering career","example[11]":"Winning the gold medal was the highlight of her glittering career.","collocation[3]":"a promising career","example[12]":"She gave up a promising career in advertising in order to look after her children.","collocation[4]":"a political/medical/military etc career","example[13]":"The scandal ruined his political career.","collocation[5]":"a teaching/acting/sporting career","example[14]":"Her acting career lasted for more than 50 years.","collocation[6]":"a professional career","example[15]":"You have to be outstanding to have a professional career in music.","collocation[7]":"somebody’s chosen career","example[16]":"His parents encouraged him in his chosen career as a scientist.","collocation[8]":"have a career","example[17]":"All my sons had careers in education.","collocation[9]":"make a career","example[18]":"It isn’t easy to make a career in journalism.","collocation[10]":"pursue a career","example[19]":"She left teaching to pursue a career as a psychologist.","collocation[11]":"begin/start out on/start a career","example[20]":"Jacobson started his banking career in 1990.","collocation[12]":"launch/embark on  a career","example[21]":"Rita went to New York where she launched her dancing career.","collocation[13]":"build a career","example[22]":"She built her literary career by writing about crime.","collocation[14]":"change career","example[23]":"People may change careers as many as seven times in their lives.","collocation[15]":"revive/resurrect your career","example[24]":"The singer is seeking to revive his pop career.","collocation[16]":"somebody’s career takes off","example[25]":"His career took off and he started making a lot of money.","form[0]":"career + NOUN","collocation[17]":"career development/advancement/progression","example[26]":"A good job offers a programme of training and career development.","collocation[18]":"career opportunities","example[27]":"Students often know little about the career opportunities available to them.","collocation[19]":"career prospects","example[28]":"Good computer skills will improve your career prospects.","collocation[20]":"a career path","example[29]":"There’s no fixed career path for becoming an actor.","collocation[21]":"a career structure","example[30]":"Teaching offers a clear career structure.","collocation[22]":"the career ladder","example[31]":"Having children can disturb your progress up the career ladder.","collocation[23]":"a career change/move","example[32]":"After ten years in the job, I realized that I needed to make a career change.","collocation[24]":"a career woman","example[33]":"Career women tend to marry later.","collocation[25]":"careers advice/guidance","example[34]":"Most universities offer professional careers advice.","collocation[26]":"a careers officer","example[35]":"If you’re not sure what to do, why don’t you talk to a careers officer?","collocation[27]":"a career in journalism/politics/teaching etc","example[36]":"At the age of 15, he knew he wanted a career in politics.","definition[2]":"to move forwards quickly without control, making sudden sideways movements","example[37]":"The truck careered down the hill and into a tree.","note[2]":"career down/along/towards etc","definition[3]":"a job or profession that you have been trained for and intend to do for your working life, and which offers the chance to be PROMOTED (=move up through different levels)","example[38]":"My son is thinking of starting a career in the medical profession.","example[39]":"He has devoted his legal career to defending those facing execution.","example[40]":"You should think long and hard before changing careers.","example[41]":"I decided to take up a career in advertising.","definition[4]":"someone who intends to be a soldier, teacher etc for most of their life, not just for a particular period of time","example[42]":"A career diplomat, she has served with distinction at posts in Hong Kong, Bangkok, Baghdad, and Kuwait."}