{"word[0]":"protection","definition[0]":"when someone or something is protected","example[0]":"the protection of the environment","note[0]":"protection of","example[1]":"evidence that vitamin C gives protection against cancer","note[1]":"protection against/from","example[2]":"This law provides protection for threatened animals and plants.","note[2]":"protection for","example[3]":"The police were issued with body armour for extra protection.","note[3]":"for protection","definition[1]":"something that protects","example[4]":"Magee pulled up his collar as protection against the breeze.","note[4]":"as (a) protection (against something)","definition[2]":"the promise of payment from an insurance company if something bad happens","synonym[0]":"coverage","definition[3]":"contraception","example[5]":"Do you have any protection?","definition[4]":"when criminals threaten to damage your property or hurt you unless you pay them money","example[6]":"protection money","example[7]":"a protection racket  (=the illegal activity of demanding money for protection)","collocation[0]":"give/provide protection","example[8]":"One dose of the vaccine provides protection against TB during childhood.","example[9]":"They say they are afforded no protection whatsoever by the security forces.","collocation[1]":"need protection","example[10]":"He seemed to think that she needed protection.","collocation[2]":"seek protection","example[11]":"They were forced to seek the protection of the army.","collocation[3]":"a degree/measure of protection","example[12]":"The shelter gave us a measure of protection against the bitter cold.","form[0]":"ADJECTIVES/NOUN + protection","collocation[4]":"good protection","example[13]":"This lightweight jacket gives good protection from the rain and wind.","collocation[5]":"adequate protection","example[14]":"Some car seats for children did not provide adequate protection.","collocation[6]":"complete protection","example[15]":"No security system can ever give complete protection against a determined thief.","collocation[7]":"greater/better protection","example[16]":"The law should give greater protection to victims.","collocation[8]":"data protection","example[17]":"security issues such as data protection","collocation[9]":"environmental protection","example[18]":"A draft agreement on environmental protection for Antarctica was discussed.","collocation[10]":"consumer protection","example[19]":"The consumer protection regulations will include new online shopping rules.","collocation[11]":"child protection","example[20]":"Officers from the child protection team were called in after the girl turned to a neighbour for help.","collocation[12]":"police protection","example[21]":"He eventually managed to leave under heavy police protection.","definition[5]":"the act of protecting something, or the state of being protected","example[22]":"Milk testing will add another layer of protection for consumers.","example[23]":"Many people buy insurance as protection against an unexpected illness.","note[5]":"protection against","example[24]":"legal protection for workers’ rights","definition[6]":"when a government tries to help an industry in its country by taxing foreign goods that compete with it, so limiting the number that can be imported","example[25]":"The lowering of protection faces resistance from the region’s industrialists.","example[26]":"The conditions of the policy include protection against accidental damage."}