{"word[0]":"comfortable","signpost[0]":"furniture/places/clothes etc","definition[0]":"making you feel physically relaxed, without any pain or without being too hot, cold etc","example[0]":"The bed wasn’t particularly comfortable.","note[0]":"comfortable chair/bed/sofa etc","example[1]":"Joyce has a comfortable apartment in Portland.","note[1]":"comfortable room/lounge/hotel etc","example[2]":"Wear loose comfortable clothing.","note[2]":"comfortable clothes/shoes/boots etc","example[3]":"Linen is very comfortable to wear.","note[3]":"comfortable to wear/use/sit on etc","signpost[1]":"physically relaxed","definition[1]":"feeling physically relaxed, without any pain or without being too hot, cold etc","example[4]":"I was so comfortable and warm in bed I didn’t want to get up.","example[5]":"Sit down and make yourself comfortable.","example[6]":"With difficulty, she rolled her body into a more comfortable position.","signpost[2]":"confident","definition[2]":"confident, relaxed, and not worried","example[7]":"In our business, we need people who are comfortable in an unstructured environment.","example[8]":"She’s never felt very comfortable with men.","note[4]":"comfortable with","definition[3]":"having enough money to buy the things you need or want, without having to worry about how much they cost","example[9]":"Jean’s looking forward to a comfortable retirement.","note[5]":"comfortable life/retirement/existence etc","signpost[3]":"competition/vote","definition[4]":"if you have a comfortable win or lead, you win or are leading by a large amount","example[10]":"The bill should pass in the House by a comfortable margin.","example[11]":"Another penalty from Roberts gave the home team a comfortable half-time lead.","example[12]":"The pair had a comfortable win, beating the German team by nearly three seconds.","note[6]":"comfortable win/victory","signpost[4]":"ill/injured","definition[5]":"if someone who is ill or injured is comfortable, they are not in too much pain","collocation[0]":"chair/bed/sofa etc","example[13]":"Is that chair comfortable?","collocation[1]":"bedroom/lounge etc","example[14]":"The bedroom was large and comfortable with a view of the river.","collocation[2]":"home/hotel/apartment etc","example[15]":"This is a friendly and comfortable hotel.","example[16]":"You’ll need comfortable shoes for walking around the city.","collocation[3]":"a comfortable position","example[17]":"When driving, make sure you are seated in a comfortable position.","collocation[4]":"comfortable surroundings","example[18]":"Relax in the comfortable surroundings of the hotel.","collocation[5]":"comfortable to wear/use/ride etc","example[19]":"My bike isn’t very comfortable to ride.","collocation[6]":"warm and comfortable","example[20]":"The house is warm and comfortable even in winter.","collocation[7]":"feel comfortable","example[21]":"You’ll probably feel most comfortable wearing cotton clothes.","collocation[8]":"look comfortable","example[22]":"That sofa looks wonderfully comfortable.","collocation[9]":"make something comfortable","example[23]":"There are lots of ways you can make your home more comfortable to live in.","definition[6]":"making you feel physically relaxed, and not too hard, hot, cold etc. Also used about people feeling physically relaxed","example[24]":"The hotel was very comfortable.","example[25]":"I tried to get into a more comfortable position.","display[0]":"comfy","definition[7]":"comfortable – used especially about furniture and clothes","example[26]":"a comfy armchair","example[27]":"These shoes are very comfy.","example[28]":"Are you comfy?","display[1]":"cosy","definition[8]":"comfortable and warm – used especially about small rooms, houses etc","example[29]":"There’s a cosy lounge with a real fire.","example[30]":"a cozy apartment","display[2]":"snug","definition[9]":"small, warm, and comfortable, especially in a way that makes you feel protected – used especially about rooms, houses etc. Also used about people feeling warm and comfortable","example[31]":"It was very cold outside, but our tents were snug and warm.","example[32]":"She wished she was back in her snug little house.","example[33]":"I’m snug as a bug in a rug in here! (=very snug – used in informal British English)","definition[10]":"a smooth journey is comfortable because your car or plane does not shake, or the sea is not rough","example[34]":"Did you have a smooth flight?","example[35]":"a smooth crossing"}