{"word[0]":"hatred","definition[0]":"an angry feeling of extreme dislike for someone or something","opposite[0]":"love","example[0]":"A look of pure hatred flashed across her face.","example[1]":"the old hatreds and prejudices that simmered below the surface","example[2]":"Ellis was a sick young man with a deep hatred of women.","note[0]":"passionate/intense/deep etc hatred","example[3]":"his intense hatred of all foreigners","note[1]":"hatred of/for/towards","example[4]":"Abby made no secret of her hatred for her father.","collocation[0]":"feel hatred","example[5]":"It was terrifying to know that someone could feel such hatred towards me.","collocation[1]":"have a hatred of somebody/something","example[6]":"Gang members have a hatred of the police.","collocation[2]":"stir up hatred","example[7]":"Right-wing parties tried to stir up hatred and exploit racial tension.","collocation[3]":"incite hatred","example[8]":"He faces criminal charges for inciting racial hatred.","form[0]":"ADJECTIVES/NOUN + hatred","collocation[4]":"racial/race hatred","example[9]":"Feelings of racial hatred were drummed into him as a child.","collocation[5]":"ethnic hatred","example[10]":"Churches and mosques were burnt as ethnic hatred turned into violence.","collocation[6]":"religious/sectarian hatred","example[11]":"The law makes it an offence to stir up religious hatred.","collocation[7]":"pure hatred","example[12]":"The child opened her eyes and stared at Juliet with pure hatred.","collocation[8]":"passionate/intense/deep/bitter hatred","example[13]":"What, I wondered, had I done to provoke such deep hatred?","collocation[9]":"be full of/filled with hatred","example[14]":"She told me, in a voice full of hatred and contempt, that I meant nothing to her.","collocation[10]":"feelings of hatred","example[15]":"She talked about the feelings of hatred she has towards her son’s killer.","definition[1]":"an angry feeling of deep dislike for someone or something","example[16]":"his hatred of violence","example[17]":"It is easy to understand their hatred for the invaders of their country.","example[18]":"racial hatred  (=of people who belong to a different race)","display[0]":"hate","definition[2]":"the angry feeling that someone has when they hate someone and want to harm them","example[19]":"His mind was filled with hate and the desire for revenge.","example[20]":"Her love for him turned to hate, and she tore up all his old letters.","example[21]":"Thatcher became a hate figure for the left  (=someone who many people hate).","example[22]":"His enemies started a hate campaign against him in the press.","display[1]":"loathing","definition[3]":"a very strong feeling of hatred for someone or something that you think is extremely unpleasant","example[23]":"I felt nothing but loathing for him after the way he’d treated me.","display[2]":"animosity","definition[4]":"a feeling of hatred and anger that often makes people behave unpleasantly to each other","example[24]":"The animosity between parents who are getting a divorce can often cause great suffering to their children.","display[3]":"abhorrence","definition[5]":"a deep feeling of hatred towards something that you think is morally wrong or unpleasant","example[25]":"the abhorrence of terrorism by all decent people","display[4]":"contempt","definition[6]":"a feeling of hate towards someone or something you think does not deserve any respect at all","example[26]":"She looked at him with contempt.","example[27]":"I have nothing but contempt for these people."}