{"word[0]":"buy","past_tense[0]":"bought","definition[0]":"to get something by paying money for it","example[0]":"Where did you buy that dress?","example[1]":"Ricky showed her the painting he’d bought that morning.","example[2]":"It’s much cheaper to buy in bulk (=buy large quantities of something).","example[3]":"Dan bought the car for $2,000.","note[0]":"buy something for $10/£200 etc","example[4]":"Let me buy you a drink.","note[1]":"buy somebody something","example[5]":"The money will be used to buy equipment for the school.","note[2]":"buy something for somebody/something","example[6]":"It’s cheaper to buy direct from the manufacturer.","note[3]":"buy (something) from somebody","definition[1]":"if a sum of money buys something, it is enough to pay for it","example[7]":"$50 doesn’t buy much these days.","example[8]":"$15 should buy us a pizza and a drink.","definition[2]":"to believe something that someone tells you, especially when it is not likely to be true","example[9]":"‘Let’s just say it was an accident.’ ‘He’ll never buy that.’","definition[3]":"to pay money to someone, especially someone in a position of authority, in order to persuade them to do something dishonest","synonym[0]":"bribe","example[10]":"People say the judge had been bought by the Mafia.","definition[4]":"to pay money for something so that you can own it","example[11]":"I’ve just bought a new car.","example[12]":"The painting was bought by a museum in New York.","display[0]":"purchase","definition[5]":"to buy something, especially something large or expensive, in a business deal or by a legal contract","example[13]":"They purchased 5,000 acres of land.","display[1]":"acquire","definition[6]":"to become the owner of something large or expensive such as property, a company, or a valuable object","example[14]":"In 2007 the business was acquired by a Dutch company.","example[15]":"Television companies were then allowed to acquire more stations.","definition[7]":"to buy something, especially ordinary things such as food, clothes, or things for your house","example[16]":"Did you remember to get some bread?","example[17]":"I never know what to get Dad for his birthday.","display[2]":"snap something up","definition[8]":"to buy something immediately, especially because it is very cheap, or because you want it very much and you are worried that someone else might buy it first","example[18]":"Real estate in the area is being snapped up by developers.","display[3]":"pick something up","definition[9]":"to buy something, especially something ordinary such as food or a newspaper, or something that you have found by chance and are pleased about owning","example[19]":"Could you pick up some milk on your way home?","example[20]":"It’s just a little thing I picked up when I was in Kathmandu.","display[4]":"stock up","definition[10]":"to buy a lot of something you use regularly, because you may not be able to buy it later, or because you are planning to use more of it than usual","example[21]":"The supermarkets are full of people stocking up for the New Year’s holiday.","example[22]":"We always stock up on cheap wine when we go to France.","example[23]":"Before the blizzard, we stocked up on food.","display[5]":"splash out","definition[11]":"to buy something you would not usually buy, because it is too expensive, in order to celebrate an event or make yourself feel good","example[24]":"Why don’t you splash out on a new dress for the party?","example[25]":"We splurged on an expensive hotel for the last night of the vacation.","definition[12]":"something that is worth buying, because it is cheap, good quality, or likely to gain in value","example[26]":"The wine is a good buy at $6.50.","note[4]":"a good/excellent etc buy","example[27]":"It’s worth shopping around for the best buy (=what you want at the lowest price).","definition[13]":"an act of buying something, especially something illegal","synonym[1]":"deal","example[28]":"We just cannot afford to buy a new car.","example[29]":"Come on, I’ll buy you lunch.","definition[14]":"if a sum of money buys something, you can get it for that amount of money","example[30]":"£400,000 should buy a decent four-bedroomed house, especially outside the London area.","example[31]":"A dollar won’t even buy you a cup of coffee these days.","definition[15]":"to buy something without seeing it or looking at it carefully, that turns out to be bad value","example[32]":"House purchasers must satisfy themselves through legal advisers or surveyors that they are not buying a pig in a poke.","definition[16]":"to be cheated into buying something that is not good value","example[33]":"If he has bought a pup, it is highly unlikely that any other shrewd financier would buy it from him.","definition[17]":"to buy and hold stocks, shares etc expecting their price to rise","definition[18]":"to be worth or not worth the money being paid","example[34]":"Do you think a second-hand car is a good buy?"}