{"word[0]":"ready","signpost[0]":"prepared","definition[0]":"if you are ready, you are prepared for what you are going to do","note[0]":"ready when you are (=said to tell someone that you are ready to do what you have arranged to do together)","example[0]":"Come on. Aren’t you ready yet?","example[1]":"When the doorbell rang he was ready and waiting.","example[2]":"We made ready for our journey home.","note[1]":"make ready","example[3]":"Everything’s packed, and we’re ready to leave.","note[2]":"ready to do something","example[4]":"Why does it take you so long to get ready to go out?","example[5]":"I don’t feel that I’m ready for my driving test yet.","note[3]":"ready for something","example[6]":"I felt strong, fit, and ready for anything.","example[7]":"At the end of the lecture, I was ready with questions.","note[4]":"ready with something","signpost[1]":"for immediate use","definition[1]":"if something is ready, someone has prepared it and you can use it immediately","example[8]":"When will supper be ready?","example[9]":"I’ve got to get a room ready for our guests.","example[10]":"The computer is now set up and ready to use.","note[5]":"ready to use/eat etc","example[11]":"Is everything ready for the exhibition?","signpost[2]":"willing","definition[2]":"very willing to do something","example[12]":"She was ready and willing to work hard.","example[13]":"He was always ready to help us.","definition[3]":"available or coming without delay","example[14]":"They need to have ready access to police files.","example[15]":"a ready supply of drink","example[16]":"I had no ready answer to his question.","example[17]":"an intelligent man with a ready wit","definition[4]":"having done everything that needs to be done in order to prepare for something","example[18]":"Are you ready? The taxi’s here.","example[19]":"I don’t feel that I’m ready for the test yet.","definition[5]":"ready to deal with a situation, because you are expecting it or have made careful preparations","example[20]":"The police were prepared for trouble.","example[21]":"The team looked well-prepared for the game.","display[0]":"be all set","definition[6]":"to be ready to start doing something that you have planned to do, and be just about to do it","example[22]":"We were all set for a barbecue when it started to rain.","display[1]":"be good to go","definition[7]":"be ready to start doing something after completing all the necessary preparations","example[23]":"We just need to get you a pair of skis and you’re good to go.","display[2]":"ripe","definition[8]":"ripe fruit are soft, sweet, and ready to eat","example[24]":"Don’t pick the apples until they’re really ripe.","example[25]":"a delicious ripe plum","display[3]":"be in place","definition[9]":"if the arrangements or the equipment for doing something are in place, they are ready to start being used","example[26]":"The television cameras were in place for the wedding.","example[27]":"All the arrangements are in place for a new constitution and democratic elections.","display[4]":"be standing by","definition[10]":"if people are standing by, they are ready to take action and help if they are needed – used especially about medical teams, police, the army etc","example[28]":"Officers in full riot gear were standing by outside the police station.","example[29]":"Several ambulances were standing by.","definition[11]":"to make something or someone ready for something","synonym[0]":"prepare","example[30]":"I tried to ready him for the bad news.","note[6]":"ready somebody/something for something","definition[12]":"money etc that is easily available to be used at any time","example[31]":"a government initiative to ensure a ready supply of skilled software graduates"}