{"word[0]":"ring","signpost[0]":"jewellery","definition[0]":"a piece of jewellery that you wear on your finger","example[0]":"a diamond ring","example[1]":"a plain silver ring","signpost[1]":"circle","definition[1]":"an object in the shape of a circle","example[2]":"a rubber ring for children to go swimming with","example[3]":"onion rings","example[4]":"a key ring","definition[2]":"a circular line or mark","example[5]":"She left a dirty ring around the bath.","note[0]":"ring around","example[6]":"a ring round the moon","note[1]":"ring round","definition[3]":"a group of people or things arranged in a circle","example[7]":"A ring of armed troops surrounded the building.","note[2]":"ring of","example[8]":"The city was overlooked by a ring of high-rise buildings.","signpost[2]":"bells","definition[4]":"the sound made by a bell or the act of making this sound","example[9]":"a ring at the doorbell","signpost[3]":"criminals","definition[5]":"a group of people who illegally control a business or criminal activity","example[10]":"Are you aware that a drugs ring is being operated in the club?","example[11]":"Secret files reveal an Oxford spy ring.","signpost[4]":"cooking","definition[6]":"one of the circular areas on top of a cooker that is heated by gas or electricity","example[12]":"a gas ring","definition[7]":"a small square area surrounded by ropes, where people box or wrestle","definition[8]":"the sport of boxing","example[13]":"He retired from the ring at 34.","signpost[5]":"entertainment","definition[9]":"a large circular area surrounded by seats at a circus","collocation[0]":"wear a ring","example[14]":"He wore a gold ring on his right hand.","collocation[1]":"have a ring on","example[15]":"They saw I didn’t have a wedding ring on.","form[0]":"ADJECTIVES/NOUN + ring","collocation[2]":"a gold/silver ring","example[16]":"She took off her gold ring.","collocation[3]":"a diamond/sapphire etc ring","example[17]":"On her right hand was a huge diamond ring.","collocation[4]":"a heavy ring","example[18]":"Her fingers were clustered with heavy rings.","collocation[5]":"a plain ring","example[19]":"She wore a plain gold ring.","collocation[6]":"a wedding ring","example[20]":"He gave her a diamond wedding ring on their wedding day.","collocation[7]":"an engagement ring","example[21]":"I noticed that she had an engagement ring on her finger.","collocation[8]":"an eternity ring","collocation[9]":"a signet ring","past_tense[0]":"rang","past_participle[0]":"rung","signpost[6]":"bell","definition[10]":"to make a bell make a sound, especially to call someone’s attention to you or to call someone to help you","example[22]":"I rang the doorbell but no one came.","example[23]":"The sign said, ‘Ring for service’.","note[3]":"ring for","example[24]":"Instead of ringing for the maid, she made the tea herself.","definition[11]":"if a bell rings, it makes a noise","example[25]":"The bell rang for the end of break.","definition[12]":"to make a telephone call to someone","example[26]":"I was going to ring you but I don’t have your number.","example[27]":"Sally rang for a taxi.","definition[13]":"if a telephone rings, it makes a sound to show that someone is telephoning you","example[28]":"The phone hasn’t stopped ringing all day.","signpost[7]":"sounds","definition[14]":"if your ears ring, they make a continuous sound that only you can hear, after you have been somewhere very noisy or heard a loud sound","example[29]":"The explosion made our ears ring.","definition[15]":"if a place rings with a sound, it is full of that sound","example[30]":"The whole room rang with their laughter.","note[4]":"ring with","explanation[0]":"Ring belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[1]":"In this sentence, ‘the bell’ is the object of ring","example[31]":"The teacher rang the bell","explanation[2]":"In this sentence, ‘the bell’ is the subject of ring","example[32]":"The bell rang","past_tense[1]":"ringed","definition[16]":"to surround something","example[33]":"Thousands of people ringed the court building to demand the release of Mr Cox.","example[34]":"Her eyes were ringed with stiff black lashes.","note[5]":"be ringed with something","definition[17]":"to draw a circular mark around something","example[35]":"Ring the mistakes in red.","definition[18]":"a set of four operas by Richard Wagner, known also as The Ring of the Nibelung  or The Ring Cycle. They are based on stories from German  mythology, and are known for being very long.","definition[19]":"a group of manufacturers or suppliers who have agreed to fix prices, often illegally, so that there is no competition between them and they can make large profits","definition[20]":"a group of dealers who work together illegally to buy things at an AUCTION (=an event where things are sold to the person who is willing to pay most) at low prices, then sell them later at higher prices and share the profit","definition[21]":"a group of criminals working together","example[36]":"Police suspect a drug ring may be operating in the area.","definition[22]":"the area of a COMMODITY EXCHANGE where trading takes place","example[37]":"Give me a ring if you want to discuss the proposal.","synonym[0]":"CALL","example[38]":"I rang you yesterday but you weren’t in.","example[39]":"Ring this number for further information.","definition[23]":"If a telephone rings, it makes a sound to show that someone is phoning you"}