{"word[0]":"convert","definition[0]":"to change something into a different form, or to change something so that it can be used for a different purpose or in a different way","example[0]":"a 19th-century converted barn (=barn changed into a house)","example[1]":"They converted the spare bedroom into an office.","note[0]":"convert something to/into something","example[2]":"The stocks can be easily converted to cash.","definition[1]":"to change into a different form, or change into something that can be used for a different purpose or in a different way","example[3]":"a sofa that converts into a bed","note[1]":"convert to/into","example[4]":"In the process, the light energy converts to heat energy.","definition[2]":"to persuade someone to change to a different religion","example[5]":"European missionaries converted thousands to Christianity.","note[2]":"convert somebody to something","definition[3]":"to change to a different religion","example[6]":"She converted to Catholicism.","note[3]":"convert to","definition[4]":"to change to a different set of ideas, principles, or ways of doing something","example[7]":"people who have recently converted to vegetarianism","definition[5]":"to persuade someone to change to a different set of ideas, principles, or ways of doing something","example[8]":"newly converted feminists","note[4]":"newly/freshly converted","example[9]":"She succeeded in converting me to her point of view.","definition[6]":"to make a conversion in rugby or American football","definition[7]":"someone who has been persuaded to change their beliefs and accept a particular religion or opinion","example[10]":"a convert to Christianity","example[11]":"recent converts to the cause","definition[8]":"to change or make something change from one thing to another","example[12]":"energy consumption that could readily be converted from oil to natural gas","example[13]":"bonds that can be converted into stock at a later date","example[14]":"A falling dollar means that foreign-currency profits are worth more when converted into dollars."}