{"word[0]":"essay","definition[0]":"a short piece of writing about a particular subject by a student as part of a course of study","example[0]":"an essay on Bernard Shaw","note[0]":"essay on/about","definition[1]":"a short piece of writing giving someone’s ideas about politics, society etc","example[1]":"Rousseau’s ‘Essay on the Origin of Languages’","note[1]":"essay on","definition[2]":"an attempt to do something","collocation[0]":"write/do an essay","example[2]":"I’ve got a 3,000 word essay to write before Friday.","collocation[1]":"give in/hand in an essay","example[3]":"Half the class failed to hand in their essay on time.","collocation[2]":"mark an essay","example[4]":"I went home knowing that I still had a pile of essays to mark.","collocation[3]":"read an essay","example[5]":"Did you read her essay on ‘The Waste Land’?","form[0]":"ADJECTIVES/NOUN + essay","collocation[4]":"an English/history/politics etc essay","example[6]":"He got a good grade for his English essay.","collocation[5]":"a critical essay","example[7]":"The anthology contains critical essays by Kael, Graham Greene and others.","collocation[6]":"an academic essay","example[8]":"Mature students often need practice writing academic essays.","collocation[7]":"a literary essay","example[9]":"In a literary essay, you should explore the meaning and construction of the text.","form[1]":"essay + NOUN","collocation[8]":"an essay question","example[10]":"We practised essay questions from previous exam papers.","collocation[9]":"an essay title","example[11]":"You will find a list of essay titles on the notice board.","collocation[10]":"an essay topic","example[12]":"Students will be given six essay topics, from which they must choose two.","collocation[11]":"a collection of essays","example[13]":"She published a collection of essays on philosophy.","definition[3]":"a piece of writing written by a student as part of a course of study","example[14]":"We had to write an essay about the environment.","example[15]":"Have you handed in your essay yet?","definition[4]":"an essay written by a someone who has studied a subject as part of their research. Paper is also used about an essay that you have to write for a class at school, especially in American English","example[16]":"The professor has published over forty scientific papers on diseases of tropical crops","example[17]":"At the beginning of the school year we had to write a paper about our interests.","display[0]":"dissertation","definition[5]":"a long essay written as part of a university degree","example[18]":"In the third year of their course, students have to write  a 10,000 word dissertation on a topic that has been approved by their tutor.","display[1]":"thesis","definition[6]":"a very long essay that is part of an advanced university degree such as a master’s degree or a doctorate","example[19]":"He wrote his doctoral thesis on  the literature of the English romantic movement.","definition[7]":"to attempt to do something"}