{"word[0]":"professional","definition[0]":"relating to a job that needs special education and training","example[0]":"What professional qualifications does he have?","example[1]":"It is essential to get good professional advice.","example[2]":"You may need to seek professional help.","definition[1]":"relating to your job or work and not to your private life","example[3]":"professional contacts","signpost[0]":"well trained","definition[2]":"showing that someone has been well trained and is good at their work","example[4]":"This business plan looks very professional.","example[5]":"a more professional approach to work","signpost[1]":"paid","definition[3]":"doing a job, sport, or activity for money, rather than just for fun","note[0]":"turn/go professional (=start to do something as a job)","example[6]":"a professional tennis player","example[7]":"a professional army","signpost[2]":"team/event","definition[4]":"done by or relating to people who are paid to do a sport or activity","example[8]":"a professional hockey team","example[9]":"The golf tournament is a professional event.","collocation[0]":"professional advice","example[10]":"Everyone considering buying a house should seek professional advice.","collocation[1]":"professional help","example[11]":"It is very important for parents to get professional help if this problem arises.","collocation[2]":"professional qualifications","example[12]":"Many of the courses lead directly to professional qualifications.","collocation[3]":"professional training","example[13]":"All the charity’s workers are volunteers, without professional training.","collocation[4]":"professional standards","example[14]":"The Law Society’s function is to maintain the highest professional standards.","collocation[5]":"a professional body/association","example[15]":"Is your architect a member of a professional body?","collocation[6]":"a professional career","example[16]":"After retiring from sport, he began his professional career as a journalist.","collocation[7]":"somebody’s professional life","example[17]":"At this point she took the biggest risk of her professional life.","definition[5]":"someone who earns money by doing a job, sport, or activity that many other people do just for fun","example[18]":"Hurd signed as a professional in 1998.","example[19]":"top snooker professionals","definition[6]":"someone who works in a job that needs special education and training, such as a doctor, lawyer, or architect","example[20]":"health professionals (=doctors, nurses etc)","definition[7]":"someone who has a lot of experience and does something very skilfully","example[21]":"You sing like a real professional.","definition[8]":"connected with a job requiring advanced education and special training","example[22]":"professional trade associations","example[23]":"providers of business andprofessional services","definition[9]":"training offered to people working in professions as part of their job","example[24]":"the Law Society’s continuing professional development scheme","definition[10]":"very well trained and showing high standards of work","example[25]":"The women made an excellent showing — they were every bit as professional as their male colleagues.","example[26]":"If you build your business and run it in a professional way, you’ll be around to pick up the rewards.","definition[11]":"doing an activity, sport etc to earn money, rather than for pleasure","example[27]":"a professional footballer","example[28]":"The weather could put a third of the nation’s professional beekeepers out of business.","definition[12]":"someone who does a job requiring advanced education and special training","example[29]":"A number of market professionals are recommending cyclical stocks.","example[30]":"Business Risks employs 225 professionals, many of them former law-enforcement officers.","definition[13]":"someone who is very experienced, has a lot of knowledge, and does things very skilfully","example[31]":"The successful applicant will be a decisive professional, capable of making hard decisions.","definition[14]":"someone who earns money doing a job, sport etc that other people do for pleasure","example[32]":"Nike say the shoe is designed for professionals and advanced amateurs  (=people who do a sport for pleasure)."}