{"word[0]":"precaution","definition[0]":"something you do in order to prevent something dangerous or unpleasant from happening","example[0]":"Fire precautions were neglected.","example[1]":"Vets took precautions to prevent the spread of the disease.","example[2]":"The trails are well marked, but carrying a map is a wise precaution.","note[0]":"wise/sensible precaution","example[3]":"I took the precaution of insuring my camera.","note[1]":"take the precaution of doing something","example[4]":"The traffic barriers were put there as a safety precaution.","note[2]":"as a precaution","example[5]":"Save your work often as a precaution against computer failure.","note[3]":"precaution against","explanation[0]":"In everyday English, people usually say just in case rather than as a precaution:","example[6]":"I'm going to take my umbrella just in case.","collocation[0]":"take a precaution","example[7]":"We had taken the precaution of turning the water off.","form[0]":"ADJECTIVES/NOUN + precaution","collocation[1]":"a sensible/wise precaution","example[8]":"Fitting window locks is a sensible precaution.","collocation[2]":"a simple precaution","example[9]":"You can easily reduce the risk of theft by taking a few simple precautions.","collocation[3]":"a necessary precaution","example[10]":"He justified his secrecy as a necessary precaution.","collocation[4]":"a reasonable precaution","example[11]":"You must take all reasonable precautions to safeguard official property.","collocation[5]":"adequate/proper precautions","example[12]":"Companies have a legal responsibility to take adequate precautions against fire.","collocation[6]":"basic/elementary precautions","example[13]":"Your home could be at risk if you don't take some basic precautions.","collocation[7]":"elaborate precautions","example[14]":"Elaborate precautions were taken to avoid disputes between the representatives.","collocation[8]":"a safety precaution","example[15]":"Both areas were cordoned off as a safety precaution.","collocation[9]":"a security precaution","example[16]":"The threat of terrorist attacks has prompted some elaborate security precautions.","definition[1]":"something done to prevent something unpleasant or dangerous happening","example[17]":"All companies with limited resources must take precautions to limit their liability.","example[18]":"As a precaution, the company advised consumers to examine any jar before it is opened."}