{"word[0]":"goal","definition[0]":"something that you hope to achieve in the future","synonym[0]":"aim","example[0]":"Your goal as a parent is to help your child become an independent adult.","explanation[0]":"In everyday British English, people often talk about what someone is aiming to do rather than talk about someone’s goal:","definition[1]":"the area between two posts where the ball must go in order to score in games such as football or hockey","note[0]":"be in goal/keep goal British English (=be the goalkeeper)","definition[2]":"the action of making the ball go into a goal, or the score gained by doing this","example[1]":"I scored the first goal.","heading[0]":"– Meaning 1: something that you hope to achieve in the future","collocation[0]":"somebody’s main/primary goal","example[2]":"My main goal was to get the team to the finals.","example[3]":"The primary goal of the 1917 Revolution was to seize and redistribute the wealth of the Russian empire.","collocation[1]":"somebody’s ultimate goal","example[4]":"The ultimate goal is a freer, more democratic society.","collocation[2]":"an immediate goal","example[5]":"Our immediate goal is to cut costs.","collocation[3]":"a long-term goal","example[6]":"The organization’s long-term goal is to gain a strong position in the European market.","collocation[4]":"a short-term goal","example[7]":"Companies should not focus only on the short-term goal of profitability.","collocation[5]":"somebody’s personal goal","example[8]":"They had to sacrifice personal goals for their family life.","collocation[6]":"a common goal","example[9]":"Iran and Turkey shared common goals in their handling of the refugee crisis.","collocation[7]":"a realistic/achievable goal","example[10]":"Students are encouraged to set themselves realistic goals for academic improvement.","example[11]":"We pushed for what we thought were achievable goals","collocation[8]":"an ambitious goal","example[12]":"The agreement set ambitious goals to cut greenhouse gas emissions worldwide.","collocation[9]":"a modest goal","example[13]":"Don’t try to lose a lot of weight quickly; set yourself a more modest goal.","collocation[10]":"have a goal","example[14]":"She had one goal in life: to accumulate a huge fortune.","collocation[11]":"work towards a goal","example[15]":"We are all working towards similar goals.","collocation[12]":"pursue a goal","example[16]":"Have we gone too far in pursuing the goal of national security?","collocation[13]":"achieve/attain/reach your goal","example[17]":"She has worked hard to achieve her goal of a job in the medical profession.","example[18]":"They’re hoping to reach their goal of raising £10,000 for charity.","collocation[14]":"set (yourself/somebody) a goal","example[19]":"It helps if you set yourself clear goals.","heading[1]":"– Meaning 3: the action of making the ball go into a goal, or the score gained by doing this","collocation[15]":"score a goal","example[20]":"Robbie Keane scored a goal just before halftime.","collocation[16]":"get a goal","example[21]":"It was great that he got that goal so late in the game.","collocation[17]":"head a goal","example[22]":"Peter Crouch headed England’s equalizing goal.","collocation[18]":"make a goal","example[23]":"Rooney made the goal with a superb pass to Saha.","collocation[19]":"concede a goal","example[24]":"Arsenal conceded a goal in the final minute of extra time.","collocation[20]":"let in a goal","example[25]":"Chelsea let in a goal in the 63rd minute.","collocation[21]":"disallow a goal","example[26]":"The goal was disallowed for offside.","collocation[22]":"the winning goal","example[27]":"Berbatov scored the winning goal from just outside the box.","collocation[23]":"an own goal","example[28]":"Dixon scored an unfortunate own goal against West Ham.","collocation[24]":"a last-minute goal","example[29]":"A last-minute goal condemned Fulham to a 0–1 home defeat.","collocation[25]":"an equalizing goal","example[30]":"A loud cheer went up as he scored the equalizing goal.","synonym[1]":"AIM","example[31]":"The Sensor razor is helping Gillette achieve its goal of getting new customers.","example[32]":"Our long-term goal is universal private education.","example[33]":"His goal is to open banks in 35 states by the end of the decade."}