{"word[0]":"bring","past_tense[0]":"brought","definition[0]":"to take something or someone with you to the place where you are now, or to the place you are talking about","example[0]":"Did you bring an umbrella?","example[1]":"It was the first time Joey had ever brought a girl home.","example[2]":"They brought news of further fighting along the border.","example[3]":"Is it OK if I bring some friends to the party?","note[0]":"bring somebody/something to somebody/something","example[4]":"For some reason, Jesse had brought a tape recorder with him.","note[1]":"bring somebody/something with you","definition[1]":"to get something for someone and take it to them","example[5]":"Can you bring me another beer?","note[2]":"bring somebody something","example[6]":"Robert asked the waiter to bring him the check.","example[7]":"While she was in prison, friends used to bring her books.","example[8]":"He expects me to bring everything to him.","definition[2]":"to make a particular situation exist, or cause a particular feeling","example[9]":"efforts to bring peace to the region","example[10]":"The strikes are expected to bring chaos.","example[11]":"The senator’s speech brought an angry response from civil rights groups.","definition[3]":"to cause someone or something to reach a particular state or condition","example[12]":"It was the war that first brought him to power (=made him have power over a country).","example[13]":"So far the US has been unable to bring him to justice (=make him be punished for his actions).","example[14]":"Bring the sauce to the boil (=heat it until it boils).","example[15]":"The country had been brought to its knees (=caused to be in such a bad condition that it is almost impossible to continue).","example[16]":"The trial was swiftly brought to an end.","note[3]":"bring something to an end/close/halt/conclusion","definition[4]":"to make something move in a particular direction","example[17]":"Bring your arm up slowly until it’s level with your shoulder.","note[4]":"bring something up/down/round etc","example[18]":"The storm brought the old oak tree crashing down.","definition[5]":"if something brings people to a place, it makes them go there","example[19]":"The discovery of gold brought thousands of people to the Transvaal.","example[20]":"What brings you here on a night like this?","note[5]":"what brings you here?","definition[6]":"to make something available for people to use, have, enjoy etc","example[21]":"The expansion of state education brought new and wider opportunities for working class children.","example[22]":"The government is launching a new initiative to bring jobs to deprived areas.","note[6]":"bring something to somebody/something","example[23]":"It’s a good sign – let’s hope it will bring us some luck.","definition[7]":"if a period of time brings a particular event or situation, the event or situation happens during that time","example[24]":"The 1930s brought unemployment and economic recession.","example[25]":"Who knows what the future will bring?","definition[8]":"used when saying that something is the next thing that you want to talk about","example[26]":"This brings me to the main point of today’s meeting.","note[7]":"that/this/which brings me to ...","definition[9]":"if a programme is brought to you by a particular television or radio company, they broadcast it or make it","example[27]":"This programme is brought to you by the BBC.","note[8]":"something is brought to you by somebody","collocation[0]":"bring peace/war","example[28]":"The treaty brought peace to both England and France.","collocation[1]":"bring chaos","example[29]":"A bomb scare brought chaos to the town centre yesterday.","collocation[2]":"bring somebody pleasure/joy/pain/grief etc","example[30]":"The decision brought him great relief.","collocation[3]":"bring something to an end/halt","example[31]":"It is our responsibility to discuss how this conflict can be brought to an end.","collocation[4]":"bring something to a close","example[32]":"At last the meeting was brought to a close.","collocation[5]":"bring something to a conclusion","example[33]":"Juvenile cases need to be brought to a conclusion quickly.","collocation[6]":"bring somebody to power","example[34]":"The revolution brought to power a communist government.","collocation[7]":"bring somebody to justice","example[35]":"The authorities swore that the killers would be brought to justice.","collocation[8]":"bring somebody into contact with somebody/something","example[36]":"The people of the island were suddenly brought into contact with the outside world.","collocation[9]":"bring something/somebody to their knees","example[37]":"A severe drought brought the country to its knees.","definition[10]":"to take something or someone to the place where you are now, or the place where you are going","example[38]":"Have you brought your ticket with you?","example[39]":"He asked his father if he could bring a friend to stay.","definition[11]":"to move something to another place, or help someone go to another place","example[40]":"I took a book with me to read on the train.","example[41]":"He was taken to hospital by ambulance.","definition[12]":"to go to another place and come back with something or someone","example[42]":"I went upstairs to get my jacket.","example[43]":"Joseph told me to fetch the doctor, so I ran to the village.","definition[13]":"to organize a legal case against someone","example[44]":"a string of lawsuits brought by jobseekers who think they’re the victims of discrimination","example[45]":"Company directors are meeting with law enforcement officials to determine whether to bring criminal charges."}