{"word[0]":"crack","definition[0]":"to break or to make something break, either so that it gets lines on its surface, or so that it breaks into pieces","example[0]":"Don’t put boiling water in the glass or it will crack.","example[1]":"Concrete is liable to crack in very cold weather.","example[2]":"He picked up a piece of rock and cracked it in half.","example[3]":"She fell and cracked a bone in her leg.","example[4]":"He cracked a couple of eggs into a pan.","definition[1]":"to make a quick loud sound like the sound of something breaking, or to make something do this","example[5]":"Thunder cracked overhead.","example[6]":"He cracked his whip and galloped off.","example[7]":"Dennis rubbed his hands together and cracked his knuckles.","definition[2]":"to hit someone or something hard","example[8]":"She cracked him over the head with a hammer.","example[9]":"I slipped and cracked my head on the door.","note[0]":"crack something on something","signpost[0]":"not be able to continue","definition[3]":"to be unable to continue doing something because there is too much pressure and you do not have the mental strength to continue","example[10]":"Some young executives crack under the pressure of having to meet tough sales targets every month.","note[1]":"crack under","example[11]":"He cracked under interrogation and confessed.","definition[4]":"if your voice cracks, it starts to sound different because you are feeling strong emotions","example[12]":"His voice cracked slightly as he tried to explain.","signpost[1]":"solve/understand","definition[5]":"to find the answer to a problem or manage to understand something that is difficult to understand","synonym[0]":"solve","example[13]":"I think we’ve cracked the problem of the computer crashing all the time.","example[14]":"It took them nearly two months to crack the code.","example[15]":"This new evidence could help detectives to crack the case.","signpost[2]":"stop somebody","definition[6]":"to stop a person from being successful","example[16]":"Political enemies have tried to crack me.","signpost[3]":"open a safe","definition[7]":"to open a safe illegally in order to steal the things inside it","definition[8]":"to illegally copy computer software or change free software which may lack certain features of the full version, so that the free software works in the same way as the full version","example[17]":"You can find out how to crack any kind of software on the web.","signpost[4]":"gap","definition[9]":"a very narrow space between two things or two parts of something","example[18]":"She opened the door a crack and peeped into the room.","example[19]":"He squeezed into a crack between two rocks.","note[2]":"crack between","example[20]":"He could see them through a crack in the door.","note[3]":"crack in","definition[10]":"a thin line on the surface of something when it is broken but has not actually come apart","example[21]":"There were several small cracks in the glass.","definition[11]":"a weakness or fault in an idea, system, or organization","example[22]":"The first cracks are beginning to appear in the economic policy.","example[23]":"The cracks in their relationship were starting to show.","definition[12]":"a sudden loud sound like the sound of a stick being broken","example[24]":"There was a sharp crack as the branch broke off.","note[4]":"loud/sharp crack","example[25]":"We could hear the crack of gunfire in the distance.","note[5]":"crack of","example[26]":"a crack of thunder","signpost[5]":"joke","definition[13]":"a clever joke or rude remark","example[27]":"He’s always making cracks about how stupid I am.","example[28]":"I didn’t like his crack about her being overweight.","note[6]":"crack about","signpost[6]":"attempt","definition[14]":"an attempt to do something","synonym[1]":"shot","example[29]":"The competition’s open to anyone – why don’t you have a crack?","example[30]":"I’d like a crack at climbing that mountain.","note[7]":"crack at","definition[15]":"an illegal drug that some people take for pleasure","example[31]":"crack addicts","definition[16]":"the space between someone’s buttocks","definition[17]":"a piece of information or computer code that lets you illegally change free software which may lack certain features of the full version, so that the free software works in the same way as the full version","definition[18]":"another spelling of craic","definition[19]":"with a lot of experience and skill","example[32]":"crack troops","example[33]":"a crack regiment","example[34]":"a crack sportsman"}