{"definition[0]":"used to say who is intended to get or use something, or where something is intended to be used","example[0]":"I’ve got a present for you.","example[1]":"Someone left a message for Vicky.","example[2]":"an English course for foreign students","example[3]":"We need a new battery for the radio.","example[4]":"These chairs are for the office.","definition[1]":"in order to help someone or something","example[5]":"I looked after the kids for them.","example[6]":"Let me carry that bag for you.","example[7]":"The doctor knew that there was nothing he could do for her.","example[8]":"Charles died fighting for his country.","example[9]":"What can I do for you  (=used to ask a customer if you can help them)?","definition[2]":"used to say what the purpose of an object, action etc is","example[10]":"What did you do that for?","example[11]":"I’ve bought him a watch for his birthday.","example[12]":"the documents prepared for his defence","example[13]":"a knife for cutting bread","note[0]":"for doing something","explanation[0]":"You say that something is for doing a particular thing","example[14]":"This is for pulling up weeds","bad_example[0]":"This is for to pull up weeds","explanation[1]":"You say that someone does something in order to do a particular thing","example[15]":"They borrowed money in order to build up the business","bad_example[1]":"They needed money for to build up the business","explanation[2]":"You say that someone does something to do a particular thing","example[16]":"She went downtown to do some shopping","bad_example[2]":"She went downtown for to do some shopping","definition[3]":"in order to have, do, get, or obtain something","example[17]":"Are you waiting for the bus?","example[18]":"the qualifications necessary for a career in broadcasting","example[19]":"Mother was too ill to get up for dinner.","example[20]":"I paid $3 for a ticket.","example[21]":"For further details, write to this address.","example[22]":"Let’s go for a walk.","definition[4]":"used to say how long an action or situation continues for","example[23]":"Bake the cake for 40 minutes.","example[24]":"We had been talking for a good half hour.","example[25]":"He’s been off work for a while.","definition[5]":"used to talk about distance","example[26]":"We walked for miles.","example[27]":"Factories stretch for quite a way along the canal.","definition[6]":"if something is arranged for a particular time, it is planned that it should happen then","example[28]":"I’ve invited them for 9 o'clock.","example[29]":"A meeting was arranged for 18th May.","definition[7]":"used to say where a person, vehicle etc is going","example[30]":"I set off for work.","example[31]":"the train for Manchester","example[32]":"A few days later she would be leaving for New York.","definition[8]":"used to say what the price or value of something is","example[33]":"a cheque for a hundred pounds","example[34]":"The diamond was insured for two thousand dollars.","definition[9]":"because of or as a result of something","example[35]":"If, for any reason, you cannot attend, please inform us.","example[36]":"We could hardly see for the mist.","example[37]":"You’ll feel better for a break.","example[38]":"a reward for making good progress","example[39]":"Campbell was arrested for dangerous driving.","definition[10]":"used to say which thing or person your statement or question is related to","example[40]":"I’m sure she’s the ideal person for the job.","example[41]":"The questions on this paper are too difficult for 10-year-olds.","example[42]":"Are you all right for money?","example[43]":"Fortunately for him, he can swim.","definition[11]":"used to say which person or thing your feelings are directed towards","example[44]":"I came away feeling sorry for poor old George.","example[45]":"My deep love for him still remains.","example[46]":"They show no respect for authority.","definition[12]":"used to say at which meal you eat something","example[47]":"We had pasta for lunch.","definition[13]":"used to say which company, team etc you belong to","example[48]":"I’ve worked for the BBC ever since I left university.","example[49]":"Deborah used to play for the A team.","example[50]":"He writes for a weekly paper.","definition[14]":"supporting or in agreement with something or someone","example[51]":"We have studied the arguments for and against nuclear energy.","example[52]":"How many people voted for the proposal?","example[53]":"Three cheers for the captain.","example[54]":"I’m all for giving people more freedom.","note[1]":"be all for (doing) something","definition[15]":"used to say what a word or sign means","example[55]":"What’s the French word for ‘happy’?","example[56]":"Red is for danger.","definition[16]":"used to say that a particular quality of someone or something is surprising when you consider what they are","example[57]":"She looks young for her age.","example[58]":"It’s cold for July.","definition[17]":"as a representative of other people","example[59]":"Paisley claims to speak for the majority of local people.","definition[18]":"used to say what is possible, difficult, necessary, unusual etc","example[60]":"It’s unusual for Donald to be so bad-tempered.","note[2]":"for somebody/something to do something","example[61]":"There is an urgent need for someone to tackle this problem.","example[62]":"Here is a chance for everyone to learn new skills.","example[63]":"There’s nothing worse than for a parent to ill-treat a child.","example[64]":"It was too far for her to walk in high-heeled shoes.","definition[19]":"used to introduce the reason for something","synonym[0]":"because","example[65]":"I cannot tell whether she is old or young, for I have never seen her.","example[66]":"He found it increasingly difficult to read, for his eyesight was beginning to fail.","definition[20]":"abbreviation for FREE ON RAIL"}