{"word[0]":"spirit","signpost[0]":"character","definition[0]":"the qualities that make someone live the way they do, and make them different from other people","example[0]":"She is a strong and independent spirit.","note[0]":"independent/proud/free etc spirit","example[1]":"I’m 85, but I still feel young in spirit.","note[1]":"in spirit","signpost[1]":"soul","definition[1]":"the part of someone that you cannot see, that consists of the qualities that make up their character, which many people believe continues to live after the person has died","example[2]":"Although Laurie is dead, I can feel his spirit with me.","signpost[2]":"no body","definition[2]":"a creature without a physical body that some people believe exists, such as an angel or a dead person, who has returned to this world and has strange or magical powers","example[3]":"an evil spirit","signpost[3]":"determination","definition[3]":"courage, energy, and determination – used to show approval","example[4]":"Sandra is small, but she makes up for it with great spirit.","example[5]":"a young team with strong fighting spirit","example[6]":"When they took away his freedom, they broke his spirit (=made him lose his courage).","signpost[4]":"attitude","definition[4]":"the attitude that you have towards something or while you are doing something","example[7]":"You’ve got to approach this meeting in the right spirit.","example[8]":"the spirit of cooperation between the two sides","note[2]":"spirit of","signpost[5]":"typical qualities","definition[5]":"the set of ideas, beliefs, feelings etc that are typical of a particular period in history, a place, or a group of people","example[9]":"His beliefs conflicted with the spirit of the age.","note[3]":"the spirit of the age/times","example[10]":"Tourism has not destroyed the spirit of Bali.","signpost[6]":"intention","definition[6]":"the meaning or qualities that someone intended something to have, especially the meaning that a law or rule was intended to have","example[11]":"Thoreau believed that his actions were in the spirit of American institutions.","example[12]":"Miller’s actions may not be actually illegal, but they have violated the spirit of the law.","definition[7]":"a strong alcoholic drink such as whisky or brandy","definition[8]":"liquid such as alcohol, used for cleaning","collocation[0]":"high/good","example[13]":"The players were all in high spirits.","collocation[1]":"low/flagging","example[14]":"She was tired and her spirits were low.","collocation[2]":"lift/raise/revive somebody’s spirits","example[15]":"A brisk walk helped to lift my spirits.","collocation[3]":"keep somebody’s spirits up","example[16]":"He wrote home often, trying to keep his family’s spirits up.","collocation[4]":"dampen somebody’s spirits","example[17]":"They refused to let the rain dampen their spirits.","collocation[5]":"somebody’s spirits rise/lift/soar","example[18]":"Her spirits rose as they left the ugliness of London behind.","collocation[6]":"somebody’s spirits sink","example[19]":"His spirits sank at the prospect.","definition[9]":"a US spacecraft that landed on Mars in 2004. It moved around the surface of Mars to find signs of water, take samples of soil, and take photographs."}