{"word[0]":"buzz","signpost[0]":"make a sound","definition[0]":"to make a continuous sound, like the sound of a bee","example[0]":"a loud buzzing noise","signpost[1]":"moving around","definition[1]":"to move around in the air making a continuous sound like a bee","example[1]":"Bees were buzzing around the picnic tables.","definition[2]":"to move quickly around a place","signpost[2]":"excitement","definition[3]":"if a group of people or a place is buzzing, there is a lot of activity or excitement","example[2]":"a classroom buzzing with activity","note[0]":"buzz with","signpost[3]":"call","definition[4]":"to call someone by pressing a buzzer","example[3]":"Kramer buzzed at the security door, and I let him in.","example[4]":"Tina buzzed for her secretary.","note[1]":"buzz for","definition[5]":"to make something happen, for example make a door or gate open or close, by pressing a buzzer","example[5]":"She buzzed them in and greeted them warmly.","note[2]":"buzz somebody in/out","example[6]":"The guard buzzed me through the gate.","note[3]":"buzz somebody through something","signpost[4]":"thoughts","definition[6]":"if your head or mind is buzzing with thoughts, ideas etc, you cannot stop thinking about them","example[7]":"Questions started buzzing round in my head.","example[8]":"My mind was buzzing with new ideas.","signpost[5]":"ears","definition[7]":"if your ears or head are buzzing, you can hear a continuous low unpleasant sound","definition[8]":"to fly an aircraft low and fast over buildings, people etc","example[9]":"Military jets buzzed the city.","definition[9]":"a continuous noise like the sound of a bee","example[10]":"the buzz of mosquitoes","note[4]":"buzz of","definition[10]":"a lot of activity, noise, and excitement","example[11]":"the buzz of conversation and laughter","definition[11]":"a strong feeling of excitement, pleasure, or success, or a similar feeling from drinking alcohol or taking drugs","example[12]":"Playing well gives me a buzz.","example[13]":"Neil gets a buzz from drinking one beer."}