{"word[0]":"division","signpost[0]":"separating","definition[0]":"the act of separating something into two or more different parts, or the way these parts are separated or shared","example[0]":"the division of words into syllables","note[0]":"division of something between/among/into something","example[1]":"the traditional division of labour  (=the way that particular tasks are shared) between husband and wife","signpost[1]":"disagreement","definition[1]":"disagreement among the members of a group that makes them form smaller opposing groups","example[2]":"The Army was plagued by internal divisions.","example[3]":"The old class divisions had begun to break down.","note[1]":"racial/class/gender etc division","example[4]":"Can he heal the deep divisions among Republican ranks?","note[2]":"division between/within/among something","definition[2]":"the process of finding out how many times one number is contained in another","signpost[2]":"part of an organization","definition[3]":"a group that does a particular job within a large organization","example[5]":"the Computer Services Division","definition[4]":"a large military group","example[6]":"a tank division","definition[5]":"one of the groups of teams that a sports competition is divided into, often based on the number of games they have won","example[7]":"a second-division club","note[3]":"the Premier/First/Second/Third/Fourth Division","signpost[3]":"in parliament","definition[6]":"a process in which members of the British parliament vote for something by dividing into groups","example[8]":"MPs forced a division on the bill.","example[9]":"Some members supported the opposition in the division lobbies  (=the rooms where the vote takes place).","definition[7]":"one of the large parts into which a large organization or company is divided","example[10]":"Each division has its own editorial, production, and marketing sales staff.","example[11]":"Thomson acquired the TV manufacturing division of America’s General Electric."}