{"signpost[0]":"attitude","definition[0]":"if you are positive about things, you are hopeful and confident, and think about what is good in a situation rather than what is bad","example[0]":"the power of positive thinking","example[1]":"‘Think positive!’ she advised herself.","example[2]":"She’s got a really positive attitude to life.","note[0]":"positive attitude/approach/outlook etc","example[3]":"You’ve got to be more positive about your work.","note[1]":"positive about","signpost[1]":"good thing","definition[1]":"good or useful","example[4]":"At least something positive has come out of the situation.","example[5]":"Write down all the positive things about your life.","example[6]":"The rural environment was having a positive effect on the children’s health.","example[7]":"It’s been a very positive experience for her.","example[8]":"TV can be a positive influence.","example[9]":"the positive contribution to the community made by many older people","example[10]":"It’s been a difficult time but, on the positive side, I feel physically fine.","example[11]":"Women should be portrayed in a more positive light.","signpost[2]":"action","definition[2]":"if you take positive action, you do something definite in order to try to achieve something","example[12]":"We need to take positive steps to improve the situation of families in poverty.","example[13]":"Positive action was required.","example[14]":"It’s a relief to know that something positive is being done.","definition[3]":"expressing support, agreement, or approval","example[15]":"We’ve had a lot of positive feedback from the people of this city.","example[16]":"The response we’ve had from the public has been very positive.","note[2]":"positive response/reaction","example[17]":"Most people have been very positive about the show.","signpost[3]":"sure","definition[4]":"very sure, with no doubt at all that something is right or true","synonym[0]":"certain","example[18]":"‘Are you sure about that?’ ‘Positive.’","example[19]":"Are you absolutely positive you locked the door?","note[3]":"positive (that)","signpost[4]":"sign","definition[5]":"showing that something is likely to succeed or improve","example[20]":"The fact that he’s breathing on his own again is a positive sign.","signpost[5]":"scientific test","definition[6]":"showing signs of the medical condition or chemical that is being looked for","example[21]":"The test results came back positive.","example[22]":"athletes who had tested positive for banned substances","example[23]":"children who are HIV positive","signpost[6]":"emphasis","definition[7]":"used to emphasize how good or bad something is","example[24]":"The journey was a positive nightmare.","definition[8]":"a positive number is more than zero","definition[9]":"having the type of electrical charge that is carried by protons","example[25]":"a positive charge","heading[0]":"– Meaning 1: if you are positive about things, you are hopeful and confident, and think about what is good in a situation rather than what is bad","collocation[0]":"a positive attitude/outlook","example[26]":"Having a positive attitude makes life so much better.","collocation[1]":"a positive approach","example[27]":"This is just the positive approach that the school needs.","collocation[2]":"a positive view","example[28]":"He takes a fairly positive view of the future.","collocation[3]":"a positive thought","example[29]":"Think positive thoughts.","collocation[4]":"positive thinking","example[30]":"Many people believe that positive thinking can help your recovery from serious illnesses.","collocation[5]":"think positive","example[31]":"Cheer up and think positive.","heading[1]":"– Meaning 2: good or useful","collocation[6]":"a positive thing","example[32]":"That's not a very positive thing to say.","collocation[7]":"a positive aspect","example[33]":"There are a lot of positive aspects to retirement.","collocation[8]":"a positive effect/impact","example[34]":"Exercise has a positive effect on health.","collocation[9]":"a positive influence","example[35]":"His mother was a strong positive influence.","collocation[10]":"a positive contribution","example[36]":"Most refugees are determined to make a positive contribution to their new country.","collocation[11]":"a positive result/outcome","example[37]":"We hope there will be a positive outcome to the talks.","collocation[12]":"a positive experience","example[38]":"Working here has been a very positive experience for me.","collocation[13]":"a positive role model","example[39]":"We should provide girls with more positive role models.","collocation[14]":"a positive image","example[40]":"It's important to promote a positive image of our industry to young people.","collocation[15]":"see/present something in a positive light","example[41]":"If you spend a year travelling after school, employers often see this in a positive light.","example[42]":"The merger was presented to the world in a positive light.","collocation[16]":"on the positive side","example[43]":"On the positive side, the company’s financial condition remains strong.","definition[10]":"a quality or feature that is good or useful","example[44]":"You can find positives in any situation.","example[45]":"Always emphasise the positive.","example[46]":"When interest rates fall, there is a positive effect on business confidence.","example[47]":"He felt that these meetings did not make any sort of positive contribution to branch performance.","example[48]":"The response we’ve had from our customers has been very positive.","definition[11]":"thinking that a situation is good or will be good","example[49]":"The company is very positive about its future.","definition[12]":"if you take positive action, you do something definite in order to try and achieve something","example[50]":"She took positive steps to boost her design team.","definition[13]":"more than zero","example[51]":"Exports totaled $1,275 million, while imports totaled $1,050 million, giving a positive trade balance of $225 million."}