{"word[0]":"hole","signpost[0]":"space in something solid","definition[0]":"an empty space in something solid","example[0]":"I began digging a hole for the plant.","example[1]":"There was a huge hole in the road.","note[0]":"hole in","signpost[1]":"space something can go through","definition[1]":"a space in something solid that allows light or things to pass through","example[2]":"These socks are full of holes.","example[3]":"bullet holes  (=made by bullets)","example[4]":"They climbed through a hole in the fence.","signpost[2]":"empty place","definition[2]":"a place where someone or something should be, but is missing","example[5]":"Their departure will leave a gaping hole in Grand Prix racing.","signpost[3]":"weak part","definition[3]":"a weak part or fault in something such as an idea or plan","example[6]":"The theory is full of holes.","example[7]":"If you have holes in your game, work on them.","signpost[4]":"animal’s home","definition[4]":"the home of a small animal","example[8]":"a rabbit hole","signpost[5]":"unpleasant place","definition[5]":"an unpleasant place","example[9]":"I’ve got to get out of this hole.","signpost[6]":"golf","definition[6]":"a hole in the ground that you try to get the ball into in the game of golf","definition[7]":"one part of a golf course with this kind of hole at one end","definition[8]":"an empty space in the surface of something, which sometimes goes all the way through it","example[10]":"A fox had dug a hole under our fence.","example[11]":"Rain was coming in through a hole in the roof.","display[0]":"space","definition[9]":"an empty area between two things, into which you can put something","example[12]":"Are there any empty spaces on the bookshelf?","example[13]":"a parking space","display[1]":"gap","definition[10]":"an empty area between two things or two parts of something, especially one that should not be there","example[14]":"He has a gap between his two front teeth.","example[15]":"I squeezed through a gap in the hedge.","display[2]":"opening","definition[11]":"a hole that something can pass through or that you can see through, especially at the entrance of something","example[16]":"The train disappeared into the dark opening of the tunnel.","example[17]":"I looked through the narrow opening in the wall.","display[3]":"leak","definition[12]":"a small hole where something has been damaged or broken that lets liquid or gas flow in or out","example[18]":"a leak in the pipe","example[19]":"The plumber’s coming to repair the leak.","display[4]":"puncture","definition[13]":"a small hole in a tyre through which air escapes","example[20]":"My bike’s got a puncture.","display[5]":"crack","definition[14]":"a very narrow space between two things or two parts of something","example[21]":"The snake slid into a crack in the rock.","example[22]":"She was peering through the crack in the curtains.","display[6]":"slot","definition[15]":"a straight narrow hole that you put a particular type of object into","example[23]":"You have to put a coin in the slot before you dial the number.","example[24]":"A small disk fits into a slot in the camera.","display[7]":"crater","definition[16]":"a round hole in the ground made by an explosion or by a large object hitting it hard","example[25]":"a volcanic crater","example[26]":"The meteor left a crater over five miles wide.","example[27]":"the craters on the Moon","heading[0]":"to make a hole in something","display[8]":"make a hole in something","definition[17]":"to cause a hole to appear in something","example[28]":"Make a hole in the bottom of the can using a hammer and nail.","display[9]":"pierce","definition[18]":"to make a small hole in or through something, using a pointed object","example[29]":"The dog’s teeth had pierced her skin.","example[30]":"Shelley wanted to have her ears pierced (=for earrings).","display[10]":"prick","definition[19]":"to make a very small hole in the surface of something, using a pointed object","example[31]":"Prick the potatoes before baking them.","example[32]":"My finger was bleeding where the needle had pricked it.","display[11]":"punch","definition[20]":"to make a hole through paper or flat material using a metal tool or other sharp object","example[33]":"I bought one of those things for punching holes in paper.","example[34]":"You have to get your ticket punched before you get on the train.","definition[21]":"to make a small hole in something, especially something where skin or a wall surrounds a softer or hollow inside part","example[35]":"The bullet had punctured his lung.","display[12]":"perforate","definition[22]":"to make a hole or holes in something","example[36]":"Fragments of the bullet had perforated his intestines.","display[13]":"drill","definition[23]":"to make a hole using a special tool, often one which turns round and round very quickly","example[37]":"The dentist started drilling a hole in my tooth.","example[38]":"They won a contract to drill for oil in the area.","display[14]":"bore","definition[24]":"to make a deep round hole through a rock, into the ground etc","example[39]":"They had to bore through solid rock.","example[40]":"The men were boring a hole for the tunnel.","definition[25]":"to hit the ball into a hole in golf","example[41]":"He holed the putt with ease."}