{"word[0]":"reform","definition[0]":"a change or changes made to a system or organization in order to improve it","example[0]":"Reforms were made to revive the economy.","example[1]":"The government announced a much-needed programme of economic reform.","note[0]":"economic/political/educational reform","example[2]":"The prime minister is calling for sweeping reforms of the NHS.","note[1]":"far-reaching/sweeping/radical reforms","example[3]":"a reform of the legal system","note[2]":"reform of","form[0]":"ADJECTIVES/NOUN + reform","collocation[0]":"economic reform","example[4]":"The prime minister has promised to push ahead with economic reform.","collocation[1]":"political/democratic/constitutional reform","example[5]":"He stressed that democratic reform could not be achieved overnight.","collocation[2]":"tax reform","example[6]":"The chancellor's proposals for tax reform met strong resistance in the Commons.","collocation[3]":"education reform","example[7]":"Teachers say the government's education reforms are causing stress.","collocation[4]":"a major reform","example[8]":"He called for a major reform of the drug laws.","collocation[5]":"radical reform","example[9]":"His government adopted a policy of radical reform.","collocation[6]":"fundamental reform","example[10]":"He wants fundamental reform of the EU's agricultural policy.","collocation[7]":"far-reaching/sweeping reforms","example[11]":"The new government instituted a series of far-reaching reforms.","collocation[8]":"make/carry out reforms","example[12]":"They haven't made any real reforms.","collocation[9]":"introduce reforms","example[13]":"They increased pressure on the government to introduce political reforms.","collocation[10]":"push through reforms","example[14]":"He has so far failed to push through much-needed economic reforms.","collocation[11]":"implement reforms","example[15]":"Much will depend on how local managers implement the reforms.","collocation[12]":"a package/programme of reforms","example[16]":"A package of reforms was approved by the National Assembly on April 12.","definition[1]":"to improve a system, law, organization etc by making a lot of changes to it, so that it operates in a fairer or more effective way","example[17]":"plans to radically reform the tax system","definition[2]":"to change your behaviour and become a better person, or to make someone do this","example[18]":"Greeley says he’s a genuinely reformed character.","example[19]":"a reformed criminal","definition[3]":"to change a system, law, organization etc so that it operates in a fairer or more effective way","example[20]":"The government has announced its plans to reform the tax system.","definition[4]":"a change made to a system, law, organization etc so that it operates in a fairer or more effective way","example[21]":"radical reforms of the company taxation system","example[22]":"There is an urgent need for economic reform."}