{"word[0]":"steady","signpost[0]":"continuous","definition[0]":"continuing or developing gradually or without stopping, and not likely to change","example[0]":"Paul is making steady progress.","example[1]":"a steady rain","example[2]":"Employment is holding steady at 96%.","note[0]":"hold/remain steady","example[3]":"a steady stream of traffic","note[1]":"steady stream/flow/trickle etc","signpost[1]":"not moving","definition[1]":"firmly held in a particular position and not moving or shaking","example[4]":"It takes a steady hand to perform surgery.","example[5]":"Keep the camera steady while you take a picture.","note[2]":"hold/keep something steady","signpost[2]":"voice/look","definition[2]":"if someone’s voice is steady, or they look at you in a steady way, they seem calm and do not stop speaking or looking at you","example[6]":"There were tears in her eyes, but her voice was steady.","example[7]":"He could not meet Connor’s steady gaze.","definition[3]":"someone who is steady is sensible and you can depend on them","example[8]":"a steady worker","collocation[0]":"steady progress","example[9]":"We're making steady progress in reducing the unemployment rate.","collocation[1]":"steady growth","example[10]":"During the 1960s most of the Western world enjoyed steady economic growth.","collocation[2]":"a steady increase/rise","example[11]":"The campus has benefited from a steady increase in student numbers.","collocation[3]":"a steady decline","example[12]":"The result has been a steady decline in membership.","collocation[4]":"a steady stream/flow/trickle","example[13]":"All day long a steady stream of customers came and went.","collocation[5]":"a steady supply","example[14]":"They need a steady supply of educated workers.","collocation[6]":"a steady pace/rate","example[15]":"He moved at a slow and steady pace through the maze of corridors.","example[16]":"A recent poll showed his approval rating holding steady at 53 percent.","collocation[7]":"slow but/and steady","example[17]":"She is making a slow but steady recovery.","definition[4]":"to hold someone or something so they become more balanced or controlled, or to become more balanced or controlled","example[18]":"The plane steadied, and the passengers relaxed.","example[19]":"He reached the chair and steadied himself.","note[3]":"steady yourself","definition[5]":"to stop increasing or decreasing and remain about the same","synonym[0]":"stabilize","example[20]":"The dollar has steadied after early losses on the money markets.","definition[6]":"to become calmer, or to make someone do this","example[21]":"Tamar took a deep breath to steady her nerves.","example[22]":"Jess is a steadying influence on the rest of the team.","plural[0]":"steadies","definition[7]":"a boyfriend or girlfriend that someone has been having a romantic relationship with","definition[8]":"used when you want to tell someone to be careful or not to cause an accident","example[23]":"Steady! You nearly knocked me over.","definition[9]":"happening, developing, or moving in a continuous gradual way","example[24]":"There has been a steady decline in demand over the past 12 months.","example[25]":"The market has experienced three years of steady growth.","example[26]":"We continue to make steady progress in improving key areas of our business.","definition[10]":"staying at about the same level","example[27]":"Software dealers found that prices are steady in spite of the currency fluctuation.","example[28]":"In December, energy prices plunged 1.4% after holding steady the month before.","definition[11]":"a job or work that will definitely continue over a long period of time","example[29]":"For years, the promise of steady work attracted waves of immigrants to the area.","past_tense[0]":"steadied","definition[12]":"to stop increasing or decreasing and stay about the same, or to make something do this","example[30]":"Some cautious buying by Japanese life insurance companies steadied the market."}