{"word[0]":"fill","signpost[0]":"become/make full","definition[0]":"if a container or place fills, or if you fill it, enough of something goes into it to make it full","example[0]":"He poured her a drink, then filled his own glass.","example[1]":"My job was filling the flour sacks.","example[2]":"Take a deep breath and allow your lungs to fill.","example[3]":"There was just enough wind to fill the sails.","example[4]":"Miller’s band was filling dance halls  (=attracting a lot of people) all over the country.","example[5]":"a bucket filled to the brim with ice","note[0]":"fill something to the brim/to overflowing","example[6]":"Her eyes filled with tears.","note[1]":"fill (something) with something","signpost[1]":"large thing/number","definition[1]":"if a thing or group fills something, there is no space left","example[7]":"Crowds of well-wishers filled the streets.","example[8]":"His wartime experiences would fill a book!","example[9]":"All the seats were filled and a number of people were standing.","example[10]":"Numerous pictures fill every available space.","signpost[2]":"sound/smell/light","definition[2]":"if a sound, smell, or light fills a place, you notice it because it is very loud or strong","example[11]":"The smell of freshly baked bread filled the room.","example[12]":"The air was filled with the sound of children’s laughter.","note[2]":"be filled with something","signpost[3]":"emotions","definition[3]":"if you are filled with an emotion, or if it fills you, you feel it very strongly","example[13]":"I was filled with admiration for her.","note[3]":"be filled with admiration/joy/happiness etc","example[14]":"Their faces were suddenly filled with fear.","note[4]":"be filled with horror/fear/anger/doubt/remorse","example[15]":"The prospect filled him with horror.","note[5]":"fill somebody with something","signpost[4]":"provide something","definition[4]":"to provide something that is needed or wanted but which has not been available or present before","example[16]":"Volunteers fill a real need for teachers in the Somali Republic.","note[6]":"fill a need/demand","example[17]":"I spent most of the summer filling the gaps in my education.","note[7]":"fill a gap/hole/niche etc","example[18]":"The company has moved quickly to fill the niche in the overnight travel market.","signpost[5]":"spend time","definition[5]":"if you fill a period of time with a particular activity, you spend that time doing it","example[19]":"I have no trouble filling my time.","note[8]":"fill your time/the days etc (with something)","signpost[6]":"perform a job","definition[6]":"to perform a particular job, activity, or purpose in an organization, or to find someone or something to do this","example[20]":"Women fill 35% of senior management positions.","note[9]":"fill a post/position/vacancy etc","example[21]":"Thank you for your letter. Unfortunately, the vacancy has already been filled.","example[22]":"The UK should find another weapon to fill the same role.","signpost[7]":"crack/hole","definition[7]":"to put a substance into a hole, crack etc to make a surface level","example[23]":"Fill in any cracks before starting to paint.","example[24]":"materials developed to fill tooth cavities","explanation[0]":"Fill belongs to a group of verbs where the same noun can be the subject of the verb or its object","explanation[1]":"In this sentence, ‘the bath’ is the object of fill","example[25]":"She filled the bath with water","explanation[2]":"In this sentence, ‘the bath’ is the subject of fill","example[26]":"The bath filled with water","definition[8]":"to put enough of something into a container to make it full","example[27]":"Jenny filled the kettle and put it on to boil.","example[28]":"Party balloons can be filled with helium.","display[0]":"fill up","definition[9]":"to fill something completely – used especially about putting petrol in the tank of a car","example[29]":"I need to fill up the car.","example[30]":"The waiter filled up everyone’s glasses.","example[31]":"If the oil tank is less than half full, tell them to fill it up.","display[1]":"load/load up","definition[10]":"to fill a vehicle with goods, furniture etc","example[32]":"Two men were loading a truck with boxes of melons.","display[2]":"stuff/cram","definition[11]":"to quickly fill something such as a bag or pocket by pushing things into it tightly","example[33]":"She hurriedly stuffed some things into an overnight bag and left.","display[3]":"refill","definition[12]":"to fill a container again, after what was in it has been used","example[34]":"I’m just going to refill this bottle from the tap.","display[4]":"top up","definition[13]":"to fill a glass or cup that still has some liquid in it","example[35]":"Can I top up your glass of wine?","display[5]":"replenish","definition[14]":"to make something full again, especially with a supply of something such as water or food","example[36]":"The lake is fed by springs that are eternally replenished by the rain.","definition[15]":"to find and employ a suitable person to do a job that has been advertised","example[37]":"Headhunters are charging up to 60% of annual salary to fill a top job.","example[38]":"The post cannot be filled by a British executive because it requires a more south-east Asian background.","definition[16]":"to provide a product or service that is needed but is not available or has not been provided before","example[39]":"The product has been researched and developed to fill a gap in the market place.","example[40]":"IBM introduced a mainframe that fills a hole in its product line.","definition[17]":"to provide a service that will deal with a problem","example[41]":"The futures and options business has filled a need for managing the fluctuating exchange rates.","definition[18]":"to supply the goods a customer has ordered","example[42]":"After filling an order for the car from other Eastern European countries, the plant will be shut down."}