{"word[0]":"border","definition[0]":"the official line that separates two countries, states, or areas, or the area close to this line","example[0]":"To cross the border, you will need a valid passport.","example[1]":"the border between the US and Mexico","note[0]":"border between","example[2]":"regular patrols along the border with France","note[1]":"border with","example[3]":"a market town on the border of England and Wales","note[2]":"on the border","example[4]":"He helped them to get across the border.","note[3]":"across the border","example[5]":"The coach took us south of the border to Tijuana.","note[4]":"south/north etc of the border","definition[1]":"a band along or around the edge of something such as a picture or piece of material","example[6]":"writing paper with a black border","definition[2]":"an area of soil where you plant flowers or bushes, along the edge of an area of grass","example[7]":"a flower and shrub border","definition[3]":"something that separates one situation, state etc from another","example[8]":"new scientific discoveries that are stretching the borders of knowledge","collocation[0]":"cross the border","example[9]":"The army crossed the border and advanced on Warsaw.","collocation[1]":"flee/escape across the border","example[10]":"Over 100,000 civilians fled across the border.","collocation[2]":"form the border","example[11]":"The river forms the border between the two countries.","collocation[3]":"close the border","example[12]":"The government moved quickly to close the border.","collocation[4]":"open the border","example[13]":"After fifty years the border was finally opened.","collocation[5]":"straddle the border","example[14]":"This small village straddles the border between the West Bank and Jerusalem.","collocation[6]":"the Welsh/Mexican etc border","example[15]":"I had reached the Swiss border.","collocation[7]":"the southern/eastern etc border","example[16]":"They renewed their attacks on Ethiopia’s northern border.","collocation[8]":"the Austro-Hungarian/Hong Kong–China etc border","example[17]":"The village is on the Oxfordshire-Warwickshire border.","collocation[9]":"a common border","example[18]":"India and Pakistan each withdrew troops from their common border.","form[0]":"border + NOUN","collocation[10]":"a border dispute","example[19]":"a long-running border dispute between Iraq and Iran","collocation[11]":"a border town","example[20]":"the Chinese border town of Shenzhen","collocation[12]":"a border area/region","example[21]":"The Afghan border area is open and wild.","collocation[13]":"a border crossing","example[22]":"There are problems of delays at border crossings.","collocation[14]":"a border guard","example[23]":"the North Korean border guards","collocation[15]":"border controls","example[24]":"Hungary tightened its border controls.","collocation[16]":"this/the other side of the border","example[25]":"Her friend lives on the other side of the border.","definition[4]":"the official line that separates two countries, or the area close to this line","example[26]":"The town lies on the border between Chile and Argentina.","example[27]":"Strasbourg is very close to the German border.","example[28]":"border guards","display[0]":"frontier","definition[5]":"the border","example[29]":"They crossed the Libyan frontier into Egypt.","definition[6]":"the official line that separates states and counties in the US","example[30]":"His family lived across the state line in West Virginia.","display[1]":"boundary","definition[7]":"the line that marks the edge of an area of land that someone owns, or one of the parts of a country","example[31]":"The fence marks the boundary between the two properties.","example[32]":"The Mississippi River forms the boundary between Tennessee and Arkansas.","example[33]":"A road runs along the western boundary of the site.","definition[8]":"if one country, state, or area borders another, it is next to it and shares a border with it","example[34]":"countries that border the Mediterranean","example[35]":"The area borders on the Yorkshire Dales.","note[5]":"border on","definition[9]":"to form a border along the edge of something","example[36]":"a path bordered by a high brick wall"}