{"word[0]":"blast","signpost[0]":"air/wind","definition[0]":"a sudden strong movement of wind or air","example[0]":"A blast of cold air swept through the hut.","note[0]":"blast of","signpost[1]":"explosion","definition[1]":"an explosion, or the very strong movement of air that it causes","example[1]":"A bomb blast completely destroyed the building.","note[1]":"bomb/shotgun/nuclear etc blast","example[2]":"Thirty-six people died in the blast.","note[2]":"in the blast","signpost[2]":"loud noise","definition[2]":"a sudden very loud noise, especially one made by a whistle or horn","example[3]":"a long trumpet blast","note[3]":"long/short blast","example[4]":"The station master gave a blast on his whistle and we were off.","note[4]":"blast on","definition[3]":"a sudden strong expression of a powerful emotion","example[5]":"She was totally unprepared for the blast of criticism she received.","signpost[3]":"gun/bomb","definition[4]":"to damage or destroy something, or to injure or kill someone, using a gun or a bomb","example[6]":"The first shot missed and blasted a hole in the far wall.","example[7]":"The plane was blasted out of the sky by a terrorist bomb.","example[8]":"She blasted her husband with a shotgun because he was having an affair.","note[5]":"blast somebody with something","signpost[4]":"break something into pieces","definition[5]":"to break something into pieces using explosives, especially in order to build something such as a road","example[9]":"A 1.5 km tunnel was blasted through the mountain.","note[6]":"blast something through something","example[10]":"The road will have to be blasted out of solid rock.","note[7]":"blast something out of something","example[11]":"Railway workers had blasted through the mountains 90 years before.","note[8]":"blast through","definition[6]":"to produce a lot of loud noise, especially music","example[12]":"He was woken by the radio alarm clock blasting out rock music.","example[13]":"Dance music blasted from the stereo.","note[9]":"blast from","definition[7]":"to criticize someone or something very strongly – used especially in news reports","example[14]":"Union leaders blasted the government for failing to tackle the jobs crisis.","note[10]":"blast somebody for (doing) something","signpost[5]":"kick/hit a ball","definition[8]":"to hit or kick a ball very hard","example[15]":"With six minutes remaining, he blasted the ball through the Coleraine defences for his 19th goal of the season.","signpost[6]":"air/water","definition[9]":"if air or water is blasted somewhere, or if it blasts somewhere, it moves there with great force","example[16]":"The wind ripped through the trees and blasted a curtain of rain up the meadow.","example[17]":"Icy winds and driving snow blasted through the pine trees.","definition[10]":"to beat another team very easily","example[18]":"The Seahawks were blasted 35–14 by the Broncos.","definition[11]":"used when you are very annoyed about something","example[19]":"Oh blast! I’ve forgotten my key."}