{"word[0]":"parade","definition[0]":"a public celebration when musical bands, brightly decorated vehicles etc move down the street","example[0]":"a victory parade","example[1]":"the St Patrick’s Day parade","definition[1]":"a military ceremony in which soldiers stand or march together so that important people can examine them","example[2]":"a military parade","example[3]":"troops on parade","note[0]":"on parade","definition[2]":"a line of people moving along so that other people can watch them","example[4]":"a fashion parade","definition[3]":"a series of people, events etc that seems to never end","example[5]":"She had a constant parade of young men coming to visit her.","note[1]":"parade of","definition[4]":"a street with a row of small shops","signpost[0]":"protest/celebrate","definition[5]":"to walk or march together to celebrate or protest about something","example[6]":"The marchers paraded peacefully through the capital.","note[2]":"parade around/past etc","signpost[1]":"show something","definition[6]":"if you parade your skills, knowledge, possessions etc, you show them publicly in order to make people admire you","synonym[0]":"show off","example[7]":"Young athletes will get a chance to parade their skills.","signpost[2]":"walk around","definition[7]":"to walk around, especially in a way that shows that you want people to notice and admire you","example[8]":"A trio of girls in extremely tight shorts paraded up and down.","signpost[3]":"show somebody","definition[8]":"if prisoners are paraded on television or through the streets, they are shown to the public, in order to prove that the people holding them are important or powerful","example[9]":"The prisoners were paraded in front of the TV cameras.","signpost[4]":"proudly show","definition[9]":"to proudly show something or someone to other people, because you want to look impressive to them","example[10]":"She paraded her new team.","example[11]":"war medals paraded for public admiration","signpost[5]":"soldiers","definition[10]":"if soldiers parade, or if an officer parades them, they march together so that an important person can watch them"}