{"word[0]":"election","definition[0]":"when people vote to choose someone for an official position","example[0]":"The Labour Party won the 2001 election by a huge majority.","example[1]":"Elections for the state governorship will be on November 25.","definition[1]":"the fact of being elected to an official position","example[2]":"Within three months of his election he was forced to resign.","example[3]":"his election to Parliament","note[0]":"somebody’s election to something","collocation[0]":"have/hold an election","example[4]":"The government plans to hold an election in November.","collocation[1]":"call an election","example[5]":"The prime minister would be unwise to call an election now.","collocation[2]":"win an election","example[6]":"Who do you think will win the election?","collocation[3]":"lose an election","example[7]":"If the party loses the election, they may decide they need a new leader.","collocation[4]":"fight an election","example[8]":"Three independent candidates are also planning to contest the election.","collocation[5]":"run for election","example[9]":"If you plan to stand for election to the committee, you must be nominated by three members.","collocation[6]":"rig an election","example[10]":"He accused the ruling party of rigging the elections.","collocation[7]":"boycott an election","example[11]":"Opposition parties have threatened to boycott the elections.","form[0]":"ADJECTIVES/NOUN + election","example[12]":"The ruling party has promised that the elections will be fair.","example[13]":"These will be the country’s first free multi-party elections.","collocation[8]":"democratic","example[14]":"The unions are calling for democratic elections.","collocation[9]":"a general/national election","example[15]":"Labour’s victory in the general election gave them a huge majority.","collocation[10]":"a local/regional election","example[16]":"The Green Party increased its share of the vote in the French regional elections.","collocation[11]":"a presidential election","example[17]":"He is the Democrat Party’s candidate for the next presidential election.","collocation[12]":"a leadership election","example[18]":"The result of the leadership election will be announced today.","collocation[13]":"a congressional/parliamentary election","example[19]":"People voted overwhelmingly Republican in the last congressional elections.","collocation[14]":"a federal election","example[20]":"The federal elections are scheduled for May 2.","collocation[15]":"a mayoral election","example[21]":"The mayoral elections are due to take place next month.","collocation[16]":"a gubernatorial election","example[22]":"We are still waiting for the result of the gubernatorial election in New Jersey.","form[1]":"election + NOUN","collocation[17]":"an election victory/defeat","example[23]":"He became prime minister after a decisive election victory.","collocation[18]":"the election results","example[24]":"The election results have been coming in all night.","collocation[19]":"an election campaign","example[25]":"The election campaign got off to a bad start.","collocation[20]":"an election candidate","example[26]":"Local party members choose the election candidates.","collocation[21]":"an election promise/pledge","example[27]":"The government has broken all its election promises.","collocation[22]":"an election broadcast","example[28]":"a Conservative Party election broadcast","collocation[23]":"an election rally","example[29]":"He drove to Paris to address an election rally.","collocation[24]":"an election year","example[30]":"The Chancellor won’t raise taxes in an election year.","collocation[25]":"election day/night","example[31]":"We urge all our supporters to get out and vote on election night.","collocation[26]":"election time","example[32]":"I’m sick of all those political pamphlets that come through my door at election time.","collocation[27]":"the run-up to the election","example[33]":"There have been violent street protests in the run-up to the elections.","definition[2]":"an occasion when people choose a government or leader by voting","example[34]":"the American presidential election","example[35]":"South Africa held its first multi-racial elections in 1994.","display[0]":"ballot","definition[3]":"an occasion when the members of an organization vote by marking what they want on a piece of paper, especially to make sure that it is secret","example[36]":"The result of the ballot showed that nurses were not in favour of a strike.","display[1]":"referendum","definition[4]":"an occasion when everyone in a country votes on an important political subject","example[37]":"In the Danish referendum, the people voted ‘no’ to joining the European single currency.","display[2]":"the polls","definition[5]":"the process of voting in a political election – used especially in news reports","example[38]":"4,500,000 voters went to the polls in eight provinces to elect six governors.","display[3]":"show of hands","definition[6]":"an act of voting informally for something by the people in a group raising their hands","example[39]":"May I have a show of hands from all those in favour of the proposal?","definition[7]":"when people vote to choose someone for a job","example[40]":"She was nominated to stand for election as a Coca-Cola director.","example[41]":"Mr Morrow is also up for election to the board of directors at a rival Chicago bank.","example[42]":"Her election to the board expands the members to 16."}