{"word[0]":"effective","definition[0]":"successful, and working in the way that was intended","opposite[0]":"ineffective","example[0]":"The cheaper drugs are just as effective in treating arthritis.","example[1]":"the painting’s highly effective use of colour","example[2]":"Training is often much less effective than expected.","example[3]":"the most effective ways of reducing inner city congestion","explanation[0]":"In everyday English, people usually say that something works (well), rather than say that it is effective:","example[4]":"The cheaper drugs work just as well.","type[0]":"no comparative, not before noun","definition[1]":"if a law, agreement, or system becomes effective, it officially starts","example[5]":"The cut in interest rates is effective from Monday.","note[0]":"effective from","type[1]":"no comparative, only before noun","definition[2]":"real rather than what is officially intended or generally believed","example[6]":"The rebels are in effective control of the city.","collocation[0]":"extremely/highly effective","example[7]":"The company launched a highly effective advertising campaign.","collocation[1]":"an effective way","example[8]":"What’s the most effective way to control crime?","collocation[2]":"an effective method","example[9]":"Exams are not the most effective method of assessing students’ abilities.","collocation[3]":"an effective means","example[10]":"Is reducing the speed limit an effective means of reducing accidents?","collocation[4]":"effective action","example[11]":"The police must take effective action to protect the public.","collocation[5]":"an effective solution","example[12]":"The most effective solution to traffic congestion is to build more roads.","collocation[6]":"an effective treatment","example[13]":"Antibiotics are still the most effective treatment for this disease.","collocation[7]":"an effective system","example[14]":"The country has a simple but effective welfare system.","definition[3]":"working well and producing the result or effect that was wanted or intended","example[15]":"The company mounted a very effective publicity campaign.","example[16]":"The 7% increase in sales shows that the company has become more effective in marketing its services.","type[2]":"not before a noun","example[17]":"The new rates are effective from 22 February.","definition[4]":"real, although not obvious or officially recognized","example[18]":"Following the takeover, they now have effective control of the German computer market."}