{"word[0]":"chair","definition[0]":"a piece of furniture for one person to sit on, which has a back, a seat, and four legs","example[0]":"a kitchen chair","example[1]":"They bought a new table and chairs.","example[2]":"One of the chair legs was broken.","example[3]":"She was sitting on a wooden chair.","note[0]":"on/in a chair","example[4]":"He sat back in his chair.","definition[1]":"the position of being in charge of a meeting or committee, or the person who is in charge of it","example[5]":"Address your questions to the chair, please.","example[6]":"Who will be in the chair at tomorrow’s meeting?","note[1]":"be in the chair","example[7]":"He was nominated as chair of the board of governors.","note[2]":"chair of","definition[2]":"the position of being a university professor","example[8]":"a new Chair of Medicine","collocation[0]":"sit in/on a chair","example[9]":"She sat in her favourite chair.","collocation[1]":"pull/draw up a chair","example[10]":"Pull up a chair and look at these pictures.","collocation[2]":"take a chair","example[11]":"Brian took a chair beside his wife.","collocation[3]":"lean back in your chair","example[12]":"He leant back in his chair and took out his pipe.","collocation[4]":"sink/slump/flop into a chair","example[13]":"Greg groaned and sank into his chair.","collocation[5]":"collapse in/into a chair","example[14]":"Eileen collapsed into a chair and burst out crying.","collocation[6]":"get up from your chair","example[15]":"He got up from his chair and walked to the window.","collocation[7]":"jump up from your chair","example[16]":"‘Look at the time!’ she cried, jumping up from her chair.","collocation[8]":"push back your chair","example[17]":"He pushed back his chair and stood up.","collocation[9]":"lounge in a chair","example[18]":"Everyone was outside, lounging in chairs in the sun.","collocation[10]":"a comfortable chair","example[19]":"The hotel had a TV room with some nice comfy chairs.","collocation[11]":"a hard chair","example[20]":"I sat on a hard chair in the corridor and waited.","collocation[12]":"an empty chair","example[21]":"She came and sat in an empty chair beside me.","collocation[13]":"a wooden/plastic/leather etc chair","example[22]":"In the kitchen was a table with six wooden chairs around it.","collocation[14]":"a folding chair","example[23]":"People were sitting on blankets or folding chairs, listening to the outdoor concert.","form[0]":"chair + NOUN","collocation[15]":"a chair leg/arm/back/seat","example[24]":"The chair leg has broken.","definition[3]":"to be the chairperson of a meeting or committee","example[25]":"The inquiry was chaired by a judge.","definition[4]":"the person who is in charge of a meeting, or the job of being in charge of it","example[26]":"the Chair of the plenary session","example[27]":"If you have strong feelings about a situation, declare an interest and suggest that someone else takes the chair (=takes charge of the meeting).","definition[5]":"the chairman or chairwoman of a company or organization, or the job of chairman or chairwoman","example[28]":"chair of the International Commercial Bank of China","definition[6]":"to be in charge of a meeting","example[29]":"He chaired his first board meeting yesterday afternoon."}