{"word[0]":"random","definition[0]":"happening or chosen without any definite plan, aim, or pattern","example[0]":"The company has introduced random drug testing of its employees.","example[1]":"A few random shots were fired.","example[2]":"We looked at a random sample of 120 families.","example[3]":"a random selection of women who were in the shop","definition[1]":"strange, unusual, or unexpected","example[4]":"She's great - she's just so random!","collocation[0]":"a random sample","example[5]":"A test was carried out on a random sample of the cattle.","collocation[1]":"a random selection","example[6]":"He looked at a random selection of the files.","collocation[2]":"a random number","example[7]":"Pick a random number.","collocation[3]":"a random sequence","example[8]":"They were asked to memorize a random sequence of numbers.","collocation[4]":"random checks/tests","example[9]":"He believes the police should be able to carry out random breath tests.","collocation[5]":"random violence","example[10]":"The family were caught up in the random violence that haunts a neighbourhood ruled by gangs.","collocation[6]":"completely/entirely random","example[11]":"The atomic particles seem to move in a completely random direction.","collocation[7]":"apparently/seemingly random","example[12]":"a wave of apparently random attacks","collocation[8]":"purely/truly random","example[13]":"a purely random sequence of numbers","collocation[9]":"in random order","example[14]":"The names are in random order.","definition[2]":"a sample, check etc in which things or people are chosen without any particular reason or pattern so that they will include a typical mixture of the larger group they represent","example[15]":"The group polled a random sample of US manufacturers.","example[16]":"Pennsylvania conducts random checks on trucks to see that they are properly maintained.","example[17]":"a rule requiring random drug testing of airline employees","definition[3]":"an error etc that happens without any pattern, so it is difficult to say when it will happen again or why it happens","example[18]":"Random errors in the survey will not matter greatly.","definition[4]":"without any particular reason or pattern","example[19]":"Pollsters interviewed 1000 adults picked at random in 50 states."}