{"word[0]":"basic","definition[0]":"forming the most important or most necessary part of something","example[0]":"the basic principles of chemistry","example[1]":"The basic idea is simple.","example[2]":"basic research","example[3]":"basic information","example[4]":"medical techniques basic to the control of infection","note[0]":"basic to","definition[1]":"at the simplest or least developed level","example[5]":"the basic skills of programming","example[6]":"Their knowledge is very basic.","example[7]":"The farm lacks even basic equipment.","definition[2]":"basic rights, needs etc are ones that everyone needs or should have","example[8]":"basic human rights","example[9]":"poor families unable to meet their basic needs","collocation[0]":"the basic idea","example[10]":"The basic idea is that science discovers the truth of how the world works.","collocation[1]":"a basic principle","example[11]":"The basic principles underlying all the systems are the same.","example[12]":"This leaflet has been designed to provide some basic information.","collocation[2]":"basic facts","example[13]":"You should start by giving the basic facts.","collocation[3]":"basic rules","example[14]":"Most people nowadays are aware of some of the basic rules of healthy living.","collocation[4]":"a basic question","example[15]":"The interviewer will ask you some basic questions about your education and work experience.","collocation[5]":"a basic concept","example[16]":"He was unfamiliar with the most basic concepts of chemistry.","collocation[6]":"basic services","example[17]":"They lack basic services such as water and electricity.","example[18]":"We need basic research into the causes of mental illness.","collocation[7]":"a basic ingredient of something","example[19]":"The ability to adapt is a basic ingredient of survival.","definition[3]":"the basic things or information are the ones that are the most necessary, or the ones that you need to know first","example[20]":"Visit our website for some basic facts about healthy eating, exercise and weight control.","example[21]":"Water – indeed everything basic to life here must be brought in by truck.","example[22]":"people's basic needs","display[0]":"fundamental","definition[4]":"more important than anything else – used especially when you want to emphasize what you are saying","example[23]":"The fundamental problem is a lack of resources.","example[24]":"one of the fundamental beliefs of Christianity","example[25]":"These values are fundamental to our society.","display[1]":"essential","definition[5]":"used when talking about a particular thing or feature, which something must have in order to continue. Also used when talking about the main point, difference etc","example[26]":"Freedom of the press is essential to our democracy.","example[27]":"Change and diversity are essential characteristics of the natural world.","example[28]":"The essential point is this: either we act now, or the whole future of our planet is uncertain.","example[29]":"One of the essential differences between humans and computers is that humans are more likely to make mistakes.","display[2]":"central","definition[6]":"very important and having a lot of influence or receiving a lot of attention","example[30]":"Indonesia occupies a central role in this market.","example[31]":"Education is central to government policy.","definition[7]":"Beginner’s All-Purpose Symbolic Instruction Code; a simple computer programming language used especially in personal computers or by students"}