{"word[0]":"message","definition[0]":"a spoken or written piece of information that you send to another person or leave for them","example[0]":"He left a message saying he would probably be a little late.","example[1]":"There’s a message from Karen on the answerphone.","note[0]":"message from","example[2]":"I have an urgent message for you.","note[1]":"message for","definition[1]":"the main or most important idea that someone is trying to tell people about in a film, book, speech etc","example[3]":"The message of the film is that good always triumphs over evil.","example[4]":"The result of this legal battle sends an important message to people in similar situations.","example[5]":"It’s perfectly possible to get your message across (=communicate what you want to say) without being so angry.","example[6]":"They use illustrations to convey their message.","definition[2]":"a piece of written information which appears on a computer screen to tell the user about something, especially a problem","example[7]":"I keep getting an error message when I try to log on.","note[2]":"error/warning message","collocation[0]":"get a message","example[8]":"Didn’t you get my message?","collocation[1]":"send a message","example[9]":"My mum just sent me a text message.","collocation[2]":"leave a message","example[10]":"Please leave a message after the beep.","collocation[3]":"take a message","example[11]":"Ellen isn’t here. Can I take a message?","collocation[4]":"give somebody a message","example[12]":"Just give him the message.","collocation[5]":"pass on/relay/deliver a message","example[13]":"I asked Rob if he would pass on a message for me.","form[0]":"ADJECTIVES/NOUN + message","collocation[6]":"an urgent/important message","example[14]":"an urgent message for the commanding officer","collocation[7]":"a brief/short message","example[15]":"She left a short message on his answering machine.","collocation[8]":"a personal message","example[16]":"It was a personal message from Thomas.","collocation[9]":"a telephone/phone message","example[17]":"There was a telephone message for her to call Harbury.","collocation[10]":"a text message","example[18]":"Her phone kept beeping whenever she got a text message.","collocation[11]":"an email/mail message","example[19]":"Just send me an email message to let me know what time.","collocation[12]":"a secret message","example[20]":"a secret message written in lemon juice","collocation[13]":"a message of support/sympathy/congratulations etc","example[21]":"Other celebrities sent messages of support.","definition[3]":"to send a text message or another electronic message, for example a message on a social networking site","example[22]":"You can message several people at once."}