{"definition[0]":"a physical activity in which people compete against each other","example[0]":"My favourite sports are tennis and swimming.","example[1]":"a sports team","example[2]":"All students are encouraged to take part in a sport.","example[3]":"He picked up the newspaper and turned to the sports pages.","definition[1]":"sports in general","example[4]":"Why is there so much sport on TV?","example[5]":"I always hated sport at school.","signpost[0]":"hunting","definition[2]":"an activity that people do in the countryside, especially hunting or fishing","example[6]":"the sport of falconry","example[7]":"a demonstration by people opposed to blood sports (=sports that involve killing animals)","signpost[1]":"helpful person","definition[3]":"a helpful cheerful person who lets you enjoy yourself","example[8]":"Be a sport and lend me your bike.","note[0]":"be a sport","signpost[2]":"man/boy","definition[4]":"used when speaking to someone, especially a man, in a friendly way","example[9]":"See you later, sport.","definition[5]":"used when speaking to a boy in a friendly way","signpost[3]":"fun","definition[6]":"fun or amusement","example[10]":"Did she torment him merely for sport?","collocation[0]":"play (a) sport","example[11]":"My ambition was to play sport at the highest level.","collocation[1]":"take part in (a) sport","example[12]":"Students are encouraged to take part in a sport of some kind.","collocation[2]":"do sport","example[13]":"I did a lot of sport at school.","collocation[3]":"take up a sport","example[14]":"I took up the sport six years ago.","collocation[4]":"compete in a sport","example[15]":"She competed in various sports when she was young.","form[0]":"ADJECTIVES/NOUN + sport","collocation[5]":"a team sport","example[16]":"I liked playing team sports such as football and rugby.","collocation[6]":"an individual sport","example[17]":"You have to be mentally tough to compete in individual sports.","collocation[7]":"a spectator sport","example[18]":"Football is the most popular spectator sport.","collocation[8]":"competitive sport(s)","example[19]":"Competitive sport teaches valuable lessons which last for life.","collocation[9]":"a contact sport","example[20]":"People get hurt in contact sports, but they also have fun.","collocation[10]":"a winter sport","example[21]":"More and more people are taking up winter sports.","collocation[11]":"an extreme sport","example[22]":"Many teenagers are attracted to extreme sports such as snowboarding.","collocation[12]":"professional sport(s)","example[23]":"The kind of money involved in professional sport makes cheating inevitable.","collocation[13]":"a minority sport","example[24]":"Minority sports rarely feature on TV.","form[1]":"sports + NOUN","example[25]":"A lot of schools have their own sports teams.","collocation[14]":"a sports club","example[26]":"She joined her local sports club.","collocation[15]":"a sports field/ground","example[27]":"The village has its own sports field.","collocation[16]":"a sports event","example[28]":"Is this country able to stage a major sports event?","collocation[17]":"a sports fan","example[29]":"He was a big sports fan.","collocation[18]":"a sports personality","example[30]":"The event will be opened by a well-known sports personality.","collocation[19]":"sports facilities","example[31]":"All our holiday camps have wonderful sports facilities.","collocation[20]":"sports equipment","example[32]":"a new online store selling all kinds of sports equipment","collocation[21]":"a sports injury","example[33]":"The clinic specializes in treating sports injuries.","heading[0]":"places where people do sport","display[0]":"field","definition[7]":"a large area of ground, usually covered with grass, where team sports are played","example[34]":"A few kids were playing on the football field.","example[35]":"a hockey field","display[1]":"stadium","definition[8]":"a large sports field with seats all around it for people to watch team sports or track and field competitions","example[36]":"The atmosphere in the Olympic Stadium was amazing.","example[37]":"a football stadium","definition[9]":"a sports field and the seats and buildings around it, belonging to a particular football, rugby, or cricket team","example[38]":"I met my friends inside the ground.","display[2]":"ballpark/park","definition[10]":"a stadium where baseball is played","example[39]":"Busch Stadium is one of the newest ballparks in Major League.","display[3]":"court","definition[11]":"an area with lines painted on the ground, for tennis, badminton, basketball, or volleyball","example[40]":"The hotel has four tennis courts and a volleyball court.","display[4]":"diamond","definition[12]":"the area in a baseball field that is within the shape formed by the four bases. The diamond can also be the whole field","example[41]":"The pitcher stands in the middle of the diamond.","example[42]":"There’s a playground, a picnic area, and a baseball diamond.","display[5]":"track","definition[13]":"a circular path with lines on it, for running on","example[43]":"In the relay, each runner runs once around the track.","display[6]":"gym","definition[14]":"a room with machines which you can use to do exercises","example[44]":"He spends an hour in the gym every day.","display[7]":"pool/swimming pool","definition[15]":"a place where you can swim","example[45]":"He jumped into the deep end of the pool.","example[46]":"I’ll meet you outside the swimming pool.","display[8]":"sports centre","definition[16]":"a building where you can play many types of indoor sports","example[47]":"Why not do exercise classes at your local sports centre?","display[9]":"health club","definition[17]":"a small sports centre, where you pay to be a member","example[48]":"How much does it cost to join a health club?","definition[18]":"to play together happily","example[49]":"the sight of dolphins sporting amidst the waves"}