{"definition[0]":"harmful, unpleasant, or not wanted","example[0]":"My drinking was starting to have a negative effect on my work.","example[1]":"the negative aspects of ageing","example[2]":"On the negative side, it will cost a lot.","signpost[0]":"not liking somebody/something","definition[1]":"considering only the bad qualities of a situation, person etc and not the good ones","example[3]":"students with a negative attitude to school","example[4]":"They have a uniformly negative image of the police.","example[5]":"Jean rarely sounded so negative about her mother.","signpost[1]":"no/not","definition[2]":"saying or meaning ‘no’","example[6]":"He gave a negative answer without any explanation.","note[0]":"negative answer/reply/response","definition[3]":"containing one of the words ‘no’, ‘not’, ‘nothing’, ‘never’ etc","signpost[2]":"scientific test","definition[4]":"not showing any sign of the chemical or medical condition that was being looked for","example[7]":"The pregnancy test was negative.","example[8]":"A person can be recently infected by HIV and have a negative result.","definition[5]":"a negative charge is carried by electrons","signpost[3]":"number/quantity","definition[6]":"less than zero","synonym[0]":"minus","example[9]":"negative numbers","example[10]":"a negative return on our investment  (=a loss)","signpost[4]":"blood","definition[7]":"used in the names of blood types, meaning not having the Rhesus factor","definition[8]":"an image on a photographic film that shows dark areas as light and light areas as dark, from which the final picture is printed","example[11]":"black and white photographic negatives","definition[9]":"a statement or expression that means ‘no’","opposite[0]":"affirmative","example[12]":"The majority of people, when asked whether or not they are creative, will reply in the negative.","note[1]":"answer/reply in the negative","definition[10]":"something bad or harmful","example[13]":"The negatives outweigh the positives on this issue.","definition[11]":"a negative result from a chemical or scientific test","example[14]":"The test will give a proportion of false negatives.","definition[12]":"to refuse to accept a proposal or request","definition[13]":"to prove something to be untrue","definition[14]":"bad or harmful","example[15]":"The Bank’s refusal to cut interest rates is having a negative effect on the economy.","example[16]":"a negative response","example[17]":"Stock analysts are growing increasingly negative about general insurance stocks.","note[2]":"negative about","example[18]":"The difference between a positive growth rate of 0.5% and a negative rate of 0.5% is so small the average businessman would be unlikely to feel it."}