{"word[0]":"meaning","signpost[0]":"of a word/sign etc","definition[0]":"the thing or idea that a word, expression, or sign represents","example[0]":"I don’t know the precise meaning of the word ‘gleaned’.","note[0]":"meaning of","signpost[1]":"ideas in speech/book etc","definition[1]":"the thoughts or ideas that someone wants you to understand from what they say, do, write etc","example[1]":"The meaning of her words was clear. We’d lost our jobs.","example[2]":"She hardly dared to understand the meaning behind his statement.","note[1]":"meaning behind","signpost[2]":"purpose/special quality","definition[2]":"the quality that makes life, work etc seem to have a purpose or value","example[3]":"Life seemed to have lost its meaning since Janet’s death.","example[4]":"Her studies no longer seemed to have any meaning.","example[5]":"For many people it is religion that gives meaning to their existence.","signpost[3]":"true nature","definition[3]":"the true nature and importance of something","example[6]":"We seem to have forgotten the true meaning of Christmas.","collocation[0]":"have a meaning","example[7]":"The same word may have several different meanings.","collocation[1]":"take on a meaning","example[8]":"The word ‘chaos’ has taken on a special scientific meaning.","collocation[2]":"understand the meaning","example[9]":"The pictures help the children understand the meanings of the words.","collocation[3]":"know the meaning","example[10]":"Do you know the meaning of the word ‘paraphrase’?","collocation[4]":"get somebody’s meaning","example[11]":"He’s not like other people, if you get my meaning.","collocation[5]":"grasp the meaning","example[12]":"She suddenly grasped the meaning of his frantic gestures.","collocation[6]":"carry meaning","example[13]":"In conversation, even a pause may carry meaning.","collocation[7]":"convey meaning","example[14]":"the use of hand signals to convey meaning","collocation[8]":"precise/specific/exact","example[15]":"The term ‘stress’ has a precise meaning to an engineer.","collocation[9]":"a hidden meaning","example[16]":"She felt there was a hidden meaning behind his words.","collocation[10]":"a double meaning","example[17]":"Everything he said had a double meaning.","collocation[11]":"the literal meaning","example[18]":"The literal meaning of ‘telephone’ is ‘far-away sound’.","collocation[12]":"the ordinary meaning","example[19]":"They are a 'nuisance' in the ordinary meaning, not the legal meaning, of that word.","collocation[13]":"the figurative/metaphorical meaning","example[20]":"The expression has a metaphorical meaning.","collocation[14]":"somebody’s/something’s true meaning","example[21]":"Children understand the true meaning of these words.","collocation[15]":"a symbolic meaning","example[22]":"Colours often have symbolic meanings; for example, black signifies grief in Western cultures.","heading[0]":"Sense 2","example[23]":"What do you think is the meaning of the poem?","display[0]":"the gist","definition[4]":"the main idea and meaning of something such as an article or a speech","example[24]":"Read the story quickly first, just to get the gist of it.","example[25]":"I think I understand the gist of what you’re saying.","display[1]":"the drift/your drift","definition[5]":"the main set of ideas involved in something such as an explanation, argument, or account of something – often used when the ideas are not stated directly","example[26]":"The drift of his letter is that he wants to come back.","example[27]":"I don’t quite follow your drift.","display[2]":"the essence","definition[6]":"the most important meaning of something such as an argument or piece of writing","example[28]":"The essence of what he is saying is that human character is formed by society.","display[3]":"the thrust","definition[7]":"the most important message of an argument, explanation etc, especially when it consists of a set of connected ideas leading to a final answer or idea","example[29]":"The overall thrust of her argument is that we need to do more to protect our environment.","display[4]":"the substance","definition[8]":"the most important ideas contained in an argument or piece of writing","example[30]":"The substance of Marx’s views is the same in both of these books.","example[31]":"His article lacks substance  (=there are no interesting or important ideas in it).","display[5]":"the implication","definition[9]":"the meaning of what someone says, writes etc that is not stated directly, but that people are expected to understand","example[32]":"The implication was that they did not consider Harrison to be trustworthy."}