{"word[0]":"frighten","definition[0]":"to make someone feel afraid","synonym[0]":"scare","example[0]":"Don’t stand so near the edge! You’re frightening me.","example[1]":"She was frightened by the anger in his eyes.","example[2]":"Computers used to frighten me, but not now.","example[3]":"He drove at a speed which frightened Lara to death.","note[0]":"frighten somebody to death/frighten the life out of somebody","example[4]":"The thought of being in court frightened him.","definition[1]":"to frighten someone. Scare is less formal than frighten, and is the usual word to use in everyday English","example[5]":"He was driving fast just to scare us.","example[6]":"It scared him to think that his mother might never recover.","display[0]":"terrify","definition[2]":"to make someone feel extremely frightened","example[7]":"The idea of going down into the caves terrified her.","example[8]":"Robbers terrified bank staff by threatening them at gunpoint.","display[1]":"give somebody a fright","definition[3]":"to make someone suddenly feel frightened in a way that makes their heart beat more quickly","example[9]":"It gave me a terrible fright when I found him unconscious on the floor.","display[2]":"give somebody the creeps","definition[4]":"if a person or place gives you the creeps, they make you feel slightly frightened because they are strange","example[10]":"This house gives me the creeps.","display[3]":"startle","definition[5]":"to frighten someone. Used when you suddenly see someone and did not know they were there, or when you suddenly hear something","example[11]":"I’m sorry. I didn’t mean to startle you.","example[12]":"The noise startled him, and he dropped his glass on the floor.","display[4]":"alarm","definition[6]":"to make someone feel frightened and worried that something bad might happen","example[13]":"I didn’t want to alarm her by calling in the middle of the night.","display[5]":"intimidate","definition[7]":"to deliberately frighten someone, especially so that they will do what you want","example[14]":"Many of the gangs were using dogs to intimidate people."}