{"word[0]":"freedom","definition[0]":"the right to do what you want without being controlled or restricted by anyone","example[0]":"People here like their freedom and privacy.","example[1]":"the rights and freedoms of citizens","example[2]":"We do not have the freedom to do just what we like.","note[0]":"freedom to do something","example[3]":"the freedom to vote","example[4]":"Tighter security measures are restricting our freedom of movement  (=the right to travel).","note[1]":"freedom of","example[5]":"The First Amendment guarantees freedom of expression.","definition[1]":"the state of being free and allowed to do what you want","example[6]":"He thinks children have too much freedom these days.","example[7]":"Tracksuits are designed to give you freedom of movement  (=the ability to move your body freely).","example[8]":"The wheelchair gives him the freedom to go out on his own.","definition[2]":"the state of being free because you are not in prison","opposite[0]":"captivity","example[9]":"The prisoner was recaptured after only 48 hours of freedom.","collocation[0]":"total/complete freedom","example[10]":"Riding a motorbike gives me a feeling of total freedom.","collocation[1]":"great/considerable freedom","example[11]":"Teachers are given considerable freedom to choose their teaching methods.","collocation[2]":"personal/individual freedom","example[12]":"Our personal freedom is being restricted more and more.","collocation[3]":"political/religious freedom","example[13]":"The people were given political freedom for the first time in the country's history.","collocation[4]":"academic freedom","example[14]":"She refused, on the grounds of academic freedom, to amend the course.","collocation[5]":"artistic freedom","example[15]":"Banning the film would be an unacceptable restriction on artistic freedom.","collocation[6]":"have the freedom to do something","example[16]":"We have the freedom to travel nearly anywhere in the world.","collocation[7]":"enjoy freedom","example[17]":"Filmmakers today enjoy more freedom than in the past.","collocation[8]":"the struggle/fight for freedom","example[18]":"The student movement played an important role in the struggle for political freedom.","collocation[9]":"freedom of speech/expression","example[19]":"We will defend freedom of speech and oppose censorship.","collocation[10]":"freedom of religion/worship","example[20]":"Liberal newspapers made an effort to secure religious toleration and freedom of worship.","collocation[11]":"freedom of movement","example[21]":"Thanks to the automobile, Americans had a previously unknown freedom of movement.","example[22]":"The tight uniforms restrict their freedom of movement.","collocation[12]":"freedom of assembly","example[23]":"Restrictions on freedom of assembly were gradually relaxed.","collocation[13]":"the freedom of the press","example[24]":"The freedom of the press is written into the country's constitution."}