{"word[0]":"stage","signpost[0]":"time/state","definition[0]":"a particular time or state that something reaches as it grows or develops","example[0]":"We’re getting to the stage where we hardly ever go out together.","example[1]":"the early stages of a child’s development","note[0]":"stage of/in","example[2]":"It’s a good move at this stage in his career.","signpost[1]":"part of process","definition[1]":"one of the parts which something such as a competition or process is divided into","example[3]":"The next stage is to complete an application form.","example[4]":"We’re now reaching the end of stage three of the construction.","note[1]":"stage two/six etc","example[5]":"The team reached the semi-final stage of the competition.","note[2]":"stage of","example[6]":"The rest of the money will be paid in stages  (=a small amount at a time).","note[3]":"in stages","signpost[2]":"theatre","definition[2]":"the raised area in a theatre which actors or singers stand on when they perform","example[7]":"She is on stage for most of the play.","note[4]":"on stage","example[8]":"She appeared on stage with George Michael.","definition[3]":"a place or area of activity where something important happens","example[9]":"He’s an experienced campaigner on the world stage.","note[5]":"on the world/international/political etc stage","example[10]":"important figures on the European political stage","example[11]":"Geneva has been the stage for many such conferences.","note[6]":"stage for","heading[0]":"– Meaning 1: a particular time or state that something reaches as it grows or develops","collocation[0]":"the early/initial stages","example[12]":"Sometimes there are problems in the early stages of a project.","collocation[1]":"the later/final/closing stages","example[13]":"She was well cared for during the final stages of her life.","collocation[2]":"the halfway stage","example[14]":"He was in the lead at the halfway stage.","collocation[3]":"an advanced stage","example[15]":"Negotiations are at an advanced stage.","collocation[4]":"a new stage","example[16]":"It marked the beginning of a new stage in my life.","collocation[5]":"a critical/crucial stage","example[17]":"The football season is reaching a crucial stage.","collocation[6]":"a formative stage","example[18]":"This plan is still in its formative stages.","collocation[7]":"a difficult/an awkward stage","example[19]":"He was 13 and going through that awkward stage.","collocation[8]":"reach/get to a stage","example[20]":"We have reached the stage where no-one is safe to walk our streets at night.","collocation[9]":"enter a stage","example[21]":"He is entering a new stage of his career.","collocation[10]":"go through a stage","example[22]":"Most young people go through a rebellious stage.","collocation[11]":"mark a stage","example[23]":"The election marks an important stage in the rebuilding of the country.","collocation[12]":"take something a stage further","example[24]":"We then took the experiment a stage further.","collocation[13]":"a stage of development","example[25]":"We have several ideas in various stages of development.","collocation[14]":"at one stage","example[26]":"At one stage I had to tell him to calm down.","collocation[15]":"at some stage","example[27]":"Four out of ten people are likely to contract cancer at some stage in their lives.","collocation[16]":"at this/that stage","example[28]":"At this stage his wife did not realise he was missing.","collocation[17]":"at an early/late stage","example[29]":"I can’t change my plans at this late stage.","collocation[18]":"at a later stage","example[30]":"These points will be dealt with at a later stage.","heading[1]":"– Meaning 3: the raised area in a theatre which actors or singers stand on when they perform","collocation[19]":"be on stage","example[31]":"He was on stage for most of the first act.","collocation[20]":"appear on stage","example[32]":"Recently she has appeared on stage in 'Private Lives'.","collocation[21]":"go/come on stage","example[33]":"I never drink before going on stage.","collocation[22]":"walk on stage/onto the stage","example[34]":"The audience broke into applause as soon as he walked on stage.","collocation[23]":"take the stage","example[35]":"The Charlatans took the stage in LA yesterday.","collocation[24]":"leave the stage","example[36]":"Everyone except the main character gradually leaves the stage.","collocation[25]":"come off stage","example[37]":"I came off stage last night and just collapsed in a heap.","collocation[26]":"walk off the stage","example[38]":"The pianist walked off the stage after playing only a few notes.","definition[4]":"one of several parts of a long process, which happen one after another","example[39]":"At this stage of the election campaign, it is impossible to predict who will win.","example[40]":"She is still in the early stages of pregnancy.","example[41]":"Piaget famously divided childhood into four separate stages.","example[42]":"the opening stages of the race","definition[5]":"one of the parts of a process that you have to do or deal with in order to go on to the next one","example[43]":"The first step is to make a list of what you need.","example[44]":"What’s the next step?","example[45]":"You have to do this one step at a time.","display[0]":"phase","definition[6]":"one of the clearly separate stages of a process or activity, during which a type of activity takes place that is different from those in other phases","example[46]":"the initial phase of the campaign","example[47]":"They were now entering the final phase of their journey.","display[1]":"round","definition[7]":"one of the parts that an event or activity is divided into, especially talks or a sports competition","example[48]":"the first round of the negotiations","example[49]":"the final round of the competition","example[50]":"The next round of the trade talks will be held in Geneva.","definition[8]":"a specific time or moment during the course of something","example[51]":"What do you really want at this point in your life?","example[52]":"By this point they were starting to feel more confident.","definition[9]":"to organize a public event","example[53]":"exhibitions staged in Paris","example[54]":"The candidates’ public appearances were carefully staged (=not natural).","example[55]":"Activists staged a protest outside the parliament.","note[7]":"stage a strike/demonstration/sit-in etc","definition[10]":"one of several points that something reaches as it grows or develops","example[56]":"The plan is still in its early stages.","example[57]":"It would be unwise to comment at this stage of the negotiations.","example[58]":"The equipment can be purchased in stages as funds become available.","definition[11]":"a place where something important happens","definition[12]":"to organize an event that people will come to see, or that you hope many people will notice","example[59]":"The exhibition is the biggest event of its kind to be staged in Britain.","example[60]":"Employees staged a one-day strike.","definition[13]":"to make something happen, or to start happening","example[61]":"The shares staged a recovery (=became stronger again after a difficult period of time) and closed just 4p lower at 664p."}