{"word[0]":"put up","signpost[0]":"build","definition[0]":"to build something such as a wall, fence, building etc","synonym[0]":"erect","example[0]":"They’re putting up several new office blocks in the centre of town.","signpost[1]":"for people to see","definition[1]":"to put a picture, notice etc on a wall so that people can see it","example[1]":"Can I put up some posters?","example[2]":"The shops have started to put up Christmas decorations.","signpost[2]":"attach something","definition[2]":"to attach a shelf, cupboard etc to a wall","example[3]":"My dad put up five shelves.","definition[3]":"to increase the cost or value of something","example[4]":"Most big stores admit they daren’t put prices up for fear of losing their customers.","definition[4]":"to raise something to a higher position","example[5]":"I put up my hand and asked to leave the room.","example[6]":"Philip put his hood up because it was raining.","signpost[3]":"let somebody stay","definition[5]":"to let someone stay in your house and give them meals","example[7]":"I was hoping Kenny could put me up for a few days.","signpost[4]":"stay somewhere","definition[6]":"to stay in a place for a short time","example[8]":"We can put up at a hotel for the night.","note[0]":" at/in/with","definition[7]":"to show great determination to oppose something or get out of a difficult situation","example[9]":"Gina put up a real fight to overcome the disease.","example[10]":"The rebels have put up fierce resistance.","definition[8]":"to give an amount of money for a particular purpose","example[11]":"The paper put up a reward for information on the murder.","signpost[5]":"make available","definition[9]":"to make something or someone available for a particular purpose","example[12]":"They put their house up for sale.","note[1]":"put something up for","example[13]":"The baby was put up for adoption.","definition[10]":"to explain a suggestion or idea so that other people can think about it or discuss it","example[14]":"If you can put up a good enough case, the board will provide the finance.","signpost[6]":"elections","definition[11]":"to suggest someone as a suitable person to be elected to a position","example[15]":"I was put up for the committee.","definition[12]":"used to tell someone that they should either do what needs to be done or stop talking about it","definition[13]":"to increase the price, cost, or value of something","example[16]":"The bank put up its interest rates by 1%.","example[17]":"My landlord is putting the rent up.","definition[14]":"to provide an amount of money for a particular purpose, especially to start a business","example[18]":"He has agreed to put up $750 million for a 15% stake in the consortium.","example[19]":"Nearly £5 billion has been put up by private investors.","definition[15]":"if you put up an asset as collateral for a loan, you obtain the loan on condition that the lender has the right to take and sell this asset if you fail to repay the loan","example[20]":"The bank refused to give him a loan until he put his home up as collateral."}