{"word[0]":"declare","signpost[0]":"state officially","definition[0]":"to state officially and publicly that a particular situation exists or that something is true","example[0]":"A state of emergency has been declared.","example[1]":"Mr Steel has been declared bankrupt (=it has been officially stated that he cannot pay his debts).","example[2]":"We celebrate September 16, the day when Mexico declared independence from Spain  (=officially stated that it was no longer ruled by Spain).","example[3]":"The war was declared illegal by the International Court of Justice.","note[0]":"declare something illegal/invalid etc","example[4]":"The court declared that Brown’s case should be reviewed.","note[1]":"declare that","example[5]":"Several countries wanted Antarctica to be declared a ‘world park’.","note[2]":"declare somebody/something (to be) somebody/something","example[6]":"The city was declared to be in a state of siege.","example[7]":"I declare you man and wife.","signpost[1]":"state what you think","definition[1]":"to say publicly what you think or feel","example[8]":"‘It’s not fair, ’ Jane declared.","example[9]":"He declared his intention to stand for president.","example[10]":"Carol held a press conference and declared that she was innocent.","example[11]":"Edward declared himself angry and frustrated.","note[3]":"declare yourself (to be) something","signpost[2]":"money/property etc","definition[2]":"to state on an official government form how much money you have earned, what property you own etc","example[12]":"All tips are counted as part of your earnings and must be declared.","definition[3]":"to tell a customs official that you are carrying goods on which you should pay tax when you enter a country","signpost[3]":"cricket","definition[4]":"to choose to end your team’s turn before all your players have batted","definition[5]":"to make something known officially to the public","example[13]":"Shares in the company, which declared a £216 million loss, fell 712p to 334p.","example[14]":"Two dominant companies have declared major redundancy programmes in the course of restructuring.","definition[6]":"to officially state that you are connected with something and that this might affect the decisions you make about it","example[15]":"If a director is involved in any way with the contractor, he or she is required to declare his interest at the meeting of the board.","definition[7]":"to state officially that a person or company is unable to pay all their debts","example[16]":"The consequences of being declared bankrupt would be harsh and severe.","definition[8]":"to state officially that you are unable to pay your debts","example[17]":"The new law established a mechanism to declare bankruptcy.","definition[9]":"to state whether or not you are accepting an OPTION that you hold","definition[10]":"when a company declares a DIVIDEND, it says that it will pay a dividend to its shareholders","example[18]":"Before declaring a dividend, the trustee must give notice of his intention to do so to all creditors.","definition[11]":"to make an official statement saying how much money you have earned, what property you own etc","example[19]":"A lot of childcare is in the black economy, with carers not declaring their cash payments.","example[20]":"Rent received from the property must be declared for tax.","definition[12]":"to formally say that something is done, open, closed etc","example[21]":"I now declare this factory open.","example[22]":"Anything else? No? Then I declare the meeting closed."}