{"word[0]":"clash","definition[0]":"if two armies, groups etc clash, they start fighting – used in news reports","example[0]":"Troops clashed near the border.","example[1]":"Police have clashed with demonstrators again today.","note[0]":"clash with","definition[1]":"if two people or groups clash, they argue because they have very different beliefs and opinions – used in news reports","example[2]":"Democrats clashed with Republicans in a heated debate.","example[3]":"The two men have clashed over the report’s conclusions.","note[1]":"clash over/on","definition[2]":"if two colours or designs clash, they look very bad together","example[4]":"I can’t wear red – it clashes with my hair.","definition[3]":"if two events clash, they happen at the same time in a way that is inconvenient","example[5]":"The announcement has been delayed to avoid clashing with the prime minister’s speech.","definition[4]":"if two pieces of metal clash, or if you clash them, they make a loud ringing sound","example[6]":"The cymbals clashed.","definition[5]":"a short fight between two armies or groups – used in news reports","example[7]":"armed clashes along the border","example[8]":"violent clashes between police and demonstrators","note[2]":"clash between/with","definition[6]":"an argument between two people or groups because they have very different beliefs or opinions – used in news reports","note[3]":"personality/culture clash (=a situation in which two people or groups do not like each other)","example[9]":"The plans put oil companies in a head-on clash with environmentalists.","definition[7]":"a sports match between two teams, players etc that is expected to be very exciting – used in sports reports","example[10]":"The heavyweight clash goes ahead in Las Vegas on 8 May.","definition[8]":"a situation in which two events happen at the same time in a way that is inconvenient","example[11]":"a scheduling clash on TV","definition[9]":"a loud sound made by two metal objects hitting each other","example[12]":"the clash of swords","definition[10]":"a combination of two colours, designs etc that look bad together","example[13]":"a colour clash","collocation[0]":"a violent clash","example[14]":"Four people were killed during violent clashes with the army.","collocation[1]":"a fierce/bitter clash","example[15]":"Fierce clashes swept across Bosnia and Croatia.","collocation[2]":"a serious clash","example[16]":"This was one of the most serious clashes since the two countries agreed to a ceasefire.","collocation[3]":"a minor clash","example[17]":"Minor clashes were reported to have taken place between police and students.","collocation[4]":"an armed clash","example[18]":"The violence could soon become armed clashes and even a war.","collocation[5]":"an ethnic clash","example[19]":"20 people died in ethnic clashes before Christmas.","collocation[6]":"lead to a clash","example[20]":"The anti-war protests led to violent clashes between police and demonstrators.","collocation[7]":"a clash occurs","example[21]":"A number of clashes occurred throughout the south between these opposing groups.","collocation[8]":"a clash breaks out","example[22]":"Armed clashes broke out on Tuesday between the military and the rebels.","collocation[9]":"a clash takes place","example[23]":"Fierce clashes took place with local police.","collocation[10]":"be killed/injured in a clash","example[24]":"Eight people were killed in clashes between the army and police.","definition[11]":"a British punk band which started performing in 1976. Their albums include The Clash and London Calling. Their success continued even when  punk was no longer fashionable."}