{"definition[0]":"not inside a building","example[0]":"When we got up, it was still dark outside.","example[1]":"Go and play outside.","definition[1]":"not inside a building or room but close to it","example[2]":"Could you wait outside please.","example[3]":"I’ll meet you outside the theatre at two o'clock.","example[4]":"Several people were standing in the hallway outside of his room.","note[0]":"outside of","definition[2]":"out of a building or room","example[5]":"We went outside to see what was happening.","example[6]":"I opened the door and looked outside.","definition[3]":"not in a particular city, country etc","example[7]":"She often travels outside the UK.","definition[4]":"close to a place, city etc but not in it","example[8]":"We camped a few miles outside the town.","example[9]":"Bolton is a mill town just outside Manchester.","example[10]":"Maritza, 19, lives in Everett, outside of Boston.","definition[5]":"beyond the limits or range of a situation, activity etc","opposite[0]":"within","example[11]":"It’s outside my experience, I’m afraid.","example[12]":"children born outside of marriage","definition[6]":"if someone is outside a group of people, an organization etc, they do not belong to it","example[13]":"Few people outside the government realized what was happening.","example[14]":"The university administrators ignored criticism from outside.","note[1]":"from outside (something)","example[15]":"Management consultants were brought in from outside the company.","definition[7]":"if the time that someone takes to do something, especially finish a race, is outside a particular time, it is greater than that time","example[16]":"He finished in 10 minutes 22.4 seconds, 4 seconds outside the record.","definition[8]":"not inside a building, but usually close to it","example[17]":"Why don’t you go outside and play?","example[18]":"He was standing outside, smoking a cigarette.","display[0]":"out","definition[9]":"outside – used mainly before the following prepositions or adverbs","example[19]":"We slept out under  the stars.","example[20]":"Don’t stand out in the rain – come inside.","example[21]":"I can hear somebody out there.","display[1]":"outdoors/out of doors","definition[10]":"away from buildings and in the open air – used especially when talking about pleasant or healthy things you do outside","example[22]":"In the summer, we like to eat outdoors.","example[23]":"Kids should spend as much time out of doors as possible.","display[2]":"in the open air","definition[11]":"outside where the air is fresh","example[24]":"It’s good to exercise in the open air.","example[25]":"Leave the wood to dry slowly in the open air.","display[3]":"al fresco","definition[12]":"outside – used when talking about eating outside","example[26]":"We prefer to dine al fresco.","opposite[1]":"inside","example[27]":"We turned off the outside lights and went to bed.","example[28]":"The house will need a lot of outside repairs before we can sell it.","definition[13]":"involving people who do not belong to the same group or organization as you","example[29]":"Outside observers said the election was free and fair.","example[30]":"Consultants were brought in to provide some outside advice."}