{"word[0]":"ghost","signpost[0]":"spirit","definition[0]":"the spirit of a dead person that some people think they can feel or see in a place","example[0]":"They say the young girl’s ghost still haunts (=often appears in) the house.","example[1]":"He looked as if he’d seen a ghost (=he looked very frightened).","example[2]":"the ghost of Old Tom Morris","note[0]":"ghost of","signpost[1]":"memory/effect","definition[1]":"the memory or effect of someone or something bad that lived, existed, or happened in the past","example[3]":"The ghost of Stalinism still affects life in Russia today.","signpost[2]":"television/computer","definition[2]":"a second image that is not clear on a television or computer screen","example[4]":"His ghost is believed to haunt the house.","definition[3]":"a creature without a physical body, such as an angel or ghost","example[5]":"evil spirits","example[6]":"the spirit world","display[0]":"apparition","definition[4]":"an image of a dead person that someone sees suddenly for a short time","example[7]":"He claimed to have seen an apparition in the church.","display[1]":"poltergeist","definition[5]":"a ghost that people cannot see, which throws things or moves things around","example[8]":"The house was haunted by a poltergeist that makes things move around all by themselves, sometimes quite big things like beds or wardrobes.","display[2]":"spook","definition[6]":"a ghost","example[9]":"I’m not scared of spooks.","display[3]":"phantom","definition[7]":"a frightening and unclear image of a dead person","example[10]":"They had seen phantoms gliding on the surface of the water.","display[4]":"spectre","definition[8]":"a ghost, especially a frightening one","example[11]":"She had looked like a spectre.","example[12]":"The following night, the spectre appeared again.","definition[9]":"to write something as a ghost writer","definition[10]":"people who are listed as workers on a company’s books and PAYROLL, but who do not do any work for the company","example[13]":"Some contractors, in the interest of labor harmony, hire ghosts.","example[14]":"Exhibitors complained that their bills are inflated byghost workers supposedly employed by the exhibition centre.","definition[11]":"to write something as a GHOSTWRITER","example[15]":"She received a generous advance fee for the book she’s ghosting."}