{"word[0]":"sorry","comparative[0]":"sorrier","superlative[0]":"sorriest","signpost[0]":"ashamed","definition[0]":"feeling ashamed or unhappy about something bad you have done","example[0]":"It was probably too late to say sorry, but she would try anyway.","note[0]":"say (you are) sorry","example[1]":"She was genuinely sorry for what she had done.","note[1]":"sorry for something","example[2]":"Casey was sorry he’d gotten so angry.","note[2]":"sorry (that)","signpost[1]":"sad/disappointed","definition[1]":"feeling sad about a situation, and wishing it were different","example[3]":"I was sorry to hear about your accident.","note[3]":"sorry to hear/see/learn","example[4]":"Brigid was always sorry she hadn’t kept up her piano lessons.","example[5]":"We were sorry to miss your concert.","note[4]":"sorry to do something","example[6]":"I won’t be sorry to leave this place.","example[7]":"I’m so sorry about your father  (=sorry something bad has happened to him).","note[5]":"sorry about","definition[2]":"very bad, especially in a way that makes you feel pity or disapproval","example[8]":"the sorry state of the environment","example[9]":"It’s a sorry state of affairs when an old lady has to wait 12 hours to see a doctor.","example[10]":"the sorry sight of so many dead animals","example[11]":"This whole sorry episode (=bad thing that happened) shows just how incompetent the government has become.","heading[0]":"GRAMMAR: Patterns with sorry","explanation[0]":"You are sorry about something bad that has happened","example[12]":"I’m sorry about what I said","example[13]":"I’m sorry about your car  (=sorry that your car has been damaged)","explanation[1]":"You are sorry for the delay, the inconvenience, or the trouble","example[14]":"The next train will arrive in 12 minutes We are sorry for the delay","explanation[2]":"You are sorry for doing something bad","example[15]":"I’m sorry for upsetting you","explanation[3]":"You are sorry that  you did something or sorry that something happened  ‘That’ can be omitted","example[16]":"I’m sorry that I can’t come","example[17]":"I’m sorry you didn’t get the job","bad_example[0]":"I’m sorry for I can’t come","explanation[4]":"If you are sorry to do something, it makes you sad to do it","example[18]":"I’ll be sorry to leave this place","bad_example[1]":"I’ll be sorry for leaving this place","definition[3]":"used to ask someone to repeat something that you have not heard properly","synonym[0]":"pardon","example[19]":"Sorry? What was that again?","example[20]":"‘Want a drink?’ ‘Sorry?’ ‘I said, would you like a drink?’"}