{"word[0]":"ladder","definition[0]":"a piece of equipment used for climbing up to or down from high places. A ladder has two bars that are connected by rungs (=short bars that you use as steps)","example[0]":"She climbed up the ladder.","example[1]":"He hurt himself falling off a ladder.","definition[1]":"a series of levels which someone moves up and down within an organization, profession, or society","example[2]":"Becoming a doctor would be a step up the social ladder.","example[3]":"the first step on the ladder of success","example[4]":"Stevens slowly worked his way up the corporate ladder.","note[0]":"career/corporate ladder","definition[2]":"a long thin hole in stockings or tights where some stitches have broken","example[5]":"Yes, I know I’ve got a ladder in my tights.","collocation[0]":"climb (up/down) a ladder","example[6]":"He climbed the ladder up to the diving platform.","collocation[1]":"go up/down a ladder","example[7]":"Be careful going down the ladder!","collocation[2]":"come up/down a ladder","example[8]":"Dickson came up the ladder from the engine room.","collocation[3]":"descend a ladder","example[9]":"He closed the hatch and descended the ladder.","collocation[4]":"fall off a ladder","example[10]":"One of the builders fell off a ladder and broke his leg.","collocation[5]":"a rung of a ladder","example[11]":"The first rung of the ladder was broken.","collocation[6]":"a step of a ladder","example[12]":"The can of paint was balanced on one of the steps of the ladder.","collocation[7]":"the foot of a ladder","example[13]":"Zach waited at the foot of the ladder while Sam climbed up.","collocation[8]":"the bottom/top of a ladder","example[14]":"She sighed with relief when she reached the bottom of the ladder.","definition[3]":"if stockings or tights ladder, or if you ladder them, a long thin hole is made in them because some stitches have broken","definition[4]":"a series of levels within an organization or profession, which people move up and down","example[15]":"He is moving swiftly up the corporate ladder."}