{"word[0]":"session","definition[0]":"a period of time used for a particular activity, especially by a group of people","example[0]":"a training session for teachers about computers","example[1]":"question-and-answer sessions","example[2]":"a session of group therapy","note[0]":"session of","definition[1]":"a formal meeting or group of meetings, especially of a law court or parliament","example[3]":"the first televised session of parliament","example[4]":"The court is now in session.","note[1]":"in session","example[5]":"Board members met in closed session  (=with nobody else present).","definition[2]":"a part of the year when classes are given at a college or university","form[0]":"ADJECTIVES/NOUN + session","collocation[0]":"a training session","example[6]":"Every training session starts with a series of exercises.","collocation[1]":"a practice session","example[7]":"He crashed during a practice session before this Sunday's Belgian Grand Prix.","collocation[2]":"a question-and-answer session","example[8]":"His talk was followed by a question and answer session.","collocation[3]":"a photo session","example[9]":"I normally have two or three photo sessions a week.","collocation[4]":"a therapy/counselling session","example[10]":"At one point his parents joined him for a family therapy session.","collocation[5]":"a brainstorming session","example[11]":"I think we should just get together and have a brainstorming session.","collocation[6]":"have a session","example[12]":"We had a special training session yesterday.","collocation[7]":"do a session","example[13]":"We're doing a photo session tomorrow.","collocation[8]":"attend a session","example[14]":"Some doctors require patients to attend counselling sessions.","definition[3]":"a period of time, usually a day, when buying and selling takes place on the stockmarket","example[15]":"The Euro slid sharply in the European trading session.","example[16]":"Stock prices sank for the fourth consecutive session.","definition[4]":"a meeting used by a group of people for a particular purpose","example[17]":"After theopening session we run a series of workshops.","example[18]":"There’s no substitute for thorough preparation before a negotiation session with the client.","definition[5]":"a formal meeting or group of meetings, especially of a court or a parliament","example[19]":"Morocco and Tunisia are host to the next two sessions of the trade talks.","example[20]":"The European parliament is in session in Strasbourg."}