{"word[0]":"cheap","comparative[0]":"cheaper","superlative[0]":"cheapest","signpost[0]":"low price","definition[0]":"not at all expensive, or lower in price than you expected","example[0]":"cheap rail fares","example[1]":"the cheapest TV on the market","example[2]":"Property is cheaper in Spain than here.","example[3]":"a cheap shop  (=one that sells goods cheaply)","example[4]":"The equipment is relatively cheap and simple to use.","example[5]":"This coat was dirt cheap (= very cheap - an informal expression)","example[6]":"a cheap and cheerful Italian restaurant","note[0]":"cheap and cheerful","signpost[1]":"bad quality","definition[1]":"low in price and quality","example[7]":"Cheap wine gives me a headache.","example[8]":"cheap jewellery","example[9]":"The furniture looked cheap and nasty.","example[10]":"a cheap imitation of the real thing","signpost[2]":"not expensive to use","definition[2]":"not costing much to use or to employ","synonym[0]":"inexpensive","example[11]":"Gas appliances are usually cheaper to run than electric ones.","note[1]":"cheap to run/use/maintain etc","example[12]":"For the employer, a part-time workforce means a cheap labour supply.","signpost[3]":"not deserving respect","definition[3]":"showing a lack of honesty, moral principles, or sincere feelings, so that you do not deserve respect","example[13]":"She felt cheap and stupid, like a naughty child caught stealing.","example[14]":"You’re lying, aren’t you? You’re so cheap.","example[15]":"His remark was a cheap shot at short people.","example[16]":"another cheap political stunt","example[17]":"It was nothing but a cheap trick (=unkind trick).","signpost[4]":"not generous","definition[4]":"not liking to spend money","example[18]":"She’s too cheap to take a cab.","definition[5]":"costing very little money, or less than you expected","example[19]":"My shoes were really cheap – they only cost £25.","example[20]":"The cheapest way to get to Chicago is to take the bus.","example[21]":"cheap flights","definition[6]":"low prices, rents, and fees do not cost a lot of money. Do not use cheap with these words","example[22]":"Why is the share price so low?","example[23]":"You could get equally good accommodation elsewhere at a lower rent.","definition[7]":"not expensive – use this especially about things that are of good quality, even though they do not cost a lot","example[24]":"The furniture is inexpensive, but well made.","example[25]":"a simple inexpensive meal","example[26]":"a hotel that offers air-conditioned rooms at relatively inexpensive prices","display[0]":"reasonable","definition[8]":"a reasonable price seems fair because it is not too high","example[27]":"The restaurant serves good food at reasonable prices.","example[28]":"Only £25 a night? That sounds reasonable.","display[1]":"economical","definition[9]":"cheap because you do not need to use a lot of money or fuel","example[29]":"an economical car","example[30]":"It is usually more economical to buy in large quantities.","display[2]":"affordable","definition[10]":"cheap enough for most people to be able to buy or pay for","example[31]":"affordable housing","example[32]":"Single mothers often have trouble finding affordable childcare.","example[33]":"The shop sells designer fashions at affordable prices.","display[3]":"competitive","definition[11]":"competitive prices and rates are as low as those charged by other shops or companies","example[34]":"I think you’ll find our prices are extremely competitive.","example[35]":"The hotel offers a high standard of service at very competitive rates.","display[4]":"budget","definition[12]":"budget flights, airlines, hotels etc have especially low prices","example[36]":"You can get a budget flight to Amsterdam for only £19.","example[37]":"a list of budget hotels for under $50 a night","example[38]":"budget accommodation for families with young children","display[5]":"be good/great value","definition[13]":"to be worth at least the price you pay for it, so that you feel pleased and think you have spent your money well","example[39]":"The meals at Charlie’s Pizza are really good value.","example[40]":"The holiday is great value for money.","display[6]":"be a bargain","definition[14]":"to be extremely cheap","example[41]":"I got this shirt when I was in Indonesia. It was a real bargain.","definition[15]":"at a low price","example[42]":"Air fares to Africa don’t come cheap (=are expensive).","example[43]":"I bought this house because it was going cheap (=selling for a lower price than usual).","example[44]":"She used to get meat cheap at the butcher’s.","example[45]":"They’re selling linen off cheap in Lewis’s.","definition[16]":"not costing very much to buy","example[46]":"At least the accommodation and food are cheap.","example[47]":"Buyers got their orders in while shares were relatively cheap.","example[48]":"the introduction of special cheap fares to France","definition[17]":"not costing very much to produce, use, or employ","example[49]":"the prospect of obtaining cheap electricity from sunlight","example[50]":"These taxes are cheap to administer.","definition[18]":"if work is done on the cheap, it is done for less money than you would expect and may not be done very well","example[51]":"Much of the building work was done on the cheap, using materials salvaged from old buildings."}