{"word[0]":"dress down","definition[0]":"to wear clothes that are more informal than the ones you would usually wear","example[0]":"In many offices, people dress down on Fridays.","definition[1]":"to speak angrily to someone about something they have done wrong","heading[0]":"to put on clothes","display[0]":"get dressed","definition[2]":"to put on all your clothes","example[1]":"You’d better get dressed! It’s almost time to leave for school!","display[1]":"dress","definition[3]":"to put on all your clothes. Dress is used especially in literature. In everyday English, people usually say get dressed","example[2]":"That day she dressed with extra care, choosing a brown velvet jacket that matched her skirt.","display[2]":"put something on","definition[4]":"to put on a particular piece of clothing, jewellery etc","example[3]":"Wait – I just have to put my shoes on!","example[4]":"She was putting on her earrings in front of the mirror.","display[3]":"dress up","definition[5]":"to put on more formal clothes than you usually wear, or to put on special clothes for fun","example[5]":"We always used to dress up to go to church.","example[6]":"Paul dressed up as a pirate for the party.","display[4]":"dress yourself","definition[6]":"to put on your clothes – used when this is difficult for someone because they are very old, young, injured etc","example[7]":"He’s hurt his arm so badly that he can’t dress himself.","heading[1]":"to be wearing clothes","display[5]":"wear","definition[7]":"to have a particular piece of clothing or a particular style of clothing on your body","example[8]":"All visitors must wear a protective helmet.","example[9]":"She always wears black.","example[10]":"Can you tell me what the man was wearing?","display[6]":"have something on","definition[8]":"to be wearing a particular piece of clothing, jewellery etc. Have something on is more informal than wear","example[11]":"I had my new blue top on.","example[12]":"He had on a red tie and a grey jacket.","example[13]":"The boy had nothing on!","display[7]":"be dressed in something","definition[9]":"used especially in written descriptions when describing the clothes that someone is wearing","example[14]":"Alistair was dressed in his best suit and tie."}