{"word[0]":"grave","definition[0]":"the place in the ground where a dead body is buried","example[0]":"At the head of the grave there was a small wooden cross.","collocation[0]":"dig a grave","example[1]":"In the churchyard, a man was digging a grave.","collocation[1]":"mark a grave","example[2]":"The stone marked the grave of their young daughter.","collocation[2]":"bury somebody in a grave","example[3]":"She was buried in a grave next to her older sister.","form[0]":"ADJECTIVES/NOUN + grave","collocation[3]":"a shallow grave","example[4]":"They found the woman’s remains in a shallow grave in the woods.","collocation[4]":"a mass grave","example[5]":"Plague victims were buried in a mass grave.","collocation[5]":"an unmarked grave","example[6]":"Until 1855, poor people here were buried in unmarked graves.","collocation[6]":"a family grave","example[7]":"Walter died in 1922 and was buried in the family grave in Finchley cemetery.","collocation[7]":"an open grave","example[8]":"He wept by her open grave.","form[1]":"grave + NOUN","collocation[8]":"a grave site","example[9]":"The president visited the grave sites of 12 youths killed in recent bombings.","definition[1]":"grave problems, situations, or worries are very great or bad","example[10]":"Matthew’s life is in grave danger.","example[11]":"The report expressed grave concern over the technicians’ lack of training.","example[12]":"I have grave doubts about his ability.","example[13]":"The situation is becoming very grave.","explanation[0]":"In everyday English, people usually use serious  rather than grave, and seriously rather than gravely:","example[14]":"I have serious doubts about whether he’s up to the job.","example[15]":"I’m seriously worried about her.","definition[2]":"looking or sounding quiet and serious, especially because something important or worrying has happened","synonym[0]":"sombre","example[16]":"Turnbull’s face was grave as he told them about the accident.","definition[3]":"a grave accent is a mark put above a letter in some languages such as French to show the pronunciation, for example è"}