{"word[0]":"general","signpost[0]":"not detailed","definition[0]":"describing or relating to only the main features or parts of something, not the details","example[0]":"a general introduction to computing","example[1]":"I skimmed through it to get a general impression of the text.","example[2]":"I have a general idea of what I want to express.","example[3]":"He spoke in general terms about greater competitiveness.","signpost[1]":"relating to whole","definition[1]":"involving the whole of a situation, group, or thing, rather than specific parts of it","example[4]":"There has been a general decline in standards.","example[5]":"ways to improve your general health","definition[2]":"ordinary or usual","example[6]":"general cooking and cleaning","example[7]":"I hate paperwork as a general rule.","signpost[2]":"most people","definition[3]":"shared by or affecting most people, or most of the people in a group","example[8]":"These courses are based around topics of general interest.","example[9]":"How soon can the drug be made available for general use?","signpost[3]":"not limited","definition[4]":"not limited to one use, activity, subject etc","example[10]":"The next ten minutes passed in general conversation.","example[11]":"It’s a good general fertilizer.","example[12]":"Watford General Hospital","example[13]":"This type of microphone is suitable for general use.","signpost[4]":"approximate","definition[5]":"used to talk about an approximate area or direction","example[14]":"Pat and his friend were in the general area of the crime when it happened.","example[15]":"They started walking in the general direction of the pub.","definition[6]":"used in the name of a job to show that the person who does it has complete responsibility","example[16]":"the general manager","example[17]":"the Attorney General","display[0]":"in general","definition[7]":"used when saying that something is usually true in most situations, or about most people or things","example[18]":"In general, temporary jobs are less well-paid.","example[19]":"In general, the bigger a company becomes, the harder it is to maintain customer satisfaction.","display[1]":"generally","definition[8]":"another way of saying ‘in general’, which is often used before a verb. Generally can also be used to say that most people have a particular opinion","example[20]":"Women generally live longer than men.","example[21]":"Newton is generally regarded as the father of modern science.","display[2]":"generally speaking/as a rule","definition[9]":"other ways of saying ‘in general’","example[22]":"Generally speaking, large breeds of dog are becoming less popular.","example[23]":"He’s a singer who doesn’t do interviews, as a rule.","example[24]":"The graduates are, generally speaking, a confident and articulate group of young people.","display[3]":"mostly/mainly/largely","definition[10]":"used when saying that something is true about most people or things, or about most of something. Largely is slightly more formal than mostly or mainly","example[25]":"The disease mainly affects women.","example[26]":"Their attempts were largely unsuccessful.","example[27]":"The students were mostly French and German, but there were a few Japanese students too.","display[4]":"for the most part","definition[11]":"used when saying that something is true in most cases, but not in every case","example[28]":"These problems have for the most part been resolved.","example[29]":"For the most part, the gangs were made up of boys aged between 11 and 16.","display[5]":"by and large/on the whole","definition[12]":"used for saying that something is true in most ways or in most cases","example[30]":"The project was, by and large, a success.","example[31]":"On the whole, people were very friendly.","definition[13]":"an officer of very high rank in the army or air force"}