{"word[0]":"export","definition[0]":"the business of selling and sending goods to other countries","opposite[0]":"import","example[0]":"a ban on the export of toxic waste","note[0]":"export of","example[1]":"bales of cloth for export to the continent","note[1]":"for export","definition[1]":"a product that is sold to another country","example[2]":"Wheat is one of the country’s main exports.","form[0]":"export + NOUN","collocation[0]":"an export market","example[3]":"The US is Scotland’s second largest export market after France.","collocation[1]":"export trade","example[4]":"Most of its export trade is with Russia.","collocation[2]":"export earnings/revenue","example[5]":"Oil and gas provide 40% of Norway’s export earnings.","collocation[3]":"export sales/figures","example[6]":"Export sales exceeded 50% of the company’s total turnover.","example[7]":"Hong Kong is a major trading power, with annual export figures rivalling those of Germany.","collocation[4]":"an export licence","example[8]":"You will have to submit an application for an export licence.","collocation[5]":"export controls/restrictions/quotas","example[9]":"The European Parliament wants tougher export controls on certain goods.","example[10]":"The number of goods subject to import and export quotas is being reduced.","collocation[6]":"an export ban","example[11]":"During the crisis, France imposed an export ban on British beef.","example[12]":"The ban on exports was lifted in June.","form[1]":"ADJECTIVES/NOUN + export","collocation[7]":"the major/main/principal export","example[13]":"Agricultural products are the country’s principal exports.","collocation[8]":"oil/agricultural/manufacturing exports","example[14]":"Oil exports from Iraq have resumed.","collocation[9]":"British/US etc exports","example[15]":"Higher tariffs will affect a wide range of British exports.","collocation[10]":"invisible exports","example[16]":"The City of London is important to the invisible exports of this country.","collocation[11]":"boost exports","example[17]":"The measures should boost exports and create employment.","collocation[12]":"encourage exports","example[18]":"Kenya used subsidies to encourage exports.","collocation[13]":"reduce exports","example[19]":"OPEC has threatened to reduce exports of oil to the West.","collocation[14]":"restrict exports","example[20]":"The government threatened to restrict exports because of weak demand.","collocation[15]":"ban exports","example[21]":"In retaliation, Britain banned exports of cloth to France.","collocation[16]":"exports increase/rise/grow","example[22]":"Electronics exports grew more slowly than in previous years.","collocation[17]":"exports fall/decline/drop","example[23]":"Exports of gas and oil continued to fall while imports of raw materials have risen.","collocation[18]":"exports account for something","example[24]":"Exports currently account for 37% of sales.","collocation[19]":"a growth/rise/increase in exports","example[25]":"The electronics sector has seen a 16% growth in exports.","collocation[20]":"a fall/decline/drop in exports","example[26]":"There has been a decline in exports and an increase in oil prices.","definition[2]":"to sell goods to another country","example[27]":"The company exports tuna to the US.","note[2]":"export something (from somebody) to somebody","definition[3]":"to introduce an activity, idea etc to another place or country","example[28]":"Italian food has been exported all over the world.","definition[4]":"to move computer information from one computer to another, from one computer document to another, or from one piece of software to another","definition[5]":"a product or service that is sold to another country","example[29]":"A third of America’s exports go to American-owned firms abroad.","example[30]":"The Japanese cosmetics company plans to boost exports (=increase them) to the US and Europe.","definition[6]":"the sale of goods to other countries","example[31]":"The import and export of goods is more complicated than conducting domestic business within a single country.","example[32]":"10,000 bags of coffee for export to the continent","definition[7]":"to sell goods to other countries","example[33]":"In the first 11 months of last year, Brazil exported 15 million bags of coffee.","example[34]":"The mine will produce 9 million tonnes of coal annually of which 5.3 million tonnes will be exported to Japan.","definition[8]":"to introduce an activity, idea etc to another country","example[35]":"We are retailers, and our skills may not be easily exported.","example[36]":"Can I export the information in a pdf file and then store that file on my laptop?"}