{"word[0]":"logic","definition[0]":"a way of thinking about something that seems correct and reasonable, or a set of sensible reasons for doing something","example[0]":"There is a certain logic in their choice of architect.","example[1]":"It’s easy to understand his logic.","note[0]":"accept/follow/see somebody’s logic","example[2]":"Commercial logic has forced the two parts of the company closer together.","note[1]":"commercial/industrial/economic logic","example[3]":"The logic behind this statement is faulty.","note[2]":"logic behind","example[4]":"What’s the logic of your argument?","note[3]":"logic of","definition[1]":"a formal method of reasoning, in which ideas are based on previous ideas","definition[2]":"a set of choices that a computer uses to solve a problem","collocation[0]":"understand/see somebody’s logic","example[5]":"I could not understand the logic of her actions.","collocation[1]":"follow somebody’s logic","example[6]":"Following this logic, none of these distressing conditions would be considered 'real' illnesses.","collocation[2]":"use/apply logic","example[7]":"Why do we not apply the same logic in the way we treat animals?","collocation[3]":"accept somebody’s logic","example[8]":"The government should accept this logic and exempt all students from paying the tax.","collocation[4]":"defy logic","example[9]":"It defies logic to import food that we can grow more easily and cheaply here.","collocation[5]":"logic suggests something","example[10]":"Logic suggests that if the air is warmer, more water evaporates.","collocation[6]":"logic dictates something","example[11]":"Logic dictates that poorer people will be more affected by the rise in inflation.","collocation[7]":"commercial/industrial/economic etc logic","example[12]":"Reducing your carbon footprint is also backed by good economic logic.","collocation[8]":"internal logic","example[13]":"Each major religion has its own internal logic.","collocation[9]":"underlying logic","example[14]":"These word lists show students the underlying logic of English spelling.","collocation[10]":"inexorable logic","example[15]":"By the inexorable logic of war, the bombings provoked an even stronger response.","collocation[11]":"impeccable logic","example[16]":"He worked out, with impeccable logic, that the best thing to do would be to cooperate.","collocation[12]":"a certain logic","example[17]":"With a certain logic, the child said that ‘ten and one’ would be the next number after ten.","definition[3]":"a way of thinking and making good judgements that is connected to a particular area of business, the economy etc","example[18]":"Their takeover bid appears to have no commercial logic.","definition[4]":"a set of choices that a computer uses to solve a problem or perform a task","example[19]":"a logic circuit"}