{"comparative[0]":"clearer","superlative[0]":"clearest","signpost[0]":"easy to understand","definition[0]":"expressed in a simple and direct way so that people understand","example[0]":"clear instructions","example[1]":"The question wasn’t very clear.","example[2]":"It’s the clearest guide I’ve used.","example[3]":"How can you make the meaning clearer?","example[4]":"Perhaps I tried to cover too much and didn’t make myself clear (=express myself well).","example[5]":"If you don’t understand, it’s best to say so and get things clear.","example[6]":"If I catch you smoking again, you’re grounded. Do I make myself clear? (=used when you are angry)","example[7]":"He writes crystal clear (=very easy to understand) prose.","example[8]":"Can I make it absolutely clear that we did not intend this to happen?","note[0]":"absolutely/abundantly clear","example[9]":"The report gave a clear picture of the property’s condition.","note[1]":"clear picture/idea","example[10]":"The school is clear about its policy on bullying.","note[2]":"clear about","example[11]":"Be very clear about what jobs should be completed, and by when.","note[3]":"clear about what/when/how etc","example[12]":"The rules are quite clear on the point.","note[4]":"clear on","example[13]":"It was clear to him that Tolkien was a literary genius.","note[5]":"clear to","example[14]":"The bishop made his views clear in a letter to the publisher.","note[6]":"make something clear","example[15]":"Make it clear that you will not take sides.","note[7]":"make it clear that","signpost[1]":"impossible to doubt","definition[1]":"impossible to doubt, question, or make a mistake about","example[16]":"clear evidence of guilt","example[17]":"They won by a clear majority.","example[18]":"a clear case of sexual discrimination","note[8]":"clear case/example of something","example[19]":"It’s not clear whether he shares her views.","note[9]":"it is clear whether/why/how etc","example[20]":"It’s clear that the drug does benefit some patients.","note[10]":"it is clear (that)","example[21]":"When it became clear that I was pregnant, he left me.","signpost[2]":"sure about something","definition[2]":"feeling certain that you know or understand something","example[22]":"Let me get this clear – you hadn’t seen her in three days?","example[23]":"a clearer understanding of the issues","example[24]":"Are you all clear now about what you have to do?","note[11]":"clear about/on","example[25]":"I’m still not really clear how this machine works.","note[12]":"clear whether/what/how etc","signpost[3]":"thinking","definition[3]":"able to think sensibly and quickly","example[26]":"She felt that her thinking was clearer now.","example[27]":"In the morning, with a clear head, she’d tackle the problem.","signpost[4]":"substance/liquid","definition[4]":"easy to see through, rather than coloured or dirty","synonym[0]":"transparent","opposite[0]":"cloudy","example[28]":"clear glass bottles","example[29]":"a crystal clear mountain lake","definition[5]":"clean and fresh, without clouds or mist","example[30]":"a clear June morning","example[31]":"The skies were clear and blue.","definition[6]":"healthy, very pure in colour, and without any redness","example[32]":"clear blue eyes","signpost[5]":"skin","definition[7]":"smooth and without any red spots","example[33]":"a clear complexion","signpost[6]":"easy to see","definition[8]":"having details, edges, lines etc that are easy to see, or shapes that are easy to recognize","example[34]":"a TV with a clear picture and high-quality sound","signpost[7]":"easy to hear","definition[9]":"easy to hear, and therefore easy to understand","example[35]":"a clear speaking voice","example[36]":"The radio reception isn’t very clear.","example[37]":"It’s a good recording; the sound is as clear as a bell (=very clear).","signpost[8]":"after tax","definition[10]":"a clear amount of profit, wages etc is what is left after taxes have been paid on it","synonym[1]":"net","example[38]":"I get £200 a week clear.","example[39]":"Sam makes a clear $90,000 per year.","signpost[9]":"period of time","definition[11]":"without any planned activities or events","example[40]":"Next Monday is clear; how about ten o'clock?","signpost[10]":"not busy","definition[12]":"complete or whole","example[41]":"Allow three clear days for delivery.","signpost[11]":"not blocked/covered","definition[13]":"not covered or blocked by anything that stops you from doing or seeing what you want","example[42]":"The roads were fairly clear this morning.","example[43]":"From the top floor you get a clear view of the bay.","note[13]":"clear view/look","example[44]":"To prevent fires, the sides of the roads are kept clear of underbrush.","note[14]":"clear of","example[45]":"Children may have difficulty in making their feelings clear.","collocation[0]":"get something clear","example[46]":"I was trying to get the idea clear in my mind.","collocation[1]":"absolutely/perfectly clear","example[47]":"His answer was perfectly clear.","collocation[2]":"crystal clear","example[48]":"The instructions on the packet are crystal clear.","collocation[3]":"abundantly clear","example[49]":"By July the scale of the problem had become abundantly clear.","collocation[4]":"not entirely clear","example[50]":"Sam’s reasons for leaving were not entirely clear.","collocation[5]":"a clear picture/idea","example[51]":"Some work experience should give you a clear idea of what the job involves.","example[52]":"The tone of her voice made it clear that she was very angry.","collocation[6]":"make yourself clear","example[53]":"Please tell me if I’m not making myself clear.","collocation[7]":"be far from clear/be by no means clear","example[54]":"The directions she gave me were far from clear.","heading[0]":"easy to see through","example[55]":"The table top is a piece of clear glass.","example[56]":"a clear liquid","example[57]":"The water was so clear that you could see down to the bottom of the lake.","definition[14]":"clear – used especially about materials and solid things. Transparent is a little more formal than clear","example[58]":"Fill a transparent plastic bottle with water.","example[59]":"a piece of transparent film","example[60]":"Melt 2 ounces of butter in a large frying pan, and cook the onions until they are almost transparent.","display[0]":"see-through","definition[15]":"made of a very thin material that you can see through – used especially about women’s clothes","example[61]":"She wore a black see-through dress.","display[1]":"limpid","definition[16]":"clear – used especially about water or other liquids . This is a very formal word which is used in novels and literature","example[62]":"limpid pools","example[63]":"She gave her a golden flask of limpid olive oil.","heading[1]":"difficult to see through","display[2]":"opaque","example[64]":"The shower has an opaque glass door.","signpost[12]":"surface/place","definition[17]":"to make somewhere emptier or tidier by removing things from it","example[65]":"Snowplows have been out clearing the roads.","example[66]":"Dad cleared a space (=moved things so there was room) in the garage for Jim’s tools.","example[67]":"It’s Kelly’s turn to clear the table (=remove the dirty plates, forks etc).","example[68]":"Large areas of land had been cleared of forest.","note[15]":"clear something of something","example[69]":"Workers began clearing wreckage from the tracks.","note[16]":"clear something from something","signpost[13]":"remove people","definition[18]":"to make people, cars etc leave a place","example[70]":"Within minutes, police had cleared the area.","example[71]":"Crowds of demonstrators were cleared from the streets.","note[17]":"clear somebody/something from something","signpost[14]":"crime/blame etc","definition[19]":"to prove that someone is not guilty of something","example[72]":"Rawlings was cleared after new evidence was produced.","example[73]":"a long-running legal battle to clear his name","example[74]":"Maya was cleared of manslaughter.","note[18]":"clear somebody of (doing) something","explanation[0]":"Clear is often passive in this meaning","signpost[15]":"permission","definition[20]":"to give or get official permission for something to be done","example[75]":"He was cleared by doctors to resume skating in August.","example[76]":"Defence policies must often be cleared with NATO allies first.","note[19]":"clear something with somebody","definition[21]":"to give official permission for a person, ship, or aircraft to enter or leave a country","example[77]":"The plane took off as soon as it was cleared.","definition[22]":"if the weather, sky, mist etc clears, it becomes better and there is more sun","example[78]":"The haze usually clears by lunchtime.","definition[23]":"if a liquid clears, it becomes more transparent and you can see through it","example[79]":"Wait for the water to clear before adding any fish.","signpost[16]":"cheque","definition[24]":"if a cheque clears, or if a bank clears it, the bank allows the money to be paid into the account of the person whose name is on the cheque","signpost[17]":"go over/past","definition[25]":"to go over a fence, wall etc without touching it, or to go past or through something and no longer be in it","example[80]":"The plane barely cleared the fence at the end of the runway.","example[81]":"Edwards cleared 18 feet in the pole vault.","example[82]":"The plane cleared Chinese airspace.","signpost[18]":"face/expression","definition[26]":"if your face or expression clears, you stop looking worried or angry","example[83]":"She looked embarrassed, but then her face cleared.","definition[27]":"if your skin clears, red marks on it disappear","example[84]":"The rash has finally cleared.","signpost[19]":"earn","definition[28]":"to earn a particular amount of money after taxes have been paid on it","example[85]":"Diane clears £20,000 a year.","definition[29]":"away from something, or out of the way","example[86]":"Firefighters pulled her clear of the wreckage.","example[87]":"Please stand clear of the doors.","definition[30]":"used to emphasize a long distance","example[88]":"You can see clear to the hills.","definition[31]":"to give permission for a product to be sold or for a deal to be made","example[89]":"The drug has been cleared by the Food and Drug Administration.","example[90]":"Venezuela’s congress cleared the sale of the state telephone company CANTV.","definition[32]":"to make payments relating to trading on financial markets or trading of goods","example[91]":"About 1,000 small brokerage firms are using the company to clear and settle their trades.","example[92]":"It takes ages for the banks here to clear transactions and it’s very expensive.","definition[33]":"if a bank clears a cheque, or if a cheque clears, the money is sent from one bank to another and the cheque is paid","example[93]":"The fraud relied on managers returning money before the original cheque had cleared.","definition[34]":"to be allowed to take things through CUSTOMS","example[94]":"Bribery is needed to get goods cleared through customs.","example[95]":"They cleared customs, but never boarded their flight.","definition[35]":"to pay a debt in full","example[96]":"The Ivory Coast cleared its debts of $42m.","definition[36]":"to earn a particular amount of money, or to make a particular amount of profit","definition[37]":"to sell goods cheaply in order to get rid of them","example[97]":"We need to clear the old stock before we can bring in this season’s range of products."}