{"comparative[0]":"quicker","superlative[0]":"quickest","signpost[0]":"short time","definition[0]":"lasting for or taking only a short time","example[0]":"That was quick! I thought you’d be another hour.","example[1]":"It’s probably quicker by train.","example[2]":"Have we got time for a quick drink?","example[3]":"What’s the quickest way to the station?","example[4]":"We stopped to have a quick look at the church.","example[5]":"Three bombs went off in quick succession (=quickly, one after the other).","definition[1]":"moving or doing something fast","example[6]":"She walked with short, quick steps.","example[7]":"They were great people to work with – very quick, very efficient.","example[8]":"Boxers have to be quick on their feet (=able to move about quickly).","signpost[1]":"no delay","definition[2]":"happening very soon, without any delay","synonym[0]":"speedy","example[9]":"I had to make a quick decision.","example[10]":"We’ve put the house on the market and we’re hoping for a quick sale.","example[11]":"We need a quick response from the government.","example[12]":"Robertson’s quick thinking had saved the little girl’s life.","signpost[2]":"clever","definition[3]":"able to learn and understand things fast","example[13]":"Jane’s very witty and very quick.","example[14]":"She’s a quick learner.","example[15]":"He’s a good interviewer, tough and quick on the uptake (=able to understand quickly what someone is saying).","definition[4]":"taking only a short time to do something","example[16]":"I took a quick look at the map.","example[17]":"Do I have time for a quick shower before we go out?","definition[5]":"lasting only a short time","example[18]":"You can do a short course in diving.","example[19]":"The meeting was shorter than I’d expected.","definition[6]":"lasting only a short time. Brief is more formal than short, and is used especially in written English","example[20]":"The president made a brief visit to Buenos Aires.","example[21]":"a brief introduction to Piaget’s ideas","example[22]":"a brief pause in the rain","definition[7]":"happening in a short period of time – used about changes, increases, improvements etc","example[23]":"a rapid increase in crime","example[24]":"the rapid rate of industrial development","definition[8]":"happening or done as quickly as possible, especially so that you get the result that you want","example[25]":"Best wishes for a speedy recovery.","example[26]":"The restoration work has been making speedy progress.","display[0]":"prompt","definition[9]":"done very soon after something else","example[27]":"Thank you for your prompt reply.","example[28]":"the prompt action of the firefighters","example[29]":"Discounts will be offered for prompt payment.","display[1]":"hasty","definition[10]":"deciding or doing something very quickly, especially when this has bad results","example[30]":"It was a hasty decision, which he later regretted.","example[31]":"They had to make a hasty departure.","display[2]":"cursory","definition[11]":"looking at something very quickly without much attention to detail","example[32]":"Even a cursory glance at these figures shows that there is a problem.","example[33]":"The police conducted a cursory search of the property.","definition[12]":"used to tell someone to hurry or come quickly","example[34]":"Quick! We’ll miss the bus!","definition[13]":"quickly – many teachers think this is not correct English","example[35]":"Come quick! Larry’s on TV!","example[36]":"It all happened pretty quick.","example[37]":"Quick as a flash (=very quickly) she replied, ‘That’s not what I’ve heard!’","definition[14]":"quick and dirty methods or solutions are simple ones that can be used quickly, especially until something better and more permanent can be decided","example[38]":"We need a quick and dirty way to cut fuel costs."}