{"word[0]":"shame","definition[0]":"the feeling you have when you feel guilty and embarrassed because you, or someone who is close to you, have done something wrong","example[0]":"He felt a deep sense of shame.","example[1]":"Maria blushed with shame.","example[2]":"To her shame (=it made her feel ashamed), she gained back all the weight she’d lost.","example[3]":"He’s brought shame on the whole family.","example[4]":"There’s no shame in (=it should not make you feel ashamed) saying ‘I don’t know.’","example[5]":"I bow my head in shame when I think of how I treated her.","note[0]":"hang/bow your head in shame","definition[1]":"the ability to feel shame","example[6]":"How could you do such a thing? Have you no shame?","example[7]":"She never overcame the shame of having abandoned her children.","example[8]":"He remembered his angry words with a deep sense of shame.","example[9]":"Following the scandal, Garrison resigned in shame.","display[0]":"humiliation","definition[2]":"a feeling of shame and embarrassment because you have been made to look weak or stupid in front of other people","example[10]":"What really upset me was the humiliation of having to ask her for money.","example[11]":"He suffered the humiliation of defeat in the first round of the competition.","display[1]":"dishonour","definition[3]":"the loss of other people’s respect because you have done something bad, or you have been unsuccessful","example[12]":"His comments have brought shame and dishonour on him and his profession.","example[13]":"There is no dishonour in failure when you have done everything you possibly can to succeed.","display[2]":"stigma","definition[4]":"the feeling that other people in society disapprove of you because of something that has happened to you, or because you feel different from most other people in some way – used especially when this seems unfair and unreasonable","example[14]":"Even when someone has been found innocent of a crime, the stigma often remains.","example[15]":"At first I found the stigma of being unemployed very difficult to cope with.","example[16]":"In many countries there is still a strong social stigma attached to homosexuality.","heading[0]":"great shame","display[3]":"disgrace","definition[5]":"a complete loss of people’s respect because you have done something very bad and shocking","example[17]":"His actions brought disgrace on the family.","example[18]":"The players were sent home in disgrace after admitting taking drugs.","example[19]":"Garton killed himself because he could not bear the disgrace of being charged with corruption.","display[4]":"ignominy","definition[6]":"a feeling of great shame and embarrassment because you have been made to look weak or stupid – a very formal use","example[20]":"The team suffered the ignominy of losing five games in a row.","example[21]":"She hoped to avoid the ignominy of having to appear in court.","definition[7]":"to make someone feel ashamed","example[22]":"It shames me to say it, but I lied.","example[23]":"He felt shamed and humiliated by the treatment he had received.","definition[8]":"to be so much better than someone else that you make them seem bad or feel embarrassed","example[24]":"Their training record shamed other companies.","definition[9]":"to make someone feel they have lost all honour and respect","example[25]":"She had shamed her family name  (=done something that made her family lose honour)."}