{"word[0]":"commercial","definition[0]":"related to business and the buying and selling of goods and services","example[0]":"Our top priorities must be profit and commercial growth.","definition[1]":"related to the ability of a product or business to make a profit","example[1]":"Gibbons failed to see the commercial value of his discovery.","example[2]":"The film was a huge commercial success.","note[0]":"commercial success/failure","definition[2]":"a commercial product is one that is produced and sold in large quantities","definition[3]":"more concerned with money than with quality","example[3]":"Their music has become very commercial.","collocation[0]":"a commercial bank","example[4]":"Several large commercial banks cut their lending rates.","collocation[1]":"a commercial company/organization","example[5]":"Many commercial companies are having financial difficulties.","collocation[2]":"commercial property","example[6]":"He decided to invest in commercial property.","collocation[3]":"commercial interests","example[7]":"The president’s reform programme threatened US commercial interests.","collocation[4]":"the commercial sector","example[8]":"The commercial sector sponsors sport.","collocation[5]":"the commercial market","example[9]":"A product like this should do well in the commercial market.","collocation[6]":"commercial development","example[10]":"The increased number of tourists has resulted in further commercial development.","collocation[7]":"commercial use","example[11]":"The trees were planted for commercial use.","collocation[8]":"commercial exploitation","example[12]":"the commercial exploitation of mineral resources","collocation[9]":"commercial activity","example[13]":"Commercial activity in our society is highly competitive.","collocation[10]":"commercial considerations/reasons/purposes","example[14]":"Commercial considerations must come second to conservation of the environment.","collocation[11]":"a commercial transaction","example[15]":"The deal was a straightforward commercial transaction.","definition[4]":"an advertisement on television or radio","example[16]":"a soap powder commercial","definition[5]":"relating to business and the buying and selling of goods and services","example[17]":"Oran is a large commercial city on the coast.","example[18]":"protests against commercial development on green field sites","definition[6]":"relating to the ability of a product or business to make a profit","example[19]":"We do not want to see ivory having a commercial value.","example[20]":"The invention enjoyed great commercial success.","definition[7]":"a commercial product is one that is produced in large quantities and sold to the public","example[21]":"All commercial milk is pasteurized.","example[22]":"a large commercial fish farm","definition[8]":"a port etc that provides a service for the general public to use and is run to make a profit","example[23]":"This aircraft was the first Boeing 727 to carry fare-paying passengers on a commercial flight.","definition[9]":"radio and television broadcasts that are produced by companies that earn money through advertising, rather than ones owned by the state","example[24]":"It has become the most popular commercial radio station in Britain.","example[25]":"The record company tried to make me write songs that were very commercial.","definition[10]":"an advertisement on television or radio, or at the cinema","example[26]":"She’s appeared in a coffee commercial.","example[27]":"a commercial for a brand of aftershave","example[28]":"The campaigns were designed to run as television or cinema commercials.","definition[11]":"shares in companies that produce and sell consumer goods, rather than companies involved in industrial processes"}