{"word[0]":"raw","definition[0]":"not cooked","example[0]":"raw meat","example[1]":"grated raw carrots","example[2]":"Cabbage can be eaten raw.","signpost[0]":"substances","definition[1]":"raw substances are in a natural state and not treated or prepared for use","example[3]":"raw silk","example[4]":"In its raw state, cocoa is very bitter.","example[5]":"Raw sewage had been dumped in the river.","example[6]":"The cost of our raw materials has risen significantly.","definition[2]":"raw information is collected but not organized, examined, or developed","example[7]":"software to convert raw data into usable information","example[8]":"His time here provided the raw material for his novel.","example[9]":"Warhol used everyday items as the raw ingredients of his art.","signpost[1]":"emotions","definition[3]":"raw feelings are strong and natural, but not fully controlled","example[10]":"raw passion","example[11]":"Linda didn’t want to see Roy while her emotions were still raw.","example[12]":"It took raw courage to admit she was wrong.","definition[4]":"if a part of your body is raw, the skin there is red and painful","example[13]":"The skin on my feet was rubbed raw.","signpost[2]":"inexperienced","definition[5]":"not experienced or not fully trained","example[14]":"Most of our soldiers are raw recruits.","definition[6]":"very cold","example[15]":"She shivered in the raw morning air.","signpost[3]":"art","definition[7]":"music, art, language etc that is raw is simple, direct, and powerful, but not fully developed","example[16]":"Her voice has a raw poetic beauty.","example[17]":"His early sketches are raw and unpretentious.","definition[8]":"raw metals or other substances are in their natural state and have not been prepared or used to make anything","example[18]":"German companies produced 6.1% less raw iron in March.","example[19]":"the export of raw logs","definition[9]":"information that has not been arranged, checked, or prepared in any way","example[20]":"The system collects raw data about which products a customer has purchased."}