{"word[0]":"branch","signpost[0]":"of a tree","definition[0]":"a part of a tree that grows out from the trunk (=main stem) and that has leaves, fruit, or smaller branches growing from it","example[0]":"After the storm, the ground was littered with twigs and branches.","example[1]":"The topmost branches were full of birds.","signpost[1]":"of a business/shop/company etc","definition[1]":"a local business, shop etc that is part of a larger business etc","example[2]":"The bank has branches all over the country.","example[3]":"a branch office in Boston","example[4]":"She now works in our Denver branch.","example[5]":"Where’s their nearest branch?","example[6]":"They’re planning to open a branch in St. Louis next year.","example[7]":"Have you met our branch manager, Mr. Carlson?","signpost[2]":"of government","definition[2]":"a part of a government or other organization that deals with one particular part of its work","note[0]":"the executive/judicial/legislative branch (=the three main parts of the US government)","example[8]":"All branches of government are having to cut costs.","signpost[3]":"of a subject","definition[3]":"one part of a large subject of study or knowledge","note[1]":"a branch of mathematics/physics/biology etc","signpost[4]":"of a family","definition[4]":"a group of members of a family who all have the same ancestors","example[9]":"the wealthy South American branch of the family","signpost[5]":"of a river/road etc","definition[5]":"a smaller less important part of a river, road, or railway that leads away from the larger more important part of it","example[10]":"The rail company may have to close the branch line to Uckfield.","definition[6]":"to divide into two or more smaller, narrower, or less important parts","example[11]":"When you reach the village green, the street branches into two.","definition[7]":"an individual bank, shop, office etc that is part of a large organization","example[12]":"The business has 170 branches throughout the UK.","example[13]":"To talk to one of our specialist financial advisers, just contact your local branch.","definition[8]":"a part of a government or a large organization that deals with one particular type of work","example[14]":"The executive and judicial branches of government would be totally separate.","definition[9]":"a small local organization that is part of a TRADE UNION","example[15]":"He is a former chairman of the Belfast branch of the National Union of Journalists.","example[16]":"She joined the strike support committee and started going to branch meetings."}