{"word[0]":"track","signpost[0]":"path/road","definition[0]":"a narrow path or road with a rough uneven surface, especially one made by people or animals frequently moving through the same place","example[0]":"The road leading to the farm was little more than a dirt track.","example[1]":"The track led through dense forest.","example[2]":"a steep mountain track","signpost[1]":"for racing","definition[1]":"a circular course around which runners, cars etc race, which often has a specially prepared surface","example[3]":"To run a mile, you have to run four circuits of the track.","definition[2]":"the two metal lines along which trains travel","example[4]":"The track was damaged in several places.","example[5]":"That particular section of track was laid last year.","definition[3]":"the particular track that a train leaves from or arrives at","example[6]":"The train for Boston is leaving from track 2.","signpost[2]":"music/song","definition[4]":"one of the songs or pieces of music on an album (=collection of songs or pieces of music)","example[7]":"There’s a great Miles Davis track on side two.","definition[5]":"sport that involves running on a track","example[8]":"The next year he didn’t run track or play football.","definition[6]":"all the sports in an athletics competition such as running, jumping, or throwing the javelin","example[9]":"a famous track star","example[10]":"She went out for track in the spring  (=she joined the school’s track team).","definition[7]":"the direction or line taken by something as it moves","example[11]":"islands that lie in the track of North Atlantic storms","note[0]":"track of","signpost[3]":"on a vehicle","definition[8]":"a continuous metal band that goes over the wheels of a vehicle such as a bulldozer, allowing it to move over uneven ground","definition[9]":"to search for a person or animal by following the marks they leave behind them on the ground, their smell etc","example[12]":"Police have been tracking the four criminals all over Central America.","example[13]":"The dogs tracked the wolf to its lair.","note[1]":"track somebody to something","signpost[4]":"development","definition[10]":"to record or study the behaviour or development of someone or something over time","example[14]":"The progress of each student is tracked by computer.","signpost[5]":"aircraft/ship","definition[11]":"to follow the movements of an aircraft or ship by using radar","example[15]":"a tracking station","type[0]":"intransitive + in/out","signpost[6]":"camera","definition[12]":"to move a film or television camera away from or towards a scene in order to follow the action that you are recording","definition[13]":"to put schoolchildren in groups according to their ability","definition[14]":"to leave behind a track of something such as mud or dirt when you walk","example[16]":"Which of you boys tracked mud all over the kitchen floor?"}