{"word[0]":"admire","definition[0]":"to respect and like someone because they have done something that you think is good, or to respect their qualities or skills","example[0]":"I really admire the way she brings up those kids all on her own.","example[1]":"Lewis was much admired for his work on medieval literature.","note[0]":"admire somebody for (doing) something","definition[1]":"to look at something and think how beautiful or impressive it is","example[2]":"We stopped halfway to admire the view.","example[3]":"Sal stood back to admire her work.","explanation[0]":"Admire is not used in the progressive in meaning 1 You say","example[4]":"I admire him for his courage  (=I respect and like him) ","bad_example[0]":"I am admiring him","explanation[1]":"Admire is often used in the progressive in meaning 2 You say","example[5]":"He was admiring himself in the mirror  (=he was looking at himself) ","example[6]":"He admired himself in the mirror","definition[2]":"to like someone because they have achieved something special, or they have skills or qualities that you would like to have","example[7]":"I admire your courage.","example[8]":"She admired him for the way he dealt with the situation.","display[0]":"respect","definition[3]":"to have a good opinion of someone, even if you do not agree with them, for example because they have achieved a lot or have high standards","example[9]":"She is respected by all her colleagues at the university.","example[10]":"She’s an actor who is not prepared to compromise, and her audience loves and respects her for that.","display[1]":"revere","definition[4]":"to greatly admire someone because of their achievements and personal qualities, especially someone famous","example[11]":"Mandela is revered as one of the great leaders of our time.","display[2]":"look up to somebody","definition[5]":"to admire someone who is older or who has more experience than you","example[12]":"All the young comedians look up to him.","display[3]":"think highly of somebody","definition[6]":"to think that someone is good at what they do","example[13]":"His teachers seem to think very highly of him.","display[4]":"idolize","definition[7]":"to admire someone so much that you think they are perfect – used especially about famous people or people in your family","example[14]":"He idolized his brother.","example[15]":"Jane grew up idolizing Princess Diana.","display[5]":"hero-worship","definition[8]":"to admire someone a lot and want to be like them – often used when this seems unreasonable or extreme","example[16]":"She hero-worshipped John to such an extent that she was blind to his faults."}