{"word[0]":"upgrade","definition[0]":"to make a computer, machine, or piece of software better and able to do more things","example[0]":"You’ll need to upgrade your hard drive to 120Mb before running this software.","note[0]":"upgrade (something) to something","definition[1]":"to improve something and make it more modern, especially in order to provide a better service","example[1]":"The hotel has recently been refurbished and upgraded.","definition[2]":"to give someone a better seat on a plane or a better room in a hotel than the one they paid for","example[2]":"We can upgrade you to business class.","note[1]":"upgrade (somebody) to something","definition[3]":"to give someone a more important job","definition[4]":"to change the official description of something to make it seem better or more important","opposite[0]":"downgrade","example[3]":"Four of the regions were upgraded to the status of republic.","note[2]":"upgrade something to something","definition[5]":"to make a computer, machine, program etc better and able to do more things","example[4]":"There are several things to consider when it comes to upgrading computer memory.","example[5]":"You can upgrade to the latest version of the software by following these steps.","note[3]":"upgrade to","definition[6]":"to buy a new computer, machine etc that is better and able to do more things than your old one","example[6]":"The money will be used to upgrade machinery and trucks.","example[7]":"In order to grow your business, you may need to upgrade to a more powerful system.","definition[7]":"to get a better seat on a plane, a better rented car etc than the one you paid for","example[8]":"You can use your frequent flier mileage to upgrade to business class.","definition[8]":"to put something in a better class or at a higher level on a scale than before","example[9]":"They have upgraded their profit forecast from £1.49 billion to £1.56 billion.","definition[9]":"the act of improving a product or service, or one that has been improved","example[10]":"Within two years, the company expects to complete a $110 million upgrade of its cable system.","definition[10]":"new computer software that replaces previous software of the same type","example[11]":"Three-quarters of the firm’s overall software revenues will eventually be generated by selling upgrades to existing customers.","definition[11]":"an occasion when someone is given a better seat on a plane, or a better rented car, than the one they paid for","example[12]":"If you’re lucky you might get an upgrade."}