{"word[0]":"counter","definition[0]":"the place where you pay or are served in a shop, bank, restaurant etc","example[0]":"He wondered if the girl behind the counter recognised him.","definition[1]":"a long flat surface on top of a piece of furniture, especially in a kitchen","definition[2]":"a small object that you use in some games that are played on a board","definition[3]":"a piece of electrical equipment that counts something","example[1]":"Set the video counter to zero before you press play.","definition[4]":"a computer program that counts the number of people who have visited a website","definition[5]":"an action that tries to prevent something bad from happening, or an argument that is used to prove that something is wrong","example[2]":"The road blocks were a counter to terrorist attacks in that area.","note[0]":"counter to","definition[6]":"to say something in order to try to prove that what someone said was not true or as a reply to something","example[3]":"‘I could ask the same thing of you, ’ she countered.","example[4]":"He was determined to counter the bribery allegations.","note[1]":"counter an argument/an allegation/a criticism etc","definition[7]":"to do something in order to prevent something bad from happening or to reduce its bad effects","example[5]":"Exercise helps to counter the effects of stress.","definition[8]":"the opposite of something","example[6]":"a counterproductive thing to do  (=producing results opposite to what you wanted)","example[7]":"It is not hard to find a counter-example (=an example that shows the opposite).","definition[9]":"done or given as a reaction to something, especially to oppose it","example[8]":"claims and counterclaims","definition[10]":"matching something","example[9]":"my counterpart in the American system  (=someone who has the same job as I have)","definition[11]":"the place where you are served in a shop, bank etc","example[10]":"Please pay at the checkout counter.","definition[12]":"if something can be done or obtained across or over the counter, it can be done easily in a shop, bank etc without making special arrangements","example[11]":"You can also withdraw and deposit money across the counter in any of our branches just by presenting your card.","definition[13]":"something that is kept or sold under the counter can only be obtained illegally or unofficially"}