{"word[0]":"remark","definition[0]":"something that you say when you express an opinion or say what you have noticed","synonym[0]":"comment","example[0]":"Unfortunately, a local journalist overheard the remark.","collocation[0]":"make a remark","example[1]":"I’m sorry, I shouldn’t have made that remark.","collocation[1]":"ignore a remark","example[2]":"He ignored my remark and carried on working.","collocation[2]":"address your remarks to somebody","example[3]":"He addressed all his remarks to her husband.","collocation[3]":"mean something by a remark","example[4]":"What did you mean by that remark?","collocation[4]":"a casual/throwaway remark","example[5]":"These days a casual remark can get you into trouble.","example[6]":"I didn’t mean to upset you – it was just a throwaway remark.","collocation[5]":"a chance remark","example[7]":"I found out about their relationship from a chance remark Teddy made at dinner.","collocation[6]":"a personal remark","example[8]":"He kept making personal remarks about Tom.","collocation[7]":"a racist/sexist remark","example[9]":"The men are accused of making racist remarks to a taxi driver in a dispute over a fare.","example[10]":"When faced with a sexist remark, women have to either confront the person or ignore it.","collocation[8]":"a disparaging remark","example[11]":"My aunt always makes disparaging remarks about my appearance.","collocation[9]":"a rude remark","example[12]":"The children kept interrupting and making rude remarks.","collocation[10]":"a snide remark","example[13]":"Will you stop making snide remarks about my mother!","collocation[11]":"a witty remark","example[14]":"I tried to think of a witty remark to make.","collocation[12]":"a sarcastic remark","example[15]":"She was always making sarcastic remarks about his work.","definition[1]":"to say something, especially about something you have just noticed","example[16]":"‘This house must be very old, ’ he remarked.","example[17]":"Anderson left the table, remarking that he had some work to do.","note[0]":"remark that","example[18]":"He remarked on the difference in security measures at the two airports.","note[1]":"remark on/upon"}