{"word[0]":"opposite","definition[0]":"if one thing or person is opposite another, they are facing each other","example[0]":"The people sitting opposite us looked very familiar.","example[1]":"on the wall opposite the door","definition[1]":"as different as possible from something else","example[2]":"I thought the medicine would make him sleep, but it had the opposite effect.","example[3]":"At the opposite extreme,  Ashworth’s style is very simple and modern.","example[4]":"Bob was quicker than Ed? It’s usually the opposite way round.","example[5]":"two parties at opposite ends of the political spectrum","note[0]":"at the opposite end of the scale/spectrum","example[6]":"a political philosophy that was opposite to everything she believed in","note[1]":"opposite to","definition[2]":"the opposite direction, way etc is directly away from someone or something","example[7]":"She turned and walked off in the opposite direction.","example[8]":"But the sign was pointing the opposite way.","definition[3]":"the opposite side, corner, edge etc of something is on the other side of the same area, often facing it","example[9]":"The store was on the opposite side of the street.","example[10]":"the drawing on the opposite page","example[11]":"They work at opposite ends of the country (=a long distance apart), so only see each other at weekends.","definition[4]":"a person or thing that is as different as possible from someone or something else","example[12]":"She’s quite shy, the exact opposite of Becky.","example[13]":"The two men were complete opposites – Simon tall and fair, Clive short and dark.","example[14]":"If anything, the opposite was true.","example[15]":"Is it sensible to think of masculine/feminine as polar opposites (=exactly or completely opposite)?","example[16]":"What’s the opposite of ‘optimistic’?","note[2]":"opposite of","collocation[0]":"the complete/total opposite","example[17]":"She is the complete opposite of her sister.","collocation[1]":"the exact/precise/direct opposite","example[18]":"My own experience says that the exact opposite is true.","collocation[2]":"the polar opposite of something","example[19]":"These two viewpoints seem like polar opposites.","example[20]":"Mum was the polar opposite of dear old Dad.","collocation[3]":"the opposite is the case/is true","example[21]":"People believe the Sun moved around the Earth, but Copernicus showed that the opposite was the case.","collocation[4]":"exactly/precisely the opposite","example[22]":"It looks simple, but it is exactly the opposite.","collocation[5]":"the very opposite","example[23]":"Exercise does not increase the appetite - in fact, the very opposite is true.","collocation[6]":"just/quite the opposite","example[24]":"He wasn’t laughing. Quite the opposite, in fact.","collocation[7]":"do the opposite","example[25]":"Whatever I tell him to do, he does the opposite.","definition[5]":"in a position on the other side of the same area","example[26]":"Hannah lives just opposite."}