{"word[0]":"gas","plural[0]":"gases","definition[0]":"a substance such as air, which is not solid or liquid, and usually cannot be seen","note[0]":"a gas cylinder/bottle (=for storing gas)","example[0]":"hydrogen gas","example[1]":"a cloud of toxic gas","note[1]":"toxic/poisonous/noxious gases","definition[1]":"a clear substance like air that is burned for heating or cooking","example[2]":"The explosion was caused by a gas leak from the water heater.","example[3]":"Can you light the gas for me?","note[2]":"gas cooker/stove/oven","definition[2]":"a liquid made from petroleum, used mainly for producing power in the engines of cars, trucks etc","example[4]":"I probably spend over $200 a month on gas.","example[5]":"The mechanic found a hole in the gas tank.","definition[3]":"a clear substance like air that is used for medical reasons, for example to make people feel less pain or make them sleep during an operation","example[6]":"an anaesthetic gas","definition[4]":"a type of gas used as a weapon, because it harms or kills people when they breathe it in","example[7]":"mustard gas","definition[5]":"the condition of having a lot of air in your stomach","form[0]":"ADJECTIVES/NOUN + gas","collocation[0]":"natural gas","example[8]":"The main part of natural gas is methane.","collocation[1]":"a poisonous/toxic gas","example[9]":"Carbon monoxide is the main poisonous gas in car exhaust.","collocation[2]":"a noxious gas","example[10]":"A noxious gas was discovered to be leaking from the pipe.","collocation[3]":"a greenhouse gas","example[11]":"We need to reduce greenhouse gas emissions.","collocation[4]":"nerve gas","example[12]":"Troops were exposed to low levels of nerve gas during the conflict.","collocation[5]":"tear gas","example[13]":"Police using tear gas had clashed with protestors.","form[1]":"gas + NOUN","collocation[6]":"a gas cooker/oven/stove","example[14]":"Gas cookers are more efficient than electric ones.","collocation[7]":"a gas fire","example[15]":"She turned on the gas fire.","collocation[8]":"a gas cylinder","example[16]":"One of the gas cylinders exploded.","collocation[9]":"a gas bottle","example[17]":"The gas bottles need to be stored in a safe place.","collocation[10]":"a gas leak","example[18]":"If you suspect a gas leak, do not strike a match or even turn on an electric light.","collocation[11]":"a gas supply","example[19]":"The engineers had quite a challenge to install the new gas supply.","collocation[12]":"gas reserves","example[20]":"Norway has far greater gas reserves than the UK.","collocation[13]":"a gas pipeline","example[21]":"The Chinese and Russian governments are cooperating in gas pipeline projects.","collocation[14]":"a gas bill","example[22]":"Household gas bills have increased dramatically.","collocation[15]":"gas production","example[23]":"The company expanded its gas production facilities.","collocation[16]":"the gas industry","example[24]":"There are plans to nationalize the country's gas industry.","definition[6]":"to poison or kill someone with gas","definition[7]":"to talk for a long time about unimportant or boring things","synonym[0]":"chat","example[25]":"They were just gassing away.","definition[8]":"a substance which is not solid or liquid at normal temperatures, and which usually cannot be seen","example[26]":"Greenhouse gases are the direct result of pollution.","example[27]":"Over 40% of Pakistan’s energy needs are supplied by gas."}