{"word[0]":"video","plural[0]":"videos","definition[0]":"a copy of a film or television programme, or a series of events, recorded on videotape","example[0]":"Let’s stay at home and watch a video.","example[1]":"Rewind the video right to the beginning.","example[2]":"The school will be making a video of the play.","example[3]":"coming soon to a video store near you","example[4]":"How much does it cost to hire videos?","note[0]":"hire a video","example[5]":"The movie has not yet been released on video.","note[1]":"on video","definition[1]":"a plastic box containing special tape for recording programmes and films on television","synonym[0]":"videotape","example[6]":"Have we got a blank video  (=one with nothing recorded on it yet) anywhere?","definition[2]":"a machine used to record television programmes or show videos","synonym[1]":"VCR","example[7]":"Can you set the video to record the football match?","note[2]":"programme/set the video","definition[3]":"the process of recording or showing television programmes, films, real events etc on videotape","example[8]":"The course aims to help children learn through video.","definition[4]":"a short film that is made to go with a particular piece of popular music","synonym[2]":"music video","definition[5]":"a digital recording of an event, for example one made using a mobile phone","example[9]":"a video clip shown on the Internet","heading[0]":"– Meaning 4: the process of recording or showing television programmes, films, real events etc on videotape","form[0]":"video + NOUN","collocation[0]":"video footage","example[10]":"Police are currently studying video footage to identify the rioters.","collocation[1]":"a video recording","example[11]":"Can a video recording of an interview with a child be used in a court as evidence?","collocation[2]":"a video image","example[12]":"Video images of the surgery are sent to a special lecture theatre, so that students can observe.","collocation[3]":"a video clip","example[13]":"You can download video clips from the Internet.","collocation[4]":"video evidence","example[14]":"Video evidence of illegal activities can later be used in court.","collocation[5]":"record something on video","example[15]":"She had no idea that her purchase was being recorded on video.","collocation[6]":"be captured/caught on video","example[16]":"The crime was captured on video.","definition[6]":"to record a television programme, film, or a real event on a video","example[17]":"Could you video the movie at 8.00?","example[18]":"A friend videoed the wedding.","definition[7]":"relating to or used in the process of recording and showing pictures on television","example[19]":"video production","example[20]":"video materials for language teaching","definition[8]":"a copy of a film or television programme recorded on videotape","example[21]":"a video shop","definition[9]":"a videotape","example[22]":"a blank video","example[23]":"The movie was released on DVD and on video.","definition[10]":"a video cassette recorder","definition[11]":"the process of recording and showing television programmes, films, real events etc using video equipment","example[24]":"Interactive learning has been greatly advanced by the introduction of video.","example[25]":"video games"}