{"word[0]":"care","signpost[0]":"looking after somebody","definition[0]":"the process of looking after someone, especially because they are ill, old, or very young","example[0]":"high standards of medical care","example[1]":"They shared the care of the children.","example[2]":"Care facilities for the elderly are inadequate.","example[3]":"The children had been left in the care of a babysitter.","note[0]":"in somebody’s care","example[4]":"Mentally ill patients will be under the care of a psychiatrist.","note[1]":"be under somebody’s care","signpost[1]":"keeping something in good condition","definition[1]":"the process of doing things to keep something in good condition and working correctly","example[5]":"With proper care, the washing machine should last for years.","example[6]":"advice on skin care","signpost[2]":"carefulness","definition[2]":"when you are careful to avoid damage, mistakes etc","example[7]":"The note on the box said ‘Fragile – handle with care’.","example[8]":"The picture had been drawn with great care.","signpost[3]":"problem/worry","definition[3]":"something that causes problems and makes you anxious or sad","example[9]":"At last I felt free from my cares.","example[10]":"Alex looked as though he didn’t have a care in the world (=had no problems or worries).","example[11]":"a man with the cares of the world on his shoulders (=with a lot of problems or worries)","form[0]":"types of care","collocation[0]":"medical care","example[12]":"People expect good standards of medical care.","collocation[1]":"health care","example[13]":"The government has put a lot more money into health care.","collocation[2]":"hospital care","example[14]":"£50.6m is to be spent on hospital care.","collocation[3]":"community care","example[15]":"Most mentally ill people are now treated through community care.","collocation[4]":"home care","example[16]":"You can find home care through family service agencies.","collocation[5]":"patient care","example[17]":"The changes should lead to better patient care.","collocation[6]":"inpatient/outpatient care","example[18]":"Outpatient care is generally less expensive than a stay in hospital.","collocation[7]":"nursing care","example[19]":"The important thing is the quality of the nursing care.","collocation[8]":"residential care","example[20]":"They used the money to pay for residential care.","collocation[9]":"intensive care","example[21]":"He needed intensive care for several weeks.","collocation[10]":"after-school care","example[22]":"Children with both parents working long hours need after-school care.","collocation[11]":"constant/round-the-clock care","example[23]":"He needs round-the-clock care.","collocation[12]":"short-term/long-term care","example[24]":"The home provides short-term care for elderly people.","collocation[13]":"provide care","example[25]":"The charity provides care and shelter for homeless people.","collocation[14]":"need/require care","example[26]":"She had an aging mother who required constant care.","collocation[15]":"receive care","example[27]":"Every citizen has the right to receive health care.","form[1]":"care + NOUN","collocation[16]":"a care worker","example[28]":"She's a part-time care worker with mentally ill adults.","collocation[17]":"care services/facilities","example[29]":"How much money is spent on health care services?","definition[4]":"if you do something with care, you are careful to avoid damage, mistakes etc","example[30]":"She put the needle in with great care.","example[31]":"Everyone should take care in the sun.","display[0]":"caution","definition[5]":"care to avoid danger or risks, or care about trusting information that might not be true","example[32]":"Her evidence should be treated with caution.","example[33]":"There was a certain lack of caution among investors.","display[1]":"prudence","definition[6]":"a sensible and careful attitude that makes you avoid unnecessary risks – a rather formal use","example[34]":"Banks should show more prudence in lending money.","display[2]":"vigilance","definition[7]":"careful attention to what is happening, so that you will notice any danger or illegal activity","example[35]":"Governments from across the world have called for greater vigilance against Internet-based crime.","example[36]":"There is a need for constant vigilance to protect vulnerable people.","display[3]":"regard for something","definition[8]":"careful attention and consideration shown to something, to avoid danger or risks – used especially when someone fails to do this","example[37]":"The court heard that the company had shown no regard for the safety of its employees.","example[38]":"These men are cold-blooded killers and have little regard for human life.","display[4]":"tact","definition[9]":"care not to say anything that might offend or upset someone","example[39]":"He handled the matter with a great deal of tact.","display[5]":"discretion","definition[10]":"care to deal with situations in a way that does not embarrass, upset or offend people, especially by not telling any of their secrets","example[40]":"Any confidential information was treated with discretion.","definition[11]":"to think that something is important, so that you are interested in it, worried about it etc","example[41]":"‘He looked angry.’ ‘I don’t care!’","example[42]":"The only thing he seems to care about is money.","note[2]":"care about","example[43]":"She didn’t care what her father thought.","note[3]":"care what/how/whether etc","definition[12]":"to be concerned about what happens to someone, because you like or love them","example[44]":"She felt that nobody cared.","example[45]":"I care about him and hate to see him hurt like this.","display[6]":"take care of somebody","definition[13]":"to make sure a child or an old or sick person is safe and has the things they need","example[46]":"I have to look after my little brother.","example[47]":"Taking care of a baby is hard work.","example[48]":"She is taking care of her grandmother while her grandfather is in hospital.","display[7]":"care for somebody","definition[14]":"to take care of someone. Care for somebody is less common and more formal than take care of/look after somebody","example[49]":"He was cared for by a team of nurses.","example[50]":"Caring for an elderly relative can be very rewarding.","display[8]":"nurse","definition[15]":"to look after someone who is ill","example[51]":"He nursed his wife through a long illness.","example[52]":"The monks nursed him back to health (=looked after him until he was well again).","display[9]":"babysit","definition[16]":"to look after children in the evening while their parents go out somewhere","example[53]":"I’ll ask Jane to babysit on Wednesday night.","example[54]":"He used to babysit for Mary when she worked nights.","display[10]":"mind","definition[17]":"to look after a child while their parents are not there, especially for a short time","example[55]":"Will you mind the baby while I go to the shop?","definition[18]":"(Cooperative for American Relief to Everywhere) an organization that sends special boxes of food, clothing, and medicine called ‘CARE packages’ to places in the world where they are needed. The organization started in the US but now includes 12 member countries."}