{"word[0]":"nurse","definition[0]":"someone whose job is to look after people who are ill or injured, usually in a hospital","example[0]":"The nurse is coming to give you an injection.","example[1]":"The school nurse sent Sara home.","example[2]":"a male nurse","example[3]":"a senior nurse","example[4]":"a student nurse  (=someone who is learning to be a nurse)","example[5]":"a psychiatric nurse  (=a nurse for people who are mentally ill)","example[6]":"a community nurse","definition[1]":"a woman employed to look after a young child","synonym[0]":"nanny","signpost[0]":"sick people","definition[2]":"to look after someone who is ill or injured","example[7]":"He’s been nursing an elderly relative.","example[8]":"After Ray’s operation, Mrs Stallard nursed him back to health.","type[0]":"intransitive usually in progressive","definition[3]":"to work as a nurse","example[9]":"She spent several years nursing in a military hospital.","signpost[1]":"rest","definition[4]":"to rest when you have an illness or injury so that it will get better","example[10]":"Shaw has been nursing an injury, and will not play on Sunday.","explanation[0]":"Nurse is never passive in this meaning","signpost[2]":"feed a baby","definition[5]":"if a woman nurses a baby, she feeds it with milk from her breasts","example[11]":"information on nutrition for nursing mothers","definition[6]":"if a baby nurses, it sucks milk from its mother’s breast","signpost[3]":"your feelings","definition[7]":"to keep a feeling or idea in your mind for a long time, especially an angry feeling","example[12]":"For years he had nursed a grievance against his former employer.","note[0]":"nurse a grudge/grievance/ambition etc","signpost[4]":"take care of something","definition[8]":"to take special care of something, especially during a difficult situation","example[13]":"He bought the hotel in 1927 and managed to nurse it through the Depression.","note[1]":"nurse something through/along etc","definition[9]":"if you nurse a drink, especially an alcoholic one, you drink it very slowly","example[14]":"Oliver sat at the bar, nursing a bottle of beer.","definition[10]":"to hold something carefully in your hands or arms close to your body","example[15]":"a child nursing a kitten"}