{"word[0]":"occupation","definition[0]":"a job or profession","example[0]":"Please state your name, address and occupation.","example[1]":"professional and managerial occupations","example[2]":"manual occupations","definition[1]":"when a large group of people enter a place and take control of it, especially by military force","example[3]":"the German occupation of France","note[0]":"occupation of","example[4]":"The area is under occupation  (=controlled by a foreign army).","note[1]":"under occupation","definition[2]":"a way of spending your time","synonym[0]":"pastime","example[5]":"One of my childhood occupations was collecting stamps.","definition[3]":"when someone lives or stays in a building or place","example[6]":"When the first scientists came to the region they found little evidence of human occupation.","collocation[0]":"manual occupations/blue-collar occupations","example[7]":"People from manual occupations are most at risk of experiencing poverty.","collocation[1]":"professional occupations/white-collar occupations","example[8]":"professional occupations such as medicine or the law","example[9]":"Teachers’ pay compares poorly with that of other white-collar occupations.","collocation[2]":"skilled/unskilled occupations","example[10]":"Plumbing and carpentry are highly skilled occupations.","example[11]":"Workers in unskilled occupations are finding fewer job opportunities.","collocation[3]":"a working-class/middle-class occupation","example[12]":"Teaching is regarded as a middle-class occupation.","example[13]":"Working-class occupations may be divided into skilled, semi-skilled and unskilled.","collocation[4]":"a male/female occupation","example[14]":"traditional female occupations such as nursing","collocation[5]":"managerial occupations","example[15]":"Women in managerial occupations tend to have children later.","collocation[6]":"service occupations","example[16]":"Around two thirds of the labour force is employed in service occupations.","collocation[7]":"have an occupation","example[17]":"The people in the region have a variety of occupations.","collocation[8]":"choose an occupation","example[18]":"Young people need help with choosing a suitable occupation.","collocation[9]":"take up an occupation","example[19]":"Many of his colleagues have taken up another occupation.","example[20]":"Our recent graduates have entered a wide range of occupations.","collocation[10]":"follow an occupation","example[21]":"The third son followed his father’s occupation.","definition[4]":"the period from 1940–44 during World War II, when France was occupied by the German army","definition[5]":"a job or profession, used especially on official forms or for writing about the jobs people do","example[22]":"Please state your name, age, and occupation.","example[23]":"The least stressful occupations in our study were museum work and library work."}