{"word[0]":"leader","signpost[0]":"in control","definition[0]":"the person who directs or controls a group, organization, country etc","note[0]":"political/military/religious leader","example[0]":"the largest ever gathering of world leaders (=people who are in charge of countries)","example[1]":"His air of confidence makes him a natural leader.","note[1]":"natural/born leader","example[2]":"the leader of the local black community","note[2]":"leader of","definition[1]":"the person or group that is in front of all the others in a race or competition","example[3]":"County Championship leaders of Hampshire","signpost[1]":"product/company","definition[2]":"the product or company that is the best or most successful","example[4]":"These products are firmly established as the market leaders.","example[5]":"a world leader in defence and space electronics","note[3]":"leader in","signpost[2]":"newspaper","definition[3]":"a piece of writing in a newspaper giving the paper’s opinion on a subject","synonym[0]":"editorial","example[6]":"‘The Times’ leader column","signpost[3]":"musician","definition[4]":"the main violin player in an orchestra","signpost[4]":"musical director","definition[5]":"someone who directs the playing of a musical group","signpost[5]":"tape","definition[6]":"the part at the beginning of a film or recording tape which has nothing on it","signpost[6]":"branch","definition[7]":"a long thin branch that grows from the stem of a bush or tree beyond other branches","form[0]":"ADJECTIVES/NOUN + leader","collocation[0]":"a political leader","example[7]":"He became the country’s most influential political leader.","collocation[1]":"a military leader","example[8]":"The country’s military leader had seized power in a coup.","collocation[2]":"a religious/spiritual leader","example[9]":"The Pope is the Roman Catholics’ spiritual leader.","collocation[3]":"a natural leader/a born leader","example[10]":"He has the confidence of a born leader.","collocation[4]":"a strong/weak leader","example[11]":"She’s a strong leader and an intelligent woman.","collocation[5]":"a good/effective leader","example[12]":"What characteristics make a good leader?","collocation[6]":"a charismatic leader","example[13]":"Martin Luther King, one of the most charismatic leaders of the Civil Rights movement","collocation[7]":"a world leader","example[14]":"The president and other world leaders are meeting to discuss the environment.","collocation[8]":"a party leader","example[15]":"Brown was quickly chosen as the party leader.","collocation[9]":"a government leader","example[16]":"He was the first EU government leader to visit the newly elected US president.","collocation[10]":"an opposition leader","example[17]":"The opposition leader accused the government of not being able to control unemployment.","collocation[11]":"the Conservative/Liberal Democrat/Socialist etc leader","example[18]":"the Conservative leader, David Cameron","collocation[12]":"a union/business leader","example[19]":"Business leaders welcomed a cut in the interest rate.","collocation[13]":"a team/group/project etc leader","example[20]":"Ask your team leader for advice.","collocation[14]":"choose a leader/choose somebody as leader","example[21]":"The party is meeting to choose a new leader.","collocation[15]":"elect a leader/elect somebody as leader","example[22]":"He was elected leader of his country by a huge majority.","collocation[16]":"appoint a leader","example[23]":"Green was appointed deputy leader.","example[24]":"Party members will vote next week to elect a new leader.","example[25]":"leaders of developing nations from around the world","display[0]":"ruler","definition[8]":"someone, such as a king or queen or a military leader, who has official power over a country or area","example[26]":"Sheik Mohammed, ruler of Dubai","example[27]":"Argentina’s former military rulers","display[1]":"head of state","definition[9]":"someone who leads a country or state","example[28]":"Twenty-one heads of state will meet at the annual World Trade summit.","display[2]":"figurehead","definition[10]":"someone who is seen as the leader of a country or organization, although he or she does not have any real power","example[29]":"the Queen’s role as a national figurehead","example[30]":"There are advantages in having a respected personality as a figurehead for the organisation.","display[3]":"ringleader","definition[11]":"someone who leads a group that is doing something illegal or wrong","example[31]":"The alleged ringleaders of the gang have been arrested.","example[32]":"the ringleaders of the airplane bomb plot","definition[12]":"the person who directs or controls a team, organization, country etc","example[33]":"He was accompanied on the trip by the chairmen of the three major US-auto makers and 18 other business leaders.","definition[13]":"a product, service, or company that is the most important or successful of its type"}