{"word[0]":"influence","definition[0]":"the power to affect the way someone or something develops, behaves, or thinks, without using direct force or orders","example[0]":"As a scientist, his influence was immense.","example[1]":"the unions’ influence over local politics","note[0]":"influence on/over","definition[1]":"someone or something that has an influence on other people or things","example[2]":"For centuries the country remained untouched by outside influences.","example[3]":"Gayle’s mother said I was a bad influence on her daughter.","note[1]":"bad/good/positive etc influence (on somebody)","collocation[0]":"have an influence on somebody/something","example[4]":"His works have had an influence on many modern writers.","collocation[1]":"exert an influence","example[5]":"Technology exerts a powerful influence over our lives.","collocation[2]":"use your influence","example[6]":"She wasn’t afraid to use her influence to get what she wanted.","collocation[3]":"exercise/wield influence","example[7]":"The Federal Reserve exercises influence on the economy by setting short-term interest rates.","collocation[4]":"come/fall under the influence of somebody/something","example[8]":"They had come under the influence of a religious sect.","collocation[5]":"extend your influence","example[9]":"Syria had the opportunity to extend its influence in the region.","collocation[6]":"a good/positive influence","example[10]":"Television can have a positive influence on young people.","collocation[7]":"a bad/negative influence","example[11]":"He thought her friends were a bad influence.","collocation[8]":"a big/great influence","example[12]":"The goalkeeper’s injury had a big influence on the match.","collocation[9]":"an important/significant/major influence","example[13]":"Parents have an important influence on children's development.","example[14]":"He was a major influence on my musical tastes.","collocation[10]":"considerable influence","example[15]":"Well-organized pressure groups can exert considerable influence on the government.","collocation[11]":"a strong/powerful influence","example[16]":"The press can have a powerful influence on the way people vote.","collocation[12]":"a deep/profound influence","example[17]":"His writings had a profound influence on the Romantic poets.","collocation[13]":"a growing influence","example[18]":"Many people are worried about the growing influence of these websites.","collocation[14]":"a lasting influence","example[19]":"His travels in Africa had a lasting influence on his work.","collocation[15]":"a direct/indirect influence","example[20]":"The Cubist painters had a direct influence on his work.","example[21]":"The federal government has an indirect influence on investment through its control of bank credits.","collocation[16]":"a calming/soothing influence","example[22]":"The music seemed to have a calming influence.","collocation[17]":"somebody’s personal influence","example[23]":"Frank used his personal influence to get his son a job at the newspaper.","collocation[18]":"political/cultural/economic influence","example[24]":"French political influence began to dominate the country.","collocation[19]":"outside/external influence","example[25]":"They must make their own decisions, free from external influence.","example[26]":"The US remains the biggest outside influence on the country.","collocation[20]":"undue influence","example[27]":"He felt that the United States wielded undue influence in Europe.","definition[2]":"to affect the way someone or something develops, behaves, thinks etc without directly forcing or ordering them","example[28]":"Marx was strongly influenced by the historian Niebuhr.","example[29]":"Several factors are likely to influence this decision.","note[2]":"influence a decision/outcome/choice etc","example[30]":"What influenced you to take up nursing?","note[3]":"influence somebody to do something","definition[3]":"power to have an effect on the way something happens or the way someone does something","example[31]":"The car magazines have been gaining influence in recent years.","example[32]":"The banks’ directors say they have little influence over their presidents’ actions.","definition[4]":"to have an effect on the way something happens or the way someone does something","example[33]":"Children are heavily influenced by advertising.","example[34]":"The number of training centres will influence what training is available and who will receive it.","note[4]":"influence what/where/ how etc"}