{"word[0]":"unit","signpost[0]":"group","definition[0]":"a group of people working together as part of a larger group","example[0]":"The man is in the hospital’s intensive care unit.","signpost[1]":"measuring","definition[1]":"an amount of something used as a standard of measurement","example[1]":"The watt is a unit of electrical power.","note[0]":"unit of","signpost[2]":"part","definition[2]":"a thing, person, or group that is regarded as one single whole part of something larger","example[2]":"a Russian army unit","example[3]":"The family is the basic social unit of modern society.","signpost[3]":"part of a book","definition[3]":"one of the numbered parts into which a textbook (=a book used in schools) is divided","definition[4]":"a single complete product made by a company","example[4]":"The factory’s output is now up to 150,000 units each month.","signpost[4]":"part of a machine","definition[5]":"a piece of equipment which is part of a larger machine","note[1]":"control/display/filter etc unit","signpost[5]":"furniture","definition[6]":"a piece of furniture, especially one that can be attached to others of the same type","example[5]":"fitted kitchen units British English","example[6]":"storage units","signpost[6]":"apartment","definition[7]":"a single apartment in a larger building","signpost[7]":"school/university","definition[8]":"an amount of work that a student needs to do in order to complete a particular course","definition[9]":"any whole number less than ten","example[7]":"hundreds, tens, and units","example[8]":"Output is now up to 150,000 units each month.","example[9]":"The unit cost (=cost to make one unit) of the computer system comprised about 80% materials, 15% overheads and 5% labour.","example[10]":"Unit sales (=number of units sold) of watches climbed about 35% last year.","definition[10]":"a company, organization, or group that is part of a larger company, organization, or group","example[11]":"The computer maker agreed to sell its Network Services unit.","example[12]":"the fiber optics business unit of Tyco Electronics","example[13]":"She works in the production unit.","definition[11]":"an amount or quantity of something used as a standard of measurement","example[14]":"The dollar is the basic unit of currency in the US.","definition[12]":"a single share in a UNIT TRUST","example[15]":"The company is splitting its 5p nominal shares into units of 2.5p to increase their marketability","definition[13]":"a single building on an INDUSTRIAL ESTATE","example[16]":"He is renting a factory unit as a workshop.","definition[14]":"a piece of machinery which is part of a larger machine","example[17]":"This is the control unit for the central heating."}