{"word[0]":"warn","definition[0]":"to tell someone that something bad or dangerous may happen, so that they can avoid it or prevent it","example[0]":"‘Be careful, the rocks are slippery, ’ Alex warned.","example[1]":"Travellers to Africa are being warned about the danger of HIV infection.","note[0]":"warn somebody about something","example[2]":"Salmon farmers are warning of the severe crisis facing the industry.","note[1]":"warn (somebody) of something","example[3]":"I warned you not to walk home alone.","note[2]":"warn somebody (not) to do something","example[4]":"Motorists are being warned to avoid the centre of London this weekend.","example[5]":"We warned them that there was a bull in the field.","note[3]":"warn somebody (that)","definition[1]":"to tell someone about something before it happens so that they are not worried or surprised by it","example[6]":"Warn her you’re going to be back late.","explanation[0]":"In everyday English, people often use the expression let someone know rather than warn someone:","example[7]":"Let me know if you’re not going to finish on time.","heading[0]":"GRAMMAR: Patterns with warn","explanation[1]":"You warn someone that something will happen  (=you say it will definitely happen)","example[8]":"I must warn you that the treatment will have side effects","explanation[2]":"In the past, you say that someone warned that something would happen  (=they said that it would definitely happen)","example[9]":"Campaigners warned that the airport would harm the environment","explanation[3]":"You warn that something might happen or could happen","example[10]":"He warned that there might be another war","explanation[4]":"Warn is also often used in the passive You say that someone was warned about something","example[11]":"We were warned about the dangers of global warming","definition[2]":"to tell someone about something bad or dangerous that might happen, so that they can avoid it or prevent it","example[12]":"I warned you about sitting out in the sun too long.","example[13]":"We were warned that there could be delays on the motorway, so we took another route.","display[0]":"give somebody a warning","definition[3]":"to tell someone that if they continue to behave in an unsatisfactory way, they will be punished","example[14]":"He’s already been given several warnings about handing in his essays late.","example[15]":"The US gave a warning that if the hostages were not released, it would be forced to take military action.","display[1]":"alert","definition[4]":"to officially or publicly warn people of possible danger so that they can prevent it or be ready to deal with it","example[16]":"a campaign to alert people to the dangers of smoking","example[17]":"An anonymous caller alerted the police that a bomb was due to go off.","display[2]":"tip somebody off","definition[5]":"to secretly warn someone about something that is going to happen – used especially about warning the police about a crime","example[18]":"The police found the drugs after being tipped off by local residents.","example[19]":"Informants tipped the FBI off.","display[3]":"caution","definition[6]":"to warn someone to do or not to do something in order to avoid a dangerous or bad result","example[20]":"People are being cautioned against using credit cards abroad, in case of fraud.","example[21]":"Health officials have cautioned the public to wash fruit thoroughly before eating it.","display[4]":"forewarn","definition[7]":"to warn someone about something that is going to happen, so that they are expecting it or ready for it","example[22]":"We had been forewarned that the roads weren’t very good."}