{"word[0]":"evidence","definition[0]":"facts or signs that show clearly that something exists or is true","example[0]":"At present we have no evidence of life on other planets.","note[0]":"evidence of","example[1]":"There is no evidence for these claims.","note[1]":"evidence for","example[2]":"Do you have evidence that this treatment works?","note[2]":"evidence that","definition[1]":"information that is given in a court of law in order to prove that someone is guilty or not guilty","example[3]":"Murrow’s evidence was enough to convict Hayes of murder.","example[4]":"He refused to give evidence at the trial.","example[5]":"There was very little evidence against the two men.","note[3]":"evidence against","example[6]":"The documents may be used in evidence at the trial.","note[4]":"in evidence","collocation[0]":"have evidence","example[7]":"Do the police have any evidence against him?","collocation[1]":"find evidence","example[8]":"The authorities failed to obtain enough evidence to convict him.","collocation[2]":"gather/collect evidence","example[9]":"Police experts are still collecting evidence at the scene of the crime.","collocation[3]":"look for/search for evidence","example[10]":"The investigation will look for evidence of financial mismanagement.","collocation[4]":"hide evidence","example[11]":"The killer may have tried to burn the bodies in an attempt to hide the evidence.","collocation[5]":"plant evidence","example[12]":"He claims the evidence was planted there by the police.","collocation[6]":"produce evidence","example[13]":"The case was adjourned to allow the police time to produce further evidence.","collocation[7]":"give evidence","example[14]":"Ms White has agreed to give evidence at their trial.","collocation[8]":"consider/examine/study the evidence","example[15]":"Having considered all the evidence, the court found him not guilty.","collocation[9]":"good/clear/strong evidence","example[16]":"There is clear evidence that smoking causes heart disease.","collocation[10]":"hard evidence","example[17]":"They have no hard evidence to support their claim.","collocation[11]":"fresh evidence","example[18]":"The police say they may have found fresh evidence which proves Tilly was at the scene of the crime.","collocation[12]":"medical/scientific evidence","example[19]":"There isn’t any medical evidence to support the claim.","collocation[13]":"reliable/credible","example[20]":"Do you think their evidence is reliable?","collocation[14]":"flimsy","example[21]":"Their conclusions are drawn from some very flimsy evidence.","collocation[15]":"convincing/compelling","example[22]":"The data provides compelling evidence that the climate is changing.","collocation[16]":"overwhelming","example[23]":"The evidence against him was overwhelming.","collocation[17]":"conclusive/incontrovertible/irrefutable evidence","example[24]":"We need irrefutable evidence before making an arrest.","example[25]":"The government claims it has conclusive evidence of the country’s nuclear weapons programme.","collocation[18]":"conflicting evidence","example[26]":"With so much conflicting evidence, it’s almost impossible to make a decision.","collocation[19]":"incriminating evidence","example[27]":"The robbers were careful not to leave any incriminating evidence behind.","collocation[20]":"damning evidence","example[28]":"Her testimony proved to be the most damning evidence against him.","collocation[21]":"circumstantial evidence","example[29]":"His barrister claims the case against him is based on circumstantial evidence.","collocation[22]":"anecdotal evidence","example[30]":"Anecdotal evidence suggests that gang-related violence is on the increase.","collocation[23]":"empirical evidence","example[31]":"Where is the empirical evidence to back up these claims?","collocation[24]":"admissible evidence","example[32]":"Her lawyer advised that the tape would not be admissible evidence in court.","collocation[25]":"a piece of evidence","example[33]":"The study produced one interesting piece of evidence.","collocation[26]":"not a scrap/shred of evidence","example[34]":"There is not one scrap of evidence against our client.","explanation[0]":"Evidence is an uncountable noun and is not used in the plural You say","example[35]":"The judge listened to all the evidence","bad_example[0]":"The judge listened to all the evidences","explanation[1]":"Evidence is always followed by a singular verb","example[36]":"The evidence is  very clear","explanation[2]":"When talking about one fact or sign, you say a piece of evidence","example[37]":"The police found a vital piece of evidence","definition[2]":"to show that something exists or is true","example[38]":"The volcano is still active, as evidenced by the recent eruption.","note[5]":"as (is) evidenced by","explanation[3]":"Evidence is usually passive","definition[3]":"information or facts given in a court of law to prove that someone is guilty"}