{"word[0]":"portion","definition[0]":"a part of something larger, especially a part that is different from the other parts","example[0]":"The main character’s childhood takes up a good portion of the film.","note[0]":"significant/substantial/major/good portion","example[1]":"The front portion of the rocket breaks off.","note[1]":"portion of","example[2]":"The rent on his portion of the apartment was $500 a month.","definition[1]":"an amount of food for one person, especially when served in a restaurant","synonym[0]":"serving","example[3]":"Do you have any children’s portions?","example[4]":"He served generous portions  (=large portions) of soup from a black pot.","example[5]":"a huge portion of roast beef","definition[2]":"a share of something, such as responsibility, blame, or a duty, that is divided between a small number of people","example[6]":"The other driver must bear a portion of the blame for the accident.","heading[0]":"– Meaning 1: a part of something larger, especially a part that is different from the other parts","collocation[0]":"large","example[7]":"Temperatures over a large portion of the central and eastern states were well below normal.","collocation[1]":"substantial/major/considerable","example[8]":"He owns a substantial portion of the company.","example[9]":"This bonus constitutes a significant portion of their total income.","collocation[2]":"a good portion","example[10]":"She spends a good portion of her paycheck on clothes and entertainment.","collocation[3]":"a small portion","example[11]":"A small portion of western Croatia remained under Habsburg control.","heading[1]":"– Meaning 2: an amount of food for one person, especially when served in a restaurant","collocation[4]":"big/large","example[12]":"I was hungry so I asked for a large portion of french fries.","collocation[5]":"generous","example[13]":"Spoon a generous portion of the sauce over the pasta.","example[14]":"One way of losing weight is to eat smaller portions.","collocation[6]":"a double portion","example[15]":"I ordered a double portion of chicken."}