{"word[0]":"drawer","definition[0]":"part of a piece of furniture, such as a desk, that you pull out and push in and use to keep things in","note[0]":"sock/cutlery drawer (=one for keeping socks, or knives, forks etc in)","example[0]":"She took a file from her desk drawer.","example[1]":"The scissors are in the kitchen drawer  (=drawer in a piece of kitchen furniture).","example[2]":"He opened the top drawer of his desk, and took out a brown envelope.","note[1]":"top/bottom/right-hand/left-hand drawer","form[0]":"ADJECTIVES/NOUN + drawer","collocation[0]":"the top/bottom/middle drawer","example[3]":"He opened the bottom drawer and got out a T-shirt.","collocation[1]":"a desk/table/dresser etc drawer","example[4]":"The passports are in my desk drawer.","collocation[2]":"a kitchen drawer","example[5]":"There's some string in that kitchen drawer.","collocation[3]":"a sock/underwear/cutlery etc drawer","example[6]":"He hid the gun in his sock drawer.","collocation[4]":"the right-hand/left-hand drawer","example[7]":"Have you looked in the left-hand drawer?","collocation[5]":"open a drawer","example[8]":"Jonathan opened the drawer and took out a fork.","collocation[6]":"pull open/pull out a drawer","example[9]":"He pulled open drawers until he found the papers.","collocation[7]":"close/shut a drawer","example[10]":"She shut the drawer and locked it with a small key.","collocation[8]":"go through/look through/search through drawers","example[11]":"I've been through all my drawers and I can't find it.","collocation[9]":"rummage/rifle through drawers","example[12]":"Someone had been in my bedroom and rummaged through my drawers.","definition[1]":"a person who writes a cheque and so gives an instruction to his or her bank to pay a sum of money to someone","definition[2]":"words written by a bank on a cheque that has not been paid, usually because there is not enough money in the account of the person who wrote it","definition[3]":"a person who signs a BILL OF EXCHANGE that gives an instruction to another person to pay a sum of money at a particular time"}