{"word[0]":"frightening","definition[0]":"making you feel afraid or nervous","synonym[0]":"scary","example[0]":"Going into hospital can be very frightening for a child.","example[1]":"It was the most frightening experience of my life.","example[2]":"It’s frightening to think what could happen if terrorists did get hold of nuclear materials.","note[0]":"it is frightening (to do something)","definition[1]":"making you feel frightened","example[3]":"Being held at gunpoint had been the most frightening moment of his life.","example[4]":"The experience was very frightening.","definition[2]":"frightening. Scary is less formal than frightening and is very common in everyday English","example[5]":"The movie was really scary.","example[6]":"There were some scary moments.","display[0]":"chilling","definition[3]":"frightening, especially because violence, cruelty, or danger is involved","example[7]":"a chilling tale of revenge, murder and madness","example[8]":"The court heard chilling details about the attack.","display[1]":"spooky","definition[4]":"frightening and strange, especially because something involves ghosts or powers that people do not understand","example[9]":"The forest is really spooky in the dark.","example[10]":"a spooky coincidence","example[11]":"spooky stories","display[2]":"creepy","definition[5]":"frightening in a way that makes you feel nervous, especially when you are not sure exactly why – used especially about places, people, and feelings","example[12]":"This place is really creepy. Let’s get out of here.","example[13]":"a creepy guy","example[14]":"Do you know that creepy feeling when you're sure someone’s there but you can’t see or hear anything?","display[3]":"eerie","definition[6]":"strange and frightening","example[15]":"There was an eerie silence immediately after the bomb went off.","example[16]":"an eerie light","example[17]":"an eerie feeling","display[4]":"intimidating","definition[7]":"making you feel frightened, nervous, or lacking in confidence","example[18]":"Big schools can be an intimidating place for young children.","example[19]":"Giving evidence in court is often a rather intimidating experience.","example[20]":"the intimidating presence of a large number of soldiers","display[5]":"menacing","definition[8]":"frightening because you think someone is going to hurt you, even though they have not said or done anything violent – used especially about someone’s expression or voice","example[21]":"The woman had a very menacing look.","example[22]":"‘I’d like to have a word with you outside, ’ he said in a menacing tone.","heading[0]":"very frightening","display[6]":"terrifying","definition[9]":"extremely frightening","example[23]":"a terrifying thought","example[24]":"The experience was absolutely terrifying.","example[25]":"She spoke of the terrifying ordeal (=a very bad experience) when three armed men burst into her house.","display[7]":"hair-raising","definition[10]":"very frightening and involving danger, in a way that is exciting","example[26]":"hair-raising stories","example[27]":"a hair-raising motorcycle ride through the streets of Havana","display[8]":"spine-chilling","definition[11]":"very frightening – used about films, stories etc that involve frightening or cruel events","example[28]":"a spine-chilling novel by Stephen King","display[9]":"blood-curdling","definition[12]":"very frightening – used especially about sounds","example[29]":"a blood-curdling scream","example[30]":"a blood-curdling growl"}