{"word[0]":"watch","definition[0]":"to look at someone or something for a period of time, paying attention to what is happening","example[0]":"Do you mind if I watch?","example[1]":"We sat and watched the sunset.","example[2]":"Most parents don’t know what their kids are watching on TV.","example[3]":"He watched helplessly as Paula fell into the icy water.","note[0]":"watch carefully/closely/intently etc","example[4]":"Watch carefully. You may learn something.","example[5]":"Harriet watched him with interest.","note[1]":"watch (somebody/something) with interest/amusement/delight etc","example[6]":"The debate was watched by 97 million viewers.","note[2]":"watch television/a film etc","example[7]":"I watched him go, then went home.","note[3]":"watch somebody/something do/doing something","example[8]":"Ruth could not bear to watch her parents arguing.","example[9]":"I watched to see how he’d react.","note[4]":"watch to do something","example[10]":"It’s useful to watch how other pilots handle the glider.","note[5]":"watch what/how/when etc","signpost[0]":"be careful","definition[1]":"to act carefully in order to avoid an accident or unwanted situation","example[11]":"She’s a student and has to watch her budget closely.","example[12]":"Watch your head on the shelf.","example[13]":"Watch yourself (=be careful) in Madrid; there are some rough areas.","example[14]":"Employees should watch what they say in personal emails.","note[6]":"watch what you say/your tongue/your language/your mouth etc","example[15]":"He may be a former athlete, but he still has to watch his weight.","note[7]":"watch your weight/watch what you eat","example[16]":"Watch he doesn’t run into the road.","note[8]":"watch (that)","example[17]":"Silly old fool! Why doesn’t he watch where he’s going?","note[9]":"watch what/how/where etc","example[18]":"Watch what you’re doing! It’s spilling everywhere!","signpost[1]":"pay attention","definition[2]":"to pay attention to a situation that interests or worries you to see how it develops","example[19]":"The government will watch the progress of these schemes with interest.","example[20]":"American companies are watching Japanese developments closely.","note[10]":"watch closely/carefully","signpost[2]":"care for","definition[3]":"to stay with someone or something so that nothing bad happens to them","example[21]":"She watches the kids for us occasionally.","signpost[3]":"secretly","definition[4]":"to secretly watch a person or place","example[22]":"I feel like I’m being watched.","collocation[0]":"watch television","example[23]":"We watched television all evening.","collocation[1]":"watch a programme/film/show","example[24]":"They were watching a film on TV.","collocation[2]":"closely","example[25]":"I watched him closely while he was giving his evidence.","collocation[3]":"carefully","example[26]":"She watched very carefully and did exactly as he did.","collocation[4]":"helplessly","example[27]":"He watched helplessly as his son was swept away by the waves.","collocation[5]":"intently","example[28]":"Her father was watching her intently as she worked.","collocation[6]":"with interest/amusement etc","example[29]":"A small crowd of people were watching them with interest.","collocation[7]":"in horror/amazement etc","example[30]":"He watched in horror as the flames engulfed his house.","definition[5]":"to look at someone or something for a period of time and pay attention to what is happening","example[31]":"They were all watching the game.","example[32]":"I watched him get out of his car.","example[33]":"We are watching carefully to see how the situation develops.","display[0]":"keep an eye on somebody/something","definition[6]":"to watch someone or something carefully so that you are prepared if anything bad happens","example[34]":"The doctors are keeping a careful eye on her.","example[35]":"Can you keep an eye on my bag for me?","example[36]":"Keep an eye on house prices before you decide to sell.","display[1]":"observe","definition[7]":"to watch someone or something carefully in order to learn more about them","example[37]":"A 24-hour camera is being used to observe the birds’ behaviour.","example[38]":"During your teacher training you will be encouraged to observe lessons.","display[2]":"monitor","definition[8]":"to watch a situation carefully to see how it changes over a period of time","example[39]":"Class teachers are responsible for monitoring the progress of each student.","example[40]":"Economists are monitoring the situation carefully.","display[3]":"spy on somebody","definition[9]":"to watch someone secretly in order to find out what they are doing","example[41]":"He hired a private detective to spy on her.","example[42]":"In the 1960s, government agencies were spying on everybody.","heading[0]":"someone who watches something","display[4]":"spectator","definition[10]":"someone who watches an event, especially a sports event","example[43]":"There were 4,500 spectators at the game.","example[44]":"a crowd of spectators","display[5]":"viewer","definition[11]":"someone who watches television","example[45]":"Millions of television viewers listened to the president’s speech.","example[46]":"programmes for younger viewers","display[6]":"audience","definition[12]":"the people who watch a play or performance, or the people who watch a particular television programme","example[47]":"The audience roared with laughter and clapped.","example[48]":"It attracted a television audience of seven million.","display[7]":"onlooker","definition[13]":"someone who watches something happening without being involved in it, especially in the street","example[49]":"A man was standing on the roof, watched by a crowd of onlookers below.","display[8]":"observer","definition[14]":"someone who watches and pays attention to particular situations and events, because they are interested in them, or it is their job","example[50]":"She was a shrewd observer of human nature.","example[51]":"a political observer who writes for The Independent newspaper","example[52]":"The United Nations has sent military observers to the Sudan.","definition[15]":"a small clock that you wear on your wrist or keep in your pocket","example[53]":"My watch has stopped.","example[54]":"How do you keep track of time if you don’t wear a watch?","example[55]":"She glanced nervously at her watch.","note[11]":"look at/glance at/consult your watch","definition[16]":"when you watch someone or something carefully, or pay careful attention to them, so that you are ready to act if necessary","example[56]":"The police arrived to keep watch on the mouth of the tunnel.","example[57]":"Security forces kept a close watch on our activities.","example[58]":"He maintained a 24-hour watch over his son.","note[12]":"watch on/over","definition[17]":"a group of people whose job is to guard or protect someone or something","example[59]":"We were arrested and held until the arrival of the night watch (=people responsible for keeping the streets safe at night, especially in past times).","definition[18]":"a period of time when it is someone’s duty to stay somewhere and look for signs of danger","example[60]":"The first watch is from now until midnight.","example[61]":"Who’s on watch tonight?","note[13]":"on watch","collocation[8]":"look at/glance at your watch","example[62]":"I looked at my watch. It was 4.30.","collocation[9]":"check/consult your watch","example[63]":"He checked his watch and saw that it was only 2.15.","collocation[10]":"a watch says ...","example[64]":"My watch says twenty past one.","collocation[11]":"put your watch forward","example[65]":"The passengers were reminded to put their watches forward three hours.","collocation[12]":"put your watch back","example[66]":"On Saturday night, don’t forget to put your watch back an hour.","collocation[13]":"set your watch","example[67]":"I set my watch by the clock on the mantelpiece.","collocation[14]":"wear a watch","example[68]":"He wore a gold watch.","collocation[15]":"a watch stops","example[69]":"Her watch had stopped after getting wet in the sea.","collocation[16]":"somebody’s watch is fast/runs fast","example[70]":"No, it’s only 12.15 – your watch must be fast.","collocation[17]":"somebody’s watch is slow/runs slow","example[71]":"'He’s late.' 'Maybe his watch is running slow.'"}