{"word[0]":"slow","comparative[0]":"slower","superlative[0]":"slowest","signpost[0]":"not quick","definition[0]":"not moving, being done, or happening quickly","example[0]":"The car was travelling at a very slow speed.","example[1]":"a slow walker","example[2]":"The economy faces a year of slower growth.","example[3]":"Take a few deep, slow breaths.","signpost[1]":"taking too long","example[4]":"Taylor was concerned at the slow progress of the investigations.","example[5]":"The legal system can be painfully slow (=much too slow).","example[6]":"The wound was slow to heal.","note[0]":"slow to do something","signpost[2]":"with delay","definition[1]":"if you are slow to do something, you do not do it as soon as you can or should","example[7]":"Farmers have been slow to exploit this market.","example[8]":"Their attitude was slow to change.","example[9]":"He has been slow in announcing the name of his successor.","note[1]":"slow in doing something","example[10]":"New ideas have been slow in coming.","signpost[3]":"longer time","definition[2]":"taking a longer time than something similar","example[11]":"We got on the slow train  (=one that stops at more stations) by mistake.","definition[3]":"if business or trade is slow, there are not many customers or not much is sold","example[12]":"Business is often slow in the afternoon.","example[13]":"The company is experiencing slow sales.","signpost[4]":"clock","definition[4]":"if a clock or watch is slow, it is showing a time earlier than the correct time","example[14]":"The clock is about five minutes slow.","note[2]":"ten minutes/five minutes etc slow","signpost[5]":"not clever","definition[5]":"not good or quick at understanding things","example[15]":"Teaching assistants have time to help the slower pupils.","signpost[6]":"photography","definition[6]":"a slow film does not react to light very easily","definition[7]":"not moving quickly or not doing something quickly","example[16]":"I was always one of the slowest runners in my class.","example[17]":"My computer’s really slow compared to the ones at school.","display[0]":"gradual","definition[8]":"happening, developing, or changing slowly over a long period of time","example[18]":"a gradual rise in the Earth’s temperature","example[19]":"I’ve noticed a gradual improvement in his work.","display[1]":"leisurely","definition[9]":"moving or doing something slowly, especially because you are enjoying what you are doing and do not have to hurry","example[20]":"a leisurely breakfast","example[21]":"They walked at a leisurely pace.","display[2]":"unhurried","definition[10]":"moving or doing something in a slow and calm way, without rushing at all","example[22]":"She continued to listen, seeming relaxed and unhurried.","example[23]":"the doctor’s calm unhurried manner","display[3]":"sluggish","definition[11]":"moving or reacting more slowly than usual, especially because of a loss of power or energy. Also used when business, sales, or the economy seem very slow","example[24]":"The car seems rather sluggish going uphill.","example[25]":"The drink was making her sluggish.","example[26]":"the company’s sluggish performance this year","example[27]":"Sales have been sluggish.","display[4]":"lethargic","definition[12]":"moving slowly, because you feel as if you have no energy and no interest in doing anything","example[28]":"She woke up feeling heavy and lethargic.","example[29]":"His son seemed depressed and lethargic.","display[5]":"languid","definition[13]":"slow and with very little energy or activity – used about people, actions, or periods of time","example[30]":"She lifted her hand in a languid wave.","example[31]":"a long languid afternoon in the middle of summer","example[32]":"He was pale and had rather a languid air about him.","display[6]":"glacial","definition[14]":"extremely slow – used especially about the speed at which something happens","example[33]":"Things are changing, but at a glacial pace.","definition[15]":"to become slower or to make something slower","example[34]":"Her breathing slowed and she fell asleep.","example[35]":"Ian slowed up as he approached the traffic lights.","definition[16]":"slowly","example[36]":"If you go slower, you’ll see much more.","definition[17]":"to become slower","example[37]":"Consumer borrowing has slowed noticeably since Jan. 1.","example[38]":"They’re delaying sales reports to the factory to slow down shipments of new cars.","definition[18]":"not happening, being done, or moving with much speed or not as quickly as it should","example[39]":"Prices are rising, but at a slower pace than before.","example[40]":"a period of slow economic growth","example[41]":"We expect a slow improvement in sales.","example[42]":"Designing a new car can be a slow process.","definition[19]":"to not do something immediately","example[43]":"The city has been slow to follow through on many of the budget cuts it promised.","definition[20]":"if business or trade is slow, there are not many customers or not many things are sold","example[44]":"Manufacturers say that business remains slow.","example[45]":"Monday is usually the slowest day of the week."}