{"word[0]":"interview","definition[0]":"a formal meeting at which someone is asked questions in order to find out whether they are suitable for a job, course of study etc","example[0]":"a portfolio of work presented at interview","example[1]":"an interview for a job on the ‘Los Angeles Times’","note[0]":"interview for","definition[1]":"an occasion when a famous person is asked questions about their life, experiences, or opinions for a newspaper, magazine, television programme etc","note[1]":"newspaper/radio/television interview","example[2]":"Elton John gave an interview to Barbara Walters  (=he answered her questions).","example[3]":"an exclusive interview (=one that is given to only one newspaper, programme etc)","example[4]":"an interview with the president","note[2]":"interview with","definition[2]":"an official meeting with someone who asks you questions","example[5]":"a police interview","collocation[0]":"have an interview","example[6]":"She has an interview next week for a teaching job in Paris.","collocation[1]":"go for an interview","example[7]":"I went for an interview at a software company yesterday.","collocation[2]":"get an interview","example[8]":"He was one of only five people to get an interview out of more than 100 people who applied.","collocation[3]":"be called/invited for (an) interview","example[9]":"Applicants who are called for interview may be asked to have a medical exam.","collocation[4]":"do an interview","example[10]":"The interview was conducted in French.","collocation[5]":"give somebody an interview","example[11]":"We gave her an interview, but decided not to offer her the job.","form[0]":"ADJECTIVES/NOUN + interview","collocation[6]":"a job interview","example[12]":"Try to predict the questions you might get in your job interview.","collocation[7]":"an informal/formal interview","example[13]":"Applicants will normally have an informal interview with the manager.","example[14]":"One out of every six candidates reached the formal interview.","collocation[8]":"the first interview","example[15]":"He felt the first interview had gone well.","collocation[9]":"a second/follow-up interview","example[16]":"She was asked back for a second interview.","collocation[10]":"a mock interview","example[17]":"Mock interviews are one way in which students can improve their job-seeking skills.","collocation[11]":"a face-to-face interview","example[18]":"I had to do a face-to-face interview followed by an entry test.","collocation[12]":"a telephone interview","example[19]":"The first stage is a telephone interview.","form[1]":"interview + NOUN","collocation[13]":"interview technique","example[20]":"The book gives some useful advice on interview technique.","collocation[14]":"an interview question","example[21]":"Some of the interview questions were quite difficult to answer.","collocation[15]":"the interview panel","example[22]":"The interview panel were very impressed with her enthusiasm.","definition[3]":"a meeting in which someone is asked questions, to find out if they are suitable for a job, or to help the police find out about a crime. Also used about someone being asked questions on TV, in a newspaper, in a magazine etc","example[23]":"I’ve got another job interview tomorrow.","example[24]":"Since the police interview, she had changed her statement.","example[25]":"an interview with Keith Richards","display[0]":"interrogation","definition[4]":"an occasion when someone is asked a lot of questions for a long time in order to get information, sometimes using threats, usually by the police or the army","example[26]":"He claims he was tortured during his interrogation.","example[27]":"Police interrogation methods have been questioned.","display[1]":"cross-examination","definition[5]":"an occasion when someone is asked questions about what they have just said, in order to see if they are telling the truth, especially in a court of law","example[28]":"Under cross-examination, the only witness said she could not be sure about what she saw.","display[2]":"consultation","definition[6]":"a meeting with a doctor or an expert to discuss treatment or to get advice","example[29]":"The therapist charges $100 for a half hour consultation.","example[30]":"Would you like to come back for another consultation?","display[3]":"audience","definition[7]":"a formal meeting with a very important person","example[31]":"He was granted an audience with the Pope.","definition[8]":"to ask someone questions during an interview","example[32]":"We’re interviewing six candidates for the job.","note[3]":"interview somebody for something","example[33]":"The police want to interview you about the accident.","note[4]":"interview somebody about something","definition[9]":"a formal meeting at which someone is asked questions to find out whether they are suitable for a job","example[34]":"Applicants will be called for interview next month.","definition[10]":"an occasion when someone, for example a politician, is asked questions about their views or actions on television, for a newspaper etc","example[35]":"In a radio interview this morning, the Chancellor ruled out a rise in interest rates.","definition[11]":"an occasion when someone is asked questions about a product or service, to find out how it can be improved or the best way to advertise it","example[36]":"a market research interview","definition[12]":"to ask someone questions in a formal meeting in order to find out if they are suitable for a job","example[37]":"She was appointed without any other candidates being interviewed.","example[38]":"I’ve been interviewing all afternoon.","example[39]":"We interviewed twelve people for the job.","definition[13]":"to ask someone, for example a politician, questions about their views or actions on television, for a newspaper etc","example[40]":"The chairman refused to be interviewed.","definition[14]":"to ask someone questions about a product or service, to find out how it can be improved or the best way to advertise it","example[41]":"A sample of 200 women were interviewed."}