{"word[0]":"possible","definition[0]":"if something is possible, it can be done or achieved","opposite[0]":"impossible","example[0]":"Is it possible to get tickets for the game?","example[1]":"It might be possible for the documents to  be sent over.","example[2]":"Computer technology makes it possible for many people to  work from home.","example[3]":"I want to avoid the rush hour traffic if possible.","example[4]":"I walk or use public transport whenever possible.","example[5]":"We are doing everything possible to track down the killer.","example[6]":"Our staff will help you in every way possible.","example[7]":"Even if it were technically possible, we do not have the money to do it.","example[8]":"She decided to stay as far away from him as was humanly possible.","definition[1]":"a possible answer, cause etc might be true","example[9]":"There seem to be only two possible explanations.","example[10]":"the possible causes of a child’s learning difficulties","example[11]":"It’s possible that the letter got lost in the post.","note[0]":"it is possible (that)","definition[2]":"a possible event or thing might happen or exist","example[12]":"Heavy rain is possible later in the day.","example[13]":"the possible effect on the health of local people","example[14]":"You need to look at the possible consequences of your actions.","example[15]":"In Hollywood, anything is possible (=anything can happen, even though it may seem very unlikely).","collocation[0]":"it is possible to do something","example[16]":"From the hilltop it was possible to see the sea.","collocation[1]":"make it possible to do something","example[17]":"Medical advances have made it possible to keep more patients alive.","collocation[2]":"if possible","example[18]":"If possible, take light exercise first thing in the morning.","collocation[3]":"where/wherever/whenever possible","example[19]":"Choose wholemeal varieties of flour and pasta, where possible.","collocation[4]":"do everything possible","example[20]":"We must do everything possible to limit our impact on the Earth's environment.","collocation[5]":"in every way possible","example[21]":"The company helped promote the scheme in every way possible.","collocation[6]":"perfectly/quite possible","example[22]":"Combining a family with a career is perfectly possible .","collocation[7]":"theoretically possible","example[23]":"It is theoretically possible for all students to get full marks.","collocation[8]":"technically possible","example[24]":"Amendments to software may be technically possible, but are inadvisable.","collocation[9]":"humanly possible","example[25]":"It is not humanly possible to work for more than fifteen hours a day.","example[26]":"I think it’s possible that we could win the race.","example[27]":"I want to get back by 5 o'clock if possible.","example[28]":"Please let me know your answer as soon as possible.","display[0]":"feasible","definition[3]":"if an idea or plan is feasible, it is possible and you can find a practical way of doing it","example[29]":"We need to find out first if the idea is technically feasible.","example[30]":"It is not feasible to have security cameras in every part of the building.","example[31]":"Da Silva considered it feasible that uranium could be produced on an industrial scale.","display[1]":"viable","definition[4]":"possible and likely to be successful, and therefore worth doing","example[32]":"Nuclear energy is the only viable alternative to coal or gas.","example[33]":"The product needs to be commercially viable.","example[34]":"We have yet to find a viable solution to the problem.","example[35]":"The company was no longer financially viable (=it could not make enough money to be able to continue).","display[2]":"workable","definition[5]":"a workable plan, system, or solution is one that can be done or used","example[36]":"By early morning, they had arrived at a workable and safe solution.","example[37]":"The company would have a tough job convincing people that the deal was workable.","display[3]":"doable","definition[6]":"if something is doable, you have enough money, energy, or skill to do it","example[38]":"This exercise programme is doable for most people.","example[39]":"Do you think the walk is doable?","example[40]":"Hosting great parties is fun, easy, and doable on any budget.","example[41]":"The book is full of interesting and doable recipes.","display[4]":"achievable","definition[7]":"able to be achieved","example[42]":"A 15% cut in carbon emissions is achievable.","example[43]":"Perfect democracy is not attainable, nor is perfect freedom or perfect justice.","display[5]":"realistic","definition[8]":"if something is realistic, it seems sensible to think that it can be done or achieved","example[44]":"a realistic target","example[45]":"Their expectations didn’t seem very realistic.","example[46]":"It is important to set yourself realistic goals.","definition[9]":"someone or something that might be suitable or acceptable for a particular purpose","example[47]":"Frank’s a possible for the job."}