{"word[0]":"available","definition[0]":"something that is available is able to be used or can easily be bought or found","example[0]":"Tickets are available from the box office.","example[1]":"Meetings were held to update employees as soon as new information became available.","example[2]":"Further building can continue when money is made available.","example[3]":"Every available space on the wall was covered in pictures.","example[4]":"Parking is readily available near the station entrance.","note[0]":"readily/widely available","example[5]":"Not enough data is available to scientists.","note[1]":"available to","example[6]":"Funds are available to assist teachers who want to attend the conference.","note[2]":"available to do something","example[7]":"No figures are available for the number of goods sold.","note[3]":"available for","example[8]":"There are plenty of jobs available in the area.","note[4]":"available in","explanation[0]":"In everyday English, people usually say that a book, record etc is out rather than available:","example[9]":"His new album is out now.","definition[1]":"someone who is available is not busy and has enough time to talk to you","example[10]":"Collins was not available for comment on Thursday night.","definition[2]":"someone who is available does not have a wife, boyfriend etc, and therefore may want to start a new romantic relationship with someone else","collocation[0]":"become available","example[11]":"Luckily a house soon became available for us.","collocation[1]":"make something available","example[12]":"With the Internet it is possible to make learning available wherever it is needed.","collocation[2]":"be easily/readily/freely available","example[13]":"The material used was cheap and readily available.","collocation[3]":"be widely available","example[14]":"Organic food is now widely available.","collocation[4]":"the best available","example[15]":"We use the best available technology.","collocation[5]":"the only available something","example[16]":"One small tree was the only available protection from the sun.","collocation[6]":"the nearest available something","example[17]":"Ruth sat down in the nearest available armchair.","collocation[7]":"every available something","example[18]":"You should practise speaking the language at every available opportunity.","definition[3]":"if something is available, you can buy it, get it, or use it","example[19]":"Are there any tickets still available for Saturday?","example[20]":"There’s no room for more books – we’ve used up all the available space.","definition[4]":"if a seat or room is free, it is not being used by anyone","example[21]":"Excuse me, is this seat free?","example[22]":"The hotel never has any free rooms over the Christmas period.","display[0]":"vacant","definition[5]":"if a house or room is vacant, it is available for someone to use or rent","example[23]":"If you’re looking for somewhere to rent, I think there’s a vacant apartment in my building.","example[24]":"I’ll ask around and see if there’s a room vacant somewhere.","example[25]":"The sign on the toilet said ‘vacant’.","display[1]":"spare","definition[6]":"a spare room, key, tyre etc is one that you have in addition to the ones that you normally use, and is therefore available to be used","example[26]":"We have a spare room you can stay in.","example[27]":"There’s a spare key in this drawer.","example[28]":"I got the spare tyre out of the back of the car.","display[2]":"empty","definition[7]":"an empty room, building etc has no one in it","example[29]":"The house was empty for two months before it was sold.","example[30]":"They have three empty rooms now that the kids have moved out.","display[3]":"on offer","definition[8]":"if something is on offer, it is available for people to choose from","example[31]":"There is a huge network of cycle tracks on offer.","example[32]":"Other facilities on offer in this excellent hotel include a hairdressing salon, a coffee shop, and a children's play room.","example[33]":"the variety of delicious fruits on offer","display[4]":"taken","definition[9]":"if a seat or room is taken, it is not available for other people to use, because someone has already arranged to use it","example[34]":"I’m sorry – that seat is taken.","example[35]":"I’m afraid all our rooms are taken at the moment.","definition[10]":"able to be bought, used, seen etc","example[36]":"They plan to make the product widely available in vending machines.","example[37]":"Full-year results aren’t yet available.","definition[11]":"if someone is available, they are not busy and can see or talk to people","example[38]":"I’m afraid the chairman isn’t available at the moment.","example[39]":"Are you available for a meeting next Wednesday?"}