{"word[0]":"get off","definition[0]":"to leave a place, or to help someone to leave a place","example[0]":"We’ll try and get off straight after lunch.","example[1]":"Get off my land!","note[0]":"get off something","example[2]":"I’ll phone you as soon as I’ve got the children off to school.","note[1]":"get somebody off","signpost[0]":"finish work","definition[1]":"to finish work and leave the place where you work at the end of the day","example[3]":"I usually get off at six o’clock.","example[4]":"What time do you get off work?","signpost[1]":"send something","definition[2]":"to send a letter or package by post","example[5]":"I’ll have to get this letter off by tonight.","example[6]":"I’ll get the forms off to you today.","note[2]":"get something off to","definition[3]":"to remove a piece of clothing","example[7]":"Why don’t you get those wet clothes off?","signpost[2]":"not be punished","definition[4]":"if someone gets off, they are not punished for doing something wrong, or they receive only a small punishment","example[8]":"In the end he got off because there wasn’t enough evidence against him.","example[9]":"The police felt he had got off very lightly.","example[10]":"If you’re lucky, you’ll get off with a fine.","signpost[3]":"help somebody not be punished","definition[5]":"to help someone avoid being punished for a crime","example[11]":"Her lawyers were confident that they could get her off.","definition[6]":"to go to sleep, or to help a child go to sleep","example[12]":"I went to bed but couldn’t get off to sleep.","example[13]":"It took us ages to get the baby off.","definition[7]":"to start in a particular way","example[14]":"The day had got off to a bad start.","signpost[4]":"stop talking about something","definition[8]":"to stop talking about a subject","example[15]":"Can we get off the subject of death, please?","signpost[5]":"stop touching something","definition[9]":"used to tell someone to stop touching something or someone","example[16]":"Get off me!","example[17]":"Get off those cakes, or there’ll be trouble.","example[18]":"Get off  (=stop touching me)!","definition[10]":"to tell someone that they are asking you for too much or are behaving in a way you will not accept","example[19]":"He wanted £50, but I told him where to get off.","definition[11]":"used to tell someone that they should stop being lazy and start doing something useful"}