{"word[0]":"live","signpost[0]":"in a place/home","definition[0]":"if you live in a place, you have your home there","example[0]":"A rather odd family came to live next door to us.","example[1]":"As soon as I saw the place, I knew I didn’t want to live there.","example[2]":"Does Paul still live here?","example[3]":"We’re still looking for somewhere to live.","example[4]":"They’ve finally found a place to live.","example[5]":"Most seventeen-year-olds still live at home (=live with their parents).","example[6]":"I’m quite happy living alone.","example[7]":"The house has 3,600 square feet of living space (=the areas of a house you live in).","example[8]":"I ran away from home and lived rough for nine months.","note[0]":"live rough","example[9]":"They lived in Holland for ten years.","note[1]":"live in/at/near etc","example[10]":"He lives just across the street from me.","example[11]":"We live only a few miles from the coast.","example[12]":"My grandmother came to live with us when I was ten.","note[2]":"live with","signpost[1]":"plant/animal","definition[1]":"a plant or animal that lives in a particular place grows there or has its home there","example[13]":"These particular birds live on only one island in the Pacific.","note[3]":"live in/on etc","signpost[2]":"at a particular time","definition[2]":"if you live at a particular time, you are alive then","example[14]":"He’s probably the best journalist who ever lived.","note[4]":"the best/greatest etc that/who ever lived","example[15]":"He lived in the eighteenth century.","note[5]":"live before/in/at","example[16]":"She lived at a time when women were not expected to work.","example[17]":"Gladstone lived during a period of great social change.","signpost[3]":"be/stay alive","definition[3]":"to be alive or be able to stay alive","example[18]":"Without light, plants couldn’t live.","example[19]":"He is extremely ill and not expected to live.","example[20]":"The baby only lived a few hours.","example[21]":"People on average are living much longer than before.","example[22]":"I’ll never forget this for as long as I live.","example[23]":"He did not live to see (=live long enough to see) the realization of his dream.","example[24]":"My grandmother lived to 85.","note[6]":"live to (be) 80/90 etc/live to the age of 80/90 etc","example[25]":"She lived to the age of 79.","example[26]":"He knows he’s only got a few months to live.","note[7]":"have two weeks/six months etc to live","signpost[4]":"way of life","definition[4]":"to have a particular type of life, or live in a particular way","example[27]":"They earn enough money to live well (=have plenty of food, clothes etc).","example[28]":"I just want to live my life in my own way.","example[29]":"He’s not well enough to live a normal life.","example[30]":"He had chosen to live the life of a monk.","example[31]":"She’s now in Hollywood living a life of luxury.","example[32]":"We struggle on, living from day to day (=trying to find enough money each day to buy food etc).","example[33]":"He was tired of living out of a suitcase (=spending a lot of time travelling).","example[34]":"The people in this country just want to live in peace.","note[8]":"live in peace/poverty etc","example[35]":"People should not live in fear of crime.","example[36]":"We live in hope that a cure will be found.","example[37]":"The two communities live peacefully alongside each other.","note[9]":"live peacefully/quietly/happily etc","example[38]":"She thought that she would get married and live happily ever after (=like in a children’s story).","example[39]":"Some people like to live dangerously.","example[40]":"Most elderly people prefer to live independently if they can.","example[41]":"She lives a very busy life.","note[10]":"live a quiet/active/healthy etc life","example[42]":"I have always tried to live by my faith  (=according to my religion).","note[11]":"live by","signpost[5]":"earn a living","definition[5]":"the way that someone lives is the way that they earn money to buy food etc","example[43]":"Fishing is the way their families have lived for generations.","example[44]":"They live by hunting and killing deer.","note[12]":"live by doing something","signpost[6]":"exciting life","definition[6]":"to have an exciting life","example[45]":"She wanted to get out and live a little.","example[46]":"We’re beginning to live at last!","signpost[7]":"imagine something","definition[7]":"to imagine that things are happening to you","example[47]":"You must stop living in the past (=imagining that things from the past are still happening).","example[48]":"He lives in a fantasy world.","note[13]":"live in","example[49]":"She lived through her children’s lives.","note[14]":"live through","signpost[8]":"be kept somewhere","definition[8]":"the place where something lives is the place where it is kept","example[50]":"Where do these cups live?","example[51]":"Those big dishes live in the cupboard next to the fridge.","signpost[9]":"still exist/have influence","definition[9]":"if an idea lives, it continues to exist and influence people","example[52]":"Democracy still lives!","example[53]":"His name will live forever.","example[54]":"That day will always live in my memory.","definition[10]":"to have your home somewhere","example[55]":"He lives with his parents.","example[56]":"Where do you live?","example[57]":"Do you like living in Tokyo?","example[58]":"Jo lives next to a busy road.","example[59]":"Judy lives in that nice house on the corner.","example[60]":"How do you like living in the city again after so many years away from it?","example[61]":"In 1905 Russell was living at 4 Ralston Street.","display[0]":"be from/come from","definition[11]":"use this when talking about the country, city, or area where you usually live","example[62]":"My name’s Sharon and I’m from Harlow.","example[63]":"The man is believed to be from somewhere in the north of England.","example[64]":"‘Where are you from?’ ‘I’m from Japan.’","example[65]":"The winner came from Australia.","display[1]":"inhabit","definition[12]":"if a group of people or animals inhabit an area, they live there – used especially in written descriptions","example[66]":"The island is mainly inhabited by sheep.","example[67]":"Some tribes still inhabit the more remote mountains and jungles of the country.","display[2]":"reside","definition[13]":"to live in a particular country, city etc","example[68]":"She now resides in the US.","example[69]":"Miss Badu grew up in Dallas but now resides in Brooklyn.","example[70]":"At that time there were many American writers residing in Paris.","example[71]":"Miss Tonelli, how exactly did you come to reside at your current address?","example[72]":"The government bureau has prepared a booklet for US citizens residing abroad.","display[3]":"grow up","definition[14]":"to live somewhere when you are a child or teenager","example[73]":"This is the neighborhood where my father grew up.","example[74]":"I grew up on a farm in South Africa.","signpost[10]":"living","definition[15]":"not dead or artificial","example[75]":"experiments on live animals","example[76]":"Protesters want to stop the export of live sheep and cattle.","example[77]":"the number of live births per 1,000 population","example[78]":"We were so excited to see real live elephants.","signpost[11]":"tv/radio","definition[16]":"a live television or radio programme is seen or heard on television or radio at the same time as it is actually happening","opposite[0]":"prerecorded","example[79]":"a live radio phone-in show","example[80]":"There will be live TV coverage of tonight’s big match.","signpost[12]":"music/theatre","definition[17]":"a live performance is one in which the entertainer performs for people who are watching, rather than for a film, record etc","example[81]":"A lot of the bars have live music.","example[82]":"The band will be giving a live concert performance next week.","example[83]":"We’ll be playing you a track from his new live album (=album that was recorded from a live performance).","example[84]":"It’s always different when you perform in front of a live audience (=an audience watching a live performance).","definition[18]":"a wire or piece of equipment that is live has electricity flowing through it","example[85]":"Be careful – those wires are live.","signpost[13]":"bombs","definition[19]":"a live bomb still has the power to explode because it has not been used","example[86]":"They came across a field of live, unexploded mines.","signpost[14]":"bullets","definition[20]":"live bullets are real ones that are made of metal and can kill people","opposite[1]":"blank","example[87]":"Troops fired live ammunition to disperse the crowd.","signpost[15]":"issue","definition[21]":"a live subject or problem is one that still interests or worries people","example[88]":"Drink-driving is still very much a live issue.","signpost[16]":"yoghurt","definition[22]":"live yoghurt contains bacteria that are still alive","definition[23]":"if something is broadcast live, it is broadcast on television or radio as it is actually happening","example[89]":"The ceremony will be broadcast live on television.","example[90]":"The match will be shown live by the BBC.","definition[24]":"if people perform live, they perform in front of people who have come to watch, rather than for a film, record etc","example[91]":"I love their music, but I’ve never seen them perform live.","example[92]":"The band is playing live in Birmingham tonight.","example[93]":"Their latest CD was recorded live (=recorded at a live performance) in New York."}