{"word[0]":"shock","signpost[0]":"unexpected event/situation","definition[0]":"if something that happens is a shock, you did not expect it, and it makes you feel very surprised, and usually upset","example[0]":"It was a real shock to hear that the factory would have to close.","note[0]":"it was a shock to find/discover etc that","example[1]":"The news of his death came as a great shock to everyone.","note[1]":"shock to","signpost[1]":"unexpected unpleasant feeling","definition[1]":"the feeling of surprise and disbelief you have when something very unexpected happens, especially something bad or frightening","example[2]":"She was shaking with shock and humiliation.","example[3]":"Mom’s never really gotten over the shock of Dad’s death.","note[2]":"the shock of (doing) something","definition[2]":"a medical condition in which someone looks pale and their heart and lungs are not working correctly, usually after a sudden very unpleasant experience","example[4]":"He was bleeding from the head and suffering from shock.","example[5]":"He is clearly in a state of shock.","example[6]":"The tanker driver was treated for shock and released.","definition[3]":"an electric shock","definition[4]":"a shock absorber","signpost[2]":"sudden change","definition[5]":"a sudden unexpected change which threatens the economic situation, way of life, or traditions of a group of people – used especially in news reports","example[7]":"the oil shocks of the 1970s","signpost[3]":"shaking","definition[6]":"violent shaking caused for example by an explosion or earthquake","example[8]":"The shock was felt miles away.","collocation[0]":"a big/great shock","example[9]":"It was a great shock to find out he had been lying.","collocation[1]":"a terrible/awful shock","example[10]":"Her death was a terrible shock to everyone.","collocation[2]":"a complete/total shock","example[11]":"No one expected the factory to close – it was a complete shock.","collocation[3]":"a nasty shock","example[12]":"Come and sit down. You’ve had a nasty shock.","collocation[4]":"a rude shock","example[13]":"Shopping for food in Miyako brought a rude shock. The prices were breathtaking.","collocation[5]":"get/have a shock","example[14]":"I got a shock when I saw how thin he had become.","collocation[6]":"give somebody a shock","example[15]":"Oh, you gave me quite a shock.","collocation[7]":"get over/recover from a shock","example[16]":"He hasn’t got over the shock of losing his job yet.","collocation[8]":"die of shock","example[17]":"I nearly died of shock when I saw Helen at the door.","collocation[9]":"come as a shock","example[18]":"The collapse of the company came as a shock to us all.","collocation[10]":"be a bit of a shock","example[19]":"I wasn’t expecting to win, so it was a bit of a shock.","collocation[11]":"be a shock to the system","example[20]":"Having to work full-time again was quite a shock to the system.","collocation[12]":"be in for a shock","example[21]":"Anyone who thinks that bringing up children is easy is in for a shock.","collocation[13]":"be in a state of shock","example[22]":"Eva left the room in a state of shock.","collocation[14]":"get the shock of your life","example[23]":"He got the shock of his life when he found out who I was.","definition[7]":"to make someone feel very surprised and upset, and unable to believe what has happened","example[24]":"The hatred in her voice shocked him.","example[25]":"They had been shocked to hear that the hospital was closing down.","note[3]":"shock somebody to hear/learn/discover etc that","example[26]":"It shocked me to think how close we had come to being killed.","note[4]":"it shocks somebody that/how/to do","example[27]":"She was shocked into action by the desperate situation in the orphanages.","note[5]":"shock somebody into (doing) something","definition[8]":"to make someone feel very offended, by talking or behaving in an immoral or socially unacceptable way","example[28]":"He seems to enjoy shocking people.","example[29]":"Just ignore the bad language – they only do it to shock.","definition[9]":"very surprising – used especially in news reports","example[30]":"England’s shock defeat by Luxembourg"}