{"word[0]":"walk","definition[0]":"to move forward by putting one foot in front of the other","note[0]":"walking pace (=the speed that you normally walk at)","example[0]":"‘How did you get here?’ ‘We walked.’","example[1]":"Doctors said he’d never walk again.","example[2]":"We must have walked ten miles today.","note[1]":"walk a mile/200 metres/a short distance etc","example[3]":"I walked all the way to San Rafael.","example[4]":"There are plenty of bars and restaurants within walking distance of the hotel.","note[2]":"within (easy) walking distance (of something)","example[5]":"Carrie walked into the room and sat down in her chair.","note[3]":"walk into/down/up etc","example[6]":"He loved walking in the hills.","definition[1]":"to walk somewhere with someone, especially in order to make sure that they are safe or to be polite","example[7]":"It’s late – I’ll walk you home.","example[8]":"Schools are urging parents to walk their children to school.","note[4]":"walk somebody to something","example[9]":"She walked me to the front gate.","definition[2]":"to take a dog for a walk for exercise","example[10]":"Grandma’s out walking the dog.","definition[3]":"if something has walked, it has disappeared and you think someone may have taken it","example[11]":"My pen seems to have walked.","example[12]":"I missed the bus so I decided to walk.","example[13]":"We’ve walked about eight miles today.","display[0]":"wander","definition[4]":"to walk without any clear purpose or direction","example[14]":"They wandered around the narrow streets of the old city.","display[1]":"stride","definition[5]":"to walk with long steps in a determined, confident, or angry way","example[15]":"A man in a suit came striding purposefully into the hall.","example[16]":"She strode onto the stage and began to address the audience.","display[2]":"pace","definition[6]":"to walk first in one direction and then in another many times, especially because you are nervous","example[17]":"Nick was pacing up and down, waiting for the phone to ring.","display[3]":"march","definition[7]":"to walk quickly with firm regular steps – used especially about soldiers or someone who is angry","example[18]":"The troops marched past with smart uniforms and good discipline.","example[19]":"Sheila marched into the office and demanded an apology.","display[4]":"wade","definition[8]":"to walk through deep water","example[20]":"We had to wade across the river.","display[5]":"stomp","definition[9]":"to walk putting your feet down very hard, especially because you are angry","example[21]":"She turned and stomped off without looking back.","heading[0]":"to walk quietly","display[6]":"tiptoe","definition[10]":"to walk quietly and carefully on your toes because you do not want to make a noise","example[22]":"I tiptoed out trying not to wake the baby.","display[7]":"creep","definition[11]":"to walk quietly and slowly because you do not want anyone to see or hear you","example[23]":"Stella crept up the stairs, hoping not to wake her parents.","display[8]":"sneak","definition[12]":"to walk quietly so that no one notices you, especially because you are doing something you should not do","example[24]":"They sneaked off without paying.","example[25]":"I quickly sneaked out to have a cigarette.","display[9]":"pad","definition[13]":"to walk quietly without wearing shoes – also used about cats and dogs walking quietly","example[26]":"Michelle got up and padded barefoot down to the kitchen.","example[27]":"The cat padded in, asking for her food.","heading[1]":"to walk slowly","display[10]":"trudge","definition[14]":"to walk in a slow tired way because it is difficult to continue walking, or you do not want to go somewhere","example[28]":"The men trudged along the road, heads bent against the wind.","example[29]":"I’ve spent hours trudging around the shops looking for a present.","display[11]":"plod","definition[15]":"to walk slowly in a tired way – often used about a horse, donkey etc","example[30]":"The donkey was plodding slowly along under its heavy load.","example[31]":"I plodded on growing thirstier and hungrier.","display[12]":"shuffle","definition[16]":"to walk very slowly and noisily without lifting your feet off the ground","example[32]":"The old man got up and shuffled to the door.","heading[2]":"to walk with difficulty","display[13]":"limp","definition[17]":"to walk with difficulty because one leg hurts, so that you put most of your weight on the other leg","example[33]":"Jake was limping because of the injury to his knee.","display[14]":"stagger","definition[18]":"to walk or move unsteadily, almost falling over, especially because you are drunk or have been injured","example[34]":"They finally staggered back to the hotel at 4 o'clock in the morning.","example[35]":"He hit her and she staggered and fell.","display[15]":"hobble","definition[19]":"to walk with difficulty in a slow and unsteady way because your legs or feet hurt or have been injured","example[36]":"My new shoes were so painful I could only hobble along.","example[37]":"She hobbled out to the car on crutches.","heading[3]":"to walk for pleasure","display[16]":"take a walk","definition[20]":"to walk somewhere for pleasure","example[38]":"We went for a walk in the park.","display[17]":"stroll","definition[21]":"to walk in a relaxed way, especially for pleasure","example[39]":"People were strolling along beside the river.","example[40]":"On Sunday, they went for a stroll in the park.","display[18]":"hike","definition[22]":"to walk a long way in the mountains or countryside as an activity you enjoy","example[41]":"We’re going hiking in Scotland this summer.","example[42]":"They hiked around the Lake District.","example[43]":"Pat likes doing active things like hiking and horse-riding.","display[19]":"trek","definition[23]":"to go for a walk lasting several days or weeks in a faraway place, carrying your clothes with you","example[44]":"I’ve always wanted to go trekking in Nepal.","example[45]":"They trekked up to Everest Base Camp.","definition[24]":"a journey that you make by walking, especially for exercise or enjoyment","example[46]":"It’s a long walk. Maybe we should get the bus.","example[47]":"a walk through the castle grounds","note[5]":"walk to/through/across etc","definition[25]":"a particular journey that you make by walking, especially one that goes through an interesting or attractive area","example[48]":"He says he’s going on a long walk tomorrow.","example[49]":"Have you ever done the Three Peaks walk?","example[50]":"There is a stunning 10-mile coastal walk from St Andrews to Crail.","note[6]":"coastal/hill etc walk","definition[26]":"an organized event when people walk for pleasure","example[51]":"Let’s all go on the beach walk.","example[52]":"The local tourist office organises a number of guided walks.","definition[27]":"the way someone walks","synonym[0]":"gait","example[53]":"You can often recognize people by their walk.","definition[28]":"when you walk rather than run","example[54]":"Breathless, she slowed to a walk.","collocation[0]":"go for a walk","example[55]":"Let’s go for a walk on the beach.","collocation[1]":"take/have a walk","example[56]":"She took a walk through the town.","collocation[2]":"take somebody/a dog for a walk","example[57]":"Could you take the dog for a walk?","form[0]":"ADJECTIVES/NOUN + walk","collocation[3]":"a long walk","example[58]":"We went for a long walk in the woods.","collocation[4]":"a short walk","example[59]":"The house is only a short walk from local shops.","collocation[5]":"a little walk","example[60]":"I just felt like a little walk.","collocation[6]":"a brisk walk","example[61]":"A brisk walk will improve your circulation.","collocation[7]":"an easy walk","example[62]":"From here it is an easy walk to the summit.","collocation[8]":"a five-mile/ten-kilometre etc walk","example[63]":"He began the five-mile walk back to town.","collocation[9]":"a five-minute/two-hour etc walk","example[64]":"There’s a good restaurant a five-minute walk away.","definition[29]":"a journey that you make on foot, especially for exercise or enjoyment","example[65]":"I took the dog out for a long walk in the fresh air.","example[66]":"We went for some lovely walks.","example[67]":"Do you fancy going out for a walk?","definition[30]":"a long walk in the mountains or countryside","example[68]":"We went for a hike in the woods.","example[69]":"There are some good hikes nearby.","definition[31]":"a slow, relaxed walk","example[70]":"Let’s take a stroll in the park.","example[71]":"We went for a stroll along the river.","definition[32]":"a short relaxed walk, especially to look around a place","example[72]":"We had a wander round the town and then went to the beach.","definition[33]":"used when talking about a long walk in the mountains, countryside etc which lasts for several days and which you do for pleasure. Also used about a long tiring walk somewhere, which you do not want to have to do","example[73]":"They went on a three week trek in the Atlas Mountains.","example[74]":"We then had a long trek back to our hotel with all our luggage.","display[20]":"slog","definition[34]":"a long, tiring, and unpleasant walk, which continues for several hours","example[75]":"It was a dreary slog over bleak and windswept hills.","definition[35]":"an occasion when a group of people walk somewhere together, in order to protest about something","example[76]":"Demonstrators are planning a march through the capital.","example[77]":"a peace march"}