{"word[0]":"casual","definition[0]":"relaxed and not worried, or seeming not to care about something","example[0]":"a casual manner","example[1]":"His eyes were angry, though he sounded casual.","example[2]":"Marsha was quite casual about appearing on TV.","example[3]":"She had a casual attitude to life.","signpost[0]":"not formal","definition[1]":"not formal or not for a formal situation","opposite[0]":"formal","example[4]":"Jean felt more comfortable in casual clothes.","example[5]":"a casual jacket","definition[2]":"employed as a temporary worker or working for only a short period of time","example[6]":"casual labour","example[7]":"staff employed on a casual basis","example[8]":"Chris has occasional casual work but mostly he is unemployed.","definition[3]":"knowing someone or having sex with someone without wanting a close relationship with them","example[9]":"She will never be more than a casual acquaintance.","example[10]":"They had been conducting a casual affair for years.","example[11]":"John just wanted casual sex.","signpost[1]":"without attention","definition[4]":"without any serious interest or attention","example[12]":"He gave us a casual glance as he walked by, but didn’t stop.","example[13]":"To the casual observer  (=to someone who is not looking carefully) Mary seemed quite calm.","signpost[2]":"not planned","definition[5]":"happening by chance without being planned","example[14]":"a casual conversation","example[15]":"He made some casual remark  (=one without thinking much about it) about her holiday.","signpost[3]":"not regular","definition[6]":"doing something or using something sometimes but not regularly or often","synonym[0]":"occasional","example[16]":"a casual drug user","example[17]":"The museum is of great interest, both to experts and to casual visitors.","definition[7]":"casual workers are employed only when they are needed, and are not in permanent or continuous employment","synonym[1]":"TEMPORARY","example[18]":"Traditionally, labour in the construction industry has been employed on a casual basis.","example[19]":"The job was completed using casual labour.","definition[8]":"a casual worker","synonym[2]":"TEMP","example[20]":"This latest recruitment drive is also aimed at casuals."}