{"word[0]":"subscription","definition[0]":"an amount of money you pay, usually once a year, to receive copies of a newspaper or magazine, or receive a service, or the act of paying money for this","example[0]":"You may cancel your subscription at any time.","example[1]":"I’ve decided not to renew my subscription.","example[2]":"Are you interested in taking out a subscription to ‘Newsweek’  (=arranging to buy it on a regular basis)?","note[0]":"subscription to","definition[1]":"an amount of money you pay regularly to be a member of an organization or to help its work, or the act of paying money for this","example[3]":"a subscription to Amnesty International","definition[2]":"when people in a country or place give money in order to pay for something to be done","example[4]":"The church’s 120-foot Gothic spire was paid for by public subscription in 1939.","collocation[0]":"an annual/monthly subscription","example[5]":"An annual subscription to the magazine costs $20.","collocation[1]":"take out a subscription","example[6]":"She took out a subscription to the Scientific American.","collocation[2]":"cancel your subscription","example[7]":"Please give a month's notice if you are cancelling your subscription.","collocation[3]":"renew your subscription","example[8]":"It’s time to renew your subscription.","collocation[4]":"pay a subscription","example[9]":"We pay a monthly subscription for the sports channel.","form[0]":"subscription + NOUN","collocation[5]":"a subscription fee","example[10]":"If you pay a subscription fee, you can watch matches on the Internet.","definition[3]":"an amount of money you pay regularly to receive a newspaper, magazine, or broadcasting or telephone service","example[11]":"A subscription to their quarterly report costs $575 a year.","example[12]":"The World Service TV channel is a subscription service available to millions of homes around the world.","definition[4]":"when a company offers shares to the public","example[13]":"They intend to raise £1.9 million via a share subscription.","example[14]":"The subscription price for the new shares was 225p.","definition[5]":"the act of asking to buy or agreeing to buy shares in a company","example[15]":"25.2 million shares are available for subscription.","example[16]":"Existing shareholders have priority subscription rights (=the right to subscribe to shares before they are offered to anyone else).","definition[6]":"an amount of money that you pay regularly to be a member of an organization or to help it","synonym[0]":"DUES","example[17]":"his subscription for the Student Union","note[1]":"subscription for/to"}