{"word[0]":"pad","signpost[0]":"soft material","definition[0]":"a thick flat object made of cloth or rubber, used to protect or clean something, or to make something more comfortable","note[0]":"knee/elbow/shin/shoulder pad (=a pad that you wear to protect a part of your body when you are playing a sport)","example[0]":"Use an abrasive pad for stubborn stains.","example[1]":"Press on the wound with a large pad of cotton wool.","note[1]":"pad of","definition[1]":"several sheets of paper fastened together, used for writing or drawing","example[2]":"a pad of paper","example[3]":"a box of paints and a sketch pad","note[2]":"writing/sketch/memo/legal etc pad","example[4]":"Keep a telephone pad and a pen to hand.","signpost[1]":"flat ground","definition[2]":"a piece of flat ground where small aircraft can land","example[5]":"The hospital has built a helicopter pad.","note[3]":"launch/landing/helicopter pad","signpost[2]":"animal’s foot","definition[3]":"the flesh on the bottom of the foot of a cat, dog etc","signpost[3]":"apartment","definition[4]":"someone’s apartment or the room where they live","signpost[4]":"water plant","definition[5]":"the leaf of a water lily","definition[6]":"to walk softly and quietly","example[6]":"The cat came padding silently back to its home.","note[4]":"pad across/through/along etc","example[7]":"She padded barefoot down the stairs.","definition[7]":"to fill or cover something with a soft material in order to protect it or make it more comfortable","example[8]":"jackets padded out with a soft cotton filling","note[5]":"pad something with something","definition[8]":"to dishonestly make bills more expensive than they should be","example[9]":"padding the bills of Medicare patients","definition[9]":"to make a speech or piece of writing longer by adding unnecessary words or details","example[10]":"Don’t pad out your answer to make it seem impressive.","example[11]":"His autobiography is padded with boring anecdotes.","note[6]":"pad with","definition[10]":"several sheets of paper fastened together, used for making notes","example[12]":"Always have a pad and pen next to your telephone."}