{"word[0]":"repair to something","definition[0]":"to go to a place","example[0]":"Shall we repair to the drawing room?","display[0]":"repair","definition[1]":"to do some work on something that is damaged or not working properly, so that it is in good condition again","example[1]":"The builders are coming to repair the roof.","example[2]":"Have you had the washing machine repaired yet?","display[1]":"fix","definition[2]":"to repair something","example[3]":"I’m taking the car in to get it fixed.","example[4]":"The chain on the bike needs fixing.","display[2]":"mend","definition[3]":"to repair something that is damaged, torn, or not working","example[5]":"I’ve found someone who’ll mend the fence.","example[6]":"Can you mend this sweater for me?","example[7]":"Fishermen sat mending their nets in the sunshine.","display[3]":"service","definition[4]":"to check a vehicle or machine and repair it if necessary, especially regularly","example[8]":"You should have your car serviced every six months.","example[9]":"When was the last time we had the gas boiler serviced?","display[4]":"renovate","definition[5]":"to repair an old building so that it looks in good condition again","example[10]":"They bought an old house and renovated it themselves.","display[5]":"restore","definition[6]":"to repair something old and valuable, especially a building, piece of furniture, painting etc, so that it looks the same as it did originally","example[11]":"Many paintings were damaged in the fire but have now been restored.","example[12]":"The hotel was restored to its original Victorian splendour in 1984.","display[6]":"do up","definition[7]":"to repair an old building or vehicle, so that it looks in good condition again","example[13]":"He does up old cars and sells them.","example[14]":"A builder bought the house and fixed it up.","display[7]":"patch something up","definition[8]":"to quickly repair something that has a hole in it, by putting a piece of material on it, especially temporarily","example[15]":"They patched up the wall with bits of cement.","display[8]":"darn","definition[9]":"to repair holes in clothes","example[16]":"Are you any good at darning socks?"}