{"word[0]":"dictate","definition[0]":"to say words for someone else to write down","example[0]":"She’s dictating a letter to her secretary right now.","note[0]":"dictate a letter/memo etc to somebody","definition[1]":"to tell someone exactly what they must do or how they must behave","example[1]":"Federal funds have to be used as dictated by Washington.","example[2]":"The US government attempted to dictate the terms of the agreement.","example[3]":"The media cannot be allowed to dictate to the government.","note[1]":"dictate to","example[4]":"Can they dictate how the money will be spent?","note[2]":"dictate who/what/how etc","example[5]":"Islamic custom dictates that women should be fully covered.","note[3]":"dictate that","definition[2]":"to control or influence something","synonym[0]":"determine","example[6]":"The massive publicity dictated a response from the city government.","example[7]":"Funds dictate what we can do.","note[4]":"dictate what/how etc","example[8]":"The laws of physics dictate that what goes up must come down.","heading[0]":"– Meaning 3: to control or influence something","collocation[0]":"common sense dictates something","example[9]":"Common sense dictates that you should avoid too much sun.","collocation[1]":"circumstances dictate something","example[10]":"Circumstances dictated that I had to wait nearly two years.","collocation[2]":"custom/tradition dictates something","example[11]":"On the island, custom still dictates the roles of men and women.","collocation[3]":"fashion dictates something","example[12]":"Fashion has been dictating that women should wear black for years now.","collocation[4]":"logic dictates something","example[13]":"Logic dictates that this must be the right answer.","collocation[5]":"laws/rules dictate something","example[14]":"Federal laws dictate how land can be used.","definition[3]":"an order, rule, or principle that you have to obey","example[15]":"teenagers following the dictates of fashion","note[5]":"dictate of","example[16]":"When Laurie got back to the office, she dictated a letter to Stewart.","example[17]":"Individual EU countries are free to follow their own dictates on matters concerning the economy."}