{"word[0]":"maintain","signpost[0]":"make something continue","definition[0]":"to make something continue in the same way or at the same standard as before","example[0]":"Careers Officers maintain contact with young people when they have left school.","example[1]":"Britain wants to maintain its position as a world power.","example[2]":"A lot depends on building and maintaining a good relationship with your customers.","example[3]":"The hotel prides itself on maintaining high standards.","example[4]":"How can we maintain control of spending?","signpost[1]":"level/rate","definition[1]":"to make a level or rate of activity, movement etc stay the same","example[5]":"It is important to maintain a constant temperature inside the greenhouse.","example[6]":"This is the most efficient way to build up and maintain a reasonable level of physical fitness.","definition[2]":"to strongly express your belief that something is true","synonym[0]":"claim","example[7]":"He maintained his innocence and said the allegations were ‘ridiculous’.","note[0]":"maintain your innocence","example[8]":"Critics maintain that these reforms will lead to a decline in educational standards.","note[1]":"maintain (that)","signpost[2]":"look after something","definition[3]":"to keep a machine, building etc in good condition by checking and repairing it regularly","example[9]":"The report found that safety equipment had been very poorly maintained.","example[10]":"The company is responsible for maintaining public telephone boxes.","signpost[3]":"provide money/food","definition[4]":"to provide someone with the things they need, such as money or food","synonym[1]":"provide for","example[11]":"How can you maintain a family on $900 a month?","definition[5]":"to make something continue in the same way or at the same high standard as before","example[12]":"It is impossible to maintain exports at past levels.","example[13]":"To maintain sales growth, the company plans to unveil a new line of bicycles.","definition[6]":"to keep something such as a building or machine in good condition by taking care of it","example[14]":"They maintain the computer and telephone equipment in the building.","definition[7]":"to provide someone with money, food, and the other things they need","example[15]":"the ever-increasing cost of maintaining children"}