{"word[0]":"tired","definition[0]":"feeling that you want to sleep or rest","example[0]":"He looks tired out (=very tired).","example[1]":"‘No, ’ Frank said in a tired voice.","example[2]":"I’m so tired I could sleep for a week.","note[0]":"so tired (that)","example[3]":"He was too tired to argue.","note[1]":"too tired to do something","definition[1]":"familiar and boring","example[4]":"tired old speeches","heading[0]":"GRAMMAR: Prepositions with tired","explanation[0]":"If you are tired of doing something, you do not want to do it anymore because it has started to annoy or bore you","example[5]":"I’m tired of explaining it","bad_example[0]":"I’m tired from explaining it","explanation[1]":"If you are tired from doing something, you feel tired because you have used a lot of effort","example[6]":"He was tired from walking all day","bad_example[1]":"He was tired of walking all day","example[7]":"I was really tired the next day.","example[8]":"the tired faces of the children","example[9]":"I was exhausted after the long trip home.","example[10]":"He sat down, exhausted.","example[11]":"She immediately fell into an exhausted sleep.","display[0]":"worn out","definition[2]":"very tired because you have been working hard","example[12]":"With three small children to care for, she was always worn out.","display[1]":"weary","definition[3]":"tired because you have been travelling, worrying, or doing something for a long time","example[13]":"weary travellers","example[14]":"a weary sigh","example[15]":"He looks tired and weary after 20 years in office.","display[2]":"fatigued","example[16]":"They were too fatigued to continue with the climb.","example[17]":"Because of her illness, she often became fatigued.","display[3]":"drained","definition[4]":"very tired and feeling as if all your energy has gone","example[18]":"Afterwards, he felt drained, both physically and mentally.","display[4]":"bushed/beat","example[19]":"I’m bushed. I think I’ll go to bed early.","example[20]":"I’m beat. I don’t think I’ll go for a run tonight.","display[5]":"knackered","definition[5]":"very tired. Knackered is a very informal use – do not use it in polite conversation","example[21]":"By the time I got home I was absolutely knackered.","display[6]":"shattered","example[22]":"When I first started teaching, I came home shattered every night.","definition[6]":"extremely tired, so that you cannot do anything but sleep","example[23]":"I was absolutely dead by the time I got home.","heading[1]":"almost asleep","display[7]":"sleepy","definition[7]":"wanting to sleep very soon, so that your eyes start to close","example[24]":"I’m feeling quite sleepy. I think I’ll go to bed.","example[25]":"She rubbed her sleepy eyes.","display[8]":"drowsy","definition[8]":"starting to sleep because you are in a warm place, have drunk too much alcohol, or have taken medicine","example[26]":"The tablets can make you feel drowsy.","example[27]":"She was beginning to feel a little drowsy after all the food and wine she had consumed.","display[9]":"can’t keep your eyes open/can hardly keep your eyes open","definition[9]":"to feel so tired that you find it difficult to stay awake","example[28]":"I’d better get some rest – I can’t keep my eyes open.","example[29]":"He had been driving all night, and he could hardly keep his eyes open."}