{"word[0]":"over","signpost[0]":"above","definition[0]":"above or higher than something, without touching it","opposite[0]":"under","example[0]":"A lamp hung over the table.","example[1]":"She leaned over the desk to answer the phone.","example[2]":"The sign over the door said ‘Mind your head’.","example[3]":"We watched a helicopter flying low over the harbour.","signpost[1]":"covering","definition[1]":"on something or covering it","example[4]":"Over the body lay a thin white sheet.","example[5]":"She wore a large jacket over her sweater.","example[6]":"Mind you don’t spill coffee over my best tablecloth.","signpost[2]":"across","definition[2]":"from one side of something to the other side of it","example[7]":"Somehow the sheep had jumped over the fence.","example[8]":"The road over the mountains is steep and dangerous.","example[9]":"a bridge over the River Thames","example[10]":"Their house has a magnificent view over the bay.","signpost[3]":"on the other side","definition[3]":"on the opposite side of something from where you already are","example[11]":"There’s a bus stop just over the road.","example[12]":"They live over the river in Richmond.","signpost[4]":"down from something","definition[4]":"down from the edge of something","example[13]":"The car plunged over a cliff.","signpost[5]":"in many parts of something","definition[5]":"in or to many parts of a particular place, organization, or thing","example[14]":"He used to wander over the moors, losing all track of time.","example[15]":"They said they had cleaned up but there were bottles all over the place.","note[0]":"all over (something)","example[16]":"Scientists from all over the world gather here.","signpost[6]":"no longer affected","definition[6]":"if you are over an illness or a bad experience or situation, you are no longer affected by it","example[17]":"I think we’re over the worst of the crisis now.","example[18]":"He had a fever last night, but he seems to be over it now.","example[19]":"Sybil has never got over the shock of her mother’s death.","example[20]":"I’m over him now  (=I am no longer in love with him).","signpost[7]":"more than","definition[7]":"more than a particular number, amount, or level","example[21]":"The Japanese were producing over 100 million tons of steel.","example[22]":"toys suitable for children over the age of three","example[23]":"drivers who go over the speed limit","example[24]":"a social club for the over-60s","note[1]":"the over-30s/50s etc","signpost[8]":"during","example[25]":"Will you be home over the summer vacation?","example[26]":"Over a period of ten years he stole a million pounds from the company.","example[27]":"Can we talk about this over dinner?","signpost[9]":"concerning","definition[8]":"about a particular subject, person, or thing","example[28]":"He’s having problems over his income tax.","example[29]":"a row over public expenditure","example[30]":"There is concern over the bad image of the legal profession.","signpost[10]":"controlling","definition[9]":"in control of or influencing someone or something","example[31]":"Genghis ruled over an empire that stretched from Persia across to China.","example[32]":"She had great personal influence and power over her followers.","signpost[11]":"better","definition[10]":"used to say that someone or something is more successful or better than someone or something else","example[33]":"Ipswich’s 3–1 win over Manchester City","example[34]":"Can Labour maintain its lead over the Conservatives?","example[35]":"It has one great advantage over its rivals.","signpost[12]":"by telephone/radio","definition[11]":"using something such as a telephone or radio","example[36]":"I don’t want to talk about this over the telephone.","example[37]":"I heard the news over the radio.","signpost[13]":"louder than something","definition[12]":"making a sound louder than another sound","example[38]":"‘What?’ he yelled over the noise of the engine and the wind.","signpost[14]":"preferring","definition[13]":"if you choose one thing over another, you choose that thing rather than the other","example[39]":"What is your main reason for choosing one restaurant over another?","signpost[15]":"falling down","definition[14]":"from an upright position into a position of lying on a surface","example[40]":"He was so drunk he fell over in the road.","example[41]":"Mind you don’t knock the candle over.","example[42]":"Engineers are working to prevent the tower from toppling over.","signpost[16]":"bending/folding","definition[15]":"so that someone or something is no longer straight or flat, but is bent or folded in the middle","example[43]":"As Sheila bent over, a sudden pain shot up her back.","example[44]":"He folded the paper over and put it in his pocket.","definition[16]":"from one side of an object, space, or area to the other side","example[45]":"There are only three canoes so some people will have to swim over.","example[46]":"The wall was crumbling where children had climbed over.","example[47]":"I went over  (=crossed the room, street etc) to say hello, but Vincent didn’t recognize me.","example[48]":"We flew over to the US to visit my Aunt Polly.","note[2]":"over to","example[49]":"One of my cousins is coming over from France with his wife and daughter.","note[3]":"over from","example[50]":"Come over here and see what I’ve found.","definition[17]":"in a place that is on the other side of a space or area","example[51]":"Bill lives over on the other side of town.","example[52]":"She was standing over by the window.","example[53]":"Do you see that building over there?","signpost[17]":"in or to a place","definition[18]":"in or to a particular house, city etc","example[54]":"You really should come over and see our new house.","example[55]":"I spent the whole day over at Gabby’s place.","example[56]":"We could drive over to Oxford this afternoon.","signpost[18]":"finished","definition[19]":"if an event or period of time is over, it has finished","example[57]":"Is the meeting over yet?","example[58]":"I’m so glad the mid-term exams are over and done with.","note[4]":"over (and done) with","example[59]":"You’d better give them the bad news. Do it now – get it over with.","signpost[19]":"to the side","definition[20]":"towards one side","example[60]":"The bus pulled over to the side of the road.","example[61]":"Would you move over, so I can sit next to you.","signpost[20]":"giving","definition[21]":"from one person or group to another","example[62]":"The attacker was ordered to hand over his weapon.","example[63]":"Most of the money has been signed over to his children.","signpost[21]":"changing","definition[22]":"from one position or system to another","example[64]":"The guards change over at midnight.","example[65]":"We switched over from electricity to gas because it was cheaper.","signpost[22]":"turning","definition[23]":"so that the bottom or the other side of something can now be seen","example[66]":"Turn the box over and open it at that end.","example[67]":"Josh rolled over and went back to sleep.","definition[24]":"more than or higher than a particular number, amount, or level","example[68]":"Almost 40% of women are size 14 or over.","example[69]":"People earning £33,000 and over will pay the higher rate of tax.","signpost[23]":"very/too","definition[25]":"used before an adjective or adverb to mean ‘very’ or ‘too’","example[70]":"She didn’t seem over pleased when I asked her to wait.","example[71]":"Perhaps we were all over enthusiastic about the project.","signpost[24]":"remaining","definition[26]":"an amount of something that is over is what remains after some of it has been used","example[72]":"There should be some money over when I’ve paid all the bills.","example[73]":"There was a little food left over from the party.","signpost[25]":"covered","definition[27]":"used to show that something is completely covered with a substance or material","example[74]":"Most of the windows have been boarded over.","example[75]":"Parts of the river were iced over.","example[76]":"The door had been painted over with a bright red varnish.","note[5]":"over with","definition[28]":"above someone or something","example[77]":"We stood on the roof watching the planes fly over.","signpost[26]":"talking/thinking/reading","definition[29]":"in a detailed and careful way","example[78]":"After talking it over with my wife, I’ve decided to retire.","example[79]":"I’ll need time to read the contract over before I sign.","example[80]":"Think it over carefully before you make a decision.","signpost[27]":"again","definition[30]":"if you start or do something over, you do it again","example[81]":"I got mixed up and had to start over.","signpost[28]":"radio message","definition[31]":"used when communicating by radio to show that you have finished speaking","example[82]":"Are you hearing me loud and clear? Over.","definition[32]":"the period of time in the game of cricket during which six or eight balls are thrown by the same bowler in one direction","definition[33]":"too much","example[83]":"overpopulation","example[84]":"overcooked vegetables","example[85]":"overweight","definition[34]":"above; beyond; across","example[86]":"overhanging branches","example[87]":"overhead telephone wires","example[88]":"the overland route  (=not by sea or air)","definition[35]":"outer","example[89]":"an overcoat","definition[36]":"additional","example[90]":"We were working overtime (=working beyond the usual time)."}