{"word[0]":"rule","signpost[0]":"about what is allowed","definition[0]":"an official instruction that says how things must be done or what is allowed, especially in a game, organization, or job","example[0]":"the rules of the game","note[0]":"rule of","example[1]":"Under the rules, the company must publish its annual accounts.","note[1]":"under the rules/according to the rules","signpost[1]":"about what you should do","definition[1]":"what you should do in a particular situation, or a statement about this","example[2]":"There are no hard and fast rules (=clear and definite rules) about what to wear to classes.","example[3]":"The rule is: if you feel any pain you should stop exercising immediately.","example[4]":"There are two basic rules of survival.","signpost[2]":"normal/usual","definition[2]":"something that is normal or usually true","example[5]":"Early marriage used to be the rule in that part of the world.","example[6]":"A series of payments used to be the exception rather than the rule.","example[7]":"Unfortunately there is an exception to every rule.","example[8]":"As a general rule most students finish their coursework by the end of May.","note[2]":"as a (general) rule","definition[3]":"the government of a country or area by a particular group of people or using a particular system","example[9]":"the end of colonial rule","example[10]":"a period of military rule","example[11]":"direct rule from Westminster","example[12]":"the restoration of majority rule (=government by the party that most people have voted for) to Northern Ireland","example[13]":"people living under communist rule","note[3]":"under ... rule","signpost[3]":"in grammar/science etc","definition[4]":"a statement about what is usually allowed in a particular system, such as the grammar of a language, or a science","example[14]":"the rules of English punctuation","signpost[4]":"for measuring","definition[5]":"a ruler","collocation[0]":"break a rule","example[15]":"He had clearly broken the official rules.","example[16]":"Any one who violates this rule will be severely punished.","collocation[1]":"obey/follow a rule","example[17]":"She wasn’t going to obey their silly rules.","collocation[2]":"comply with/abide by/observe a rule","example[18]":"All members must comply with the rules of the organization.","example[19]":"There is little that one country can do if another fails to abide by the rules.","example[20]":"We expect you to observe the general rules of conduct as set out below.","collocation[3]":"stick to/go by the rules","example[21]":"We all have to stick to the rules.","collocation[4]":"make the rules","example[22]":"I’m only an assistant manager – I don’t make the rules.","collocation[5]":"the rule says ...","example[23]":"The rule says that you must be standing inside the line.","collocation[6]":"the rule stipulates that ...","example[24]":"The rules stipulate that clubs must field the strongest team available.","collocation[7]":"the rule prohibits/forbids something","example[25]":"The rule forbids women from becoming members of the club.","collocation[8]":"the rule requires (that) ...","example[26]":"School rules required all girls to tie back their hair.","collocation[9]":"the rule applies to somebody/something","example[27]":"Everyone thinks that the rule doesn’t apply to them.","collocation[10]":"play by the rules","example[28]":"The system works well enough — as long as everyone plays by the rules.","collocation[11]":"bend/stretch the rules","example[29]":"They bend the rules to suit themselves.","collocation[12]":"relax the rules","example[30]":"Britain relaxed its immigration rules.","collocation[13]":"tighten (up) the rules","example[31]":"The EU has tightened the rules on the quality of drinking water.","collocation[14]":"enforce a rule","example[32]":"The planning office does not always enforce its own rules.","collocation[15]":"flout a rule","example[33]":"The party continues to flout its own rules.","collocation[16]":"be bound by rules","example[34]":"Solicitors are bound by strict rules that regulate their professional conduct.","form[0]":"ADJECTIVES/NOUN + rule","collocation[17]":"strict","example[35]":"They have very strict rules about gambling.","example[36]":"The rules of the game are quite simple.","collocation[18]":"petty","example[37]":"There are hundreds of petty rules.","collocation[19]":"a school/prison/club etc rule","example[38]":"He had broken one of the school rules.","collocation[20]":"an unwritten rule","example[39]":"There’s an unwritten rule that you never call an actor before 10 a.m.","collocation[21]":"health and safety rules","example[40]":"You should follow any health and safety rules which apply to your workplace.","collocation[22]":"be against the rules","example[41]":"It was against the rules to talk in class.","collocation[23]":"the rules concerning/governing/relating to something","example[42]":"the rules governing food labeling","collocation[24]":"a change in the rules","example[43]":"I didn’t realise that there had been a change in the rules.","collocation[25]":"a breach of the rules","example[44]":"a serious breach of the rules","collocation[26]":"rules and regulations","example[45]":"The government keeps introducing more and more rules and regulations.","collocation[27]":"rules are rules","example[46]":"Rules are rules and you have to abide by them.","definition[6]":"an instruction that says what people are allowed to do or not allowed to do, for example in a game, school, or company","example[47]":"the rules of baseball","example[48]":"He disobeyed the school rules.","definition[7]":"an official rule that everyone in a country, city, or state must obey","example[49]":"It is against the law to carry a concealed weapon.","example[50]":"The law requires motorcyclists to wear helmets.","display[0]":"regulation","definition[8]":"an official rule or order, which is part of a set of rules made by a government or organization","example[51]":"the regulations for applying for a passport","example[52]":"building regulations","example[53]":"environmental regulations on air pollution","display[1]":"restriction","definition[9]":"an official rule that limits what people can do","example[54]":"new restrictions on immigration","example[55]":"The government is planning to impose regulations on the amount of alcohol you can bring into the country.","display[2]":"guidelines","definition[10]":"rules or instructions about the best way to do something","example[56]":"the Department of Health’s guidelines for a healthy diet","example[57]":"guidelines for classroom teachers","display[3]":"code","definition[11]":"a set of rules that people or organizations agree to obey but are not forced to obey","example[58]":"The school has a dress code for its students.","example[59]":"the company’s code of conduct","display[4]":"statute","definition[12]":"a law that has been officially approved by a parliament, council etc, and written down","example[60]":"The statute banned corporal punishment.","display[5]":"ordinance","definition[13]":"a law, made by a city or town, that forbids or restricts an activity","example[61]":"A local ordinance limited speed in the parks to ten miles an hour.","definition[14]":"to have the official power to control a country and the people who live there","example[62]":"Queen Victoria ruled England for 64 years.","example[63]":"African tribal societies were traditionally ruled by a council of elders.","example[64]":"He announced that henceforth he would rule by decree (=make all the important decisions himself).","example[65]":"Alexander the Great ruled over a huge empire.","note[4]":"rule over","signpost[5]":"control/influence","definition[15]":"if a feeling or desire rules someone, it has a powerful and controlling influence on their actions","example[66]":"the passion for power and success which rules her life","signpost[6]":"court/law","definition[16]":"to make an official decision about something, especially a legal problem","example[67]":"This part of the bill was ruled unconstitutional.","note[5]":"be ruled illegal/unlawful etc","example[68]":"The judge ruled that she should have custody of the children.","note[6]":"rule that","example[69]":"The Supreme Court has yet to rule on the case.","note[7]":"rule on","example[70]":"The tribunal ruled in her favour.","note[8]":"rule in favour of/against somebody/something","signpost[7]":"draw a line","definition[17]":"to draw a line using a ruler or other straight edge","example[71]":"Rule a line under each answer.","definition[18]":"an official instruction that says how things should be done or what is allowed","example[72]":"The phone companies are working under new rules now.","example[73]":"The company broke government rules to undercut other bids.","example[74]":"company rules and regulations regarding sexual harassment","definition[19]":"the government of a country by a particular group of people or using a particular system","example[75]":"a constitution that formally ended one-party rule","definition[20]":"to work less quickly or effectively than usual, but without breaking your employer’s rules, as a protest","example[76]":"The customs men are prohibited from striking, but some have worked to rule out of sympathy with the government workers.","definition[21]":"to be the normal or usual thing to happen in a situation","example[77]":"Monopoly business practices are the rule here and not the exception.","definition[22]":"to have the official power to control a country or organization","example[78]":"a country that has been ruled by a dictator for three decades","example[79]":"Each bank would be ruled by a mix of outside directors.","example[80]":"The board ruled that the contract was valid and should be honored.","note[9]":"rule (that)","example[81]":"The court had ruled against the use of any unpublished works.","note[10]":"rule against","example[82]":"a court decision to rule in favour of the company","note[11]":"rule in favour of"}