{"word[0]":"owe","definition[0]":"to need to pay someone for something that they have done for you or sold to you, or to need to give someone back money that they have lent you","example[0]":"How much do I owe you  (=often used to show that you want to pay for something)?","example[1]":"I owe my brother $50.","note[0]":"owe somebody money/£10 etc","example[2]":"I still owe you for the taxi.","note[1]":"owe somebody for something","example[3]":"the money owed to credit card companies","note[2]":"owe something to somebody","signpost[0]":"something done/given","definition[1]":"to feel that you should do something for someone or give someone something, because they have done something for you or given something to you","example[4]":"He asked for help from a colleague who owed him a favour.","example[5]":"Thanks a lot for being so understanding about all this – I owe you one (=used to thank someone who has helped you, and to say that you are willing to help them in the future)!","example[6]":"I owe Shaun a letter; I must write soon.","note[3]":"owe somebody a drink/letter etc","example[7]":"Let’s go and see Joe – he owes me!","note[4]":"owe somebody","signpost[1]":"help to achieve something","definition[2]":"to have something or achieve something because of what someone else has done","example[8]":"He probably owes his life to her prompt action.","definition[3]":"to know that someone’s help has been important to you in achieving something","example[9]":"He owes a great deal to his publishers.","example[10]":"‘I owe my parents a lot, ’ he admitted.","note[5]":"owe somebody a lot/owe somebody a great deal","example[11]":"I owe it all to you.","note[6]":"owe it all to somebody/owe everything to somebody","example[12]":"the debt that we owe to our teachers","note[7]":"owe somebody a debt (of gratitude)","signpost[2]":"good effect","definition[4]":"to be successful because of the good effect or influence of something or someone","example[13]":"Their success owes more to good luck than to careful management.","note[8]":"owe to","example[14]":"Pearson’s work owed much to the research of his friend, Hugh Kingsmill.","definition[5]":"to need to pay someone for something they have sold to you or because they have lent you money – used especially when talking about particular amounts of money","example[15]":"You owe me $50.","example[16]":"The football club still owes £2.3 million.","display[0]":"be in debt","definition[6]":"to owe money, especially to several different companies – used when talking about a person’s financial situation","example[17]":"She hates being in debt.","example[18]":"We started getting deeper and deeper into debt.","display[1]":"be overdrawn","definition[7]":"to owe an amount of money to your bank because you have taken more money out of an account than you have put in","example[19]":"He received a letter saying he was overdrawn.","example[20]":"The bank charged me even though I was only a few pence overdrawn.","display[2]":"have an overdraft","definition[8]":"to be overdrawn, with the agreement of your bank","example[21]":"When I finished college I had a big overdraft.","display[3]":"be in the red","definition[9]":"to have spent more money than you have","example[22]":"The firm is £190,000,000 in the red.","definition[10]":"to have not yet paid someone money you should pay them, or to have not yet paid back money you borrowed","example[23]":"She owes taxes for the past three years.","example[24]":"He owes the company $2000 for components it supplied.","note[9]":"owe somebody something (for something)","example[25]":"We still owe the builder for the work on the roof."}