{"word[0]":"trap","signpost[0]":"for animals","definition[0]":"a piece of equipment for catching animals","example[0]":"The only way to catch mice is to set a trap.","example[1]":"He stepped into a bear trap covered in snow.","signpost[1]":"clever trick","definition[1]":"a clever trick that is used to catch someone or to make them do or say something that they did not intend to","example[2]":"Police had set a trap for hooligans at the match.","note[0]":"lay/set a trap (for somebody)","example[3]":"Mr Smith has walked straight into a trap laid by the Tories.","note[1]":"fall/walk into a trap","signpost[2]":"bad situation","definition[2]":"an unpleasant or difficult situation that is difficult to escape from","example[4]":"Amanda felt that marriage was a trap.","example[5]":"people caught in the unemployment trap","note[2]":"debt/unemployment etc trap","definition[3]":"a vehicle with two wheels, pulled by a horse","definition[4]":"sandtrap","signpost[3]":"dog race","definition[5]":"a special gate from which a greyhound is set free at the beginning of a race","signpost[4]":"in a dangerous place","definition[6]":"to prevent someone from escaping from somewhere, especially a dangerous place","example[6]":"Twenty miners were trapped underground.","example[7]":"The building collapsed, trapping dozens of people in the rubble.","example[8]":"There’s no way out! We’re trapped!","explanation[0]":"Trap is often passive in this meaning","definition[7]":"to catch an animal or bird using a trap","signpost[5]":"catch somebody","definition[8]":"to catch someone by forcing them into a place from which they cannot escape","example[9]":"The police trapped the terrorists at a roadblock.","signpost[6]":"trick","definition[9]":"to trick someone so that you make them do or say something that they did not intend to","example[10]":"I was trapped into signing a confession.","note[3]":"trap somebody into (doing) something","signpost[7]":"crush","definition[10]":"to get a part of your body crushed between two objects","example[11]":"Mind you don’t trap your fingers in the door.","example[12]":"pain from a trapped nerve","signpost[8]":"gas/water etc","definition[11]":"to prevent something such as gas or water from getting away","example[13]":"solar panels that trap the sun’s heat"}