{"signpost[0]":"go past","definition[0]":"to come up to a particular place, person, or object and go past them","example[0]":"The crowd parted to let the truck pass.","example[1]":"He gave me a smile as he passed.","example[2]":"We passed a group of students outside the theatre.","example[3]":"I pass the sports centre on the way to work.","signpost[1]":"move/go","definition[1]":"to go or travel along or through a place","example[4]":"He passed along the corridor to a small room at the back of the building.","example[5]":"We passed through the gates into a courtyard behind.","example[6]":"We were just passing through (=travelling through a place) and thought we’d drop in to see you.","definition[2]":"to put something around, through, or across something else","example[7]":"He passed the rope carefully around the post.","signpost[2]":"road/river etc","definition[3]":"a road, river, or railway line that passes a place goes through or near the place","example[8]":"The road passes right through the town centre.","example[9]":"The main railway line passes just north of Manchester.","definition[4]":"to hold something in your hand and give it to someone else","example[10]":"Pass the salt, please.","example[11]":"Can you pass me that bag by your feet?","note[0]":"pass somebody something","example[12]":"She passed a cup of tea to the headmaster.","note[1]":"pass something to somebody","example[13]":"I passed the note back to her.","signpost[3]":"give information","definition[5]":"to give information or a job to another person so that they can deal with it","example[14]":"I’ll pass the information on to our sales department.","note[2]":"pass something (on/over/back) to somebody","example[15]":"They’ve passed the enquiry over to the police.","definition[6]":"if time passes, it goes by","example[16]":"The days passed slowly.","example[17]":"She became more ambitious as the years passed.","example[18]":"They sat in silence while the minutes passed.","example[19]":"Hardly a day passes without more bad news about the economy  (=there is bad news almost every day).","definition[7]":"if you pass time or pass your life in a particular way, you spend it in that way","example[20]":"We passed the winter pleasantly enough.","example[21]":"We played cards to pass the time (=to help us stop feeling bored).","signpost[4]":"exam/test","definition[8]":"to succeed in an examination or test","example[22]":"Did you pass all your exams?","example[23]":"He hasn’t passed his driving test yet.","example[24]":"She passed with flying colours (=got very high marks).","definition[9]":"to officially decide that someone has succeeded in an examination or test","example[25]":"The examiners will only pass you if they feel that you have done the work properly.","signpost[5]":"law/proposal","definition[10]":"to officially accept a law or proposal, especially by voting","example[26]":"Plans to extend the hotel have now been passed.","example[27]":"The motion was passed by 16 votes to 11.","example[28]":"The government has passed new legislation to protect consumers.","example[29]":"The United Nations Security Council has passed a resolution asking the two countries to resume peace negotiations.","example[30]":"The first Transport Act was passed in 1907.","note[3]":"pass a law/bill/act","definition[11]":"if a law or proposal passes an official group, it is officially accepted by that group","example[31]":"The bill failed to pass the House of Representatives.","definition[12]":"if something passes between people, they speak to each other or do something together","example[32]":"Please say nothing of what has passed here today.","example[33]":"A glance of recognition passed between them.","note[4]":"pass between","definition[13]":"to end or stop","example[34]":"After a couple of hours the storm passed.","example[35]":"The feeling of sickness soon passed.","definition[14]":"to kick, throw, or hit a ball to a member of your own team during a game","example[36]":"He passed to Beckham on the edge of the penalty area.","note[5]":"pass to","example[37]":"Are you allowed to pass the ball back to the goalkeeper?","signpost[6]":"more than","definition[15]":"to become more than a particular number or amount","example[38]":"The number of unemployed has passed the two million mark for the first time.","type[0]":"intransitive always + preposition","signpost[7]":"change control","definition[16]":"to change from being controlled or owned by one person to being controlled or owned by someone else","example[39]":"Control of these services has now passed into the hands of the local authorities.","example[40]":"The land will pass to my son when I die.","definition[17]":"to change from one state or condition into another","example[41]":"The chemical passes from a liquid to a solid state during the cooling process.","note[6]":"pass from/to","signpost[8]":"give no answer","definition[18]":"to give no answer to a question because you do not know the answer","example[42]":"‘Who won the World Cup in 1998?’ ‘Pass.’","signpost[9]":"not accept","definition[19]":"to not accept an invitation or offer","example[43]":"I’m afraid I’ll have to pass on that offer of coffee.","note[7]":"pass on","signpost[10]":"waste matter","definition[20]":"to let out a waste substance from your bladder or bowels","example[44]":"See your doctor immediately if you pass any blood.","example[45]":"He was having difficulty passing water (=letting out urine).","signpost[11]":"document","definition[21]":"an official piece of paper which shows that you are allowed to enter a building or travel on something without paying","example[46]":"The guard checked our passes.","example[47]":"They issued us with free passes to the theatre.","example[48]":"You can buy a cheap one-day bus pass.","definition[22]":"a successful result in an examination","opposite[0]":"fail","example[49]":"You will need at least three passes to get onto the course.","example[50]":"The pass mark (=the mark you need to be successful) is 55%.","example[51]":"Did you get a pass in English?","note[8]":"pass in","definition[23]":"when you kick, throw, or hit a ball to another member of your team during a game","example[52]":"That was a brilliant pass by Holden.","signpost[12]":"road/path","definition[24]":"a high road or path that goes between mountains to the other side","example[53]":"a narrow, winding mountain pass","signpost[13]":"stage","definition[25]":"one part of a process that involves dealing with the whole of a group or thing several times","example[54]":"On the first pass we eliminated all the candidates who didn’t have the right experience.","definition[26]":"a movement in which an aircraft flies once over a place which it is attacking","definition[27]":"if an official group passes a law, proposal etc, or it passes that group, it is accepted by them, especially by voting","example[55]":"Shareholders of Fibreboard Corp. narrowly passed a measure doubling the shares in the company’s employee stock option plan.","example[56]":"Congress this year will pass a bill giving banks permission to open branches nationwide.","example[57]":"Legislation similar to the anti-price-fixing bill passed the Senate last month.","definition[28]":"to succeed in an examination, test etc","example[58]":"Policyholders must pass a medical to qualify for lower insurance rates.","example[59]":"How could faulty valves have passed the inspections?","definition[29]":"to give someone a piece of information, knowledge, a message etc that has been received from someone else","example[60]":"The transmitters pass phone calls to and from cellular phones.","note[9]":"pass something to/onto etc","example[61]":"Firms can’t pass information onto third parties until it is released by the stockmarket’s own news service.","example[62]":"Employees were suspected of passing on confidential documents.","note[10]":"pass something on/along","definition[30]":"to go officially from one person’s control or ownership to someone else’s","example[63]":"Sales will be recognised when title  (=ownership) passes or when the contract is signed.","example[64]":"The property had passed to him after his father’s death.","definition[31]":"to fail to pay the DIVIDEND on a share (=the part of the profit paid to shareholders) in a particular period of time, usually because of financial difficulties","example[65]":"The steelwork group is passing its final dividend after profits plunged last year.","definition[32]":"if a particular date or time passes, or you pass it, it goes by and is in the past","example[66]":"The IRS will permit an extension of time for certain actions even after the deadline has passed.","definition[33]":"to go above a particular amount, number or level, as a total gradually increases","example[67]":"Aluminum prices passed $1 a pound last week, a rise of 43% since March.","example[68]":"Israel’s population passed the six million mark in 1999.","definition[34]":"a special document containing a person’s name and often their photograph, showing that they are allowed to enter a particular building, travel somewhere etc","example[69]":"Simply present your Executive Club card andboarding pass (=one that allows you to get on a plane) to receive a complimentary drink."}