{"word[0]":"grow","past_tense[0]":"grew","past_participle[0]":"grown","definition[0]":"to increase in amount, size, number, or strength","example[0]":"Support for Mr Thompson is growing.","example[1]":"A growing number of people are taking part-time jobs.","example[2]":"Fears are growing for the crew’s safety.","example[3]":"There is growing concern about climate change.","example[4]":"my growing interest in China","example[5]":"The economy has grown steadily.","note[0]":"grow rapidly/slowly/steadily","example[6]":"Sales of new cars grew by 10% last year.","note[1]":"grow by","example[7]":"The number of students at the college has grown from 200 to over 500.","note[2]":"grow from/to","example[8]":"a city that is still growing in size","note[3]":"grow in","example[9]":"Skiing has really grown in popularity.","definition[1]":"to make a business or part of a business bigger and more successful","example[10]":"We want to grow the export side of the business.","signpost[0]":"person/animal","definition[2]":"to become bigger, taller etc over a period of time in the process of becoming an adult","opposite[0]":"shrink","example[11]":"You’ve really grown since I last saw you.","example[12]":"Victor seemed to grow taller every day.","example[13]":"Stan grew two inches in six months.","note[4]":"grow 2 inches/5 cm etc","signpost[1]":"plants","definition[3]":"if plants grow, they exist and develop in a natural way","example[14]":"a tree which will grow well in most types of soil","example[15]":"The plants grow wild (=grow without anyone looking after them) by the river.","definition[4]":"to make plants or crops develop and produce fruit or flowers","example[16]":"Many families own plots of land to grow food.","example[17]":"Britain grows 6,000,000 tonnes of potatoes a year.","example[18]":"The growing season is from April to September.","signpost[2]":"hair/nails","definition[5]":"if you grow your hair or nails, you do not cut them","note[5]":"grow a beard/moustache","example[19]":"I’ve decided to grow my hair long.","definition[6]":"when hair or nails grow, they become longer","type[0]":"intransitive always + adj","definition[7]":"to change and become different quite slowly","example[20]":"The sound was growing louder.","example[21]":"Her tastes have changed as she’s grown older.","example[22]":"Donna has grown tired of being a model.","example[23]":"Gradually, Fiona’s eyes grew used to the darkness  (=she gradually became able to see a little better).","definition[8]":"to gradually change your opinions and have a feeling that you did not have before","example[24]":"After a while the kids grew to like Mr Cox.","note[6]":"grow to like/hate/respect etc","example[25]":"the city he had grown to love","definition[9]":"to gradually become better, bigger etc","example[26]":"She’s grown tremendously as a musician.","note[7]":"grow as","definition[10]":"to increase in amount, size, or degree","example[27]":"Seaman grew rapidly, becoming one of the largest advertisers in the New York area.","example[28]":"As the US starts to grow again, it will be a more attractive place in which to invest.","example[29]":"In the past 12 months, the labor force has grown by around 60,000.","definition[11]":"if you grow a business activity, you make it bigger"}