{"word[0]":"debt","definition[0]":"a sum of money that a person or organization owes","example[0]":"He had enough money to pay off his outstanding debts.","example[1]":"students who run up huge debts","example[2]":"She had debts of over £100,000.","note[0]":"debt of","definition[1]":"when you owe money to someone","opposite[0]":"credit","note[1]":"be heavily/deeply in debt (=owe a lot of money)","example[3]":"A rash business decision left him $600 in debt.","note[2]":"£200/$1,000 etc in debt","example[4]":"The club sank deeper into debt.","note[3]":"get/run/fall etc into debt","example[5]":"Nearly half the students said they were in debt.","note[4]":"in debt (to somebody)","example[6]":"The band will be in debt to the record company for years.","definition[2]":"the degree to which you have learned from or been influenced by someone or something else","example[7]":"Braque acknowledged his debt to Impressionist painting.","note[5]":"debt to","collocation[0]":"have debts","example[8]":"Fortunately, I have no debts.","collocation[1]":"run up debts","example[9]":"At that time he was drinking a lot and running up debts.","collocation[2]":"pay off a debt","example[10]":"The first thing I'm going to do is pay off my debts.","collocation[3]":"repay/settle a debt","example[11]":"He was hoping he would soon have enough money to settle his debts.","collocation[4]":"clear your debts","example[12]":"It took him three years to clear his bank debts.","collocation[5]":"service a debt","example[13]":"By then, she was borrowing more money just to service her debts.","collocation[6]":"write off/cancel a debt","example[14]":"The bank finally agreed to write off the debt.","collocation[7]":"be burdened with/saddled with debts","example[15]":"Many poor countries are saddled with huge debts.","collocation[8]":"reduce a debt","example[16]":"The programme aims to reduce the debt of the world's poorest countries.","form[0]":"ADJECTIVES/NOUN + debt","collocation[9]":"big/large","example[17]":"The debts got bigger and bigger.","example[18]":"Young people often leave university with huge debts.","collocation[10]":"unpaid/outstanding","example[19]":"The average outstanding debt on credit cards in Britain is now over £3,000.","collocation[11]":"heavy debts","example[20]":"The company wanted to reduce its heavy debts.","collocation[12]":"a bad debt","example[21]":"Companies lose millions of pounds each year from having to write off bad debts.","collocation[13]":"a bank debt","example[22]":"The company closed with bank debts of about £350 million.","collocation[14]":"the national debt","example[23]":"Their national debt is the third largest in the world.","definition[3]":"money that one person, organization, country etc owes to another","example[24]":"The country will not receive further funds after it failed to repay debts of $16 million.","example[25]":"The importer will have to settle his debt in the exporter’s currency.","example[26]":"Once we have cleared the debt (=paid it), we could buy a car with another loan.","definition[4]":"the state of owing money","example[27]":"Families in debt on their fuel bills are already choosing between heating and eating.","example[28]":"People with children are much more likely to get into debt than people without children.","example[29]":"He was so heavily in debt that he had to sell off his house and car.","definition[5]":"capital borrowed by a business or government organization on which it pays interest","example[30]":"We need to sell assets to reduce our debt.","example[31]":"This company has enormous cash flow and it should have no problem servicing its debt (=making interest payments on its debt).","example[32]":"If you possibly can, use the cash to pay down debt (=reduce the amount of debt owed).","example[33]":"We should now be able to get cheaper loans, retire our costliest debt (=repay loans) and improve our capital structure.","example[34]":"The IMF has failed to find money to help write off debts (=to no longer expect or demand repayment) of the poorest countries."}