{"word[0]":"Flash","definition[0]":"a type of cleaning substance for floors and other hard surfaces, sold in the UK as a liquid or powder","signpost[0]":"shine","definition[1]":"to shine suddenly and brightly for a short time, or to make something shine in this way","example[0]":"Lightning flashed overhead.","example[1]":"Red warning lights flashed on and off (=shone for a short time and then stopped shining).","example[2]":"Why is that guy flashing his headlights at me?","note[0]":"flash something into/at/towards somebody/something","signpost[1]":"pictures","definition[2]":"to be shown quickly on television, on a computer, or on a film","example[3]":"Images of the war flashed across the screen.","note[1]":"flash across/onto/past etc","signpost[2]":"show something quickly","definition[3]":"to show something to someone for only a short time","example[4]":"He flashed his identification card.","signpost[3]":"news/information","definition[4]":"to send news or information somewhere quickly by radio, computer, or satellite","example[5]":"Reporters at the scene flashed the news to their offices.","note[2]":"flash something across/to something","signpost[4]":"move quickly","definition[5]":"to move very quickly","example[6]":"A meteor flashed through the sky.","note[3]":"flash by/past/through","definition[6]":"if your eyes flash, they look very bright for a moment, especially because of a sudden emotion","example[7]":"Janet’s blue eyes flashed with anger.","note[4]":"flash with","signpost[5]":"sex organs","definition[7]":"if a man flashes, or if he flashes someone, he shows his sexual organs in public","signpost[6]":"time passing quickly","definition[8]":"if a period of time or an event flashes by or flashes past, it seems to end very quickly","example[8]":"Our vacation seemed to just flash by.","note[5]":"flash by/past","definition[9]":"a bright light that shines for a short time and then stops shining","example[9]":"Two flashes mean danger.","example[10]":"a brilliant flash of light","note[6]":"brilliant/blinding flash","example[11]":"A flash of lightning lit up the night sky.","note[7]":"flash of","signpost[7]":"camera","definition[10]":"a special bright light used when taking photographs indoors or when there is not much light","example[12]":"Did the flash go off?","signpost[8]":"bright colour/something shiny","definition[11]":"if there is a flash of something brightly coloured or shiny, it appears suddenly for a short time","example[13]":"The bird vanished in a flash of blue.","definition[12]":"a system of instructions for a computer that is used especially to make pictures on a website appear to move","example[14]":"Flash animation","definition[13]":"a quick look – used humorously","synonym[0]":"glimpse","definition[14]":"a small piece of coloured cloth worn on the shoulder of a military uniform","definition[15]":"looking very new, bright, and expensive – used to show disapproval","example[15]":"a big flash car","definition[16]":"liking to have expensive clothes and possessions so that other people notice you – used to show disapproval","example[16]":"Chris didn’t want to seem flash in front of his mates.","definition[17]":"a computer program that is used to design moving images, especially on websites"}