{"word[0]":"laugh","definition[0]":"to make sounds with your voice, usually while you are smiling, because you think something is funny","note[0]":"laugh your head off","example[0]":"Maria looked at him and laughed.","example[1]":"Tony was laughing so hard he had to steady himself on the table.","example[2]":"Nora laughed so much that she nearly cried.","example[3]":"He couldn’t help it; he burst out laughing (=suddenly started laughing).","example[4]":"He’s one of the few writers who can make me laugh out loud.","example[5]":"The kids tumbled around on the floor, laughing hysterically.","note[1]":"laugh heartily/uproariously/hysterically etc","example[6]":"‘I didn’t know what I was doing, ’ she said, laughing at the memory.","note[2]":"laugh at/about","definition[1]":"to say something in a voice that shows you are amused","example[7]":"‘You look ridiculous!’ Nick laughed.","collocation[0]":"burst out laughing","example[8]":"She looked at him and burst out laughing.","collocation[1]":"make somebody laugh","example[9]":"I like Ron, he makes me laugh.","collocation[2]":"begin/start to laugh","example[10]":"He suddenly began to laugh.","collocation[3]":"want to laugh","example[11]":"He was so earnest that I wanted to laugh.","collocation[4]":"try not to laugh","example[12]":"‘Are you all right?’ Amy said, trying not to laugh.","collocation[5]":"fall about laughing","example[13]":"He saw the look on my face and he just fell about laughing.","collocation[6]":"laugh hysterically","example[14]":"The people at the next table were laughing hysterically at us.","collocation[7]":"laugh heartily","example[15]":"Misha laughed heartily throughout the play.","collocation[8]":"laugh out loud/aloud","example[16]":"Some parts of the book were so funny that they made me laugh out loud.","example[17]":"The audience laughed its head off all the way through.","collocation[9]":"laugh till you cry/laugh till the tears run down your face","example[18]":"He leaned back in his chair and laughed till the tears ran down his face.","definition[2]":"to make sounds with your voice and move your face, because you think that something is funny","example[19]":"He looked so funny that we couldn’t stop laughing.","display[0]":"giggle","definition[3]":"to laugh quickly in a high voice, especially in a slightly silly way, or because you are nervous or embarrassed","example[20]":"A group of teenage girls were giggling in a corner.","example[21]":"She tends to giggle when she meets new people.","display[1]":"chuckle","definition[4]":"to laugh quietly, especially because you are thinking about or reading something funny","example[22]":"He was chuckling to himself over an article in the paper.","example[23]":"‘We used to get up to all kinds of mischief.’ She chuckled at the memory.","display[2]":"snigger","definition[5]":"to laugh quietly in an unkind or unpleasant way, for example when someone is hurt or embarrassed","example[24]":"Billy stood up and started to sing, and one or two people sniggered.","display[3]":"titter","definition[6]":"to laugh quietly in a high voice, especially about something that is rude or about sex, or is embarrassing for someone","example[25]":"As a nation we love to titter over politicians’ sex scandals.","example[26]":"schoolboys tittering over a magazine","display[4]":"roar with laughter","definition[7]":"to laugh very loudly, especially with a deep voice","example[27]":"I could hear my father roaring with laughter at something on TV.","display[5]":"shriek with laughter","definition[8]":"to laugh very loudly, especially with a high voice","example[28]":"Patsy chased him down the stairs, shrieking with laughter.","display[6]":"howl with laughter","definition[9]":"to laugh very loudly – used especially about a group of people laughing together","example[29]":"His plays have made audiences howl with laughter.","display[7]":"in stitches","definition[10]":"laughing so much that you cannot stop","example[30]":"It was such a funny film – it had us all in stitches.","display[8]":"guffaw","definition[11]":"to laugh very loudly and without trying to stop yourself","example[31]":"The audience guffawed at his nonstop jokes.","display[9]":"cackle","definition[12]":"to laugh loudly in an unpleasant way","example[32]":"The old woman cackled at the trouble she was causing.","definition[13]":"the act of laughing or the sound you make when you laugh","example[33]":"He gave a short laugh.","example[34]":"‘What a mess!’ she said, with a laugh.","note[3]":"with a laugh","definition[14]":"if something is a laugh, you have fun and enjoy yourself when you are doing it","example[35]":"We all went to the beach last night – it was a really good laugh.","example[36]":"The other campers were nice, and we had a great laugh together.","example[37]":"It was a great holiday with lots of laughs.","collocation[10]":"give/let out a laugh","example[38]":"She gave a loud laugh.","collocation[11]":"get a laugh","example[39]":"Most of his jokes didn’t even get a laugh.","collocation[12]":"get a laugh out of somebody","example[40]":"I always managed to get a laugh out of my audience.","collocation[13]":"have a laugh about/at/over something","example[41]":"The farmer had a good laugh at our attempts to catch the horse.","collocation[14]":"I could use a laugh","example[42]":"Tell me what she said - I could use a laugh.","form[0]":"ADJECTIVES/NOUN + laugh","collocation[15]":"a good laugh","example[43]":"We all got a good laugh out of it later.","collocation[16]":"a big laugh","example[44]":"There was a big laugh from the crowd.","collocation[17]":"a short/little/small laugh","example[45]":"He let out a nervous little laugh.","collocation[18]":"a loud/soft laugh","example[46]":"He let out a loud laugh when he heard what had happened.","collocation[19]":"a belly laugh","example[47]":"It’s the kind of comedy that raises a smile rather than a belly laugh.","collocation[20]":"a hearty laugh","example[48]":"With a hearty laugh, he began to tell the story.","collocation[21]":"a nervous laugh","example[49]":"‘Don’t be silly, ’ she said with a nervous laugh."}