{"word[0]":"familiar","definition[0]":"someone or something that is familiar is well-known to you and easy to recognize","example[0]":"a familiar tune","example[1]":"It was a relief to be back in familiar surroundings.","example[2]":"Beggars on the street are becoming a familiar sight.","example[3]":"This kind of situation was all too familiar (=very familiar) to John.","example[4]":"Her face seems vaguely familiar, but I can’t quite place her.","example[5]":"The voice on the phone sounded familiar.","note[0]":"look/sound familiar","example[6]":"The signs of drug addiction are familiar to most doctors.","note[1]":"be familiar to somebody","explanation[0]":"In everyday English, people often say that they know something rather than saying it is familiar:","definition[1]":"talking to someone as if you know them well although you do not","example[7]":"I thought he was being a bit familiar with my wife.","note[2]":"familiar with","definition[2]":"informal and friendly in speech, writing etc","example[8]":"The novel is written in an easy familiar style.","display[0]":"be familiar with something","definition[3]":"to have a good knowledge or understanding of something, because you have used it, read about it etc before","example[9]":"Before the interview, make sure you are familiar with the company’s main products.","example[10]":"It will take a little while to become familiar with the new software.","display[1]":"be used to something","definition[4]":"to have experienced something before, so that it no longer seems surprising, difficult, strange etc","example[11]":"I’m used to eating spicy food.","example[12]":"Jay found the job hard to begin with, but he soon got used to it.","example[13]":"Consumers have grown accustomed (=become accustomed)to having a lot of choice.","example[14]":"Our staff are accustomed to dealing with the needs of foreign clients.","display[2]":"be at home with something","definition[5]":"to feel happy and confident about doing or using something, especially because you have had a lot of practice","example[15]":"Tom’s lived in Moscow for 20 years and he’s completely at home with the language.","example[16]":"It takes a few weeks for people to feel at home with the system.","display[3]":"be comfortable with something/somebody","definition[6]":"to feel relaxed and not worried about doing something or being with someone","example[17]":"We’re all becoming increasingly comfortable with buying things online.","example[18]":"The activities are intended to help new students feel more comfortable with each other..","definition[7]":"a cat or other animal that lives with a witch and has magical powers"}