{"word[0]":"dilemma","definition[0]":"a situation in which it is very difficult to decide what to do, because all the choices seem equally good or equally bad","example[0]":"a moral dilemma","example[1]":"Many women are faced with the dilemma of choosing between work and family commitments.","example[2]":"I’m in a dilemma about this job offer.","note[0]":"in a dilemma","example[3]":"This placed Robert Kennedy in a dilemma.","collocation[0]":"be in a dilemma","example[4]":"After years of recession, the company was in a dilemma over its future.","collocation[1]":"face a dilemma/be faced with a dilemma","example[5]":"Women may still be faced with the dilemma of choosing between jobs and families.","collocation[2]":"pose/create a dilemma","example[6]":"The difficult economic situation poses a dilemma for investors.","collocation[3]":"put/place somebody in a dilemma","example[7]":"His divided loyalties placed him in a dilemma.","collocation[4]":"resolve/solve a dilemma","example[8]":"People often need help with resolving their dilemmas.","collocation[5]":"explain your dilemma","example[9]":"He explained his dilemma to me.","collocation[6]":"a difficult/serious dilemma","example[10]":"He was in a serious dilemma because neither option seemed very desirable.","collocation[7]":"a terrible dilemma","example[11]":"She was in a terrible dilemma because she loved both men.","collocation[8]":"a moral/ethical/political etc dilemma","example[12]":"Doctors face a moral dilemma over how long to prolong someone's life.","collocation[9]":"a personal dilemma","example[13]":"The men who were on strike faced a personal dilemma over whether to return to work.","collocation[10]":"a painful dilemma","example[14]":"She faced the painful dilemma of having to decide whether to tell the police about her son's crimes.","collocation[11]":"a common/familiar dilemma","example[15]":"Deciding whether to put an elderly parent in a nursing home is a common dilemma.","collocation[12]":"the central dilemma","example[16]":"The prime minister's central dilemma was whether war was justified.","collocation[13]":"a way out of a dilemma","example[17]":"There seemed to be no way out of the dilemma.","collocation[14]":"a solution to a dilemma","example[18]":"One possible solution to the dilemma may be to divide the money equally between the brothers."}