{"word[0]":"certain","definition[0]":"confident and sure, without any doubts","synonym[0]":"sure","example[0]":"I’m absolutely certain that I left the keys in the kitchen.","note[0]":"certain (that)","example[1]":"I felt certain that I’d passed the test.","example[2]":"I’m not certain when it will be ready.","note[1]":"certain who/what/how etc","example[3]":"Now, are you certain about that?","note[2]":"certain about/of","example[4]":"They were watching him. He was certain of it.","explanation[0]":"In everyday English, people usually say sure rather than certain: ","example[5]":"I’m sure I gave him the money.","definition[1]":"if something is certain, it will definitely happen or is definitely true","example[6]":"It now seems certain that there will be an election in May.","example[7]":"Many people look certain to lose their jobs.","example[8]":"It is wise to apply early to be certain of obtaining a place.","example[9]":"It’s not certain where he lived.","example[10]":"His re-election was considered virtually certain.","example[11]":"It is by no means certain that the deal will be accepted.","example[12]":"If they stayed in the war zone they would face certain death.","definition[2]":"used to talk about a particular person, thing, group of things etc without naming them or describing them exactly","example[13]":"The library’s only open at certain times of day.","example[14]":"I promised to be in a certain place by lunchtime.","example[15]":"There are certain things I just can’t discuss with my mother.","example[16]":"the expectation of a certain kind of behaviour","note[3]":"certain kind/type/sort","example[17]":"Extra funding may be available in certain circumstances.","note[4]":"in certain circumstances/cases etc","heading[0]":"– Meaning 2: if something is certain, it will definitely happen or is definitely true","collocation[0]":"it seems certain that …","example[18]":"It seemed certain that the other team would win.","collocation[1]":"somebody seems/looks/appears certain to do something","example[19]":"For a while the whole project looked certain to fail.","collocation[2]":"something is by no means certain","example[20]":"Victory was by no means certain for Smith.","collocation[3]":"something is far from certain","example[21]":"Success is far from certain.","collocation[4]":"fairly certain","example[22]":"Opposition to the changes is fairly certain.","collocation[5]":"almost/virtually certain","example[23]":"It is almost certain that she will be given a prison sentence.","example[24]":"Prices are virtually certain to increase.","collocation[6]":"certain death","example[25]":"If they stayed in the war zone, they faced almost certain death.","definition[3]":"if something is certain, you are completely sure that it will happen or is true","example[26]":"Success seems certain.","example[27]":"It is almost certain that there will be a change of government.","example[28]":"Nobody knows exactly who built the manor, but it is certain that an architect called John Sturges supplied the drawings.","display[0]":"definite","definition[4]":"if something is definite, it is certain because someone has officially stated that it will happen, is true etc","example[29]":"I hope you can give me a definite answer soon.","example[30]":"The wedding will be next summer but a definite date has not been arranged yet.","example[31]":"I’ve got a good chance of getting the job, but it’s not definite yet.","display[1]":"inevitable","definition[5]":"if something, especially something bad, is inevitable, it is certain to happen and you cannot do anything to prevent it","example[32]":"War now seems inevitable.","example[33]":"It was inevitable that he would find out her secret sooner or later.","example[34]":"Facial wrinkles are the inevitable result of aging.","display[2]":"be bound to","definition[6]":"if something is bound to happen, it is very likely to happen, especially because that is what usually happens in that kind of situation. Be bound to is less formal than certain and is very common in everyday spoken English","example[35]":"The kids are bound to be hungry when they get home – they always are.","example[36]":"My car broke down today. It was bound to happen sooner or later.","display[3]":"be assured of something","definition[7]":"to be certain to get something good, or to be successful","example[37]":"After the success of its recent single, the band is now assured of a contract with a major record company.","example[38]":"He is is virtually assured of becoming the next prime minister.","example[39]":"Our clients are assured of comfortable accommodation and the attention of our trained staff.","display[4]":"something is a foregone conclusion","definition[8]":"if something is a foregone conclusion, its result is certain even though it has not happened yet","example[40]":"They were winning by such a large margin that victory seemed to be a foregone conclusion.","example[41]":"Party members believe it is a foregone conclusion that he will resign.","definition[9]":"an amount of money that cannot be changed or have anything added to it","example[42]":"a written order requiring the importer to pay a sum certain in the exporter’s domestic currency"}