{"word[0]":"bend","past_tense[0]":"bent","definition[0]":"to move part of your body so that it is not straight or so that you are not upright","example[0]":"Lee bent and kissed her.","example[1]":"She bent her head.","example[2]":"Bend your knees, but keep your back straight.","example[3]":"Emma bent over to pick up the coins.","note[0]":"bend over","example[4]":"I bent down to lift the box off the floor.","note[1]":"bend down","example[5]":"He bent towards me and whispered in my ear.","note[2]":"bend towards/across etc","definition[1]":"to push or press something so that it is no longer flat or straight","example[6]":"You need a special tool to bend the steel.","definition[2]":"to become curved and no longer flat or straight","example[7]":"Several branches started bending towards the ground.","definition[3]":"when a road bends, it changes direction to form a curve","example[8]":"The road bends sharply to the left.","definition[4]":"a curved part of something, especially a road or river","example[9]":"The car came round the bend at a terrifying speed.","example[10]":"a sharp bend in the road","note[3]":"bend in","definition[5]":"an action in which you bend a part of your body","example[11]":"We started the session with a few knee bends to warm up.","collocation[0]":"a sharp/tight bend","example[12]":"That road sign means you are approaching a sharp bend.","collocation[1]":"a hairpin bend","example[13]":"The road wound up the mountain in a series of hairpin bends.","collocation[2]":"a slight/gentle/wide bend","example[14]":"Ahead of us there was a wide bend in the river.","collocation[3]":"a blind bend","example[15]":"Never overtake another car on a blind bend.","collocation[4]":"a left-hand/right-hand bend","example[16]":"Take the turning just after the left-hand bend in the road.","collocation[5]":"come around/round the bend","example[17]":"Suddenly a motorbike came around the bend at top speed.","collocation[6]":"round the bend","example[18]":"He rounded the bend much too fast."}