{"word[0]":"earth","signpost[0]":"world","definition[0]":"the planet that we live on","example[0]":"the planet Earth","example[1]":"The Earth revolves around the Sun.","note[0]":"the Earth","example[2]":"71% of the Earth’s surface is sea.","note[1]":"the Earth’s surface/atmosphere/crust etc","example[3]":"the origin of life on Earth","note[2]":"on Earth","signpost[1]":"soil","definition[1]":"the substance that plants grow in","example[4]":"a lump of earth","example[5]":"footprints in the wet earth","note[3]":"soft/bare/damp etc earth","definition[2]":"the hard surface of the world, as opposed to the sea or air","example[6]":"The earth shook.","example[7]":"They watched the kite fall back to earth.","definition[3]":"used in religion to refer to the time when people are alive as opposed to being in heaven or hell","example[8]":"Jesus’ time on earth","definition[4]":"a wire that makes a piece of electrical equipment safe by connecting it with the ground","signpost[2]":"animal’s home","definition[5]":"the hole where a wild animal such as a fox lives","heading[0]":"– Meaning 1: the planet that we live on","collocation[0]":"the Earth’s surface","example[9]":"Over seventy percent of the Earth’s surface is covered by ocean.","collocation[1]":"the Earth’s crust","example[10]":"Volcanoes and earthquakes occur where there is movement in the Earth’s crust.","collocation[2]":"the Earth’s core","example[11]":"The Earth’s inner core is almost entirely composed of iron.","collocation[3]":"the Earth’s mantle","example[12]":"the incredibly high temperatures and pressures deep within Earth’s mantle","collocation[4]":"the Earth’s atmosphere","example[13]":"The Earth’s atmosphere blocks off all radiation from space other than light and radio waves.","collocation[5]":"the Earth’s gravity","example[14]":"the continual pull of the Earth’s gravity on the Moon.","collocation[6]":"the Earth’s orbit","example[15]":"The rocket left the Earth's orbit and set off to Mars.","collocation[7]":"the Earth’s rotation","example[16]":"Has the Earth’s rotation always been the same?","collocation[8]":"the Earth’s axis","example[17]":"Over thousands of years, the direction of Earth’s axis slowly changes.","collocation[9]":"the Earth’s climate","example[18]":"The level of carbon dioxide in the atmosphere has an influence on the Earth’s climate.","collocation[10]":"orbit","example[19]":"The Earth orbits the Sun once a year, and the Moon orbits the Earth approximately every 27 days.","collocation[11]":"revolve/rotate","example[20]":"Because of the direction in which the Earth revolves, the sun always rises in the east and sets in the west.","collocation[12]":"go round/around","example[21]":"Why does the Earth goes around the Sun?","collocation[13]":"Planet Earth","example[22]":"the origin of life on Planet Earth","heading[1]":"– Meaning 2: the substance that plants grow in","example[23]":"The wheels got stuck in the soft earth.","example[24]":"It hadn’t rained for weeks and the earth was hard.","example[25]":"There were no flowers or grass, just bare earth.","collocation[14]":"fertile","example[26]":"This earth is not fertile enough to produce crops.","collocation[15]":"freshly-dug","example[27]":"The poppy seeds were planted in the freshly-dug earth.","collocation[16]":"moist/damp","example[28]":"I slipped on the damp earth and fell over.","collocation[17]":"a mound of earth","example[29]":"A mound of earth lay beside the grave.","collocation[18]":"a clod/clump of earth","example[30]":"The horse’s hooves kicked up great clods of earth.","display[0]":"Earth/the Earth","definition[6]":"the planet we live on – used especially when talking about this in relation to other planets and to space. Also used when talking about being on the ground as opposed to being in the sky","example[31]":"The Earth moves around the Sun.","example[32]":"The space shuttle returned to Earth safely.","example[33]":"It’s the highest mountain on Earth.","display[1]":"the world","definition[7]":"the planet we live on – used when talking about all the people, countries, places etc on it","example[34]":"He’s one of the richest men in the world.","example[35]":"Sir Francis Drake was the first Englishman to sail around the world.","definition[8]":"the solid dry part of the Earth’s surface","example[36]":"After weeks at sea, the sailors saw land.","display[2]":"the globe","definition[9]":"the world – used especially when you want to emphasize that something happens in or comes from every part of the world","example[37]":"a meeting of scientists from around the globe","example[38]":"There has been an increase in skin cancer across the globe.","example[39]":"The network is accessible from any point on the globe.","definition[10]":"to make electrical equipment safe by connecting it to the ground with a wire","example[40]":"Make sure that the machine is properly earthed."}